[
  {
    "source": "NullTX",
    "date": "2023-06-27T14:20:56.000Z",
    "title": "Innovative Use Cases From Sparklo (SPRK) Overshadows Stellar (XLM)",
    "url": "https://nulltx.com/innovative-use-cases-from-sparklo-sprk-overshadows-stellar-xlm/",
    "description": "As cryptocurrencies develop, more and more people are becoming involved. Emerging players are coming up with innovative strategies to get momentum and draw in new clients. Existing players seek to reach a bigger audience. Let&#8217;s talk about Stellar (XLM)&#8217;s current prices and how Sparklo, a fresh rival, is acquiring volume in its presale phase. Sparklo [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-27T14:30:03.000Z",
    "title": "Bitcoin Holders Expect Retrace, Will BTC Move Against Crowd Once Again?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-holders-expect-retrace-btc-against-crowd/",
    "description": "Data shows bearish sentiment has spiked among Bitcoin holders, something that could actually work in the favor of the asset&#8217;s price. Social Media Users Have Turned Bearish On Bitcoin As explained by the analytics firm Santiment, traders have come into the new week expecting the price of the cryptocurrency to retrace towards the $27,000 to $29,000 range. The relevant indicator here is the &#8220;social volume,&#8221; which measures the total number of social media text documents that are making mentions of a specific term or topic. Related Reading: Bitcoin Long-Term Holder Supply Stagnates At ATH, What Does This Mean? The text documents here refer to posts/threads sourced from various popular social media platforms like Reddit, Telegram, and Twitter. Something to keep in mind is that the metric only measures the unique number of such documents, meaning that regardless of whether a post mentions the term one time or five times, the contribution towards the social volume will still remain one unit. This indicator helps us gauge the amount of discussion that a topic is receiving across social media right now. It can also be used to measure the market sentiment if some specific terms are applied. To separate the Bitcoin discussions related to positive and negative sentiments, Santiment has taken the total social volume related to the cryptocurrency market and has then filtered it using terms like buy, bottom, and bullish for the former, and sell, top, and bearish for the latter. Here is a chart that shows the trend in the social volume of these terms over the past week or so: The value of the red sentiment seems to have been quite high in recent days &#124; Source: Santiment on Twitter As displayed in the above graph, the social volume related to negative sentiment has spiked recently. The positive sentiment, on the other hand, has remained at low values. This would suggest that the majority of the Bitcoin traders on social media are bearish on the asset and are expecting it to register a drawdown in the near future. Historically, BTC has tended to show price moves in the direction that the average investor isn&#8217;t expecting. The more heavily the crowd leans toward any particular side, the more the probability of such a reverse price move taking place becomes. From the chart, it&#8217;s visible that the bearish sentiment has seen multiple spikes during the last week as the latest rally in the cryptocurrency&#8217;s price above the $30,000 mark has occurred. Interestingly, one of these surges in the metric happened right before this rally started. The local top so far, however, also coincided with such a spike, but it&#8217;s also true that the positive sentiment was also elevated during it. Related Reading: XRP Traders Show Capitulation, Why This Could Be Bullish As the bullish calls are silent right now while the investors are engaging in bearish talks, it&#8217;s possible that Bitcoin could show a rise soon and go against what the majority sentiment has been. BTC Price At the time of writing, Bitcoin is trading around $30,700, up 15% in the last week. BTC has been mostly moving sideways recently &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T14:30:33.000Z",
    "title": "Tradecurve and Shiba Inu bullish trend analysis, Vechain up over 30%",
    "url": "https://www.crypto-news-flash.com/tradecurve-and-shiba-inu-bullish-trend-analysis-vechain-up-over-30/?utm_source=rss&utm_medium=rss&utm_campaign=tradecurve-and-shiba-inu-bullish-trend-analysis-vechain-up-over-30",
    "description": "With the global adoption of cryptocurrencies reaching new heights and more people than ever before embracing crypto, it&#8217;s now the best time to jump into altcoins. Analysts are constantly on the lookout for projects that can spike in value, and some of the most notable ones include Tradecurve, Shiba Inu, and VeChain. Join us today [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-27T14:30:55.000Z",
    "title": "Bullish Bitcoin Signal Flashing for the First Time Ever, According to InvestAnswers",
    "url": "https://dailyhodl.com/2023/06/27/bullish-bitcoin-signal-flashing-for-the-first-time-ever-according-to-investanswers/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/First-Time-Ever-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/First-Time-Ever-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/First-Time-Ever-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/First-Time-Ever-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/First-Time-Ever-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/First-Time-Ever-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/First-Time-Ever-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto strategist says that one Bitcoin (BTC) signal is flashing bullish for the first time in the crypto king&#8217;s history. The anonymous host of InvestAnswers tells his 444,000 YouTube subscribers that Bitcoin&#8217;s available supply for trade is declining ahead of a halving event for the first time. The available supply is a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/27/bullish-bitcoin-signal-flashing-for-the-first-time-ever-according-to-investanswers/\">Bullish Bitcoin Signal Flashing for the First Time Ever, According to InvestAnswers</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]