[
  {
    "source": "Decrypt",
    "date": "2024-02-16T09:01:02.000Z",
    "title": "Private Jet Pyjama Party, Rug Radio and Decrypt to Bring the Vibes in Paris",
    "url": "https://decrypt.co/217184/private-jet-pyjama-party-rug-radio-and-decrypt-to-bring-the-vibes-in-paris",
    "description": "As part of a long-term partnership, Rug Radio and PJPP will be hosting R HAUS, a collaborative space for creators in Paris."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-16T09:02:56.000Z",
    "title": "Impending Liquidity Crunch: Morgan Stanley Executive Warns of U.S. Stock Market Turbulence",
    "url": "https://www.cryptoglobe.com/latest/2024/02/impending-liquidity-crunch-morgan-stanley-executive-warns-of-u-s-stock-market-turbulence/",
    "description": "On February 15, during an appearance on Bloomberg TV, Lisa Shalett, the Chief Investment Officer (CIO) at Morgan Stanley Wealth Management, provided a comprehensive analysis of the current state of the U.S. economy and its implications for the stock market. Economic Conditions: A Closer Look Shalett began by addressing the overarching concerns surrounding economic conditions, […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-16T08:50:09.000Z",
    "title": "Phuket Celebrates Successful Conclusion of the Landmark B2GC",
    "url": "https://cryptodaily.co.uk/2024/02/phuket-celebrates-successful-conclusion-of-the-landmark-b2gc",
    "description": "Phuket Celebrates Successful Conclusion of the Landmark B2GC"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-16T09:02:13.000Z",
    "title": "Tim Beiko unveils Ethereum’s latest ACDE call insights",
    "url": "https://www.cryptopolitan.com/tim-beiko-unveils-ethereums-latest-acde-call/",
    "description": "In a recent series of social media posts, Tim Beiko, a prominent figure in the Ethereum ecosystem, provided significant insights into the latest developments from the All Core Devs Execution (ACDE) call. The discussions primarily revolved around the progress of various Ethereum Improvement Proposals (EIPs), particularly emphasizing EIP-2935 and its potential integration of Verkle trees. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-16T09:01:00.000Z",
    "title": "Tron Price Prediction 2024-2033: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2024-2033 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network. TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-16T08:58:35.000Z",
    "title": "Global Smart City Forum Launches in KSA with 100 Speakers",
    "url": "https://www.cryptopolitan.com/global-smart-city-forum-launches-in-ksa/",
    "description": "In an ambitious move towards urban innovation, Saudi Arabia recently inaugurated the first Global Smart City Forum, marking a significant milestone in its journey towards Vision 2030. The forum, organized by the Saudi Data and Artificial Intelligence Authority (SDAIA) in collaboration with the Ministry of Interior and the Ministry of Municipal and Rural Affairs, was [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-16T08:55:37.000Z",
    "title": "GoFundMe pulls plug on Tornado Cash legal fund",
    "url": "https://www.cryptopolitan.com/gofundme-on-tornado-cash-legal-fund/",
    "description": "Recently, crowdfunding platform GoFundMe has abruptly terminated a fundraiser to finance legal fees for Roman Storm and Alexey Pertsev, co-founders of the cryptocurrency mixer Tornado Cash. The move comes after the fundraiser garnered substantial support but was deemed to violate GoFundMe&#8217;s terms of service. GoFundMe fundraiser cancellation and reaction The fundraiser, initiated by Storm to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-16T08:50:32.000Z",
    "title": "Phuket Celebrates Successful Conclusion of the Landmark B2GC",
    "url": "https://www.cryptopolitan.com/phuket-celebrates-successful-conclusion-of-the-landmark-b2gc/",
    "description": "Phuket, Thailand, February 16th, 2024, Chainwire Ethereum’s Vitalik Buterin and Thai Minister Celebrate a Milestone Event in Thailand&#8217;s Blockchain Adoption The Blockchain to Government Conference (B2GC), a landmark event in Thailand&#8217;s blockchain evolution, concluded on a high note in Phuket. The government-backed conference, co-organized by the Digital Economy Promotion Agency (DEPA), the Electronic Transactions Development [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-16T08:47:45.000Z",
    "title": "MicroStrategy inches closer to S&P 500 inclusion",
    "url": "https://www.cryptopolitan.com/microstrategy-inches-closer-to-sp-500/",
    "description": "MicroStrategy, a prominent Bitcoin (BTC) corporate holder, is on the brink of eligibility for inclusion in the S&#38;P 500 index, a move that could revolutionize portfolio compositions across the investment landscape. The company&#8217;s recent market performance and its strategic focus on Bitcoin position it as a contender for this significant milestone. Market performance and eligibility [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-16T08:43:46.000Z",
    "title": "UK Grapples with AI Regulation Amid Growing Calls for Action",
    "url": "https://www.cryptopolitan.com/uk-grapples-with-ai-regulation/",
    "description": "In the bustling corridors of Westminster, a significant debate is underway concerning the future AI regulation. This emerging battleground is not centered on trivial matters but focuses on how the UK government intends to address what it perceives as a potential existential threat to society. With an increasing number of Members of Parliament voicing their [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-16T09:00:00.000Z",
    "title": "Analyst forecasts XRP dip before $22 rally, new AI crypto attracts whales",
    "url": "https://crypto.news/analyst-forecasts-xrp-dip-before-22-rally-new-ai-crypto-attracts-whales/",
    "description": "XRP&#8217;s dip is seen as a buy signal before the bull run; InQubeta emerges as a top AI altcoin pick. XRP has been on a downtrend in the macro market. However, one analyst believes this dip is a great buying&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-16T09:00:30.000Z",
    "title": "Bitcoin To Receive Monumental $150 Billion Inflow: Expert Reveals",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-monumental-150-billion-inflow/",
    "description": "At the Exchange ETF conference in Miami Beach, Matt Hougan, Chief Investment Officer at Bitwise Asset Management, and Ric Edelman, founder of the Digital Assets Council of Financial Professionals, engaged in a discussion with CNBC’s Bob Pisani on the future of spot Bitcoin ETFs and their integration within diversified portfolios. $150 Billion Ready To Enter The Bitcoin Rabbit Hole Ric Edelman cast a bold prediction about the future inflows into spot Bitcoin ETFs, foreseeing an unprecedented $150 billion by the end of 2025, up from the current $5 billion. He confidently stated, &#8220;I&#8217;m anticipating that by the time we get to the end of 2025, we&#8217;re talking two years, we&#8217;re gonna see total inflows of more than $150 billion. We&#8217;re only at $5 billion right now.&#8221; This represents a significant leap, signaling a transformative phase in cryptocurrency investment. The conversation then turned to the underlying factors expected to drive this surge. Edelman elaborated on the potential inflows from independent financial advisors, who currently manage about $8 trillion in assets. With three-quarters indicating a readiness to allocate to Bitcoin ETFs, according to recent industry studies, Edelman explained the math: &#8220;Do the arithmetic. $8 trillion, 77% and 2.5% is $150 billion worth of flows.&#8221; Related Reading: Bitcoin All-Time High Ahead: Historical Pattern Signals 50% Chance Of Reaching $100K By August Notably, this calculation only takes into account independent advisors, leaving out the substantial potential from wirehouses, regional broker-dealers, and institutional investors, as Edelman emphasized.  On a bullish note, Matt Hougan highlighted the enduring nature of investments in Bitcoin ETFs by financial advisors, contrasting with the speculative short-term trading often associated with cryptocurrencies. &#8220;The people who are buying Bitcoin ETFs now, the financial advisors, they make their allocations for the long term. Financial advisors are usually not short-term traders, they&#8217;re not speculating where Bitcoin will be next week. They make an allocation that they hold for 1 year, 3 or 5 years,&#8221; Hougan remarked. Independent advisors control $8 trillion in assets, and surveys show 77% of them want to add Bitcoin to their portfolios, aiming for an average allocation of 2-3%. This means we&#39;ll likely see $150 billion flowing into Bitcoin ETFs from advisors alone. H/T @RhinoBTCapp pic.twitter.com/jc0F98KBAL &#8212; Thomas &#124; heyapollo.com (@thomas_fahrer) February 14, 2024 BTC Price Could Reach $150,000 Delving into who is leading the charge in Bitcoin ETF investments, Hougan noted, &#8220;We are seeing a lot of flows from RIAs, we are seeing from family offices and we are seeing some people who rotate off from other products.&#8221; This trend points to a broadening acceptance and recognition of Bitcoin ETFs within the investment community. Edelman further bolstered his $150 billion inflow projection with the anticipated impact on Bitcoin&#8217;s price, suggesting it could reach $150,000 within two years due to the fixed supply and increasing demand dynamics. &#8220;This number excludes inflows from wirehouses, regional broker-dealers, and institutional investors,&#8221; he added, highlighting the conservative nature of his estimate. Related Reading: Bitcoin Price Rally To $75,000 Imminent Due To Massive Cup And Handle Pattern Hougan complemented the discussion by shedding light on the broader implications for the ETF and crypto markets, praising the regulated, efficient, and investor-friendly nature of Bitcoin ETFs. He pointed out, &#8220;ETFs are tracking prices well, investors have peace of mind with access to all the data and ETFs are simple and secure with low fees.&#8221; Both experts concurred on the strategic value of including spot Bitcoin ETFs in investment portfolios for diversification. Hougan summarized this sentiment, saying, &#8220;They see Bitcoin as a non-correlated asset that when used for rebalancing and managed professionally will not lead to any volatility for the portfolio.&#8221; Reflecting on the comparative success of Bitcoin ETFs against traditional gold ETFs, Hougan highlighted the competitive fee structure and the strong demand observed for the Bitwise Bitcoin ETF (NYSE:BITB). &#8220;With Bitwise charging 20 basis points, fees are half that of the largest gold ETF,&#8221; he noted, underscoring the financial efficiency and appeal of Bitcoin ETFs to a wide range of investors. At press time, BTC traded at $51,808. Featured image created with DALLE, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-16T08:40:05.000Z",
    "title": "Navigating the 2024 Crypto Galaxy: Stellar Altcoin Projects and Best Altcoin Tokens Lighting Up the Blockchain",
    "url": "https://www.crypto-news-flash.com/navigating-the-2024-crypto-galaxy-stellar-altcoin-projects-and-best-altcoin-tokens-lighting-up-the-blockchain/?utm_source=rss&utm_medium=rss&utm_campaign=navigating-the-2024-crypto-galaxy-stellar-altcoin-projects-and-best-altcoin-tokens-lighting-up-the-blockchain",
    "description": "<img width=\"1200\" height=\"684\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-16T112918.607-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-16T112918.607-1.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-16T112918.607-1-300x171.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-16T112918.607-1-768x438.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-16T112918.607-1-150x86.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-16T112918.607-1-450x257.png 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />In the ever-expanding universe of cryptocurrency, a diverse array of stars illuminates the blockchain sky, each contributing uniquely to the digital ecosystem&#8217;s evolution. As we navigate this galaxy, we encounter projects redefining the boundaries of technology, finance, and social interaction. These altcoin projects are beacons of innovation, providing solutions to real-world challenges. Several projects within [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-16T08:59:00.000Z",
    "title": "Breaking: Sullivan & Cromwell Heads To Become Binance’s Watchdog",
    "url": "https://coinedition.com/breaking-sullivan-cromwell-heads-to-become-binances-watchdog/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog.jpg 730w, https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/02/Sullivan-Cromwell-Heads-To-Become-Binances-Watchdog-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to the latest reports, the American multinational law firm Sullivan &#38; Cromwell is expected to be appointed Binance’s independent monitor after the crypto exchange’s $4.3 billion settlement with the U.S. government. Sources familiar with the matter reported that Sharon Cohen Levin, the law firm’s partner and former federal prosecutor, would likely lead the firm’s [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/breaking-sullivan-cromwell-heads-to-become-binances-watchdog/\">Breaking: Sullivan &amp; Cromwell Heads To Become Binance’s Watchdog</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]