[
  {
    "source": "Cointelegraph",
    "date": "2024-02-08T03:06:28.000Z",
    "title": " Bakkt, once touted as Bitcoin’s ‘savior,’ is running low on cash ",
    "url": "https://cointelegraph.com/news/bakkt-once-touted-bitcoin-savior-going-concern",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvM2ZiZjI3ZjItYjE5ZC00ZDhlLWIzZjItOWQyM2YzMTBjMDM1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The institutional digital asset trading platform unveiled in 2018 amid huge fanfare has just disclosed it “might not be able to continue as a going concern.”</p>\n                    <p><p>Crypto company Bakkt, backed by the Intercontinental Exchange (ICE) and launched in 2019 to a great deal of fanfare — has just warned it may not have enough cash to stay in business over the next 12 months.</p><p>On Feb. 7, Bakkt <a href=\"https://www.sec.gov/Archives/edgar/data/1820302/000182030224000011/bakkt-20230930.htm\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> an amendment to its quarterly report with the Securities and Exchange Commission, with one section on risk factors containing a warning that it may “not be able to continue as a going concern.”</p><p>Bakkt explained that it no longer believes its cash and restricted cash are sufficient to fund its operations over the next 12 months. </p><p><a href=\"https://cointelegraph.com/news/bakkt-once-touted-bitcoin-savior-going-concern\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-08T03:00:43.000Z",
    "title": "What Bitcoin’s trading patterns on centralized exchanges tell us about the market",
    "url": "https://cryptoslate.com/what-bitcoins-trading-patterns-on-centralized-exchanges-tell-us-about-the-market/",
    "description": "<p>Analyzing trading volumes across centralized exchanges (CEXs) allows us to understand trade distribution across various platforms and identify broader market trends. Knowing where Bitcoin is being traded and how much of it is being traded provides insights into market liquidity, investor sentiment, and the overall health of the trading environment. Tracking trading volumes is particularly [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/what-bitcoins-trading-patterns-on-centralized-exchanges-tell-us-about-the-market/\">What Bitcoin&#8217;s trading patterns on centralized exchanges tell us about the market</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T03:01:01.000Z",
    "title": "Streamlining GenAI Deployments – Cisco Introduces Motific for Rapid, Secure Solutions",
    "url": "https://www.cryptopolitan.com/genai-deployments-cisco-introduces-motific/",
    "description": "In a groundbreaking move for the realm of artificial intelligence deployment, Cisco has unveiled Motific, its pioneering Software-as-a-Service (SaaS) offering. This innovative product aims to transform the landscape of GenAI (Generative AI) deployments within organizations, marking a significant leap forward in the integration of AI technologies into various sectors. Born from Cisco&#8217;s incubation business, Outshift, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-08T03:00:19.000Z",
    "title": "Bitcoin Coinbase Premium Is Negative: What It Means For Price Recovery",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-coinbase-premium-negative-price-recovery/",
    "description": "Data shows the Bitcoin Coinbase Premium Gap is currently negative. Here&#8217;s what this could mean for the asset&#8217;s recent attempt at recovery. Bitcoin Coinbase Premium Gap Has Been Deep Red Recently An analyst in a CryptoQuant Quicktake post pointed out that the Coinbase Premium Gap has been negative recently. The &#8220;Coinbase Premium Gap&#8221; here refers to an indicator that tracks the difference between the Bitcoin prices listed on cryptocurrency exchanges Coinbase (USD pair) and Binance (USDT pair). When the value of this metric is positive, it means that the price listed on Coinbase is greater than that on Binance right now. Such a trend implies that the former platform is currently witnessing a higher buying pressure or a lower selling pressure than the latter. Related Reading: Microstrategy Buys More Bitcoin: Here’s How Much Profit It Holds Now On the other hand, the negative indicator suggests Coinbase is witnessing relatively high selling pressure as the price listed here is lower than on Binance. Now, here is a chart that shows the trend in the Bitcoin Coinbase Premium Gap over the last few years: Looks like the value of the metric has been quite red in recent days &#124; Source: CryptoQuant As displayed in the above graph, the Bitcoin Coinbase Premium Gap has plunged into negative values recently, implying that the selling pressure on Coinbase has risen. Earlier, the metric had a notable positive streak, and this run coincided with a rally in the cryptocurrency&#8217;s price. The asset fell as the indicator flipped towards red, suggesting increased selling pressure may have contributed. US-based institutional investors commonly use Coinbase, while Binance has a more global audience. As such, the Premium Gap can provide hints about American whales&#8217; buying or selling behavior. It would appear that these institutional players were buying during the recent rally, but as soon as they switched towards selling, the price suffered for it. The last bull market also saw significant buying pressure from these investors, while the bear market saw the indicator restricted to negative or neutral levels. Related Reading: XRP Buy Signal Goes Off, Analyst Says This Is How Long Uptrend Will Last Bitcoin has been trying to recover from its recent drawdown, but from the chart, it&#8217;s apparent that the Coinbase Premium Gap is still at deep red values. Thus, the fact that large American investors are falling behind in buying pressure may not bode well for this recovery attempt if the recent pattern followed by the metric is anything to go by. BTC Price Since the visit below the $39,000 level, Bitcoin has seen a notable rebound below the $43,000 mark. The chart below shows how the coin has performed over the past month. The price of the coin appears to have been consolidating sideways recently &#124; Source: BTCUSD on TradingView This recovery has stood so far, but given the negative Coinbase Premium Gap, the cryptocurrency may encounter some resistance soon. Featured image from Aleksi Räisä on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-08T02:41:23.000Z",
    "title": "Bitcoin Price Surges Past Resistance, Is This The Start of Fresh Uptrend?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-surges-44k/",
    "description": "Bitcoin price is gaining pace above the $44,000 resistance. BTC could rise further if it clears the $44,800 resistance zone in the near term. Bitcoin price was able to surpass the $43,400 and $43,500 resistance levels. The price is trading above $44,000 and the 100 hourly Simple moving average. There was a break above a major rising channel with resistance at $43,650 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could continue to move up if it clears the $44,800 resistance zone. Bitcoin Price Starts Fresh Increase Bitcoin price remained well-bid above the $42,500 level. BTC started a fresh increase above the $43,400 and $43,500 resistance levels. Besides, there was a break above a major rising channel with resistance at $43,650 on the hourly chart of the BTC/USD pair. The pair even surged above the $44,000 resistance zone. It traded to a new weekly high at $44,780 and is currently consolidating gains. It is trading above the 23.6% Fib retracement level of the upward move from the $42,767 swing low to the $44,780 high. Bitcoin is now trading above $44,000 and the 100 hourly Simple moving average. Immediate resistance is near the $44,800 level. The next key resistance could be $45,000, above which the price could start another decent increase. The next stop for the bulls may perhaps be $45,750. Source: BTCUSD on TradingView.com A clear move above the $45,750 resistance could send the price toward the $46,500 resistance. The next resistance could be near the $47,200 level. A close above the $47,200 level could push the price further higher. The next major resistance sits at $48,500. Downside Correction In BTC? If Bitcoin fails to rise above the $44,800 resistance zone, it could start a downside correction. Immediate support on the downside is near the $44,300 level. The first major support is $43,750 and the 50% Fib retracement level of the upward move from the $42,767 swing low to the $44,780 high. If there is a close below $43,750, the price could gain bearish momentum. In the stated case, the price could dive toward the $43,000 support. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $44,300, followed by $43,750. Major Resistance Levels – $44,800, $45,750, and $45,500."
  }
]