[
  {
    "source": "CoinDesk",
    "date": "2023-11-10T21:27:22.000Z",
    "title": "DeFi Platform Raft Suffers $3.3M Exploit, But Hacker Likely Takes a Loss on the Attack",
    "url": "https://www.coindesk.com/tech/2023/11/10/defi-platform-raft-suffers-33m-exploit-but-hacker-likely-takes-a-loss-on-the-attack/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Raft's R stablecoin lost its dollar peg, dropping as much as 50% in the immediate aftermath of the exploit."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-10T21:04:51.000Z",
    "title": "Getting Ready for Bitcoin's Catalysts",
    "url": "https://www.coindesk.com/consensus-magazine/2023/11/10/getting-ready-for-bitcoins-catalysts/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "How exchange-traded funds and futures contracts can reach TradFi and turbocharge the growth of crypto markets."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-10T21:21:25.000Z",
    "title": "Here We Go Again: Pet Rock JPEGs on Bitcoin, Ethereum Sell for Over $100K",
    "url": "https://decrypt.co/205540/pet-rock-jpegs-bitcoin-ethereum-sell-over-100k",
    "description": "EtherRock NFTs and Bitcoin Rock Ordinals are selling for six-figure sums, fueling hopes that another JPEG bull run is around the corner."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-10T21:27:37.000Z",
    "title": "Singapore startup dtcpay launches retail crypto payments system with Chinese partners",
    "url": "http://cointelegraph.com/news/singapore-startup-dtcpay-launches-retail-crypto-payments-system-with-chinese-partners",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/9975a67f-bc4a-4e02-81e8-48fc5f315cf7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Dtcpay, formerly Digital Treasures Center, is MAS-registered and already provides some point-of-sale and online crypto payment services.</p>\n                    <p><p>Singapore-based dtcpay is launching a payment system that will use fiat and cryptocurrencies for in-store and online payments. The company mentioned Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>), Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) and Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) in its <a href=\"https://dtcpay.com/transforming-the-future-of-payments-dtcpay-announces-partnership-with-fintech-leaders-platon-and-allinpay-international-2/\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>.</p><p>The company is partnering with open-source blockchain PlatON for privacy-protected digital infrastructure and Allinpay International to create smart terminals and a digital interface. Both PlatOn and Allinpay are based in China. Dtcpay and Allinpay are registered with the Monetary Authority of Singapore (MAS) as major payment institutions.</p><p>A spokesman for Allinpay parent company Tonghua International said:</p><blockquote>“This cooperation will […] Help merchants better adapt to the modern payment trend and meet the needs of young consumers.”</blockquote><p>Dtcpay will exchange fiat and crypto and onboard new cryptocurrencies in the new service. It already provides point-of-sale and online checkout. In September, dtcpay <a href=\"https://www.straitstimes.com/business/singapore-based-e-payments-firm-dtcpay-introduces-new-customer-verification-feature\" target=\"_blank\" rel=\"noopener nofollow\">concluded</a> a deal with London-based Sumsub to provide Know Your Customer services for the dtcpay digital wallet and <a href=\"https://dtcpay.com/jeripay-and-dtcpay-announce-groundbreaking-collaboration-to-revolutionize-retail-payments/\" target=\"_blank\" rel=\"noopener nofollow\">entered</a> into an agreement with Singapore POS provider Jeripay to provide crypto payment services on its 8,000-terminal network.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/businesses-accepting-crypto-payments-adoption\">Pay and dump? How businesses accepting crypto payments influence adoption</a></em></strong></p><p>Founded in 2019 and originally known as Digital Treasures Center, dtcpay <a href=\"https://cointelegraph.com/news/mastercard-adds-7-blockchain-startups-to-its-crypto-accelerator\">was selected to participate</a> in Mastercard’s Mastercard Start Path program for crypto and blockchain startups in November 2022. It received backing by the Pontiac Land Group real estate conglomerate in a pre-seed funding round in June.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Dtcpay last month raised $16.5 million in a pre-Series A round led by Kwee, the chairman of Pontiac Land. The investment will see some of Pontiac Land’s hotels soon accept payments in crypto: by <a href=\"https://twitter.com/zinnialee23?ref_src=twsrc%5Etfw\">@zinnialee23</a> <a href=\"https://t.co/D5vdnHBtYL\">https://t.co/D5vdnHBtYL</a></p>&mdash; Forbes Crypto (@ForbesCrypto) <a href=\"https://twitter.com/ForbesCrypto/status/1680985718544293888?ref_src=twsrc%5Etfw\">July 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Electronic payment is common in Singapore, which is considered <a href=\"https://cointelegraph.com/learn/an-overview-of-the-cryptocurrency-regulations-in-singapore-and-thailand\">to have progressive cryptocurrency</a> regulation, <a href=\"https://cointelegraph.com/news/singapore-to-require-crypto-firms-to-put-user-assets-into-trusts-by-year-end\">including consumer protection</a>. <a href=\"https://cointelegraph.com/news/coinbase-secures-payment-license-singapore\">Coinbase and</a> Ripple <a href=\"https://cointelegraph.com/news/ripple-approval-singapore-payments-license\">received major payment institution</a> licensing from MAS in October. The city-state is also experimenting with central bank digital currency, but the MAS has stated that <a href=\"https://cointelegraph.com/news/singapore-s-mas-says-no-urgent-case-for-retail-cbdc-but-launches-4-fast-trials-of-it\">it sees “no urgent use case”</a> for a retail CBDC.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/token2049-singapore-huobi-asia-express/\">Token2049 captivates Singapore, Huobi rebrands on 10th Anniversary: Asia Express</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-10T21:23:17.000Z",
    "title": "Solana price hits a new 2023 high — What’s behind the SOL rally",
    "url": "http://cointelegraph.com/news/solana-price-hits-2023-high-whats-behind-the-sol-rally",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/9841c88e-a0a8-463d-aaa5-f9c9481aafe0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>SOL hit its highest price since May 2022, possibly due to an uptick in DApp use and a few other key factors.</p>\n                    <p><p>Solana's native token (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) experienced an impressive 22% surge on Nov. 10, breaking past the $54 mark for the first time since May 2022. Notably, this surge occurred amid the <a href=\"https://cointelegraph.com/news/ftx-alameda-research-wallets-send-13-1-m-crypto-exchanges-overnight\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ftx-alameda-research-wallets-send-13-1-m-crypto-exchanges-overnight/amp\">continuous selling of SOL tokens by FTX's bankruptcy</a> estate. The Delaware Bankruptcy Court approved the sale of the failed exchange FTX assets, which included 55.75 million SOL in September 2023.</p><p>Investor enthusiasm for SOL's price increase may be attributed to the fact that some of the tokens from the bankruptcy proceedings are either vested or locked. Furthermore, there's a <a href=\"https://cointelegraph.com/news/solana-price-down-amid-ftx-liquidation-fears\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/solana-price-down-amid-ftx-liquidation-fears/amp\">weekly sale limit of $100 million</a> imposed as part of the FTX liquidation plan. In essence, the initial fear of asset liquidation has transformed into hope as investors realize the limited impact of the sales.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">FTX has been selling between 250k-700k <a href=\"https://twitter.com/search?q=%24SOL&src=ctag&ref_src=twsrc%5Etfw\">$SOL</a> every day for the last 2 weeks while price has either been going up or sideways.<br><br>so far its been getting absorbed like a champ and at current rate their unlocked tokens should be depleted within a week.<br><br>once this seller is gone i can… <a href=\"https://t.co/AtnTqz3uxG\">pic.twitter.com/AtnTqz3uxG</a></p>— Bluntz (@Bluntz_Capital) <a href=\"https://twitter.com/Bluntz_Capital/status/1722414938768146583?ref_src=twsrc%5Etfw\">November 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As trader and independent analyst 'Bluntz' aptly described the situation, SOL's resilience during the FTX bankruptcy token dump is impressive. The post on X, (formerly Twitter) adds a bullish case for SOL, stating, </p><blockquote>\"Once this seller is gone, I can only imagine how hard it's gonna pump.\"</blockquote><h2>SOL price has been fueled by solid demand for leverage longs</h2><p>SOL's substantial 39% weekly gains have pushed its futures open interest to $745 million, the highest level since November 2021 when SOL achieved its all-time high of $260. Still, in futures markets, leverage longs and shorts are constantly matched, so it's crucial to examine SOL's funding rate for a more nuanced perspective.</p><p>A positive funding rate indicates that longs (buyers) demand more leverage, while the opposite occurs when shorts (sellers) require additional leverage, resulting in a negative funding rate.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/35e9a616-de57-4c74-89ab-71c00e8e97de.png\"><figcaption style=\"text-align: center;\"><em>SOL futures average funding rate, 8-hour. Source: CoinGlass</em></figcaption></figure><p>SOL's current futures funding rate represents a 0.5% weekly cost for leverage longs, which is not excessive given the prevailing bullish momentum. Yet, this is a significant shift from the funding rate levels observed three weeks earlier when leverage shorts were paying for leverage use.</p><p>While it could be argued that SOL's rally was primarily driven by derivatives markets, there's solid evidence indicating growth in terms of deposits and the usage of decentralized applications (DApps) within the Solana ecosystem.</p><h2>Beyond derivatives, Solana's ecosystem shows solid growth</h2><p>Solana's total value locked (TVL), which measures the amount deposited in its smart contracts, has reversed its declining trend after six consecutive weeks.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/79bedd72-f886-49c6-9b5e-ce553c7e948c.png\"><figcaption style=\"text-align: center;\"><em>Solana network total value locked in SOL terms. Source: DefiLlama</em></figcaption></figure><p>Solana's DApps deposits have seen a 10% increase in the last three days. While the current 11.1 million SOL level is still below the 30 million SOL prior to the FTX exchange bankruptcy, this recent trend suggests that the worst period for the Solana network may be behind us.</p><p>To confirm that this movement isn't solely driven by a few large holders inflating TVL, it's essential to analyze the number of users employing active addresses as a proxy.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/3a325c2e-5f21-4ec6-9afb-83afaa254fdd.png\"><figcaption style=\"text-align: center;\"><em>Total DeFi active address in 30 days. Source: DappRadar</em></figcaption></figure><p>Solana now ranks as the fourth-largest blockchain in decentralized finance (DeFi) TVL, accompanied by a 28% growth in the number of active addresses. Interestingly, this surge in activity occurred while competitors experienced declines, with market leader Ethereum facing a 22% drop in DeFi active users, according to DappRadar.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/3-theses-will-impact-ethereum-bitcoin-next-bull-market\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/3-theses-will-impact-ethereum-bitcoin-next-bull-market/amp\"><strong><em>3 theses that will drive Ethereum and Bitcoin in the next bull market</em></strong></a></p><p>On one hand, SOL token bulls benefit from the increased network activity and higher TVL, while on the other hand, Solana's current market capitalization of $22.8 billion has surpassed Polygon's $7.8 billion by nearly threefold, despite both networks having comparable DeFi TVL. This has prompted investors to question the sustainability of SOL's bull run above $54.</p><p>Additionally, Solana protocol's accumulated 30-day fees amounted to $1.9 million, compared to Polygon's $1.6 million, according to DefiLlama. However, these figures pale in comparison to BNB Chain's $9.1 million, raising doubts about the valuation after SOL's recent rally.</p><p>As of now, there is no evident reason to bet against the trend, as there is no excessive leverage demand observed in SOL derivatives contracts. Nevertheless, the fundamentals hint at limited room for further upside.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-10T19:59:42.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "http://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Crypto lender Hodlnaut is officially entering liquidation, according to the company's interim judicial manager. Over $100 million in digital assets were transferred from a wallet belonging to crypto exchange Poloniex in what security firms believe to be a massive hack. Meanwhile, asset manager BlackRock has officially entered the race for a spot Ethereum exchange-traded fund (ETF) after a 19b-4 filing by Nasdaq was submitted to the securities regulator.</p><h3>Hodlnaut to enter liquidation</h3><p>The High Court of Singapore has ordered <a href=\"https://cointelegraph.com/news/hodlnaut-liquidation-failure-restructuring-sale-efforts\">the liquidation of Hodlnaut</a>, a digital asset lender that collapsed during crypto winter. </p><p>The announcement came from Aaron Loh Cheng Lee, Hodlnaut's former interim judicial manager, in a letter that was posted on the website of EY. He and fellow interim judicial manager Ee Meng Yen Angela were discharged from their position and appointed as liquidators. </p><p>Based in Singapore, Hodlnaut suspended deposits and withdrawals and withdrew its licensing application before federal regulators in August 2022. The decision to cease operations was due to \"recent market conditions,\" referring to crypto winter. </p><p>According to the Nov. 10 letter, Hodlnaut's creditors include 17,000 users. </p><h3>Poloniex exchange suffers $100M exploit, offers 5% bounty</h3><p>A crypto wallet belonging to the digital asset exchange Poloniex has experienced suspicious outflows, as seen on blockchain explorer Etherscan. Blockchain security firms believe that the company was breached, leading to as much as $100 million in crypto being drained by the attackers. </p><p>On Nov. 10, millions of crypto assets were transferred from an account labeled Poloniex 4 on Etherscan. Initial estimates of the losses were around $60 million. However, it was later determined that over $100 million was taken by the attackers.</p><p>According to blockchain security firm CertiK, the incident was likely a \"private key compromise.\" The security firm also noted that the funds have already been transferred to four externally owned accounts (EOAs), with some accounts being swapped into Ether (ETH).</p><p>While the exchange has not published an official statement yet, Justin Sun, who acquired the exchange in 2019, posted on X (formerly Twitter) that the team is already investigating the hacking incident. According to Sun, they will fully reimburse the users affected by the breach.</p><p>Sun also offered a 5% white hat bounty to the Poloniex hacker. The executive said that they will give the attacker seven days to return the funds before they start working with law enforcement authorities.</p><h3>BlackRock’s spot Ethereum ETF plan is confirmed after Nasdaq filing</h3><p>Blackrock’s plans for a spot Ethereum exchange-traded fund (ETF) <a href=\"https://cointelegraph.com/news/blackrock-enters-race-spot-ethereum-etf-nasdaq-filing\">has now been confirmed</a>, per a 19b-4 form filing submitted to the United States Securities and Exhange Commission on Nov. 9.</p><p>Nasdaq <a href=\"https://listingcenter.nasdaq.com/assets/rulebook/nasdaq/filings/SR-NASDAQ-2023-045.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> the 19b-4 form to securities regulator on behalf of the $9 trillion asset management firm for a proposed ETF called the \"iShares Ethereum Trust.\"</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">UPDATE: BlackRock <a href=\"https://twitter.com/hashtag/Ethereum?src=hash&amp;ref_src=twsrc%5Etfw\">#Ethereum</a> ETF confirmed. They just submitted a 19b-4 filing with Nasdaq <a href=\"https://t.co/pLhuhhK7jo\">pic.twitter.com/pLhuhhK7jo</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1722727779186119074?ref_src=twsrc%5Etfw\">November 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The move signals BlackRock’s intention to expand beyond Bitcoin with its ETF aspirations.</p><p>Earlier on Nov. 9, it emerged that <a href=\"https://cointelegraph.com/news/blackrock-ishares-ethereum-trust-registered-delaware#:~:text=BlackRock%20has%20registered%20an%20Ethereum,Commission%20for%20a%20Bitcoin%20ETF.\">BlackRock registered corporate entity</a> iShares Ethereum Trust in Delaware, the first hint that a spot Ethereum ETF filing could be imminent.</p><h3>BlackRock registers iShares Ethereum Trust</h3><p>U.S. asset manager BlackRock has made the first step in filing for a spot Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) ETF. </p><p>On Nov. 9, the asset manager <a href=\"https://cointelegraph.com/news/blackrock-ishares-ethereum-trust-registered-delaware\">registered an Ethereum trust</a> in the American state of Delaware, with Daniel Schweiger registered as the agent. According to his LinkedIn account, Schweiger is a managing director at BlackRock. The new entity is called iShares Ethereum Trust. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BlackRock has made first step towards filing for a spot Ether ETF. I just confirmed on the website myself. Nice catch by <a href=\"https://twitter.com/SummersThings?ref_src=twsrc%5Etfw\">@SummersThings</a> <a href=\"https://t.co/mLKIhKdiI6\">https://t.co/mLKIhKdiI6</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1722632267032613146?ref_src=twsrc%5Etfw\">November 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ether's price soared on the news, eclipsing $2,000 for the first time since April.</p><p>BlackRock appears to be broadening its efforts in the crypto space. In June, it registered its Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) trust <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">shortly before filing</a> with the U.S. Securities and Exchange Commission for a spot Bitcoin ETF. </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-10T19:31:53.000Z",
    "title": "Why is the crypto market up today?",
    "url": "http://cointelegraph.com/news/why-is-the-crypto-market-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2022-10/a633230d-3f9a-4749-8bab-017c4b9435a0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto market is up today as data reflects investors’ growing enthusiasm toward digital assets.</p>\n                    <p><p>The crypto market is up today as Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">XRP</a>), Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) and numerous altcoins rallied as investors’ positive sentiment toward crypto continues to rise. The positive growth was led by Ether, which hit a 6-month high after news that BlackRock’s spot <a href=\"https://cointelegraph.com/news/ethereum-price-hits-6-month-high-amid-black-rock-spot-etf-buzz-wheres-retail-demand\">Ethereum ETF</a> for the Nasdaq was confirmed.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/e974f43f-4922-46dd-86a0-81796324103b.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto performance map. Coin360</em></figcaption></figure><p>Let’s examine three major factors influencing today’s crypto market rally.</p><h2>Institutional investors and fund managers are looking to invest in Ether</h2><p>On Nov. 9, BlackRock’s plans for a <a href=\"https://cointelegraph.com/news/blackrock-enters-race-spot-ethereum-etf-nasdaq-filing\">spot Ether</a> exchange-traded fund (ETF) were confirmed through a 19b-4 form filing submitted to the United States Securities and Exchange Commission (SEC). After the confirmation, Ether price surged 12.2%, outperforming Bitcoin for the first time in months.</p><p>BlackRock's potential foray into the Ether market indicates that institutional investors are becoming more interested in the cryptocurrency market. Institutional involvement in the crypto market could lead to a significant influx of capital into the Ether market, further driving up prices.</p><p>In addition to BlackRock’s potential spot Ether ETF, Bloomberg analyst James Seyffart says at least five firms will try to win the SEC’s approval.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">There are 5 other live spot Eth filings that i&#39;m aware of:<a href=\"https://twitter.com/vaneck_us?ref_src=twsrc%5Etfw\">@vaneck_us</a> <a href=\"https://twitter.com/ARKInvest?ref_src=twsrc%5Etfw\">@ARKInvest</a>/ <a href=\"https://twitter.com/21Shares?ref_src=twsrc%5Etfw\">@21Shares</a> <a href=\"https://twitter.com/hashdex?ref_src=twsrc%5Etfw\">@hashdex</a> <a href=\"https://twitter.com/InvescoUS?ref_src=twsrc%5Etfw\">@InvescoUS</a>/ <a href=\"https://twitter.com/galaxyhq?ref_src=twsrc%5Etfw\">@galaxyhq</a> <br>andddd <a href=\"https://twitter.com/Grayscale?ref_src=twsrc%5Etfw\">@Grayscale</a>&#39;s filing to convert <a href=\"https://twitter.com/search?q=%24ETHE&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETHE</a>. <br><br>In no particular order.</p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1722728701400375447?ref_src=twsrc%5Etfw\">November 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/magazine/interview-2-years-after-john-mcafee-death-wife-janice-broke-still-grieving/\"><strong><em>Exclusive: 2 years after John McAfee’s death, widow Janice is broke and needs answers</em></strong></a></p><p>The <a href=\"https://cointelegraph.com/news/bitcoin-etf-will-drive-adoption-in-2024-mike-novogratz\">growing institutional interest</a> is improving sentiment across the market. Activity in the options market suggests that Ether’s outperformance is not just a one-off event and could continue in the near term. The Chicago Mercantile Exchange (CME), which major institutions utilize, surpassed Binance futures on Nov. 9 after $1 billion of open interest was wiped from the market.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We&#39;ve now been officially insitutionalized<br><br>Notable this major regime change happens on the day that Blackrock all but confirmed their ETF will be approved<br><br>Old guard market makers carried out in body bags in both options and perps this month<br><br>The king is dead long live the king <a href=\"https://t.co/vuYtIOPEmB\">https://t.co/vuYtIOPEmB</a></p>&mdash; JJ the Janitor (@JLabsJanitor) <a href=\"https://twitter.com/JLabsJanitor/status/1722720860644036962?ref_src=twsrc%5Etfw\">November 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Institutional investors are not the only group feeling optimistic about the crypto market. As measured by the Bitcoin <a href=\"https://cointelegraph.com/news/bitcoin-price-this-week-fear-26k-key-5-things\">Fear &amp; Greed Index</a>, improved sentiment can also be seen in retail, noting a 23-point increase over the last month. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/9fe8b840-7fd1-4359-a510-da05505aeccf.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Fear &amp; Greed Index. Source: Alternative.me</em></figcaption></figure><h2>Total value locked and trade volumes spike</h2><p>The positive sentiment in the crypto market is rippling throughout the ecosystem. Bitcoin and crypto market trading volume reached $44.1 billion on Nov. 9. The increase is the highest level of total trading volume since March 14.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/e3237aab-e83c-4cb0-a7a3-fb306eac2b10.png\"  /><figcaption style=\"text-align: center;\"><em>Total crypto market trading volume. Source: Newhedge</em></figcaption></figure><p>Trading volume is not the only metric that is breaking multiple-month highs. The total value locked (<a href=\"https://cointelegraph.com/explained/what-is-total-value-locked-tvl-in-crypto-and-why-does-it-matter\">TVL</a>) on Nov. 9 has reached its highest level since June 3. The TVL increase to $46.5 billion marks a 3.7% 24-hour increase. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/f8052243-be6b-455a-82e8-7d0a37ef3286.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto market TVL. Source: DefiLlama</em></figcaption></figure><p>There is optimism surrounding the increase in volume, which can help break November’s 2-year losing streak when it comes to returns.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/451f4c4a-05f3-4cac-abd1-f2e320665ea7.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin returns by month. Source: Newhedge</em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/is-it-altseason-altcoin-30-day-performance-and-total-market-cap-flash-bullish\"><strong><em>Is it altseason? Altcoin 30-day performance and total market cap flash bullish</em></strong></a></p><p>While Bitcoin and altcoins still have overhanging risk events that could impact the price, the increasing institutional interest and improved trading volumes are strong indications the bear market may have ended.</p><p>Overall, crypto markets are likely to continue to experience price volatility. While the positive institutional interest is providing a nice short-term bump in crypto prices, the market’s reaction to any new enforcement actions or an economic recession will be the true determinant of the direction the market chooses to take. </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision. </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-10T19:25:00.000Z",
    "title": "Mango Markets’ exploiter to face trial in April, and Coinflux shuts multichain: Finance Redefined",
    "url": "http://cointelegraph.com/news/mango-markets-exploiter-to-face-trial-in-april-and-coinflux-shuts-multichain-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/691b8182-573c-427b-9fdc-fb71d6318cac.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> The Mango Markets exploiter’s trial was first scheduled for December 2023; however, during one of the court hearings, the accused convinced the judge to delay the trials for a few months.</p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>The exploiter behind the $116-million theft of assets from Mango Markets will face trial in April next year after the accused convinced the judge to postpone the fraud trial to April 8, 2023. The Aave protocol had to pause multiple markets earlier after reports of a feature-related bug.</p><p>The Coinflux multichain protocol called ShuttleFlow is all set to wind down its services after two years. Meanwhile, the Proof of Stake Alliance published an updated version of the staking requirements earlier this week.</p><p>The top 100 DeFi tokens had an eventful week as the majority of the tokens recorded new multimonth highs, and the total value locked in DeFi protocols touched $56 billion for the first time in several months.</p><h2>Conflux multichain protocol shuts down after two years</h2><p>ShuttleFlow, the ecosystem multichain protocol operated and maintained by Conflux Foundation — also known as the Shanghai Tree-Graph Blockchain Research Institute — will shut down after two years. </p><p>The ShuttleFlow technology stack will be transferred to Web3 studio Zero Gravity, which will continue to develop the protocol under a new brand. “All user funds are secure and will be migrated from ShuttleFlow to Zero Gravity,” the project wrote, adding, “Users who have previously bridged through ShuttleFlow and completed the claim of their bridged assets on the destination chain do not need to undergo any additional operations for the migration.”</p><p><a href=\"https://cointelegraph.com/news/conflux-multichain-blockchain-protocol-shuts-down\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/conflux-multichain-blockchain-protocol-shuts-down/amp\"><strong>Continue reading</strong></a></p><h2>Aave pauses several markets after reports of a feature issue</h2><p>Decentralized finance (DeFi) protocol Aave paused several markets on Nov. 4 after receiving reports of an issue affecting “a certain feature,” according to a post on X. </p><p>The pause affects multiple networks, including Aave v2 Ethereum Market and certain assets on Aave v2 on Avalanche. In addition, certain assets on Polygon, Arbitrum and Optimism have been frozen.</p><p><a href=\"https://cointelegraph.com/news/aave-pauses-several-markets-feature-issue\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/aave-pauses-several-markets-feature-issue/amp\"><strong>Continue reading</strong></a></p><h2>Fraud trial of Mango Market’s exploiter behind alleged $116M theft pushed to April</h2><p>Lawyers representing the $116-million Mango Markets exploiter have convinced a judge to postpone the fraud trial until April 8, 2023. Avraham Eisenberg’s fraud trial was set to commence on Dec. 4. Still, several circumstances impacted his trial preparations, according to his lawyers, who filed a successful motion for a continuance with District Court Judge Arun Subramanian on Nov. 2.</p><p>“As discussed in today’s conference, the motion for continuance is GRANTED. Trial in this case will begin on April 8, 2024,” Subramanian stated in a Nov. 3 court filing.</p><p><a href=\"https://cointelegraph.com/news/fraud-trial-of-mango-markets-exploiter-postponed-to-april\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/fraud-trial-of-mango-markets-exploiter-postponed-to-april/amp\"><strong>Continue reading</strong></a></p><h2>Proof of Stake Alliance updates recommendations for staking providers</h2><p>The Proof of Stake Alliance (POSA), a nonprofit organization that represents firms in the crypto staking industry, published an updated version of its “staking principles” on Nov. 9</p><p>POSA represents 15 different firms in the staking industry — Alluvial, Ava Labs, Blockdaemon, Coinbase, Credibly Neutral, Figment, Infstones, Kiln, Lido Protocol, Luganodes, Methodic, Obol, Polychain, Paradigm and Staking Rewards.</p><p><a href=\"https://cointelegraph.com/news/proof-of-stake-alliance-updates-recommendations-staking-providers\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/proof-of-stake-alliance-updates-recommendations-staking-providers/amp\"><strong>Continue reading</strong></a></p><h2>DeFi market overview</h2><p>Data from <a href=\"https://pro.cointelegraph.com/users/sign_in?\">Cointelegraph Markets Pro</a> and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bullish week, with most tokens trading in green on the weekly charts. The total value locked into DeFi protocols jumped to $56.06 billion.</p><p>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-10T21:00:20.000Z",
    "title": "SafeMoon CEO John Karony’s bail postponed while courts assess level of flight risk",
    "url": "https://cryptoslate.com/prosecutors-block-safemoon-ceo-john-karonys-bail-request/",
    "description": "<p>According to court documents dated Nov. 9, a judge has partially granted U.S. prosecutors&#8217; request to counter the bail of John Karony, the CEO of crypto platform SafeMoon. A filing from New York prosecutors indicates that a Utah magistrate judge, Daphne A. Oberg, issued Karony&#8217;s release order on Nov. 8. Karony&#8217;s bail included a $500,000 [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/prosecutors-block-safemoon-ceo-john-karonys-bail-request/\">SafeMoon CEO John Karony&#8217;s bail postponed while courts assess level of flight risk</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-10T19:50:27.000Z",
    "title": "Binance to halt ruble deposits effective Nov. 15",
    "url": "https://cryptoslate.com/binance-halts-ruble-deposits-effective-nov-15/",
    "description": "<p>Binance, one of the world&#8217;s leading cryptocurrency exchanges, has announced it will halt Russian ruble (RUB) deposits, effective Nov. 15, 2023. According to the announcement, despite the cessation of deposits, withdrawals of Russian rubles will continue to be available until January 31, 2024, ensuring users have ample time to manage their holdings. Users holding a [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/binance-halts-ruble-deposits-effective-nov-15/\">Binance to halt ruble deposits effective Nov. 15</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-10T19:20:24.000Z",
    "title": "JPMorgan launches programmable payments on JPM Coin",
    "url": "https://cryptoslate.com/jpmorgan-launches-programmable-payments-on-jpm-coin/",
    "description": "<p>Wall Street giant JPMorgan has officially launched programmable payment functionality on its institutional blockchain platform, JPM Coin, according to Onyx head of coin systems Naveen Mallela. Mallela said the new solution is a &#8220;holy grail&#8221; for the JPM Coin platform and expects it to open a new frontier in digital finance. The bank announced the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/jpmorgan-launches-programmable-payments-on-jpm-coin/\">JPMorgan launches programmable payments on JPM Coin</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-10T20:17:28.000Z",
    "title": "CoinShares CSO Meltem Demirors on Crypto’s Current Surge: “The Season of the Most Hated Rally”",
    "url": "https://www.cryptoglobe.com/latest/2023/11/coinshares-cso-meltem-demirors-on-cryptos-current-surge-the-season-of-the-most-hated-rally/",
    "description": "Meltem Demirors, who is the CSO at European crypto investment firm CoinShares, opened her recent interview with CNBC by describing the ongoing crypto market rally as “the season of the most hated rally.” This characterization reflects the skepticism and mixed sentiments among traditional market commentators despite its upward trend since many people expected Bitcoin and […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-10T19:18:19.000Z",
    "title": "Solana Breaks $54, Cardano Sees Whale Activity Surge, and Other Highlights From Current Crypto Market Rally",
    "url": "https://www.cryptoglobe.com/latest/2023/11/solana-breaks-54-cardano-sees-whale-activity-surge-and-other-highlights-from-current-crypto-market-rally/",
    "description": "According to crypto analytics firm Santiment, Solana (SOL) has achieved a notable milestone by surpassing $54 for the first time since May 2022. This price surge has been accompanied by a spike in discussion rates, suggesting increased mainstream attention. Santiment notes that Solana is showing signs of decoupling from other assets, with funding rates being […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-10T19:35:06.000Z",
    "title": "What's on the Horizon for Pepe Coin (PEPE): A Major Bull Run?",
    "url": "https://cryptodaily.co.uk/2023/11/whats-on-the-horizon-for-pepe-coin-pepe-a-major-bull-run",
    "description": "Explore the dynamic world of Pepe Coin (PEPE) in our latest article, where we delve into its market potential and provide a comprehensive analysis of its technical indicators. From fundamental insights to price predictions, understand the bullish and bearish scenarios that shape PEPE's future in the crypto market. Join us as we navigate through the intriguing landscape of meme cryptocurrencies and their impact on the digital finance world"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-10T21:30:46.000Z",
    "title": "CME Bitcoin Futures Open Interest Climbs Past Binance, Indicating Growing Institutional Demand",
    "url": "https://news.bitcoin.com/cme-bitcoin-futures-open-interest-climbs-past-binance-indicating-growing-institutional-demand/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/cmegroup-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"CME Bitcoin Futures Open Interest Climbs Past Binance, Indicating Growing Institutional Demand\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/cmegroup-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cmegroup-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cmegroup-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cmegroup-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cmegroup-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cmegroup-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cmegroup.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The open interest for bitcoin futures on the CME Group has outstripped that of Binance&#x2019;s futures market, with the former reaching an open interest of $4.06 billion and the latter at $3.87 billion, as bitcoin&#x2019;s value climbs to new peaks. CME Leads Bitcoin Futures Rally as Open Interest Swells to $4.06 Billion The financial sector [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-10T20:30:02.000Z",
    "title": "Publicly-Listed Bitcoin Miner Bitdeer Expands Into AI With Nvidia",
    "url": "https://news.bitcoin.com/publicly-listed-bitcoin-miner-bitdeer-expands-into-ai-with-nvidia/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/deer-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Publicly-Listed Bitcoin Miner Bitdeer Expands Into AI With Nvidia\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/deer-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/deer-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/deer-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/deer-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/deer-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/deer-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/deer.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Several bitcoin mining enterprises are shifting their focus to artificial intelligence (AI) computing and cloud services. In a recent development, the publicly traded blockchain and high-performance computing company Bitdeer, disclosed its expansion into AI. This strategic move involves providing Nvidia-powered graphics processing unit (GPU) services. Bitdeer Joins Nvidia Partner Network, Eyes Asian Market for AI [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-10T19:30:41.000Z",
    "title": "Binance Launches Web3 Wallet to ‘Lower the Barrier’ for Self Custody",
    "url": "https://news.bitcoin.com/binance-launches-web3-wallet-to-lower-the-barrier-for-self-custody/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/856dbc60-40c0-412c-8464-1d8bc864382e-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance Launches Web3 Wallet to &#039;Lower the Barrier&#039; for Self Custody\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/856dbc60-40c0-412c-8464-1d8bc864382e-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/856dbc60-40c0-412c-8464-1d8bc864382e-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/856dbc60-40c0-412c-8464-1d8bc864382e-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/856dbc60-40c0-412c-8464-1d8bc864382e-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/856dbc60-40c0-412c-8464-1d8bc864382e-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/856dbc60-40c0-412c-8464-1d8bc864382e-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/856dbc60-40c0-412c-8464-1d8bc864382e.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Binance has announced the launch of a new &#8220;self-custody&#8221; Web3 wallet aimed at simplifying the user experience and protecting user funds when using decentralized apps. The wallet features multi-party computation (MPC) tech, which Binance alleges allows users to manage the wallet without memorizing or handling seed phrases. Binance Releases New Web3 Wallet Binance, one of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-10T20:33:30.000Z",
    "title": "Lords Committee Probes Copyright Challenges in AI Development",
    "url": "https://www.cryptopolitan.com/committee-probes-copyright-challenges-in-ai/",
    "description": "The House of Lords&#8217; Communications and Digital Committee has addressed concerns surrounding copyright issues in the development of Large Language Models (LLMs). This discussion sheds light on the clash between AI companies and creators over the concept of proprietary work and the alleged infringement of copyrighted content by LLMs. During a session chaired by Baroness ... <a title=\"Lords Committee Probes Copyright Challenges in AI Development\" class=\"read-more\" href=\"https://www.cryptopolitan.com/committee-probes-copyright-challenges-in-ai/\" aria-label=\"More on Lords Committee Probes Copyright Challenges in AI Development\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-10T20:26:47.000Z",
    "title": "Pharmaceutical Collaboration Unveils Multi-Billion Dollar Deal",
    "url": "https://www.cryptopolitan.com/pharmaceutical-collaboration-deal/",
    "description": "Bayer and Recursion Pharmaceuticals have restructured and expanded their collaboration, focusing on artificial intelligence (AI)-powered drug discovery with a newfound emphasis on cancer. The revised deal, potentially valued at $1.5 billion, will see the two companies engage in up to seven precision oncology projects. Bayer&#8217;s strategic move involves leveraging Recursion&#8217;s innovative drug discovery platform, integrating ... <a title=\"Pharmaceutical Collaboration Unveils Multi-Billion Dollar Deal\" class=\"read-more\" href=\"https://www.cryptopolitan.com/pharmaceutical-collaboration-deal/\" aria-label=\"More on Pharmaceutical Collaboration Unveils Multi-Billion Dollar Deal\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-10T20:15:51.000Z",
    "title": "Minister of Education Advocates for Open-mindedness on AI in Education at UNESCO",
    "url": "https://www.cryptopolitan.com/minister-of-education-advocates-for-ai/",
    "description": "Estonia&#8217;s Minister of Education and Research, Kristina Kallas from the Eesti 200 party, asserted the transformative potential of artificial intelligence (AI) in education during a working visit to the UNESCO education ministers&#8217; meeting at the 42nd General Conference in Paris. Minister Kallas addressed UNESCO member states, urging them to adopt an open-minded approach toward artificial ... <a title=\"Minister of Education Advocates for Open-mindedness on AI in Education at UNESCO\" class=\"read-more\" href=\"https://www.cryptopolitan.com/minister-of-education-advocates-for-ai/\" aria-label=\"More on Minister of Education Advocates for Open-mindedness on AI in Education at UNESCO\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-10T20:14:52.000Z",
    "title": "Bitcoin transaction fees experience a 150% increase",
    "url": "https://www.cryptopolitan.com/bitcoin-transaction-fees-150-increase/",
    "description": "Bitcoin transaction fees have undergone a remarkable surge, surpassing figures recorded just three days ago. This surge, observed on Thursday, November 9, 2023, at 9:52 a.m. Eastern Time, manifested in a high-priority transfer, formerly costing an average of $3.38, now demanding a fee of $8.46. This substantial increase aligns with a backlog exceeding 200,000 pending ... <a title=\"Bitcoin transaction fees experience a 150% increase\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-transaction-fees-150-increase/\" aria-label=\"More on Bitcoin transaction fees experience a 150% increase\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-10T20:06:53.000Z",
    "title": "Taiwan regulator awards its first security token license",
    "url": "https://www.cryptopolitan.com/taiwan-regulator-security-token-license/",
    "description": "Taiwan’s Financial Supervisory Commission (FSC) achieved a milestone by granting Cathay Securities the nation’s inaugural security token offering (STO) license. The “Sunshine Green Yield” STO, recently approved by regulators, boasts a six-year maturity, an initial annual interest rate of 3.5%, and an initial principal amount of 30 million New Taiwan dollars ($930,000). Taiwan regulator approves ... <a title=\"Taiwan regulator awards its first security token license\" class=\"read-more\" href=\"https://www.cryptopolitan.com/taiwan-regulator-security-token-license/\" aria-label=\"More on Taiwan regulator awards its first security token license\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-10T20:06:39.000Z",
    "title": "Bitcoin mining revenue reaches yearly high amid growing ETF anticipation",
    "url": "https://www.cryptopolitan.com/bitcoin-mining-revenue-reaches-yearly-high/",
    "description": "Bitcoin mining revenue has soared to unprecedented heights, outstripping even the lucrative days of the Ordinals frenzy earlier this year. On November 9, mining income reached about $42,386,514.038, propelled by a buoyant Bitcoin price, which climbed to over $37,000, according to data from Blockchain.com. However, this remarkable growth is closely linked to the burgeoning optimism ... <a title=\"Bitcoin mining revenue reaches yearly high amid growing ETF anticipation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-mining-revenue-reaches-yearly-high/\" aria-label=\"More on Bitcoin mining revenue reaches yearly high amid growing ETF anticipation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-10T20:04:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-10T19:56:28.000Z",
    "title": "Microsoft inks partnership with Photonic to push quantum computing",
    "url": "https://www.cryptopolitan.com/microsoft-inks-photonic-quantum-computing/",
    "description": "Quantum computing firm Photonic has recently emerged from stealth mode, successfully raising $100 million for its innovative all-silicon quantum computing platform. Notably, Microsoft is among the investors, forming a strategic partnership with Photonic to co-develop quantum networking solutions. Photonic’s unique approach to quantum computing is gaining recognition within the industry, with experts hailing it as ... <a title=\"Microsoft inks partnership with Photonic to push quantum computing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/microsoft-inks-photonic-quantum-computing/\" aria-label=\"More on Microsoft inks partnership with Photonic to push quantum computing\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-10T19:24:26.000Z",
    "title": "Coinbase introduces decentralized identity verification service",
    "url": "https://www.cryptopolitan.com/coinbase-identity-verification-service/",
    "description": "Coinbase, the largest U.S. exchange by trading volume, has launched a new service called Coinbase Verifications. The identity verification service enables over 100 million users to validate their account and country credentials on the blockchain. Announced Thursday, this initiative represents a significant step in decentralized identity technology. The service operates on Coinbase&#8217;s Layer 2 network, ... <a title=\"Coinbase introduces decentralized identity verification service\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-identity-verification-service/\" aria-label=\"More on Coinbase introduces decentralized identity verification service\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-10T20:38:03.000Z",
    "title": "China announces criminal penalties for theft of digital assets including NFTs",
    "url": "https://crypto.news/china-announces-criminal-penalties-for-theft-of-digital-assets-including-nfts/",
    "description": "The Chinese government has officially declared that the theft of digital collections, including NFTs, will be legally treated as property theft, signifying a significant shift in the nation's approach to digital asset regulation."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-10T19:37:57.000Z",
    "title": "FTX token and other Sam Coins surge after Bankman-fried’s conviction ",
    "url": "https://crypto.news/ftx-token-and-other-sam-coins-surge-after-bankman-frieds-conviction/",
    "description": "Altcoins linked to Sam Bankman-Fried see a significant surge, as the FTX token soared over 200% in a week."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-10T21:00:36.000Z",
    "title": "Bitcoin Ready To Take-Off? Analyst Who Predicted $37,000 Reveals What’s Next",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-37000-whats-next/",
    "description": "Bitcoin is still seeing an impressive run but speculations on where the asset is headed next are running wild. A crypto analyst has shared their own expectations for the leading cryptocurrency, considering both sides of the coin and the possible price marks it can achieve. Bitcoin Price Gunning For $40,000 In an extensive analysis, crypto analyst and trader FieryTrading has mapped out how the Bitcoin price could reach $40,000. The analysis which was posted on TradingView starting November 8 points out the fact that the BTC price has continued to trade in a tight bullish channel since October. Related Reading: $9 Trillion BlackRock Files Ethereum Spot ETF, What’s So Special About It? This was proven to be true when the price of the asset actually jumped above $37,000 later before the pullback to the mid-$36,000s. The steady recovery that has categorized Bitcoin dips since the rally began in October has been making higher lows, as the analyst points out. FieryTrading refers to this as something that shows that an asset is “classically getting ready for the next pump.” Further adding that: “I think that the same goes for BTC.” Source: Tradingview.com The analyst expects that Bitcoin will continue to move up in the coming, and their first target of $37,000 was already crushed on November 9. Then following this, the analyst expects “a retest of the top channel is to be expected as a confirmation of the break out.” Naturally, the price target for this resurgence has been placed at $40,000 by FieryTrading as long as the top of the channel mentioned has been hit. In a subsequent post, the analyst confirms that this has indeed happened. BTC Marks Time For Recovery In a November 9 update, FieryTrading revealed that Bitcoin has indeed hit the top of the channel which could lead to a rejection. However, the analyst explains that this rejection will only be temporary and could be followed by a breakout to the upside.  The chart marks a retracement after which, the price does move toward the $40,000 target. Related Reading: Countdown to Chaos: Ethereum Insider To Expose ETH Founders’ Fraud In Weeks However, it is not set in stone that a rally to $40,000 will take place, and like any analysis, there is always the risk of it being invalidated. FieryTrading points out that Bitcoin could see massive selling that could drag the price back down to $37,000. But even this does not deter the trader who believes &#8220;It&#8217;s healthy if the price retests the top resistance of the channel.” The latest update to the analysis acknowledges a deeper crash than expected but it seems the analyst’s forecast still holds. “Eyes open for V-shape bounce. Whipsaw longs &#38; shorts at the same time while keeping the trend intact,” FieryTrading says. BTC bulls hold $37,000 &#124; Source: BTCUSD on Tradingview.com Featured image from Investing News Network, chart from Tradingview.com &#160;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-10T20:00:40.000Z",
    "title": "CME Overtakes Binance In Bitcoin Futures: A New Era For Institutional Crypto Investments?",
    "url": "https://www.newsbtc.com/bitcoin-news/cme-overtakes-binance-in-bitcoin-futures-crypto-investments/",
    "description": "The Chicago Mercantile Exchange (CME) has recently clinched the title of the largest Bitcoin futures exchange by open interest, overtaking the renowned crypto exchange, Binance. Data from Coinglass reveals that CME&#8217;s open positions have reached roughly $4.04 billion across 108,900 Bitcoin contracts, accounting for 24.22% of the entire Bitcoin futures market. Open interest in the context of futures trading refers to the total number of outstanding derivative contracts, such as futures, that have not yet been settled. This metric is crucial as it indicates the market&#8217;s liquidity level and trading activity. Related Reading: Bitcoin On The Brink? Analyst Predicts Soaring Open Interest May Signal 20% Price Correction For BTC futures, it represents the total value of all positions yet to be closed, offering insights into market sentiment and investor behavior. The rise of CME to the top position signifies a notable shift in the market dynamics, indicating a growing preference among institutional investors for regulated derivatives products. Institutional Appetite For BTC And Implications For SEC Spot ETF Approvals Binance, once the leader in BTC futures open interest, now trails CME with $3.90 billion in open interest, comprising 23.37% of the total market. This change underscores a significant trend: institutional investors increasingly favor Bitcoin as an investment vehicle, as evidenced by entities like MicroStrategy. This enterprise software company, known for its substantial Bitcoin holdings, recently acquired an additional 155 BTC for $5.3 million. With Bitcoin&#8217;s current trading price above $37,000, MicroStrategy&#8217;s investment boasts roughly $1.1 billion in paper profits, underscoring the asset&#8217;s appeal to corporate investors. In October, @MicroStrategy acquired an additional 155 BTC for $5.3 million and now holds 158,400 BTC. Please join us at 5pm ET as we discuss our Q3 2023 financial results and answer questions about the outlook for #BusinessIntelligence and #Bitcoin. $MSTR https://t.co/w7eRUcGobi — Michael Saylor⚡️ (@saylor) November 1, 2023 The overtaking of Binance by CME in Bitcoin futures open interest has captured market participants&#8217; attention and raised crucial questions among regulatory observers. Related Reading: Crypto’s Current Climb: JPMorgan Suggests Rally May Be Reaching Its Peak Notably, Bloomberg Intelligence ETF research analyst James Seyffart, echoing sentiments from Will Clemente, has speculated on whether CME&#8217;s growing Bitcoin futures open interest might address the US Securities and Exchange Commission&#8217;s (SEC) concerns about market depth and potential manipulation in Bitcoin markets. Okay this is interesting&#8230; Does this constitute &#8216;market of significant size&#8217; now? haha https://t.co/eQb7QXvO3H — James Seyffart (@JSeyff) November 9, 2023 This shift in market leadership from a crypto exchange like Binance to a traditional and regulated derivatives marketplace like CME could signal a maturing BTC market. Such a development might influence the SEC&#8217;s stance on approving spot Bitcoin ETFs. Bitcoin Latest Price Action While CME is overthrowing Binance regarding Bitcoin&#8217;s open interest, the crypto asset has recently reclaimed its $37,000 zone in the past hours after retracing slightly below that price mark following the quick spike on Thursday. Notably, BTC currently trades for $37,350 at the time of writing, up by 2.1% in the past 24 hours and nearly 10% over the past 7 days. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-10T20:39:58.000Z",
    "title": "2024: Circle IPO in April, FTX 2.0 Launch in May, Ethereum 4844 Upgrade in Q1 – A Year of Crypto Milestones",
    "url": "https://www.crypto-news-flash.com/2024-circle-ipo-in-april-ftx-2-0-launch-in-may-ethereum-4844-upgrade-in-q1-a-year-of-crypto-milestones/?utm_source=rss&utm_medium=rss&utm_campaign=2024-circle-ipo-in-april-ftx-2-0-launch-in-may-ethereum-4844-upgrade-in-q1-a-year-of-crypto-milestones",
    "description": "<img width=\"957\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/FTX.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/FTX.jpg 957w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/FTX-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/FTX-768x385.jpg 768w\" sizes=\"(max-width: 957px) 100vw, 957px\" />Maxiport&#8217;s report highlights six potential events in the first half of 2024, including the expected approval of a spot Bitcoin ETF. The report underscores significant crypto market drivers, such as the upcoming Bitcoin halving, Ethereum&#8217;s Cancun-Deneb upgrade, and potential Fed rate cuts. This year of 2023 has been very exciting for the crypto market investors [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-10T19:50:33.000Z",
    "title": "XRP Rockets Towards 900% Rally: A Deja Vu of 2017’s Explosive Surge?",
    "url": "https://www.crypto-news-flash.com/xrp-rockets-towards-900-rally-a-deja-vu-of-2017s-explosive-surge/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-rockets-towards-900-rally-a-deja-vu-of-2017s-explosive-surge",
    "description": "<img width=\"1024\" height=\"682\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/XRP-RIPPLE-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/XRP-RIPPLE-1.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/XRP-RIPPLE-1-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/XRP-RIPPLE-1-768x512.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/XRP-RIPPLE-1-104x69.png 104w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />XRP has posted a one-month candle pattern similar to late 2017, where it broke out and recorded a 900% rally to set its all-time high. The pattern involves a breakout that the bears quickly sniff out before the crypto regains momentum towards the end of the year and shoots. XRP could record a 900% rally [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-10T21:39:00.000Z",
    "title": "CME Displaces Binance as the Top Bitcoin Futures Trading Platform",
    "url": "https://coinedition.com/cme-displaces-binance-as-the-top-bitcoin-futures-trading-platform/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"CME Displaces Binance as the Top Bitcoin Futures Trading Platform\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/CME-Displaces-Binance-as-the-Top-Bitcoin-Futures-Trading-Platform-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Binance CEO Changpeng Zhao has acknowledged the rise to the top of the Chicago Mercantile Exchange (CME) as the leading platform for Bitcoin Futures trading. Zhao considers the development an indication of U.S. institutions moving into crypto and questions how other countries may respond. Zhao posted on X (formerly Twitter) following reports that the CME [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/cme-displaces-binance-as-the-top-bitcoin-futures-trading-platform/\">CME Displaces Binance as the Top Bitcoin Futures Trading Platform</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-10T21:04:00.000Z",
    "title": "NFT Thieves To Serve Theft Sentences, Chinese Government Statement Reveals",
    "url": "https://coinedition.com/nft-thieves-to-serve-theft-sentences-chinese-government-statement-reveals/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/nft2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/nft2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/nft2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/nft2-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/nft2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/nft2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/nft2-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/nft2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/nft2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/nft2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/nft2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/nft2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/nft2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/nft2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/nft2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/nft2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/nft2-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Chinese government has published a legal commentary on the status of digital collectibles, including NFTs. The commentary, published on the China Court Network website, offers the official view on the implementation of theft sentences for offenders caught stealing digital collectibles.&#160; The text, as reported, stated that Chinese regulations classify digital collectibles in three different [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/nft-thieves-to-serve-theft-sentences-chinese-government-statement-reveals/\">NFT Thieves To Serve Theft Sentences, Chinese Government Statement Reveals</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-10T20:35:00.000Z",
    "title": "JPMorgan Launches Blockchain-Based Programmable Payments System",
    "url": "https://coinedition.com/jpmorgan-launches-blockchain-based-programmable-payments-system/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Wall-Streets-JPMorgan-Expanding-its-Presence-in-The-Blockchain.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Wall Street’s JPMorgan Expanding its Presence in The Blockchain\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Wall-Streets-JPMorgan-Expanding-its-Presence-in-The-Blockchain.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Wall-Streets-JPMorgan-Expanding-its-Presence-in-The-Blockchain-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Wall-Streets-JPMorgan-Expanding-its-Presence-in-The-Blockchain-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Wall-Streets-JPMorgan-Expanding-its-Presence-in-The-Blockchain-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Wall-Streets-JPMorgan-Expanding-its-Presence-in-The-Blockchain-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>JPMorgan launched a programmable payments system using blockchain that would allow companies to make payments automatically.  According to Bloomberg, JPMorgan Chase and Co.’s new programmable system would give clients the opportunity to plug in conditions for funds to be moved to cover overdue payments and margin calls. Before this new feature, reports showed that clients [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/jpmorgan-launches-blockchain-based-programmable-payments-system/\">JPMorgan Launches Blockchain-Based Programmable Payments System</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-10T19:59:00.000Z",
    "title": "Ethereum (ETH) Rallies On BlackRock ETF Filing: Next Stop $2500?",
    "url": "https://coinedition.com/ethereum-eth-rallies-on-blackrock-etf-filing-next-stop-2500/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Bullish-momentum-anticipates-to-propel-Ethereum-towards-1200.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethereum Rallies On BlackRock ETF Filing\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Bullish-momentum-anticipates-to-propel-Ethereum-towards-1200.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Bullish-momentum-anticipates-to-propel-Ethereum-towards-1200-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Bullish-momentum-anticipates-to-propel-Ethereum-towards-1200-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Bullish-momentum-anticipates-to-propel-Ethereum-towards-1200-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Bullish-momentum-anticipates-to-propel-Ethereum-towards-1200-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Bullish-momentum-anticipates-to-propel-Ethereum-towards-1200-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>After enduring a series of bashings from the crypto community, Ethereum (ETH) finally broke out and jumped above the $ 2,000 psychological resistance. The price rise was connected to the disclosure that leading investment firm BlackRock had filed for an ether ETF. The development resulted in an increased demand for ETH, thereby positively impacting the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ethereum-eth-rallies-on-blackrock-etf-filing-next-stop-2500/\">Ethereum (ETH) Rallies On BlackRock ETF Filing: Next Stop $2500?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-10T19:36:00.000Z",
    "title": "47 Tax Authorities Commit to Crypto-Asset Reporting Framework",
    "url": "https://coinedition.com/47-tax-authorities-commit-to-crypto-asset-reporting-framework/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"47 Tax Authorities Commit to Crypto-Asset Reporting Framework\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-regulation-3-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>47 Tax Authorities Commit to Crypto-Asset Reporting Framework</p>\n<p>The post <a href=\"https://coinedition.com/47-tax-authorities-commit-to-crypto-asset-reporting-framework/\">47 Tax Authorities Commit to Crypto-Asset Reporting Framework</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-10T21:00:34.000Z",
    "title": "Under-the-Radar Altcoin Explodes by More Than 711% in the Past Two Weeks Amid New Perpetual Contract Listings",
    "url": "https://dailyhodl.com/2023/11/10/under-the-radar-altcoin-explodes-by-more-than-711-in-the-past-two-weeks-amid-new-perpetual-contract-listings/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/nearly-two-weeks-perceptual.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/nearly-two-weeks-perceptual.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/nearly-two-weeks-perceptual.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/nearly-two-weeks-perceptual.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/nearly-two-weeks-perceptual.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/nearly-two-weeks-perceptual.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/nearly-two-weeks-perceptual.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An under-the-radar altcoin has exploded by more than 711% in the past two weeks amid a couple of new perpetual contract listings and a favorable crypto market environment. Gas (GAS), the utility token for the smart contract platform NEO (NEO), is trading at $23.14 at time of writing, up from $2.85 two weeks ago. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/10/under-the-radar-altcoin-explodes-by-more-than-711-in-the-past-two-weeks-amid-new-perpetual-contract-listings/\">Under-the-Radar Altcoin Explodes by More Than 711% in the Past Two Weeks Amid New Perpetual Contract Listings</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-10T20:55:01.000Z",
    "title": "Crypto Analyst Pegs Bitcoin (BTC) Bull Market Progress, Says Litecoin (LTC) Could Be Facing ‘New Resistance’",
    "url": "https://dailyhodl.com/2023/11/10/crypto-analyst-pegs-bitcoin-btc-bull-market-progress-says-litecoin-ltc-could-be-facing-new-resistance/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/02/extreme-bullish-case-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/02/extreme-bullish-case-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/02/extreme-bullish-case-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/02/extreme-bullish-case-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/02/extreme-bullish-case-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/02/extreme-bullish-case-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/02/extreme-bullish-case-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader says Bitcoin (BTC) has officially broken out from an accumulation range. Pseudonymous crypto analyst Rekt Capital tells their 366,900 followers on the social media platform X that BTC is now approaching the bull market&#8217;s first major resistance. &#8220;Several months later and BTC has completely broken out from its Accumulation Range This Accumulation [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/10/crypto-analyst-pegs-bitcoin-btc-bull-market-progress-says-litecoin-ltc-could-be-facing-new-resistance/\">Crypto Analyst Pegs Bitcoin (BTC) Bull Market Progress, Says Litecoin (LTC) Could Be Facing ‘New Resistance’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-10T19:45:47.000Z",
    "title": "UK Law Enforcement Works With Kraken To Recover Nearly $2,320,000 Worth of Stolen Crypto for Fraud Victims",
    "url": "https://dailyhodl.com/2023/11/10/uk-law-enforcement-works-with-kraken-to-recover-nearly-2445000-worth-of-stolen-crypto-for-fraud-victims/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/uk-law-works-kraken.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/uk-law-works-kraken.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/uk-law-works-kraken.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/uk-law-works-kraken.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/uk-law-works-kraken.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/uk-law-works-kraken.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/uk-law-works-kraken.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Police officers in the UK targeting cross-border crimes say that they have worked with US-based digital asset exchange Kraken to return the stolen assets of crypto theft victims. According to the South East Regional Organised Crime Unit (SEROCU), Wybo Wiersma, from the Netherlands, created the fraudulent website iotaseed.io to generate what his victims believed were [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/10/uk-law-enforcement-works-with-kraken-to-recover-nearly-2445000-worth-of-stolen-crypto-for-fraud-victims/\">UK Law Enforcement Works With Kraken To Recover Nearly $2,320,000 Worth of Stolen Crypto for Fraud Victims</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-10T19:41:33.000Z",
    "title": "The Dogefather? Biopic of Dogecoin Fan Elon Musk Reportedly in Works at Major Hollywood Studio",
    "url": "https://dailyhodl.com/2023/11/10/the-dogefather-biopic-of-dogecoin-fan-elon-musk-reportedly-in-works-at-major-hollywood-studio/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/elon-down-eat-tv.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/elon-down-eat-tv.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/elon-down-eat-tv.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/elon-down-eat-tv.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/elon-down-eat-tv.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/elon-down-eat-tv.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/elon-down-eat-tv.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A biopic about longtime Dogecoin (DOGE) proponent and billionaire Elon Musk is reportedly in the works at a major movie studio. According to a new report by Variety, a film about the business magnate is in development at A24 Films, with Darren Arosfksy as its director. Arosfksy is known for directing hits such as Black [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/10/the-dogefather-biopic-of-dogecoin-fan-elon-musk-reportedly-in-works-at-major-hollywood-studio/\">The Dogefather? Biopic of Dogecoin Fan Elon Musk Reportedly in Works at Major Hollywood Studio</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]