[
  {
    "source": "Cointelegraph",
    "date": "2023-08-16T18:30:00.000Z",
    "title": "Fantom DEX rescued at eleventh hour following planned shutdown",
    "url": "https://cointelegraph.com/news/fantom-dex-rescued-at-eleventh-hour-following-planned-shutdown",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/6dec692b-97fc-45f5-8f14-3a07e9ae49a5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>SpiritSwap previously had its entire treasury drained due to the ongoing Multichain exploit.</p>\n                    <p><p>SpiritSwap, a decentralized exchange (DEX) on Fantom, will no longer shut its doors in September after having treasury funds stuck on troubled cross-chain protocol Multichain.</p><p>In an Aug. 16 community vote, SpiritSwap users passed a resolution to transfer the project to Power, a fellow nonfungible token platform and DEX that is also based on Fantom. In consideration, Power will deploy 200,000 USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) into the SpiritSwap treasury.</p><p>“Initially, I had requested a deposit of 20-30K to the treasury to cover the essential costs of SpiritSwap. However, the Power team is willing to go above and beyond by depositing 200,000 USDC,\" wrote Nzaru, head manager at SpiritSwap, who announced that he would depart the DEX after receiving a new job offer. “On the 30th, I will finalize the new team and conduct orientation sessions to prepare for the upcoming month,” he said.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/17a8a2be-45f4-4ca8-b4c5-d85e535df96a.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Snapshot of the SpiritSwap takeover proposal</em>. <em>Source: Snapshot</em></figcaption></figure><p>Prior to the acquisition, Power developers stated: “We have the means and the desire to inherent SpiritSwap. This would be a direct benefit to the PNFT holders, the POWER community, and the SpiritSwap community.”</p><p>On Aug. 9, SpiritSwap said it would wind down operations by Sept. 1 if it could not find a team to take over after the Multichain exploit <a href=\"https://cointelegraph.com/news/spiritswap-fantom-project-winds-down-citing-multichain-exposure\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/spiritswap-fantom-project-winds-down-citing-multichain-exposure/amp\">drained its entire treasury</a>. Interestingly, Power was also exposed to the Multichain fiasco but only suffered “small” losses, as its treasury assets were not bridged to Multichain. </p><p>After months of speculation, Multichain’s developers disclosed in July that co-founder and CEO Zhanojung He was arrested by Chinese police back in May on undisclosed charges. He allegedly held all access to Multichain private keys and servers for the $1.5 billion protocol when he was detained. Despite a lack of information on his detention, funds belonging to Multichain and its users have been swapped for stablecoins as well as private coins and transferred out of the protocol. Some victims have since alleged that the Chinese police are involved in an <a href=\"https://cointelegraph.com/magazine/chinas-risky-bitcoin-court-decision-is-huobi-in-trouble-or-not-asia-express/\">elaborate embezzlement scheme</a> involving users’ funds. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/chinas-risky-bitcoin-court-decision-is-huobi-in-trouble-or-not-asia-express/\">China’s risky Bitcoin court decision, is Huobi in trouble or not?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-16T18:12:03.000Z",
    "title": "Why is Bitcoin price down today? ",
    "url": "https://cointelegraph.com/news/why-is-bitcoin-price-down-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2022-11/d3605b6b-0eff-46f6-a46f-b15ec3b3ecbe.jpeg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price is down today as the crypto market reacts to the SEC’s delay on approving or denying the recent ETF applications and traders wait for the FOMC minutes from Jerome Powell.  </p>\n                    <p><p>The bullish momentum that propelled Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) to a 76% year-to-date gain has all but vanished this week as Bitcoin price slid 3.6% in the previous 30-days. Bitcoin <a href=\"https://cointelegraph.com/news/bitcoin-new-volatility-btc-price-4-day-high\">price briefly flashed</a> some strength, rallying to $29,600 on Aug. 14 but it was unable to reach $30,000 and remains below that key resistance level. </p><p>The contraction and low volatility in Bitcoin price have some analysts comparing the <a href=\"https://cointelegraph.com/news/bitcoin-price-action-mirror-2015-2017-pre-bull-market-cycle\">current BTC market</a> to the pre-bull cycle of 2015-2017. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/e33f89a4-c622-4c01-b663-ee33fac88307.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day price. Source: <a href=\"https://tradingview.com\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a></em></figcaption></figure><p>Let’s take a closer look at the factors impacting Bitcoin price today.</p><h2>Bitcoin’s market structure contracts</h2><p>Bitcoin’s market structure had been recovering since the start of 2023, but its recent price action has turned the market structure bearish and is now considered to be contracting, according to the Capriole Bitcoin Macro Index. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/abdd7ac0-4b10-43e5-9663-61fadcfa9972.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Macro Index. Source: Capriole Investments</em></figcaption></figure><p>Despite Bitcoin price technically contracting, independent market analyst Charles Edwards still sees the $30,000 level as crucial,</p><blockquote>“While we are still in a technical bearish breakdown from $30K, the lack of a downward follow through in Bitcoin’s price is somewhat promising. The reason being, if the price was going to collapse, we would usually have seen that follow through by now. Nonetheless, a close back above $30K on the daily timeframe is required at the minimum as a technical confirmation of a failed breakdown. When that happens, we would consider that quite bullish.”</blockquote><h2>Bitcoin investor sentiment stalls </h2><p>The start of 2023 saw shorts continually dominating liquidations in the futures market. Since Aug. 12, the trend has shifted with Bitcoin long liquidations dominating 83% of all BTC liquidations on Aug. 15. When BTC longs are liquidated without buy pressure from trading volume, Bitcoin price is negatively affected. Bitcoin volume has also hit the <a href=\"https://cointelegraph.com/news/bitcoin-volume-lowest-early-2021-25k\">lowest levels since</a> early 2021. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/15682506-eab0-4625-8eaa-f8f8bb5224be.png\"  /><figcaption style=\"text-align: center;\"><em>BTC futures long liquidation dominance. Source: Glassnode</em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/magazine/elegant-and-ass-backward-jameson-lopps-first-impression-of-bitcoin/\"><strong><em>‘Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin</em></strong></a></p><p>The absence of new volume has sent the <a href=\"https://cointelegraph.com/news/crypto-fear-index-dips-amid-sec-binance-lawsuit\">Fear and Greed Index</a>, a key investor sentiment gauge, into a downslide in the last 30-days and is flirting with a switch to fear. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/44d56bea-3ec7-4f5e-8336-c34a0fba6ea4.png\"  /><figcaption style=\"text-align: center;\"><em>Fear &amp; Greed Index. Source: Alternative.me</em></figcaption></figure><p>The short-term uncertainty in the crypto market does not appear to have changed institutional investors' long-term outlook. Despite a hostile U.S. regulatory environment, large institutions are pushing for <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-interview-charles-edwards\">Bitcoin financial instruments</a> which may spark a bull run. Grayscale directly urged the SEC to <a href=\"https://cointelegraph.com/news/grayscale-sec-approve-all-bitcoin-etfs-together\">approve all Bitcoin</a> ETFs. </p><p>Despite the urgency of major financial firms, the SEC seems poised to <a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-2024\">continue to delay</a> decisions on approving Bitcoin ETFs until 2024 and this could be negatively impacting investor sentiment and price action across the crypto market. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-speculators-btc-since-69k-all-time-highs\"><strong><em>Bitcoin speculators now own the least BTC since $69K all-time highs</em></strong></a></p><h2>Will short term pain in macro lead to long-term gains in crypto?</h2><p>Bitcoin price continues to be directly impacted by macroeconomic events, and it is also likely that further regulatory actions and interest rate hikes will continue having some effect on BTC price. The recent CPI print and upcoming FOMC minutes on Aug. 16 may give insight into whether the Federal Reserve will continue with aggressive interest rate policies.</p><p>Zachary Townsend, CEO of Meanwhile, provided insight into how macro events can impact the current Bitcoin price action,</p><blockquote>“I think this lower-than-expected CPI print last week came as a bit of a surprise given that energy prices have been experiencing an uptick of late, notably because of all the summer travel and associated demand that comes with this. But the fact that prices are still falling suggests to me that the Fed could soon switch from hiking rates to being more concerned about economic growth, especially if the latter starts showing signs of slowing. We could be seeing rate cuts sooner than expected. This of course would be a positive for Bitcoin and other risk assets.”</blockquote><p>In the long term, market participants still expect the price of Bitcoin to recover, especially as more financial institutions are seemingly embracing BTC. </p><p class=\"post-content__disclaimer\">The views and opinions expressed here are solely those of the author and do not necessarily reflect the views of Cointelegraph.com. Every investment and trading move involves risk, you should conduct your own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-16T18:13:28.000Z",
    "title": "Valkyrie Seeks SEC Approval for Ether Futures ETF",
    "url": "https://cryptobriefing.com/valkyrie-seeks-sec-approval-for-ether-futures-etf/?utm_source=feed&utm_medium=rss",
    "description": "With its Ether futures ETF application to the SEC, Valkyrie sets the stage for a new era in crypto-focused financial products."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T18:37:44.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 As we venture into 2023 to 2032, the next decade promises to be a critical period for Aptos as it strives to establish itself as a significant blockchain platform. The rapidly changing market dynamics, technological advancements, and evolving adoption trends will undoubtedly shape Aptos&#8217;s path. Against this backdrop, investors and stakeholders ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T18:34:53.000Z",
    "title": "U.S. picks a fight with Iran over Russia",
    "url": "https://www.cryptopolitan.com/u-s-picks-a-fight-with-iran-over-russia/",
    "description": "The political chessboard of global affairs is in flux, and central to this is the U.S.&#8217;s aggressive push to sever Iran&#8217;s ties to Russia. This hardline stance stems from their alleged drone transactions and is emblematic of the high-stakes gamesmanship characterizing U.S.-Iran relations. A Web of Tense Diplomacy Recent events have revealed that the U.S. ... <a title=\"U.S. picks a fight with Iran over Russia\" class=\"read-more\" href=\"https://www.cryptopolitan.com/u-s-picks-a-fight-with-iran-over-russia/\" aria-label=\"More on U.S. picks a fight with Iran over Russia\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T18:31:10.000Z",
    "title": "PayPal halts UK cryptocurrency purchases in response to new regulations",
    "url": "https://www.cryptopolitan.com/paypal-halts-uk-cryptocurrency-purchases-in-response-to-new-regulations/",
    "description": "PayPal, the global online payments giant, has announced a temporary suspension of cryptocurrency sales in the United Kingdom. The decision comes in response to new regulations introduced by the Financial Conduct Authority (FCA). These regulations mandate a 24-hour cooling-off period and require “clear risk warnings” to be provided to users before they can invest in ... <a title=\"PayPal halts UK cryptocurrency purchases in response to new regulations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/paypal-halts-uk-cryptocurrency-purchases-in-response-to-new-regulations/\" aria-label=\"More on PayPal halts UK cryptocurrency purchases in response to new regulations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T18:15:46.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T18:14:06.000Z",
    "title": "IOST Price Prediction 2022-2032: Is IOST A Good Investment?",
    "url": "https://www.cryptopolitan.com/iost-price-prediction/",
    "description": "IOST Price Prediction 2022-2032 The IOST price forecast for 2023 and subsequent years are bullish. Analysis shows that the token could record significant price increases in the long run despite the current bearish trend in the crypto market. Our IOST Price Predictions show a slow but steady increase in price over the years, indicating that ... <a title=\"IOST Price Prediction 2022-2032: Is IOST A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/iost-price-prediction/\" aria-label=\"More on IOST Price Prediction 2022-2032: Is IOST A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T18:11:36.000Z",
    "title": "How to Ensure Safety Against the Escalating Menace of AI-Driven Cyber Fraud",
    "url": "https://www.cryptopolitan.com/escalating-menace-of-ai-driven-cyber-fraud/",
    "description": "Six years ago, a calculated telephone scam nearly entrapped an individual&#8217;s mother. The caller, purporting to represent a local police station, wove a tale involving a newly enlisted police officer—a nephew—who had purportedly encountered legal issues due to drunk driving. The caller insisted that a bail payment could resolve the situation. Sensing a potential deception, ... <a title=\"How to Ensure Safety Against the Escalating Menace of AI-Driven Cyber Fraud\" class=\"read-more\" href=\"https://www.cryptopolitan.com/escalating-menace-of-ai-driven-cyber-fraud/\" aria-label=\"More on How to Ensure Safety Against the Escalating Menace of AI-Driven Cyber Fraud\">Read more</a>"
  }
]