[
  {
    "source": "CoinDesk",
    "date": "2023-10-17T10:42:09.000Z",
    "title": "Banks Must Disclose Crypto Exposures, Global Regulator Says",
    "url": "https://www.coindesk.com/policy/2023/10/17/banks-must-disclose-crypto-exposures-global-regulator-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The guidance will ensure transparency and market discipline, the Basel Committee on Banking Supervision said"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-17T10:53:40.000Z",
    "title": "DeSci-focused DAO community funds cancer research",
    "url": "https://cointelegraph.com/news/vitadao-community-funds-cancer-research",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/118fa29a-38a2-446d-9eba-441520447c24.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>VitaDAO community agreed to fund an early-stage cancer research through the launch of a biotech company named Matrix Biosciences.</p>\n                    <p><p>VitaDAO, a decentralized collective dedicated to early-stage longevity research, funded the launch of a biotech company, Matrix Biosciences, dedicated to the treatment of cancer and aging diseases.</p><p>The initial discussions around the use of high molecular weight hyaluronic acid (HMW-HA) for anti-cancer and pro-longevity effects started off in November 2022 and gained majority consensus in March 2023. The proposal <a href=\"https://snapshot.org/#/vote.vitadao.eth/proposal/0x747f0e671d6e049ce501fba8067c9da3b0502b8945daa890ca98f36a63bc7246\" target=\"_blank\" rel=\"noopener nofollow\">snapshot</a> reveals that 35 members cast their votes using VITA tokens.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/a7c43a60-f97f-4769-bd61-56f2b77f0726.png\"  /><figcaption style=\"text-align: center;\"><em>The VITA token holders voted to agree or disagree with VitaDAO funding the HMW-HA cancer research venture. Source: snapshot.org</em></figcaption></figure><p>Out of the lot, 30 members supported the cause, 4 members abstained from voting, and 1 voted against the proposal. As an active contributor in decentralized science (DeSci), VitaDAO made an initial investment of $300,000 and plans to carry out further funding through tokenization of intellectual property (IP) in early 2024. </p><p>The HWA-HA compound is derived from the tissues of naked mole rats, a type of rodent that possess stronger cancer resistance which is responsible for their higher lifespan.</p><p>Speaking to Cointelegraph, a VitaDAO spokesperson revealed that the funds have been provided to Matrix Bio by converting USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) stablecoins from the community treasury to the US dollar and wired to their bank account.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/9-promising-blockchain-use-cases-in-healthcare-industry\"><strong><em>9 promising blockchain use cases in healthcare industry</em></strong></a></p><p>Once the first batch of experiments is complete, Matrix Bio will have the option to raise additional funding by issuing IP Tokens (IPTs) in return for sharing governance rights in the ongoing development of the IP. The next round of fundraising will commence after the budget for the next phase of development is established, expected in Q1 2024.</p><p>VitaDAO believes modulating HMW-HA appears to be a viable therapeutic candidate in supporting the treatment of a complex disease like cancer. The DAO told Cointelegraph:</p><blockquote>“Like most early-stage research, it is too early to know what the outcome of the research will provide. VitaDAO believes there is a high likelihood that the research will be translatable to the clinic.”</blockquote><p>While the DAO’s commitment to funding this particular cancer research will depend on the results obtained from the various experiments, VitaDAO’s community treasury has in the past funded up to $1 million of a research project’s needs before enlisting the support of professional investors and pharma stakeholders.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-zero-knowledge-voting-finance/\"><strong><em>Beyond crypto: Zero-knowledge proofs show potential from voting to finance</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-17T11:00:58.000Z",
    "title": "Lightning Network transactions increased by 1,212% in two years",
    "url": "https://cryptoslate.com/lightning-network-transactions-increased-1212-percent-in-two-years/",
    "description": "<p>The Lightning Network, a second-layer (L2) solution built atop the Bitcoin blockchain, has drastically changed the way the crypto market perceives transaction speeds and costs. Designed to address the scalability issues of Bitcoin, it facilitates instant, low-cost transactions by creating off-chain payment channels. This solution ensures that not every transaction must be recorded on the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/lightning-network-transactions-increased-1212-percent-in-two-years/\">Lightning Network transactions increased by 1,212% in two years</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-17T10:55:33.000Z",
    "title": "Bitcoin ($BTC) ETF Rumors Trigger $100 Million Liquidation Frenzy",
    "url": "https://www.cryptoglobe.com/latest/2023/10/bitcoin-btc-etf-rumors-trigger-100-million-liquidation-frenzy/",
    "description": "The cryptocurrency market entered a frenzy on Monday after rumors falsely suggested that the U.S. Securities and Exchange Commission (SEC) had approved BlackRock’s spot Bitcoin exchange-traded fund (ETF) application. The rumors led to over $100 million in liquidations, with one whale losing $50,000 in just 10 minutes. The rumors came from a post on the […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-17T10:44:57.000Z",
    "title": "Hot or Not? The Ultimate Price Prediction for Bitcoin (BTC), Ethereum (ETH), and Cardano (ADA)",
    "url": "https://cryptodaily.co.uk/2023/10/hot-or-not-the-ultimate-price-prediction-for-bitcoin-btc-ethereum-eth-and-cardano-ada",
    "description": "Delve into a comprehensive analysis of Bitcoin (BTC), Ethereum (ETH), and Cardano (ADA) prices. Will they skyrocket or take a downturn? From Bitcoin's ETF rumors to Ethereum's new staking mechanism and Cardano's market dynamics, get insights into the future of these crypto giants."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-17T11:00:55.000Z",
    "title": "Beyond HODLing: Here’s How $Verse and CryptoWallet.com Lead the Way",
    "url": "https://news.bitcoin.com/beyond-hodling-heres-how-verse-and-cryptowallet-com-lead-the-way/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/photo_2023-10-16_15-01-33-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/photo_2023-10-16_15-01-33-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/photo_2023-10-16_15-01-33-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/photo_2023-10-16_15-01-33-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/photo_2023-10-16_15-01-33-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/photo_2023-10-16_15-01-33-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/photo_2023-10-16_15-01-33-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/photo_2023-10-16_15-01-33.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Cryptocurrencies are no longer just a speculative investment – stashed away and &#8220;HODLed&#8221; for a distant future. Instead, a seismic shift is underway, where cryptos are becoming a vital part of everyday life. In the ever-evolving world of cryptocurrencies, two projects are striving to bring about a revolution in how individuals engage with [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T11:05:37.000Z",
    "title": "Whale loses $50k in minutes due to fake Bitcoin ETF news",
    "url": "https://www.cryptopolitan.com/whale-loses-50k-in-min-to-fake-btc-etf-news/",
    "description": "A significant misstep cost a cryptocurrency whale nearly $50,000 after falling victim to fake news regarding a Bitcoin Spot ETF. The investor hastily bought 20.5 Wrapped Bitcoin (WBTC) for 613,201 USDC, only to sell at a loss of 563,970 USDC. This financial blunder occurred within a mere ten-minute window, highlighting the volatility and sensitivity of ... <a title=\"Whale loses $50k in minutes due to fake Bitcoin ETF news\" class=\"read-more\" href=\"https://www.cryptopolitan.com/whale-loses-50k-in-min-to-fake-btc-etf-news/\" aria-label=\"More on Whale loses $50k in minutes due to fake Bitcoin ETF news\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T11:01:41.000Z",
    "title": "Coinbase’s liquidity boost: 80 trading pairs removed to strengthen market resilience",
    "url": "https://www.cryptopolitan.com/coinbases-liquidity-boost/",
    "description": "Coinbase, the renowned United States-based cryptocurrency exchange, has made a strategic move to boost liquidity on its platform by suspending 80 non-USD trading pairs. This significant decision, announced is in alignment with Coinbase&#8217;s commitment to enhancing overall market health and consolidating liquidity. Coinbase&#8217;s decision to suspend 80 non-USD trading pairs underscores the exchange&#8217;s dedication to ... <a title=\"Coinbase&#8217;s liquidity boost: 80 trading pairs removed to strengthen market resilience\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbases-liquidity-boost/\" aria-label=\"More on Coinbase&#8217;s liquidity boost: 80 trading pairs removed to strengthen market resilience\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T10:41:29.000Z",
    "title": "False ETF rumor causes a plummet in Bitcoin’s liquidity on Binance",
    "url": "https://www.cryptopolitan.com/bitcoins-liquidity-on-binance-plummets-kaiko/",
    "description": "The crypto market has been marked by inherent volatility, and the recent sentiments on Bitcoin have centered the asset as an unpredictable digital currency. A clear incident of this is the recent soaring of its price, which was unprecedented and later plummeting just as fast.&#160; This was a result of a false publication on the ... <a title=\"False ETF rumor causes a plummet in Bitcoin’s liquidity on Binance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoins-liquidity-on-binance-plummets-kaiko/\" aria-label=\"More on False ETF rumor causes a plummet in Bitcoin’s liquidity on Binance\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-17T10:45:19.000Z",
    "title": "Shiba Inu Shatters Resistance: A Sign Of A Bigger Reversal?",
    "url": "https://www.newsbtc.com/news/shiba-inu-shatters-resistance-a-sign-of-a-bigger-reversal/",
    "description": "Shiba Inu (SHIB) has recently embarked on a surprising journey, defying the odds and setting the stage for a potential game-changing reversal.  A recent report unveils fascinating insights into SHIB&#8217;s price action, highlighting both optimism and caution in equal measure. SHIB, currently priced at $0.00000705 according to CoinGecko, has exhibited remarkable resilience in the face of adversity. Over the past 24 hours, it faced a modest 0.9% decline, while the seven-day dip amounted to 1.6%. However, the most intriguing aspect of SHIB&#8217;s journey lies in its confrontation with a critical resistance level. Related Reading: XRP On The Cusp Of Redemption? Unveiling Data-Backed Insights Recent market analysis reveals that SHIB is engaged in a fierce struggle with the 21-day Exponential Moving Average (EMA), a pivotal indicator for deciphering bullish or bearish trends in the world of cryptocurrencies. This battle has not gone unnoticed by traders, who are eagerly awaiting the outcome. Bulls Vs. Bears: The SHIB Tug Of War SHIB&#8217;s recent price action indicates a tug of war between bears and bulls, with the cryptocurrency precariously perched at a crucial resistance level. Should SHIB manage to conclusively close above this level, traders and investors could witness the resurgence of bullish momentum.  SHIB market cap currently at $4.16 billion on the daily chart: TradingView.com While SHIB enthusiasts are buoyed by the positive signs on the chart, there is one conspicuous element causing concern—the declining trading volume. A reliable rule of thumb in crypto markets is that a cryptocurrency battling significant resistance, like the 21-day EMA, should ideally be accompanied by surging trading volumes. Related Reading: XRP Path To Recovery: Will $0.5 Be Conquered? Increasing volumes signify robust buying interest and provide substantial validity to price movements. In the case of SHIB, the diminishing volume paints a contradictory picture. The declining interest from traders and investors raises questions about the sustainability of any potential bullish surge. SHIB price action in the last week. Source: Coingecko What Lies Ahead For SHIB? The Shiba Inu community eagerly watches as their beloved cryptocurrency navigates these challenging waters. The battle with resistance and the conundrum of decreasing trading volumes offer mixed signals, making it imperative for investors to exercise caution. SHIB&#8217;s journey remains one of unpredictability and volatility. Only time will reveal whether the recent breakthrough will pave the way for a lasting bullish trend or if caution will be the name of the game. In the ever-changing world of cryptocurrencies, one thing is certain: Shiba Inu continues to be a captivating, enigmatic player in the digital asset landscape.  As the market closely monitors these developments, the importance of tracking both technical indicators and market sentiment becomes increasingly apparent for traders and investors alike. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Gfinity Esports"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-17T11:00:50.000Z",
    "title": "Ripple’s Massive XRP Movement Triggers Market Speculation",
    "url": "https://www.crypto-news-flash.com/ripples-massive-xrp-movement-triggers-market-speculation/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-massive-xrp-movement-triggers-market-speculation",
    "description": "<img width=\"512\" height=\"473\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-74.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-74.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-74-300x277.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ripple executes significant XRP transfers, leading to widespread market theories. While sell-off fears grow, the actual motives behind these massive moves remain undisclosed. Ripple&#8217;s Enigmatic XRP Shift Ripple Labs Inc, a prominent American blockchain payments establishment, has recently initiated two considerable XRP transfers that have resulted in an array of market hypotheses. As per Whale [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-17T10:49:58.000Z",
    "title": "Ripple CTO’s Bold Vision: XRPL to Emerge as Leading Platform for Tokenized Real-World Assets in 18 Months, Fueling XRP New ATH",
    "url": "https://www.crypto-news-flash.com/ripple-ctos-bold-vision-xrpl-to-emerge-as-leading-platform-for-tokenized-real-world-assets-in-18-months-fueling-xrp-new-ath/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-ctos-bold-vision-xrpl-to-emerge-as-leading-platform-for-tokenized-real-world-assets-in-18-months-fueling-xrp-new-ath",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/CBDC-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/CBDC-Ripple.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/CBDC-Ripple-300x158.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/CBDC-Ripple-1024x538.jpg 1024w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />David Schwartz, the Chief Technology Officer of Ripple, has shed light on the significance of the XRP Ledger.  The technology is poised to influence how market players approach asset tokenization in the crypto industry.  The future of Ripple is bright, thanks to the many tools and technologies added to the Ripple/XRP ecosystem. One such technology [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-17T11:00:53.000Z",
    "title": "Coinbase’s Best Investments in 2023 – Part 3",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/coinbases-best-investments-in-2023-part-3/",
    "description": "<p>Today, Coinbase Ventures manages a staggering $1.5 billion portfolio. Indeed, they&#8217;ve built up their wealth by making good investments. Naturally, it would be wise to take a peek at the projects they&#8217;ve invested in.  Join us as we do exactly that in this comprehensive four-part article series. This article is the last part of this [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/coinbases-best-investments-in-2023-part-3/\">Coinbase’s Best Investments in 2023 – Part 3</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-17T10:58:00.000Z",
    "title": "FTX Bankruptcy: Customers Could Recover 90% of Lost Asset in 2024",
    "url": "https://coinedition.com/ftx-bankruptcy-customers-could-recover-90-of-lost-asset-in-2024/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/FTX-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ftx\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/FTX-2.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/FTX-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/FTX-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/FTX-2-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/FTX-2-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/FTX-2-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>FTX Trading Ltd and affiliated debtors on Tuesday announced a proposed settlement for customer property disputes that may see customers reclaim 90% of lost assets in mid-2024. The FTX debtors said the agreement reached with creditors is a “major milestone” in their Chapter 11 case. The FTX bankruptcy committee floated a plan that was raised [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ftx-bankruptcy-customers-could-recover-90-of-lost-asset-in-2024/\">FTX Bankruptcy: Customers Could Recover 90% of Lost Asset in 2024</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]