[
  {
    "source": "CoinDesk",
    "date": "2023-11-08T12:47:18.000Z",
    "title": "Swiss Crypto Bank SEBA Wins Hong Kong License",
    "url": "https://www.coindesk.com/policy/2023/11/08/swiss-crypto-bank-seba-wins-hong-kong-license/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The bank's Hong Kong unit can now deal in and distribute securities, including virtual assets-related products."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-08T12:50:35.000Z",
    "title": "Blockchain game Illuvium goes mainstream with looming Epic Games Store listing",
    "url": "http://cointelegraph.com/news/illuvium-epic-games-mainstream-listing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/b18e39f8-6e30-4b7a-b8ff-d7d74f10cab7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchain games have historically battled to gain mainstream attention, but Illuvium’s listing on Epic Games store could change the narrative. </p>\n                    <p><p>Blockchain-based game Illuvium is set to tap into an audience of millions of PC and mobile gamers with its upcoming listing on Epic Games Store, which is home to massively popular titles like Fortnite.</p><p>Illuvium, an interoperable blockchain game developed by Illuvium Labs, will feature on Epic’s store from Nov. 28, following several months of background work to get the title to meet Epic’s standards.</p><p>Speaking exclusively to Cointelegraph ahead of the Epic launch, Illuvium co-founder Kieran Warwick outlined the evolution of the game in order to cater to a mainstream audience and comply with the platform’s legal and compatibility requirements:</p><blockquote>“The result of these efforts has not only earned Illuvium a place on a leading gaming platform but has also evolved our product.”</blockquote><p>The game was developed using Unreal Engine 5 on the Immutable X network. Its beta launch on Epic Games will feature three different game genres set within the Illuvium universe. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/F1J8K44bf_E\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>This includes Overworld, an open world exploration game and “creature capturer reminiscent of beloved classics”, an autobattler strategy game called Arena and Zero, a mobile and desktop city-builder which ties into the other titles. Warwick said that their approach in building separate genres and game modes was aimed at attracting a wider audience of gamers.</p><p>“By launching three different games in three different genres, we have significantly increased our addressable market. The only issue is it has taken much longer to get to this point,” Warwick adds.</p><p>Given that blockchain games featuring nonfungible token (NFT)  elements have struggled to break into the mainstream, Warwick’s team has adapted its approach in an effort to onboard users. He highlights the barrier to entry for non-Web3 native gamers as a key reason for the slow adoption of blockchain games:</p><blockquote>“One of the most frustrating things about NFT games is the notion that you need a wallet and a ton of money just to try out the game. We have removed the need for wallets, and it’s free to play. We think this is the only way to get mainstream adoption.”</blockquote><p>As Cointelegraph <a href=\"https://cointelegraph.com/news/web3-gaming-investors-more-discerning-animoca-robby-yung\">recently reported</a>, Web3 venture capital firms like Animoca Brands have highlighted the hesitance of mainstream game publishers to list games that incorporate Web3 infrastructure. </p><p>Animoca Brands CEO Robby Yung previously suggested that mainstream players remain uncertain about the inherent implications, fearing that Web3 integration would bypass existing business models that rely on fees for distribution.</p><p><a href=\"https://cointelegraph.com/news/the-social-benefits-are-huge-web3-gaming-to-shift-digital-ownership\"><strong><em>Related: ‘The social benefits are huge’: Web3 gaming to shift digital ownership</em></strong></a></p><p>Warwick echoes these sentiments, saying that this prevailing attitude is influenced by a variety of factors. One factor is game design integrity, with some critics suggesting that including NFTs could lead to pay-to-win mechanics, or negatively affect the game design by prioritizing monetisation over player experience.</p><p>Regulatory concerns are another consideration, with Warwick highlighting that blockchain technology and NFTs remain “in a grey area in many regions”.</p><blockquote>“Games with NFT functionality could run into trouble with regulators that could affect their viability and legality.” </blockquote><p>The volatility of cryptocurrency markets and NFTs are another hurdle that concern mainstream publishers, as well as the perceived prevalence of fraud. </p><p>Nevertheless Illuvium’s upcoming listing bodes well for the wider blockchain gaming industry. Warwick describes it as a major milestone as their title steps onto the same platform as some of the most popular mainstream games in recent years.</p><p>“This is a huge step forward. People have been saying for years that web3 gaming is the next big thing in the crypto space,\" Warwick concluded.</p><p>Web3 gaming investors have <a href=\"https://cointelegraph.com/news/web3-gaming-investors-more-discerning-animoca-robby-yung\">adopted a more measured approach</a> to backing early stage studios building blockchain games over the past year. This has been necessitated by the effects of a lengthy cryptocurrency bear market, which has called for greater due diligence from industry venture capitalists.</p><p><a href=\"https://cointelegraph.com/magazine/can-p2e-gaming-grind-away-market-share-from-mainstream-games/\"><strong><em>Magazine: Blockchain games take on the mainstream: Here’s how they can win</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-08T12:46:00.000Z",
    "title": "How decentralized platforms democratize crypto funding initiatives",
    "url": "http://cointelegraph.com/news/how-decentralized-platforms-empower-crypto-funding-decisions",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/e191b07e-4502-4b22-ad00-b746392a2c85.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Kriss Baird, the principal figure of Cardano’s Project Catalyst, spoke with Cointelegraph about the initiative, the extent of the collective’s involvement in shared resources and the direction of the platform’s development. </p>\n                    <p><p>While the prevailing traditional financing models resulted in the crypto and blockchain sector raising billions of dollars over the years, they are not without weaknesses, according to Project Catalyst’s group product manager.</p><p>At the recent Cardano Summit in Dubai, Kriss Baird, the principal figure of Project Catalyst — a community-driven governance and grants and funds mechanism through voting within the Cardano ecosystem — spoke with Cointelegraph about the initiative, the extent of the collective’s involvement in shared resources and the direction of the platform’s development.</p><p>Speaking about the opportunities and challenges of decentralized platforms for raising capital vis-à-vis traditional means, Baird said:</p><blockquote>“The problem to be solved [in traditional financing models] is that the decisions being made on who gets the money really comes down to probably a handful of [people].”</blockquote><p>He argued that funding decisions made by a small number of people do not produce “great outcomes” and allow communities to play an active role in societal change. On the other hand, decentralized funding initiatives provide “a bit of like direct democracy” and platforms for crypto holders to voice their ideas and concerns.</p><p>However, Baird admitted that the sheer scale of such community-driven projects could prove challenging as permissionless, decentralized communities are made up of tens of thousands of stakeholders and projects across the globe.</p><p>“It’s actually very difficult, particularly in something like Catalyst where everybody has an opinion… It means there are 10,000 or more opinions on how to operate Catalyst,” he said.</p><p>In solving this dilemma within the Cardano ecosystem, Baird said Catalyst launched a pilot where the community not only decides on which proposals get funded but also enables them to verify that the funded projects are reaching their set targets through a milestone-based funding approach and accountability model.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Project Catalyst F 11 and beyond.<br><br>A presentation by Kriss and Danny took place at the Cardano Summit, and we have news to share:<br><br> GOODBYE to downvoting, at least for now.<a href=\"https://twitter.com/danny_cryptofay?ref_src=twsrc%5Etfw\">@danny_cryptofay</a> &quot;We intend for this to rejuvenate hearts and spirits.&quot;<a href=\"https://twitter.com/krissbaird?ref_src=twsrc%5Etfw\">@krissbaird</a> &quot;A person proposing… <a href=\"https://t.co/0nnn0wQMvZ\">pic.twitter.com/0nnn0wQMvZ</a></p>&mdash; Mauro Andreoli || Cardano Ambassador (@MauroAndreoliA) <a href=\"https://twitter.com/MauroAndreoliA/status/1720384538222686537?ref_src=twsrc%5Etfw\">November 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>They also launched a new voting system following its recent <a href=\"https://projectcatalyst.io/funds/10\" target=\"_blank\" rel=\"noopener nofollow\">Fund10</a> — which allocated $16.5 million in Cardano (ADA) — changing the upvote and downvote mechanics to a “yes-or-abstain” to avoid discouraging newer ecosystem members from participating in submitting proposals.</p><blockquote>“Innovation often happens on the fringes. And so if we don’t support [ideas in the] earliest stages, how can we proclaim that were truly and highly innovative” So we want to create conditions that satisfy this global audience of different readiness levels and maturity levels of proposers without creating ring fences around certain types of ideas.”</blockquote><p>According to Baird, they may re-introduce the previous voting system in future funding for more “mature” projects that have gone through user testing and community feedback.</p><p>When asked about how he would like decentralized funding to evolve, Baird said he envisions it becoming a multi-tenant ecosystem, where more communities of other blockchain networks, Web2 businesses and governments adopt the same approach.</p><p>The Catalyst’s group product manager said they have funded more than 1,300 projects, raising 137 million ADA (approximately $60 million) since 2021. He estimates the initiative would allocate over $100 million over the next four years.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/slumdog-billionaire-polygon-top-10-brings-no-satisfaction-sandeep-nailwal/\">Slumdog billionaire 2: ‘Top 10… brings no satisfaction’ says Polygon’s Sandeep Nailwal</a></em></strong>Magazine: <a href=\"https://cointelegraph.com/magazine/slumdog-billionaire-polygon-top-10-brings-no-satisfaction-sandeep-nailwal/\">Slumdog billionaire 2: ‘Top 10… brings no satisfaction’ says Polygon’s Sandeep Nailwal</a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-08T12:45:17.000Z",
    "title": "Wintermute threatens lawsuit against Near Foundation over failed $11M stablecoin conversion",
    "url": "https://cryptoslate.com/wintermute-threatens-lawsuit-against-near-foundation-over-failed-11m-stablecoin-conversion/",
    "description": "<p>Evgeny Gaevoy, the CEO of Crypto market maker Wintermute, said his firm would take legal action against Near(NEAR) Foundation and Aurora Labs for failing to deliver on their promise to convert $11 million worth of USN stablecoins into Tether&#8217;s USDT. The issue Gaevoy explained that the bankrupt FTX estate had tasked the liquidity provider to facilitate [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/wintermute-threatens-lawsuit-against-near-foundation-over-failed-11m-stablecoin-conversion/\">Wintermute threatens lawsuit against Near Foundation over failed $11M stablecoin conversion</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-08T13:01:05.000Z",
    "title": "Robinhood to launch crypto services in EU in ‘coming months’",
    "url": "https://crypto.news/robinhood-to-launch-crypto-services-in-eu-in-coming-months/",
    "description": "The U.S. fintech broker Robinhood is poised to roll out European crypto offerings despite missing Q3 revenue estimates. Robinhood plans to launch its crypto services in the European region and U.K. brokerage &#8220;in the coming weeks&#8221; as the Menlo Park-headquartered&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-08T12:56:35.000Z",
    "title": "Top 10 AI-powered crypto projects: DeepFake Ai to Everipedia",
    "url": "https://crypto.news/top-10-ai-powered-crypto-projects-deepfake-ai-to-everipedia/",
    "description": "This article delves into the top ten AI projects, including DeepFake Ai, that have developed practical solutions and applications for crypto users"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-08T13:00:09.000Z",
    "title": "MATIC Propels Over $0.75, Is $1 Possible?",
    "url": "https://www.newsbtc.com/matic/matic-propels-over-0-75-is-1-possible/",
    "description": "Amid the bullish trend circling the cryptocurrency market due to the recently concluded Uptober rally, Polygon&#8217;s native crypto MATIC has recently gained traction recording a 50% increase in price surge in the last 20 days. MATIC Experiences Price Growth The recently concluded Uptober (October) which is believed to be a month of green (gains) saw some cryptocurrencies performing significantly great. Many altcoins experienced price surges during the past month, and one of the notable altcoins that benefited from this is MATIC. The crypto asset recently went past the crucial $0.75 mark sparking momentum toward reaching the significant $1 mark. However, if the token is fortunate enough to sustain its current pace, it might reach the $1 mark by the end of 2023. Related Reading: Polygon’s POL Upgrade Live On Ethereum Mainnet, MATIC To $1? MATIC reaching the coveted $1 mark is expected to happen if the token manages to surpass $0.85 in November. Meanwhile, a reverse below $0.75 will bring the MATIC price down to $0.55, if buyers are unable to maintain their lead at $0.60. MATIC&#8217;s Exponential Moving Averages (EMAs) have also experienced a significant breakout over the recent weeks. The price of MATIC experienced a price surpassing the crucial $0.75 barrier after the crypto&#8217;s 200-day EMA breakout.  MATIC surpassing a 200-day EMA puts it on its way to potentially reaching the $1 mark by the end of the year. This is because, in the Polygon chart, a golden crossover opportunity appears when the 50-day and 200-day EMAs are crossed above. While the 50-day EMA&#8217;s upward trend suggests that a golden crossover could take place, the bull run cutting across the 200-day EMA may also suggest a reversal movement. However, the crypto asset has managed to sustain its upward trajectory since it surpassed the 200-day EMA. Significance Of The Crypto&#8217;s Market Currently, the token&#8217;s price is sitting at $0.77, indicating an 8% daily increase in price with a 24-hour trading volume of $489,605,430. The token market is standing robust, ranking 13 in the cryptocurrency market with a market cap of $7 billion. MATIC has a significant market presence and a circulating supply of 9.24 billion MATIC, which buttresses its long-term technical score and puts it above 48% of all cryptocurrencies in service. Related Reading: MATIC Price Rally Threatened As Whales Deposit Millions Of Tokens To Exchanges One significant aspect of the surge in MATIC&#8217;s price is that the token experienced a 33% year-to-date (YTD) decline in September. Consequently, the crypto recovered from this within a month. In addition, the token&#8217;s strong bullish candles and rising volumes hint at a continuation of an upward trajectory. As a result of this, buyers have a good chance of maintaining their lead at the current price of MATIC. So far, MATIC has experienced a 50% increase in the last 20 days, putting it in a profitable position following the 33% year-to-date decline in September. With the current bullish continuation, the token presents more profits in the future. Featured image from iStock, chart by Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-08T13:08:22.000Z",
    "title": "FTX and Alameda Transfer $350 Million in Cryptocurrency to Exchanges: Will Prices Plunge?",
    "url": "https://www.crypto-news-flash.com/ftx-and-alameda-transfer-350-million-in-cryptocurrency-to-exchanges-will-prices-plunge/?utm_source=rss&utm_medium=rss&utm_campaign=ftx-and-alameda-transfer-350-million-in-cryptocurrency-to-exchanges-will-prices-plunge",
    "description": "<img width=\"1000\" height=\"623\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-300x187.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-768x478.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-163x102.png 163w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-24x15.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-36x22.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-48x30.png 48w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />FTX and Alameda are undergoing a significant asset transfer to various exchanges, as part of their strategy to address bankruptcy and debt repayment issues. FTX is actively working on converting its digital assets into cash, with a focus on selling digital asset trusts valued at around $744 million. Recent on-chain developments show that both FTX [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-08T12:59:21.000Z",
    "title": "tomi Launches its tomiNet Blockchain",
    "url": "https://www.altcoinbuzz.io/product-release/tomi-launches-its-tominet-blockchain/",
    "description": "<p>tomi&#8217;s own stated goal of the project is community-based and decentralized freedom on the blockchain. And to move that goal forward, tomi has a big announcement. Earlier today, at Binance Blockchain Week Istanbul 2023, the tomi team announced the launch of its tomiNet blockchain. Let&#8217;s see what it&#8217;s all about and why it&#8217;s good for [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/product-release/tomi-launches-its-tominet-blockchain/\">tomi Launches its tomiNet Blockchain</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-08T12:48:44.000Z",
    "title": "Balanced Portfolio – An Ideal Portfolio Mix for All Experience Levels",
    "url": "https://www.altcoinbuzz.io/reviews/balanced-portfolio-an-ideal-portfolio-mix-for-all-experience-levels/",
    "description": "<p>A long-term portfolio should ideally be “Balanced”. A reference is the Rule of 80-20 of Pareto. Pareto says that 80% of your portfolio value should stay with 20% of the coins. New investors can participate in tokens that are available in centralized or decentralized exchanges. These tokens can be classified according to their market caps. [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/reviews/balanced-portfolio-an-ideal-portfolio-mix-for-all-experience-levels/\">Balanced Portfolio &#8211; An Ideal Portfolio Mix for All Experience Levels</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-08T13:03:48.000Z",
    "title": "3 Best Cloud Mining Platforms 2023 (Earn Money at Home)",
    "url": "https://coinedition.com/3-best-cloud-mining-platforms-2023-earn-money-at-home/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/CGMD.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/CGMD.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/CGMD-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/CGMD-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/CGMD-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/CGMD-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/CGMD-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/CGMD-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/CGMD-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/CGMD-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/CGMD-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/CGMD-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/CGMD-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/CGMD-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/CGMD-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/CGMD-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/CGMD-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cryptocurrency mining has revolutionized the way people can earn money, and cloud mining is at the forefront of this innovation. This article introduces the five best cloud mining platforms for 2023, providing a genuine opportunity to earn money from the comfort of your home. Cloud Mining Platform 1. CGMD miner （9.8） CGMD miner platform has [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/3-best-cloud-mining-platforms-2023-earn-money-at-home/\">3 Best Cloud Mining Platforms 2023 (Earn Money at Home)</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-08T12:45:00.000Z",
    "title": "Robinhood Released Its Third Quarter Report; Crypto Assets Shed 25%",
    "url": "https://coinedition.com/robinhood-released-its-third-quarter-report-crypto-assets-shed-25/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Robinhoods-Removal-of-ADA-SOL-and-MATIC-Tends-to-Sell-Pressure-.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Robinhoods-Removal-of-ADA-SOL-and-MATIC-Tends-to-Sell-Pressure-.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Robinhoods-Removal-of-ADA-SOL-and-MATIC-Tends-to-Sell-Pressure--300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Robinhoods-Removal-of-ADA-SOL-and-MATIC-Tends-to-Sell-Pressure--380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>California-based financial services firm Robinhood (HOOD) disclosed $23 million in cryptocurrency revenue for the third quarter (Q3). The value reported is 25% less than its $31 million revenue in the second quarter. The Q3 report also emphasized a 29% year-over-year increase in Robinhood&#8217;s overall net profit, reaching $467 million. This boost is attributed to elevated [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/robinhood-released-its-third-quarter-report-crypto-assets-shed-25/\">Robinhood Released Its Third Quarter Report; Crypto Assets Shed 25%</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-08T12:45:02.000Z",
    "title": "Fed Rate Cuts May Not Be Bullish for Bitcoin, Says Crypto Analyst Benjamin Cowen – Here’s Why",
    "url": "https://dailyhodl.com/2023/11/08/fed-rate-cuts-may-not-be-bullish-for-bitcoin-says-crypto-analyst-benjamin-cowen-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Not-Be-Bullish-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Not-Be-Bullish-btc.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Not-Be-Bullish-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Not-Be-Bullish-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Not-Be-Bullish-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Not-Be-Bullish-btc.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Not-Be-Bullish-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is warning that a US Federal Reserve interest rate cut may not spark a bullish market for Bitcoin (BTC). In a new video update, crypto trader Benjamin Cowen tells his 787,000 YouTube subscribers that historical patterns suggest a Fed rate cut would result in a downward trend for both the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/08/fed-rate-cuts-may-not-be-bullish-for-bitcoin-says-crypto-analyst-benjamin-cowen-heres-why/\">Fed Rate Cuts May Not Be Bullish for Bitcoin, Says Crypto Analyst Benjamin Cowen – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]