[
  {
    "source": "CoinDesk",
    "date": "2023-08-05T16:05:00.000Z",
    "title": "NFT Trading Is Ice Cold But Developers Are Still Hot for Web3",
    "url": "https://www.coindesk.com/web3/2023/08/05/nft-trading-is-ice-cold-but-developers-are-still-hot-for-web3/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "This week, new reports were released that point to a major slowdown in NFT trading. Plus, Etihad Airways will soon let its community of frequent fliers stake NFTs for miles."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-05T15:45:50.000Z",
    "title": "This Week in Coins: Sparse News Extends Streak of Underwhelming Bitcoin and Ethereum Prices",
    "url": "https://decrypt.co/151424/this-week-in-coins-six-weeks-weak-bitcoin-and-ethereum-prices",
    "description": "Although Coinbase CEO Brian Armstrong did reveal that the SEC asked his exchange to delist all cryptocurrencies except Bitcoin."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-05T14:40:00.000Z",
    "title": "What is Hooked Protocol, and how does it work?",
    "url": "https://cointelegraph.com/explained/what-is-hooked-protocol-and-how-does-it-work",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/3403c2010dbd1328e92e96a1cd91288c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Hooked Protocol is a gamified on-ramp layer hosting learn-and-earn projects that also facilitates onboarding onto Web3. Find out about the Hooked ecosystem and how it works.</p>\n                    <p><h2>How does Hooked Protocol plan to grow?</h2><p></p><p><em>Embarking on a worldwide expansion strategy, Hooked Protocol is working to <a href=\"https://cointelegraph.com/learn/what-is-socialfi-a-beginners-guide-to-the-social-network-of-the-future\">enhance its SocialFi model</a>.</em></p><p>Hooked Protocol is looking for growth in the market, its community and its ecosystem. The plan includes brushing up on the SocialFi model of the protocol and supporting users to make better use of their social connections. Combining platform enrichment with even more fun-filled content, Hooked Protocol hopes to make itself even more engaging for the users.</p><p>Following a global expansion strategy backed by an enhanced content-learning platform, Hooked Protocol is working out bilateral economic partnerships to build a flywheel-based ecosystem that generates more traffic continually and pushes up community growth.</p><h2>What is Wild Cash on Hooked Protocol?</h2><p></p><p><em>Wild Cash offers users gamified learning of Web3 concepts while enabling them to earn GOLD tokens.</em></p><p>Wild Cash, the first <a href=\"https://cointelegraph.com/learn/what-are-dapps-everything-there-is-to-know-about-decentralized-applications\">decentralized application (DApp)</a> on Hooked Protocol, is a learn-and-earn application that enables new users to earn GOLD tokens for doing quizzes and inviting friends to play. The social reference mechanism on Wild Cash allows users to share referral codes and posters on social media and scan QR codes.</p><p>The DApp uses PoWT to keep track of the users’ contribution resources and reward them. While participating in various activities on the application, users also get familiar with Web3 mechanics.</p><p>Wild Cash rolls out an array of activities, such as:</p><ul><li>Log in every 24 hours to participate in quizzes and compete with other players to earn rewards.</li><li>Mine GOLD tokens by moving animated avatars that demonstrate how <a href=\"https://cointelegraph.com/explained/proof-of-work-explained\">proof-of-work (PoW)</a> functions on Bitcoin.</li><li>Answer questions about cryptocurrency-related topics, such as <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a>, <a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-the-gamefi-ecosystem\">GameFi</a>, NFTs, regulations, etc. to win GOLD.</li><li>Watch ads to earn GOLD.</li><li>Stake and swap through the Hooked Wallet. </li></ul><h2>What are the tokens used on Hooked Protocol?</h2><p></p><p><em>Hooked Protocol uses a dual-token model, one of which is for governance and the other is a <a href=\"https://cointelegraph.com/explained/utility-tokens-vs-equity-tokens-key-differences-explained\">utility token</a>.</em></p><p>The two tokens used on Hooked Protocol are HOOK, the governance token, and Hooked Gold Token (HGT), the utility token.</p><p>HOOK is used for:</p><ul><li>Voting decisions on proposals</li><li>Earning rewards</li><li>Accessing exclusive <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a></li><li>Accessing community event privileges</li><li>Using as currency for certain in-app purchases.</li></ul><p>The protocol has plans to use HOOK as a gas token for various economic activities within the Hooked Application Rollup Infrastructure.</p><p>Hooked Gold Token (HGT) is a utility token providing the community with ongoing incentives to contribute. Having an infinite supply, HGT is used only in the Hooked Protocol environment. However, the protocol has a <a href=\"https://cointelegraph.com/explained/defi-liquidity-pools-explained\">mechanism in place to control the liquidity</a> of HGT and reduce the risk of speculative attacks that might damage the value of the token.</p><img alt=\"Use cases of HGT\" src=\"https://s3.cointelegraph.com/storage/uploads/view/30e771c6855358d68db8762213340157.jpg\" title=\"Use cases of HGT\"><h2>How does Hooked Protocol work?</h2><p></p><p><em>Three main elements in the Hooked ecosystem are gamified learning, a mechanism for incentives and an integrated infrastructure of businesses.</em></p><p>Hooked Protocol follows a three-pronged approach to incentivize Web3 adoption:</p><h3>Gamified learning</h3><p>Hooked Protocol has adopted an immersive and inquisitive <a href=\"https://cointelegraph.com/learn/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future\">Web3 education methodology</a>. Hooked Academy Sensei enables users to converse with virtual tutors integrated with ChatGPT. There are virtual tutors with special characters who have the capability to interact like humans.</p><p>Hooked Academy, meanwhile, provides 30-second meme videos to help users learn. These videos with artificial intelligence-powered characters make the learning process structured and engaging.</p><h3>Incentives</h3><p>To accelerate adoption, Hooked Protocol has a mechanism of incentives:</p><ul><li>Quiz-to-Earn: Participants take quizzes to learn about <a href=\"https://cointelegraph.com/explained/how-web3-resolves-fundamental-problems-in-web2\">Web3 fundamentals</a> and get rewarded with tokens.</li><li>Proof-of-Work-and-Time (PoWT) Mining Game: Onboarders mine to earn using the PoWT mechanism, a consensus method bringing in a variable block time scalable with mining power.</li><li>Social Referral: Users get compensated for recommending their Web3 social network to others.</li><li>Stake and Swap: Users can hone their skills in Web3 concepts, such as staking, trading and transferring crypto tokens.</li></ul><h3>Infrastructure for businesses</h3><p>Hooked Protocol has rolled out integrated infrastructure to provide Web3 onboarding solutions for business enterprises. Examples of such infrastructure include a login process with a decentralized identity, a user growth engine and a social network integrated interface. The Hooked Soulbound Token acts as the sole digital identity, granting community members access to the Web3 space.</p><p>Users also get access to the Hooked Wallet, which enables them to maneuver and orient with Web3 transactions, such as transferring cryptocurrency tokens, <a href=\"https://cointelegraph.com/explained/crypto-to-crypto-swaps-explained\">swapping</a> and staking.</p><p>The protocol intends to build a blockchain infrastructure with rollup applicability, which will facilitate the consolidation of all ecosystem assets and data. Moving computational logic and data onto application rollups will make the protocol scalable.</p><h2>What is Hooked Protocol?</h2><p></p><p><em>For the uninitiated, the complexity of cryptocurrencies has been a steep barrier in onboarding. Hooked Protocol efficiently combines the learning of the cryptocurrency environment with GameFi.</em></p><p>The size of the global cryptocurrency market is set to rise to $13.18 billion by 2030, surging at a compound annual growth rate (CAGR) of 12.5% in the forecast period (2023–2030). However, despite the volume, the mainstream adoption of the technology is too slow.</p><p>Launched in late 2022, Hooked Protocol is a gamified social learning platform building an interactive and <a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-understanding-the-layers-of-blockchain-technology\">gamified on-ramp layer</a> for new users to hop into the Web3 world. The focus is on encouraging massive Web3 adoption by onboarding users through education that is engaging and keeps the users hooked. Running on the <a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-the-bnb-chain-the-evolution-of-the-binance-smart-chain\">BNB Smart Chain</a>, the protocol also deploys the learn-and-earn concept.</p><p>As an experience-based Web3 education platform, Hooked Protocol opens the doors of the innovative Web3 ecosystem to a largely untapped audience. It seeks to resolve major challenges hindering Web3 adoption, namely the lack of adequate Web3 education and high barriers to entry. Through a gamified experience, one can learn how to acquire, hold, trade and profit from a cryptocurrency.</p>The protocol enables and accelerates the Web3 transformation of developers and applications. Capitalizing on decentralized social networks, it helps build a thriving community with scalability.</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-05T12:49:07.000Z",
    "title": "Former Celsius CEO Alex Mashinsky loses motion to dismiss civil fraud lawsuit",
    "url": "https://cryptoslate.com/former-celsius-ceo-alex-mashinsky-loses-motion-to-dismiss-civil-fraud-lawsuit/",
    "description": "<p>Alex Mashinsky failed to get the civil lawsuit brought against him by New York Attorney General Letitia James thrown out in court on August 4. A Manhattan state court judge gave the green light for James&#8217; suit to proceed, denying Mashinsky&#8217;s motion to dismiss the suit that accuses him of committing civil fraud, Bloomberg reported. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/former-celsius-ceo-alex-mashinsky-loses-motion-to-dismiss-civil-fraud-lawsuit/\">Former Celsius CEO Alex Mashinsky loses motion to dismiss civil fraud lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-05T14:53:29.000Z",
    "title": "Decentralized Hedge Fund VC Spectra Reports Strong Demand for Its Presale",
    "url": "https://www.cryptoglobe.com/latest/2023/08/decentralized-hedge-fund-vc-spectra-reports-strong-demand-for-its-presale/",
    "description": "London, United Kingdom, August 5th, 2023, Chainwire Decentralized hedge fund VC Spectra has reported strong demand for its Stage 2 presale. The token sale has drawn considerable interest from early investors and underlined VC Spectra’s potential to redefine the crypto industry. Priding itself on democratizing access to investment opportunities, VC Spectra has carved a distinct niche for […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-05T14:44:56.000Z",
    "title": "Crypto Market’s Fate Is Tied to the S&P 500, Warns Crypto Analyst",
    "url": "https://www.cryptoglobe.com/latest/2023/08/crypto-markets-fate-is-tied-to-the-sp-500-warns-crypto-analyst/",
    "description": "Prominent pseudonymous crypto analyst “DonAlt” recently offered his perspective on the intriguing interplay between the S&amp;P 500 and the crypto market. DonAlt, who has over 500,000 followers on X (formerly known as Twitter), posits that the fortunes of Bitcoin, and the broader crypto market, are closely tethered to the stock market’s performance. His cautionary note […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-05T15:30:00.000Z",
    "title": "Bitcoin Price Analysis:  Drawn to 29164 Level - 6 August 2023",
    "url": "https://cryptodaily.co.uk/2023/08/bitcoin-price-analysis-drawn-to-29164-level-6-august-2023",
    "description": "<p>BTC/USD Orbiting 29164 Technicals:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 6 August 2023</p>\n<p>Bitcoin (BTC/USD) awaited a new directional bias early in the Asian session as the pair continued to trade technically following several sessions of relatively sideways trading.&nbsp; Buying pressure recently emerged around the 28477 area after a downward move that represented a test of a downside price objective related to selling pressure that strengthened around the 31862.21 and 30421.29 areas.&nbsp; The 29164.09 area continues to be a major level for BTC/USD, representing a previous downside price objective related to selling pressure that intensified around the 30350.70 area.&nbsp; Additional downside price objectives linked to recent selling pressure include the 28432, 28213, 28137, 27979, 27757, 27430, 27409, 27338, 27312, 27246, 26501, 26348, and 26199 levels.&nbsp; Also, the 28095.44 area represents the 23.6% retracement of the historic depreciating range from 69000 to 15460.&nbsp;&nbsp;</p>\n<p>Following recent upside activity, areas of technical support and potential buying pressure include the 28306, 27466, 26428, and 26272 levels.&nbsp; Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 29255.07 and the&nbsp;200-bar MA&nbsp;(Hourly) at 29265.19.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bearishly below MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-05T13:45:00.000Z",
    "title": "Judge Throws Out Class Action Suit Against Bitfinex And Tether",
    "url": "https://cryptodaily.co.uk/2023/08/judge-throws-out-class-action-suit-against-bitfinex-and-tether",
    "description": "<p>Laura Swain, the Chief Judge of the U.S. District Court for the Southern District Of New York, has dismissed a class action lawsuit against USDT issuer Tether and its sister company Bitfinex.&nbsp;</p>\n<p>The lawsuit was brought on by plaintiffs who alleged Tether was falsely advertising its USDT stablecoin.&nbsp;</p>\nA Big Win For Tether And Bitfinex&nbsp;\n<p>The ruling is being seen as a significant win for the two entities and was announced in a blog post published on Tether&rsquo;s official website. The post stated that the Chief Judge delivered a comprehensive and incisive 6-page decision, including an order to dismiss the class action lawsuit against the two entities, adding that it lacked merit. The post stated,</p>\n\n<p>&ldquo;Today, Chief Judge Laura Taylor Swain of the U.S. District Court for the Southern District Of New York issued a comprehensive and incisive 6-page decision that included an order dismissing the meritless class action lawsuit filed by Matthew Anderson and Shawn Dolifka against Tether and Bitfinex companies in its entirety.&rdquo;</p>\n\n<p>The lawsuit was brought on by plaintiffs Shawn Dolifka and Matthew Anderson. The plaintiffs claimed that Tether had falsely advertised its USDT stablecoin being backed in a 1:1 ratio by the U.S. dollar. However, the court did not buy their argument. Tether added that the fact that the entirety of the lawsuit was dismissed at such an early stage showed that the allegation against it and Bitfinex were devoid of any merit.&nbsp;</p>\nTether And Bitfinex CTO Reacts&nbsp;\n<p>The verdict sparked a wave of reactions from the crypto ecosystem. Paolo Ardoino, Tether, and Bitfinex CTO took to X (formerly Twitter) and expressed his satisfaction with the ruling.&nbsp;</p>\n\n<p>&ldquo;Tether and Bitfinex Win Comprehensive Legal Victory as U.S. District Court Dismisses Class Action Lawsuit The Court correctly held that the plaintiffs&rsquo; complaint lacked any &ldquo;plausible allegations of injury&rdquo; because it includes no facts showing that &ldquo;USDT had a diminished actual value at all.&rdquo;</p>\n\n<p>Prominent Bitcoin lawyer Stuart Hoegner applauded the Tether team&rsquo;s efforts and broke down the court ruling in a long thread on X.&nbsp;</p>\nThe Court Ruling&nbsp;\n<p>The court gave several reasons for throwing out the lawsuit. It stated that the plaintiffs had not provided sufficient facts in the case nor mentioned the buying or selling price of USDT for the plaintiffs. The court further added that market data showed that USDT still maintains its peg with the USD at $1, and even if there were misrepresentations from the defendant&rsquo;s side, there was no evidence that showed USDT had lost its value.&nbsp;</p>\nThe Complaint In Question&nbsp;\n<p>The case stems from a complaint filed in 2021 when the plaintiffs, Shawn Dolifika and Matthew Anderson, claimed that Tether&rsquo;s statement that its USDT was backed by the U.S. dollar in a 1:1 peg was false. According to the complaint, Tether and Bitfinex did not maintain adequate reserves for the USDT in circulation. Furthermore, the complaint also alleged that the reserves did not contain USD as advertised but were a mix of assets such as overcollateralized loans and undisclosed commercial paper.&nbsp;</p>\n\n<p>&ldquo;Defendants did not maintain the same amount of reserves as Tether tokens in circulation. At times, Defendants had no reserves whatsoever. Further, these reserves did not contain U.S. dollars, as Tether suggested, but were a mix of other assets, such as overcollateralized loans and other undisclosed commercial paper.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-05T12:08:28.000Z",
    "title": "Decentralized Hedge Fund VC Spectra Reports Strong Demand for Its Presale",
    "url": "https://cryptodaily.co.uk/2023/08/decentralized-hedge-fund-vc-spectra-reports-strong-demand-for-its-presale",
    "description": "<p>London, United Kingdom, August 5th, 2023, Chainwire</p><p>Decentralized hedge fund VC Spectra has reported strong demand for its Stage 2 presale. The token sale has drawn considerable interest from early investors and underlined VC Spectra's potential to redefine the crypto industry.</p><p>Priding itself on democratizing access to investment opportunities, VC Spectra has carved a distinct niche for itself. The on-chain hedge fund extends the availability of early-stage investments to non-accredited investors, thereby bridging a significant market gap.</p><p>Investors opting for the SPCT token can leverage an array of unique benefits. These perks include quarterly dividends and buybacks, voting rights, and early access to initial coin offerings (ICOs).&nbsp;</p><p>The SPCT token, developed on the Bitcoin blockchain using the BRC-20 standard, provides a robust mechanism for decentralized trading, asset management, and transaction facilitation within the Spectra platform. The Spectra Token (SPCT) is the main currency within the Spectra ecosystem, enabling access to different services on the platform.</p><p>By implementing a deflationary model featuring a burn mechanism for the SPCT token, the decentralized hedge fund aims to decrease token circulation gradually. When coupled with VC Spectra's unique investment offerings, this novel approach further solidifies SPCT 's standing in the crypto market.&nbsp;</p><p>The Vc Spectra public presale is currently in Stage 2 and has already seen robust demand. The SPCT token, which started at $0.008 during Stage 1, increased to $0.011 in Stage 2. In the upcoming Stage 3, the token price will increase to $0.025. This is an increase of 213% from the initial token price. Currently, VC Spectra (SPCT) is offering a 25% bonus for all investor deposits.</p><p>About VC Spectra</p><p>Spectra is a leading firm driving innovation in Fintech and blockchain through strategic investments and ICOs, empowering financial growth by harnessing cutting-edge technologies.</p><p>Spectra VC is a venture capital fund that invests in blockchain and technology-based projects with the goal of generating returns for investors.</p><p>Find out more about the VC Spectra presale here:</p><p>Presale&nbsp;|&nbsp;Website&nbsp;&nbsp;|&nbsp;Telegram&nbsp;|&nbsp;Twitter</p>ContactPaul HubwardVC Spectrapr@hubward.co"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-05T15:30:55.000Z",
    "title": "X Will ‘Never’ Launch a Crypto Token, Says Musk",
    "url": "https://news.bitcoin.com/x-will-never-launch-a-crypto-token-says-musk/",
    "description": "<img width=\"768\" height=\"433\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2318800337-768x433.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"X Will ‘Never’ Launch a Crypto Token, Says Musk\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2318800337-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2318800337-1024x577.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2318800337-768x433.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2318800337-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2318800337-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2318800337-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2318800337.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Tech investor Elon Musk said that his social media platform X, formerly Twitter, will never launch its own cryptocurrency token. He made the statement in response to a post by a user of the networking service warning about fake coin projects exploiting Musk’s name and that of the platform. Elon Musk Categorically Rejects Notion of [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-05T14:14:30.000Z",
    "title": "Biggest Movers: SHIB Surges to 3-Month High to Start the Weekend",
    "url": "https://news.bitcoin.com/biggest-movers-shib-surges-to-3-month-high-to-start-the-weekend/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2077004044-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers:  SHIB Surges to a 3-Month High to Start the Weekend\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2077004044-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2077004044-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2077004044-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2077004044-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2077004044-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2077004044-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2077004044-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Shiba inu was a notable gainer during Saturday’s session, as the meme coin climbed to a three-month high. The move comes as traders continue to react to Binance’s decision to approve the coin as a collateral asset, in addition to the upcoming launch of Shibarium. Dogecoin also snapped its recent losing streak today. Shiba Inu [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-05T12:02:37.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC, ETH Extend Declines on Saturday, as Markets React to Latest NFP Report",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-eth-extend-declines-on-saturday-as-markets-react-to-latest-nfp-report/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2085365080-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC, ETH Extend Declines on Saturday, as Markets React to Latest NFP Report\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2085365080-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2085365080-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2085365080-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2085365080-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2085365080-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2085365080-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2085365080.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin started the weekend trading below the $29,000 level, as markets continued to react to the latest U.S. nonfarm payrolls (NFP) report. 187,000 jobs were added to the economy in July, less than the 200,000 markets had expected. Ethereum neared a multi-week low. Bitcoin Bitcoin (BTC) dropped to below the $29,000 level on Saturday, as [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-05T11:00:41.000Z",
    "title": "INSR Token to be Listed on MEXC Global Exchange on August 7",
    "url": "https://news.bitcoin.com/insr-token-to-be-listed-on-mexc-global-exchange-on-august-7/",
    "description": "<img width=\"768\" height=\"433\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/caae984a-142d-4492-92ad-fb59bbf6061d-768x433.jpeg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/caae984a-142d-4492-92ad-fb59bbf6061d-300x169.jpeg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/caae984a-142d-4492-92ad-fb59bbf6061d-768x433.jpeg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/caae984a-142d-4492-92ad-fb59bbf6061d-190x107.jpeg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/caae984a-142d-4492-92ad-fb59bbf6061d-380x214.jpeg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/caae984a-142d-4492-92ad-fb59bbf6061d-760x428.jpeg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/caae984a-142d-4492-92ad-fb59bbf6061d.jpeg 900w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. MEXC is excited to inform that the revolutionary cryptocurrency INSR Token, aimed at providing secure investments on decentralized pre-sale platforms, will be officially listed on the MEXC Global Exchange on August 7. This listing represents an important milestone for the INSR Token project and a new step in our mission to provide the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T16:03:40.000Z",
    "title": "A deep dive into the true impact of the XRP ruling",
    "url": "https://www.cryptopolitan.com/deep-dive-into-the-impact-of-the-xrp-ruling/",
    "description": "The ruling against Ripple Labs, it&#8217;s crypto XRP, and its executives by the U.S. District Court of the Southern District of New York has sent ripples through the industry, opening up a labyrinth of legal interpretations and setting a precedent that could shape the future of digital assets. This case, centering on the sale and ... <a title=\"A deep dive into the true impact of the XRP ruling\" class=\"read-more\" href=\"https://www.cryptopolitan.com/deep-dive-into-the-impact-of-the-xrp-ruling/\" aria-label=\"More on A deep dive into the true impact of the XRP ruling\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T16:02:15.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T15:55:30.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T15:45:45.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T15:26:14.000Z",
    "title": "Valkyrie seeks to convert its Bitcoin ETF to a Bitcoin and Ether dual offering",
    "url": "https://www.cryptopolitan.com/valkyrie-seeks-to-convert-its-bitcoin-etf-to-a-bitcoin-and-ether-dual-offering/",
    "description": "Financial powerhouse Valkyrie aims to innovate its current Bitcoin Strategy exchange-traded fund (ETF) by adding Ether to its portfolio, creating a novel strategy for the digital assets market. According to filings scheduled for October 3, 2023, the firm intends to revamp its existing ETF into a Bitcoin and Ether Strategy ETF. Valkyrie&#8217;s current ETF, traded ... <a title=\"Valkyrie seeks to convert its Bitcoin ETF to a Bitcoin and Ether dual offering\" class=\"read-more\" href=\"https://www.cryptopolitan.com/valkyrie-seeks-to-convert-its-bitcoin-etf-to-a-bitcoin-and-ether-dual-offering/\" aria-label=\"More on Valkyrie seeks to convert its Bitcoin ETF to a Bitcoin and Ether dual offering\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T15:05:32.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T15:00:30.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T14:12:51.000Z",
    "title": "Celsius founder gets ready for New York fraud suit",
    "url": "https://www.cryptopolitan.com/celsius-founder-gets-ready-for-ny-fraud-suit/",
    "description": "Celsius founder Alex Mashinsky, the once influential chief of the now-defunct cryptocurrency lender, finds himself in the unenviable position of preparing to face a New York fraud lawsuit. The legal storm that has been gathering for months now seems ready to break, with a state court judge ruling that the founder must answer for allegations ... <a title=\"Celsius founder gets ready for New York fraud suit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/celsius-founder-gets-ready-for-ny-fraud-suit/\" aria-label=\"More on Celsius founder gets ready for New York fraud suit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T14:07:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-05T13:59:33.000Z",
    "title": "UBS prepares for investment bank overhaul",
    "url": "https://www.cryptopolitan.com/ubs-prepares-for-investment-bank-overhaul/",
    "description": "The global banking giant UBS is bracing for a significant restructuring within its investment banking division. Following the emergency acquisition of Credit Suisse in June, the transformation marks a critical juncture in the integration process. The restructuring underscores a determined, though possibly brutal, effort by UBS to merge operations with Credit Suisse, casting the future ... <a title=\"UBS prepares for investment bank overhaul\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ubs-prepares-for-investment-bank-overhaul/\" aria-label=\"More on UBS prepares for investment bank overhaul\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-05T14:38:12.000Z",
    "title": "ChatGPT Top DeFi Token Picks This Month – Chainlink, Avalanche Crypto, Tradecurve",
    "url": "https://nulltx.com/chatgpt-top-defi-token-picks-this-month-chainlink-avalanche-crypto-tradecurve/",
    "description": "ChatGPT, an AI-powered language model, has analyzed the market and identified three DeFi tokens that show significant promise this month: Chainlink (LINK), Avalanche Crypto (AVAX), and Tradecurve (TCRV). In this article, we&#8217;ll explore each token&#8217;s features and potential growth, giving you insights into these DeFi picks. Summary Chainlink soars after new partnership Avalanche Crypto to [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-08-05T14:35:24.000Z",
    "title": "Solana Explorer shows off Ramping into Bitcoin Alternatives like Bitcoin Spark",
    "url": "https://nulltx.com/solana-explorer-shows-off-ramping-into-bitcoin-alternatives-like-bitcoin-spark/",
    "description": "Solana is among the leading blockchain platforms, offering its clients various perks. The network was created to improve decentralized traits such as transactional speed, interoperability, and scalability. Bitcoin and Ethereum have less TPS making the transactional cost to be high. Bitcoin Spark will consider all these problems through its proof-of-process mechanism, facilitating sustainability within the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-08-05T11:51:21.000Z",
    "title": "Top 3 Deflationary Token Mechanisms",
    "url": "https://nulltx.com/top-3-deflationary-token-mechanisms/",
    "description": "Token deflationary refers to a mechanism in the cryptocurrency world designed to reduce the total supply of a token over time, ultimately increasing its scarcity and potentially driving up its value. The concept has gained popularity as a way to counteract inflationary pressures in the long term and incentivize token holders to hold on to [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-05T15:48:58.000Z",
    "title": "Bitcoin prices must break $100,000 for crypto miners to stay profitable",
    "url": "https://crypto.news/bitcoin-prices-must-break-100000-for-crypto-miners-to-stay-profitable/",
    "description": "Bitcoin prices must not only more than triple to $100,000 but should be sustained above this level for miners to remain profitable in 2024 and beyond"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-05T14:58:29.000Z",
    "title": "Ex-Celsius CEO must respond to NY lawsuit",
    "url": "https://crypto.news/ex-celsius-ceo-must-respond-to-ny-lawsuit/",
    "description": "Former CEO of Celsius Network, Alex Mashinsky, must respond to a lawsuit by NY Attorney General Letitia James"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-05T12:29:36.000Z",
    "title": "Dogecoin struggling, investors examining Copium",
    "url": "https://crypto.news/dogecoin-struggling-investors-examining-copium/",
    "description": "Copium recently burned tokens and together with other plans like a buy-back program, the project is now more popular than Dogecoin"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-05T12:27:38.000Z",
    "title": "Coinbase will remain in US despite regulatory uncertainty",
    "url": "https://crypto.news/coinbase-will-remain-in-us-despite-regulatory-uncertainty/",
    "description": "Coinbase CEO Brian Armstrong has affirmed their commitment to remain in the US, dismissing any notion of departure"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-05T12:07:34.000Z",
    "title": "Judge dismisses Tether, Bitfinex class action lawsuit",
    "url": "https://crypto.news/judge-dismisses-tether-bitfinex-class-action-lawsuit/",
    "description": "The class action lawsuit against Tether, the issuer of USDT, and Bitfinex, the crypto exchange, has been dismissed by a New York court"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-05T16:05:59.000Z",
    "title": "Bone ShibaSwap Among Weekend 100 Biggest Hitters With 25% Rally",
    "url": "https://www.newsbtc.com/all/bone-shibaswap-rises-25/",
    "description": "The cryptocurrency market is currently growing in a variety of ways, but the Shiba Inu (SHIB) ecosystem&#8217;s tokens are currently noticeably on a positive run. Bone ShibaSwap (BONE), one of the leading tokens in the meme coin ecosystem, is on a clear uptrend, rising as much as 5.6% in the previous day to $1.74. The coin has increased by more than 25% over the last week as a result of the ecosystem&#8217;s overall buzz. The price of Bone Shibaswap has made a significant recovery in recent months. After soaring to a high of $1.7410, the highest point since March, it exceeded several of the initially pessimistic expectations. BONE price all in green in the weekend chart. TradingView.com BONE Showing Solid Performance While the price of Bitcoin and Ethereum has stabilized, the BONE cryptocurrency has increased by more than 130% since its June lows. The anticipation stems from the belief that the upcoming August mainnet release of Shibarium will mark the beginning of a transformative era. Ever since the launch timeline was disclosed earlier, members of the community have been attributing special significance to this event, particularly emphasizing the role of BONE. BONEUSD trading at $1.74 on the weekly chart: TradingView.com This enthusiasm is fueled by the potential impact of Shibarium&#8217;s launch on the overall landscape and the specific importance of BONE within this context. The idea of a crypto exchange is among the most crucial ones in the field of crypto. Because cryptocurrencies don&#8217;t have an inherent worth, having a market where they may be purchased, sold, or traded aids in determining their price. Related Reading: XRP Performance Woes: How Might Its Price Respond To Current Market Realities? To address possible problems with conventional, centralized exchanges (CEXes), decentralized exchanges, or DEXes, were developed. People can trade any cryptocurrency they want for any cryptocurrency they want at a price determined by the market, rather than being restricted to what a centralized authority says can and cannot be listed. Source: CoinMarketCap ShibaSwap is one of many decentralized exchanges available and is built on the Ethereum (ETH) network. The Bone ShibaSwap (BONE) crypto token serves as its backbone. It was established in 2021 by the team behind the Shiba Inu (SHIB) cryptocurrency. Shibarium Launch Boosts Token&#8217;s Price The impending arrival of Shibarium is the main reason why Bone Shibaswap is so high. To begin with, Shibarium is a forthcoming layer 2 network that aims to alter how Shiba Inu and ShibaSwap operate. Related Reading: All Hype? BALD Meme Coin’s Volume Shaved By 96% Meanwhile, in the last week, BONE outpaced the top performers in the market, including Bitcoin (BTC) and Ethereum (ETH). For the first time in nearly five months, the asset has broken above $1.6 thanks to the latest climb. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from "
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-05T15:00:11.000Z",
    "title": "Ethereum ETF Race Gets Hotter As SEC Receives 11 Filings In One Week",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-etf-race-gets-hotter/",
    "description": "The United States Securities and Exchange Commission (SEC) has been flooded with many applications for Ethereum (ETH) Exchange-Traded Funds (ETFs) in just one week. The applications currently stand at 12, with the latest addition coming from ProShares, a popular fund manager.  The platform filed four applications for Ether-based ETFs, including a dual Ether and Bitcoin futures strategy ETF, an Ether Strategy ETF, and a short Ether Strategy ETF.  Will The SEC Approve An Ethereum Futures ETF? The recent surge in applications started on the 28th of July this year after Volatility Shares filed its application. Ever since, other asset management companies, including ProShares, Roundhill Financial,  Bitwise, Van Eck, and Grayscale Investment, have filled submissions, with some bringing multiple applications.  Related Reading: These Are The Factors That Could Lead To Another Bitcoin Rally: ARK Invest The most recent application, filed on August 3 by ProShares, proposes an equal-weight Bitcoin and Ether ETF to measure the performance of holding long positions in the nearest maturing monthly Ether and Bitcoin contracts.  According to renowned Financial Expert at Bloomberg Intelligence, James Seyffart, ProShare filed four separate applications with the SEC. Bitwise also submitted three applications, while Grayscale Investments filed two applications.  However, despite the growing optimism, it remains to be seen if the Securities and Exchange Commission will approve these filings. The SEC has never approved an ETF that tracks Ether Futures contracts, unlike Bitcoin Futures ETFs that have been around since October 2021. Many market experts have argued that these applications are a mere gamble by these asset management companies, who do not want to miss out on being the first Ethereum ETF in the United States.  ETH price holds steady above $1,830 amid ETF race &#124; Source: ETHUSD on Tradingview.com The likelihood of receiving the SEC’s approval remains slim as the regulatory body has never approved an Ethereum futures ETF filing. Add to the mix the consistent refusal of SEC’s Chair, Gary Gensler, consistent refusal to answer if the agency considers ETH a security. This has further compounded regulatory uncertainty around the network. If none of the applications before the SEC get denied, the Ether ETFs will launch 75 days from their respective filing dates. Analysts expect the Volatility Shares ETF to lead the charge on 12th October.  Understanding The Difference Between Futures And Spot ETF Products The primary difference between futures and spot ETF products lies in the fact that while the former tracks the price of futures contracts, the latter requires the issuers to purchase the underlying assets. Spot ETFs are generally considered more valid since they require the fund manager to purchase and hold underlying assets.  Related Reading: Bank Of Canada Study Shows Crypto Ownership In The Country Fell In The Last 2 Years The current spike in Ether-based applications comes amidst a wave of filings from leading asset management companies, including BlackRock, the world’s largest asset manager, among others. These companies are looking to offer the first spot in Bitcoin ETF in the US.  Investors and members of the crypto community remain expectant of the outcome of the SEC’s consideration of the applications lying before it. Whatever decision the agency takes is likely to affect the attractiveness and accessibility of crypto investments, especially for larger institutional investors.  Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-05T12:54:10.000Z",
    "title": "Binance Celebrates Significant Milestone After Six Years In Operation",
    "url": "https://www.newsbtc.com/binance/binance-celebrates-significant-milestone/",
    "description": "Binance, the world&#8217;s largest crypto exchange by trading volume, has achieved another significant milestone. The firm, which recently turned six, keeps racking up several achievements despite the FUD that has surrounded it in recent times.  A Worthy Feat For Binance The world’s largest crypto exchange by daily trading volume has recently disclosed that its registered users now stand at a whopping 150 million. This was revealed in a tweet by its CEO, Changpeng “CZ” Zhao, on Thursday.  Related Reading: Bitstamp Makes Highly Anticipated XRP Announcement, But Does It Live Up To The Hype? In the tweet, CZ noted his company’s milestone amidst growing regulatory scrutiny of its operations the world over. However, despite navigating through different challenges, Binance has managed to captivate the interest of several millions of users around the globe. So this is a testament to the platform’s quality service delivery and amazing features.  Just over a year ago, in July 2022, the exchange’s user base stood at about 120 million. The astonishing growth of 30 million users within the span of just 12 months tells of Binance’s undeniable hold in the constantly evolving cryptocurrency ecosystem.  A cursory look at the platform&#8217;s traffic data for the last three months shows that the top five nations contributing to this spike are Vietnam, India, Russia, Turkey, and Argentina. The increased expansion across various diverse geographies demonstrates the heightened acceptance and penetration of digital currencies.  BNB price trends at $241 as users base reaches new high &#124; Source: BNBUSD on Tradingview.com Navigating Regulatory Challenges As expected, with growth comes challenges and Binance’s journey has not always been all growth and triumph. The platform has been the subject of various legal challenges across diverse jurisdictions.  The exchange was recently charged with “will evasion” and fraud by the United States Securities and Exchange Commission (SEC) in June this year. In Europe, Binance is under probe by French regulators who accused the platform of engaging in money laundering. It has also been ordered to cease rendering crypto services by Belgium’s financial watchdog.  In China, the services of the platform are restricted and inaccessible to millions of users within the country. Binance has also withdrawn its license applications and canceled its registration bids in several countries.  Related Reading: Crypto Trading Volumes Fall To Lowest Level In 2023 Amid Bear Market Woes However, Binance has been able to make some gains in recent times. Earlier this month, it restored services in Japan, following the purchase of the local exchange Sakura Exchange BitCoin (SEBC) in November 2022. It has also been given a license to render cryptocurrency services in Dubai.  All these hurdles make the latest milestone not only remarkable but testamentary. The road to 150 million registered users has been paved with various challenges, but Binance has so far emerged victorious and triumphant.  Featured image from Reuters, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-05T15:30:46.000Z",
    "title": "Solana (SOL) Price Slumps 5% in 7 Days As Investors Flock to Anarchy (ANA) for Bigger Gains",
    "url": "https://www.crypto-news-flash.com/solana-sol-price-slumps-5-in-7-days-as-investors-flock-to-anarchy-ana-for-bigger-gains/?utm_source=rss&utm_medium=rss&utm_campaign=solana-sol-price-slumps-5-in-7-days-as-investors-flock-to-anarchy-ana-for-bigger-gains",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T151907.735.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T151907.735.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T151907.735-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The altcoin crackdown took its toll on the cryptocurrency market, driving most altcoins well below their yearly highs in 2023. Even Ripple&#8217;s lawsuit victory only brought small relief before other tokens began to dip again. Solana (SOL) doesn&#8217;t seem to mind the overall depression, though. The SOL price climbed to a 150-day high in July, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-05T14:31:01.000Z",
    "title": "Pikamoon vs. Shiba Inu (SHIB): Which Token Holds More Profit Potential for Investors?",
    "url": "https://www.crypto-news-flash.com/pikamoon-vs-shiba-inu-shib-which-token-holds-more-profit-potential-for-investors/?utm_source=rss&utm_medium=rss&utm_campaign=pikamoon-vs-shiba-inu-shib-which-token-holds-more-profit-potential-for-investors",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T130217.046.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T130217.046.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T130217.046-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T130217.046-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the fast-growing cryptocurrency space, certain projects have become dominant players in different segments of the industry. Shiba Inu (SHIB) is often referred to as the “Dogecoin Killer,” while Pikamoon is known as a rising star in the gameFi and meme coin space. Deciding which of these two projects offers investors greater upside potential becomes [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-05T13:50:55.000Z",
    "title": "Why Shiba Inu’s Bullish Streak Could Be a Game Changer for Tradecurve",
    "url": "https://www.crypto-news-flash.com/why-shiba-inus-bullish-streak-could-be-a-game-changer-for-tradecurve/?utm_source=rss&utm_medium=rss&utm_campaign=why-shiba-inus-bullish-streak-could-be-a-game-changer-for-tradecurve",
    "description": "<img width=\"512\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T154955.845.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T154955.845.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T154955.845-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cryptocurrency is a constantly changing market, and new winners are always emerging.  The latest one to catch the eye of market experts is Tradecurve (TCRV), a rising player that is believed will follow or even surpass the bullish streak of well-known cryptos like Shiba Inu (SHIB).             &#62;&#62;Register For The [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-05T12:24:29.000Z",
    "title": "New Hinman Documents and Ethereum’s Joe Lubin Raise Outrage from XRP Community",
    "url": "https://www.crypto-news-flash.com/new-hinman-documents-and-ethereums-joe-lubin-raise-outrage-from-xrp-community/?utm_source=rss&utm_medium=rss&utm_campaign=new-hinman-documents-and-ethereums-joe-lubin-raise-outrage-from-xrp-community",
    "description": "<img width=\"512\" height=\"279\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71-300x163.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Newly released documents show Joseph Lubin brought William Hinam and Vitalik Buterin together before the SEC director&#8217;s speech in 2018. Outrage sparked within the XRP community with some stating that the Hinman speech was actually &#8220;The Ether Speech&#8221;. In the latest controversial revelation, oversight watchdog group Empower Oversight released a new batch of documents for [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-05T12:01:54.000Z",
    "title": "Decentralized Hedge Fund VC Spectra Reports Strong Demand for Its Presale",
    "url": "https://www.crypto-news-flash.com/decentralized-hedge-fund-vc-spectra-reports-strong-demand-for-its-presale/?utm_source=rss&utm_medium=rss&utm_campaign=decentralized-hedge-fund-vc-spectra-reports-strong-demand-for-its-presale",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/png_20230620_224536_0000_1024x603_1691150442Cs2WGZ4mMD.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/png_20230620_224536_0000_1024x603_1691150442Cs2WGZ4mMD.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/png_20230620_224536_0000_1024x603_1691150442Cs2WGZ4mMD-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/png_20230620_224536_0000_1024x603_1691150442Cs2WGZ4mMD-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/png_20230620_224536_0000_1024x603_1691150442Cs2WGZ4mMD-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />London, United Kingdom, August 5th, 2023, Chainwire Decentralized hedge fund VC Spectra has reported strong demand for its Stage 2 presale. The token sale has drawn considerable interest from early investors and underlined VC Spectra&#8217;s potential to redefine the crypto industry. Priding itself on democratizing access to investment opportunities, VC Spectra has carved a distinct [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-05T12:01:47.000Z",
    "title": "Bigger Bitcoin Mining Companies are already making the switch to this new Coin",
    "url": "https://www.crypto-news-flash.com/bigger-bitcoin-mining-companies-are-already-making-the-switch-to-this-new-coin/?utm_source=rss&utm_medium=rss&utm_campaign=bigger-bitcoin-mining-companies-are-already-making-the-switch-to-this-new-coin",
    "description": "<img width=\"512\" height=\"359\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T122426.278.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T122426.278.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T122426.278-300x210.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Crypto players invest in pursuit of profitability, and as new solutions emerge, new projects attract the interest of major participants in the mining industry. Bitcoin mining companies are now switching to this innovative coin, recognizing its potential to revolutionize the mining landscape. With its unique features and promising advancements, Bitcoin Spark is poised to challenge [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-05T11:09:00.000Z",
    "title": "BlackRock’s ESG Dilemma: A Rocky Path Between Climate Goals and Appointing Saudi Aramco Head",
    "url": "https://www.crypto-news-flash.com/blackrocks-esg-dilemma-a-rocky-path-between-climate-goals-and-appointing-saudi-aramco-head/?utm_source=rss&utm_medium=rss&utm_campaign=blackrocks-esg-dilemma-a-rocky-path-between-climate-goals-and-appointing-saudi-aramco-head",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />BlackRock faces public scrutiny for its recent environmental record and the appointment of Saudi Aramco&#8217;s head to its board, contradicting its stance on climate-friendly policies. Despite initiatives like Net Zero Asset Managers, BlackRock received a C+ grade in InfluenceMap’s Asset Managers &#38; Climate Change Report 2023, raising concerns over the firm&#8217;s commitment to eco-friendly practices. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-05T11:06:51.000Z",
    "title": "Solana’s Speed vs. VC Spectra’s Potential: The Smart Investment for Long-Term Gains",
    "url": "https://www.crypto-news-flash.com/solanas-speed-vs-vc-spectras-potential-the-smart-investment-for-long-term-gains/?utm_source=rss&utm_medium=rss&utm_campaign=solanas-speed-vs-vc-spectras-potential-the-smart-investment-for-long-term-gains",
    "description": "<img width=\"512\" height=\"301\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T120743.279.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T120743.279.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-05T120743.279-300x176.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Solana (SOL) has been seeing steady price increases in the past few days, and it recently published its performance report stating that it experienced no downtime in Q2 of 2023. On the other hand, VC Spectra (SPCT) comes in and blows away all competition thanks to the utility and services it offers, services that will [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-05T11:59:00.000Z",
    "title": "DOGE May Gain on BTC in the Coming Few Days, Predicts Analyst",
    "url": "https://coinedition.com/doge-may-gain-on-btc-in-the-coming-few-days-predicts-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/MacnBTC_believes_investing_in_the_meme_token_Dogecoin_DOGE_would.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"DOGE May Gain on BTC in the Coming Few Days, Predicts Analyst\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/MacnBTC_believes_investing_in_the_meme_token_Dogecoin_DOGE_would.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/MacnBTC_believes_investing_in_the_meme_token_Dogecoin_DOGE_would-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/MacnBTC_believes_investing_in_the_meme_token_Dogecoin_DOGE_would-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/MacnBTC_believes_investing_in_the_meme_token_Dogecoin_DOGE_would-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/MacnBTC_believes_investing_in_the_meme_token_Dogecoin_DOGE_would-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/MacnBTC_believes_investing_in_the_meme_token_Dogecoin_DOGE_would-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>KALEO predicted in a tweet today that DOGE may strengthen against BTC in the next few days. At press time, DOGE was up 2.74% against the leading cryptocurrency. A symmetrical triangle had formed on the daily chart for DOGE/BTC, which suggested that a breakout may soon take place. The trader and analyst KALEO revealed in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/doge-may-gain-on-btc-in-the-coming-few-days-predicts-analyst/\">DOGE May Gain on BTC in the Coming Few Days, Predicts Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-05T11:15:00.000Z",
    "title": "CertiK Alert Issues Red Flag on a Discord Server Breach, Honeypot Scams",
    "url": "https://coinedition.com/certik-alert-issues-red-flag-on-a-discord-server-breach-honeypot-scams/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"CertiK Alert Issues Red Flag on a Discord Server Breach, Honeypot Scams\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/BLOCKCHAIN-3-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>CertiK alerts the community of the Clique Discord breach. SeaPad token scam drained liquidity, flagged by CertiK Alert for deployer-linked manipulation. CertiK Alert uncovers $40k liquidity theft in MOAM scam. In a swift and vigilant response to a potential breach, the CertiK Alert, a prominent purveyor of real-time insights into the crypto realm, issued an [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/certik-alert-issues-red-flag-on-a-discord-server-breach-honeypot-scams/\">CertiK Alert Issues Red Flag on a Discord Server Breach, Honeypot Scams</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-05T14:30:40.000Z",
    "title": "One Catalyst Could Trigger Ethereum To Plunge 50%+ Against Bitcoin, Says Top Crypto Analyst Benjamin Cowen",
    "url": "https://dailyhodl.com/2023/08/05/one-catalyst-could-trigger-ethereum-to-plunge-50-against-bitcoin-says-top-crypto-analyst-benjamin-cowen/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Ethereum-To-Plunge-50.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Ethereum-To-Plunge-50.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Ethereum-To-Plunge-50.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Ethereum-To-Plunge-50.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Ethereum-To-Plunge-50.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Ethereum-To-Plunge-50.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Ethereum-To-Plunge-50.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Widely followed crypto analyst Benjamin Cowen says that one event could cause Ethereum (ETH) to plummet relative to Bitcoin (BTC). In a new interview with Crypto Banter host Ran Neuner, Cowen says that the ETH/BTC pair could drop by more than 50% from its current value of 0.063 BTC, worth $1,828. Cowen believes that the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/05/one-catalyst-could-trigger-ethereum-to-plunge-50-against-bitcoin-says-top-crypto-analyst-benjamin-cowen/\">One Catalyst Could Trigger Ethereum To Plunge 50%+ Against Bitcoin, Says Top Crypto Analyst Benjamin Cowen</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-05T11:45:12.000Z",
    "title": "Top Analyst Issues Warning Amid Market Doldrums, Says One Factor Could Cause Crypto To ‘Nuke’",
    "url": "https://dailyhodl.com/2023/08/05/top-analyst-issues-warning-amid-market-doldrums-says-one-factor-could-cause-crypto-to-nuke/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Cause-Crypto-To-Nuke.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Cause-Crypto-To-Nuke.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Cause-Crypto-To-Nuke.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Cause-Crypto-To-Nuke.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Cause-Crypto-To-Nuke.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Cause-Crypto-To-Nuke.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Cause-Crypto-To-Nuke.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A trader who accurately called the crypto rally earlier this year is warning that digital assets may collapse if one financial trend occurs. Pseudonymous analyst DonAlt tells his 500,200 Twitter followers that he&#8217;s keeping a close watch on the performance of the S&#38;P 500. According to DonAlt, Bitcoin (BTC) and the broader crypto markets will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/05/top-analyst-issues-warning-amid-market-doldrums-says-one-factor-could-cause-crypto-to-nuke/\">Top Analyst Issues Warning Amid Market Doldrums, Says One Factor Could Cause Crypto To ‘Nuke’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]