[
  {
    "source": "CryptoGlobe",
    "date": "2024-01-14T10:54:37.000Z",
    "title": "Cboe Digital Becomes First ‘U.S.- Regulated, Crypto Native Exchange and Clearinghouse To Enable Both Spot and Leveraged Derivatives Trading on a Single Platform’",
    "url": "https://www.cryptoglobe.com/latest/2024/01/cboe-digital-becomes-first-u-s-regulated-crypto-native-exchange-and-clearinghouse-to-enable-both-spot-and-leveraged-derivatives-trading-on-a-single-platform/",
    "description": "Cboe Digital, formerly known as ErisX, is a digital asset platform that is a part of Cboe Global Markets, a leader in global market infrastructure. The platform offers regulated trading, clearing, and settlement services for digital assets, catering to both institutional and individual investors. Cboe Digital has reached a significant milestone with the launch of […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-14T10:59:29.000Z",
    "title": "Binance assures Indian users as Google Play Store blocks app access",
    "url": "https://www.cryptopolitan.com/binance-assures-indian-users-as-google-play/",
    "description": "In a recent development, Google&#8217;s Play Store in India has taken action against popular cryptocurrency exchange platforms, Binance and OKX, by removing their respective mobile applications.&#160; This move comes from a noncompliance notice issued by the Indian government, which has been cracking down on crypto-related activities within the country. Apple&#8217;s App Store in India also [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-14T11:01:28.000Z",
    "title": "Why Pushd (PUSHD) Is Attracting Investors Worldwide in the Crypto Market as Ripple (XRP) and Toncoin (TON) Are Predicted to Fall",
    "url": "https://nulltx.com/why-pushd-pushd-is-attracting-investors-worldwide-in-the-crypto-market-as-ripple-xrp-and-toncoin-ton-are-predicted-to-fall/",
    "description": "The crypto market is a risky venture, yet investors and traders still plunge into it to bring their investment dreams to reality. While investing in cryptocurrencies may not be as bad as it seems, the trick is going for the best crypto in the market. It is not news that [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-14T11:00:32.000Z",
    "title": "Bitcoin Hashrate Hits New All-Time High Amid Spot ETF Frenzy",
    "url": "https://www.newsbtc.com/news/bitcoin-hashrate-hits-new-all-time-high-amid-spot-etf-frenzy/",
    "description": "Bitcoin&#8217;s hash rate, that is the network&#8217;s computing power, recently reached a new all-time high amidst the frenzy that came with the debut of spot Bitcoin ETFs in the US. According to data from IntoTheBlock, the Bitcoin hashrate reached an all-time high of 630.91 million TH/s or 630 EH/s on January 11, less than 24 hours after the U.S. Securities and Exchange Commission approved 11 Spot Bitcoin ETFs in the country. Bitcoin&#8217;s hash rate hit a new all-time high yesterday 🔗https://t.co/bkdHCcEXFk pic.twitter.com/Mn3GxyDp6d — IntoTheBlock (@intotheblock) January 12, 2024 Related Reading: ETF Frenzy: Bitcoin Takes A Dip, Ethereum Goes Hot And The Next Crypto Chapter Bitcoin Hashrate Reaches Record Highs The hashrate measures the total combined computational power used to mine new bitcoins and process transactions. The Bitcoin mining hashrate has been on a steady rise since 2021 irrespective of market sentiment, be it bullish or bearish, cementing Bitcoin as the most secure cryptocurrency network. Based on the information provided by Coinwarz, the hashrate started 2023 at 266 EH/s and ended the year at 598 EH/s, a 125% growth.  The hashrate spiked further to an all-time high of 630 EH/s on January 11, and the timing was no coincidence. The surge in hashrate came right after the SEC approved the first US Bitcoin Spot ETFs to open the doors for mainstream investors to invest in the top crypto without actually owning the asset. https://x.com/intotheblock/status/1745826801106956323?s=20  Bitcoin&#8217;s hash rate hit a new all-time high yesterday 🔗https://t.co/bkdHCcEXFk pic.twitter.com/Mn3GxyDp6d — IntoTheBlock (@intotheblock) January 12, 2024 As expected, the approval of these ETFs led to a frenzy of activities in Bitcoin, pushing its on-chain volume to its highest since the collapse of crypto exchange FTX. Consequently, the hashrate also increased, indicating miners are ramping up operations in anticipation of increased interest and trading volume that often follows the launch of new ETFs. BTCUSD currently trading at $42,984 on the daily chart: TradingView.com BTC Price And Mining Profitability Fall The approval of spot ETFs is a sign of mainstream acceptance that strengthens Bitcoin’s credibility. Despite the increase in trading volume and growth of the network, Bitcoin&#8217;s price seems to have deviated from this positive trend. The crypto&#8217;s price initially reacted positively to the approval of the spot ETFs, pushing it over $48,600, its highest point since April 2022. In a dramatic turn of events, this spike has since reversed, to give the notion of a &#8220;sell the news event.&#8221;  Related Reading: Ethereum Eclipses Bitcoin In A Crypto Coup: Has The King Been Dethroned? At the time of writing, Bitcoin has retraced 11% from this local high and is trading just above $43,000. Trading volume has also fallen by 62% in the past 24 hours. Bitcoin mining profitability, which saw steady growth in December has failed to react positively to the approval of spot ETFs. According to data from Hashrateindex, the drop in Bitcoin prices led to mining profitability falling to as low as $0.07958 per terahash/second per day on January 13th, a 22% decline from $0.10270 per terahash/second per day on January 1.  Featured image from iStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-14T11:07:55.000Z",
    "title": "Judge Denies Terra & Do Kwon’s Plea for Reconsideration in SEC Lawsuit",
    "url": "https://www.crypto-news-flash.com/judge-denies-terra-do-kwons-plea-for-reconsideration-in-sec-lawsuit/?utm_source=rss&utm_medium=rss&utm_campaign=judge-denies-terra-do-kwons-plea-for-reconsideration-in-sec-lawsuit",
    "description": "<img width=\"1920\" height=\"1026\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/judge-g8f2edf574_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/judge-g8f2edf574_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/judge-g8f2edf574_1920-300x160.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/judge-g8f2edf574_1920-1024x547.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/judge-g8f2edf574_1920-768x410.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/judge-g8f2edf574_1920-1536x821.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/judge-g8f2edf574_1920-24x13.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/judge-g8f2edf574_1920-36x19.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/judge-g8f2edf574_1920-48x26.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />A federal judge denied Terra&#8217;s motions, backing the SEC&#8217;s claim of Securities Act violations. Do Kwon faces extradition following fraud allegations linked to a $60 billion crypto loss. In the ongoing lawsuit involving Terraform Labs (Terra) and its co-founder, Do Kwon, a federal judge has firmly upheld multiple key decisions in favor of the U.S. [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-14T10:57:52.000Z",
    "title": "Argentina’s First Bitcoin Rental Contract After Milei’s Megadecree",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/argentinas-first-bitcoin-rental-contract-after-mileis-megadecree/",
    "description": "<p>The groundbreaking agreement, inked in the city of Rosario, introduces a novel approach to real estate transactions. President Milei&#8217;s mega-decree, aimed at fostering economic innovation and freedom, has already begun to reshape traditional practices. Let&#8217;s discover more about it. Landmark Bitcoin Rental Agreement in Rosario The recent Bitcoin rental contract in Rosario stands as a [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/argentinas-first-bitcoin-rental-contract-after-mileis-megadecree/\">Argentina&#8217;s First Bitcoin Rental Contract After Milei&#8217;s Megadecree</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-14T10:40:58.000Z",
    "title": "Solana SAGA Genesis: 15,000+ and 540 Daily Mobile Activations",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/solana-saga-genesis-15000-and-540-daily-mobile-activations/",
    "description": "<p>The Solana SAGA Genesis count hitting the 15,000 mark underscores the platform&#8217;s increasing popularity and the robust growth of its user base. SAGA, Solana&#8217;s decentralized finance (DeFi) platform, has been gaining traction for its efficiency, scalability, and low transaction costs. Let&#8217;s discover more about this news. Exploring Solana&#8217;s Milestone: SAGA Genesis Surpasses 15,000 Users With [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/solana-saga-genesis-15000-and-540-daily-mobile-activations/\">Solana SAGA Genesis: 15,000+ and 540 Daily Mobile Activations</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]