[
  {
    "source": "Cryptopolitan",
    "date": "2024-02-19T04:36:00.000Z",
    "title": "This altcoin is about to pull off Solana’s 8X leap from 2023—up 400% already!",
    "url": "https://www.cryptopolitan.com/this-altcoin-is-about-to-pull-off-solanas-8x-leap-from-2023-up-400-already/",
    "description": "In the ever-evolving landscape of cryptocurrencies, one altcoin is capturing the attention of investors and enthusiasts alike as it aims to replicate the meteoric rise of Solana (SOL) in 2023. Retik Finance (RETIK), a relatively new entrant into the market, has already surged by a staggering 400%, signalling the potential for exponential growth reminiscent of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-19T04:28:19.000Z",
    "title": "MATIC Price Prediction: Polygon Rallies To $1 and Bulls Are Not Done Yet",
    "url": "https://www.newsbtc.com/analysis/matic-analysis/matic-price-prediction-polygon-rallies-to/",
    "description": "MATIC price is up over 10% and it tested the $1.00 resistance. Polygon bulls are in full control, and they might aim for more upsides above $1.00. MATIC price started a fresh increase above the $0.850 resistance against the US dollar. The price is trading above $0.95 and the 100 simple moving average (4 hours). There is a key bullish trend line forming with support at $0.958 on the 4-hour chart of the MATIC/USD pair (data source from Kraken). The pair could continue to move up if it clears the $1.00 resistance. Polygon Price Starts Fresh Surge After forming a base above the $0.80 level, Polygon’s price started a fresh increase. MATIC cleared many hurdles near $0.880 and $0.900 to move into a positive zone, like Bitcoin and Ethereum. There was also a move above the $0.92 resistance and the 100 simple moving average (4 hours). Finally, it tested the $1.00 resistance. A multi-week high is formed near $1.000 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $0.8185 swing low to the $1.00 high. MATIC is trading above $0.950 and the 100 simple moving average (4 hours). There is also a key bullish trend line forming with support at $0.958 on the 4-hour chart of the MATIC/USD pair. Immediate resistance is near the $0.995 zone. The first major resistance is near the $1.00 level. If there is an upside break above the $1.00 resistance level, the price could continue to rise. Source: MATICUSD on TradingView.com The next major resistance is near $1.08. A clear move above the $1.08 resistance could start a steady increase. In the stated case, the price could even attempt a move toward the $1.120 level or $1.150. Are Dips Limited in MATIC? If MATIC’s price fails to rise above the $1.00 resistance level, it could start a downside correction. Immediate support on the downside is near the $0.955 level and the trend line. The main support is near the $0.900 level or the 50% Fib retracement level of the upward move from the $0.8185 swing low to the $1.00 high. A downside break below the $0.900 level could open the doors for a fresh decline toward $0.850. The next major support is near the $0.800 level. Technical Indicators 4 hours MACD – The MACD for MATIC/USD is gaining momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for MATIC/USD is now above the 50 level. Major Support Levels – $0.955 and $0.900. Major Resistance Levels – $1.00, $1.08, and $1.12."
  }
]