[
  {
    "source": "Cointelegraph",
    "date": "2023-11-27T15:42:23.000Z",
    "title": "Crypto exchange grace period to remain unchanged in Hong Kong despite scandals",
    "url": "http://cointelegraph.com/news/crypto-exchange-grace-period-unchanged-hong-kong-despite-scandals",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/c1b30617-05b5-4960-a9d1-102968bb29fd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The recent JPEX and Hounax exchange scandals have resulted in losses exceeding $100 million. </p>\n                    <p><p>A one-year grace period for cryptocurrency exchanges operating in Hong Kong will remain in place despite recent scandals.</p><p>According to local news <a href=\"https://www2.hkej.com/instantnews/hongkong/article/3622564/%E8%AD%89%E7%9B%A3%3A%E6%9C%89%E6%B2%92%E6%9C%89%E5%AF%AC%E9%99%90%E6%9C%9F%E9%83%BD%E6%9C%83%E5%87%BA%E7%8F%BE%E8%A9%90%E9%A8%99%E4%BA%8B%E4%BB%B6\" target=\"_blank\" rel=\"noopener nofollow\">reports</a> on Nov. 27, Julia Leung, Hong Kong's Under Secretary for Financial Services and the Treasury, stated, \"Even if the grace period ends tomorrow, fraud will still occur, so there is no intention to modify the grace period and other measures for the time being.\" </p><p>As per <a href=\"https://cointelegraph.com/news/web3-firms-are-spending-up-to-25m-on-hk-crypto-licenses\">new regulations</a> introduced in June, crypto exchanges operating in Hong Kong must apply for a Virtual Asset Service Provider (VASP) license with the city's Securities &amp; Futures Commission by June 2024 or face deregistration. However, unregistered exchanges can operate in the city during the interim transition period. </p><p>Several crypto scandals have rocked the special administrative region recently. In September, Hong Kong crypto exchange JPEX, which was unlicensed at the time, collapsed after allegations of a Ponzi scheme that led to 66 arrests and an <a href=\"https://www2.hkej.com/instantnews/current/article/3621988/JPEX%E6%A1%88%E7%B4%AF%E8%A8%8866%E4%BA%BA%E8%A2%AB%E6%8D%95+%E6%B6%89%E6%AC%BE%E7%B4%8416%E5%84%84\" target=\"_blank\" rel=\"noopener nofollow\">estimated</a> 1.6 billion Hong Kong dollars ($205 million) in losses. </p><p>On Nov. 25, Hounax, another unlicensed crypto exchange operating in Hong Kong, <a href=\"https://www.scmp.com/news/hong-kong/law-and-crime/article/3242822/hong-kong-police-vow-make-arrests-after-hounax-virtual-asset-trading-platform-allegedly-tricks-131\" target=\"_blank\" rel=\"noopener nofollow\">reportedly</a> scammed 131 residents out of 120 million Hong Kong dollars ($15.4 million) through yet another alleged Ponzi scheme. Chan Waikei, superintendent of the Hong Kong Police's commercial crime bureau, explained that scammers impersonated investment experts and solicited users with the promise of high returns. When users later tried to withdraw the funds, they could not do so. </p><p>On Nov. 27, Cointelegraph reported that the Binance-linked HKVAEX exchange is still <a href=\"https://cointelegraph.com/news/hkvaex-plans-hong-kong-license\">trying to apply</a> for a license in Hong Kong. Earlier this month, BC Technology Group, owner of Hong Kong crypto exchange OSL, secured <a href=\"https://cointelegraph.com/news/osl-owner-secures-90-million-investment\">a $90M investment from blockchain firm BGX</a>. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/hkvaex-plans-hong-kong-license\">Binance-linked HKVAEX still preparing to apply for license in Hong Kong</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-27T15:40:57.000Z",
    "title": "BlockFi secures key $21M agreement with Vrai Nom amid turbulent bankruptcy",
    "url": "https://cryptoslate.com/blockfi-secures-key-21m-agreement-with-vrai-nom-amid-turbulent-bankruptcy/",
    "description": "<p>BlockFi has reached an agreement in principle with Vrai Nom Investment in its complex bankruptcy proceedings, potentially marking a pivotal moment in the crypto lending firm&#8217;s efforts to navigate its financial challenges. BlockFi has been granted an adjournment on related hearings until Dec. 19. As BlockFi emerges from the shadows of its November 2022 bankruptcy [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/blockfi-secures-key-21m-agreement-with-vrai-nom-amid-turbulent-bankruptcy/\">BlockFi secures key $21M agreement with Vrai Nom amid turbulent bankruptcy</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-27T16:01:23.000Z",
    "title": "Dogecoin (DOGE) and Shiba Inu Coin (SHIB) Buck the Trend: A Bullish Beacon in the Storm!",
    "url": "https://cryptodaily.co.uk/2023/11/dogecoin-doge-and-shiba-inu-coin-shib-buck-the-trend-a-bullish-beacon-in-the-storm",
    "description": "Uncover the resilience of Dogecoin and Shiba Inu Coin amidst market shifts. Gain analytical insights, price predictions, and bright ideas for a nuanced understanding of the evolving crypto landscape. This is an essential read for those navigating the world of digital assets."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-27T15:54:25.000Z",
    "title": "Nine Blocks Capital Management Secures Dubai Digital Assets License",
    "url": "https://www.cryptopolitan.com/nine-blocks-secure-dubai-digital-license/",
    "description": "Nine Blocks Capital Management, a trailblazer in the cryptocurrency hedge fund arena, has achieved a significant milestone by securing a license from Dubai’s Virtual Assets Regulatory Authority (VARA). This achievement positions Nine Blocks as the first cryptocurrency hedge fund to operate under the comprehensive regulatory framework established by VARA. In a strategic move, the hedge ... <a title=\"Nine Blocks Capital Management Secures Dubai Digital Assets License\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nine-blocks-secure-dubai-digital-license/\" aria-label=\"More on Nine Blocks Capital Management Secures Dubai Digital Assets License\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-27T15:59:25.000Z",
    "title": "Digital asset investment weekly inflow hits $346m, highest in 18 months",
    "url": "https://crypto.news/digital-asset-investment-weekly-inflow-hits-346m-highest-in-18-months/",
    "description": "Recent weeks have seen a massive surge in digital asset investments, with inflows totaling $346 million, led by Bitcoin and Ethereum."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-27T16:00:20.000Z",
    "title": "Cosmos Co-Founder’s Controversial Proposal Triggers 11% Plunge In ATOM",
    "url": "https://www.newsbtc.com/cosmos-atom/cosmos-co-founders-controversial-proposal-triggers-11-plunge-in-atom/",
    "description": "In a bold move, Cosmos co-founder Jae Kwon has called for a significant shift in the blockchain&#8217;s direction following the controversial passing of NWV #848. This proposal was approved by the community&#8217;s voting mechanism, earning around 40% of the votes, and it was aimed at changing the blockchain&#8217;s native token inflation rate. Related Reading: Cosmos (ATOM) Bears Dominate As Bulls Struggle To Drive Price Kwon, expressing his dissent, is now advocating for a coordinated &#8220;split&#8221; in the Cosmos ecosystem, a proposal that could reshape the blockchain&#8217;s future. This development comes in response to what Kwon perceives as &#8220;deviating from the network&#8217;s core principles.&#8221; &#8220;AtomOne&#8221; Split, Cosmos Co-Founder Urges Community Engagement Kwon&#8217;s proposal, termed &#8220;AtomOne,&#8221; is not just a divergence but an exodus from the current state of Cosmos, encouraging community members who voted &#8216;No&#8217; to join this new venture. The plan is still in its infancy and laid out in a GitHub repository, where Kwon invites community ideas and participation in shaping this new direction. He emphasizes a collaborative approach, urging the community to discuss and contribute to the formation of AtomOne. The essence of AtomOne lies in integrating $ATOM with $ATMO/$ATOM1, aiming to prevent a &#8220;complete collapse of ATOM by mass selling.&#8221; Kwon suggests that instead of abandoning ATOM altogether, there should be a way for it to coexist with the new fork. Cosmos Community Faces a Crossroads: Exodus And Innovation Kwon&#8217;s vision for AtomOne involves forking the current &#8220;cosmoshub4&#8221; but with its development path and teams, aiming for a more decentralized structure than the current Gaia. This new entity is open to all who opposed the recent vote, signaling a departure from the traditional paths of blockchain governance. Kwon highlights the power of the minority in blockchain ecosystems and the ability to self-organize and create antifragile structures. His message is clear: those who do not align with sound logic are destined to fail, and the future belongs to those who dare to exodus and build a better civilization. Kwon assures that this move isn&#8217;t about abandoning the original Cosmos hub but saving it and redefining its role. People are completely confused about the nature of blockchains what power the NO/NWV voters have altogether inside and outside the hub. The reality is that we exist, our principles and goals are aligned because they come from logic and we are about to demonstrate antifragility. The reality is that you cannot take control of a chain even with over 50% consensus, even 67%, because the minority can always self-organize even without your help. And the reality is that those who don&#8217;t make decisions based on sound logic always end up failing in the end. As the community gears up for this potential split, Kwon&#8217;s call for a departure to AtomOne reflects a pivotal moment in Cosmos&#8217; history and a testament to blockchain governance&#8217;s dynamic and evolving nature. A conversation that will continue for &#8220;generations.&#8221; Related Reading: Cosmos Has A Grand Plan For 2024: Will It Crush Ethereum? As a result of the split proposal, ATOM has seen a spike in volatility, recording an 11% loss over the past few days. However, speculation is that the split will involve an airdrop poised to attract positive attention for the token. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-27T16:06:02.000Z",
    "title": "BRICS Nations: Bitcoin (BTC), Ripple (XRP), China, Russia, and India Challenge the US Dollar’s Global Dominance",
    "url": "https://www.crypto-news-flash.com/brics-nations-bitcoin-btc-ripple-xrp-china-russia-and-india-challenge-the-us-dollars-global-dominance/?utm_source=rss&utm_medium=rss&utm_campaign=brics-nations-bitcoin-btc-ripple-xrp-china-russia-and-india-challenge-the-us-dollars-global-dominance",
    "description": "<img width=\"640\" height=\"427\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/US-dollar-burn.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/US-dollar-burn.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/US-dollar-burn-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/US-dollar-burn-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />BRICS countries have been exploring the possibility of a currency that could dethrone the US dollar in multilateral trade, and this movement is only gathering steam. The USD is also under siege from the rise in the usage of Bitcoin, XRP, and other cryptocurrencies which offer more autonomy, economic freedom, and lower fees. The US [...]"
  }
]