[
  {
    "source": "Decrypt",
    "date": "2023-06-06T18:43:47.000Z",
    "title": "SEC Chair Gary Gensler: The US Doesn't Need Cryptocurrency",
    "url": "https://decrypt.co/143595/crypto-industry-is-built-on-non-compliance-says-sec-chair-gary-gensler",
    "description": "Gary Gensler has said what he really thinks about how crypto exchanges operate in the States. "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-06T18:57:13.000Z",
    "title": "Coinbase CEO Brian Armstrong hits back at SEC lawsuit on social media",
    "url": "https://cryptoslate.com/brian-armstrong-hits-back-at-sec-lawsuit-on-social-media/",
    "description": "<p>Coinbase CEO Brian Armstrong spoke out against the SEC’s decision to file a lawsuit against the exchange. The SEC&#8217;s charges, filed early today, are based on the accusation that Coinbase has been listing securities without registering with the federal body. This has triggered additional actions from Alabama and New Jersey, heightening the scrutiny over the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/brian-armstrong-hits-back-at-sec-lawsuit-on-social-media/\">Coinbase CEO Brian Armstrong hits back at SEC lawsuit on social media</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T18:51:03.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T18:47:37.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T18:47:16.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-06T19:00:59.000Z",
    "title": "Cardano Founder Unveils SEC Motivation For Suing Binance",
    "url": "https://www.newsbtc.com/news/cardano/cardano-founder-unveils-sec-motivation-for-suing-binance/",
    "description": "The US Securities and Exchange Commission (SEC) sued the world’s largest crypto exchange Binance and its founder for allegedly violating securities laws.  In light of this, Cardano founder Charles Hoskinson has expressed his concerns over the SEC’s complaints against Binance.  Cardano Founder Analyzes SEC’s Complaints Against Binance Charles Hoskinson to Twitter to disclose his belief regarding the recent SEC lawsuit against Binance and its CEO, Changpeng Zhao. The Cardano founder noted that such a situation depicts threats to financial freedom and the continuation of crypto in the United States. Related Reading: No All-Time High For Bitcoin In 2023, Former BitMEX Head Arthur Hayes Predicts In his lengthy post, Hoskinson thinks the SEC wants to implement ‘Chokepoint 2.0’ in the country based on the implications of its complaints.  He also pointed out the extensive nature of the complaint, which amounted to 136 pages stating that it could be an integral part of a plan to maintain strict control over the personal financial lives of people. Hoskinson further observed that the SEC’s lawsuit against Binance is not just centered on compliance issues with the exchange. He is concerned that the regulator may include the creation of a centrally-backed digital currency (CBDC) connected to a group of chosen and powerful banks.  Such a move could provide the government absolute control over every area of financial activities from the customers. And Hoskinson thinks that the SEC&#8217;s action displays a political and philosophical disagreement on the existence of crypto and its core principles. Additionally, he mentioned that a group of unappointed persons had streamlined some operations as inappropriate for the open market. These include wallet ownership, economic agency, and self-sovereign identity. So, the SEC intends to have just a few individuals enjoying these privileges. Hoskinson maintained that historically, the current play-out of events indicated the recurring battle between freedom and authoritarianism. According to him, it is not a completely new situation; rather, the clash is between different players and technology, with a change in wording. Related Reading: Tether: How Its $2 Billion USDT Minting Impacts Ethereum’s Success In The Bull Market As such, the Cardano founder noted that the situation demands that the crypto industry unite and create concrete rules to prevent the US from getting into an apocalyptic stage similar to George Orwell’s 1984. SEC’s Lawsuit Against Binance And Its CEO Zhao A June 5 report from Forbes revealed that the SEC had sued the largest global crypto exchange Binance and its CEO, Changpeng Zhao. In line with its operations, Binance functions internationally as Binance.com but runs a separate platform, Binance.US, for its US customers. The platform for US customers complies with the SEC&#8217;s regulatory demands. However, the SEC alleged US users have been trading on Binance.com, indicating that Binance and its CEO, Zhao violated securities laws. Also, the regulator accused the exchange of allowing the trading of crypto assets which are securities, amounting to $115 billion. Some of the assets include BNB, BUSD, Polygon (MATIC), Solana (SOL), and Cardano (ADA). Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-06T18:41:47.000Z",
    "title": "Swift Using Chainlink (LINK) in New Experiment With Citi, BNY Mellon, BNP Paribas and Others",
    "url": "https://dailyhodl.com/2023/06/06/swift-using-chainlink-link-in-new-experiment-with-citi-bny-mellon-bnp-paribas-and-others/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/chainlink-gears-up-staking.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/chainlink-gears-up-staking.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/chainlink-gears-up-staking.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/chainlink-gears-up-staking.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/chainlink-gears-up-staking.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/chainlink-gears-up-staking.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/chainlink-gears-up-staking.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Payments giant Swift is teaming up with Chainlink (LINK) and several financial giants for a blockchain interoperability settlement experiment. According to a new announcement from Swift, the payments company says it is testing blockchain interoperability with over a dozen institutions. Swift says that institutions that want to interact with tokenized assets face the problem of blockchains [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/06/swift-using-chainlink-link-in-new-experiment-with-citi-bny-mellon-bnp-paribas-and-others/\">Swift Using Chainlink (LINK) in New Experiment With Citi, BNY Mellon, BNP Paribas and Others</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]