[
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T10:00:00.000Z",
    "title": "NFT platform Enjin forks Polkadot parachain Efinity to new mainnet",
    "url": "https://cointelegraph.com/news/nft-platform-enjin-forks-polkadot-parachain-efinity-to-new-mainnet",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/33635405-65fa-4e62-ae53-1ee46d25c9e3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Enjin CTO Witek Radomski said that the new blockchain aims to promote creativity by facilitating the easy and affordable creation and distribution of NFTs.</p>\n                    <p><p><a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world#:~:text=NFTs%20refer%20to%20nonfungible%20tokens,based%20video%20games%20and%20video.\">Nonfungible-token (NFT)</a> protocol Enjin has announced its transition into a new mainnet called \"Enjin Blockchain\" with the aim of furthering Web3 adoption. Following the transition, its Polkadot parachain called Efinity has also been forked into the new blockchain. </p><p>In an announcement sent to Cointelegraph, the Enjin team highlighted that the Enjin Blockchain will differ from other blockchain solutions that rely on smart contracts. According to Enjin, functions like creating and transferring NFTs will be integrated into the blockchain’s foundational code. </p><p>Apart from these, the blockchain also presented new features. This includes “Fuel Tanks” which lets developers subsidize user transaction fees and “Discrete Accounts” which lets users interact with projects using its blockchain without downloading specific wallet software. </p><p>Within the announcement, the team also informed its community that Efinity, its Polkadot parachain has also been forked to the new mainnet. It will be called the \"Efinity Matrixchain\" and will support a transition for its existing users. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/how-to-store-crypto-inside-nfts-erc-6551-interview\"><strong><em>Here’s how developers aim to store crypto inside NFTs</em></strong></a></p><p>Enjin co-founder and CTO Witek Radomski said that the launch of the Enjin Blockchain aims to support creativity by making it easier and economical for anyone to make and distribute NFTs. Radomski explained: </p><blockquote>“Enjin Blockchain makes the creation and mass distribution of NFTs affordable and accessible to everyone. [...] Our aim is nothing short of revolutionizing gaming, ownership, and online identity.”</blockquote><p>Oscar Franklin Tan, the chief financial officer of Enjin, also commented that NFTs and digital ownership will be the cornerstone for what he describes as “the next wave of gaming” fueled by developments in artificial intelligence, augmented reality and virtual reality. Because of this, Enjin aims to be there to support this new “explosion of content.” </p><p>In other news, blue-chip collaterals have started to <a href=\"https://cointelegraph.com/news/blue-chip-collaterals-help-stabilize-nft-lending-paraspace\">help stabilize NFT lending</a>. In a recent statement to Cointelegraph, NFT protocol Paraspace highlighted that despite accumulating NFT loans of over $280 million, the protocol did not have any bad debt and only had 16 NFT liquidations. According to its team, it owes its success to the rule allowing only blue-chip NFTs to be used as collateral. </p><p><strong><em>NFT Creator: </em></strong><a href=\"https://cointelegraph.com/magazine/rich-rekt-rich-again-nft-creator-trevor-jones-right-royal-nfts/\"><strong><em>Top 10 crypto artist Trevor Jones on being rich, rekt and rich again</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-08T09:45:18.000Z",
    "title": "Coinbase to withdraw over 70k staked ETH amid SEC lawsuit",
    "url": "https://cryptoslate.com/coinbase-seeks-to-withdraw-over-70k-staked-eth-amid-sec-lawsuit/",
    "description": "<p>Coinbase accounts for roughly 79% of entities waiting to withdraw their staked Ethereum (ETH) as of June 8, according to Nansen’s dashboard.  The exchange wants to withdraw 70,057 ETH (roughly $129 million) of the 88,121 ETH tokens pending withdrawals as of press time. The uptrend in Coinbase&#8217;s withdrawal demand comes after the U.S. Securities and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinbase-seeks-to-withdraw-over-70k-staked-eth-amid-sec-lawsuit/\">Coinbase to withdraw over 70k staked ETH amid SEC lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-08T09:50:33.000Z",
    "title": "Dogecoin (DOGE) Price Watch: Daily Technical Analysis Report (DOGE-BTC) for 8 June 2023",
    "url": "https://www.cryptoglobe.com/latest/2023/06/dogecoin-doge-price-watch-daily-technical-analysis-report-doge-btc-for-8-june-2023/",
    "description": "Introduction Dogecoin (DOGE) is a popular cryptocurrency known for its unique branding and active community. In this daily technical analysis report, we will examine key indicators and interpret their values to provide insights into Dogecoin’s potential price targets. Current Price: 0.0000026 BTC (unchanged) (as of 9:45 a.m. UTC on 8 June 2023) Moving Averages Moving […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-08T09:48:00.000Z",
    "title": "Changpeng Zhao Ran BAM Trading, Says Former Binance.US CEO",
    "url": "https://cryptodaily.co.uk/2023/06/changpeng-zhao-ran-bam-trading-says-former-binance-us-ceo",
    "description": "<p>The former CEO of Binance.US, Brian Brooks, has revealed why he left his position as the CEO of the exchange in court documents submitted this week.&nbsp;</p>\n<p>Brooks had resigned as the CEO of Binance.US in August 2021, just months after taking the position.&nbsp;</p>\nShadow CEO&nbsp;\n<p>Court documents cited Brooks in a transcript linked to documents regarding the United States Securities and Exchange Commission&rsquo;s case against Binance, Binance CEO Changpeng Zhao, Bam Trading, and Bam Management. In the interview transcript with the Securities and Exchange Commission (SEC), Brooks was asked about his role as the head of Binance.US; Brooks stated,&nbsp;</p>\n\n<p>&ldquo;I did not work for Binance.com, that nobody at Binance.com was my boss, and that my role was to complete and highlight the corporate separateness. So when I talked to CZ, I considered myself to be talking to him in his role as board chair of BAM Trading. What became clear to me at a certain point was [that] CZ was the CEO of BAM Trading, not me&hellip;That wasn&rsquo;t because Binance.com somehow controlled us, but again, he owns the vast majority of Binance.com, so I put that aside.&rdquo;</p>\n\n<p>At the time of resigning, Brooks stated that he was leaving his position as the CEO of Binance.US because of differences over strategic direction. Brooks held his position at the American arm of Binance for only three months.&nbsp;</p>\nThe SEC&rsquo;s Case Against Binance&nbsp;\n<p>The Securities and Exchange Commission filed a lawsuit against Binance and its CEO Changpeng Zhao on Monday. The lawsuit contained 13 charges, including allegations of fraud and co-mingling of customer assets. The action came after months of threats, warnings, and discussions, with the exchange and Zhao accused of operating a &ldquo;web of deception.&rdquo; The filing against Binance also includes quotes from multiple unnamed Binance executives, which it stated were acknowledging that they were running Binance.com as an unregistered securities exchange in the US. It also quoted Zhao as seeking ways to keep its VIP customers.&nbsp;</p>\n<p>According to the lawsuit, Zhao, in a weekly meeting with senior company officials, stated,&nbsp;</p>\n<p>&ldquo;We don&rsquo;t want to lose all the VIPs, which actually contribute to quite a large number of volume. So ideally, we would help them facilitate registering companies or moving the trading volume offshore in some way&mdash;in a way that we can accept without them being labeled completely US to us.&rdquo;</p>\nBinance Reacts&nbsp;\n<p>Binance handles billions worth of investments for small and established investors and also sponsors Italian Serie A team Lazio and the Argentina National team. The action on the exchange is part of a wider crackdown on crypto initiated by the SEC, which began after the collapse of FTX. FTX founder Sam Bankman-Fried has been charged with several offenses, including securities fraud and money laundering.&nbsp;</p>\n<p>Reacting to the SEC lawsuit, Binance stated that it was &ldquo;disheartened and disappointed&rdquo; with the SEC lawsuit. It added that it had extensively discussed with the regulator to reach a negotiated settlement.&nbsp;</p>\n\n<p>&ldquo;Most recently, we have engaged in extensive good-faith discussions to reach a negotiated settlement to resolve their investigations. But despite our efforts, with its complaint&hellip;the SEC abandoned that process and instead chose to act unilaterally and litigate.&rdquo;</p>\n\n<p>The SEC also added that it had filed a temporary restraining order against BAM Trading, BAM Management, which oversees Binance.US operations, and against Binance. If the order is granted, it would look to freeze the assets of BAM Trading and BAM Management.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-08T09:45:47.000Z",
    "title": "LBank Labs Makes Strategic Investment in Crypto VC Collab+Currency",
    "url": "https://cryptodaily.co.uk/2023/06/lbank-labs-makes-strategic-investment-in-crypto-vc-collabcurrency",
    "description": "<p>Road Town, British Virgin Islands, June 8th, 2023, Chainwire</p><p>LBank Labs, the leading blockchain venture fund, has announced an investment in Collab+Currency, a crypto-focused venture fund backing early-stage startups building the next generation of culture and consumer technology. The strategic investment aims to foster innovation and support the growth of highly-scalable Web3 infrastructure on a global scale.</p><p>Collab+Currency is focused on identifying early opportunities in Web3, primarily investing in pre-seed and seed rounds. Its team has backed some of the most influential Web3 consumer projects in the world including Art Blocks, Blur, SuperRare, and Sky Mavis. During the past five years, the firm has backed around 100 projects working in nearly every vertical within crypto, including infrastructure, base-layer blockchains, service providers and NFTs. The majority of the firm's investments revolve around a thesis that consumer applications will be the biggest winners in Web3.</p><p>By investing in Collab+Currency, LBank Labs aims to not only support a promising startup, but contribute to the advancement of consumer-focused technology and applications as a whole. This aligns with Labs&rsquo; mandate to identify like-minded startups who are passionate about shaping the future of consumer technology.</p><p>With $100 million assets under management, LBank Labs brings extensive financial resources and a vast global network to Collab+Currency. In turn, Collab+Currency will reciprocate by contributing significant value to LBank Labs, leveraging their expertise, strategic insights, and innovative approach to fuel mutual growth and success.</p><p>The venture fund also aims to forge its commitment by building a comprehensive network of Fund of Funds, designed to enhance the performance and diversification of its portfolios while emphasising the inherent value of its ecosystem network. Labs&rsquo; presence in seven global regions, including San Francisco, Dubai, Paris, Denver, Singapore, Mexico, and Shanghai, positions them as a powerhouse for fostering collaboration and innovation across borders.</p><p>LBank Labs, whose investment strategy is protocol and exchange-agnostic, is committed to supporting projects through direct funding, acceleration, incubation, and extensive networking. With $100 million assets under management (AUM), the venture capital arm of global cryptocurrency exchange LBank has a strong track record of nurturing startups and helping them thrive.</p><p>Besides direct investments in projects, the LBank Labs team aims to build a strong fund network via investing in global top funds to support portfolios from the network in both financial and resource value-add.</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge platform that ensures the integrity of users&rsquo; funds and aims to contribute to the global adoption of cryptocurrency.</p><p>Start Trading Now: lbank.com</p><p>Community &amp; Social Media: &nbsp;Telegram l Twitter l Facebook l LinkedIn l Instagram l YouTube</p>ContactGlobal PR DirectorJeremy Van der HaegenLBankpress@lbank.info"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T10:07:35.000Z",
    "title": "Dogelon Mars Price Prediction 2023-2032: Is ELON a Good Investment?",
    "url": "https://www.cryptopolitan.com/dogelon-mars-price-prediction/",
    "description": "Dogelon Mars Price Prediction 2023-2032 One influencer says Dogelon Mars (ELON) is about to go parabolic. Altcoin values may drop due to decreased liquidity from quantitative tightening. Although Elon Musk is not involved with ELON, its token price can see big price spikes when Musk makes headlines. For example, when Musk made his deal to ... <a title=\"Dogelon Mars Price Prediction 2023-2032: Is ELON a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dogelon-mars-price-prediction/\" aria-label=\"More on Dogelon Mars Price Prediction 2023-2032: Is ELON a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-08T10:00:00.000Z",
    "title": "Ethereum volumes decreasing, DigiToads presale ongoing–over $4.6 million raised",
    "url": "https://crypto.news/ethereum-volumes-decreasing-digitoads-presale-ongoing-over-4-6-million-raised/",
    "description": "DigiToads presale has so far raised over $4.6 million as investors examine the project, attracted by its utilities. Meanwhile, ethereum trading volumes have been contracting"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-08T09:49:21.000Z",
    "title": "Whale moves over 1.4k BTC for first time in 10 years amid crypto downturn",
    "url": "https://crypto.news/whale-moves-over-1-4k-btc-for-first-time-in-10-years-amid-crypto-downturn/",
    "description": "A bitcoin (BTC) whale just moved up to 1,433 BTC that had been dormant for over a decade. This recent development has captured the attention of market watchers, considering the age of the tokens and the coincidence of the movement&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-08T09:45:21.000Z",
    "title": "Less Than 100 XRP Needed To Become A Millionaire? New Research Suggests",
    "url": "https://www.newsbtc.com/analysis/xrp/100-xrp-needed-to-become-a-millionaire-research-suggests/",
    "description": "Valhil Capital has published a new research paper assessing the fair value of XRP, and the results are astronomical. The private equity firm explains in the research paper, using six pricing models, that the fair value is somewhere between $3,500 and $21,900 per token. So, as one community member pointed out, it would only take 77.9 XRP to become a millionaire at the median price of $12,822. Even at the most conservative projection of $3,500, 285.8 XRP would be enough to become a dollar millionaire. XRP Price To The Moon? Molly Elmore, Chief Marketing Officer (CMO) at Valhil Capital, shared the whitepaper titled &#8220;A Comprehensive Approach To Determine The Fair Market Value Of XRP&#8221; via Twitter. According to her, the document is the result of an extensive two-year research conducted by a &#8220;larger group of individuals,&#8221; the &#8220;confidential committee.&#8221; The origin of the effort was the U.S. Securities and Exchange Commission&#8217;s (SEC) lawsuit against Ripple, which raised the question: if the SEC&#8217;s lawsuit harmed retail investors, how could financial damages be calculated? To do this, Valhil Capital argues that it is necessary to examine the extent to which the lawsuit prevented the adoption of the XRP Ledger from realizing its intended use case. Related Reading: Ripple CEO Blasts SEC Chair For Anti-Innovation Stance, XRP Bulls Remain Optimistic Because of this, the concept of fair market value came into discussion, and how it differs from market value. To assess the fair value, the Confidential Committee formed a smaller Valuation Committee in the fall of 2022, composed of individuals who had experience with quantitative and financial valuations. As a result, the Committee establishes six pricing models: Pipeline Flow Model, Athey and Mitchnick Model, 99-Year Golden Eagle Model, Discounted Cash Flow Model, Collateral Model, and a Quantum Liquidity Model. All models relate to various factors, including market conditions, supply and demand, and other relevant considerations. However, the most important driver of the asset price, according to the analysis, is the extent to which the world decides to use XRP to store wealth. According to the white paper, this will happen after people see a modest increase in price from using the asset. For example, the pipeline flow model looks at transaction volume, store of value, supply and demand interaction factors, and the interaction dynamics of competition. It assumes that there will be a &#8220;big bang&#8221; event triggered by the FX trading volume on the XRPL suddenly exploding. The Theses And Projections Are Controversial It should be noted that the thesis of Valhil Capital should be taken with a grain of salt. Even in the XRP community, founder Jimmy Vallee and his buyback theory are more than controversial. Related Reading: US SEC Sues Binance, Fails To Mention Ripple (XRP) As Security Various well-known members of the community, such as attorney John E. Deaton and CryptoEri have distanced themselves from the buyback theory. Deaton made it clear in February of this year that he will not accept any money from Vallee for his efforts in the Ripple and LBRY cases. The XRP buyback theory dates back to 2021. According to Vallee, XRP will become the world&#8217;s reserve currency when government debt reaches unsustainable levels. He posits that this is only possible if governments buy large amounts of XRP, at a much higher price than currently. At press time, the XRP price stood at $0.5209. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-08T09:46:04.000Z",
    "title": "LBank Labs Makes Strategic Investment in Crypto VC Collab+Currency",
    "url": "https://www.crypto-news-flash.com/lbank-labs-makes-strategic-investment-in-crypto-vc-collabcurrency/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-labs-makes-strategic-investment-in-crypto-vc-collabcurrency",
    "description": "<p>Road Town, British Virgin Islands, June 8th, 2023, Chainwire LBank Labs, the leading blockchain venture fund, has announced an investment in Collab+Currency, a crypto-focused venture fund backing early-stage startups building the next generation of culture and consumer technology. The strategic investment aims to foster innovation and support the growth of highly-scalable Web3 infrastructure on a [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/lbank-labs-makes-strategic-investment-in-crypto-vc-collabcurrency/\">LBank Labs Makes Strategic Investment in Crypto VC Collab+Currency</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]