[
  {
    "source": "Decrypt",
    "date": "2023-10-24T20:43:47.000Z",
    "title": "Bitcoin Funds Gain $57 Million in Fresh Cash Amid ETF Mania",
    "url": "https://decrypt.co/203101/bitcoin-funds-gain-57-million-amid-etf-mania",
    "description": "Most deposits went to spot Bitcoin ETFs in Canada and Germany, showing that investors want physical Bitcoin over anything else, said Coinshares."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-24T21:00:28.000Z",
    "title": "MicroStrategy’s Bitcoin Portfolio Soars Past $5 Billion As BTC Holds Firm At $34,000",
    "url": "https://www.newsbtc.com/bitcoin-news/microstrategys-bitcoin-portfolio-soars-past-5-billion-as-btc-holds-firm-at-34000/",
    "description": "In a remarkable turn of events for the business intelligence (BI) company MicroStrategy, the recent bullish momentum of Bitcoin (BTC) has resulted in significant profits and a resurgence for the company.  MicroStrategy has returned on a profitable trajectory after a prolonged period of market downturn and losses suffered by companies with cryptocurrency holdings. MicroStrategy&#8217;s Bitcoin Holdings Surge  Just a month ago, MicroStrategy and its subsidiaries made a strategic move by increasing their BTC holdings. According to a filing with the US Securities and Exchange Commission (SEC), the company, co-founded by renowned investor Michael Saylor, added 5,455 BTC to their portfolio, valued at $147 million. Related Reading: Cardano Passes Crucial Update As ADA Price Prepares For 65% Rally As of the time of writing, MicroStrategy&#8217;s Bitcoin holdings stand at a staggering 158,245 BTC, with a total valuation of approximately $4.68 billion.  Over the past 24 hours, Bitcoin has experienced a remarkable upswing, breaking through a long consolidation phase above $27,000 and reaching a new 2023 high. With a significant surge of 12.2%, BTC peaked at $35,300. This surge has unlocked substantial unrealized profits for MicroStrategy. According to Lookonchain, MicroStrategy&#8217;s Bitcoin holdings have generated an estimated unrealized profit of around $746 million.  With BTC&#8217;s skyrocketing price, MicroStrategy&#8217;s strategic accumulation of 28,560 BTC since May 2022, at an average price of $25,707, has proven profitable.  MicroStrategy&#8217;s success in capitalizing on the recent price surge of Bitcoin highlights the company&#8217;s strategic approach and belief in the long-term value of the cryptocurrency.  By significantly increasing their Bitcoin holdings, MicroStrategy has positioned itself to benefit from BTC&#8217;s continued growth and adoption. BTC Bears Crushed As $300 Million In Shorts Liquidated The cryptocurrency market witnessed a stunning surge, resulting in a staggering $100 billion addition to its total market capitalization within a single day. This rapid ascent also triggered a wave of liquidations amounting to over $400 million, with shorts accounting for a significant portion of the losses.  With BTC experiencing a 12% price increase, this led to the liquidation of more than $180 million in short positions out of a total of $222 million in BTC liquidations.  Related Reading: Ethereum End Of Month Challenge: Can ETH Reach $2,000 Amid $21 Billion DeFi TVL? Ethereum (ETH) traders also saw a significant loss of $60 million, with $44 million coming from those anticipating a price drop, according to data from CoinGlass. Most of these liquidations, totaling $317 million, occurred within the last 12 hours, with short sellers accounting for a substantial 76% ($241 million) of the total losses.  Concurrently, trading volumes for the top three cryptocurrencies on the derivatives market witnessed significant growth.  Bitcoin&#8217;s volume experienced a remarkable 221% surge, while Ethereum and XRP saw a 108% increase in trading activity. As a result, approximately 95,000 traders faced liquidation during this period of intense market volatility. Scott Melker, an investor and host of a cryptocurrency podcast, commented on the situation, stating: Bitcoin bears have been left reeling as the market witnessed an extraordinary rally, resulting in massive liquidations of short positions. This surge has caught many traders off guard, leading to substantial losses in a short period. Featured image from Shutterstock, chart from TradingView.com "
  }
]