[
  {
    "source": "CoinDesk",
    "date": "2023-08-07T14:59:00.000Z",
    "title": "Binance's VC Arm Dominated Funding Rounds Last Week Even as Regulators Scrutinized the Crypto Exchange",
    "url": "https://www.coindesk.com/business/2023/08/07/binances-vc-arm-dominated-funding-rounds-last-week-even-as-regulators-scrutinized-the-crypto-exchange/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Binance Labs announced investments in four incubator projects and participated in a round for privacy infrastructure startup zkPass."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-07T14:44:14.000Z",
    "title": "Worldcoin’s Nairobi Offices Raided After Suspension in Kenya: Report",
    "url": "https://cryptobriefing.com/worldcoins-nairobi-offices-raided/?utm_source=feed&utm_medium=rss",
    "description": "Kenyan police raid Worldcoin's Nairobi warehouse, raising further questions on data protection regulations and Worldcoin's compliance."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-07T14:54:18.000Z",
    "title": "CoinShares Report: Bitcoin Faces Record Outflows Amid a Surprising Short Selling Pause",
    "url": "https://www.cryptoglobe.com/latest/2023/08/bitcoins-rollercoaster-ride-record-outflows-and-a-pause-in-short-selling/",
    "description": "According to James Butterfill, Head of Research at CoinShares, a European digital assets investment firm, the recent trend has been characterized by significant outflows from digital asset investment products. The total outflows for the week amounted to $107 million, marking a continuation of the profit-taking trend that has been gathering pace in recent weeks. Per […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-07T14:40:00.000Z",
    "title": "CryptoMinerBros Celebrates 5 Years of Building the Future in the Crypto Mining Community",
    "url": "https://www.cryptoglobe.com/latest/2023/08/cryptominerbros-celebrates-5-years-of-building-the-future-in-the-crypto-mining-community/",
    "description": "Kowloon city, HongKong, August 7th, 2023, Chainwire Founded in August 2018 and headquartered in Hong Kong, Crypto Miner Bros has become one of the leading crypto mining hardware distributors within five years of its launch. With a dedicated team of blockchain experts, e-commerce specialists, and crypto mining professionals, Crypto Miner Bros has become a reputable name in […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-07T15:08:28.000Z",
    "title": "EtherMail Partners with Huddle01 to Revolutionize Communication Solutions for Web3 Era",
    "url": "https://cryptodaily.co.uk/2023/08/ethermail-partners-with-huddle01-to-revolutionize-communication-solutions-for-web3-era",
    "description": "<p>Schaan, Liechtenstein, August 7th, 2023, Chainwire</p><p class=\"ql-align-justify\">EtherMail, the first Web3 Email Solution setting the standard for anonymous and encrypted wallet-to-wallet communication, has today announced a partnership with Huddle01, the company building the world's first decentralized real-time communication (dRTC) network.</p><p class=\"ql-align-justify\">Huddle01 and EtherMail have formed a strategic partnership to revolutionize communication solutions for the Web3 era. By integrating Huddle01's collaborative platform with EtherMail's secure Web3 email solution, both parties aim to offer a privacy-centric, cutting-edge solution for businesses seeking efficient, secure and streamlined communication tools.</p><p class=\"ql-align-justify\">As part of the integration, when a user creates a meeting via Huddle01, an event invite is automatically sent to their EtherMail inbox. Users can also send a Huddle01 link to meetings from their EtherMail account. Ethermail users will be rewarded 50 EMCs on their first use of the Applet, to try it out. From the 7th - 14th of August, the first 10,000 users will receive 50 EMCs for their first use of Huddle01. Once they tweet about using Huddle01, they will be eligible to receive the payment.</p><p class=\"ql-align-justify\">Huddle01 has adopted a comprehensive strategy to enhance the efficiency, reliability, and security of audio/video communication. This encompasses a video meeting platform, a/v infrastructure with developer SDKs, and a decentralized real-time communication (dRTC) network. The platform has already accumulated 1 million+ minutes of meetings, while the infrastructure has over 100 projects built on top of it to date.&nbsp;</p><p class=\"ql-align-justify\">Since EtherMail&rsquo;s official launch, the platform has onboarded over 500,000 users and established partnerships with popular NFT projects such as Smurfs Society, Probably Nothing, Toxic Skulls Club, inBetweeners and Prime Planet. EtherMail&rsquo;s Web3 email solution also facilitated Web3 voting for Decrypt Studios&rsquo; inaugural Crypties Awards 2022 with more than 10,000 participants &ndash; the crypto industry&rsquo;s preeminent annual awards initiative.&nbsp;</p><p class=\"ql-align-justify\">Earlier this year, EtherMail secured a $4 million funding round led by Tim Draper and Draper Associates. Having previously invested in Ethereum, Tesla, Coinbase, Polygon and SpaceX, Draper has a proven track record in backing bonafide industry disruptors. This round followed a $3 million round in August 2022, led by top Web3 investors Fabric Ventures and Greenfield One.</p>Shant Kevonian, CEO and Founder of EtherMail said: &ldquo;The partnership between Huddle01 and EtherMail marks a pivotal moment in the evolution of secure communication for the Web3 space. Together, we can offer businesses an unprecedented level of data privacy, seamless communication, and enhanced productivity. This alliance cements our commitment to revolutionize the way companies safeguard sensitive information, providing a game-changing solution for the future of secure digital communication.&rdquo;Ayush Ranjan, Co-founder, and CEO of Huddle01 said: &ldquo;We&rsquo;re very excited to partner with EtherMail, as our platforms share clear synergies and goals to redefine the standards of secure communication. By integrating EtherMail's category-leading Web3 email system into our platform, we&rsquo;re bolstering the level of data privacy and security for our users. Together, we are empowering businesses with cutting-edge communication tools to navigate the Web3 landscape with confidence.&rdquo;<p>Users can Join the official EtherMail Telegram channel here, and follow the latest developments on twitter.</p><p class=\"ql-align-justify\">For more information on how EtherMail can help your project maintain a direct and secure line of communication with your asset holders, visit: https://ethermail.io/daos</p><p class=\"ql-align-justify\">Any companies interested in applying to become an applet can do so here: https://promos.ethermail.io/partnership-application&nbsp;</p><p>About EtherMail</p><p class=\"ql-align-justify\">EtherMail is the first Web 3.0 Email Solution setting the standard for anonymous and encrypted wallet-to-wallet communication. With EtherMail, companies can send rich, relevant content directly to their asset holders based on blockchain-synced real time information. EtherMail also allows fully anonymous P2P communication and rewards its users for reading relevant content in their inbox.</p><p class=\"ql-align-justify\">About Huddle01</p><p class=\"ql-align-justify\">The brainchild of Ayush Ranjan and Susmit Lavania, Huddle01 was co-founded at the 2020 ETHGlobal hackathon with a vision to make real-time communication open, secure, and borderless by leveraging blockchain &amp; crypto-economics. Huddle01 has its own video meeting platform similar to Zoom that uses crypto primitives and has clocked in 1 million+ minutes of meetings. The infrastructure (developer SDKs) has over 100 projects built on top of it in categories like social, DAO tooling, education and the metaverse. Multiple web3 applications have integrated the composable Huddle01 SDKs as their video communication layer. The dRTC network will be launched by Q4 of 2023 and will eliminate the dependency on centralized servers for real-time video communication. To learn more visit, www.huddle01.com</p>ContactFounderLorcan ByrneForewordVenturelorcan@forewordventure.com"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-07T15:00:00.000Z",
    "title": "Bitcoin Price Analysis:  Orbiting 29089 Level - 8 August 2023",
    "url": "https://cryptodaily.co.uk/2023/08/bitcoin-price-analysis-orbiting-29089-level-8-august-2023",
    "description": "<p>BTC/USD Orbiting 29089 Level:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 8 August 2023</p>\n<p>Bitcoin (BTC/USD) continued to trade sideways early in the Asian session as the pair tested the 29164.09 area multiple times, representing a previous downside price objective related to selling pressure that intensified around the 30350.70 area.&nbsp; &nbsp;Bears continue to push BTC/USD closer to the 28850 area, right around the July monthly low, with the August monthly low of 28477 area in view. Additional downside price objectives linked to recent selling pressure include the 28432, 28213, 28137, 27979, 27757, 27430, 27409, 27338, 27312, 27246, 26501, 26348, and 26199 levels.&nbsp; Also, the 28095.44 area represents the 23.6% retracement of the historic depreciating range from 69000 to 15460.&nbsp;&nbsp;</p>\n<p>Following recent upside activity, areas of technical support and potential buying pressure include the 28306, 27466, 26428, and 26272 levels.&nbsp; Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 29176.47 and the&nbsp;50-bar MA&nbsp;(Hourly) at 29043.23.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-07T14:53:54.000Z",
    "title": "Payments Giant Paypal Launches Dollar-Backed Stablecoin PYUSD",
    "url": "https://news.bitcoin.com/payments-giant-paypal-launches-dollar-backed-stablecoin-pyusd/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ppp-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Payments Giant Paypal Launches Dollar-Backed Stablecoin PYUSD\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ppp-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ppp-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ppp-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ppp-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ppp-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ppp-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ppp.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Paypal has introduced its own stablecoin, representing the first venture of its kind by a leading financial firm. Initially reported by Bloomberg, the launch could notably accelerate the slow integration of cryptocurrencies for payment purposes. A New Era for Paypal: Introduction of PYUSD Stablecoin to Facilitate Cryptocurrency Trading and Payments On Monday, the internet is [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T14:58:29.000Z",
    "title": "WhiteBIT Crypto Exchange Has Launched Its Own Blockchain",
    "url": "https://www.cryptopolitan.com/whitebit-crypto-exchange-has-launched-its-own-blockchain/",
    "description": "In August of this year, the WhiteBIT cryptocurrency exchange announced the launch of its own blockchain, WB Network. This monumental move marks a new era of progress for the company and its community, with the primary aim of promoting the widespread adoption of blockchain technologies. The blockchain launch brings faster crypto transaction processing, reduced user ... <a title=\"WhiteBIT Crypto Exchange Has Launched Its Own Blockchain\" class=\"read-more\" href=\"https://www.cryptopolitan.com/whitebit-crypto-exchange-has-launched-its-own-blockchain/\" aria-label=\"More on WhiteBIT Crypto Exchange Has Launched Its Own Blockchain\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T14:54:52.000Z",
    "title": "European Edition Global Blockchain Congress by Agora Group Took Place on July 24th & 25th at Hilton London Bankside",
    "url": "https://www.cryptopolitan.com/european-edition-global-blockchain-congress-by-agora-group-took-place-on-july-24th-25th-at-hilton-london-bankside/",
    "description": "This edition’s main theme was: DeFi, Gaming, Metaverse, and NFTs, which brought an A-list speakers, some of the industry’s top-level experts, providing the most reliable insights.&#160; The Global Blockchain Congress aims to significantly contribute to the advancement of blockchain technology in the world by providing a unique platform to connect some of the most influential ... <a title=\"European Edition Global Blockchain Congress by Agora Group Took Place on July 24th &#38; 25th at Hilton London Bankside\" class=\"read-more\" href=\"https://www.cryptopolitan.com/european-edition-global-blockchain-congress-by-agora-group-took-place-on-july-24th-25th-at-hilton-london-bankside/\" aria-label=\"More on European Edition Global Blockchain Congress by Agora Group Took Place on July 24th &#38; 25th at Hilton London Bankside\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T14:53:43.000Z",
    "title": "Is AI Music A Captivating Blend of Potential and Reality?",
    "url": "https://www.cryptopolitan.com/ai-music-the-mirage-reality-and-expectation/",
    "description": "In a startling revelation this past April, fans of the iconic Britpop band Oasis were abuzz with the discovery of a &#8220;lost&#8221; album. This collection, capturing the essence of late-90s culture with its powerful choruses and Liam Gallagher&#8217;s distinctive Mancunian voice, seemed like a dream come true. However, the dream was short-lived. The tracks, intriguingly ... <a title=\"Is AI Music A Captivating Blend of Potential and Reality?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-music-the-mirage-reality-and-expectation/\" aria-label=\"More on Is AI Music A Captivating Blend of Potential and Reality?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T14:47:09.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-07T15:00:02.000Z",
    "title": "Shiba Inu Sees 10% Pullback, But Here’s Why Rally Can Still Continue",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-sees-10-pullback-why-rally-still-continue/",
    "description": "Shiba Inu has gone down 10% since hitting a local top two days ago. But here are some metrics that suggest the rally could still continue. Shiba Inu On-Chain Metrics Have Seen Positive Developments Recently Shiba Inu had been stuck in a perpetual sideways trend during most of July, but the meme coin&#8217;s fate switched in the first few days of this month as its price showed some strong upwards momentum. In this rally, the asset had managed to breach the $0.00001000 level, meaning that it had risen almost 30% in a matter of days. The coin, however, couldn&#8217;t keep this rise up and soon hit a local top, and since then, SHIB has been moving down. The below chart shows how Shiba Inu has performed during the past month: Looks like the value of the asset has shot up in recent days &#124; Source: SHIBUSD on TradingView As you can see in the graph, while SHIB has seen a notable 10% drawdown since the top around two days back, the full gains of the rally haven&#8217;t been wiped out just yet. Shiba Inu is still around 9% up during the past week, which makes it by far the best-performing coin among the top assets by market cap, as most of the sector has in fact gone into the red in this period. Investors of SHIB&#8217;s eternal rival, Dogecoin, for instance, are 5% underwater in the past seven days. When looking at only the last 24 hours, though, the meme coin is the worst-performing top coin, as it has registered losses of around 5%. So it&#8217;s possible that Shiba Inu has already lost its steam and the asset would gradually keep declining until all the profits of the rally are retraced. Related Reading: Will Bitcoin Rebound Anytime Soon? Here’s What On-Chain Data Says Data from the on-chain analytics firm Santiment, however, might provide a glimmer of hope to the meme coin&#8217;s holders, as some positive developments seem to have occured in the coin&#8217;s underlying metrics. The data for the SHIB trading volume and exchange supply &#124; Source: Santiment on X There are two indicators of interest here: the &#8220;trading volume&#8221; and the &#8220;supply on exchanges.&#8221; The former of these is the measure of the total amount of SHIB that investors are transacting on the blockchain right now, while the latter keeps track of the total number of coins sitting in the wallets of all centralized exchanges. From the chart, it&#8217;s visible that the trading volume has shot up for the asset recently. This is a sign that there is a high amount of interest around Shiba Inu right now, which could potentially help fuel more price surges. Related Reading: Bitcoin NVT Shows Bearish Crossover, Price Drop Incoming? The supply of exchanges, on the other hand, has registered a decline at the same time. This is also likely to be constructive for the meme coin, as these platforms are what investors use for selling-related purposes. Since holders are withdrawing their coins from them (possibly for holding onto the SHIB for extended periods), the selling pressure in the market as a whole may be going down. It&#8217;s far from a guarantee, but if these factors continue to stay favorable in the coming days, then a bounce back for the Shiba Inu rally may become more probable. Featured image from Ferhat Deniz Fors on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-07T14:49:55.000Z",
    "title": "Calm Before the Storm? Bitcoin (BTC) Price Holds Steady Ahead of CPI Data, Fundamentals Point to Recovery",
    "url": "https://www.crypto-news-flash.com/calm-before-the-storm-bitcoin-btc-price-holds-steady-ahead-of-cpi-data-fundamentals-point-to-recovery/?utm_source=rss&utm_medium=rss&utm_campaign=calm-before-the-storm-bitcoin-btc-price-holds-steady-ahead-of-cpi-data-fundamentals-point-to-recovery",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/11/bitcoin-3134829_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/11/bitcoin-3134829_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/bitcoin-3134829_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/bitcoin-3134829_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/bitcoin-3134829_1920-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Bitcoin traders are shorting volatility at this stage with no near-term upside catalyst ahead in sight. The euphoria surrounding spot Bitcoin ETF ends as approval seems far away for now. As we advance into the second week of August 2023, the world&#8217;s largest cryptocurrency Bitcoin (BTC) continues to consolidate around the $29,000 levels. Over the [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-07T14:48:00.000Z",
    "title": "ADA Could Explode to $31 in the Long Term, Predicts Analyst",
    "url": "https://coinedition.com/ada-could-explode-to-31-in-the-long-term-predicts-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/30-Cardano-ADA-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>An analyst from the cryptocurrency YouTube channel, Cheeky Crypto, predicted that the price of Cardano (ADA) could potentially surge to $31 in the long term. Before the altcoin’s price can climb to this ambitious target, the analyst forecasted further negative price movement for the cryptocurrency. The analyst’s bullish outlook for the Ethereum-killer stems from the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ada-could-explode-to-31-in-the-long-term-predicts-analyst/\">ADA Could Explode to $31 in the Long Term, Predicts Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]