[
  {
    "source": "Cointelegraph",
    "date": "2024-02-28T22:44:06.000Z",
    "title": " Gemini to return at least $1.1B to Earn customers in settlement with NYDFS ",
    "url": "https://cointelegraph.com/news/gemini-refund-earn-customers-in-settlement-new-york-financial-regulator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZGI0NWVmNjgtODQyZC00MjhjLWIyN2EtZjZhODZkNzBjYjY5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Gemini said that 97% of the assets should be recoverable within two months and the remaining asset balance within the next 12 months. </p>\n                    <p><p>Cryptocurrency exchange Gemini and New York State Department of Financial Services (NYDFS) have reached a settlement that will see Gemini return at least $1.1 billion to customers of the Gemini Earn Program through the Genesis bankruptcy proceeding.</p><p>Gemini will also pay a $37 million penalty for multiple compliance failures “that threatened the safety and soundness of the company,” Superintendent Adrienne A. Harris of the NYDFS <a href=\"https://www.dfs.ny.gov/reports_and_publications/press_releases/pr202402282\" target=\"_blank\" rel=\"noopener nofollow\">explained </a>in a Feb. 28 statement.</p><p>Harris noted the NYDFS could bring further action against Gemini if it fails to fulfill its obligations.</p><p><a href=\"https://cointelegraph.com/news/gemini-refund-earn-customers-in-settlement-new-york-financial-regulator\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-28T22:49:21.000Z",
    "title": "Gemini agrees to return $1.1 billion to Earn customers as part of NYDFS settlement",
    "url": "https://cryptoslate.com/gemini-agrees-to-return-1-1-billion-to-earn-customers-as-part-of-nydfs-settlement/",
    "description": "<p>The New York State Department of Financial Services (NYDFS) reached a settlement agreement with Winklevoss-owned crypto exchange Gemini. The NYDFS announced the settlement in a press release published on Feb. 28. The regulator said that Gemini failed to protect its customers adequately and had multiple compliance issues. Superintendent Adrienne Harris said: &#8220;Gemini failed to conduct [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/gemini-agrees-to-return-1-1-billion-to-earn-customers-as-part-of-nydfs-settlement/\">Gemini agrees to return $1.1 billion to Earn customers as part of NYDFS settlement</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-28T22:54:56.000Z",
    "title": "Bitcoin ETFs amass $7.7 billion in trading volume, registering a new daily record",
    "url": "https://cryptobriefing.com/bitcoin-etf-amass-77-billion-trading-volume/",
    "description": "As Bitcoin climbs past $60,000, US-based spot Bitcoin ETFs register a trading volume frenzy fueled by natural demand."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-28T23:00:20.000Z",
    "title": "Amidst a Surge in Spot Bitcoin ETF Reserves, Kraken Institutional Enters the Market",
    "url": "https://news.bitcoin.com/amidst-a-surge-in-spot-bitcoin-etf-reserves-kraken-institutional-enters-the-market/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/safers-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Amidst a Surge in Spot Bitcoin ETF Reserves, Kraken Institutional Enters the Market\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/safers-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/safers-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/safers-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/safers-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/safers-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/safers-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/safers.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The crypto exchange based in San Francisco, Kraken, has unveiled its latest offering, Kraken Institutional, a digital currency suite designed expressly for high-net-worth firms and institutional investors. Deep Liquidity and Low-Latency Trading: Kraken Institutional&#x2019;s Promise to Elite Clients This new crypto service, Kraken Institutional, introduced by Tim Ogilvie, the global head of the business division, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-28T22:52:09.000Z",
    "title": "Woman faces legal action over alleged $4.2M cryptocurrency mishandling",
    "url": "https://www.cryptopolitan.com/legal-action-alleged-4-2m-cryptocurrency/",
    "description": "A 31-year-old woman is gearing up for a courtroom battle amidst accusations of mishandling $4.2 million in cryptocurrency. Law enforcement authorities have revealed intentions to charge her with fraud and suspected involvement in money laundering activities.&#160; The investigation stemmed from a complaint filed by a company, alleging that an employee diverted $4.2 million worth of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-28T22:41:53.000Z",
    "title": "Hong Kong sets global benchmark in virtual asset regulation",
    "url": "https://www.cryptopolitan.com/hong-kong-sets-global-benchmark-in-virtual-asset/",
    "description": "Hong Kong&#8217;s Financial Secretary, Mr. Chan Mo-po, has announced the launch of a &#8216;regulatory sandbox&#8217; for stablecoin issuers as part of the 2024 budget. This initiative marks a pivotal step in the city&#8217;s approach to cryptocurrency regulation, providing a controlled environment for testing the issuance processes, business models, investor protection mechanisms, and risk management systems [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-28T23:00:17.000Z",
    "title": "Renowned Economist Says Bitcoin Isn’t Digital Gold, Then What Is It?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-isnt-digital-gold/",
    "description": "Chief Economist and Bitcoin antagonist, Peter Schiff has made another controversial statement about BTC, comparing the world’s largest cryptocurrency to gold, while expressing skepticism about BTC being lauded as the “digital gold.” Bitcoin Is “Digital Anti-Gold” In a February 27 post on X (formerly Twitter), Schiff publicly criticized Bitcoin’s title as the digital gold, asserting that the cryptocurrency should be seen as a bet against gold instead of a digital counterpart of the precious metal. While the renowned economist has stated that “Bitcoin is not digital gold,” he has also provided his version of a more accurate description of Bitcoin, characterizing the cryptocurrency as a “digital anti-gold.” Related Reading: Can Ethereum Touch $4,000? Crypto Analyst Says ETH Rally Far From Over Earlier in November 2023, ARK Invest CEO, Cathie Woods declared Bitcoin to be a digital gold, confidently stating that she would rather wager on Bitcoin than gold. Similarly, Chief Executive Officer (CEO) of MicroStrategy, Michael Saylor and CEO of VanEck, Jan van Eck, have confirmed BTC to be the ultimate store of value.  These sentiments and statements from renowned BTC investors and leading cryptocurrency supporters clearly contrast Schiff&#8217;s perspective on BTC. The global strategist is well known for his opposing views against BTC and other cryptocurrencies, often criticizing the value of these digital assets and informing the broader crypto community of the risks associated with cryptocurrencies while glorifying gold’s value.  The economist has remained critical of Bitcoin&#8217;s perceived role as a digital store of value, highlighting that BTC buyers should hope for the sustained control of inflationary pressures and the ongoing strength of the United States dollar (USD) against other fiat currencies. Crypto Community In Opposition The crypto community has swiftly offered their personal opinions on Schiff’s statement about Bitcoin, opposing the Bitcoin antagonist’s views and showcasing their relentless support for the cryptocurrency.  Related Reading: Cardano Adoption Explodes: ADA Price Ready To Reclaim $3.1 All-Time High? One crypto community member has asserted that Schiff’s Bitcoin remarks lack theoretical validity, stemming from a fundamental misunderstanding and fear of BTC&#8217;s value and potential. Another member has highlighted the differences between gold and Bitcoin, describing the cryptocurrency as a “tech innovation” which has nothing to do with precious metals like gold.  The majority of crypto members have shown unwavering support for BTC, with some even stating that Bitcoin could potentially surpass the value of gold in the future. “Bitcoin is going to consume gold. It’s not a matter of if, it’s a matter of when,” a community member stated. BTC price surges despite criticism &#124; Source: BTCUSD on Tradingview.com Featured image from InfoMoney, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-28T23:01:47.000Z",
    "title": "New Bitcoin ETFs See More Individual Trades Than Top Two Equities ETFs: Bloomberg Analyst",
    "url": "https://dailyhodl.com/2024/02/28/new-bitcoin-etfs-see-more-individual-trades-than-top-two-equities-etfs-bloomberg-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/Fed-Could-Trigger-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/Fed-Could-Trigger-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/Fed-Could-Trigger-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/Fed-Could-Trigger-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/Fed-Could-Trigger-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/Fed-Could-Trigger-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/Fed-Could-Trigger-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A prominent Bloomberg analyst says that Bitcoin (BTC) exchange-traded funds (ETFs) – which only launched in January – are seeing more individual trades than the top two ETFs in the equities markets. In a new thread, Bloomberg senior ETF analyst Eric Balchunas tells his 243,600 followers on the social media platform X that BTC ETFs [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/28/new-bitcoin-etfs-see-more-individual-trades-than-top-two-equities-etfs-bloomberg-analyst/\">New Bitcoin ETFs See More Individual Trades Than Top Two Equities ETFs: Bloomberg Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]