[
  {
    "source": "CryptoSlate",
    "date": "2023-08-26T19:00:08.000Z",
    "title": "Tether CTO clarifies rumors around photo of a container with the ‘Tether Energy’ logo",
    "url": "https://cryptoslate.com/tether-cto-clarifies-rumors-around-photo-of-a-container-with-the-tether-energy-logo/",
    "description": "<p>Paolo Ardoino, the CTO of Tether, posted a picture of large industrial containers sporting the logo of Tether Energy on Aug. 24.  The photo sparked a flurry of rumors and speculations which Ardoino addressed in a separate post on X on Aug. 26. Ardoino&#8217;s initial picture started speculations about whether the image was photoshopped, questioning [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/tether-cto-clarifies-rumors-around-photo-of-a-container-with-the-tether-energy-logo/\">Tether CTO clarifies rumors around photo of a container with the ‘Tether Energy’ logo</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-26T19:06:51.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain‘s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-26T18:54:13.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-26T18:47:58.000Z",
    "title": "Donald Trump NFT prices surge amid electoral interference allegations",
    "url": "https://www.cryptopolitan.com/donald-trump-surge-interference-allegation/",
    "description": "In a surprising turn of events, the world of non-fungible tokens (NFTs) witnessed a notable surge in prices following the release of a photo depicting former United States President Donald Trump. This image, stemming from his ongoing criminal case in Georgia for alleged electoral interference, has ignited a fresh wave of interest in Trump-themed digital ... <a title=\"Donald Trump NFT prices surge amid electoral interference allegations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/donald-trump-surge-interference-allegation/\" aria-label=\"More on Donald Trump NFT prices surge amid electoral interference allegations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-26T18:42:23.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices to consider when investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-26T18:56:11.000Z",
    "title": "Will US Treasury proposals kill defi? Critics blast new crypto bill",
    "url": "https://crypto.news/will-us-treasury-proposals-kill-defi-critics-blast-new-crypto-bill/",
    "description": "The US Treasury Department recently revealed a proposal outlining new tax rules for the cryptocurrency industry. Among the updates is the introduction of a 1099 form for crypto transactions. The new guidelines also clarify tax obligations for digital asset miners. &#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-26T19:00:45.000Z",
    "title": "AVAX Dump Continues Despite Puma/Roc Nation Sneaker Launch On Avalanche",
    "url": "https://www.newsbtc.com/avalanche/avax-dump-continues-despite-puma-roc-nation-sneaker-launch-on-avalanche/",
    "description": "AVAX, the native currency of the Avalanche blockchain, is trading at new 2023 lows at the time of writing on August 26. Trading at $10, the coin is down 55% from 2023 highs and roughly 25% alone in August 2023. At this pace, AVAX has not only broken mid-June 2023 lows but could break below the critical June 2021 support. AVAX Is Sinking A look at the daily candlestick arrangement in August shows that sellers have been unwavering and firm despite the general optimism amongst supporters. Of note, it is clear that the selling momentum has been strong. AVAX bear bars have been banding along the lower BB, meaning sellers have been unloading faster. At the same time, the divergence of the middle BB from the upper and lower BB suggests that AVAX prices have been volatile. This can be illustrated by the rapid contraction, especially in the second half of August when AVAX has shaved off over 20% of its value. The sell-off also comes amid a drop in trading activity and general liquidity, as volume indicators show in the daily chart. Comparing the current activity with those of early to mid-July 2023, it is evident that trading volumes have rapidly contracted. This drop may point to general apprehension as traders steer clear, considering the recent decline in valuation.  Related Reading: Shiba Inu Community Burn Sees Another 350 Million Meme Coins Incinerated Typically, trading volumes are an indicator of interest, and in times of expanding prices, like in early July, AVAX trading volumes rose in tandem. The higher the trading volumes, the more liquid the token is since traders are more engaged and confident of the project&#8217;s prospects.  Avalanche Vista And New Partnerships AVAX remains under pressure despite Avalanche Foundation partnering with Legitimate Technology, a web3 company, days after the foundation launched the &#8220;Avalanche Vista&#8221; program. The foundation aims to purchase real-world assets (RWAs) of up to $50 million minted on Avalanche. Following this, Legitimate joined forces with Puma and Roc Nation to bring the worlds of fashion and music on-chain. Related Reading: This Ethereum Metric Has Sparked Centralization Concerns Over ETH Ownership In partnership, Legitimate has now released the &#8220;Evolution of the Mixtape&#8221; sneaker collection to celebrate what they say is &#8220;hip-hop&#8217;s 50th anniversary.&#8221; The collection will include three unique sneaker models, each embedded with a near-field communication (NFC) chip for &#8220;owners to access a digital portal showcasing weekly mixtapes and behind-the-scenes content from Roc Nation artists.&#8221; Each NFC chip is linked to an immutable digital object on Avalanche for easy provenance. All these digitized products can be redeemed through Legitimate&#8217;s LGT protocol. Featured image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-26T18:45:13.000Z",
    "title": "U.S. Treasury and Internal Revenue Service Publish New Proposed Crypto Tax Regulations",
    "url": "https://dailyhodl.com/2023/08/26/u-s-treasury-and-internal-revenue-service-publish-new-proposed-crypto-tax-regulations/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/internal-publish-new-tax.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/internal-publish-new-tax.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/internal-publish-new-tax.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/internal-publish-new-tax.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/internal-publish-new-tax.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/internal-publish-new-tax.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/internal-publish-new-tax.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Department of the Treasury and the Internal Revenue Service (IRS) are jointly proposing new tax regulations for the digital assets industry. In a new publication, the Treasury and the IRS are proposing that payment platforms, wallet providers and trading firms that deal with crypto assets file tax returns on certain sales or exchange [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/26/u-s-treasury-and-internal-revenue-service-publish-new-proposed-crypto-tax-regulations/\">U.S. Treasury and Internal Revenue Service Publish New Proposed Crypto Tax Regulations</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]