[
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T02:56:38.000Z",
    "title": "Dogecoin (DOGE) set to be replaced by Pandoshi (PAMBO) in 2024",
    "url": "https://www.cryptopolitan.com/dogecoin-doge-set-to-be-replaced-by-pandoshi-pambo-in-2024/",
    "description": "As 2024 progresses, major shifts are underway in the crypto industry. An ambitious new project, Pandoshi (PAMBO), is capturing interest with its unique approach to decentralized finance (DeFi) and potential to disrupt the status quo. This surge of attention indicates Pandoshi could soon eclipse the popularity of Dogecoin (DOGE), the long-reigning meme coin. Pandoshi’s Promising [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-18T03:00:24.000Z",
    "title": "Regulatory Victory: Gemini Receives Digital Asset Service Provider Registration In France",
    "url": "https://www.newsbtc.com/news/regulatory-victory-gemini-receives-digital-asset-service-provider-registration-in-france/",
    "description": "Cryptocurrency exchange Gemini, founded by the Winklevoss twins, has been granted crypto registration by the French markets watchdog Autorite des marches financiers (AMF).  According to a recent announcement made by the exchange, this approval allows Gemini to offer its services as a virtual asset services provider in France. The company plans to roll out its products to both retail and institutional clients in the coming weeks. Gemini Seizes Growth Opportunities In Europe As announced, Gemini customers in France will gain access to a wide range of cryptocurrencies for trading, as well as “advanced” trading platforms such as ActiveTrader. Institutional clients will also benefit from Gemini eOTC, an electronic over-the-counter trading solution. Gemini&#8217;s regulatory approval in France marks a milestone in the company&#8217;s European expansion strategy. According to the exchange’s statement, with a strong sense of regulatory support for the cryptocurrency industry in Europe, Gemini sees growth opportunities in the French jurisdiction.  The founders of Gemini recognized the need for regulatory clarity, which is on the horizon with the European Union (EU) Markets in Crypto-Assets Regulation (MiCA). MiCA allows crypto companies to obtain licenses in one EU country and operate across the entire EU.  Related Reading: QCP Capital Forecasts ETH’s Dominance Over Bitcoin To Persist, Ethereum ETFs In Focus Interestingly, Gemini chose Ireland as its European headquarters, joining other major US crypto companies that have selected Ireland as their regulatory hub. On this matter, Gillian Lynch, Gemini’s Head of Ireland and EU stated: We are delighted to welcome customers based in France onto the Gemini platform in the coming weeks as we further expand access to crypto across Europe. France is a global innovation leader and has a vibrant crypto community as showcased by the success of Paris Blockchain Week. We are excited to soon be able to provide French customers with compliant and secure access to the future of finance as we continue on our mission to unlock the next era of financial, creative, and personal freedom US Crypto Companies Seek Regulatory Haven In Europe According to a CNBC report, major US crypto companies are increasingly looking to expand their operations in Europe driven by regulatory challenges in the United States.  The crypto industry has faced scrutiny from US regulators, including the Securities and Exchange Commission (SEC). Gemini and Genesis, a crypto lender, were charged by the SEC last year for allegedly selling unregistered securities. Gemini is contesting the lawsuit, asserting that its interest-bearing products do not qualify as securities.  Per the report, the European Union offers a “more favorable” regulatory environment, and the MiCA regulation provides a framework for companies to operate across EU member states. Related Reading: Parabolic Bitcoin Indicator Points To Continued Bull Run Despite 15% Crash While the US has yet to approve comprehensive federal-level crypto regulation, recent developments indicate a growing acceptance of cryptocurrency trade. The SEC&#8217;s approval of the first-ever spot Bitcoin exchange-traded funds (ETFs) is seen as a significant step toward integrating crypto into traditional finance.  Despite initial concerns about market manipulation, the approval of Bitcoin ETFs by the SEC is a positive development for the industry. At the same time, several bills related to crypto regulation are making their way through the US House of Representatives.  Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-18T02:56:10.000Z",
    "title": "Bitcoin Price Faces Uphill Task, Risk of Additional Losses Below $42K Looms",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-faces-uphill-task-43500/",
    "description": "Bitcoin price is still struggling below the $43,250 resistance zone. BTC remains at risk of more downsides if it stays below $43,500 for a long time. Bitcoin price is still trading in a range from the $41,500 zone. The price is trading below $43,250 and the 100 hourly Simple moving average. There was a break below a key rising channel with support near $42,880 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair is now at risk of more downsides below the $41,500 support zone. Bitcoin Price Turns Red Bitcoin price started a consolidation phase from the $41,500 zone. BTC recovered a few points, but the bears were active near the $43,250 and $43,500 levels. The last swing high was near $43,568 before the price started a fresh decline. There was a clear move below the $43,000 level. Besides, there was a break below a key rising channel with support near $42,880 on the hourly chart of the BTC/USD pair. Bitcoin is now trading below $43,250 and the 100 hourly Simple moving average. It is again attempting a recovery wave above the $42,500 level. On the upside, the price is facing resistance near the $42,800 level. It is close to the 50% Fib retracement level of the recent decline from the $43,568 swing high to the $42,190 low. The first major resistance is $43,000. The main resistance is now forming near the $43,250 level. Source: BTCUSD on TradingView.com The 76.4% Fib retracement level of the recent decline from the $43,568 swing high to the $42,190 low is also near $43,250. A clear move above the $43,250 resistance could send the price toward the $44,000 resistance. The next resistance is now forming near the $44,250 level. A close above the $44,250 level could push the price further higher. The next major resistance sits at $45,000. More Losses In BTC? If Bitcoin fails to rise above the $43,250 resistance zone, it could start a fresh decline. Immediate support on the downside is near the $42,120 level. The next major support is $41,450. If there is a close below $41,450, the price could gain bearish momentum. In the stated case, the price could drop toward the $40,000 support in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $42,120, followed by $41,450. Major Resistance Levels – $43,000, $43,250, and $44,000."
  }
]