[
  {
    "source": "Cointelegraph",
    "date": "2023-10-19T03:11:10.000Z",
    "title": "Sui token struggles to regain despite denial of 'unfounded' allegations",
    "url": "https://cointelegraph.com/news/sui-token-struggles-regain-foundation-allegation-south-korea",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2022-06/e9063cbb-2b54-4a49-ae8c-1a4cbf757620.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The price of the SUI token plummeted after allegations of supply manipulation from regulatory officials in South Korea.</p>\n                    <p><p>Sui's native SUI token has struggled to regain ground after plunging more than 9% amid allegations from South Korean regulators, which have accused the Sui Foundation of manipulating the supply of the token for its own gain. </p><p>SUI token gained a little under 1% in the last 24 hours after falling from $0.41 on Oct. 16 to new lows of $0.37 on Oct. 18. Current prices mark a 7% decline in just two days, according to <a href=\"https://www.coingecko.com/en/coins/sui\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from CoinGecko.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/4735c46c-fd6c-41e3-a083-819c0bda4596.png\"><figcaption style=\"text-align: center;\"><em>The price of the SUI token has struggled to regain ground amid allegations of supply manipulation. Source: CoinGecko</em></figcaption></figure><p>In an Oct. 18 post to X (formerly known as Twitter), the Sui Foundation — the organization behind layer-1 blockchain Sui — slammed the allegations of supply manipulation as “unfounded and materially false.” </p><p>“We want to address some inaccuracies that have been reported today,” said the Sui Foundation. </p><p>\"The unfounded and materially false statements surrounding the supply of SUI tokens need to be addressed. There has never been any sale of SUI tokens by the Foundation after the initial Community Access Program (CAP) distributions. Period,” it explained. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We want to address some inaccuracies that have been reported today.<br><br>Sui Foundation has been and remains committed to cooperating with DAXA and its member exchanges in the spirit of full compliance and transparency.<br><br>The unfounded and materially false statements surrounding the…</p>— Sui Foundation (@SuiFoundation) <a href=\"https://twitter.com/SuiFoundation/status/1714349720187859021?ref_src=twsrc%5Etfw\">October 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<blockquote>“The circulating supply schedule displayed on the Sui Foundation public website and available through the public API endpoints is accurate.”</blockquote><p>The Sui Foundation’s stalwart post came in response to a reports from South Korean news outlets <a href=\"https://www.techm.kr/news/articleView.html?idxno=115585\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-techm-kr.cdn.ampproject.org/c/s/www.techm.kr/news/articleViewAmp.html?idxno=115585\">TechM</a> and <a href=\"https://www.eblockmedia.com/news/articleView.html?idxno=1862\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-eblockmedia-com.cdn.ampproject.org/c/www.eblockmedia.com/news/articleViewAmp.html?idxno=1862\">Block Media</a>, which said that regulators from the country had launched an investigation into the Sui Foundation. </p><p>According to the reports, the South Korean Financial Supervisory Service (FSS) said it would soon launch an investigation into the distribution of the Sui token, following allegations made by a Representative Min Byeong-deok, a lawmaker from the Democratic Party of Korea. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/south-korea-otc-crypto-regulations\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/south-korea-otc-crypto-regulations/amp\"><strong><em>South Korea focuses on OTC crypto regulations as unlawful deals reach $4B</em></strong></a></p><p>Rep. Min claimed that the Sui Foundation had paid itself interest by staking coins that should have remained in the non-circulating supply. </p><p>\"It has fallen more than 67% in the five months since listing. The issuer, Sui Foundation, received self-interest by staking (depositing) the locked-up amount and sold it to increase circulation,” Rep. Min added. </p><p>Additionally, Rep. Min alleged that the reason for why the Sui token had plummeted was because the foundation had “lied about the amount in circulation.” </p><p>South Korean lawmakers have ramped up their efforts to better regulate crypto activity in the country, following the collapse of <a href=\"https://cointelegraph.com/news/breaking-terra-blockchain-officially-halted-following-luna-price-collapse\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/breaking-terra-blockchain-officially-halted-following-luna-price-collapse/amp\">Do Kwon’s Terra Money ecosystem</a> in May, 2022. As such, the <a href=\"https://cointelegraph.com/news/south-korean-regulator-enhance-digital-asset-legislation\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/south-korean-regulator-enhance-digital-asset-legislation/amp\">FSS expects to introduce a comprehensive</a> set of crypto legislation as early as Jan. next year. </p><p>Cointelegraph contacted the Sui Foundation for further comment but did not receive an immediate response.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-19T03:15:50.000Z",
    "title": "Mastering Generative Language AI for Optimal Work Integration",
    "url": "https://www.cryptopolitan.com/generative-language-ai-optimal-integration/",
    "description": "In the rapidly evolving realm of artificial intelligence, the advent of Generative Language AI (GLAI) is reshaping conventional practices in supply chain and procurement. Launched to the public on November 30, 2022, ChatGPT, a prominent player in this landscape, is transcending its reputation as a conversational partner with a foray into the intricate world of ... <a title=\"Mastering Generative Language AI for Optimal Work Integration\" class=\"read-more\" href=\"https://www.cryptopolitan.com/generative-language-ai-optimal-integration/\" aria-label=\"More on Mastering Generative Language AI for Optimal Work Integration\">Read more</a>"
  }
]