[
  {
    "source": "Cointelegraph",
    "date": "2023-11-10T06:59:21.000Z",
    "title": "Roblox CEO 'dreams' of in-game cross-platform NFTs and digital objects",
    "url": "http://cointelegraph.com/news/cross-platform-nfts-dream-roblox-ceo",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/4c0596cd-d0be-4e72-a1ab-de3ed8e27ad0.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Roblox founder and CEO David Baszucki expects top brands and celebrities to take charge and play a key role in making the \"dream\" of cross-platform NFT come true.</p>\n                    <p><p>The frontman of the popular virtual universe game Roblox, David Baszucki, has said he ‘dreams’ of having the ability to move <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a> and digital objects across multiple platforms. </p><p>Following the company's Q3 2023 earnings call, Roblox founder and CEO Baszucki spoke about the role major influencers play in fueling the widespread adoption of NFTs and digital collectibles in a recent CNBC <a href=\"https://www.youtube.com/watch?v=PDr5pc9pgy4\" target=\"_blank\" rel=\"noopener nofollow\">interview</a>. He believed in the idea of users being able to move their collections across non-native platforms:</p><blockquote>“There’s a bit of a dream here about objects and NFTs moving from platform to platform.”</blockquote><p>For example, Baszucki stated that A-list celebrities such as Elton John could sign up on Roblox and make and sell limited edition collectibles like capes for charity. These types of collectibles could go off the Roblox platform as an NFT and could be sold in other marketplaces.</p><p>“What we do expect is that creators, whether it’s Elton John or Nike or someone else making a digital item, that they would play a key role and have a fair amount of control in that process,” Baszucki concluded.</p><p>Roblox’s latest earnings call revealed a loss in Q3; however, the company recorded a 20% year-over-year growth in booking estimates on higher in-game spending and the total number of users. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/multiverse-x-eyes-metaverse-scalability-ceo-spatial-computing\"><strong><em>MultiversX eyes metaverse scalability as CEO sheds light on spatial computing</em></strong></a></p><p>Baszucki’s growing interest in NFTs resonates with overall market sentiment as blockchain analytics company Nansen reported spike in November NFT sales volumes.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">NFT volume for the past 5 weeks has been steadily increasing <br><br>The bottom was the week closing 9th Oct, where NFT weekly volume was 29,704 ETH, compared to last week, week ending Nov 6th, NFT sales volume reached 68,342 ETH<br><br>Slowly then suddenly...?<a href=\"https://t.co/SOlhKZezmO\">https://t.co/SOlhKZezmO</a> <a href=\"https://t.co/420fiRYw9e\">pic.twitter.com/420fiRYw9e</a></p>&mdash; Nansen  (@nansen_ai) <a href=\"https://twitter.com/nansen_ai/status/1721478160066425206?ref_src=twsrc%5Etfw\">November 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In terms of NFT collections, Bored Ape Yacht Club (BAYC) had the highest trading volume in the last 30 days. The BAYC collection had a volume of 35,226 ETH, or around $66.7 million. NFTGo’s data also showed that there was a 12% increase in NFT traders during that timeline.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/interview-2-years-after-john-mcafee-death-wife-janice-broke-still-grieving/\"><strong><em>Exclusive: 2 years after John McAfee’s death, widow Janice is broke and needs answers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  }
]