[
  {
    "source": "Cointelegraph",
    "date": "2023-07-17T05:11:36.000Z",
    "title": "Nifty News: Metaverse bank robberies, Trump NFT biz prefers crypto over cash, and more",
    "url": "https://cointelegraph.com/news/nifty-news-bank-america-metaverse-robberies-trump-nft-puma-jayz",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/6ab129ff-c45f-48d6-be39-d79a7f41f248.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Bank of America’s metaverse trains staff on resolving customer disputes or helps them relax by riding a virtual unicorn. </p>\n                    <p><h3>Stick em' up! Bank robbery drills in the Metaverse</h3><p>The Bank of America is mixing a virtual reality metaverse and artificial intelligence to train new employees on everything from handling angry customers to bank robberies.</p><p>Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2023-07-13/bank-of-america-is-using-the-metaverse-ai-to-train-its-hires?srnd=technology-vp#xj4y7vzkg\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> July 13 that the bank’s 2,000 new hires undergo a week-long training regime that includes slipping on a VR headset to practice responding to a variety of simulated situations.</p><p>The VR modules include mundane situations like helping an upset customer or quizzing one which asks for a large swath of cash, and extreme ones, like a full-blown bank robbery. </p><p>The newcomers can also just chill out in VR by riding a unicorn or sitting on an island.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/419fa1fa-04cc-4da6-b567-43f5a1418917.jpg\"  /><figcaption style=\"text-align: center;\"><em>An upset virtual customer the new BoA staff have to calm. Source: Bloomberg </em></figcaption></figure><p>AI is also deployed in the training, the new hires practice conversing with a bot acting as a customer and are helped through the conversation by yet another AI bot.</p><p>Currently, over 200,000 global BoA staff have been privy to the virtual training. The bank’s call centers also have an AI coaching bot to assist in drilling conversations with clients. Managers can also handball further staff training to the bots.</p><p>The innovation and design executive of the BoA’s Academy, Mike Wynn, told Bloomberg that the training is advantageous as these scenarios are “hard to teach traditionally.”</p><p>“VR creates anxiety, it gets your heart rate up. It makes you nervous,” he added.</p><p>Use of its metaverse is also being mulled for use at job fairs in a bid to entice a younger audience for an enthralling career in banking by having them virtually live out the hum-drum of a bank associate.</p><h3>Donald Trump’s NFT business opts to hold funds on-chain</h3><p>Former United States president Donald Trump’s nonfungible token (NFT) licensing business is seemingly choosing to hold its funds on Ethereum, with recently updated disclosures showing next-to-nothing in its bank account.</p><p>The update disclosures filed by Trump with the Office of Government Ethics made public on July 13 provided more details on his finances and business dealings — a legal requirement as he again <a href=\"https://cointelegraph.com/news/2024-us-presidential-candidates-crypto-stance\">makes a bid for the presidency</a>.</p><p>CIC Digital, the firm that gains the revenue from licensing fees for the <a href=\"https://cointelegraph.com/news/nifty-news-trump-drops-more-nfts-ahead-of-presidential-run-meta-opens-to-teens-and-more\">NFT collections that use Trump’s</a> likeness, has a U.S. bank account with a balance of less than $1,000.</p><p>Meanwhile, the company’s Ethereum wallet holds anywhere between $250,000 and $500,000.</p><p>In a previous April disclosure, Trump said he earned anywhere between $500,000 to $1 million from his NFT licensing deals.</p><p>Trump’s renewed bid for president legally requires him to file a “Personal Financial Disclosure” which can be broad in nature, but it's unclear why he updated his financial disclosures to be more specific.</p><p>Two rounds of NFT collections have been released bearing Trump’s image the last of which, released in April, <a href=\"https://cointelegraph.com/news/new-trump-nfts-sell-out-on-day-one\">sold out on their first day</a>.</p><h3>Siemens $560K campus to bebuilt in the metaverse first</h3><p>German tech conglomerate Siemens has committed to building a $560,000 (500 million euros) new tech campus in near Nuremberg, Germany, but will appear first digitally in the metaverse.</p><p>On July 13 Siemens <a href=\"https://press.siemens.com/global/en/pressrelease/siemens-invest-eu1-billion-germany-and-create-blueprint-industrial-metaverse-nuremberg\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it’s spending $1.1 billion (1 billion euros) investment to make a “blueprint for the industrial metaverse” in the country. Half that amount is going to the campus with the goal of making it a hub for what it calls the <a href=\"https://cointelegraph.com/news/metaverse-to-bring-true-productivity-to-industrial-environments-davos-2023\">industrial metaverse</a> — a digital recreation of locations used for troubleshooting and analytics.</p><p>The campus will be built just north of Nuremberg and before construction begins the buildings will be planned out and simulated in the metaverse, then copied into the real world, according to Siemens.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today was a big day for <a href=\"https://twitter.com/Siemens?ref_src=twsrc%5Etfw\">@Siemens</a> and for my hometown. We are investing €1 billion in Germany, with €500 million to lay the foundation for the industrial metaverse in Erlangen. Siemens is creating a new technology campus to intensify research and development and expand our… <a href=\"https://t.co/ZEUeXmoAou\">pic.twitter.com/ZEUeXmoAou</a></p>&mdash; Roland Busch (@BuschRo) <a href=\"https://twitter.com/BuschRo/status/1679554515496738821?ref_src=twsrc%5Etfw\">July 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The digital replica will allow for the layout to be optimized and adjusted before any ground is broken. The campus will sit alongside its existing factory that makes electronic components. </p><p>The funding is part of the firm's $2.2 billion (2 billion euro) investment plan announced last month which aims to build the company new education centres and regional hubs.</p><h3>Puma sneaker NFTs let you listen to tracks, while on track</h3><p>Sports shoe company Puma, NFT company Legitimate and rapper Jay-Z’s entertainment agency Roc Nation have teamed up for a sneaker collection integrated with NFTs.</p><p>The collection dubbed \"The Evolution of the Mixtape\" collection was <a href=\"https://blog.legitimate.tech/our-work/exclusive-sneaker-release-undisclosed-brand-august-2023\" target=\"_blank\" rel=\"noopener nofollow\">released</a> July 14 and features three sneaker models called “Disc,” “Cassette Tape” and “Playlist.” </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">&quot;TAKEOFF&quot;<br><br>You&#39;re going to want to put on your headphones for this.<br><br>Introducing &quot;HUMBLE SOLES&quot;, a new, never-before-released mixtape from <a href=\"https://twitter.com/RocNation?ref_src=twsrc%5Etfw\">@rocnation</a>, exclusively available through the <a href=\"https://twitter.com/PUMA?ref_src=twsrc%5Etfw\">@puma</a> RS-XL &quot;THE EVOLUTION OF THE MIXTAPE&quot;<br><br>14 unique tracks, accessible by scanning the LGT… <a href=\"https://t.co/kkmxeSkFCw\">pic.twitter.com/kkmxeSkFCw</a></p>&mdash; Legitimate - Phygital Products (@LegitimateTech) <a href=\"https://twitter.com/LegitimateTech/status/1679263142558289921?ref_src=twsrc%5Etfw\">July 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The tongue of the left shoe features an NFC chip that can be tapped with a phone to grant access to an exclusive portal featuring unreleased music from Roc Nation artists, video content and a documentary.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/zachxbt-s-research-cited-in-canadian-nft-rug-pull-class-action-lawsuit\"><strong><em>ZachXBT’s research cited in Canadian NFT rug pull class-action lawsuit</em></strong></a></p><p>The shoes are <a href=\"https://us.puma.com/us/en/pd/rs-xl-playlist-sneakers/394552?swatch=01\" target=\"_blank\" rel=\"noopener nofollow\">priced</a> at $130 a pair and Legitimate touts their NFC tags can be linked with an <a href=\"https://cointelegraph.com/explained/what-are-phygital-nfts-and-how-do-they-work\">NFT that authenticates</a> the real product.</p><p>Such “phygital” streetwear has proven popular, in June French luxury brand Dior shipped a <a href=\"https://cointelegraph.com/news/blue-chip-floor-price-low-credit-suisse-football-nft\">new line of sneakers</a> with one pair that came with a “digital twin” — an NFT.</p><h3>More Nifty News:</h3><p>NFT firm Dapper Labs had its <a href=\"https://cointelegraph.com/news/dapper-labs-cut-staff-layoff-amid-nft-contraction\">third round of layoffs</a> in nine months on July 13 with 51 full-time staff and contractors let go, which was around 12% of the company’s staff. In November last year and February 2023 it reduced headcount by 22% and 20% respectively.</p><p>An NFT collector shared how <a href=\"https://cointelegraph.com/news/nft-de-fi-borrower-uses-luxury-watch-backed-nft-as-collateral-for-a-loan\">they secured a $35,000</a> decentralized finance (DeFi) loan by putting up a Patek Phillipe luxury watch as collateral which was then made into an NFT granting ownership of the watch to secure the transaction.</p><p><strong><em>NFT Collector: </em></strong><a href=\"https://cointelegraph.com/magazine/interactive-nfts-future-sport-vegas-sphere-excites-nft-collector/\"><strong><em>Interactive NFTs the future for sport, Vegas Sphere excites</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T05:22:05.000Z",
    "title": "Elon Musk, Memes, and Monkeys: Navigating the New Crypto Landscape",
    "url": "https://www.cryptopolitan.com/elon-musk-memes-and-monkeys-navigating-the-new-crypto-landscape/",
    "description": "In an era where Elon Musk&#8217;s tweets sway cryptocurrency markets, memes morph into lucrative investments, and a token named &#8216;Monkeys&#8217; is capturing attention, navigating the crypto landscape has become a surreal journey. A blend of internet culture and financial speculation, all brought together in a digital domain where innovation, whimsy, and monetary transactions interweave. The ... <a title=\"Elon Musk, Memes, and Monkeys: Navigating the New Crypto Landscape\" class=\"read-more\" href=\"https://www.cryptopolitan.com/elon-musk-memes-and-monkeys-navigating-the-new-crypto-landscape/\" aria-label=\"More on Elon Musk, Memes, and Monkeys: Navigating the New Crypto Landscape\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T05:13:26.000Z",
    "title": "Cryptocurrency Exchange Implements Bitcoin Lightning Network Integration for Enhanced Transactions",
    "url": "https://www.cryptopolitan.com/bitcoin-lightning-network-integration/",
    "description": "Binance, one of the world&#8217;s leading cryptocurrency exchanges, has announced the completion of its integration with the Bitcoin Lightning Network. This eagerly awaited update allows Binance users to leverage the layer-2 scaling solution for Bitcoin withdrawals and deposits, enabling lightning-fast transactions with reduced fees. With this move, Binance joins the ranks of other prominent exchanges ... <a title=\"Cryptocurrency Exchange Implements Bitcoin Lightning Network Integration for Enhanced Transactions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-lightning-network-integration/\" aria-label=\"More on Cryptocurrency Exchange Implements Bitcoin Lightning Network Integration for Enhanced Transactions\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-17T05:11:17.000Z",
    "title": "Uniswap’s UNI Price Could Soon Rally Above $6 – Here’s Why",
    "url": "https://www.newsbtc.com/analysis/uni/uniswaps-uni-price-rally-6/",
    "description": "Uniswap’s UNI started a decent increase above $5.35 against the US Dollar. The price is likely to continue higher above $6.00 and $6.20 in the near term. UNI started a fresh increase after forming a base above the $4.75 level against the US dollar. The price is trading above $5.65 and the 100 simple moving average (4 hours). There was a break above a major contracting triangle with resistance near $5.35 on the 4-hour chart of the UNI/USD pair (data source from Kraken). The pair is likely to continue higher if it clears the $6.00 and $6.20 resistance levels in the near term. Uniswap’s UNI Regains Traction After forming a support base above $5.00, UNI started a fresh increase. The bulls were able to push Uniswap’s price above the $5.25 and $5.30 resistance levels, similar to Bitcoin and Ethereum. There was also a break above a major contracting triangle with resistance near $5.35 on the 4-hour chart of the UNI/USD pair. The pair gained pace and tested the $6.30 zone. A high is formed near $6.291 and the price started a downside correction. There was a break below the $6.00 level. UNI price tested the 50% Fib retracement level of the upward move from the $5.09 low to the $6.291 high. Source: UNIUSD on TradingView.com The price is now trading above $5.50 and the 100 simple moving average (4 hours). On the upside, the price is facing hurdles near $6.00 and $6.10. A close above the $6.10 level could open the doors for more gains in the near term. The next key resistance could be near $6.30, above which the bulls are likely to aim a test of the $6.80 level. Any more gains might send UNI toward $7.00. Dips Supported? If UNI price fails to climb above $6.00 or $6.20, it could correct further lower. The first major support is near the $5.70 level. The next major support is near the $5.50 level. It is close to the 61.8% Fib retracement level of the upward move from the $5.09 low to the $6.291 high. A downside break below the $5.50 support might open the doors for a push toward the key $5.10. Technical Indicators 4-Hours MACD – The MACD for UNI/USD is gaining momentum in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for UNI/USD is well above the 50 level. Major Support Levels – $5.65, $5.50 and $5.10. Major Resistance Levels – $6.00, $6.30 and $6.80."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T05:23:20.000Z",
    "title": "Bullish for Bitcoin: BTC Decouples from Traditional Finance as Wallets Holding 1+ Coins Hit All-Time High",
    "url": "https://www.crypto-news-flash.com/bullish-for-bitcoin-btc-decouples-from-traditional-finance-as-wallets-holding-1-coins-hit-all-time-high/?utm_source=rss&utm_medium=rss&utm_campaign=bullish-for-bitcoin-btc-decouples-from-traditional-finance-as-wallets-holding-1-coins-hit-all-time-high",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-3732876-2048x1152.jpg 2048w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />The 90-day rolling correlation between Bitcoin&#8217;s spot price, the Nasdaq index, and the broader S&#38;P 500 index reached its lowest level in two years.  According to data from Glassnode, the number of Bitcoin addresses holding more than one coin has reached an all-time high. While investors find joy in the rising prices of Bitcoin, certain [...]"
  }
]