[
  {
    "source": "Decrypt",
    "date": "2024-01-17T02:01:01.000Z",
    "title": "Developers Wrangle With the Role of AI On the Battlefield",
    "url": "https://decrypt.co/213150/developers-wrangle-with-the-role-of-ai-on-the-battlefield",
    "description": "As OpenAI addresses ChatGPT use by the military, Kratos gets a cash infusion for AI air defense."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-17T01:57:24.000Z",
    "title": " EU banking authority extends Anti-Money Laundering guidance to crypto ",
    "url": "https://cointelegraph.com/news/eu-banking-authority-aml-ctf-guidance-crypto-firms",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZDM2YjY5MjAtNWRhZS00NzEzLThiMTctMmUwYzdiMDhkNzE3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>EU-based crypto firms are now subject to guidance from the banking watchdog in its “fight against financial crime.”</p>\n                    <p><p>The European Union’s Anti-Money Laundering (AML) and Counter-Terrorist Financing (CTF) guidelines have been extended to European crypto companies following a decision from the region's banking watchdog.</p><p>The European Banking Authority (EBA) <a href=\"https://www.eba.europa.eu/publications-and-media/press-releases/eba-issues-guidance-crypto-asset-service-providers\" target=\"_blank\" rel=\"noopener nofollow\">said</a> on Jan. 16 that the amended guidelines aim to help crypto asset service providers (CASPs) identify their exposure risk to financial crimes due to their “customers, products, delivery channels and geographical locations.”</p><p>The guidelines also outline how crypto firms should adjust their financial crime-fighting measures, which could include “the use of blockchain analytics tools,” the watchdog added. The guidelines will apply from Dec. 30.</p><p><a href=\"https://cointelegraph.com/news/eu-banking-authority-aml-ctf-guidance-crypto-firms\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-17T01:47:00.000Z",
    "title": "Hedge Fund Titan Bill Ackman Projects Aggressive Fed Interest Rate Cuts as it Averts Recession",
    "url": "https://www.cryptoglobe.com/latest/2024/01/hedge-fund-titan-bill-ackman-projects-aggressive-fed-interest-rate-cuts-as-it-averts-recession/",
    "description": "Hedge fund billionaire Bill Ackman, the head of Pershing Square Capital Management, has recently revealed he expects the Federal Reserve to start cutting interest rates at a greater-than-expected rate this year, with the first cut coming sooner than the market is anticipating. Ackman highlighted this during a CNBC “Squawk Box” interview, noting the significant cooling […]\n"
  }
]