[
  {
    "source": "Decrypt",
    "date": "2023-11-17T20:01:02.000Z",
    "title": "Digital Despair: AI Girlfriends Ghost Users After CEO's Arrest Ignites Chaos",
    "url": "https://decrypt.co/206519/ai-girlfriends-caryn-forever-voices-ceo-arrest-austin-texas",
    "description": "The CEO of an AI-powered romantic chatbot service turned up the heat—allegedly, and literally."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-17T19:52:01.000Z",
    "title": "Playnance Partners with Coinstore, Integrating Crypto Trading with P2P Gaming",
    "url": "https://cryptodaily.co.uk/2023/11/playnance-partners-with-coinstore-integrating-crypto-trading-with-p2p-gaming",
    "description": "The Polygon-powered game and B2B Web3 platform Playnance has announced a major partnership with Coinstore, a popular crypto exchange and wallet provider. Under this partnership, Coinstore will channel its extensive user base to Playnance's engaging P2P trading game, where players bet on the price movements of Bitcoin. Coinstore will earn a percentage of the revenue generated from the game."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-17T20:00:37.000Z",
    "title": "Ethereum ETF Race: BlackRock Wants An Ether Spot ETF",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-spot-etf-blackrock/",
    "description": "BlackRock has joined the Ethereum Spot ETF race as the asset management company has officially applied to the US SEC and is currently waiting for approval.  BlackRock Files For An Ethereum Spot ETF Following its Spot Bitcoin ETF filing, BlackRock, an American investment company has taken the proactive step by filing an Ethereum Spot Exchange Traded Fund (ETF) with the United States Securities and Exchange Commission (SEC).  The asset management company submitted the application on November 15, however, BlackRock has stated it formed the Trust as early as November 9.  Related Reading: Dogecoin On The Brink: Factors That Indicate A DOGE Rally Is Just Starting According to BlackRock, the iShares Ethereum Trust would be used to facilitate the ownership of Ether through the issuance of shares, allowing investors to own a fractional undivided beneficial interest in the net assets of the Trust. “The Trust was formed as a Delaware statutory trust on November 9, 2023. The purpose of the Trust is to own ether transferred to the Trust in exchange for Shares issued by the Trust. Each Share represents a fractional undivided beneficial interest in the net assets of the Trust. The assets of the Trust consist primarily of ether held by the Ether Custodian on behalf of the Trust,” BlackRock said in its filing.  Presently, the US SEC has not approved any Ethereum Spot ETF filing as well as Spot Bitcoin ETF applications. The regulatory body has delayed multiple applications to be reviewed from January 2024.  The crypto community has remained enthusiastic that the regulatory agency would eventually approve the pending ETF applications, as this could significantly push the growth and development of the crypto ecosystem as well as the cryptocurrencies involved.  Ethereum Price Surges The price of Ethereum is on the rise following BlackRock’s Ethereum ETF filing. The cryptocurrency’s price climbed almost 2% moving to $2,080 at some point following the announcement of the filing. The sharp reaction has caused a stir in the cryptocurrency community, as investors gear up for a potential bull run if the US SEC gives its official authorization of Ethereum Spot ETFs.  Related Reading: Over 100 Million MATIC Incinerated In POLS Mint, But The Gold Rush Is Far From Over The price of Bitcoin has also been growing steadily as new companies apply for Spot Bitcoin ETFs. Currently, Bitcoin’s price is trading at $36,408, while ETH is down from its initial surge and trading at $1,952. The crypto ecosystem is presently watching closely for more updates on the US SEC’s ETF filing approvals and the price changes that follow them. ETH price falls to $1,945 &#124; Source: ETHUSD on Tradingview.com Featured image from Bitcoin News, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-17T19:45:38.000Z",
    "title": "US Feds Arrest Three Men for Allegedly Duping Banks out of $10,000,000 and Funneling Cash to Crypto Exchanges",
    "url": "https://dailyhodl.com/2023/11/17/us-feds-arrest-three-men-for-allegedly-duping-banks-out-of-10000000-and-funneling-cash-to-crypto-exchanges/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/us-feds-three-men.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/us-feds-three-men.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/us-feds-three-men.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/us-feds-three-men.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/us-feds-three-men.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/us-feds-three-men.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/us-feds-three-men.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Federal law enforcement authorities have arrested three men accused of scamming millions from US banks and financial institutions and then moving the stolen money into foreign cryptocurrency exchanges. The U.S. Department of Justice (DOJ) says Zhong Shi Gao, Naifeng Xu and Fei Jiang recruited individuals, often foreign nationals from China and Taiwan temporarily living in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/17/us-feds-arrest-three-men-for-allegedly-duping-banks-out-of-10000000-and-funneling-cash-to-crypto-exchanges/\">US Feds Arrest Three Men for Allegedly Duping Banks out of $10,000,000 and Funneling Cash to Crypto Exchanges</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]