[
  {
    "source": "CryptoGlobe",
    "date": "2024-01-13T18:01:55.000Z",
    "title": "Bill Miller IV Explains Why MicroStrategy (NASDAQ: MSTR) Is a Better Way To Invest in BTC Than a Spot Bitcoin ETF",
    "url": "https://www.cryptoglobe.com/latest/2024/01/bill-miller-iv-explains-why-microstrategy-nasdaq-mstr-is-a-better-way-to-invest-in-btc-than-a-spot-bitcoin-etf/",
    "description": "Bill Miller IV, the Chief Investment Officer of Miller Value Partners, appeared on CNBC’s “Closing Bell” on 12 January 2024 to discuss the newly launched US-listed spot Bitcoin ETFs and their implications for the cryptocurrency market. Miller Value Partners is an investment management firm known for its value-oriented investment approach. Founded by Bill Miller, a […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-13T17:53:28.000Z",
    "title": "Set to Outperform Apex Rise: Analysts Highlight This Coin for Superior ROI",
    "url": "https://cryptodaily.co.uk/2024/01/set-to-outperform-apex-rise-analysts-highlight-this-coin-for-superior-roi",
    "description": "Discover why ApeX Protocol (APEX) is making waves in the crypto market with a 430% gain, thanks to smart contract integration and innovative features. Get insights into ApeX Pro's offerings and the potential for continued growth in APEX value."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-13T18:09:16.000Z",
    "title": "Verity One Tackles Luxury Watch Authentication Challenges with AI and Blockchain",
    "url": "https://www.cryptopolitan.com/verity-one-tackles-watch-authentication/",
    "description": "Verity One TRUTH MATTERS™, a pioneer in the certification and verification business since 2001, is stepping up to address the growing concerns in the luxury watch industry. With the rise of counterfeit luxury watches and theft, Verity One introduces its innovative VRTY token, harnessing the power of AI and blockchain technologies, including Binance BSC, Polygon [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-13T18:02:43.000Z",
    "title": "India bans foreign cryptocurrency exchanges, tightening regulations",
    "url": "https://www.cryptopolitan.com/india-bans-foreign-cryptocurrency-exchanges/",
    "description": "In a significant move, India has implemented strict measures to ban foreign cryptocurrency exchanges from operating within its borders, citing concerns related to money laundering and non-compliance with anti-money laundering laws.&#160; The ban, which took effect on January 12, 2024, involves blocking access to the websites of several prominent global crypto platforms, including Binance, KuCoin, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-13T17:59:34.000Z",
    "title": "Swifties Bewitched by AI-Generated Taylor Swift in Cookware Scam",
    "url": "https://www.cryptopolitan.com/ai-generated-taylor-swift-in-cookware-scam/",
    "description": "In recent events, fans of Taylor Swift, popularly known as Swifties, found themselves ensnared in a deceptive Ponzi scheme. The scam involved a deepfake video featuring an AI-generated Taylor Swift, falsely promoting a Le Creuset cookware giveaway. The Allure of a Deepfake Celebrity Endorsement The deepfake video, astoundingly realistic, displayed an AI model resembling Swift [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-13T17:52:38.000Z",
    "title": "The crypto market sees widespread decline as Bitcoin plummets",
    "url": "https://www.cryptopolitan.com/market-sees-widespread-decline-as-bitcoin/",
    "description": "A recent update from CryptoRank, a prominent crypto research and analytics platform, revealed that the cryptocurrency market is currently facing a significant downturn. As of today, January 13, 2024, all of the top 10 cryptocurrencies by market capitalization are trading in the red zone. This downward trend follows a sharp drop in Bitcoin&#8217;s price, which [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-13T17:50:09.000Z",
    "title": "Unveiling the Practical Power of AI: Solving Real-World Challenges",
    "url": "https://www.cryptopolitan.com/unveiling-the-practical-power-of-ai/",
    "description": "In the fast-evolving landscape of artificial intelligence (AI), a seasoned data scientist turned investor emphasizes the pivotal role of AI in addressing practical, everyday challenges. While debates persist regarding the grand promises of generative AI, the focus here is on how AI can bring immediate solutions to real-world problems, making a tangible impact on various [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-13T17:48:42.000Z",
    "title": "Hedera Council allocates billions in HBAR to grow network",
    "url": "https://crypto.news/hedera-council-allocates-billions-hbar-to-grow-network/",
    "description": "In a significant move to bolster the development of its network, the Hedera Council is allocating an additional 4.86 billion in its native HBAR token."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-13T18:00:58.000Z",
    "title": "Here Are The Reasons Bitcoin Price Could Drop To $37,000 Before The Halving",
    "url": "https://www.newsbtc.com/news/here-are-the-reasons-bitcoin-price-could-drop-to-37000-before-the-halving/",
    "description": "The price of Bitcoin has been on a massive bullish momentum since the approval and launch of Spot Bitcoin ETFs. However, a crypto analyst, Jason Pizzino, predicts a temporary halt in the growing trajectory, citing Bitcoin’s proximity to a crucial resistance point that could result in a significant price drop.  Related Reading: Bitcoin Retreats: ETF Dream Fades, Price Tumbles Under $42,000 Analyst Foresees Bitcoin Price Correction In a recent YouTube video published on Friday, January 12, Pizzino shared his insights into the current market conditions of Bitcoin, the world’s largest cryptocurrency. According to the analyst, the price of the top crypto is expected to drop by 20% to 22%, reaching possible support levels of $37,000 to $39,000 before the Bitcoin halving.  The halving which is expected to take place in April 2024 is an event that would see Bitcoin mining rewards cut by half to reduce the number of new coins entering the market. This reduction effectively decreases the cryptocurrency’s total supply and supposedly increases its value through scarcity.  Pizzino substantiated his predictions by pointing out that BTC is currently trading at a key resistance level in the bull market that could result in a significant price correction. He acknowledged that the excitement surrounding Spot Bitcoin ETFs has successfully pushed the cryptocurrency to its recent highs. However, the crypto analyst also highlighted a possibility of complacency following the present hype which could lead to a major price correction.  Bitcoin slides back into the $42K territory. Chart: TradingView.com While the crypto has experienced an impressive uptrend in recent months, Pizzino emphasized the significance of understanding historical price patterns and market behaviors. He stressed the importance of being prepared for any potential correction or retracement in the price of Bitcoin.  BTC Plunges Below $42,000 Following the official approval of Spot Bitcoin ETFs by the United States Securities and Exchange Commission (SEC), the price of Bitcoin has been skyrocketing. The cryptocurrency surged to $49,000 on Thursday, January 11, after Spot Bitcoin ETFs had launched and investors had started trading officially.  Related Reading: Lido (LDO) Action Heats Up: Nearly 90% Of Holders See Profits On Crypto Climb However, Bitcoin&#8217;s price experienced a massive downturn recently after news of Vanguard restricting its customers from trading Spot Bitcoin ETFs on its platform spread. As a result, the cryptocurrency experienced a price drop below $42,000, falling more than $7000 short of its 2024 peak of $49,000.  Presently, the coin has recouped some of its lost gains and at the time of writing it’s current trading price is at $43,158.52 according to CoinMarketCap. While the dip is perceived as a temporary setback for the crypto market, it is also regarded as an opportunity to enter the market at more affordable price levels.  Featured image from Shutterstock"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-13T18:01:00.000Z",
    "title": "BlackRock Bitcoin ETF Sees $111M Inflow, Rest of $1B Arrives Tonight",
    "url": "https://coinedition.com/blackrock-bitcoin-etf-sees-111m-inflow-rest-of-1b-arrives-tonight/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Bitcoin-BTC-Is-on-the-Verge-of-a-Bullish-Breakout-Says-Analyst.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BlackRock&#039;s Bitcoin ETF sees an initial $111M surge, with the rest of the $1 billion inflow to be revealed tonight, recording a 0.16% premium. \" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Bitcoin-BTC-Is-on-the-Verge-of-a-Bullish-Breakout-Says-Analyst.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Bitcoin-BTC-Is-on-the-Verge-of-a-Bullish-Breakout-Says-Analyst-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Bitcoin-BTC-Is-on-the-Verge-of-a-Bullish-Breakout-Says-Analyst-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Bitcoin-BTC-Is-on-the-Verge-of-a-Bullish-Breakout-Says-Analyst-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Bitcoin-BTC-Is-on-the-Verge-of-a-Bullish-Breakout-Says-Analyst-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Bitcoin-BTC-Is-on-the-Verge-of-a-Bullish-Breakout-Says-Analyst-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>BlackRock&#8217;s Bitcoin ETF starts with a $111 million inflow, with the remaining $889 million expected tonight. BlackRock&#8217;s ETF sees a premium of 16bps, while Fidelity recorded a negative value. New Bitcoin ETFs eye a combined $650 million inflow, but several ETFs have not posted their numbers. The inflow for iShares Bitcoin Trust (IBIT), specifically BlackRock’s [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/blackrock-bitcoin-etf-sees-111m-inflow-rest-of-1b-arrives-tonight/\">BlackRock Bitcoin ETF Sees $111M Inflow, Rest of $1B Arrives Tonight</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-13T18:04:32.000Z",
    "title": "World’s Ninth-Largest Bank Paying $658,000,000 Settlement After Failing To Reveal Risk of Mortgages",
    "url": "https://dailyhodl.com/2024/01/13/worlds-ninth-largest-bank-paying-658000000-settlement-after-failing-to-reveal-risk-of-mortgages/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/bank-ex-settlement.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/bank-ex-settlement.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/bank-ex-settlement.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/bank-ex-settlement.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/bank-ex-settlement.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/bank-ex-settlement.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/bank-ex-settlement.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>French banking giant BNP Paribas has reached a $658 million settlement with regulators to compensate customers who were not properly informed about risky mortgages. The loans in question were taken out in 2008 and 2009 in Swiss francs, which, especially during times of uncertainty, are often viewed as a safe haven currency. However, since the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/13/worlds-ninth-largest-bank-paying-658000000-settlement-after-failing-to-reveal-risk-of-mortgages/\">World’s Ninth-Largest Bank Paying $658,000,000 Settlement After Failing To Reveal Risk of Mortgages</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-13T17:55:29.000Z",
    "title": "More US Senators Demand Answers From the SEC After Tuesday’s Bitcoin ETF-Related Social Media Hack",
    "url": "https://dailyhodl.com/2024/01/13/more-us-senators-demand-answers-from-the-sec-after-tuesdays-bitcoin-etf-related-social-media-hack/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/more-us-answers-after.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/more-us-answers-after.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/more-us-answers-after.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/more-us-answers-after.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/more-us-answers-after.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/more-us-answers-after.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/more-us-answers-after.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>More US senators are demanding answers from the U.S. Securities and Exchange Commission (SEC) regarding Tuesday’s high-profile social media fiasco related to the approval of Bitcoin (BTC) exchange-traded funds (ETF). Senators Ron Wyden (D-Oregon) and Cynthia Lummis (R-Wyoming) wrote to the inspector general of the SEC on Friday requesting an investigation into the hack on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/13/more-us-senators-demand-answers-from-the-sec-after-tuesdays-bitcoin-etf-related-social-media-hack/\">More US Senators Demand Answers From the SEC After Tuesday’s Bitcoin ETF-Related Social Media Hack</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]