[
  {
    "source": "Decrypt",
    "date": "2023-11-27T17:50:17.000Z",
    "title": "CEO Richard Teng Says He's Committed to 'the Binance Way' After CZ's Guilty Plea",
    "url": "https://decrypt.co/207583/ceo-richard-teng-says-committed-binance-way-after-czs-guilty-plea",
    "description": "After the leading exchange and founder Changpeng Zhao settled U.S. charges, Binance’s new CEO says the firm has “turned the page.”"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-27T17:49:05.000Z",
    "title": "The ‘WAGMI’ mentality is undermining crypto",
    "url": "http://cointelegraph.com/news/wagmi-mentality-undermining-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/793bbd30-e58c-4ba8-8be2-48cb69ce1a54.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Greed, irrationality and anxiety have contributed to chaos in the crypto market. Investors should work on self-improvement if they want the industry to succeed. </p>\n                    <p><p>In 2021, it seemed as if 10 new Disneys — and the next 20 Picassos — were emerging from blockchain and various <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a> collections.</p><p>Exorbitant NFT values that year signaled strong belief in many projects. But two years later, those “next Disneys” have delivered little. The situation has created significant market frustration and disillusionment among investors and enthusiasts alike.</p><p>Project failures are often attributed to founders. Yet, the greed, anxiety, and irrationality prevalent among Web3 participants have also played a substantial role in the ecosystem.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/3-theses-will-impact-ethereum-bitcoin-next-bull-market\"><strong><em>3 theses that will drive Ethereum and Bitcoin in the next bull market</em></strong></a></p><p>We’re in a complex environment where even the most skilled and visionary founders find it challenging to navigate the market dynamics. This often leaves a trail of unfinished projects and unfulfilled promises, further eroding trust in the sector.</p><h2>The detrimental impact of greed</h2><p>Imagine a party with tickets priced at $100. Someone eager to attend with friends misses the initial sale. Turning to the secondary market, they pay $500 for a ticket.</p><p>The likelihood of disappointment is high since the event intended to offer a $100 experience. With a $500 ticket, expectations are inevitably higher, which often means the experience doesn't match reality.</p><p>In the crypto market, this greed-induced frustration is apparent. You can pay 20 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) for an NFT that initially sold for 0.5 ETH, but it is essential to align your expectations with the 0.5 ETH value. (That’s especially true considering how Web3 royalties have declined, a situation that has also prevented founders from obtaining the benefits of high-value secondary sales.)</p><p>Place your mental emphasis on the first price you see for an item — instead of taking the full context into account — is known as anchoring bias, where initial information heavily influences later decisions and perceptions. That means buyers view the <a href=\"https://cointelegraph.com/news/cryptopunk-sells-for-2-6m-as-big-nft-brand-floor-prices-increase\">high price of NFTs they purchase</a> as an \"anchor\" for their expectations regarding utility leading to a cycle of disappointment.</p><h2>Anxiety also creates a problem</h2><p>Developing a quality product takes time. But the market often expects unrealistically quick progress.</p><p>That expectation puts immense pressure on builders and founders, who find themselves in a cycle of continual announcements to satisfy the community's desire for constant stimulation and progress.</p><p>In the last cycle, big gaming projects offered one example of this phenomenon. Some individuals believed that ambitious Triple-A games — built on Unreal Engine 5 — would be delivered in mere months, even though they typically require three to five years of development.</p><p>They dumped their tokens when they realized it would take longer, because one year feels like 10 when you're addicted to volatility.</p><p>In some cases, opening the process of building to the public is a blessing that Web3 has made possible. However, it can also create a toxic climate that negatively affects the mindset and well-being of project founders.</p><h2>The role of irrationality</h2><p>Studies have <a href=\"https://corpgov.law.harvard.edu/2023/09/29/startup-failure/\" target=\"_blank\" rel=\"noopener nofollow\">indicated</a> that roughly 75% of venture-backed startups fail.</p><p>Like startups, NFT collections operate in risky, experimental environments. Yet, the market often overlooks the risk, instead expecting indefinite success and growth.</p><p>This is highly driven by confirmation bias, a psychological phenomenon that involves putting an emphasis on information that aligns with a person’s existing beliefs and preferences while ignoring contradictory evidence.</p><p>During the previous bull run, this was epitomized by \"WAGMI,” an acronym for “We’re all going to make it.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/323a08e9-1819-4439-a08f-85d649886d2f.jpg\"  /></figure><p>But in a market driven by buying and selling, some participants must lose in order for others to win.</p><p>That unfortunately means there is no WAGMI — especially in an environment with low financial literacy and a lot of anxiety. This combination can be particularly dangerous as it leads to decisions driven more by emotion than rational analysis.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/history-tells-us-strong-bull-market-hard-landing\"><strong><em>History tells us we’re in for a strong bull market with a hard landing</em></strong></a></p><p>On the bright side, the ecosystem has evolved a lot since 2021. The good projects that managed to adapt to market changes and the market context are becoming more evident, and there has also been significant human maturation.</p><p>Many founders became “CEOs” overnight, which is analogous to changing a car's tires while it's moving at 100 miles per hour — 24 hours per day, seven days per week. After almost three years and some pivots, many of these CEOs and teams are much more mature, prepared, and focused on delivering something of value.</p><p>And while success depends largely on them, it also depends on the maturity of the Web3 community. Good leaders will not be enough to fix the game if it’s broken by excessive greed, anxiety and irrationality. Investors should consider this — and try to improve, financially and personally — as we enter the next bull run.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Lugui Tillier</strong> is the chief commercial officer of Lumx Studios, a Web3 studio in Rio de Janeiro that counts BTG Pactual Bank, the largest investment bank in Latin America, among its investors.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-27T17:50:30.000Z",
    "title": "November Sparks Step App (FITFI), STEPN (GMT) and Sweat Economy (SWEAT) – Who Will Spearhead the Move-to-Earn Christmas Rally?",
    "url": "https://cryptodaily.co.uk/2023/11/november-sparks-step-app-fitfi-stepn-gmt-and-sweat-economy-sweat-who-will-spearhead-the-move-to-earn-christmas-rally",
    "description": "Dive into the dynamic world of the move-to-earn sector as we examine the November surge in the crypto market and its impact on Step App (FITFI), STEPN (GMT), and Sweat Economy (SWEAT). Our in-depth analysis unpacks their recent performance, highlighting how each contender is gearing up for the potential Christmas rally. With a blend of technical insights and market trends, our review offers a nuanced perspective on who might lead this festive season's race in the M2E landscape. Stay informed and navigate the complexities of this exciting and evolving sector with our expert analysis, guiding you through potential ups and downs in this vibrant crypto environment."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-27T17:50:24.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: ARB breaks key barrier",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the blockchain world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain‘s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: ARB breaks key barrier\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: ARB breaks key barrier\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-27T18:00:41.000Z",
    "title": "Circle And SBI Holdings Partnership To Boost USDC In Japan",
    "url": "https://www.newsbtc.com/stablecoin/circle-and-sbi-holdings-partnership-to-boost-usdc-in-japan/",
    "description": "Global financial firm Circle has announced a strategic partnership with the Japanese financial services SBI Holdings, Inc., to promote the adoption of Circle&#8217;s USDC stablecoin and web3 services in Japan. Circle Joins SBI Holdings In A Memorandum Of Understanding According to the announcement, both parties have signed a Memorandum of Understanding (MOU) toward promoting UDSC&#8216;s adoption in the country. Due to this, both parties are also committed to accurately abiding by stablecoin-related regulations and communication with authorities. The announcement read: The companies have signed an MOU underpinning the work ahead, which includes SBI Group and Circle initially working towards the circulation of USDC and expanding the use of stablecoins in Japan. SBI Group and Circle have also committed to properly complying with stablecoin-related regulations, including communication with authorities. Circle&#8217;s partnership with SBI Holdings comes amid the Japanese government&#8217;s goal of encouraging the expansion of the Web3 business and enacting new stablecoin rules. In June, Japan&#8217;s updated Payment Services Act was published, emphasizing stablecoin regulation.  Related Reading: USDC Expands to 6 Chains, Boosted by Coinbase; Crypto Project With Impressive AI Technology Poised for Recognition The Revised Payment Service Act focuses on stablecoin issuance and circulation in Japan as it moves toward a Web3 economy. As a global leader in the digital asset economy, the Japanese government revised the Payment Services Act (the Revised Payment Services Act), on June 3, 2023, to establish regulations for stablecoins. The regulation is expected to stimulate the issuance and circulation of stablecoins in Japan and advance Japan’s transition towards a Web3 economy. Furthermore, it creates &#8220;collateralized&#8221; stablecoins that are backed by legal tender. This way, Circle&#8217;s USDC goes a step further because it is backed 100% by highly liquid cash and cash-equivalent assets and is always convertible 1 to 1 for US dollars. The announcement also highlighted a banking relationship between Circle and SBI Shinsei Bank. This is because the SBI Shinsei bank will provide banking services to the firm. As a result of this, USDC and liquidity become accessible for users and businesses in Japan. Furthermore, SBI Group will embrace Circle&#8217;s Web3 Services solutions into its digital asset portfolio strategy. These include Programmable Wallet, smart contract management tools, and blockchain infrastructure. The Company&#8217;s CEO On The Partnership Circle&#8217;s Chief Executive Officer (CEO) Jeremy Allaire has expressed his pleasure in the recent collaboration with SBI Holdings. The CEO has taken to X (formerly Twitter) to share his optimism on the partnership. Related Reading: Base Network Gears Up For USDC Integration, Circle CEO Jeremy Allaire Confirms According to him, the partnership exhibits a shared vision for digital currency&#8217;s future. The partnership also marks a significant milestone for Circle, as it plans to expand in Japan and Asia Pacific. Allaire stated: Our partnership with SBI Holdings represents a shared vision for the future of digital currency and is a significant milestone in Circle’s expansion plans in Japan and the Asia Pacific. We are excited to collaborate with SBI towards setting new standards in the financial sector in Japan. So far, SBI Holdings is requesting registration as an electronic payment instruments service, as this is subject to approval by the authorities. Featured image from Binance, chart by Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-27T17:55:22.000Z",
    "title": "About $1,000,000,000 in Bitcoin Yanked From Exchanges in Two Weeks As Whales Accumulate Ethereum and XRP: Trader",
    "url": "https://dailyhodl.com/2023/11/27/about-1000000000-in-bitcoin-yanked-from-exchanges-in-two-weeks-as-whales-accumulate-ethereum-and-xrp-trader/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/bitcoin-whale-transactions-spike.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/bitcoin-whale-transactions-spike.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/bitcoin-whale-transactions-spike.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/bitcoin-whale-transactions-spike.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/bitcoin-whale-transactions-spike.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/bitcoin-whale-transactions-spike.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/bitcoin-whale-transactions-spike.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto analyst says that close to $1 billion worth of Bitcoin (BTC) has been pulled from crypto exchanges in recent weeks as deep-pocketed investors simultaneously stockpile Ethereum (ETH) and XRP. Crypto analyst Ali Martinez says on the social media platform X that market participants have been yanking large amounts of BTC from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/27/about-1000000000-in-bitcoin-yanked-from-exchanges-in-two-weeks-as-whales-accumulate-ethereum-and-xrp-trader/\">About $1,000,000,000 in Bitcoin Yanked From Exchanges in Two Weeks As Whales Accumulate Ethereum and XRP: Trader</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]