[
  {
    "source": "CoinDesk",
    "date": "2023-07-11T21:18:12.000Z",
    "title": "Ether Staking Ratio Nears Key Milestone as Inflows Slow Amid Regulatory Pressures",
    "url": "https://www.coindesk.com/markets/2023/07/11/ether-staking-ratio-nears-key-milestone-as-inflows-slow-amid-regulatory-pressures/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Investors committed nearly 20% of all ETH tokens to lock up in staking contracts, according to blockchain data."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-11T21:21:05.000Z",
    "title": "Bitcoin Has Formed a 'Firm Foundation' Under $30000: Glassnode",
    "url": "https://decrypt.co/148181/bitcoin-price-30000-firm-foundation-glassnode",
    "description": "History suggests that Bitcoin may be due for many months of sideways trading, the firm said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-11T21:33:16.000Z",
    "title": "Experiments show AI could help to audit smart contracts, but not yet",
    "url": "https://cointelegraph.com/news/ai-could-help-audit-smart-contracts-but-not-yet",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/86095b56-6e1d-4610-8f58-d237a83c6c0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Artificial intelligence has proven effective at identifying security vulnerabilities, but early tests indicate it won’t be able to replace humans for a while.</p>\n                    <p><p>While artificial intelligence (AI) has already transformed a myriad of industries, from healthcare and automotive to marketing and finance, its potential is now being put to the test in one of the blockchain industry’s most crucial areas — smart contract security.</p><p>Numerous tests have shown great potential for AI-based blockchain audits, but this nascent tech still lacks some important qualities inherent to human professionals — intuition, nuanced judgment and subject expertise.</p><p>My own organization, OpenZeppelin, recently conducted a series of experiments highlighting the value of AI in detecting vulnerabilities. This was done using OpenAI’s latest GPT-4 model to identify security issues in Solidity smart contracts. The code being tested comes from the <a href=\"https://ethernaut.openzeppelin.com/\" target=\"_blank\" rel=\"noopener nofollow\">Ethernaut</a> smart contract hacking web game — designed to help auditors learn how to look for exploits. During the experiments, GPT-4 successfully identified vulnerabilities in 20 out of 28 challenges.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/reddit-closed-api-costs-more-than-you-expect\"><strong><em>Buckle up, Reddit: Closed APIs cost more than you’d expect</em></strong></a></p><p>In some cases, simply providing the code and asking if the contract contained a vulnerability would produce accurate results, such as with the following naming issue with the constructor function:</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/54b2cce3-c82a-445c-a4bc-008c1cb3a232.jpg\"  /><figcaption style=\"text-align: center;\"><em>ChatGPT analyzes a smart contract. Source: OpenZeppelin</em></figcaption></figure><p>At other times, the results were more mixed or outright poor. Sometimes the AI would need to be prompted with the correct response by providing a somewhat leading question, such as, “Can you change the library address in the previous contract?” At its worst, GPT-4 would fail to come up with a vulnerability, even when things were pretty clearly spelled out, as in, “Gate one and Gate two can be passed if you call the function from inside a constructor, how can you enter the GatekeeperTwo smart contract now?” At one point, the AI even invented a vulnerability that wasn’t actually present. </p><p>This highlights the current limitations of this technology. Still, GPT-4 has made notable strides over its predecessor, GPT-3.5, the large language model (LLM) utilized within OpenAI’s initial launch of ChatGPT. In December 2022, experiments with ChatGPT showed that the model could only successfully solve five out of 26 levels. Both GPT-4 and GPT-3.5 were trained on data up until September 2021 using reinforcement learning from human feedback, a technique that involves a human feedback loop to enhance a language model during training.</p><p>Coinbase <a href=\"https://www.coinbase.com/blog/token-security-with-chatgpt\" target=\"_blank\" rel=\"noopener nofollow\">carried out</a> similar experiments, yielding a comparative result. This experiment leveraged ChatGPT to review token security. While the AI was able to mirror manual reviews for a big chunk of smart contracts, it had a hard time providing results for others. Additionally, Coinbase also cited a few instances of ChatGPT labeling high-risk assets as low-risk ones.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blackrock-etf-isnt-bullish-for-bitcoin\"><strong><em>Don’t be naive — BlackRock’s ETF won’t be bullish for Bitcoin</em></strong></a></p><p>It’s important to note that ChatGPT and GPT-4 are LLMs developed for natural language processing, human-like conversations and text generation rather than vulnerability detection. With enough examples of smart contract vulnerabilities, it’s possible for an LLM to acquire the knowledge and patterns necessary to recognize vulnerabilities. </p><p>If we want more targeted and reliable solutions for vulnerability detection, however, a machine learning model trained exclusively on high-quality vulnerability data sets would most likely produce superior results. Training data and models customized for specific objectives lead to faster improvements and more accurate results.</p><p>For example, the AI team at OpenZeppelin recently built a custom machine learning model to detect reentrancy attacks — a common form of exploit that can occur when smart contracts make external calls to other contracts. Early evaluation results show superior performance compared to industry-leading security tools, with a false positive rate below 1%.</p><h2>Striking a balance of AI and human expertise</h2><p>Experiments so far show that while current AI models can be a helpful tool to identify security vulnerabilities, it is unlikely to replace the human security professionals’ nuanced judgment and subject expertise. GPT-4 mainly draws on publicly available data up until 2021 and thus cannot identify complex or unique vulnerabilities beyond the scope of its training data. Given the rapid evolution of blockchain, it’s critical for developers to continue learning about the latest advancements and potential vulnerabilities within the industry. </p><p>Looking ahead, the future of smart contract security will likely involve collaboration between human expertise and constantly improving AI tools. The most effective defense against AI-armed cybercriminals will be using AI to identify the most common and well-known vulnerabilities while human experts keep up with the latest advances and update AI solutions accordingly. Beyond the cybersecurity realm, the combined efforts of AI and blockchain will have many more positive and groundbreaking solutions.</p><p>AI alone won’t replace humans. However, human auditors who learn to leverage AI tools will be much more effective than auditors turning a blind eye to this emerging technology. </p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Mariko Wakabayashi</strong> is the machine learning lead at OpenZeppelin. She is responsible for applied AI/ML and data initiatives at OpenZeppelin and the Forta Network. Mariko created Forta Network’'s public API and led data-sharing and open-source projects. Her AI system at Forta has detected over $300 million in blockchain hacks in real time before they occurred.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-11T21:28:06.000Z",
    "title": "Grayscale resolves lawsuit with Fir Tree over proposed changes to Bitcoin Trust",
    "url": "https://cointelegraph.com/news/grayscale-resolves-lawsuit-fir-tree-bitcoin-trust",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/2d00c58a-d608-4ffe-a285-4fb17800c0e9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Fir Tree hinted at potential additional litigation against Grayscale and parent company Digital Currency Group based on what its GBTC documentation may reveal.</p>\n                    <p><p>Grayscale Investments has reached an agreement with New York-based investment firm Fir Tree Capital Management over its Bitcoin Trust.</p><p>According to a July 11 announcement from Fir Tree, Grayscale <a href=\"https://www.businesswire.com/news/home/20230711838819/en/Fir-Tree-Provides-Update-on-GBTC-Litigation-and-Comments-on-Grayscale%E2%80%99s-Continued-Refusal-to-Conduct-a-Tender-Offer\" target=\"_blank\" rel=\"noopener nofollow\">agreed</a> to provide additional documentation related to its Bitcoin Trust (GBTC) after the firm filed a lawsuit in December 2022. The complaint against Grayscale <a href=\"https://cointelegraph.com/news/fir-tree-fund-sues-grayscale-in-effort-to-force-changes-to-bitcoin-trust\">aimed at having the asset manager</a> stop plans to turn its GBTC a spot exchange-traded fund and provide documentation on its relationship with Digital Currency Group, its parent company.</p><p>Fir Tree claimed that roughly 850,000 retail investors had been “harmed by Grayscale’s shareholder-unfriendly actions” based on the firm’s lack of a redemption program from GBTC into cash or crypto. In addition, its legal team said Grayscale attempting to launch a spot crypto ETF could “cost years of litigation, millions of dollars in legal fees, countless hours of lost management time, and goodwill with regulators”.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/grayscale-bitcoin-trust-2023-high-blackrock-etf-filing-buyers\"><strong><em>Grayscale Bitcoin Trust nears 2023 highs on BlackRock ETF filing as buyers step up</em></strong></a></p><p>“Once Grayscale provides Fir Tree with the GBTC documents that it has agreed to produce under this agreement, we will be able to further investigate Grayscale in order to determine our appropriate next steps, which may include filing additional litigation against Grayscale, Digital Currency Group (DCG), and their respective directors, officers, and advisors, or others who should be held accountable for destroying billions of dollars of GBTC’s market value,” said Fir Tree.</p><p>Grayscale <a href=\"https://cointelegraph.com/news/grayscale-lawyers-sec-approval-volatility-shares-etf-lawsuit\">filed a legal challenge</a> against the United States Securities and Exchange Commission (SEC) in June 2022 after the regulator denied an application to convert its Bitcoin Trust into a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ETF. The lawsuit is ongoing, with the SEC having not approved any spot crypto investment vehicle despite applications pending from BlackRock and other investment firms.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/money-back-crypto-litigation/\"><strong><em>Get your money back: The weird world of crypto litigation</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-11T21:10:47.000Z",
    "title": "Brazilian CBDC pilot source code includes methods to freeze, drain wallets",
    "url": "https://cryptoslate.com/brazilian-cbdc-pilot-source-code-includes-methods-to-freeze-drain-wallets/",
    "description": "<p>Banco Central do Brasil published the source code for its CBDC on GitHub last week and allowed the public to conduct an audit of the system&#8217;s code. Developers soon found concerning functionality in the source code of Brazil&#8217;s CBDC pilot, including mechanisms to control individual wallets and the funds they hold. Concerning functions Developers quickly [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/brazilian-cbdc-pilot-source-code-includes-methods-to-freeze-drain-wallets/\">Brazilian CBDC pilot source code includes methods to freeze, drain wallets</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-11T21:30:01.000Z",
    "title": "UK Regulator Continues Crackdown on Crypto ATMs, Checks 18 New Sites",
    "url": "https://news.bitcoin.com/uk-regulator-continues-crackdown-on-crypto-atms-checks-18-new-sites/",
    "description": "<img width=\"768\" height=\"433\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2217305145-768x433.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"UK Regulator Continues Crackdown on Crypto ATMs, Checks 18 New Sites\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2217305145-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2217305145-1024x577.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2217305145-768x433.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2217305145-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2217305145-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2217305145-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2217305145.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.K.’s Financial Conduct Authority (FCA) is proceeding with efforts to shut down all bitcoin ATMs “illegally operating” in the country. After more inspections in the past couple of months, the watchdog vowed to continue to take action against operators of unregistered crypto teller machines. Financial Watchdog Shuts Down Dozens of Crypto ATMs in the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T21:38:44.000Z",
    "title": "Fei Labs denies discord seizure amid class-action lawsuit",
    "url": "https://www.cryptopolitan.com/fei-labs-discord-seizure-amid-class-action/",
    "description": "In recent developments surrounding the ongoing class action lawsuit against DeFi project Fei Labs, new information has emerged regarding the widely reported seizure of the platform’s Discord server. Contrary to previous reports, it has now been clarified that the notice posted on the server was not a result of authorities seizing control. Instead, the purpose ... <a title=\"Fei Labs denies discord seizure amid class-action lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fei-labs-discord-seizure-amid-class-action/\" aria-label=\"More on Fei Labs denies discord seizure amid class-action lawsuit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T21:16:38.000Z",
    "title": "Netflix introduces AI-powered green screen for realistic visual effects",
    "url": "https://www.cryptopolitan.com/netflix-introduces-ai-powered-green-effects/",
    "description": "Netflix, the renowned streaming giant, has unveiled an innovative advancement in the film and television industry that could potentially render traditional green screens obsolete. The Magenta Green Screen (MGS), powered by artificial intelligence (AI), offers real-time enhancements to visual effects, making them more precise and realistic. Netflix’s implementation of AI has already proven successful in ... <a title=\"Netflix introduces AI-powered green screen for realistic visual effects\" class=\"read-more\" href=\"https://www.cryptopolitan.com/netflix-introduces-ai-powered-green-effects/\" aria-label=\"More on Netflix introduces AI-powered green screen for realistic visual effects\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T21:13:18.000Z",
    "title": "U.S Department of Justice arrests security engineer in $9 Million crypto heist, charged with wire fraud and money laundering",
    "url": "https://www.cryptopolitan.com/u-s-department-of-justice-arrests-security-engineer-in-9-million-crypto-heist/",
    "description": "Shakeeb Ahmed, a security engineer, has been arrested by the U.S. Department of Justice (DOJ) on charges of wire fraud and money laundering. The arrest follows an investigation into Ahmed&#8217;s alleged theft of $9 million worth of cryptocurrency from an undisclosed decentralized cryptocurrency exchange (DEX). According to the DOJ, Ahmed exploited a vulnerability in the ... <a title=\"U.S Department of Justice arrests security engineer in $9 Million crypto heist, charged with wire fraud and money laundering\" class=\"read-more\" href=\"https://www.cryptopolitan.com/u-s-department-of-justice-arrests-security-engineer-in-9-million-crypto-heist/\" aria-label=\"More on U.S Department of Justice arrests security engineer in $9 Million crypto heist, charged with wire fraud and money laundering\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-11T21:30:57.000Z",
    "title": "Vitalik Buterin Moves $3.6 Million of ETH To OKX, Ethereum Price Dump Incoming?",
    "url": "https://www.newsbtc.com/all/vitalik-buterin-moves-3-6-million-of-eth-to-okx-ethereum-price-dump-incoming/",
    "description": "An address associated with the Ethereum co-founder, Vitalik Buterin, has moved 2,013 ETH to OKX, a cryptocurrency exchange, Lookonchain, citing Etherscan data, on July 11 shows. According to on-chain data, the stash is currently valued at over $3.76 million and has not transferred any funds to a cryptocurrency exchange for the first time. Vitalik Buterin Transfers The address has previously moved funds to Kraken, another cryptocurrency exchange. However, what&#8217;s evident is that the address, only identified as &#8220;0x9e92&#8221;, has been actively moving funds. Over the years, the address has received 22,300 ETH, approximately $41.6 million, from December 30, 2022, to May 18, 2023. Apart from today, the wallet only moved funds once 70 days ago when the whale transferred funds to Gemini. Related Reading: Bitcoin Hash Rate Retakes All-Time High As Miners Continue To Expand Capacity Whale and miner transfers to centralized cryptocurrency exchanges may be considered bearish. This is because users can readily convert crypto assets to fiat currencies like USD or stablecoins in these exchanges. As such, the more whales and miners transfer to centralized exchanges; the more retailers may choose to sell their coins, heaping more pressure on asset prices. Still, it has yet to be determined whether the address associated with Vitalik Buterin will sell. However, considering his past transfers, his deposit to OKX may not affect sentiment or adversely impact ETH prices.  Ethereum Prices Choppy The recent deposit to OKX coincides with choppy price action across the cryptocurrency markets. Notably, major cryptocurrencies, including Bitcoin, have been under pressure, with bears forcing prices lower over the past few months.  In recent months, the overall value of the cryptocurrency market has decreased since the previous period of growth. During that time, the price of Ethereum surged to over $4,800 before plummeting to current levels. Related Reading: Tron Co-Founder Unstakes $56 Million From Ethereum Via Lido, Will ETH Prices Fall? When writing on July 11, Ethereum prices were choppy and moving horizontally below the $1,900 and $2,000 resistance levels. Although traders are bullish, their confidence has not translated to strength since ETH prices are moving inside a bull flag with support at around $1,800, evident in the daily chart. Meanwhile, decentralized finance (DeFi) and non-fungible token (NFT) activities remain suppressed, impacting ETH demand. In Ethereum, ETH, the native currency, is used to pay for gas fees and others. Gas fees rise during heightened activity, which may lift ETH prices. In early May 2023, the Ethereum Foundation sold 15,000 ETH on Kraken, a cryptocurrency exchange. Their move coincided with a notable contraction of Ethereum prices in the first half of May. Therefore, whether the address associated with a potential Vitalik Buterin deposit to OKX might catalyze bears is yet to be seen. Feature Image from Canva, chart from TradingView"
  }
]