[
  {
    "source": "CoinDesk",
    "date": "2023-10-04T08:21:24.000Z",
    "title": "Sam Bankman-Fried Lost Half a Million Dollars Everyday After Alameda Launched, Michael Lewis Claims",
    "url": "https://www.coindesk.com/markets/2023/10/04/sam-bankman-fried-lost-half-a-million-dollars-everyday-after-alameda-launched-michael-lewis-claims/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The tides finally changed after Gary Wang and Nishad Singh (both FTX directors who have since pled guilty to fraud in the ongoing trial) joined the firm."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-04T08:20:00.000Z",
    "title": "Microsoft CEO Says AI Could Only Tighten Google's Stranglehold on Search",
    "url": "https://decrypt.co/200029/microsoft-ceo-satya-nadella-google-dominance-search-ai",
    "description": "Satya Nadella testified in an antitrust trial exploring whether Google's dominance is unlawful."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T08:17:00.000Z",
    "title": "What is the CryptoNight mining algorithm, and how does it work?",
    "url": "https://cointelegraph.com/explained/what-is-the-cryptonight-mining-algorithm-and-how-does-it-work",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/bb5ac7cb9c2b81527d685c30be1cb054.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchain technology relies on mining algorithms, such as CryptoNight, to regulate cryptocurrency projects. Find out here what CryptoNight is and how it works.</p>\n                    <p><div data-ct-widget=\"explained-block\" id=\"explained-block-117723-5\">            <h2 data-ct-widget=\"explained-block-title\">                Understanding mining algorithms            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Mining algorithms are the backbone of blockchain-based networks like Bitcoin and other protocols.&nbsp;</em></p><p>In <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-everything-there-is-to-know\">blockchain technology</a>, mining algorithms are necessary for transaction verification and network security. A <a href=\"https://cointelegraph.com/learn/what-are-the-different-ways-to-mine-cryptocurrency\\\">mining algorithm</a> instructs miners&rsquo; computers to follow a set of rules to generate a valid block.&nbsp;</p><p>Proof-of-work (PoW) is the well-known <a href=\"https://cointelegraph.com/learn/proof-of-stake-vs-proof-of-work:-differences-explained\">consensus algorithm</a> used by <a href=\"https://cointelegraph.com/learn/what-is-bitcoin-a-beginners-guide-to-the-worlds-first-cryptocurrency\">Bitcoin</a> and other <a href=\"https://cointelegraph.com/learn/what-is-a-cryptocurrency-a-beginners-guide-to-digital-money\">cryptocurrencies</a>. In PoW, miners compete using computational power to find a specific hash value that will give them the new block. <a href=\"https://cointelegraph.com/news/gpus-and-asics-a-never-ending-battle-for-mining-supremacy\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/gpus-and-asics-a-never-ending-battle-for-mining-supremacy/amp\">Application-specific integrated circuits (ASICs)</a> are the specialized hardware necessary for miners to be competitive in such an energy-intensive process, but before ASICs, lower-scale CPU and GPU mining equipment was utilized by users at home.</p><p>ASIC mining primarily uses the SHA-256 hash function, which was designed by the United States National Security Agency (NSA) and published in 2001 as a data integrity standard. Bitcoin uses SHA-256 to ensure maximum security and integrity, as the slightest change to the algorithm would alter the mining hash function output.</p><p>To keep up with industrial-scale mining operations, many miners join <a href=\"https://cointelegraph.com/news/what-is-a-cryptocurrency-mining-pool\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/what-is-a-cryptocurrency-mining-pool/amp\">mining pools</a> to combine their computational power, thereby increasing the chances of successfully mining a block. Block rewards are shared proportionally based on each member&rsquo;s contribution.</p><p>Choosing the mining algorithm is a crucial decision for a cryptocurrency project, as it determines the rules and requirements necessary to create and secure the blockchain network, other than how the participants are rewarded with newly minted coins. Examples of other popular mining algorithms include Ethash, <a href=\"https://cointelegraph.com/learn/what-is-ethereum-a-beginners-guide-to-eth-cryptocurrency\">used by the Ethereum blockchain</a>, and CryptoNight, used by the Monero Network.&nbsp;</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-117723-4\">            <h2 data-ct-widget=\"explained-block-title\">                What is the CryptoNight algorithm?            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>CryptoNight is one of the fastest mining algorithms and part of the CryptoNote consensus protocol.</em></p><p>CryptoNight is a PoW mining algorithm for <a href=\"https://cointelegraph.com/learn/what-are-the-different-ways-to-mine-cryptocurrency\">CPU and GPU mining</a>, designed to be ASIC-resistant to prevent the centralization of mining power. It hopes to help users mine more efficiently using a combination of hashing functions, including the CryptoNight and the Keccak hash functions.&nbsp;</p><p>Its cryptographic hash function works around the Advanced Encryption Standard (AES), a military-level algorithm for extreme security, making CryptoNight a mining algorithm highly focused on security. Since <a href=\"https://cointelegraph.com/learn/what-is-monero-xmr\">Monero</a> started using it as the hash algorithm for its blockchain consensus, CryptoNight&rsquo;s reputation as a security algorithm has strengthened across the crypto world.</p><p>The CryptoNight algorithm&rsquo;s creation is fascinating and recalls the origin of Bitcoin. Its creator &mdash; who goes by the fictitious name of Nicolas van Saberhagen &mdash; disappeared, just like the famous <a href=\"https://cointelegraph.com/learn/who-is-satoshi-nakamoto-the-creator-of-bitcoin\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/who-is-satoshi-nakamoto-the-creator-of-bitcoin\">Satoshi Nakamoto</a>.&nbsp;</p><p>Given the similarity, many believe that the two developers are the same person, with the mystery further enhanced by the spooky release date of CryptoNote, Dec. 12, 2012 (12/12/2012). CryptoNote was a security protocol and a privacy tool that promoted confidential transactions, non-linkable transactions and ring signatures.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-117723-3\">            <h2 data-ct-widget=\"explained-block-title\">                How does the CryptoNight mining algorithm work?            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>CryptoNight uses the CryptoNote consensus protocol to strengthen privacy so that nobody can tell which participant in the transaction is paying and who is receiving the money.</em></p><p>CryptoNight is GPU-mining friendly, but its characteristics make it ideal for CPU mining. With its set of 64-bit fast multipliers for maximum speed, the CPU architecture is very efficient; moreover, the heavy use of CPU caches guarantees the best performance.</p><p>Its working process involves three main steps:</p><h3>Creating a &ldquo;scratchpad&rdquo;&nbsp;</h3><p>A large memory with intermediate values is stored during a hashing function. The first input data is hashed with the Keccak-1600 hashing function, resulting in 200 bytes of randomly generated data.</p><h3>Encryption transformation</h3><p>It then takes the first 31 bytes of this Keccak-1600 hash and transforms them into the encryption key for an AES-256 algorithm, the highest value within the AES family.</p><h3>Final hashing</h3><p>CryptoNight takes the entire data set created by the AES-256 and Keccak functions in the previous step and passes it through the rest of the hash functions. Ultimately, a final hash results from the CryptoNight proof-of-work. This hash has a 256-bit extension or a total of 64 characters.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-117723-2\">            <h2 data-ct-widget=\"explained-block-title\">                Why is CryptoNight important?            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>CryptoNight was designed to give CPUs and GPUs an equal opportunity to mine blocks and discourage ASIC miners&rsquo; use.</em></p><p>CryptoNight is important for three crucial reasons: It provides stronger privacy with untraceable transactions, its ASIC resistance feature, and scalability. Most cryptocurrencies, including Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), are all but private, as someone&rsquo;s transactions and balance can be easily traced on the open-source blockchain through a <a href=\"https://cointelegraph.com/learn/active-vs-new-addresses-in-crypto-key-differences-explained\">public address</a>.&nbsp;</p><p>On the other hand, CryptoNight was designed to satisfy more privacy-concerned users who want to execute private blockchain trades. Its creators integrated two crucial privacy tools into the algorithm to achieve maximum security and anonymity: ring signatures and stealth addresses, both developed by the Monero team.</p><p>Mitigating growing concerns around cryptocurrency centralization due to ASIC <a href=\"https://cointelegraph.com/news/how-to-build-a-cryptocurrency-mining-rig\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/how-to-build-a-cryptocurrency-mining-rig/amp\">mining rigs</a> was one crucial rationale behind the development of CryptoNight. The project&rsquo;s developers focused on challenging ASIC dominance and advanced a system where GPUs and CPUs could retain their competitive edge in mining.&nbsp;</p><p>Scalability and high efficiency are also at the core of CryptoNight, which has its computation increased exponentially, guaranteeing greater scaling through faster transactions.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-117723-1\">            <h2 data-ct-widget=\"explained-block-title\">                Which cryptocurrencies use the CryptoNight mining algorithm?            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Bytecoin was the first cryptocurrency to apply the CryptoNote protocol to its blockchain, but its application on Monero helped the project gain more reputation and notoriety.</em></p><p>A number of cryptocurrencies have integrated the CryptoNight algorithm, with the first-ever example being CryptoNoteCoin, a clear reference to the CryptoNight project.&nbsp;</p><h3>Bytecoin&nbsp;</h3><p>Though initially committed to resisting ASIC dominance, the first CryptoNight coin that supported the project&rsquo;s development announced in 2018 that it would integrate ASIC mining while keeping the algorithm to prevent security and anonymity issues.</p><h3>Monero</h3><p>Despite Monero no longer using CryptoNight, it was one of its strongest supporters for its stance against ASIC power. Monero inherited CryptoNight as its proof-of-work in 2014, and since then, it has slightly evolved the algorithm, creating CryptoNight-R to intentionally break compatibility with the existing ASICs.&nbsp;</p><p>However, an efficient ASIC-compatible CryptoNight was developed in 2017 by Bitmain, and by 2018, ASICs had rejoined the Monero network. In 2019, Monero changed its mining algorithm to RandomX, which focused on CPU mining.</p><h3>Electroneum (ETN)&nbsp;</h3><p>Electroneum utilizes the CryptoNight mining algorithm, with a notable innovation in its mobile version, allowing users to mine the cryptocurrency not only through the conventional method but also by utilizing their smartphones via a mobile miner.</p><p>Other lesser-known projects that implement the CryptoNight algorithm include Boolberry, Dashcoin, DigitalNote, DarkNetCoin and Pebblecoin. However, these projects have been exposed to malicious attacks in 2017, raising concerns around the security of their networks and the reliability of the CryptoNight algorithm.</p><p>Different variants were created for the CryptoNight algorithm, and CryptoNight Heavy is one version of the hashing algorithm. It is implemented in various cryptocurrency projects, including Ryo Currency, Sumokoin and Loki.&nbsp;</p><p>However, since CryptoNight Heavy relies on a trustless peer-to-peer network, it may lead to serious vulnerabilities. Since nodes must check every new block&rsquo;s PoW and spend a significant amount of time evaluating every hash, they may become more vulnerable to distributed denial-of-service (DDoS) attacks, &#8203;&#8203;coordinated botnet-targeted activities that overwhelm a network with fake traffic.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-117723-0\">            <h2 data-ct-widget=\"explained-block-title\">                What’s ahead for CryptoNight algorithm?            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Since its inception in 2012, the CryptoNight algorithm has undergone significant changes, upgrades and slight modifications to accommodate the different cryptocurrency projects until the ultimate version created by Monero, CryptoNight-R, was introduced.</em></p><p>Is CryptoNight still a valid mining algorithm, or has it failed its mission to become an egalitarian tool? All the different versions had one common goal: ASIC resistance and preventing its further dominance in crypto mining.&nbsp;</p><p>Many believe this did not happen, and the project failed to deliver on its original stance. The Monero team stated that the failure was due to security reasons. Since the CryptoNight hash is rather expensive and time consuming to verify, it may represent a DoS risk to nodes as previously highlighted for some of CryptoNight-based cryptocurrencies.&nbsp;</p><p>Others think it did its best to prevent further expansion of ASIC corporate power. It was born as an egalitarian type of algorithm that could guarantee equal rights for people to mine, not only to the corporate world.&nbsp;</p><p>It still works as a mining tool open to everyone, even though the ASIC resistance capability is no longer feasible since the ASICs were able to adapt to successfully mine for this algorithm. Nevertheless, it can still be a good starting point for developing future cryptocurrency projects, especially for users who value privacy and fair mining.</p>            </p>        </div>    </p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-04T08:15:49.000Z",
    "title": "As yen weakens and interest peaks, Bank of Japan balances on a policy precipice",
    "url": "https://cryptoslate.com/insights/as-yen-weakens-and-interest-peaks-bank-of-japan-balances-on-a-policy-precipice/",
    "description": "<p>Quick Take The Bank of Japan (BOJ) stands at a critical juncture, striving to maintain a delicate balance amid a changing economic landscape. Recent data shows that the 10-year yield, which the BOJ has endeavored to keep below 1%, has touched 0.8, a peak unseen since 2013. Simultaneously, the BOJ has labored not to let [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/as-yen-weakens-and-interest-peaks-bank-of-japan-balances-on-a-policy-precipice/\">As yen weakens and interest peaks, Bank of Japan balances on a policy precipice</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-04T08:14:44.000Z",
    "title": "Ripple VP James Wallis on How CBDCs Could Reshape Global Payments",
    "url": "https://www.cryptoglobe.com/latest/2023/10/ripple-vp-james-wallis-on-how-cbdcs-could-reshape-global-payments/",
    "description": "Introduction James Wallis, Vice President of Central Bank Engagement at Ripple, recently spoke to PYMNTS about the transformative potential of Central Bank Digital Currencies (CBDCs) in global payments. Prior to his current role at Ripple, he was the Vice President of Global Sales Strategy &amp; Operations at Ripple from May 2019 to January 2021. In […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-04T08:24:15.000Z",
    "title": "Dillon Danis Partners With Duelbits Ahead Of Boxing Debut Clash With Logan Paul",
    "url": "https://cryptodaily.co.uk/2023/10/dillon-danis-partners-with-duelbits-ahead-of-boxing-debut-clash-with-logan-paul",
    "description": "MMA star Dillon Danis has announced on X that he’s partnering with the crypto betting casino Duelbits ahead of his eagerly anticipated bout against YouTuber Logan Paul."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-04T08:30:25.000Z",
    "title": "Argentine Economy Minister Sergio Massa Proposes National Digital Currency",
    "url": "https://news.bitcoin.com/argentine-economy-minister-sergio-massa-proposes-national-digital-currency/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/gszJJAzs-shutterstock_2344994661-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Argentine Economy Minister Sergio Massa Proposes National Digital Currency\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/gszJJAzs-shutterstock_2344994661-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gszJJAzs-shutterstock_2344994661-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gszJJAzs-shutterstock_2344994661-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gszJJAzs-shutterstock_2344994661-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gszJJAzs-shutterstock_2344994661-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gszJJAzs-shutterstock_2344994661-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/gszJJAzs-shutterstock_2344994661.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Sergio Massa, Argentine economy minister and presidential candidate, has announced that, if elected, his new government plan would include launching a national digital currency that local media has called the &#8220;crypto peso.&#8221; Massa also stated that this plan would involve a tax reduction for transactions that use this new currency. Argentine Presidential Candidate Sergio Massa [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T08:18:31.000Z",
    "title": "SoftBank CEO Masayoshi Sets Timeline for Artificial General Intelligence Revolution",
    "url": "https://www.cryptopolitan.com/softbank-ceo-artificial-general-intelligence/",
    "description": "In a groundbreaking revelation at the SoftBank World corporate conference, SoftBank CEO Masayoshi Son boldly predicts that Artificial General Intelligence (AGI), surpassing human intellect in nearly all realms, will be achieved within the next decade. Son, known for his visionary perspectives on transformative technologies, sheds light on the rapid advancements in generative AI that have ... <a title=\"SoftBank CEO Masayoshi Sets Timeline for Artificial General Intelligence Revolution\" class=\"read-more\" href=\"https://www.cryptopolitan.com/softbank-ceo-artificial-general-intelligence/\" aria-label=\"More on SoftBank CEO Masayoshi Sets Timeline for Artificial General Intelligence Revolution\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-04T08:31:39.000Z",
    "title": "Solana Surpasses Cardano and Dogecoin with Remarkable 25% Surge – Is the Price Explosion Sustainable?",
    "url": "https://www.crypto-news-flash.com/solana-surpasses-cardano-and-dogecoin-with-remarkable-25-surge-is-the-price-explosion-sustainable/?utm_source=rss&utm_medium=rss&utm_campaign=solana-surpasses-cardano-and-dogecoin-with-remarkable-25-surge-is-the-price-explosion-sustainable",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T093129.445.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T093129.445.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T093129.445-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Solana’s recent surge sees it flip Dogecoin and Cardano in market capitalization. Despite the impressive gain, some indicators suggest potential selling pressure. Amid a prevailing bullish sentiment in the crypto landscape, Solana&#8217;s [$SOL] price has recently surged to unprecedented levels. This surge isn&#8217;t just a mere green tick on the chart; it&#8217;s a significant gain [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-04T08:22:27.000Z",
    "title": "Stellar (XLM) Shines Bright with Circle’s USDC and EURC Connections to Billion-Dollar Markets and Major New Partnerships",
    "url": "https://www.crypto-news-flash.com/stellar-xlm-shines-bright-with-circles-usdc-and-eurc-connections-to-billion-dollar-markets-and-major-new-partnerships/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-xlm-shines-bright-with-circles-usdc-and-eurc-connections-to-billion-dollar-markets-and-major-new-partnerships",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Stellar\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-48x27.jpg 48w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Stellar&#8217;s toolkit received significant upgrades at the conference, simplifying integration and supporting DeFi applications. MoneyGram expanded its presence on Stellar, offering cash-to-crypto services with Circle&#8217;s USDC stablecoin. The Stellar Development Foundation&#8217;s annual gathering, Meridian 2023, recently concluded in Spain, focusing on &#8220;Unlocking Human Potential&#8221; through blockchain technology. The event attracted diverse participants, including developers, entrepreneurs, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-04T08:24:29.000Z",
    "title": "Crypto Prices Today: XRP Prints 24H Gain to Beat BSV and CRV",
    "url": "https://coinedition.com/crypto-prices-today-xrp-prints-24h-gain-to-beat-bsv-and-crv/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/XRP_As_I_have_stated_many_times_the_e_wave_of_a_triangle_is_the.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"xrp price\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/XRP_As_I_have_stated_many_times_the_e_wave_of_a_triangle_is_the.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/XRP_As_I_have_stated_many_times_the_e_wave_of_a_triangle_is_the-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/XRP_As_I_have_stated_many_times_the_e_wave_of_a_triangle_is_the-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/XRP_As_I_have_stated_many_times_the_e_wave_of_a_triangle_is_the-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/XRP_As_I_have_stated_many_times_the_e_wave_of_a_triangle_is_the-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/XRP_As_I_have_stated_many_times_the_e_wave_of_a_triangle_is_the-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The X user WhaleWire speculated in an X post earlier today that the price of Ripple (XRP) can only go up in the long term. This is after Judge Torres rejected the SEC’s final motion to appeal the Ripple case, leading to XRP’s price pumping more than 7%, according to the post. WhaleWire mentioned in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-prices-today-xrp-prints-24h-gain-to-beat-bsv-and-crv/\">Crypto Prices Today: XRP Prints 24H Gain to Beat BSV and CRV</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]