[
  {
    "source": "Bitcoin.com",
    "date": "2023-12-13T05:00:22.000Z",
    "title": "FCA Has Dealt With 1,400 Cases Related to Unregulated Crypto Activity, UK Regulator Reveals",
    "url": "https://news.bitcoin.com/fca-has-dealt-with-1400-cases-related-to-unregulated-crypto-activity-uk-regulator-reveals/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/uk-audit-office-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"FCA Has Dealt With 1,400 Cases Related to Unregulated Crypto Activity, UK Regulator Reveals\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/uk-audit-office-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/uk-audit-office-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/uk-audit-office-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/uk-audit-office-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/uk-audit-office-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/uk-audit-office-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/uk-audit-office.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.K. Financial Conduct Authority (FCA) has revealed that it has dealt with over 1,400 crypto cases between January 2020 and June 2023. The regulator noted that &#8220;a shortage of crypto skills meant the FCA took longer than planned to register crypto-asset firms under money laundering regulations.&#8221; 1,400 Cases Related to Unregulated Crypto-Asset Activity The [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T05:05:33.000Z",
    "title": "U.S. DOE Launches Office of Critical and Emerging Technology to Drive Innovation",
    "url": "https://www.cryptopolitan.com/office-of-critical-and-emerging-technology/",
    "description": "In a groundbreaking move aimed at fortifying the nation&#8217;s position in cutting-edge technologies, the U.S. Department of Energy (DOE) has officially inaugurated the Office of Critical and Emerging Technology. The strategic initiative underscores the government&#8217;s commitment to harnessing the potential of artificial intelligence (AI), biotechnology, quantum computing, and semiconductors.&#160; With broad applications across clean energy, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T04:46:34.000Z",
    "title": "70mai Dashcams Offer 25% Discount with AI features – Revolutionize Your Road Safety",
    "url": "https://www.cryptopolitan.com/70mai-dashcams-offer-25-discount-with-ai/",
    "description": "In the blink of an eye, a car covering over 50 feet at 60 mph can change lives forever. Dashcams, once reserved for law enforcement, have evolved into an essential tool for drivers worldwide. As road incidents escalate, emphasizing accountability, 70mai, a prominent dashcam manufacturer, announces an enticing 25% discount on their top-notch dashcams. Now [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-13T04:54:19.000Z",
    "title": "Ethereum Price Bears Keep Pushing, Why Decline Isn’t Over Yet",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-decline-2000/",
    "description": "Ethereum price is moving lower below the $2,250 support zone. ETH is now at risk of more downsides below the $2,120 support zone. Ethereum struggled to start a fresh increase above the $2,250 resistance. The price is trading below $2,250 and the 100-hourly Simple Moving Average. There is a key declining channel forming with resistance near $2,225 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move down if it declines below the $2,120 support zone. Ethereum Price Takes Hit Ethereum price attempted a fresh increase above the $2,120 and $2,150 levels. ETH even climbed above the $2,200 level, but the bears were active near the $2,250 level. A high was formed near $2,252 and the price started a fresh decline, like Bitcoin. There was a move below the $2,200 support zone. The price declined below the 23.6% Fib retracement level of the upward move from the $1,980 swing low to the $2,252 high. Ethereum is now trading below $2,250 and the 100-hourly Simple Moving Average. There is also a key declining channel forming with resistance near $2,225 on the hourly chart of ETH/USD. If there is a fresh increase, the pair might face resistance near the $2,200 level. Source: ETHUSD on TradingView.com The next key resistance is near the $2,225 level or the channel trend line. The main resistance is still near $2,250. A clear move above the $2,250 zone could send the price toward the $2,300 level. The next resistance sits at $2,350. Any more gains could start a wave toward the $2,500 level. More Losses in ETH? If Ethereum fails to clear the $2,225 resistance, it could continue to move down. Initial support on the downside is near the $2,120 level or the 50% Fib retracement level of the upward move from the $1,980 swing low to the $2,252 high. The next key support is $2,045. The main support is now near $2,000. A downside break below $2,000 might start another major decline. In the stated case, Ether could revisit the $1,880 support. Any more losses might call for a test of the $1,820 support zone in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $2,120 Major Resistance Level – $2,225"
  }
]