[
  {
    "source": "Cointelegraph",
    "date": "2023-07-04T19:19:44.000Z",
    "title": "Lido, Rocket Pool team members argue over decentralization",
    "url": "https://cointelegraph.com/news/lido-rocket-pool-team-members-argue-over-decentralization",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/be1b176e-310c-4799-a74b-e688beb4ae7d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A Lido team member claimed Rocket Pool is not really governed by its DAO, but Rocket Pool community members pushed back, claiming the protocol is becoming more decentralized.</p>\n                    <p><p>A team member for Lido has <a href=\"https://twitter.com/d_gusakov\" target=\"_blank\" rel=\"noopener nofollow\">accused</a> competitor Rocket Pool of being too centralized in a July 4 social media post. Both Lido and Rocket Pool are liquid staking protocols that allow users to delegate their cryptocurrency to validators and receive derivative tokens in exchange.</p><p>According to the post from Lido's community staking lead Dmitry Gusakov, the Rocket Pool contracts are controlled by the Rocket Pool team, allowing the team to change any parameters and call any method. This means that Rocket Pool developers can increase the inflation rate to an arbitrarily large percentage or increase fees to up to 100%.</p><p>Gusakov claimed this vulnerability does not exist in Lido’s contracts, as in Lido, these actions are “fully controlled by [decentralized autonomous organization] LidoDAO.”</p><p>Rocket Pool Grants Management Committee member Waq responded to the accusation, stating that the vulnerability was already known to the team and will be fixed in the future. Waq accused the Lido team of trying to take credit for discovering an issue that was already known.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Here we go again with the \"brand new\" discoveries of  <a href=\"https://twitter.com/Rocket_Pool?ref_src=twsrc%5Etfw\">@Rocket_Pool</a> being super malicious again  Not a single word of how the community has been working for over a year on fixing this and the progress we're making. Once we fix this, they'll rush to take the credit like always.</p>— Waq | Rocket Fuel  (@waqwaqattack) <a href=\"https://twitter.com/waqwaqattack/status/1676222147814096896?ref_src=twsrc%5Etfw\">July 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to Gusakov's post, the RocketStorage contract at Ethereum address 0x1d8f8f00cfa6758d7bE78336684788Fb0ee0Fa46 contains a parameter called “guardian.” Many functions in Rocket Pool contracts are also labeled as “onlyGuardian,” meaning they can only be called by the account listed in this parameter, which is currently set to the RocketPool deployer account at 0x0cCF14983364A7735d369879603930Afe10df21e.</p><p>Actions that can be performed by the “guardian” include changing the “RPL InflationIntervalRate” and the “ETH DepositFee,” implying that the team can increase the inflation rate of the Rocket Pool governance token (RPL) or remove users’ deposits by setting the fee to 100%, Gusakov stated.</p><p>Content creator Chris Blec shared the post, <a href=\"https://twitter.com/ChrisBlec/status/1676209114760851457\" target=\"_blank\" rel=\"noopener nofollow\">claiming</a> that it proves “‘pDAO is not a DAO” or that RPL token-holders are not actually in control of Rocket Pool’s governance.</p><p>In response, RocketPool community advocate Jasper.lens <a href=\"https://twitter.com/Jasper_ETH/status/1676220730176946178\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> that the community is already aware of this centralization issue, which will be patched in the upcoming Saturn upgrade. According to Jasper, the centralization occurred during a period when voting systems for Rocket Pool’s DAO were still being designed and tested. The team decided to not allow the DAO to practice on-chain voting in the initial testing phase. However, testing has now been completed, and the upcoming Saturn upgrade “is all about patching the decentralization holes.”</p><p>In a comment agreeing with Jasper.lens’ post, Waq <a href=\"https://twitter.com/waqwaqattack/status/1676222147814096896\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> that the Rocket Pool community “has been working for over a year on fixing this” and predicted the Lido team would “rush to take the credit like always” once the problem is fixed.</p><p>Liquid staking protocols have been growing in popularity over the past few months. On May 1, blockchain analytics platform DefiLlama stated that these protocols have <a href=\"https://cointelegraph.com/news/liquid-staking-solutions-now-have-more-tvl-than-dexs-defi-llama\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/liquid-staking-solutions-now-have-more-tvl-than-dexs-defi-llama/amp\">surpassed decentralized exchanges</a> as the top DeFi category in terms of total value locked. On May 30, Tenet partnered with LayerZero to <a href=\"https://cointelegraph.com/news/lsd-for-defi-tenet-layerzero-partner-to-drive-cross-chain-liquid-staking-adoption\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/lsd-for-defi-tenet-layerzero-partner-to-drive-cross-chain-liquid-staking-adoption/amp\">implement liquid staking</a> on more blockchains in the future.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-04T19:30:04.000Z",
    "title": "The High Rate Environment —  Bank of America Faces Paper Losses Exceeding $100 Billion",
    "url": "https://news.bitcoin.com/the-high-rate-environment-bank-of-america-faces-paper-losses-exceeding-100-billion/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/bas-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"The High Rate Environment —  Bank of America Faces Paper Losses Exceeding $100 Billion\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/bas-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bas-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bas-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bas-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bas-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bas-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bas.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Following the aftermath of the United States&#8217; three major bank collapses, several market observers argue that the banking crisis in the country persists. Bank of America has recently garnered significant attention, with the Federal Deposit Insurance Corporation (FDIC) reporting that the financial behemoth incurred paper losses exceeding $100 billion by the close of the first [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T19:30:04.000Z",
    "title": "US-China tech clash heats up: Beijing’s export move",
    "url": "https://www.cryptopolitan.com/us-china-tech-clash-heats-up-beijings-move/",
    "description": "The temperature in the tech arena between the United States and China is escalating, as Beijing&#8217;s recent maneuver in the export sector introduces a new dynamic to this complex relationship. In an unexpected move, China has clamped down on the export of two essential metals, gallium and germanium, largely utilized in the manufacture of semiconductors ... <a title=\"US-China tech clash heats up: Beijing&#8217;s export move\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-china-tech-clash-heats-up-beijings-move/\" aria-label=\"More on US-China tech clash heats up: Beijing&#8217;s export move\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T19:24:39.000Z",
    "title": "TON network announces its new encrypted messaging feature",
    "url": "https://www.cryptopolitan.com/ton-network-announces-encrypted-messaging/",
    "description": "The TON network, developed by the TON Foundation, recently unveiled a new on-chain encrypted messaging feature, allowing users to send private messages within the network. TON, which originated from code created by the Telegram instant messaging app team, was forked and open-sourced after Telegram abandoned the project in July 2020 before its mainnet launch. TON ... <a title=\"TON network announces its new encrypted messaging feature\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ton-network-announces-encrypted-messaging/\" aria-label=\"More on TON network announces its new encrypted messaging feature\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T19:22:19.000Z",
    "title": "Meta in hot water again: EU ruling shakes company",
    "url": "https://www.cryptopolitan.com/meta-hot-water-eu-ruling-shakes-company/",
    "description": "The digital giant Meta finds itself in troubled waters once again as the European Union&#8217;s top court lays down a precedent-shattering ruling. This judgment allows competition regulators to probe whether companies are complying with privacy rules, bringing Meta&#8217;s data usage for online advertising under the spotlight. This latest development is a compelling narrative of technology, ... <a title=\"Meta in hot water again: EU ruling shakes company\" class=\"read-more\" href=\"https://www.cryptopolitan.com/meta-hot-water-eu-ruling-shakes-company/\" aria-label=\"More on Meta in hot water again: EU ruling shakes company\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T19:15:52.000Z",
    "title": "Should there be a strict cap on digital pound holdings?",
    "url": "https://www.cryptopolitan.com/should-there-be-strict-cap-on-digital-pound/",
    "description": "Debate surrounding the proposed digital pound, a central bank digital currency (CBDC) to be issued by the UK, has reached a fever pitch. The chief bone of contention is the question: should there be an upper limit on individual holdings of the digital pound? This question has ignited fiery discussions among industry leaders, with U.K. ... <a title=\"Should there be a strict cap on digital pound holdings?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/should-there-be-strict-cap-on-digital-pound/\" aria-label=\"More on Should there be a strict cap on digital pound holdings?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T19:13:45.000Z",
    "title": "Hong Kong aims to outshine Tether and USD Coin with its own stablecoin",
    "url": "https://www.cryptopolitan.com/hong-kong-aims-to-outshine-tether-and-usd-coin-with-its-own-stablecoin/",
    "description": "To solidify its position as a global financial hub, Hong Kong is making waves in the cryptocurrency industry with plans to launch its state-backed stablecoin. This move comes as the region&#8217;s interest in digital currencies and Web3 technology continues to grow. By creating a stablecoin linked to the Hong Kong dollar, the government aims to ... <a title=\"Hong Kong aims to outshine Tether and USD Coin with its own stablecoin\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hong-kong-aims-to-outshine-tether-and-usd-coin-with-its-own-stablecoin/\" aria-label=\"More on Hong Kong aims to outshine Tether and USD Coin with its own stablecoin\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T19:37:37.000Z",
    "title": "Join the TRON Ecosystem with stUSDT: A Gateway to Real World Assets",
    "url": "https://www.crypto-news-flash.com/join-the-tron-ecosystem-with-stusdt-a-gateway-to-real-world-assets/?utm_source=rss&utm_medium=rss&utm_campaign=join-the-tron-ecosystem-with-stusdt-a-gateway-to-real-world-assets",
    "description": " Tron ecosystem unveiled its first Real World Asset (RWA) product, stUSDT.  stUSDT offers token holders the opportunity to earn from real-time assets passively. In a recent announcement, the Tron ecosystem unveiled its first Real World Asset (RWA) product, stUSDT. Functioning through the decentralized platform JustLend, this product aims to emulate the functionality of Alibaba&#8217;s Yu&#8217;e [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T19:35:41.000Z",
    "title": "Revolutionizing Healthcare: VeChain’s Blockchain Technology and the Future of Data Security",
    "url": "https://www.crypto-news-flash.com/revolutionizing-healthcare-vechains-blockchain-technology-and-the-future-of-data-security/?utm_source=rss&utm_medium=rss&utm_campaign=revolutionizing-healthcare-vechains-blockchain-technology-and-the-future-of-data-security",
    "description": "VeChain is said to be actively revolutionizing the healthcare industry with incredible provisions of traceability, transparency, etc.  Its smart contracts also improve supply chain effectiveness and initiate prompts when pharmaceuticals are temperature sensitive. VeChain has been actively deployed in a variety of industries to unleash the power of blockchain in the real world. The healthcare [...]"
  }
]