[
  {
    "source": "CoinDesk",
    "date": "2024-03-01T16:59:48.000Z",
    "title": "Indonesia’s Crypto Watchdog Pushes for Friendlier Taxes as Regulatory Overhaul Looms",
    "url": "https://www.coindesk.com/policy/2024/03/01/indonesias-crypto-watchdog-pushes-for-friendlier-taxes-as-regulatory-overhaul-looms/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto is classified as a commodity in Indonesia and is subject to VAT and income tax."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-01T16:57:26.000Z",
    "title": "What is Nolus? How the DeFi Leasing Platform Simplifies Crypto Lending",
    "url": "https://decrypt.co/resources/what-is-nolus-how-the-defi-leasing-platform-simplifies-crypto-lending",
    "description": "Nolus Protocol aims to address the inefficiencies of DeFi lending and borrowing with a new concept, the DeFi Lease. Here's how it works."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-01T17:00:00.000Z",
    "title": " BTC layer-2s among the catalysts of this bull cycle, Bitcoin OG says ",
    "url": "https://cointelegraph.com/news/btc-layer-2s-among-catalysts-bull-cycle-bitcoin-og-says",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZDZjNGNjMDQtNDUxNS00M2E0LWI4ZTktNzJmMGZjOTJkN2Q2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The emerging Bitcoin layer-2 sector will be one of the main narratives driving BTC's price to unprecedented highs in this bull cycle, says Bitcoin OG Dan Held.</p>\n                    <p><p>The integration of Layer-2 blockchains on top of Bitcoin could unlock Bitocoin’s true potential and propel its price to unprecedented highs, says Bitcoin OG and former maximalist Dan Held. </p><p>“People are going to take their Bitcoin, lock it up, stake it to earn yield. They're going to borrow against it,\" Held said during an excusive Cointelegraph Interview. </p><p>Together with the upcoming halving, the recent Bitcoin ETF approvals and a potential interest rates cut from the U.S. Federal Reserve, Bitcoin DeFi could spark the biggest bull run in history, Held believes.</p><p><a href=\"https://cointelegraph.com/news/btc-layer-2s-among-catalysts-bull-cycle-bitcoin-og-says\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-01T17:01:28.000Z",
    "title": "xAI Corp owner Elon Musk sues OpenAI for straying from non-profit roots",
    "url": "https://cryptoslate.com/xai-corp-owner-elon-musk-sues-openai-for-straying-from-nonprofit-roots/",
    "description": "<p>Elon Musk has filed a lawsuit against OpenAI, its co-founders Sam Altman and Greg Brockman, and other related entities. According to the Feb. 29 court filing, Musk alleged that the defendants were in breach of their founding agreement, which stipulated that the company would develop artificial general intelligence (AGI) for the benefit of humanity, not [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/xai-corp-owner-elon-musk-sues-openai-for-straying-from-nonprofit-roots/\">xAI Corp owner Elon Musk sues OpenAI for straying from non-profit roots</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-01T17:08:20.000Z",
    "title": "Over 97% of Bitcoin holders see profits, IntoTheBlock shows",
    "url": "https://cryptobriefing.com/over-97-bitcoin-holders-profits-intotheblock/",
    "description": "Crypto analytics firm IntoTheBlock revealed in its weekly newsletter that over 97% of Bitcoin holders are in the money. This level of profitability has not been seen since November 2021."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-01T16:53:38.000Z",
    "title": "Altcoins Predicted to Outperform Solana: Key Picks to Watch in 2024",
    "url": "https://cryptodaily.co.uk/2024/03/altcoins-predicted-to-outperform-solana-key-picks-to-watch-in-2024",
    "description": "Get ready to witness a crypto revolution! As Solana (SOL) hits a new yearly peak, watch out for these altcoins that are set to potentially outperform even Solana in 2024. Dive into the crypto market's vibrant growth and discover the key picks that could skyrocket your investments this year!"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-01T17:00:15.000Z",
    "title": "From Low to High — Bitcoin Fees Jump Over 129% in 4 Days",
    "url": "https://news.bitcoin.com/from-low-to-high-bitcoin-fees-jump-over-129-in-4-days/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/btycycisisdjj-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"From Low to High — Bitcoin Fees Jump Over 129% in 4 Days\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/btycycisisdjj-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/btycycisisdjj-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/btycycisisdjj-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/btycycisisdjj-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/btycycisisdjj-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/btycycisisdjj-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/btycycisisdjj.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />After a short period of diminished onchain network fees, the expense of sending bitcoin has begun climbing once more, hitting a midweek average of 73.3 satoshis per virtual byte (sats/vB) or $11.48 for each transaction. Currently, a backlog of 207 mempool blocks is pending, waiting to process about 134,000 unconfirmed transactions, a situation that has [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-01T16:59:55.000Z",
    "title": "Solana Up 22% On Weekly, New SOL Rival Surges 325%",
    "url": "https://www.cryptopolitan.com/solana-up-22-on-weekly-new-sol-rival-surges-325/",
    "description": "The contrasting yet impressive growth of Solana (SOL) and Shiba Budz (BUDZ) underscores the vibrant and ever-evolving nature of the cryptocurrency market. As Shiba Budz (BUDZ) carves its niche and challenges established players like Solana (SOL), it serves as a reminder of the limitless possibilities for innovation within this space. For investors and enthusiasts alike, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-01T16:59:53.000Z",
    "title": "Missed Dogecoin (DOGE) Spike? Cryptocurrency Enthusiast Don’t Hesitate To Grab Option2Trade (O2T) At $0.0091",
    "url": "https://www.cryptopolitan.com/missed-dogecoin-doge-spike-cryptocurrency-enthusiast-dont-hesitate-to-grab-option2trade-o2t-at-0-0091/",
    "description": "For cryptocurrency enthusiasts still ruminating over the missed Dogecoin (DOGE) spike, Option2Trade (O2T) offers a new chapter and a chance to be at the forefront of a potentially groundbreaking investment. With its A.I-driven platform and strategic incentives for users, Option2Trade (O2T) not only represents a leap forward in crypto trading technology but also a fresh [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-01T16:41:09.000Z",
    "title": "Trouble in paradise: South Africa wants to ditch BRICS foreve",
    "url": "https://www.cryptopolitan.com/south-africa-wants-to-ditch-brics-forever/",
    "description": "Word on the street, courtesy of South Africa&#8217;s own ambassador to Russia, Mzvukile Jeff Maqetuka, is that the upcoming elections might just be the catalyst for South Africa to bid adieu to BRICS, leaving the bloc scratching its head and wondering where it all went wrong. Maqetuka, in a candid chat with Russia’s TASS Publication, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-01T17:00:36.000Z",
    "title": "Shiba Inu Could See A 2,100% Run If This Happens",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-see-a-2100-run/",
    "description": "Shiba Inu (SHIB) Marketing Lead, Lucie, has highlighted a move that could see the SHIB token make a 2,100% gain if history were to repeat itself. There is also the belief that the meme coin could even go on to enjoy a higher gain this time around, considering initiatives that have been put in place to increase its value.  SHIB To Replicate 2021 Run? Lucie mentioned in an X (formerly Twitter) post that SHIB surged by 800% in 2021 without any burns and hinted at something similar happening this year. Interestingly, the 800% gain Lucie referred to is way more than that (over 2,100%). Meanwhile, she highlighted how token burns and stead demand could contribute to such a parabolic move this time.  Related Reading: Solana On A Roll: Crypto Analyst Predicts Push To $600 Indeed, the token burns carried out so far by the SHIB community has so far sparked price surges for SHIB at different times. As such, SHIB can be expected to experience more moves to the upside even as more token burns are carried out. These token burns will also increase as Shibarium gains wider adoption.  As Lucie noted, demand for the SHIB token is also essential, as token burns do not work in isolation. For the meme coin’s value to rise significantly, there needs to be an increased demand for it even as it becomes more scarce. Lucie seemed optimistic that SHIB could replicate this 2021 run as she added that the meme coin is “poised for growth and waits for no one.” More Than Just A Meme Coin Last year, the Shiba Inu team made a statement with the launch of the layer-2 network Shibarium, revealing their intentions to make SHIB more than just a meme coin. So far, they have done a great job, as the Shibarium launch has added more utility for the crypto token and caused its demand to rise.  Related Reading: Dogecoin Rallies 50% To Beat Out Avalanche, BONK Overtakes PEPE SHIB’s status as being more than just a meme coin is even more significant when one considers how Ripple’s CEO Brad Garlinghouse had, during the 2024 World Economic Forum (WEF), criticized Dogecoin (DOGE) for not providing any real-life utility.  While such a statement is not necessarily true about DOGE, it, however, puts SHIB on a higher pedestal, considering how much it has achieved since Shibarium launched last year. The team is also not slowing down, as they have a lot planned for 2024. The SHIB ecosystem is undoubtedly growing, and the meme coin is at the helm of all of it.   At the time of writing, SHIB is trading at around $0.00001282, down almost 8% in the last 24 hours, according to data from CoinMarketCap.  SHIB price at $0.0000129 &#124; Source: SHIBUSD on Tradingview.com Featured image from CCN.com, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-01T16:44:00.000Z",
    "title": "Crypto Investor Outlines Why He is Bullish on Aerodrome Finance (AERO)",
    "url": "https://coinedition.com/crypto-investor-outlines-why-he-is-bullish-on-aerodrome-finance-aero/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Reasons To Be Bullish on Aerodrome Finance (AERO): Investor\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7.jpg 730w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Exchanges-7-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>VoomioNFT’s founder and director of customer relations, Justin Williams, identified as Taco on X (formerly Twitter), has outlined the reasons behind his ultra-bullish approach toward Aeordrome Finance (AERO). In a recent post on X, Taco highlighted how AERO’s links to Coinbase, one of the world’s foremost crypto exchanges, impacted the project.  According to Taco, Aerodrome [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/crypto-investor-outlines-why-he-is-bullish-on-aerodrome-finance-aero/\">Crypto Investor Outlines Why He is Bullish on Aerodrome Finance (AERO)</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]