[
  {
    "source": "Cryptopolitan",
    "date": "2024-01-20T14:00:35.000Z",
    "title": "DPD’s AI Chatbot Goes Rogue: Apology Issued After Swearing and Criticizing Company",
    "url": "https://www.cryptopolitan.com/dpds-ai-chatbot-goes-rogue-for-swearing/",
    "description": "DPD, the courier company, recently faced an unexpected challenge when its AI-powered chatbot malfunctioned, leading to it swearing at users and criticizing the company&#8217;s services. The incident has prompted an apology from DPD and a suspension of the live chat function on its website. DPD recently updated its website&#8217;s chatbot functionality to provide more human-like [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-20T13:59:14.000Z",
    "title": "PlayStation Plus to Remove 10 Games in February",
    "url": "https://www.cryptopolitan.com/playstation-plus-to-remove-10-games/",
    "description": "PlayStation Plus subscribers will have to say goodbye to 10 games in February as part of the regular rotation of titles available through the service. These games encompass a variety of genres and publishers, with some notable names among them.&#160; Below is the full list of games slated to be removed from PlayStation Plus on [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-20T14:00:31.000Z",
    "title": "XRP Price Breakout To $5: Analyst Reveals Key Levels Of Importance",
    "url": "https://www.newsbtc.com/news/xrp-price-breakout-to-5-analyst-reveals-key-levels-of-importance/",
    "description": "Crypto analyst Egrag Crypto has revealed key price levels to watch out for in one of his latest analyses of XRP. The analyst hinted that these prices could be crucial especially following his prediction that the crypto token will rise to $5 in 90 days.  Related Reading: Robinhood Goes Shiba Crazy, Buys 230 Billion SHIB In 24 Hours – Here’s The Scoop Targets That Confirm An XRP Bull Run  In a post on his X (formerly Twitter) platform, Egrag highlighted $0.60, $0.75, $0.95, and $1.3 as price levels to keep an eye out for as they will validate a bullish trend. He says, “A weekly close above any of these levels signifies robust support and a continued upward trajectory.”  #XRP Blue Channel vs. Red Channel Unveiled: To decipher the intricate details within the chart below, let&#8217;s break it down into three crucial sections: 1) Blue Channel in comparison to Red Channel: Should the Blue Channel align with the Red Channel, a potential flash crash to… pic.twitter.com/2w5hmoH872 — EGRAG CRYPTO (@egragcrypto) January 19, 2024 Further elaborating on their importance, he noted that these targets “offer crucial insights into significant price behavior.” Considering that XRP has continued to trade below those levels, the token hitting any of those targets will easily suggest that the sentiment towards the altcoin has changed.  XRPUSD currently trading at $0.54896 on the daily chart: TradingView.com Meanwhile, the crypto analyst also raised the possibility of XRP experiencing a 50% drop in pursuit of a move similar to the one in 2017, when XRP surged by 61,000%. Interestingly, Egarag believes that XRP replicating such a similar move will see the crypto token rise to as high as $27 in the next bull run.  How XRP Could Crash To $0.28 Also offering a bearish narrative for XRP, Egrag stated that XRP could witness a flash crash to $0.28 should the blue channel (visible in the chart he shared) align with the red channel. If that were to happen, a subsequent rise to $0.41 from $0.28 could unfold, the analyst claims. Egrag believes that these channels add more intrigue to XRP’s price action, considering that the crypto token has been navigating the blue channel for nearly 600 days since its breakout in May 2022. On the other hand, XRP is also said to have spent 580 days in the red channel before making a significant surge.   Related Reading: Will X Unleash The Doge? Platform Users Eager To Embrace The Meme Coin As part of this bearish projection, the crypto analyst raised the prospect of a further BTC decline, dragging XRP alongside. Egrag claims that this could serve as the “ultimate shakeout, especially if market makers shake out the remaining weak hands.” These market makers are the same persons that Egrag says “may engineer an independent surge,” which would propel XRP’s price to $5. If that doesn’t happen and the market ends up experiencing the worst-case scenario, the analyst urged everyone to seize the opportunity to obtain XRP at a “more favorable price.” At the time of writing, XRP is trading at $0.54, down in the last 24 hours, according to data from CoinMarketCap.  Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-20T14:00:55.000Z",
    "title": "Celestia and Ethereum Classic Make Waves in Crypto Market, Borroe Finance Emerges as a DeFi Leader in Presale",
    "url": "https://www.crypto-news-flash.com/celestia-and-ethereum-classic-make-waves-in-crypto-market-borroe-finance-emerges-as-a-defi-leader-in-presale/?utm_source=rss&utm_medium=rss&utm_campaign=celestia-and-ethereum-classic-make-waves-in-crypto-market-borroe-finance-emerges-as-a-defi-leader-in-presale",
    "description": "<img width=\"512\" height=\"307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-20T094930.711.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-20T094930.711.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-20T094930.711-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-20T094930.711-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-20T094930.711-450x270.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the dynamic crypto world, Celestia (TIA) hits an all-time high, whereas Ethereum Classic (ETC) provides an update on Spiral Network Upgrade. Moreover, Borroe Finance ($ROE) has already racked up $2.6 million in its presale, triggering fear of missing out among eager investors. Let’s know more. &#62;&#62;BUY $ROE TOKENS NOW&#60;&#60; Celestia Hits an All-Time High [...]"
  }
]