[
  {
    "source": "Decrypt",
    "date": "2023-07-05T18:57:18.000Z",
    "title": "'The Larger, The Better', Says Binance CEO on BlackRock Bitcoin ETF",
    "url": "https://decrypt.co/147404/the-larger-the-better-binance-ceo-blackrock-bitcoin-etf",
    "description": "“We welcome more players, the larger the better,” said Zhao, explaining that “it will offer more coverage.”"
  },
  {
    "source": "Decrypt",
    "date": "2023-07-05T18:40:00.000Z",
    "title": "Ex-Activision's Michael Lee: Gaming Is Crypto's 'Killer App'",
    "url": "https://decrypt.co/videos/live-events/M9ulXrb3/ex-activisions-michael-lee-gaming-is-cryptos-killer-app",
    "description": "Former Activision Vice President Michael Lee is now the SVP of Growth at Matter Labs. At the 3XP gaming conference, Lee sat down with Decrypt's Kate Irwin to discuss crypto gaming and give his predictions for the industry."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T19:00:00.000Z",
    "title": "Half of stolen NFTs are sold within 3 hours: Nifty Newsletter, June 28–July 4",
    "url": "https://cointelegraph.com/news/half-of-stolen-nfts-are-sold-within-3-hours-nifty-newsletter-june-28-july-4",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/77a2651f-0560-41f3-a173-3572bcc06544.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Swiss bank Credit Suisse has partnered with the Swiss Football Association to release NFTs in support of women’s soccer in the country.</p>\n                    <p><p>In this week’s newsletter, read about how stolen <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a> are sold within three hours after being pinched, and check out AzukiDAO’s plans to take back $39 million worth of Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) from the founder of the Azuki NFT collection. In other news, investors in Logan Paul’s NFT gaming project CryptoZoo are still waiting for promised refunds from the YouTuber, and don’t forget this week’s Nifty News, featuring blue-chip NFT collections dropping in prices and Swiss bank Credit Suisse releasing NFTs to support women’s soccer. </p><h2>Half of stolen NFTs are sold within 3 hours: PeckShield</h2><p>A report published by security company PeckShield highlighted that half of all stolen NFTs are sold within 160 minutes on platforms like OpenSea and Blur. According to the security firm, 86% of the stolen NFTs they flagged were sold on Blur, while around 13% were sold on OpenSea. </p><p>The report also shared figures on the value of stolen NFTs in June. According to the report, $2.27 million worth of NFTs were stolen in June, which is an 85% decrease compared with February 2023, when $16.2 million worth of NFTs were stolen. </p><p><a href=\"https://cointelegraph.com/news/peckshield-half-of-stolen-nf-ts-are-sold-within-3-hours-peck-shield\"><strong>Continue reading</strong></a></p><h2>AzukiDAO proposes to recover 20,000 ETH from Azuki founder ‘Zagabond’</h2><p>AzukiDAO — the decentralized autonomous organization (DAO) made up of holders of the popular NFT collection Azuki — has proposed to hire a lawyer and take legal action against the Azuki collection’s founder, known as Zagabond, for allegedly “rugging” several projects. </p><p>The DAO aims to claim the $39 million worth of ETH earned from the launch of Azuki’s Elementals NFT collection. According to AzukiDAO, any funds that will be retrieved from the lawsuit can benefit its entire Azuki community. </p><p><a href=\"https://cointelegraph.com/news/azukidao-proposal-eth-refund-from-founder-zagabond\"><strong>Continue reading</strong></a></p><h2>Investors still waiting on $1.9 million refund Logan Paul promised six months ago: Coffeezilla</h2><p>Internet detective Coffeezilla once again called out popular YouTube celebrity Logan Paul over his controversial NFT gaming project, CryptoZoo. According to Coffeezilla, communications over the $1.9 million refund promised in January have dried up. </p><p>The internet detective highlighted that since the announcement, Paul has not commented on any refund plans. Moreover, Coffeezilla noted that the YouTuber doesn’t seem to have any plans to conduct the 1,000 ETH refund. </p><p><a href=\"https://cointelegraph.com/news/investors-still-waiting-on-refund-logan-paul-promised-six-months-ago\"><strong>Continue reading</strong></a></p><h2>Nifty News: Blue chip NFT prices wobble, Credit Suisse tries tokens and more</h2><p>Floor prices of the biggest NFT collections are almost at two-year lows. According to data from the crypto price tracking website CoinGecko, Bored Ape Yacht Club (BAYC) floor prices have sunk to 27.7 ETH — a price level not seen since September 2021. Apart from BAYC, other collections like CryptoPunks and DeGods have also seen price drops in the last week. </p><p>Meanwhile, Swiss bank Credit Suisse is dipping its toes in Web3 by releasing NFTs on the Ethereum blockchain. The bank has partnered with the Swiss Football Association to support women’s soccer in the country by donating the proceeds of the NFT sales. </p><p><a href=\"https://cointelegraph.com/news/blue-chip-floor-price-low-credit-suisse-football-nft\"><strong>Continue reading</strong></a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-01/43adc850-7dbd-4fa8-811b-9eb32b6c1983.jpg\"  alt=\"\"  title=\"Half of stolen NFTs are sold within 3 hours: Nifty Newsletter, June 28&ndash;July 4\"  /></figure><p class=\"post-content__accent post-content__accent_big\"><a href=\"https://cointelegraph.com/podcasts/nft-steez\">CHECK OUT COINTELEGRAPH’S<em> NFT STEEZ </em>PODCAST</a></p><p><em>Thanks for reading this digest of the week’s most notable developments in the NFT space. Come again next Wednesday for more reports and insights into this actively evolving space.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T18:49:19.000Z",
    "title": "Crypto user moves $160M Bitcoin from Luna Foundation Guard wallet: Report",
    "url": "https://cointelegraph.com/news/crypto-user-moves-bitcoin-luna-foundation-guard-wallet-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/09aeb43d-ad32-49e6-b325-127ab8033512.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchain data showed the wallet reportedly associated with LFG had a balance of roughly 6,983 BTC in October 2022, with transactions later moving funds to different addresses.</p>\n                    <p><p>An unknown party has moved more than $160 million worth of Bitcoin from a wallet reportedly tied to Luna Foundation Guard (LFG), the organization connected to Terraform Labs and its co-founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/do-kwon\">Do Kwon</a>.</p><p>According to a July 5 report, an individual or individuals <a href=\"https://www.digitalasset.works/news/articleView.html?idxno=3271\" target=\"_blank\" rel=\"noopener nofollow\">transferred</a> 5,292 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) from an LFG address to a wallet seemingly not associated with Terra on July 3 — the crypto was worth roughly $161 million at the time of publication. The transaction was the latest in a series of moves of <a href=\"https://cointelegraph.com/news/42-5k-btc-reportedly-moved-from-luna-foundation-guard-wallet-as-ust-peg-crumbles\">crypto assets from LFG-controlled wallets</a> amid and following the collapse of Terra in May 2022. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">        5,292 <a href=\"https://twitter.com/hashtag/BTC?src=hash&amp;ref_src=twsrc%5Etfw\">#BTC</a> (162,439,939 USD) transferred from unknown wallet to unknown wallet<a href=\"https://t.co/yVq6fde9yd\">https://t.co/yVq6fde9yd</a></p>&mdash; Whale Alert (@whale_alert) <a href=\"https://twitter.com/whale_alert/status/1675873686086139904?ref_src=twsrc%5Etfw\">July 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Blockchain data showed the reported LFG wallet <a href=\"https://blockchair.com/bitcoin/address/bc1qnfs8pxqjrqkccd7706sln0r70ekdf7nslgqxkz8aa0j9yfk2980slvvsyq\" target=\"_blank\" rel=\"noopener nofollow\">had</a> a balance of roughly 6,983 BTC in October 2022, with several transactions moving funds to different addresses over the last nine months. At the time of publication, the wallet had a balance of 0.152427 BTC, or roughly $4,649.</p><p>Other South Korean news outlets have <a href=\"https://www.blockmedia.co.kr/archives/261437\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> the sender’s wallet address was associated with LFG, but Cointelegraph was unable to independently confirm this claim. The organization was launched as part of attempts to stabilize the volatility of LUNA tokens by backing the project with TerraUSD — an approach that ultimately failed.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-argues-against-motion-to-dismiss-terraform-and-do-kwon-lawsuit\"><strong><em>SEC argues against Dentons’ motion to dismiss Terraform and Do Kwon’s lawsuit</em></strong></a></p><p>It’s unclear how much in digital assets Kwon or Terra individuals with access may have moved from Terra amid its collapse. The United States Securities and Exchange Commission <a href=\"https://cointelegraph.com/news/do-kwon-removed-10k-bitcoin-from-terra-after-collapse-takeaways-from-sec-complaint\">reported in February</a> that Kwon and Terra laundered more than $100 million worth of BTC, while in April South Korean prosecutors <a href=\"https://cointelegraph.com/news/do-kwon-converted-stolen-funds-from-luna-to-bitcoin-s-korean-prosecutors\">identified more than $314 million</a> — later freezing some of the assets — in crypto associated with Kwon and his associates.</p><p>Kwon, after reportedly being on the run for several months following Terra’s collapse, was arrested in Montenegro in March for allegedly using forged travel documents. In June, <a href=\"https://cointelegraph.com/news/do-kwon-sentenced-to-4-months-in-prison-in-montenegro-on-fake-passport-charges\">authorities sentenced him</a> and former Terra chief financial officer Han Chong-joon to four months in prison.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/hong-kong-crypto-exchanges-do-kwon-jail-korean-crypto-lenders-contagion-asia-express/\"><strong><em>Korean crypto contagion, Bank of China on Ethereum, HK’s exchange red carpet: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-05T18:56:05.000Z",
    "title": "Hut 8’s ESG report sheds light on sustainability efforts in the crypto industry",
    "url": "https://cryptoslate.com/hut-8s-esg-report-sheds-light-on-sustainability-efforts-in-the-crypto-industry/",
    "description": "<p>Hut 8 Mining Corp, one of North America&#8217;s largest digital asset miners, has recently published its 2022 Environmental, Social, and Governance (ESG) Report. The report, which aligns with the Sustainability Accounting Standards Board (SASB) and the Global Reporting Initiative (GRI), is a step in the crypto industry&#8217;s ongoing struggle with sustainability. The cryptocurrency industry has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/hut-8s-esg-report-sheds-light-on-sustainability-efforts-in-the-crypto-industry/\">Hut 8&#8217;s ESG report sheds light on sustainability efforts in the crypto industry</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T19:05:27.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T19:02:26.000Z",
    "title": "Binance CSO unravels the process of crypto theft on the darknet",
    "url": "https://www.cryptopolitan.com/binance-cso-unravels-process-crypto-theft/",
    "description": "In the murky depths of the dark web, a thriving ecosystem of hackers has set their sights on cryptocurrency users with lax security practices. Jimmy Su, the Binance CSO, a leading cryptocurrency exchange, revealed that hackers have shifted their attention to crypto end-users in recent years. While exchanges have bolstered their security measures, hackers adapt ... <a title=\"Binance CSO unravels the process of crypto theft on the darknet\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-cso-unravels-process-crypto-theft/\" aria-label=\"More on Binance CSO unravels the process of crypto theft on the darknet\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T18:59:57.000Z",
    "title": "Crypto trading had a blast in June – Here is a look at the numbers",
    "url": "https://www.cryptopolitan.com/crypto-trading-had-a-blast-in-june-numbers/",
    "description": "June was a significant month for the world of cryptocurrency. An interesting wave of optimism washed over the crypto market, bringing about a rise in crypto trading volumes and shedding some positive light after a period of uncertainty. A potent mix of increased activity by retail and institutional investors, high-profile filings for Bitcoin ETFs, and ... <a title=\"Crypto trading had a blast in June &#8211; Here is a look at the numbers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-trading-had-a-blast-in-june-numbers/\" aria-label=\"More on Crypto trading had a blast in June &#8211; Here is a look at the numbers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T18:55:14.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for a decoupling of on-chain and off-chain trading activity. There was evidence that, unlike traditional financial markets, cryptocurrency volatility is not associated with market downturns. Observers also noted that, after gaining widespread attention ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T18:45:22.000Z",
    "title": "Oracle Offers Free Certified Training for Cloud and AI to Drive Growth",
    "url": "https://www.cryptopolitan.com/oracle-offers-free-certified-ai-training/",
    "description": "Oracle (ORCL) has experienced robust growth in artificial intelligence (AI), contributing to its strong financial performance. The company recently announced its initiative to provide free worldwide training in Cloud and AI to support career advancement in high-demand areas such as AI and machine learning (ML). This move aims to meet the increasing demand for Oracle ... <a title=\"Oracle Offers Free Certified Training for Cloud and AI to Drive Growth\" class=\"read-more\" href=\"https://www.cryptopolitan.com/oracle-offers-free-certified-ai-training/\" aria-label=\"More on Oracle Offers Free Certified Training for Cloud and AI to Drive Growth\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T18:44:59.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? Today&#8217;s live Aave price is $75.02, with a 24-hour trading volume of $185,398,474. Aave is down 4.25% in the last 24 hours. The current CoinMarketCap ranking is #40, with a live market cap of $1,085,261,720. It has a circulating supply of 14,466,908 AAVE coins and ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-05T19:00:14.000Z",
    "title": "Crypto Market Trade Volume Hits Lowest Point Since 2020 Amid Market Turbulence",
    "url": "https://www.newsbtc.com/news/crypto-trade-volume-hits-lowest-point-amid-turbulence/",
    "description": "In recent months, the crypto markets have witnessed significant turbulence leading to the lowest quarterly trade volume since 2020. Amid varying economic factors, a bearish perception of investors toward cryptocurrencies and the broader economic climate reflects a dynamic yet challenging landscape. Kaiko, a crypto market data provider, shed light on this development alongside various key industry trends. Despite the lowered trade volumes, the crypto industry concluded the quarter positively, demonstrating resilience. Challenges Faced By TrueUSD And Impact On Crypto Market Prime Trust, the crypto custodian of TrueUSD (TUSD), has encountered financial difficulties, placing the stablecoin under scrutiny. The custodian&#8217;s financial shortfall, amounting to approximately $82 million, led to significant challenges, with customers unable to execute withdrawals. Related Reading: Crypto Market Cap Poised For Breakout: Analyst Predict 23% Upside Potential The challenges also included considerable sales pressure on TrueUSD on decentralized exchanges after the disclosure that True USD&#8217;s present auditing firm is a restructured version of FTX&#8217;s auditor. However, despite the selling pressure on decentralized exchanges, the price of TUSD remained around $0.999. Kaiko revealed that the potential liquidation of Prime Trust&#8217;s holdings could significantly impact the token&#8217;s price due to the holdings&#8217; scale.  Mixed Performances And Emerging Trends In the realm of performance, the second quarter witnessed a drop in the open interest for altcoins. Layer 2 tokens, which had initially reported gains in the first quarter, experienced a reduction ranging from 20% to 40% during Q2, according to Kaiko. On the flip side, DeFi tokens wrapped up the quarter marking a decline of 8%, yet picked up steam in June, largely fueled by the rise of tokens like MakerDAO&#8217;s MKR and Compound&#8217;s COMP. COMP experienced a boost of over 50% as large-scale investors in Binance intensified their purchasing activities. Kaiko further revealed that the Korean won (KRW)-denominated trade volume surpassed USD in the quarter&#8217;s final week, primarily spurred by WAVES and Bitcoin Cash (BCH). The spike in volume was largely attributed to WAVES&#8217; price jump after securing support from DWF Labs, while Bitcoin Cash (BCH) saw a massive rise following its listing on EDX Markets. Related Reading: Bitcoin Cash (BCH) Up 55% Following BlackRock’s ETF Application, EDX Markets Launch Meanwhile, EUR-denominated volume on centralized exchanges recorded a two-year low since the crypto bull run in late 2020. This trend indicates a shift in European market sentiment, adding to the quarter&#8217;s varied developments. Regardless, the crypto market has shown recovery from its bloodbath last year. Over the last 7 months, the crypto market has grown compared to the bearish trend seen all through 2022. Both small caps and Larger crypto assets such as Bitcoin (BTC) and Ethereum (ETH) have broken multiple resistance surpassing important levels. Bitcoin has recently traded above $31,000 before retracing below $30,427 at the time of writing. Ethereum, on the other hand, has also surged and trades above the $1,900 mark and now looking to break past the $2,000 region. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-05T18:45:03.000Z",
    "title": "Revolut Drops Solana (SOL), Cardano (ADA) and Polygon (MATIC) Amid Regulatory Crackdown: Report",
    "url": "https://dailyhodl.com/2023/07/05/revolut-drops-solana-sol-cardano-ada-and-polygon-matic-amid-regulatory-crackdown-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/revolut-drops-sol-ada.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/revolut-drops-sol-ada.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/revolut-drops-sol-ada.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/revolut-drops-sol-ada.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/revolut-drops-sol-ada.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/revolut-drops-sol-ada.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/revolut-drops-sol-ada.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Financial app Revolut is no longer allowing US customers to trade Solana (SOL), Cardano (ADA) and Polygon (MATIC). According to a new Bloomberg report, the United Kingdom (UK) company is delisting the three altcoins after its provider Bakkt, the digital asset marketplace, announced in June it was removing support for the tokens until there is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/05/revolut-drops-solana-sol-cardano-ada-and-polygon-matic-amid-regulatory-crackdown-report/\">Revolut Drops Solana (SOL), Cardano (ADA) and Polygon (MATIC) Amid Regulatory Crackdown: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-05T18:41:12.000Z",
    "title": "Saxo Bank Ordered To Get Rid of All Crypto Asset Holdings by Danish Regulators",
    "url": "https://dailyhodl.com/2023/07/05/saxo-bank-ordered-to-get-rid-of-all-crypto-asset-holdings-by-danish-regulators/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/us-regulators-spot-markets.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/us-regulators-spot-markets.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/us-regulators-spot-markets.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/us-regulators-spot-markets.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/us-regulators-spot-markets.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/us-regulators-spot-markets.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/us-regulators-spot-markets.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Danish authorities are ordering an $11 billion investment bank to get rid of its digital asset holdings after deeming the firm’s trading activities unlawful. According to a new press release by The Danish Financial Supervisory Authority, Saxo bank must dispose of its crypto assets in adherence to the regulator&#8217;s declaration that local banks are not [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/05/saxo-bank-ordered-to-get-rid-of-all-crypto-asset-holdings-by-danish-regulators/\">Saxo Bank Ordered To Get Rid of All Crypto Asset Holdings by Danish Regulators</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]