[
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T17:28:54.000Z",
    "title": "Belgian financial regulator orders Binance to cease all virtual currency services",
    "url": "https://cointelegraph.com/news/belgian-financial-regulator-orders-binance-cease-virtual-currency-services",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/1e90ca22-21f4-46e2-8a56-1383f9ecd9f0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The regulator said Binance must cease “with immediate effect” all crypto-related services in Belgium after being unable to provide sufficient information on its non-EEA companies.</p>\n                    <p><p>The Belgian Financial Services and Markets Authority (FSMA) has ordered major cryptocurrency exchange Binance to stop offering crypto exchange and custody wallet services. </p><p>In a June 23 notice, the FSMA <a href=\"https://www.fsma.be/en/news/fsma-orders-binance-cease-immediately-all-offers-virtual-currency-services-belgium\" target=\"_blank\" rel=\"noopener nofollow\">said</a> that by Binance offering crypto-related services “from countries that are not members of the European Economic Area,” the exchange was violating Belgian laws on anti-money laundering (AML) and combating the financing of terrorism (CFT). The financial regulator said Binance must cease “with immediate effect” all related services in Belgium.</p><p>According to the FSMA, Binance controlled an estimated 19 companies outside of the European Economic Area — EU nations as well as Iceland, Liechtenstein and Norway — involved in its operations or technical support that did not appear in the terms and conditions Belgium users read when signing up for services. The regulator said it had made “several requests for information” from Binance, but did not receive satisfactory answers identifying the services its companies provided.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/belgian-fsma-surveys-crypto-investors-before-taking-on-new-ad-regulation-authority\"><strong><em>Belgian FSMA surveys crypto investors before taking on new ad regulation authority</em></strong></a></p><p>“In spite of the opportunities offered to Binance on several occasions, the latter has failed to demonstrate, with due documentation and proof, that the exchange services between virtual currencies and legal currencies and the custody wallet services that it offers and provides within Belgium are carried out by means of a legal entity governed by the law of another member state of the European Economic Area that is duly authorized by its home member state to carry out these activities, including within Belgium,” said the FSMA.</p><p>As part of the order, Binance will be required to contact all its Belgium-based clients and return all crypto and private keys the exchange held. The FSMA is just one of several national regulators taking action against Binance, as the United States Securities and Exchange Commission is currently <a href=\"https://cointelegraph.com/news/binance-cz-allege-sec-made-misleading-statements-assets\">pursuing a lawsuit</a> against the exchange and its U.S. entity for alleged violations of securities laws.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/binance-humilated-on-china-tv-hong-kong-100k-crypto-workers-chinese-ai-unicorn-asia-express/\"><strong><em>Binance humiliated, HK needs 100K crypto workers, China’s AI unicorn: Asia Express</em></strong></a></p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-23T17:12:15.000Z",
    "title": "XRP (XRP/USD) Price Analysis – 23 June 2023: Technical Indicators Giving ‘Buy’ Signal",
    "url": "https://www.cryptoglobe.com/latest/2023/06/xrp-xrp-usd-price-analysis-23-june-2023-technical-indicators-giving-buy-signal/",
    "description": "Introduction This report provides a comprehensive analysis of XRP (XRP) for 23 June 2023. The data includes real-time price, volume, bid/ask, day’s range, technical indicators, and moving averages. Price and Volume Overview As of 4:50 p.m. UTC on 23 June 2023, on Binance, XRP is trading at $0.49630, up by $0.00290 (+0.59%) from its previous […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-23T17:30:00.000Z",
    "title": "The Future is Now Film Premieres “Saving The Future: Eyes on Africa”",
    "url": "https://cryptodaily.co.uk/2023/06/the-future-is-now-film-premieres-saving-the-future-eyes-on-africa",
    "description": "<p>&lsquo;The Future is Now Film&rsquo; has been enlightening its audience over the past 5 years showcasing the amazing feats that blockchain technology has endured and overcome. Even in such a short time, it&rsquo;s now clear just how revolutionary cryptocurrencies and blockchain technology have come out to be. Starting in the 1990&rsquo;s with the internet of information, slowly moving into the Internet of Things throughout the early 2010&rsquo;s, we&rsquo;re now witnessing the era of the Internet of Value.&nbsp;</p>\n<p></p>\n<p>This is a concept that is not only unique, with everyone having access to a growing digital market, but also one that offers a fair chance to create and store money in ways never before seen. In many countries that didn&rsquo;t have access to a central banking system, let alone broadband due to corruption and other factors, we are now seeing communities prosper thanks to the introduction of crypto banking systems and blockchain technology integrated within their infrastructure.</p>\nAfrica and the Future of Crypto\n<p>Probably one of the most prevalent examples of blockchain being successfully integrated into a region&rsquo;s infrastructure would relate to Sandi Bitenc &ndash;&nbsp;an individual at the forefront of change within Africa. Sandi is the founder of 3air, a telecom and blockchain company&nbsp; whose mission is to give access to the internet even to the most underserved communities. In Sierra Leone, 3air has already built two base stations capable of serving around 90% of the city, finally enabling access to broadband for thousands of people. 3air also provides the use of its cryptocurrency token as a means to pay and get paid for redistributing its unique broadband connectivity within its ecosystem, allowing people in Sierra Leone to embark further in crypto mass adoption.</p>\n<p>Africa is the largest adopter of cryptocurrency, largely thanks to the underlying need for such a technology. Many banks throughout Africa simply didn&rsquo;t have the structure or resources to hold dollar reserves, the typical international currency for trade, meaning it was a useless tender when trading as most citizens just didn&rsquo;t have access to it.&nbsp;</p>\n<p>Nearly all countries hold their reserves in foreign banks which are subject to laws out of their control. We have seen Africa torn apart for centuries with natural resources being drained, purposely being deprived of basic educational and technological needs which could have easily been shared, drastically improving the quality of life. Let's take a look at some of the innovators who are already injecting this technology into Africa and beyond.</p>\nTheFutureIsNowFIlm &ndash; Queen Diambi\n<p>Queen Diambi of the Bakwa Luntu tribe of Central Kasa&iuml; in the historic Kingdom of Luba (Congo) is making headlines with Africa and their adoption of cryptocurrency. She is travelling the world and spreading the word in the pursuit of making Africa great again. Queen Diambi is driven by the goal of bringing African technology and sciences to the level that they once were in the distant past, where the African nation was much more advanced than traditional history books would deem to say.</p>\n<p></p>\nTheFutureIsNowFilm &ndash;&nbsp;Revoland Game\n<p>Already making waves in both the educational and financial sectors, Jimmy Zhao first introduced Revoland to Africa as a growing market. ChainXGame was responsible for teaching users in Ethiopia about gaming but under a Play-2-Earn model. This meant that individuals were able to earn crypto while playing and learning the fundamentals about GameFi as a future means for their economic well being, let&rsquo;s remember the Axie Infinity and the Philippines use case. Cultivating this kind of access for Africans is fundamental in moving into a fairer financial community where everyone can create value, together.</p>\n<p>TheFutureIsNowFilm &ndash; Ikigai Ventures</p>\n<p>Ikigai Ventures are all about supporting companies who can benefit all of us &ndash; companies who are striving for positive social change and a good ESG strategy. As Eman Pulis puts it, if you love what you do and it rewards you well, while being great for society, you have found your ikigai, a Japanese word that cannot be translated to English. Through AIBC Summit which also belongs to Eman, the man who once named himself &ldquo;Just an events guy&rdquo; to now a full fledged Web3 start up fund, has now created access to incredible deal flow in the industry.&nbsp;</p>\nTheFutureIsNowFilm &ndash; Oz Living\n<p>Devoted to financial freedom, Oz Living is providing services for individuals and their families to gain full control over their assets while also helping them reduce taxes. Their mission being a world where people live life on their own terms. The Oz eco-zone is currently being pioneered with the permission of the Philippines Government that is allowing Jin Gonzalez, the founder, to create a portable and tax-free zone for its citizens who wish to relocate, gain citizenship and experience living in the world of Oz.</p>\nTheFutureIsNowFilm &ndash; Acta Finance\n<p>Acta Finance ecosystem is looking to combine new and already existing centralised passive-earning principles and bring them on-chain. Christof Waton considers this really a great example of out with the old and in with the new as the company rewards their growing ecosystem creating a cross-platform and friendly community for all to experience the power of DeFi.&nbsp;</p>\nWeb3 Shareholders\n<p>Web3 revolutionises the way we interact with the internet. Web2, the current incarnation of our internet, and its websites are typically controlled via a central entity meaning, the company that owns that site decides where one&rsquo;s data is stored, what they can actively do with your data while also taking responsibility for preventing data breaches and hacks. In Web3, every user is a shareholder building communities, not businesses. The Internet of Value works towards educating and rewarding those who wish to build the foundations for the new digital world.</p>\n<p>People are tired of a broken system that shows failure every other decade as seen with the most recent USD inflation rates. Africa is by far the largest adopter of crypto and is a leading example of how to start implementing the use of blockchain technology into a countries ecosystem while Dubai is the world leader in education on the blockchain as well as a host to many prestigious events in the field focusing on the MENA region&rsquo;s development and beyond.</p>\nAIBC Summit Eurasia\n<p>The private screening and film premiere was held at AIBC Summit Eurasia in Dubai March 2023 at the Awards Gala Dinner organised by Eman Pulis and SiGMA Group. The film starred Queen Diambi of Congo, Nick Spanos from \"Banking on Bitcoin'', Ivan on Tech, Eman Pulis from SiGMA &amp; Ikigai Ventures, Sandi Bitenc of 3air, Jin Gonzalez of Oz Living, Christof Waton of ACTA Finance, Jimmy Zhao of Revoland and even a cameo of Akon, the world renowned celebrity singer and artist who is also creating Web3 ripples in Africa with his Akoin Foundation.&nbsp;</p>\n<p>The Gala Dinner and Awards show has become an industry staple since the inception of AIBC back in Malta 2018, then known as the Malta Blockchain Summit, bringing together professionals from all continents. The AIBC Gala in its 5 year history has awarded prominent decentralised futurists like Roger Ver, Brock Pierce &amp; Bobby Lee to name a few. Having #TheFutureisNowFilm premiere at this event in its 2023 reiteration marked The Future is Now DAO's full move and relocation to Dubai as well as a chance for the cr&egrave;me de la cr&egrave;me community of Web3 to get acquainted with this film series which has been covering Bitcoin's disruption across the world. As a matter of fact the 5th episode of TFINFILM, which is the film&rsquo;s Twitter handle, was the first AIBC Summit in 2018 established by Eman Pulis &amp; SiGMA Group, which back then was branded as the Malta Blockchain Summit and held in Portomaso, Malta. That episode features the late John McAfee, the founder of McAfee anti-virus and the scandalous yet powerful figure in the world of decentralisation.&nbsp;</p>\n<p>Miguel Francis-Santiago, the film's creator &amp; host, also the Founder of TFIN DAO, confirmed that its time for the platform to go global and has secured a partnership with a 30 year VP of Distribution veteran from Hollywood who has led distribution in giants like Vivendi Universal, Paramount &amp; Hulu. Francis-Santiago believes this partnership is key to having 'The Future is Now Film' finally take on platforms like Netflix &amp; Amazon Prime.</p>\nFinal Thoughts\n<p>It&rsquo;s time to get excited about Web3 and the blockchain. Users finally have the opportunity not just to build their own future but contribute to the future being built around them. This trend is becoming even more apparent as we begin to observe the social shift away from centralization and more into the world of a decentralised and equally balanced networks of value creation and knowledge.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T17:18:27.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-23T17:28:57.000Z",
    "title": "Bitcoin surpasses $31k for the first time since April",
    "url": "https://crypto.news/bitcoin-surpasses-31k-for-the-first-time-since-april/",
    "description": "Bitcoin surpassed the $31,000 mark, with investor optimism fueled by the anticipation of spot bitcoin exchange-traded funds."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T17:19:39.000Z",
    "title": "Solana: SOL-Based Crypto Platform Takes Off with Fixed-Rate Term Lending",
    "url": "https://www.crypto-news-flash.com/solana-sol-based-crypto-platform-takes-off-with-fixed-rate-term-lending/?utm_source=rss&utm_medium=rss&utm_campaign=solana-sol-based-crypto-platform-takes-off-with-fixed-rate-term-lending",
    "description": "The Jet protocol has facilitated approximately $38.58 in borrowed assets through the Solana network already. Solana network has dozens of lending protocols including Port Finance, Larix, Solend, and MarginFi, among others. The Solana (SOL) network, the only blockchain ecosystem with a functional smartphone dubbed Saga mobile, has attracted significant attention from regulators, developers, and users [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T17:17:38.000Z",
    "title": "The Power Of Crypto Communities: Dogecoin, ApeCoin & Caged Beasts",
    "url": "https://www.crypto-news-flash.com/the-power-of-crypto-communities-dogecoin-apecoin-caged-beasts/?utm_source=rss&utm_medium=rss&utm_campaign=the-power-of-crypto-communities-dogecoin-apecoin-caged-beasts",
    "description": "In the vast and ever-evolving realm of cryptocurrencies, one undeniable factor contributes to the success and growth of projects: community. The power of a strong and engaged community cannot be overstated. In this article, we delve into the importance of community in the crypto world, with a particular focus on the referral scheme of Caged [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-23T17:27:00.000Z",
    "title": "Coinbase Survey Reveals 83% of Fortune 500 Firms Plan Web3 Initiatives",
    "url": "https://coinedition.com/coinbase-survey-reveals-83-of-fortune-500-firms-plan-web3-initiatives/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Coinbase Survey Reveals Fortune 500 Firms\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase-Survey-Reveals-Fortune-500-Firms-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto exchange giant Coinbase released research conducted in partnership with The Block. In the study, it was revealed that over half, that is, 52% of the Fortune 100 companies, have been involved in crypto, blockchain, or web3 initiatives since the beginning of 2020. According to the blog posted by the exchange, out of the initiatives [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbase-survey-reveals-83-of-fortune-500-firms-plan-web3-initiatives/\">Coinbase Survey Reveals 83% of Fortune 500 Firms Plan Web3 Initiatives</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]