[
  {
    "source": "Decrypt",
    "date": "2024-01-02T15:59:39.000Z",
    "title": "Bitcoin Still Soaring on ETF Hype as $133 Million in Shorts Liquidated",
    "url": "https://decrypt.co/211442/bitcoin-soaring-etf-hype-133-million-shorts-liquidated",
    "description": "Bitcoin has gained 7% in the past day and ORDI, the biggest token built on the BRC-20 standard, is still rising."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-02T15:51:49.000Z",
    "title": "Bitcoin’s rise to $45k propels crypto stocks to robust year opening",
    "url": "https://cryptoslate.com/bitcoins-rise-to-45k-propels-crypto-stocks-to-robust-year-opening/",
    "description": "<p>Major crypto-centric firms are off to a robust start in the new year, marked by significant market trading upticks in their shares amid Bitcoin&#8217;s rally above $45,000. According to Yahoo Finance data, leading crypto companies like Coinbase, MicroStrategy, Marathon Digital, Riot Platforms, Hive Digital, Canaan, and Hut 8 witnessed considerable price growth during the early [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoins-rise-to-45k-propels-crypto-stocks-to-robust-year-opening/\">Bitcoin&#8217;s rise to $45k propels crypto stocks to robust year opening</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-02T16:00:32.000Z",
    "title": "Dogecoin Is Bullish? Crypto Analyst Gives Reasons Why Investors Should Pay Attention",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-is-bullish-crypto-analyst/",
    "description": "Crypto analyst Jaydee has made a bullish case for Dogecoin (DOGE) as he outlined several reasons why a significant price breakout may be on the horizon for the foremost meme coin. DOGE’s price saw a 370x gain the last time the indicators Jaydee highlighted materialized.  Why Crypto Investors Should Pay Attention To DOGE In a post on his X (formerly Twitter) platform, Jaydee noted three things that usually happen on the charts prior to DOGE experiencing a price breakout. The first indicator he mentioned was the Moving Average Convergence Divergence (MACD). According to him, There is always a MACD bullish cross before DOGE sees a parabolic move. Related Reading: XRP Price Surge: Crypto Analyst Predicts Various Bullish Scenarios In The Coming Days Source: X If so, then the Dogecoin rally may happen soon enough, as the crypto analyst mentioned that this indicator has been checked, suggesting that the bullish cross already happened. The second indicator he highlighted was the Average Sentiment Oscillator (ASO). There is usually an ASO cross before the meme coin makes a significant move to the upside. However, unlike the MACD bullish cross, which seems to have already happened, this indicator is yet to materialize, as Jaydee stated that he is still awaiting this. This indicator looks like the only thing that is holding the potential DOGE breakout since the last and third indicator the crypto analyst referenced has already been “checked,” too. This third indicator is DOGE’s price breaking out of its multi-year trendline. From the accompanying chart, which the analyst shared, DOGE saw parabolic moves in 2017 and 2021 when this happened. 2021 also happened to be the year that the meme coin rose to its all-time high of $0.7. With a parabolic move on the horizon, Jaydee remarked that he will be paying attention to DOGE for the next months. Everything seems to be pointing to a bullish move for the meme coin, as the crypto analyst also stated that DOGE’s “chart structure is amazing.” DOGE bulls gaining control &#124; Source: DOGEUSD On Tradingview.com A DOGE Rally Is Long Overdue DOGE’s price has been pretty tepid for a while as it continues to trade around the $0.09 price range. This shows that the meme coin is long overdue for a massive rally. That could happen soon as some price predictions hinted that 2024 was going to be a massive year for the crypto token.  Related Reading: Tellor (TRB) Leaves Market In Shock With 75% Price Crash, Here’s What Happened Crypto analyst Captain Faibik, in particular, had predicted that DOGE would see an “epic pump” this year that would see it revisit its all-time high. A move of such magnitude means that the crypto token could see a massive gain of 900%  Meanwhile, Dogecoin is still on course to head to the moon as the ULA’s Vulcan Centaur Rocket, which would be carrying a physical Dogecoin, is scheduled for launch on January 8. Such development could potentially spark a surge in the crypto token’s price upon takeoff.  At the time of writing, Dogecoin is trading at around $0.09286, up over 3% in the last 24 hours, according to data from CoinMarketCap.  Featured image from Bankrate, chart from Tradingview.com"
  }
]