[
  {
    "source": "Cointelegraph",
    "date": "2023-11-16T17:15:00.000Z",
    "title": "Aave Companies rebrands to Avara, acquires Ethereum self-custody ‘Family Wallet’",
    "url": "http://cointelegraph.com/news/aave-rebrands-to-avara-acquires-ethereum-self-custody-wallet-family",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/9bee2b71-94ed-4915-a540-baf2859c951d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Liquidity protocol Aave’s parent company has been rebranded to Avara as it looks to streamline its suite of infrastructure products to attract a broader Web3 user base.</p>\n                    <p><p>Decentralized finance (DeFi) group Aave Companies has been rebranded to Avara as it looks to broaden its user base across the Web3 ecosystem.</p><p>Stani Kulechov, founder and CEO of Avara (formerly Aave Companies), tells Cointelegraph that the company’s growing number of offerings, including liquidity protocol Aave, the GHO stablecoin, Lens Protocol and Sonar, necessitated an umbrella brand with broader Web3 appeal. </p><blockquote>“We will continue to innovate in DeFi and build tools for developers while creating new, intuitive and compelling products that attract mainstream people”</blockquote><p>Kulechov adds that the broader industry has focused on building infrastructure to enable the development of products that appeal to a wide user base. The rebrand marks the beginning “of a new era” where blockchain technology becomes more “accessible, usable and fun.”</p><p>The Avara founder adds that the company’s new identity is inspired by the Finnish word “Avara,” which carries a number of definitions, including “extensive,” “open,” “spacious” and “inclusive.” Its colloquial use means “seeing more than you see.”</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/web3-userbase-could-power-new-dapp-development\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/web3-userbase-could-power-new-dapp-development/amp\">Shared Web3 user base could power new social app integrations — Aave CEO</a></em></strong></p><p>Kulechov also notes that liquidity protocol Aave will continue under the same brand name through Aave Labs and continue its focus on contributing to technological innovations within the DeFi landscape.</p><p>The rebrand announcement coincides with the acquisition of Los Feliz Engineering (LFE) and its flagship self-custodial Ethereum wallet, Family Wallet. The strategic deal means that Avara’s product suite now encompasses a consumer wallet allowing users to send, receive, swap and hold cryptocurrencies.</p><p>The acquisition also includes ConnectKit, a developer library built by Family Wallet to facilitate connectivity between the wallet service and decentralized applications. LFE’s team, including its CEO and founder Benji Taylor, will join Avara. Taylor takes up the role of senior vice president of product and design. </p><p>Avara hopes to tap into LFE’s experience building the messaging application Honk to continue the development of Lens Protocol. As Cointelegraph reported, the latter aims to be a social layer for the wider Web3 ecosystem, connecting users across a decentralized social networking environment and providing developer tools to build applications and communities.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/slumdog-billionaire-incredible-rags-riches-tale-polygon-sandeep-nailwal/\">Slumdog billionaire: Incredible rags-to-riches tale of Polygon’s Sandeep Nailwal</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-16T17:20:12.000Z",
    "title": "Pyth Network sets retroactive airdrop for Nov. 20",
    "url": "https://cryptoslate.com/pyth-network-sets-retroactive-airdrop-for-nov-20/",
    "description": "<p>Pyth Network, a decentralized data oracle platform for blockchains, has scheduled its retrospective airdrop for Nov. 20. Airdrop According to available information, the PYTH token will have a total supply of 10 billion tokens with an initial circulating supply of 1.5 billion. Pyth Network has earmarked almost 6% of the total tokens, or 600 million [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/pyth-network-sets-retroactive-airdrop-for-nov-20/\">Pyth Network sets retroactive airdrop for Nov. 20</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-16T17:29:45.000Z",
    "title": "Dream track transforms YouTube shorts for content creators",
    "url": "https://www.cryptopolitan.com/dream-track-transforms-youtube-shorts/",
    "description": "In a groundbreaking collaboration between Google DeepMind and YouTube, the tech giants have unveiled Dream Track, an AI-powered music creation tool set to transform the world of YouTube Shorts. This innovative tool leverages the capabilities of Google&#8217;s Lyria music generation model to empower creators to effortlessly generate unique and high-quality soundtracks for their short video ... <a title=\"Dream track transforms YouTube shorts for content creators\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dream-track-transforms-youtube-shorts/\" aria-label=\"More on Dream track transforms YouTube shorts for content creators\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-16T17:20:39.000Z",
    "title": "Microsoft’s cutting-edge chips set to transform AI landscape",
    "url": "https://www.cryptopolitan.com/microsofts-cutting-edge-chips-set-transform/",
    "description": "Microsoft is taking a significant stride in the realm of artificial intelligence (AI) by introducing its own homegrown AI semiconductors for its cloud infrastructure. In a recent announcement, the tech giant unveiled two new chips, named Azure Maia 100 and Cobalt 100, designed to bolster its cloud computing capabilities and enhance AI applications. The Azure ... <a title=\"Microsoft&#8217;s cutting-edge chips set to transform AI landscape\" class=\"read-more\" href=\"https://www.cryptopolitan.com/microsofts-cutting-edge-chips-set-transform/\" aria-label=\"More on Microsoft&#8217;s cutting-edge chips set to transform AI landscape\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-16T17:13:00.000Z",
    "title": "Do Kwon faces major setbacks in Montenegro",
    "url": "https://www.cryptopolitan.com/do-kwon-faces-major-setbacks-in-montenegro/",
    "description": "The Terraform Labs founder. Do Kwon, has been sentenced to four months in prison as he faces extradition based on compliance with his sentence. The case comes in as an addition to various court cases that have been raised and caused a change in the crypto space, including cases such as the XRP legal battle ... <a title=\"Do Kwon faces major setbacks in Montenegro\" class=\"read-more\" href=\"https://www.cryptopolitan.com/do-kwon-faces-major-setbacks-in-montenegro/\" aria-label=\"More on Do Kwon faces major setbacks in Montenegro\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-16T17:33:29.000Z",
    "title": "Singapore’s Central Bank to pilot live CBDC for interbank settlements",
    "url": "https://crypto.news/singapores-central-bank-to-pilot-live-cbdc-for-interbank-settlements/",
    "description": "The Monetary Authority of Singapore (MAS) is set to launch a live pilot of a CBDC for wholesale interbank settlements, marking a significant step in the integration of digital currencies into mainstream banking operations."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-16T17:30:57.000Z",
    "title": "Shiba Inu Price Prediction: Analyst Forecast 2X By Mid-December",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-price-prediction-analyst-forecast-2x-by-mid-december/",
    "description": "Popular cryptocurrency market analyst Captain Faibik has recently shed more light on his predictions toward the price of Shiba Inu (SHIB) and revealed where the cryptocurrency ought to be by mid-December.  Crypto Analyst Optimism On Shiba Inu The crypto analyst took to his official X (formerly Twitter) handle to share his projections on the price movement of Shiba Inu. According to the analyst&#8217;s post and token chart, SHIB has crossed a trendline near the $0.00000839 price level. Due to this data, the analyst believes the crypto asset is going through a significant retest. Captain further highlighted that if the retest is prosperous, the token might experience a bullish rally of up to 2X by mid-December. SHIB has broken out of a Major Trendline and is currently undergoing a Retest. If the retest is successful, we might witness a Bullish Rally up to 2x by mid-December.  Additionally, the analyst highlighted that the 2X price surge could take the token as high as $0.00001678. Nonetheless, a careful look at the chart on the X post reveals just how difficult it will be for this retest to succeed.  Related Reading: Dogecoin Vs. Shiba Inu: Which Meme Coin Is More Profitable For Holders? So far, Shiba Inu&#8217;s price has exceeded the $0.000016 threshold just once since May 2022. This was during a brief spike that occurred in August 2022. Also, the crypto asset price growth has not been as impressive as other altcoins. Shiba Inu&#8217;s year-to-date (YTD) price growth is up 4.97%. However, SHIB is currently trading at $0.0000086, up by 22% over the last 24 hours, which suggests a more optimistic outlook. Its market capitalization is approximately $5.2 billion, with a trading volume of $162 million over the past 24 hours. The crypto market analyst&#8217;s predictions were fueled by Shiba Inu&#8217;s grit, which has enabled it to regain its brilliance in the face of numerous obstacles. His predictions seem to have sparked increased confidence in the Shiba Inu community. Algorithm Prediction Of The Crypto’s Price By December Captain Faibik&#8217;s shared one of the other predictions for Shiba Inu&#8217;s price by December. Recently, price algorithm prediction from crypto analytics firm CoinCodex has also predicted a bullish outlook for the token by December. According to the forecast, Shiba Inu&#8217;s price will hit $0.0000095 by December 11, indicating a 10% increase from its price as of the time of prediction. Its prediction becomes more likely to come true, given the possibility of additional whales and regular investors joining the token market. The projections also highlighted about 4 technical analysis indicators that suggest bearish conditions, while about 24 indicate optimistic signs. Additionally, the token&#8217;s current RSI value of 63.05 is neither overbought nor oversold, according to the prediction. Related Reading: Shiba Inu Burn Rate Flatlines With 99.35% Drop, Here’s Why Featured image from iShock, chart by Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-16T17:36:56.000Z",
    "title": "Positive Market Outlook: An In-Depth Analysis of Fantom (FTM), Cosmos (ATOM), and VC Spectra (SPCT)",
    "url": "https://www.crypto-news-flash.com/positive-market-outlook-an-in-depth-analysis-of-fantom-ftm-cosmos-atom-and-vc-spectra-spct/?utm_source=rss&utm_medium=rss&utm_campaign=positive-market-outlook-an-in-depth-analysis-of-fantom-ftm-cosmos-atom-and-vc-spectra-spct",
    "description": "<img width=\"1218\" height=\"703\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/VC.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/VC.png 1218w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/VC-300x173.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/VC-1024x591.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/VC-768x443.png 768w\" sizes=\"(max-width: 1218px) 100vw, 1218px\" />Fantom (FTM) announces upgrade as the blockchain suffers a security breach. Cosmos (ATOM) is expanding. Meanwhile, VC Spectra (SPCT) has surged again. How did Fantom price react to the exploit? What are the new developments in Cosmos (ATOM)? And how high can VC Spectra (SPCT) get? Let’s find out. &#62;&#62;BUY SPCT TOKENS NOW&#60;&#60; Fantom Price [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-16T17:35:48.000Z",
    "title": "Cardano’s ADA Rockets: 20% Surge Beckons as Volume Hits Record High",
    "url": "https://www.crypto-news-flash.com/cardanos-ada-rockets-20-surge-beckons-as-volume-hits-record-high-2/?utm_source=rss&utm_medium=rss&utm_campaign=cardanos-ada-rockets-20-surge-beckons-as-volume-hits-record-high-2",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-29-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-29-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-29-1-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cardano (Ada) predicted to make a 20 percent surge from the current price according to analysts. According to the analysts, the 50-day and 100-day moving averages are above the neutral levels, indicating a bullish signal. In the ongoing rally, a few altcoins have re-announced their presence in the crypto ecosystem as Cardano (Ada) makes an [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-16T17:33:24.000Z",
    "title": "Key Insights for Investors: Solana’s Growth Driven by Major Partnerships; Focus on Emerging Promising Coin",
    "url": "https://www.crypto-news-flash.com/key-insights-for-investors-solanas-growth-driven-by-major-partnerships-focus-on-emerging-promising-coin/?utm_source=rss&utm_medium=rss&utm_campaign=key-insights-for-investors-solanas-growth-driven-by-major-partnerships-focus-on-emerging-promising-coin",
    "description": "<img width=\"1214\" height=\"1208\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Unbenannt-8.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Unbenannt-8.png 1214w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Unbenannt-8-300x300.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Unbenannt-8-1024x1019.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Unbenannt-8-150x150.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Unbenannt-8-768x764.png 768w\" sizes=\"(max-width: 1214px) 100vw, 1214px\" />Solana (SOL) has gained prominence as one of the best altcoins to buy in 2023 due to the platform’s excellent strategic decisions. Meanwhile, many experienced traders have taken note of VC Spectra (SPCT) as one of the best new contenders in the broader crypto market, so let’s delve into detail and analyze which is the [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-16T17:22:00.000Z",
    "title": "FTM, UNI, ETH, SOL, MATIC on Analyst’s Top Picks for Coming ETF Storm",
    "url": "https://coinedition.com/ftm-uni-eth-sol-matic-on-analysts-top-picks-for-coming-etf-storm/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Several_of_the_largest_altcoins_show_undervaluation_when_combining.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTM, UNI, ETH, SOL, MATIC on Analyst’s Top Picks for Coming ETF Storm\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Several_of_the_largest_altcoins_show_undervaluation_when_combining.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Several_of_the_largest_altcoins_show_undervaluation_when_combining-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Several_of_the_largest_altcoins_show_undervaluation_when_combining-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Several_of_the_largest_altcoins_show_undervaluation_when_combining-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Several_of_the_largest_altcoins_show_undervaluation_when_combining-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Several_of_the_largest_altcoins_show_undervaluation_when_combining-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Altcoin Daily, a prominent crypto YouTube channel, has shared a curated list of their top picks for crypto investment for proper positioning for a projected storm coming into the crypto market.&#160; In a recent video, Altcoin Daily urged crypto enthusiasts to buy Bitcoin, Ethereum, and certain altcoins, claiming approval of the pending Bitcoin spot ETF [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ftm-uni-eth-sol-matic-on-analysts-top-picks-for-coming-etf-storm/\">FTM, UNI, ETH, SOL, MATIC on Analyst’s Top Picks for Coming ETF Storm</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]