[
  {
    "source": "CoinDesk",
    "date": "2023-08-21T12:01:21.000Z",
    "title": "Crypto Analysts Split on Why Ether Outperformed Bitcoin During Last Week's Slide",
    "url": "https://www.coindesk.com/markets/2023/08/21/crypto-analysts-split-on-why-ether-outperformed-bitcoin-during-last-weeks-slide/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The ether-bitcoin ratio rose more than 2% past week in a gain that's inconsistent with its record of taking losses during bouts of risk aversion."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T11:48:57.000Z",
    "title": "Kenya forms parliamentary committee to investigate Worldcoin ",
    "url": "https://cointelegraph.com/news/kenya-investigate-worldcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/db1b6db7-4f9c-4910-8dd6-ddd4a6d60da7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The controversial crypto project’s launch has been marred into controversy and it's already facing investigations in nearly half a dozen countries. </p>\n                    <p><p>The <a href=\"https://cointelegraph.com/explained/what-is-worldcoin-and-how-does-it-help-preserve-world-id\">Worldcoin </a>cryptocurrency project has run into another roadblock, this time in Kenya where the government has formed a 15-member parliamentary committee to investigate the controversial asset.</p><p>The Kenyan government formed a 15-member parliamentary committee headed by Narok West MP Gabriel Tongoyo to look into the controversial crypto project, <a href=\"https://www.the-star.co.ke/news/realtime/2023-08-21-parliament-forms-committee-to-investigate-worldcoin-project/\" target=\"_blank\" rel=\"noopener nofollow\">reported </a>a local daily. The parliamentary committee has 42 days to investigate the project and submit its report to the House committee. </p><p>Cointelegraph reached out to the MP to get some insights into their concerns and case against Worldcoin but didn’t get a response by publishing time.</p><p>The parliamentary investigation into the crypto project comes nearly three weeks after <a href=\"https://cointelegraph.com/news/worldcoin-kenya-suspends-local-activities-of-worldcoin\">Kenya suspended Worldcoin's operations</a> after the project failed to comply with government orders to <a href=\"https://techcrunch.com/2023/08/15/worldcoin-in-kenya/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAACrKnljvUXKA0zpVKVOSghoM2gLBouDWSEjBa8cYefaKTspK0Jc4HhqQqyE3yz5973Z6wCyDLuHaqBf7yofTorzqGTu9K7Zc56YTwS8AaIJ775Y46wwbjlgPCcOHa95kVvoT1Rrv5XffRr-GpRcWmbmPXF-mBxX9hTONg41wNYnK\" target=\"_blank\" rel=\"noopener nofollow\">stop</a> scanning users' iris.</p><p>The Interior Cabinet Secretary Kindiki Kithure who has played a key role in suspending Worldcoin operations told the House committee that the government is concerned by Worldcoin's activities registrating citizens and collecting eyeball/iris data, all of which he claims pose serious security risks.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/worldcoin-launch-sparks-debate-over-data-privacy-and-future-of-ai\"><strong><em>Worldcoin launch sparks debate over data privacy and future of AI</em></strong></a></p><p>Apart from the parliamentary committee, the Worldcoin project has faced an all-out rejection from the various regulatory bodies in Kenya. The court also suspended Worldcoin’s activities after a case filed by the office of the data commissioner. The court ordered that the data already collected by Worldcoin between April last year and August 2023 must be preserved pending completion of the lawsuit.</p><p>Worldcoin, a digital ID-focused crypto project that offers its native cryptocurrency WLD coin for scanning the iris of users, <a href=\"https://cointelegraph.com/news/worldcoin-launches-token-to-distinguish-humans-from-bots\">launched amid controversies and hype</a>. The project onboarded nearly 2 million users during its trial phase. However, as the project launched for the public in more than a dozen countries, various reports of the project's controversial tactics surfaced, prompting governments in Nigeria, the UK, <a href=\"https://cointelegraph.com/news/argentine-agency-investigation-worldcoin-biometric-data\">Argentina</a>, <a href=\"https://cointelegraph.com/news/german-government-watchdog-launched-worldcoin-probe\">Germany</a> and Kenya to investigate the project.</p><p><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/moral-responsibility-how-blockchain-can-improve-ai-trustworthiness/\">‘Moral responsibility’: Can blockchain really improve trust in AI?</a></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-21T12:03:48.000Z",
    "title": "\n                        ETHWarsaw returns for its second edition alongside Warsaw Blockchain Week\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/ethwarsaw-returns-for-its-second-edition-alongside-warsaw-blockchain-week",
    "description": "\n                        <p>Warsaw, Poland, August 21st, 2023, Chainwire</p>\n<p>&nbsp;</p>\n<p>ETHWarsaw, a web3 conference and hackathon, organized by a passionate group of local Ethereum enthusiasts, returns for its second edition. The event is set to take place from August 31st to September 3rd, 2023 in Warsaw, Poland, bringing together a global community of builders, founders, and educators in web3.</p>\n<p>Building upon the achievements of its debut, the second edition of ETHWarsaw promises enhanced experience as it will coincide with the first in the history Warsaw Blockchain Week.&nbsp;</p>\n<p>&ldquo;Despite the backdrop of crypto&rsquo;s resurgence after a challenging year, we&rsquo;re ready to deliver an even more comprehensive experience for the global community traveling across the world to Poland. This year we&rsquo;re literally transforming Warsaw, a tech hub teeming with talent, into a hotbed of web3 action.&rdquo; said Lukasz Stoczynski, ETHWarsaw&rsquo;s Co-Founder, Business Development Lead.</p>\n<p>This collaborative initiative, set against the charming blend of tradition and modernity that defines Warsaw, promises community-organized side events, including conferences, networking meetups, and parties.&nbsp;</p>\n<p>The collective effort is poised to make this year&rsquo;s ETHWarsaw, for the second year in a row, the biggest web3 conference in the CEE region and Warsaw Blockchain Week the largest blockchain event ever held in Poland.</p>\n<p>ETHWarsaw is structured to cater to both seasoned professionals and curious newcomers including web2 developers and students. The conference spans two dynamic days of talks, panels and fireside chats divided into six key tracks: DeFi, Scalability, Security, Infrastructure, Governance, and Non-Tech.</p>\n<p>This year&rsquo;s speakers include Marius Van Der Wijden, Ethereum Foundation; Akram El Milligy, Ledger; Patrick McCorry, Arbitrum Foundation; Artis from Gitcoin, and Adam Gagol from Aleph Zero.</p>\n<p>Similarly to last year, the overnight hackathon will start on Friday evening and it will be a 48 hours marathon of non-stop building. There will be opportunities for teams and individuals to get hands-on, practical experience working with applications and advanced tools with ~$50,000 in value to be won from various competitions.</p>\n<p>ETHWarsaw&rsquo;s reputation as a hub for breakthroughs in the blockchain realm continues to be reinforced by the awe-inspiring success stories of projects born from the event. Antoni Zolciak, Co-founder of Aleph Zero, Ocean Sponsor of ETHWarsaw, explains: &ldquo;The brilliant team behind our recently launched ecosystem company, AZERO.ID, was formed after they emerged as victorious champions of the ETHWarsaw hackathon. This win led them to secure a grant, develop the platform&rsquo;s first version, and successfully close an oversubscribed pre-seed funding round. Their mainnet launch on Aleph Zero is just weeks away, marking an exciting beginning for AZERO.ID. We&rsquo;re excited for this year&rsquo;s hackathon during ETHWarsaw and have no doubt that this year&rsquo;s edition will not disappoint.&rdquo;&nbsp;</p>\n<p>Other ETHWarsaw returning sponsors include RedStone Oracles, Arweave, Octant, Scroll, IPOR. In addition, EthWarsaw secured support for the vol2 event from companies like Lukso, zkSync, Request Network, PROPERLY, Beamer Bridge, Mantle &amp; Chronicle.</p>\n<p>For more details about the event and to buy tickets for the conference and hackathon, visit: https://www.ethwarsaw.dev/</p>\n<p>Stay connected with ETHWarsaw:</p>\n<p>Twitter: @ETHWarsaw</p>\n<p>Telegram: ETHWarsaw Official</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-21T11:57:19.000Z",
    "title": "\n                        Islamic Coin Announces Token Sale & Appoints Republic As Web3 Advisor\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/islamic-coin-announces-token-sale-appoints-republic-as-web3-advisor",
    "description": "\n                        <p>Zug, Switzerland, August 21st, 2023, Chainwire</p>\n<p>&nbsp;</p>\n<p>Islamic Coin, a Shariah-compliant, ethics-first, digital money that has been featured globally, has announced it is working with Republic Crypto, the web3 advisory group within global digital finance leader, Republic.</p>\n<p>The collaboration includes white-glove support to promote Islamic Coin&rsquo;s go-to-market strategy, along with advisory services focused on tokenomics, DAO governance, and long-term economic utility value. Republic Crypto will also help engage with potential strategic partners, exchanges, and market makers.</p>\n<p>Fine-tuning the Islamic Coin value proposition, Republic Crypto advised on creating fair and Shariah-compliant allocation options, distribution, and other mechanisms aimed at adding to the sustainability features in the ecosystem.</p>\n<p>Separately, Islamic Coin plans to conduct a Reg D public token offering facilitated by OpenDeal Broker on Republic&rsquo;s retail investment platform in September 2023. Upon public launch, Islamic Coin&rsquo;s international community will reap various advantages, including options to offer liquidity, stake their holdings, and gain tokens during the liquidity mining stage.</p>\n<p>The Advisory Board of Islamic Coin is steered by members of ruling families of the UAE, including the grandson of UAE founder, Sheikh Dr. Hazza bin Sultan bin Zayed Al Nahyan, the country&rsquo;s Navy Chief, Sheikh Saeed bin Hamdan bin Mohammed Al Nahyan (serving in a private advisory capacity), Sheikh Khalifa Bin Mohammed bin Khalid Al Nahyan, Sheikh Mohammad Bin Khalifa Bin Mohammad Bin Khalid Al Nahyan, His Highness Sheikh Juma bin Maktoum Al Maktoum, and Her Highness Sheikha Mariam Suhail Obaid Suhail Al Maktoum.</p>\n<p>The Executive Board is also composed of experts from both traditional and Islamic finance. It humbly highlights Emaar&rsquo;s Hussein Al Meeza (also a co-founder), an award-winning banker with over four and a half decades of experience across the Islamic banking, finance, and insurance industries. He was a key figure in the establishment of the Dubai Islamic Bank, one of the first fully operational Islamic Banks. The Executive Board is further strengthened by Khamis Buharoon AI Shamsi, the former Assistant Director of the Finance Division, and Assistant Director of the Internal Audit Division of the Central Bank of the UAE. Adding to the team&rsquo;s robust profile, Greg Gigliotti, CEO, Chief Investment Officer, and Founding Partner of Xtellus Advisors. With a rich background at Goldman Sachs and other global institutions, Gigliotti has managed a portfolio exceeding $16 billion throughout his career.</p>\n<p>The Reg D offering is slated for September 2023.</p>\n<p>ABOUT REPUBLIC:</p>\n<p>Republic is a global technology firm pioneering the digital transformation of finance. The Republic ecosystem is composed of an enterprise-focused digital merchant bank and a network of international retail investment platforms. Republic has made it possible for 3+ million community members across 150+ countries to deploy $2.5+ billion into thousands of private ventures.</p>\n<p>Backed by Valor Equity Partners, Galaxy Interactive, Morgan Stanley, Hashed, AngelList, and other leading institutions, Republic is headquartered in New York City and has established operations in the US, UK, UAE, South Korea, and Singapore.</p>\n<p>Republic Crypto Disclaimer: https://republic.com/islamic-coin-crypto-disclaimer.&nbsp;</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-21T11:42:56.000Z",
    "title": "\n                        LBank Refutes Claims of Unauthorized Listings; Emphasizes Integrity and Standards\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/lbank-refutes-claims-of-unauthorized-listings-emphasizes-integrity-and-standards",
    "description": "\n                        <p>In a recent development, LBank, a renowned cryptocurrency exchange, has stepped forward to address misleading claims by certain projects about their listing status on the platform. This move underscores the exchange&rsquo;s unwavering commitment to transparency and user protection.</p>\n<p>LBank recently identified false information regarding the listing of &ldquo;Zetcoin (ZET)&rdquo; originating from Kirgizistan. Such incidents prompted the exchange to reiterate the rigorous processes they employ before listing any project.</p>\n<p>Here&rsquo;s an overview of LBank&rsquo;s Listing Standards:</p>\n<ul>\n<li>Verification Process: LBank stands firm on its mission to offer only the most genuine and value-driven projects to its users. Every project undergoes a stringent verification process. Details pertaining to projects, such as Zetcoin (ZET), can be verified at its specific contract address.</li>\n<li>Project Examination: This includes a thorough understanding of a project&rsquo;s essence, industry trends, unique selling points, and potential for growth.</li>\n<li>Public Engagement Metrics: LBank evaluates a project based on its activity and followers across platforms like Twitter, Telegram, and Discord.</li>\n<li>Team Evaluation: The credibility of the team, their professional experience, technical prowess, and operational challenges faced are all taken into account.</li>\n<li>Product Assessment: LBank looks into the technical applications&rsquo; necessity and innovativeness, its technological progress, and how it stands in its ecosystem.</li>\n<li>Market Performance Analysis: The exchange conducts a broad review based on the number of listings on other exchanges, pricing trajectories, Total Value Locked (TVL), trading volumes, and the number of holder addresses.</li>\n</ul>\n<p>LBank&rsquo;s dedication to its user base is evident in its meticulous selection of projects. The platform takes great lengths to ensure that only the most reliable projects are presented to its community.</p>\n<p>In light of these revelations, the general public and LBank users are advised to remain discerning and rely solely on official channels for accurate information regarding LBank&rsquo;s listings.</p>\n<p>About LBank</p>\n<p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users&rsquo; funds and aims to contribute to the global adoption of cryptocurrencies.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T12:05:31.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T11:57:56.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T11:51:15.000Z",
    "title": "AI Firm Awarded £130k to Pioneer Grassland Decarbonisation Project",
    "url": "https://www.cryptopolitan.com/firm-to-pioneer-grassland-decarbonisation/",
    "description": "In a significant stride towards sustainable land management and climate change mitigation, an AI firm has been granted £130,000 to spearhead a pioneering project focused on grassland decarbonisation. The funding injection underscores the growing recognition of the pivotal role that innovative technologies can play in combating climate change and fostering environmentally responsible practices. While the ... <a title=\"AI Firm Awarded £130k to Pioneer Grassland Decarbonisation Project\" class=\"read-more\" href=\"https://www.cryptopolitan.com/firm-to-pioneer-grassland-decarbonisation/\" aria-label=\"More on AI Firm Awarded £130k to Pioneer Grassland Decarbonisation Project\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T11:51:05.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.1037, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 8.01% decrease. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-21T12:00:04.000Z",
    "title": "How High Can Shiba Inu (SHIB) Rise When Shibarium Restarts?",
    "url": "https://www.newsbtc.com/shiba-inu/how-high-shiba-inu-shib-rise-shibarium-restarts/",
    "description": "Shibarium, the much-anticipated layer-2 network of Shiba Inu is back online but remains under the radar, confined to an extensive private test phase. Shytoshi Kusama, the project&#8217;s lead developer, unveiled this update on Saturday. In his remarks, Kusama assured the community that they have resolved all technical challenges previously encountered on this layer-2 platform. Kusama mentioned, “Shibarium is currently live (but in private mode) producing blocks as normal.” He further emphasized the importance of ensuring optimal scaling and functionality before a public re-release, suggesting that the SHIB development team is prioritizing caution above all. Notably, Shibarium&#8217;s initial launch wasn&#8217;t without its issues. Block production had come to a standstill on the network just last week. Shibariumscan, the network’s designated explorer, indicates that the most recent block on the Shibarium mainnet was produced on Thursday. Related Reading: Shiba Inu Whale Transfers 4.6 Trillion Tokens After A 24-Hour Safekeeping However, among the many challenges faced, the most significant was the unexpected trapping of 965 ETH, valued approximately at $1.7 million during that period. The predicament arose because of the massive, unexpected influx of traffic on the network immediately post-launch, with 1000 ETH tokens and 600,000 BONE tokens deposited within the first 15 minutes alone. This rush resulted in Shibarium recording over 160 million compute units in merely half an hour. Kusama, providing a silver lining, stated that they&#8217;ve since amplified Shibarium&#8217;s scaling and capacity by a staggering 1,500%. With such promising advancements and the dedication shown by the team, many Shiba Inu enthusiasts are ardently waiting for Shibarium to open its gates to the public. How High Can Shiba Inu Surge Post Shibarium Restart? The ripples of the Shibarium launch and its subsequent hiccups are vividly evident in SHIB&#8217;s recent price dynamics. A euphoric surge was observed around August 12, where SHIB&#8217;s price ascended to a 4-month high at $0.00001134. However, post the Shibarium&#8217;s temporary freeze, SHIB’s value plummeted sharply. This decline was so drastic that SHIB&#8217;s price slid below the support levels of all major daily moving averages. Related Reading: Shiba Inu Price Shows Resilience As Shibarium Reboots: SHIB Price Targets The meme coin’s recent trajectory saw it dwindling precariously close to the 78.6% Fibonacci retracement mark at $0.00000717 just last Thursday. However, SHIB price managed to claw its way back, finding support above the 61.8% Fibonacci retracement level pegged at $0.00000806. A brief bounce was witnessed, but resistance at the 50% Fibonacci retracement level and the 100-day EMA at $0.00000869 thwarted its progress, causing it to retrace its steps back towards the 61.8% level. With the potential public restart of Shibarium on the horizon, there&#8217;s a beacon of hope for SHIB’s price. A successful relaunch might propel SHIB to soar by 37% and retouch its 4-month peak at $0.00001134. But this ascent won’t be without challenges. The Shiba Inu price will need to navigate a maze of resistance, most notably the area between the 100-day EMA at $0.00000867 and the 50% Fibonacci retracement level at $0.00000869, the area between the 200-day EMA at $0.00000932 and the 38.2% Fibonacci retracement level at $0.00000931, and the 23.6% Fibonacci retracement level at $0.00001009. &#160; Featured image from Coins.ph, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T12:00:41.000Z",
    "title": "3 Crypto Presales That Are On Fire in August",
    "url": "https://www.crypto-news-flash.com/3-crypto-presales-that-are-on-fire-in-august/?utm_source=rss&utm_medium=rss&utm_campaign=3-crypto-presales-that-are-on-fire-in-august",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-84.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-84.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-84-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-84-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-84-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-84-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the ever-evolving realm of cryptocurrency, presales have emerged as a fiery arena, capturing the attention of seasoned investors and newcomers alike. August sees the rise of three standout projects: Borroe ($ROE), InQubeta (QUBE), and DigiToads. These presales are igniting enthusiasm within the crypto community, promising innovation, utility, and growth potential. DigiToads (TOADS): A Fusion [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T11:54:32.000Z",
    "title": "Litecoin and Dogecoin Experience Surge in Activity: Are LTC and DOGE Poised for a Price Explosion? A Report",
    "url": "https://www.crypto-news-flash.com/litecoin-and-dogecoin-experience-surge-in-activity-are-ltc-and-doge-poised-for-a-price-explosion-a-report/?utm_source=rss&utm_medium=rss&utm_campaign=litecoin-and-dogecoin-experience-surge-in-activity-are-ltc-and-doge-poised-for-a-price-explosion-a-report",
    "description": "<img width=\"510\" height=\"340\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/litecoin-6228177__340.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Litecoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/litecoin-6228177__340.jpg 510w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/litecoin-6228177__340-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/litecoin-6228177__340-104x69.jpg 104w\" sizes=\"(max-width: 510px) 100vw, 510px\" />Litecoin boasts 231,270 daily active addresses, Dogecoin 46,080.  Binance removes perpetual futures contracts tied to BUSD for LTC and DOGE.  Newly released data from IntoTheBlock shows that two alternative cryptocurrencies, Litecoin (LTC) and Dogecoin (DOGE), have witnessed significant rises in their on-chain interactions. This uptick in activity contrasts with the lack of growth in major [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T11:45:38.000Z",
    "title": "ETHWarsaw returns for its second edition alongside Warsaw Blockchain Week",
    "url": "https://www.crypto-news-flash.com/ethwarsaw-returns-for-its-second-edition-alongside-warsaw-blockchain-week/?utm_source=rss&utm_medium=rss&utm_campaign=ethwarsaw-returns-for-its-second-edition-alongside-warsaw-blockchain-week",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/AI_BG_photo_1200x720_1692615689YiLkvyELNP.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/AI_BG_photo_1200x720_1692615689YiLkvyELNP.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/AI_BG_photo_1200x720_1692615689YiLkvyELNP-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/AI_BG_photo_1200x720_1692615689YiLkvyELNP-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/AI_BG_photo_1200x720_1692615689YiLkvyELNP-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Warsaw, Poland, August 21st, 2023, Chainwire ETHWarsaw, a web3 conference and hackathon, organized by a passionate group of local Ethereum enthusiasts, returns for its second edition. The event is set to take place from August 31st to September 3rd, 2023 in Warsaw, Poland, bringing together a global community of builders, founders, and educators in web3. [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-21T12:03:00.000Z",
    "title": "Half of Musk’s Twitter Followers Bots? How Does This Affect DOGE?",
    "url": "https://coinedition.com/half-of-musks-twitter-followers-bots-how-does-this-affect-doge/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/42_of_Elon_Musks_153M_Twitter_followers_have_0_followers-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Elon Musk is making headlines again with reports that a large percentage of his Twitter (now X) followers were inactive, indicating that they could be bots. Culture Crave revealed in a recent Twitter post that 42% of Elon Musk&#8217;s 153M Twitter followers have zero followers and over 62.5M of Elon Musk followers have posted zero [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/half-of-musks-twitter-followers-bots-how-does-this-affect-doge/\">Half of Musk’s Twitter Followers Bots? How Does This Affect DOGE?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-21T11:45:00.000Z",
    "title": "Can Monero’s (XMR) Social Activity Hike Keep the Price Soaring?",
    "url": "https://coinedition.com/can-moneros-xmr-social-activity-hike-keep-the-price-soaring/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Can-Monero-XMR-Social-Hike-Keep-the-Price-Soaring-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Monero (XMR), known for its strong emphasis on privacy and anonymity, has captured the attention of market participants for its increasing presence in social discussions. Social media platforms have become a significant driver of market sentiment and price movements for various cryptocurrencies, and Monero is no exception. Interestingly, as discussions around privacy and decentralized finance [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/can-moneros-xmr-social-activity-hike-keep-the-price-soaring/\">Can Monero’s (XMR) Social Activity Hike Keep the Price Soaring?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-21T11:45:36.000Z",
    "title": "Ethereum Creator Vitalik Buterin Receives Taiwan Employment Gold Card, Says Robust ETH Community in Country: Report",
    "url": "https://dailyhodl.com/2023/08/21/ethereum-creator-vitalik-buterin-receives-taiwan-employment-gold-card-says-robust-eth-community-in-country-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/Bloomberg-Analyst-Predicts-Ethereum.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/Bloomberg-Analyst-Predicts-Ethereum.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/Bloomberg-Analyst-Predicts-Ethereum.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/Bloomberg-Analyst-Predicts-Ethereum.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/Bloomberg-Analyst-Predicts-Ethereum.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/Bloomberg-Analyst-Predicts-Ethereum.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/Bloomberg-Analyst-Predicts-Ethereum.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ethereum (ETH) creator Vitalik Buterin has reportedly received a residency permit in Taiwan allowing him to live and work within the country for three years at a time. According to a report from local Taiwanese media, the country&#8217;s digital minister has confirmed that Buterin has obtained the Taiwan Employment Gold Card. The program aims to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/21/ethereum-creator-vitalik-buterin-receives-taiwan-employment-gold-card-says-robust-eth-community-in-country-report/\">Ethereum Creator Vitalik Buterin Receives Taiwan Employment Gold Card, Says Robust ETH Community in Country: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]