[
  {
    "source": "Decrypt",
    "date": "2023-06-26T21:46:25.000Z",
    "title": "Kendall Jenner, J Balvin to Judge NFT Competition for AIDS Charity",
    "url": "https://decrypt.co/146211/kendall-jenner-j-balvin-judge-nft-competition-aids-charity",
    "description": "A total of 100 artworks will be chosen as backgrounds for an NFT collection that will benefit amfAR, The Foundation for AIDS Research."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-26T21:54:41.000Z",
    "title": "Swiss central bank announces plans for wholesale CBDC pilot with ‘real money’: Report",
    "url": "https://cointelegraph.com/news/swiss-central-bank-announces-plans-wholesale-cbdc-pilot-with-real-money-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/79f1e7f3-3b5d-4c15-8cfd-c517892044ac.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Thomas Jordan, head of the Swiss National Bank, announced the project at a conference in Zurich; bank still feels “prudent” about a retail CBDC, though.</p>\n                    <p><p>The head of the Swiss National Bank (SNB) has announced that the bank will launch a wholesale central bank digital currency (wCBDC) pilot project, according to a report. Reuters <a href=\"https://www.reuters.com/markets/currencies/snb-launch-digital-currency-pilot-chairman-2023-06-26/\" target=\"_blank\" rel=\"noopener nofollow\">quoted</a> bank chair Thomas Jordan as saying the project would begin “soon.” </p><p>The wCBDC will be issued on the Swiss SIX digital exchange and run for a limited time, Jordan was quoted as saying at the Point Zero Forum in Zurich on June 26. The SIX Group <a href=\"https://cointelegraph.com/news/swiss-exchange-six-granted-approval-to-launch-crypto-marketplace\">also runs Switzerland’s</a> largest stock exchange. Jordan said, according to the report:</p><blockquote>\"This is not just an experiment, it will be real money equivalent to bank reserves and the objective is to test real transactions with market participants.\"</blockquote><p>SNB governing board member Thomas Moser <a href=\"https://cointelegraph.com/news/central-banks-can-push-defi-into-mainstream-swiss-national-bank-official\">told Cointelegraph last year</a> that CBDCs could work well with decentralized finance. The SNB <a href=\"https://cointelegraph.com/news/swiss-central-bank-tests-wholesale-cbdc-with-commercial-partners\">integrated a wCBDC into the back-office</a> systems of five banks early last year as part of its Project Helvetia, which had previously <a href=\"https://cointelegraph.com/news/swiss-national-bank-and-bis-complete-digital-currency-proofs-of-concept\">completed a proof of concept</a> for wCBDC. </p><p>That was a pivot from the position expressed a year prior by SNB chief economist Carlos Lenz, who said <a href=\"https://cointelegraph.com/news/blockchain-not-suitable-for-cbdc-says-swiss-national-bank-economist\">blockchain was not a suitable</a> platform for CBDC, and the country had not intention of issuing one. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bis-joins-france-and-switzerland-s-central-bank-on-cross-border-cbdc-project\">BIS joins France and Switzerland's central banks on cross-border CBDC project</a></em></strong></p><p>Thomas said of retail CBDC that “we are a little bit prudent at the moment,” but he did not rule out its introduction. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Swiss National Bank (SNB) to launch digital currency (CBDC) pilot - SNB&#39;s chairman <a href=\"https://t.co/Kc7DKIYuSA\">https://t.co/Kc7DKIYuSA</a> via <a href=\"https://twitter.com/Reuters?ref_src=twsrc%5Etfw\">@Reuters</a> <a href=\"https://t.co/HG4ZSFGkW9\">pic.twitter.com/HG4ZSFGkW9</a></p>&mdash;  Dan Popescu  (@PopescuCo) <a href=\"https://twitter.com/PopescuCo/status/1673284906279903234?ref_src=twsrc%5Etfw\">June 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>SNB governing board member Andréa Maechler, speaking at a different event from Jordan at the Point Zero Forum this year, said that the central bank does not foresee the replacement of cash in the country. Maechler <a href=\"https://cointelegraph.com/news/the-risks-outweigh-the-benefits-of-a-swiss-cbdc-says-snb-governing-board-member\">said last year that SNB officials</a> “believe the risks outweigh the benefits” in regard to a retail CBDC. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\">Best and worst countries for crypto taxes — plus crypto tax tips</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-26T21:46:00.000Z",
    "title": "Price analysis 6/26: SPX, DXY, BTC, ETH, BNB, XRP, ADA, DOGE, SOL, LTC ",
    "url": "https://cointelegraph.com/news/price-analysis-6-26-spx-dxy-btc-eth-bnb-xrp-ada-doge-sol-ltc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/4b5f46e3-6764-4790-8a6e-6ff7d8c016d2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>An onslaught of Bitcoin ETF applications could help BTC price find long-lasting support at the $30,000 level.</p>\n                    <p><p>The S&P 500 Index (SPX) snapped a five-week winning streak last week but it is still on track to close the first half of the year with stellar gains of nearly 13%. The tech-heavy Nasdaq Composite has done much better as it is up <a href=\"https://www.cnbc.com/2023/06/25/stock-market-today-live-updates.html\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-cnbc-com.cdn.ampproject.org/c/s/www.cnbc.com/amp/2023/06/25/stock-market-today-live-updates.html\">about</a> 29%. Both these indices have been overtaken by Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) which has risen nearly 83% year-to-date.</p><p>Bitcoin’s bullish price action and the recent rush by several firms to apply for a Bitcoin spot exchange-traded fund seem to have attracted institutional investors’ attention. Bloomberg senior ETF analyst Eric Balchunas highlighted on June 26 that the ProShares Bitcoin Strategy ETF (BITO) — a Bitcoin futures fund — witnessed its <a href=\"https://cointelegraph.com/news/proshares-bitcoin-etf-bito-weekly-inflows-largest-in-year\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/proshares-bitcoin-etf-bito-weekly-inflows-largest-in-year/amp\">largest weekly inflow in a year</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/076cf922-72e7-4bdd-b008-0110dbba957b.png\"><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>Another bullish view was that of LookIntoBitcoin founder Philip Swift who said in his latest research that Bitcoin’s RHODL ratio metric is showing that Bitcoin’s supply has started to <a href=\"https://cointelegraph.com/news/btc-price-up-fundamentals-down-5-things-bitcoin\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/btc-price-up-fundamentals-down-5-things-bitcoin/amp\">move from long-term holders to speculative investors</a>, indicating increasing mainstream trading interest.</p><p>Could the entry of speculators boost prices further or is it a sign that the markets are overheated in the near term and may correct? Let’s analyze the charts to find out the next possible move.</p><h2>S&P 500 Index price analysis</h2><p>The S&P 500 Index turned down from 4,448 on June 16, indicating that the short-term bulls are booking profits. That has pulled the price to the breakout level near 4,325. The 20-day exponential moving average (4,314) is placed just below this level, hence the bulls are likely to defend it aggressively.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/8983bfbe-9824-43c7-8a21-f4d309c8154c.png\"><figcaption style=\"text-align: center;\"><em>SPX daily chart. Source: TradingView</em></figcaption></figure><p>If the price rebounds off the 20-day EMA, it will suggest that the sentiment remains positive and traders are viewing the dips as a buying opportunity. The bulls will then try to propel the price above 4,448 and resume the uptrend. If they succeed, the index could attempt a rally to 4,650. There is a minor resistance at 4,500 but it is likely to be crossed.</p><p>This positive view will invalidate in the near term if the price turns down and plummets below the 20-day EMA. The index could then start a deeper correction to the 50-day simple moving average (4,206).</p><h2>U.S. dollar index price analysis</h2><p>The U.S. dollar index plunged below the 50-day SMA (102.68) on June 15 but the bears could not build upon this strength. The bulls are trying to form a higher low near 102.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/3ee69c49-707f-4dff-8428-329716315a8f.png\"><figcaption style=\"text-align: center;\"><em>DXY daily chart. Source: TradingView</em></figcaption></figure><p>Buyers pushed the price above the moving averages on June 23 but the long wick on the candlestick shows that bears are selling at higher levels. The 20-day EMA (102.92) is flattening out and the RSI is near the midpoint, indicating a balance between supply and demand.</p><p>If the price closes above the 20-day EMA, the index could rise to the downtrend line. The bears are expected to defend this level with all their might. The important level to watch on the downside is 102. A break and close below this support could sink the index to 100.82.</p><h2>Bitcoin price analysis</h2><p>The bears are aggressively defending the $31,000 level but the bulls are not allowing the price to sustain below $30,000. This suggests that lower levels are being bought.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/41202d79-44a9-4dea-9ac6-aa6cd2ea94f7.png\"><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>A tight consolidation near the overhead resistance of $31,000 shows that the bulls are in no mood to book profits as they expect the up-move to extend further. The rising 20-day EMA ($28,288) and the relative strength index (RSI) near the overbought zone indicate the path of least resistance is to the upside.</p><p>If bulls propel the BTC/USDT pair above the $31,000 to $31,500 resistance zone, it will signal the start of the next leg of the uptrend. There is a minor resistance at $32,400 but it may not hold the price for long. A rally above this resistance could clear the path for a dash to $40,000.</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) has been trading in a tight range between $1,936 and $1,861 for the past few days. This suggests indecision between the bulls and the bears.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/9eadade2-a15d-4f81-9e89-3d61e6c28d51.png\"><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The rising 20-day EMA ($1,822) and the RSI in the positive territory indicate that bulls have the upper hand. If buyers kick the price above $1,936, the ETH/USDT pair could rise to the psychologically important level of $2,000. This level may act as a hurdle but it is likely to be crossed. The pair may then soar toward $2,200.</p><p>If bears want to prevent the upside, they will have to tug the price below the support at $1,861. The pair may then slip to the moving averages, which is an important level to keep an eye on. If this level cracks, the pair may again descend toward $1,700.</p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/binance-coin-price-index\">BNB</a>) bounced off the strong support at $230 on June 24, indicating that the bulls are trying to arrest the decline at this level.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/19cea16c-4508-42b7-891e-ae5e26baa403.png\"><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls will have to push and sustain the price above the 20-day EMA ($250) to indicate strength. The BNB/USDT pair may then rise to the breakdown level of $265. If the price turns down sharply from this level, it will suggest that bears are selling on rallies. That could keep the pair range-bound between $265 and $220 for a while.</p><p>On the other hand, if the price turns down from the 20-day EMA and breaks below $230, it will suggest that bears are in control. They will then try to drag the price below the vital support at $220 and start the next leg of the downtrend. The next support is at $200.</p><h2>XRP price analysis</h2><p>The bulls tried to push XRP (<a href=\"https://cointelegraph.com/xrp-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/xrp-price-index\">XRP</a>) above the 20-day EMA ($0.49) for the past few days but the bears did not relent. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/04874a13-dffe-4de9-9a61-4d38aa2147cb.png\"><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: TradingView</em></figcaption></figure><p>Sellers will try to sink the price below the strong support at the 50-day SMA ($0.48). If they do that, the XRP/USDT pair could slump to $0.44 and then to $0.41. The gradually downsloping 20-day EMA and the RSI near 45 indicate that bears have a slight edge.</p><p>On the upside, the 20-day EMA remains the key level to keep an eye on. Buyers will have to thrust and sustain the price above this level to gain strength. The pair could then attempt a rally to $0.56.</p><h2>Cardano price analysis </h2><p>The bulls are finding it difficult to sustain Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) above the breakdown level of $0.30, which suggests that the bears are fiercely defending the level.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/8890d528-79f3-4df1-a6da-96938d6ec523.png\"><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The ADA/USDT pair has been trading in a narrow range near the overhead resistance. This indicates uncertainty between the bulls and the bears. If the price turns down and breaks below $0.28, it will point to a range-bound action between $0.24 and $0.30 for a few days.</p><p>Alternatively, if bulls shove and sustain the price above $0.30, it will signal the start of a stronger recovery to the 50-day SMA ($0.33). This level may again act as a strong hurdle but if crossed, the pair may reach $0.38.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-price-surfs-30k-us-trading-boost-btc\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-price-surfs-30k-us-trading-boost-btc/amp\"><em>Bitcoin surfs $30K as traders hope US trading will boost BTC price</em></a></p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) turned down from the overhead resistance of $0.07 on June 23, indicating that the bears are defending the level with vigor.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/a129859f-7e19-48ae-8004-d6905b93ce0b.png\"><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The 20-day EMA ($0.07) has flattened out and the RSI is just below the midpoint, indicating a state of equilibrium between buyers and sellers. If the price breaks below the 20-day EMA, the DOGE/USDT pair may consolidate between $0.06 and $0.07 for a few days.</p><p>The first sign of strength will be a rally above the resistance at $0.07. Buyers will then try to extend the recovery to $0.08. On the downside, a break and close below $0.06 could start a deeper correction to $0.05.</p><h2>Solana price analysis</h2><p>The relief rally in Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) is facing strong resistance at the 20-day EMA ($17), indicating that the bears have not given up and they continue to sell on rallies.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/9c785554-8ef1-469f-ac0a-c09be210b1db.png\"><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: TradingView</em></figcaption></figure><p>Sellers will have to sink the price below the immediate support of $16.18 to be back in the driver’s seat. The SOL/USDT pair may then retest the important support zone between $15.28 and $14.</p><p>On the contrary, if the price turns up from the current level and breaks above $17.75, it will suggest that bulls have a slight edge. The pair could then rise to the breakdown level of $18.70. The 50-day SMA ($18.82) is placed just above this level hence the bears are expected to defend it fiercely.</p><h2>Litecoin price analysis</h2><p>Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) turned down from the resistance line of the descending channel on June 24 and reached the moving averages.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e3fd8480-b591-40dc-9d1b-b746633f86fa.png\"><figcaption style=\"text-align: center;\"><em>LTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The long tail on the June 24-26 candlestick shows that the bulls are buying the dips to the 50-day SMA ($85). Buyers will try to push the price to the resistance line of the channel which remains the important resistance to watch out for. If bulls overcome this obstacle, the LTC/USDT pair could start an up-move toward $105.</p><p>Contrarily, if the price continues lower and plunges below the moving averages, it will suggest that bears have the upper hand. The pair could then tumble to $76 and later to the support line of the channel.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-26T21:45:42.000Z",
    "title": "Cream Finance exploiter moves nearly $500k",
    "url": "https://cryptoslate.com/cream-finance-exploiter-moves-nearly-500k/",
    "description": "<p>The exploiter behind a past attack on Cream Finance has transferred nearly half a million in funds, security firm CertiK said on June 26. Exploiter moved $496,000 of ETH CertiK reported that the exploiter sent approximately 268 ETH ($496,000) to a separate Ethereum address. The transfer took place on June 26 at 5:33 p.m. UTC. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/cream-finance-exploiter-moves-nearly-500k/\">Cream Finance exploiter moves nearly $500k</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-26T21:52:46.000Z",
    "title": "Ethereum sees major developments as analysts show optimism",
    "url": "https://crypto.news/ethereum-sees-major-developments-as-analysts-show-optimism/",
    "description": "Ethereum (ETH) is making significant strides despite the broader downturn in the crypto market."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-26T21:45:42.000Z",
    "title": "Tom Lee says bitcoin is maintaining key levels",
    "url": "https://crypto.news/tom-lee-says-bitcoin-is-maintaining-key-levels/",
    "description": "Tom Lee, a prominent cryptocurrency analyst at Fundstrat, recently shared his observations on bitcoin's ability to maintain critical support levels in the face of significant regulatory challenges. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-26T22:00:38.000Z",
    "title": "ETHBarcelona IRL: A Look Behind One Of The Ethereum Community Most Anticipated Events",
    "url": "https://www.newsbtc.com/interview/ethbarcelona-irl-a-look-behind-one-of-the-ethereum-community-most-anticipated-events/",
    "description": "“Crypto is Culture” is one of the main themes behind the ETHBarcelona Conference. The community-led event is gearing up for its second edition at one of the most important civic centers in the world, with a promise of highlighting Ethereum and crypto beyond its market value. Related Reading: Ethereum Poised To Break $2,000 As $12 Million Short Seller Nears Liquidation Education, social impact, art, price, and Zero-Knowledge (ZK) technology are some subjects that will be present during the three-day event from July 5 to 7. We sat down with the team behind ETHBarcelona to discuss their vision, running an event amidst a bear market, and why conferences still have value. This is what they told us. Q: Conferences are a big part of anything that wants a place in today’s culture, but what’s different about ETHBarcelona; what’s at the event’s core? And maybe you can tell us more about what inspired its creation. ETHBarcelona Team: What sets EthBarcelona apart from most web3 projects is our unique focus on culture, values, public goods, and social impact, rather than solely prioritizing, it’s the only ETH event largely focused on social impact, which is also why we had about 40 percent of female attendees which is quite rare in Web3 events. The reason being the kind of focus this event has thats different from other ETH events. The idea for EthBarcelona and event organization actually originated back at Devcon V in Osaka, back in 2019. During those early days, when the local places would close early, I would receive numerous messages asking for plans and suggestions on where to go. That&#8217;s when I had the idea to create a group, and thus Blockravers was born. It started with coordinating gatherings of around 20-30 people, and soon it gained traction worldwide, leading us to organize parties. The popularity of Blockravers caught the attention of companies who began inviting us to their events, offering us free tickets. We became known as the curators of good vibes! This trend continued during Devcon in Colombia, and at EthDenver, we even rented a party house, which remained open every day for people to come and go. To ensure a sense of accountability and respect for shared spaces, we introduced a vouching system. In order to enter the party house, individuals needed to be vouched for by someone else. This system helped us maintain order in public spaces with limited resources. Those who caused damage, harassed others, or exhibited racist or homophobic behavior were expelled from the group, and the person who vouched for them also received a yellow card. Two yellow cards would result in expulsion as well. The vouching system extended to Zuzalu, where we rented a house and required people to be vouched for before entering. We even developed an application that initially used Venezuelan Bolivares&#8217; serial numbers as unique identifiers for self-issued identities. As we distributed over 153 Venezuelan banknotes, more Zuzalu residents wanted to participate, leading us to allow anyone with a banknote to register and build trust. The serial numbers, along with a photo, became a way of saying, &#8220;This is me,&#8221; helping us establish a network of trust. As we continued experimenting with the system, we implemented a rule that attendees needed at least three vouches to attend the next party. Our work with identity, reputation, and vouching systems started with parties, but the concept extends far beyond that. It can be applied to Decentralized Autonomous Organizations (DAOs), governance, verification, and more. Token distribution within any community can benefit from this approach as well. We could reward actual humans who genuinely engage with us, contribute to the community, and have been part of the Blockravers journey. They are the ones who bring the vibes and make this community vibrant! So, our journey began with parties, but the potential for identity, reputation, and vouching systems reaches far and wide. It aligns perfectly with our focus on building a strong community and making a positive impact. &#160; Q: What are the challenges of running a community-driven event in 2023? And from your perspective, has the bear market impacted people’s interest in the nascent industry? Is it true that people build more during these price drawdowns?  ETHBarcelona Team: Running a community-driven event in 2023 presents several challenges that organizers need to navigate. One of the key challenges is the issue of budget constraints. As mentioned, budget has always been a challenge, but despite that, we managed to pull off a highly successful event last year. Additionally, the bear market has further exacerbated the funding challenge. During a bear market, where cryptocurrency prices are generally in a downward trend, securing financial support becomes more difficult. But, we are grateful to our sponsors who have stepped in to support the event. Their involvement highlights the continued interest and belief in the nascent industry, despite the market conditions. One positive outcome however is the increased interest in the hackathon event. The bear market has not stopped builders from participating and showcasing their skills and innovations. In fact, it is often during price drawdowns that people tend to focus more on building and developing new ideas. This may be due to a combination of factors, such as lower market speculation and the opportunity to explore new avenues of growth and development. From my perspective, the bear market does impact people&#8217;s interest in the nascent industry, but not necessarily in a negative way. While it may discourage some investors and speculators, it tends to attract individuals who are genuinely passionate about building and creating value in Web3. These individuals are driven by their belief in the technology&#8217;s long-term potential rather than short-term market fluctuations. The bear market has not deterred builders, and if anything, it has fostered a stronger focus on development and innovation within the nascent industry. &#160; Q: With most conversations happening online, do you think conferences are still relevant? As crypto is said to be the bridge between the digital and physical spaces, how does ETHBarcelona embody this idea? ETHBarcelona Team: Oh, absolutely! While online conversations have become the norm especially in the Web3 world, conferences like ETHBarcelona are the ultimate proof that physical events still have their charm and relevance. You see, attending a conference like ETHBarcelona is like stepping into a whole different world—it&#8217;s like a festival for Web3 enthusiasts! First of all, picture this: a bustling gathering of brilliant minds, passionate developers, and crypto-curious individuals from all corners of the globe all with the goal of driving impact using this technology. It&#8217;s a vibrant melting pot where ideas collide and friendships are forged. You can&#8217;t replicate that level of energy and personal connection in a virtual setting! We’re taking the best of both worlds and merging them seamlessly. While the event is firmly rooted in physical interactions, it doesn&#8217;t shy away from leveraging technology to enhance the experience. Attendees get to enjoy captivating presentations, engaging workshops, and hands-on activities, all designed to deepen their understanding of Ethereum and blockchain technology. ETHBarcelona is providing attendees with an exquisite NFT (non-fungible token) ticket. It&#8217;s like owning a little piece of digital art that grants you access to this event. Not only does this embrace the digital aspect of crypto, but it also creates a tangible, collectible experience for participants. Q: How will ETHBarcelona address the negative narrative surrounding cryptocurrencies, such as bankruptcies and company collapses? What should be the dominant narrative in the industry beyond these issues? ETHBarcelona Team: I often am asked this question but to be very honest It is important to note that negative narratives are found in all industries, not solely within the web3 world. The current bear run affects not only the web3 industry but has also affected the tech ecosystem, which has been influenced by factors such as AI disruption, market uncertainty caused by ongoing conflicts, and other diverse elements. But sometimes it feels like people outside of the Web3 ecosystem have a tendency to beat this ecosystem more. Regardless of whatever happens outside, our focus is on shifting the narrative towards one of resilience, creativity, and boundless possibilities. We firmly believe in highlighting the accomplishments of entrepreneurs, startups, and visionaries who are pushing the boundaries of what is achievable. Our emphasis extends beyond mere profit generation—it encompasses the social impact that can be derived from crypto on finance, governance, supply chain management, and culture. Last year we took pride in showcasing projects like Ukraine DAO, which exemplifies how cryptocurrencies can serve as a powerful tool for positive change. This year we have amazing speakers from projects like Worldcoin, Giveth, ReFi DAO and many others! By showcasing the remarkable potential of cryptocurrencies and blockchain technology, we aim to inspire confidence, foster innovation, and drive positive change in the industry as a whole. &#160; Q: What can attendees expect from ETHBarcelona? How does &#8220;Crypto is Culture&#8221; relate to financial services, cryptocurrencies, and Ethereum? How do you go from finance to web3 to culture? And what’s the component that allows for this transformation? ETHBarcelona Team: Our event is designed to provide valuable insights, networking opportunities, and a deeper understanding of the intersection between culture, financial services, cryptocurrencies, and the Ethereum ecosystem. The theme &#8220;Crypto is Culture&#8221; encapsulates the idea that cryptocurrencies and blockchain technology have transcended their purely financial aspects and become intertwined with various aspects of our culture. This includes art, music, literature, social movements, and more. At ETHBarcelona, we explore the cultural impact and potential of the crypto industry, shedding light on its transformative power and the diverse perspectives it brings to the table. Related Reading: Ethereum Price Stuck In Range As Risk of Downside Correction Escalates Moreover, ETHBarcelona sheds light on the role of Ethereum and web3 technologies in enabling the creator economy. By leveraging blockchain, artists, content creators, and cultural innovators can tokenize their work, establish ownership rights, and directly monetize their creations. This empowers creators with new revenue streams, facilitates peer-to-peer transactions, and promotes the growth of a vibrant cultural ecosystem. Cover image from ETHBarcelona, chart from Tradingview"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-26T22:01:44.000Z",
    "title": "$26,000,000 Worth of Do Kwon and Terraform Labs’ Assets Frozen by Swiss Police: Report",
    "url": "https://dailyhodl.com/2023/06/26/26000000-worth-of-do-kwon-and-terraform-labs-assets-frozen-by-swiss-police-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/03/terra-game-changer-coming.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/03/terra-game-changer-coming.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/03/terra-game-changer-coming.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/03/terra-game-changer-coming.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/03/terra-game-changer-coming.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/03/terra-game-changer-coming.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/03/terra-game-changer-coming.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Swiss authorities have reportedly frozen $26 million worth of assets from Terraform Labs and its founder, former crypto billionaire Do Kwon. The assets frozen included Bitcoin (BTC), and was frozen from Swiss digital asset bank Sygnum, reports Korean outlet Digital Asset. Sygnum froze the assets after Swiss authorities received requests from the New York Attorney&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/26/26000000-worth-of-do-kwon-and-terraform-labs-assets-frozen-by-swiss-police-report/\">$26,000,000 Worth of Do Kwon and Terraform Labs’ Assets Frozen by Swiss Police: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]