[
  {
    "source": "Cointelegraph",
    "date": "2023-09-15T03:51:55.000Z",
    "title": "Ethereum Merge anniversary — 99% energy drop but centralization fears linger",
    "url": "https://cointelegraph.com/news/ethereum-merge-a-year-later-energy-consumption-down-centralization-fears-ongoing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/45fc1734-826d-46f3-81c6-16b837bfa226.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Energy use is down, and staking is up, but technical concerns still mark the road ahead for the second-largest cryptocurrency by market cap. </p>\n                    <p><p>One year after its historic transition to proof of stake, Ethereum has seen a massive reduction in energy use and a marked improvement in access to the network, however, a number of technical issues still mark the road ahead.</p><p>The Merge was executed on Sept. 15, 2022 — an event that saw the Ethereum mainnet merging with a separate proof-of-stake blockchain called the Beacon Chain.</p><p>The most noticeable improvement to Ethereum post-merge was the seismic shift from an energy-guzzling proof-of-work (PoW) consensus mechanism to PoS, which saw the Ethereum network drastically reduce its total power consumption. </p><p>According to <a href=\"https://ccaf.io/cbnsi/ethereum/ethereum_merge\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from The Cambridge Centre for Alternative Finance, the Ethereum network has seen its energy use drop more than 99.9% from the approximately 21 terawatt hours of electricity it used while running under PoW.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/2ea04ad3-68b4-4276-a443-c1b2c64ee8d1.png\"  /><figcaption style=\"text-align: center;\"><em>The Merge has reduced Ethereum's power consumption by more than 99%. Source: CCAF</em></figcaption></figure><h3>Ethereum turns deflationary</h3><p>Outside of using less power, The Merge also saw the Ethereum network become economically deflationary, meaning that the number of new Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) issued to secure the network has been outpaced by the amount of ETH removed from supply forever. </p><p>According to data from the Ethereum data provider <a href=\"https://ultrasound.money/\" target=\"_blank\" rel=\"noopener nofollow\">ultrasound.money</a>, a little more than 300,000 ETH (worth $488 million at current prices) has been burned since The Merge. At current burn rates, the total supply of ETH is being reduced at a rate of 0.25% per year. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/8ed21365-2d00-4b07-b97f-102630379139.png\"  /><figcaption style=\"text-align: center;\"><em>Change in ETH supply since the Merge. Source: ultrasound.money</em></figcaption></figure><p>While many proponents believed that the price of Ethereum would surge in response to this new deflationary pressure, the hopes of a dramatic increase in the price of ETH were <a href=\"https://cointelegraph.com/news/4-reasons-ethereum-price-cant-break-1-970\">buffeted by a series of macroeconomics headwinds</a> such as the banking crisis and spiking inflation. </p><p>Notably, the growth of ETH paled in comparison to the growth in the price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) in the first quarter of this year, with the flagship crypto asset <a href=\"https://cointelegraph.com/news/bitcoin-likely-to-outperform-all-crypto-assets-following-banking-crisis-analyst-explains\">seeming to benefit from much of the</a> traditional financial instability brought about by the banking crisis. </p><p>Price action aside, the central theme of the proof-of-stake upgrade was the introduction of stakers in place of miners to secure the network. </p><p>The subsequent Shapella upgrade in April 2023 drove ETH in huge droves towards staking. The top beneficiaries of this shift were the liquid staking providers such as Lido and Rocket Pool.</p><h3>Liquid staking takes over</h3><p>Since the Merge, liquid staking providers have come to dominate the Ethereum landscape, with more than $19.5 billion worth of ETH currently staked by way of liquid staking protocols, according to <a href=\"https://defillama.com/lsd\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from DeFiLlama. </p><p>At the time of publication, Lido is by far the largest staking provider, accounting for 72% of all staked ETH. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/d21349d7-f0d0-4ae0-aed7-c6f1081e8519.png\"  /><figcaption style=\"text-align: center;\"><em>Lido currently accounts for 72% of all staking on Ethereum. Source: DeFiLlama</em></figcaption></figure><p>However while many Ethereum advocates including Labry CEO Lachlan Feeny, have <a href=\"https://cointelegraph.com/learn/ethereum-upgrades-a-beginners-guide-to-eth-2-0\">praised the switch to staking</a> for removing the barriers of expensive, sophisticated hardware for mining, one of the primary concerns with the rise of liquid staking has been the level of control granted to staking providers, in particular Lido Finance. </p><p>\"Liquid staking is ultimately good for the network as it ensures that the governance of the network is not restricted only to the wealthy. However, it has also led to the rise of its own problems,\" Feeny told Cointelegraph. </p><p>At least five Ethereum liquid staking providers working <a href=\"https://cointelegraph.com/news/ethereum-staking-services-agree-self-limit-validators\">towards imposing a 22% limit rule</a>, in a move to ensure the Ethereum network remains decentralized — though Lido voted not to take part. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ethereum-active-addresses-second-highest-in-history-analysts\"><strong><em>Ethereum’s active addresses second-highest in history: Analysts</em></strong></a></p><p>Notably, Lido <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x10abedcc563b66b1adee60825e78c387105110fa4a1e7354ab57bc9cc1e675c2\" target=\"_blank\" rel=\"noopener nofollow\">voted</a> by a 99.81% majority not to self-limit back in June, leading Ethereum advocate Superphiz to declare that the the staking providers had “expressed an intention to control the majority of validators on the beacon chain.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Lido voted by a 99.81% majority not to self-limit. They have expressed an intention to control the majority of validators on the beacon chain.<a href=\"https://t.co/T16rTdM3gm\">https://t.co/T16rTdM3gm</a></p>&mdash; superphiz.eth ️ (@superphiz) <a href=\"https://twitter.com/superphiz/status/1697038218892378136?ref_src=twsrc%5Etfw\">August 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>This move has led to widespread concerns over <a href=\"https://cointelegraph.com/news/lido-rocket-pool-team-members-argue-over-decentralization\">the potential centralization</a> of validation on Ethereum.</p><p>\"Lido presently controls 32.26% of all staked Ether on the network worth over $14 billion. In the long run I am confident that Ethereum is better off with liquid staking than without it, however, there are many challenges that still need to be overcome,\" Feeny concluded. </p><p>Feeny also noted that the most pressing concern for Ethereum in the immediate future was the growing regulatory pressure against crypto and blockchain in the United States more broadly.</p><p>\"Regulatory bodies, particularly in the U.S. appear to be hellbent at the moment on eliminating the U.S.-based blockchain industry,\" he said.</p><blockquote>It would be devastating for Ethereum and the global blockchain community if it becomes too difficult for blockchain companies to operate in the US.\"</blockquote><p>Outside of staking, client diversity also remains a central issue. On Sept. 5, Vitalik Buterin took to the stage at Korea Blockchain Week to <a href=\"https://cointelegraph.com/news/vitalik-buterin-ethereum-centralization-issues-running-nodes-easier\">discuss the six key problems that need addressing</a> to solve the problem of centralization. </p><p>Currently, the majority of the 5,901 active Ethereum nodes are being run through centralized web providers like Amazon Web Services, which many experts claim leaves the Ethereum blockchain exposed to a centralized point of failure.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/0446c82f-9e57-41b5-a4d6-f94b6466e113.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Distribution of Ethereum nodes from web service providers. Source: Ethernodes</em></figcaption></figure><p>In Buterin’s view, in order for Ethereum to remain sufficiently decentralized in the long-term it needs to be easier for everyday people to run nodes, which means drastically reducing costs and hardware requirements for node operators.</p><p>Buterin’s primary solution was the concept of statelessness, which removes the reliance on centralized servers by reducing data requirements for node operators to near-zero. </p><blockquote>“Today, it takes hundreds of gigabytes of data to run a node. With stateless clients, you can run a node on basically zero.”</blockquote><p>While this was Buterin’s most prominent concern for the centralization issue, he explained that these problems may not be solved for another 10 to 20 years. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/nft-collapse-and-monster-egos-feature-in-new-murakami-exhibition/\"><strong><em>NFT collapse and monster egos feature in new Murakami exhibition</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-15T04:00:31.000Z",
    "title": "BNB Chain Layer 2 Goes Live",
    "url": "https://news.bitcoin.com/bnb-chain-layer-2-goes-live/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2136903219-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Opbnb, BNB Chain L2, Goes Live On Mainnet\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2136903219-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2136903219-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2136903219-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2136903219-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2136903219-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2136903219-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2136903219-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />BNB Chain, the Binance-backed decentralized blockchain network, has announced the launch of Opbnb, its expansion layer built using the Optimism OP stack. The new network allows users to enjoy low-fee transactions in a high-throughput, high-speed transactional layer optimized for interactive applications such as games, with the BNB Chain chain serving as a settlement layer. Optimism-Based [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-15T04:00:00.000Z",
    "title": "Dogecoin inspires analysts to evaluate 3 other meme coins",
    "url": "https://crypto.news/dogecoin-inspires-analysts-to-evaluate-3-other-meme-coins/",
    "description": "This article explores the top three contenders that could follow in Dogecoin's footsteps"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-15T03:40:58.000Z",
    "title": "Blockchain – Might It Be the Answer to Redefining Finance",
    "url": "https://dailyhodl.com/2023/09/14/blockchain-might-it-be-the-answer-to-redefining-finance/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/12/banking-giant-blockchain-forex.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/12/banking-giant-blockchain-forex.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/12/banking-giant-blockchain-forex.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/12/banking-giant-blockchain-forex.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/12/banking-giant-blockchain-forex.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/12/banking-giant-blockchain-forex.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/12/banking-giant-blockchain-forex.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>With the breakneck speed at which technology has evolved over the last few decades, humanity has seen innovations that our forefathers couldn’t even have imagined. From the first computers coming online, to the smartphones that are now globally connected and glued to everyone’s hands, technology has come a long way in a short time – [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/14/blockchain-might-it-be-the-answer-to-redefining-finance/\">Blockchain – Might It Be the Answer to Redefining Finance</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]