[
  {
    "source": "Decrypt",
    "date": "2023-07-14T13:51:02.000Z",
    "title": "What Are CryptoPunks? The Ethereum NFT Sensation's Wild Ride",
    "url": "https://decrypt.co/resources/what-are-cryptopunks-ethereum-nft-avatars",
    "description": "Some of the oldest ever NFTs are now some of the most desirable—and expensive—crypto collectibles. Here’s what they are—and how you can buy your own."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-14T14:00:38.000Z",
    "title": "Crypto exchange report shows downward slide for first half of year",
    "url": "https://cryptodaily.co.uk/2023/07/crypto-exchange-report-shows-downward-slide-for-first-half-of-year",
    "description": "<p>The landscape of crypto exchanges was anything but calm, as revealed by TokenInsight's Q2 2023 Crypto Exchange Report.&nbsp;</p>\n<p>While Bitcoin, the leading cryptocurrency, kept its cool around the $30,000 mark, the world of crypto exchanges was buzzing like a beehive.&nbsp;</p>\nBig four exchanges still dominate\n<p>The Q2 2023 Crypto Exchange Report from TokenInsight gives a peek into this hive. The top 10 exchanges saw a trading volume of $8.3 trillion in Q2, which is a 23% slide down the hill from the previous quarter.&nbsp;</p>\n<p>Despite this downhill ride, the big four - Binance, OKX, Bybit, and Bitget - held their ground, accounting for a hefty 85% of the total market. Even with a 3% dip in market share, Binance still holds sway with over 50% of the total trading volume.&nbsp;</p>\nBinance still commands the market\n<p>The report also highlighted shifts in market share. Binance saw a slight decrease in its dominance, but it still held a commanding lead with over half the market share. Meanwhile, exchanges like OKX, Bybit, Bitget, MEXC, and Huobi saw their market shares rise. On the flip side, Upbit and Coinbase saw a slight dip.&nbsp;</p>\nSpot trading\n<p>In the area of spot trading, the top 10 exchanges had a volume of $1.3 trillion in Q2, which resulted in a 45% decrease from Q1. Binance continued its dominance of the spot market, with a 55.33% market share. Bitget and Bybit made significant strides, increasing their market shares, while Upbit took a hit due to regulatory changes in South Korea.&nbsp;</p>\nDerivatives\n<p>The derivatives market held up a bit better, with a 14.6% decrease from Q1 and a 50.7% decrease from Q2 2022. Binance kept hold of a large part of the derivatives niche with a 54% market share, followed by OKX with 18%.&nbsp;</p>\nExchange tokens\n<p>Lastly, the report gave some insights into the performance of exchange tokens. Bitget's $BGB led the way with a 22.6% price increase in Q2. Bitfinex's $LEO wasn't far behind, with a 15.4% increase. $OKB of OKX also had a good run, with a 7.1% increase.</p>\n\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T14:03:21.000Z",
    "title": "Upbit releases translated version of EU’s MiCA: will South Korea follow suit?",
    "url": "https://www.cryptopolitan.com/upbit-releases-translated-version-of-eus-mica-will-south-korea-follow-suit/",
    "description": "South Korea&#8217;s largest cryptocurrency exchange, Upbit, has recently made a significant move by releasing a comprehensive Korean-language version of the European Union&#8217;s Markets in Crypto-Assets (MiCA) legislation. This development suggests that Korean exchanges are keeping a close eye on the regulatory landscape in Europe and preparing for the potential adoption of rules based on MiCA ... <a title=\"Upbit releases translated version of EU&#8217;s MiCA: will South Korea follow suit?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/upbit-releases-translated-version-of-eus-mica-will-south-korea-follow-suit/\" aria-label=\"More on Upbit releases translated version of EU&#8217;s MiCA: will South Korea follow suit?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T14:01:12.000Z",
    "title": "Beware of crypto scams amid the XRP hype",
    "url": "https://www.cryptopolitan.com/beware-of-crypto-scams-amid-the-xrp-hype/",
    "description": "The recent legal victory of Ripple Labs, with the courts declaring its XRP token as not a security, has stirred up a surge of excitement among investors and cryptocurrency enthusiasts. However, with heightened interest comes a surge in potential scams, a matter that Ripple&#8217;s Chief Technology Officer, David Schwartz, has passionately highlighted to protect the ... <a title=\"Beware of crypto scams amid the XRP hype\" class=\"read-more\" href=\"https://www.cryptopolitan.com/beware-of-crypto-scams-amid-the-xrp-hype/\" aria-label=\"More on Beware of crypto scams amid the XRP hype\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T13:57:24.000Z",
    "title": "PUMA, Roc Nation, and NFT’s Legitimate unite to release a sneaker collection",
    "url": "https://www.cryptopolitan.com/puma-roc-nation-legitimate-sneaker-nft/",
    "description": "Legitimate, a non-fungible token (NFT) company, has teamed up with footwear titan PUMA and entertainment agency Roc Nation to launch a sneaker collection. The collection, entitled &#8220;Evolution of the Mixtape,&#8221; celebrates the 50th anniversary of hip-hop and grants buyers access to exclusive music content curated by Roc Nation. Step up your sneaker game with the ... <a title=\"PUMA, Roc Nation, and NFT&#8217;s Legitimate unite to release a sneaker collection\" class=\"read-more\" href=\"https://www.cryptopolitan.com/puma-roc-nation-legitimate-sneaker-nft/\" aria-label=\"More on PUMA, Roc Nation, and NFT&#8217;s Legitimate unite to release a sneaker collection\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T13:50:56.000Z",
    "title": "Major warning: U.S. economy on the brink of recession",
    "url": "https://www.cryptopolitan.com/us-economy-on-the-brink-of-recession/",
    "description": "Barely escaping a 3-in-5 likelihood, the U.S. economy finds itself precariously positioned on the edge of a potential recession by July 2024. A precipitous fall in these odds, from a staggering 64 percent in March 2023, underscores the growing concern and uncertainty among economists. This downturn looms over the economic landscape, a thundercloud waiting to ... <a title=\"Major warning: U.S. economy on the brink of recession\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-economy-on-the-brink-of-recession/\" aria-label=\"More on Major warning: U.S. economy on the brink of recession\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T13:41:26.000Z",
    "title": "Argentina’s central bank in crisis mode with yuan and USD",
    "url": "https://www.cryptopolitan.com/argentina-in-crisis-mode-with-yuan-and-usd/",
    "description": "Argentina&#8217;s financial system stands precariously balanced on a tightrope as the country&#8217;s Central Bank resorts to desperate measures in an attempt to stabilize a tumultuous economic climate. Grappling with a weakening USD and a hefty yuan loan, the bank now finds itself embroiled in a complex financial crisis that has sent ripples across Argentina&#8217;s economic ... <a title=\"Argentina&#8217;s central bank in crisis mode with yuan and USD\" class=\"read-more\" href=\"https://www.cryptopolitan.com/argentina-in-crisis-mode-with-yuan-and-usd/\" aria-label=\"More on Argentina&#8217;s central bank in crisis mode with yuan and USD\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-14T14:00:44.000Z",
    "title": "Crypto Liquidations Cross $300 Million Amid Massive Market Recovery",
    "url": "https://www.newsbtc.com/crypto/crypto-liquidations-cross-300-million/",
    "description": "The last 24 hours have been more than interesting for crypto investors across the globe. Thursday, July 13, saw one of the most important lawsuits in the history of the industry come to an end, and the ruling in favor of Ripple triggered a massive rally. As digital assets across the space recorded double-digit gains, liquidation volumes climbed quickly, now clocking over $300 million. Crypto Short Traders Take Big Losses The high volumes of crypto liquidations in the market so far have been a result of price recovery. As such, the vast majority of traders who have been losing money have been short traders, that is, traders who were betting on prices falling rather than recovering. Related Reading: Polygon Upgrade Proposal Pushes Price Over 5%, Is It Too Late To Buy? According to data from Coinglass, out of the over $300 million in liquidations, short traders made up for a total of $219 million. On the flip side, the volume from long traders was much lower, coming in at only $82.74 million for the same 24-hour period. This means that short traders made up 70.33% of all liquidations during this time, as long traders made the most money. Furthermore, over 86,000 traders saw their positions liquidated on the last day, but the single largest liquidation happened on the Bitmex exchange. This position was worth $2.82 million at the time of liquidation, taking place across the XRPUSD pair on the exchange. Liquidations cross $300 million in 24 hours &#124; Source: Coinglass As expected, Bitcoin led the liquidation volumes during this time, but interestingly, Ethereum was not the second-highest volume as it usually is. That title was claimed by XRP traders this time around with a total of $62.17 million liquidated in 24 hours. Will The Liquidations Continue? A major factor behind the liquidations was the wild price fluctuations that were triggered by the Ripple victory. Since the court declared that XRP was not a security, the price of the digital asset rallied over 60%, taking the rest of the crypto market with it. However, as the market has broken into a new trading day, prices are starting to stabilize and liquidations are beginning to settle out. If the market continues like this, then there would not be high liquidation volumes going forward. Unless something triggers a rally or a crash, which would lead to more liquidations. Related Reading: Litecoin Becomes 10th-Largest Cryptocurrency, But Is There Still Room To Run? For now, the prices of digital assets such as Bitcoin, Ethereum, and XRP are holding their gains from yesterday quite well. BTC’s price is still above $31,000, ETH is trading slightly below $2,000, and XRP is still seeing 60% gains with its price sitting at $0.779 at the time of this writing. Total crypto market cap crosses $1.2 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-14T13:47:10.000Z",
    "title": "NaturesGold Token Joins Chainlink BUILD, Revolutionizing the Tokenization of In-Ground Gold Deposits – Is LINK Poised for a Rally?",
    "url": "https://www.crypto-news-flash.com/naturesgold-token-joins-chainlink-build-revolutionizing-the-tokenization-of-in-ground-gold-deposits-is-link-poised-for-a-rally/?utm_source=rss&utm_medium=rss&utm_campaign=naturesgold-token-joins-chainlink-build-revolutionizing-the-tokenization-of-in-ground-gold-deposits-is-link-poised-for-a-rally",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink X SWIFT\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-300x158.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-1024x538.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-768x403.jpeg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-351x185.jpeg 351w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-24x13.jpeg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-36x19.jpeg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-48x25.jpeg 48w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />NaturesGold token has joined Chainlink BUILD program. The collaboration is mutually beneficial and will help drive Web3.0 innovations. In a recent development, NaturesGold Token has officially joined the Chainlink BUILD program in a bid to enhance the expansion of its ecosystem. The integration is also billed to promote the long-term use of its unique asset [...]"
  }
]