[
  {
    "source": "Decrypt",
    "date": "2023-11-03T21:01:12.000Z",
    "title": "This Week in Coins: Bitcoin Rally Cools and Solana Explodes",
    "url": "https://decrypt.co/204370/this-week-in-coins-bitcoin-rally-cools-and-solana-explodes",
    "description": "Bitcoin’s ETF hype-inspired rally may have run out of steam, but several leading altcoins still surged."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-03T20:56:33.000Z",
    "title": "Dogecoin Sweepstakes Case Heads to the Supreme Court",
    "url": "https://decrypt.co/204381/dogecoin-sweepstakes-case-heads-to-the-supreme-court",
    "description": "A Coinbase promotion tried to harness the popularity and whimsy of the memecoin, but participants say they missed the fine print."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-03T20:49:46.000Z",
    "title": "NFTs Are Back? Sales Jump 32% in October, Led by Ethereum",
    "url": "https://decrypt.co/204379/nfts-back-sales-jump-32-october-led-ethereum-dappradar",
    "description": "After months of falling sales, the NFT market grew substantially in October, per data from DappRadar—even if it's still far from the peak."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-03T21:00:24.000Z",
    "title": "Cardano’s Whale Watch: ADA Market Cap Jumps Over 10% Amid On-Chain Frenzy",
    "url": "https://www.newsbtc.com/news/cardano/cardanos-whale-watch-ada-market-cap-jumps/",
    "description": "Cardano (ADA) has recently experienced a notable surge in market capitalization. Blockchain analytics firm Santiment reported a 9% increase in ADA&#8217;s market cap over the past day, which adds to a more than 20% rise over the last two weeks. This growth spurt in valuation aligns with heightened activity on the Cardano network, specifically among large-scale holders, commonly referred to as &#8216;whales.&#8217; Related Reading: Cardano Summit 2023: Charles Hoskinson Takes The Stage, Day 1 Recap Cardano On-Chain Data Signals Bullish Behavior For ADA Before this latest rise in value, several on-chain metrics hinted at the potential for a short-term increase in ADA&#8217;s price. Santiment&#8217;s analysis pointed out that two key indicators—address activity and whale transactions—had spiked to levels not seen in three months. This kind of on-chain behavior often precedes market movements, drawing the attention of investors and analysts alike. Digging deeper into the Cardano blockchain data, there&#8217;s been a 23% rise in address activity over the past three weeks, according to Santiment, suggesting a growing use case or increased speculation about the altcoin&#8217;s future. Concurrently, whale transactions, which are large transfers of ADA often indicative of deep-pocketed investors&#8217; movements, have shot up by more than 32%. Such significant transactions can substantially impact market sentiment, potentially leading to price volatility or, in this case, a bullish trend for ADA. 📈 #Cardano has been the big story Thursday, with its market cap growing +9% in the past 24 hours and now +36% over 2 weeks. As usual, #onchain activity hinted at this #bullish action with $ADA address activity &#38; whale transaction at their highest in 3+ months.… pic.twitter.com/IYBBk3ssf4 — Santiment (@santimentfeed) November 2, 2023 ADA Latest Price Action: Market Surges Over 10% Meanwhile, in a development that aligns with market expectations, ADA&#8217;s price has sustained a bullish trend over recent weeks. Correspondingly, the altcoin&#8217;s market capitalization has reflected this positive momentum, swelling by approximately 11.4% in the past week and by nearly 30% in the past two weeks. Significantly, ADA&#8217;s market cap has surpassed the $11 billion mark, climbing from the earlier monthly low of around $9 billion. This uptick in market cap value has seen ADA achieve a trading price of $0.32 at the current time, marking an increase of close to 5% in just the last 24 hours. Further bolstering the optimistic market sentiment, ADA’s daily trading volumes have experienced a substantial increase. Where just last Friday, the trading volume hovered around $214 million, there has been a remarkable swell, with the figure soaring to nearly $500 million in the past day. Related Reading: ADA Price Prediction – 10% Surge In Two Days, Bulls Aim For $0.35 This enhanced trading activity, coupled with the market cap growth, signals a robust investor interest in ADA, potentially indicative of broader market confidence in the altcoin&#8217;s prospects.  Featured image from Unsplash, Chart from TradingView"
  }
]