[
  {
    "source": "Decrypt",
    "date": "2023-06-14T20:32:19.000Z",
    "title": "Unleash ChatGPT: The Top 7 Plugins You Should Know in 2023",
    "url": "https://decrypt.co/144661/unleash-chatgpt-the-top-7-plugins-you-should-know-in-2023",
    "description": "ChatGPT plugins integrate other apps into the OpenAI chatbot, enhancing it with diverse, user-friendly AI features."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-14T20:23:46.000Z",
    "title": "This Mobile Puzzle Game Earns You Bitcoin or Ethereum for Playing",
    "url": "https://decrypt.co/144601/this-mobile-puzzle-game-earns-you-bitcoin-ethereum-playing",
    "description": "REVIEW: Stack sats or eke out ETH in Ethereum Blast, a solid but simplistic (and ad-heavy) iOS and Android puzzle game."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-14T20:27:12.000Z",
    "title": "White hat hacker exploits Hashflow for $600K, seemingly just to return funds",
    "url": "https://cryptoslate.com/white-hat-hacker-exploits-hashflow-for-600k-seemingly-just-to-return-funds/",
    "description": "<p>Multi-chain trading platform Hashflow said on June 14 that it suffered an incident affecting hundreds of thousands in funds. $600K affected Hashflow did not explicitly confirm that it had been attacked but said that $600,000 of funds had been affected. It wrote that it is &#8220;addressing the current situation&#8221; and said that all users who [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/white-hat-hacker-exploits-hashflow-for-600k-seemingly-just-to-return-funds/\">White hat hacker exploits Hashflow for $600K, seemingly just to return funds</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-06-14T20:29:45.000Z",
    "title": "Bittrex Granted Permission to Honor Withdrawal Post-Bankruptcy",
    "url": "https://cryptobriefing.com/bittrex-granted-permission-honor-withdrawal/?utm_source=feed&utm_medium=rss",
    "description": "United States District Court for the District of Delaware has authorizedcustomers of Bittrex, a now-defunct cryptocurrency exchange, to withdraw cryptocurrency assets and fiat currency starting on June 15. Bittrex filed..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T20:38:32.000Z",
    "title": "Snoop Dogg’s NFT passport offers virtual fan tour",
    "url": "https://www.cryptopolitan.com/snoop-dogg-nft-passport-virtual-fan-tour/",
    "description": "In a move that further solidifies his reputation as a digital innovator, rap legend Calvin Cordozar Broadus Jr., better known as Snoop Dogg, is once again making waves in the world of Web3 technology. This time, he&#8217;s offering fans an unprecedented virtual window into his life on tour through a pioneering Non-Fungible Token (NFT) project. ... <a title=\"Snoop Dogg&#8217;s NFT passport offers virtual fan tour\" class=\"read-more\" href=\"https://www.cryptopolitan.com/snoop-dogg-nft-passport-virtual-fan-tour/\" aria-label=\"More on Snoop Dogg&#8217;s NFT passport offers virtual fan tour\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T20:31:25.000Z",
    "title": "Australians outraged over crypto payment restrictions",
    "url": "https://www.cryptopolitan.com/australia-outraged-over-crypto-restrictions/",
    "description": "A wave of discontent has swept through Australia&#8217;s crypto landscape. The controversy stems from recent banking restrictions on crypto payments, with users accusing financial institutions of curtailing their economic liberties. While these limitations aim to safeguard customers from crypto scams and fraudulent activities, many citizens deem them as infringements on their rights to manage personal ... <a title=\"Australians outraged over crypto payment restrictions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/australia-outraged-over-crypto-restrictions/\" aria-label=\"More on Australians outraged over crypto payment restrictions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T20:27:40.000Z",
    "title": "Michael Saylor tips future regulation to favor Bitcoin",
    "url": "https://www.cryptopolitan.com/michael-saylor-tips-regulation-favor-bitcoin/",
    "description": "Michael Saylor, co-founder of MicroStrategy and a prominent advocate for Bitcoin, has expressed his belief that enforcement actions taken by US regulators against cryptocurrency firms could ultimately benefit the leading cryptocurrency. Saylor suggested that such actions, including those by the Securities and Exchange Commission (SEC), may result in a Bitcoin-focused industry that could drive its ... <a title=\"Michael Saylor tips future regulation to favor Bitcoin\" class=\"read-more\" href=\"https://www.cryptopolitan.com/michael-saylor-tips-regulation-favor-bitcoin/\" aria-label=\"More on Michael Saylor tips future regulation to favor Bitcoin\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T20:14:38.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 While the crypto market navigated the fallout from the&#160;collapse&#160;of FTX in late 2022, Ava Labs says it dodged the bullet. Ava Labs founder and CEO Emin Gün Sirer assure its stakeholders that FTX impacts very little the companies and projects operating in the Avalanche ecosystem. The company had an account on ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T20:13:10.000Z",
    "title": "Treasury official proposes privacy feature for CBDCs",
    "url": "https://www.cryptopolitan.com/treasury-official-propose-privacy-cbdcs/",
    "description": "The design of a potential digital dollar should take into account privacy and the ability to transact anonymously, according to a United States Treasury official. Graham Steele, the Assistant Secretary for Financial Institutions at the Treasury Department, emphasized this point during a recent conference focused on payments in Texas. He addressed the Federal Reserve’s FedNow ... <a title=\"Treasury official proposes privacy feature for CBDCs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/treasury-official-propose-privacy-cbdcs/\" aria-label=\"More on Treasury official proposes privacy feature for CBDCs\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T20:12:52.000Z",
    "title": "Binance’s Cyprus unit seeks deregistration",
    "url": "https://www.cryptopolitan.com/binances-cyprus-unit-seeks-deregistration/",
    "description": "The biggest crypto exchange, Binance, requests that its Cyprus branch be deregistered to concentrate on its broader European operations. This action was taken as regulatory scrutiny increased, and the U.S. Securities and Exchange Commission (SEC) recently launched a lawsuit. Changpeng Zhao, the CEO of Binance, has refuted claims of market manipulation and selling Bitcoin to ... <a title=\"Binance&#8217;s Cyprus unit seeks deregistration\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binances-cyprus-unit-seeks-deregistration/\" aria-label=\"More on Binance&#8217;s Cyprus unit seeks deregistration\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T20:11:51.000Z",
    "title": "BRICS bank urges global south financial system overhaul",
    "url": "https://www.cryptopolitan.com/brics-bank-global-south-financial-system/",
    "description": "Reform of the global financial structure has become a rallying cry for the New Development Bank (NDB), more commonly known as the BRICS bank. Dilma Rousseff, the bank&#8217;s president and former leader of Brazil, has passionately advocated for a financial framework that specifically addresses the unique needs of the Global South. A system tailored for ... <a title=\"BRICS bank urges global south financial system overhaul\" class=\"read-more\" href=\"https://www.cryptopolitan.com/brics-bank-global-south-financial-system/\" aria-label=\"More on BRICS bank urges global south financial system overhaul\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-14T20:30:05.000Z",
    "title": "GRT Soars 13% As The Graph Prepares To Integrate Arbitrum",
    "url": "https://www.newsbtc.com/news/grt-soars-13-as-the-graph-prepares-to-integrate-arbitrum/",
    "description": "Recent reports reveal that the Graph, a platform used for indexing and querying blockchain data, is in the final stages of migrating to Arbitrum, a popular Ethereum layer-2 protocol. Following this announcement, GRT, the native token of the indexer, is up 13% in four days, per the candlestick arrangement in the daily chart. The Graph Migrating To Arbitrum The decision to migrate to Arbitrum follows a vote after a proposal was floated to move the indexer to the layer-2 platform.  The Graph Improvement Proposal received majority support from the community, necessitating the preparation for the eventual shift to Arbitrum, a layer-2 platform using roll-ups. Like any other off-chain solution, Arbitrum enables high transaction processing, increasing scalability. Related Reading: Crypto Market Bleeds As SEC Pressures Mount, Is It Time To Buy? With better transaction processing capability, transaction costs are lower, allowing high-demand protocols to launch while enjoying high-security levels since all transactions are rolled up and confirmed on the mainnet. According to the development team, the goal is to enhance scalability, boost transaction processing speeds, and, most critically, reduce the costs of data indexing. Tegan Kline, the CEO of one of The Graph’s development teams, Edge &#38; Node, said the community chose Arbitrum due to its speed and affordability: The Graph users have consistently sought solutions to improve gas efficiencies and other aspects of the network. After carefully evaluating available options, the ecosystem chose Arbitrum as the layer-2 scaling solution to provide speed and affordability to protocol developers and network participants. Cheaper Querying Although Ethereum has changed its fee bidding model following the implementation of the EIP-1559, transaction costs are still high, discouraging some users and protocols from using the mainnet. Moreover, as visible by the high network utilization rate, the high demand for the mainnet means users wishing to transact on layer-1 must pay much more to approve their transactions. On Arbitrum, The Graph holders will also delegate GRT tokens more cheaply. Delegated tokens are staked with Indexers, who index and query data.  Following this transition, Indexers stand to receive more GRT rewards since transacting on Arbitrum is relatively cheaper. According to L2 Fees, a fee tracker, every transfer on Arbitrum costs $0.08, multiples cheaper than Ethereum, which stands at $1.24.  Related Reading: Maker (MKR) Records Positive Moves As Majority Of Coins Bleed It is yet to be seen how The Graph will capitalize on “data accessibility,” which Steven Goldfeder, the CEO of Offchain Labs, said Arbitrum offers. However, what’s clear is that The Graph provides a solution for users wishing to query blockchain data more efficiently. Public blockchains such as Ethereum or Bitcoin are designed to store data securely. However, they can make it challenging to retrieve this data reliably. GRT is trading at $0.10, up 13% from this week’s lows when writing on June 14. Feature Image From Canva, Chart From TradingView"
  }
]