[
  {
    "source": "Cointelegraph",
    "date": "2023-12-05T23:04:25.000Z",
    "title": " Coinbase rolls out crypto transfers via links sent on WhatsApp, Telegram ",
    "url": "https://cointelegraph.com/news/coinbase-wallet-crypto-transfer-links-social-media-messaging",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMDBkODczOGItZDMwNi00NDhhLTk3MjAtNDU3ZjJmYTRhODY1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Recipients need to download a Coinbase Wallet to receive the funds, but the crypto exchange says they’ve simplified the process for less tech-savvy users.</p>\n                    <p><p >A new feature from Coinbase Wallet allows for the transfer of crypto through a link that can be sent through some of the most popular social media sites and messaging apps as the crypto exchange looks to make its service accessible to a wider market.</p><p >“Users can now send money on any platform that they can share a link,” Coinbase <a href=\"https://www.coinbase.com/blog/with-coinbase-wallet-sending-money-is-now-as-easy-as-sending-a-text\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a Dec. </p><p >There’s no payment fee when sending USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>), a U.S. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Send money anywhere you can send a link.<br><br>Easily. For free.<br><br>⤷ <a href=\"https://t.co/CKyLu1wYEw\">https://t.co/CKyLu1wYEw</a> <a href=\"https://t.co/XX9YaZZEPm\">pic.twitter.com/XX9YaZZEPm</a></p>&mdash; Coinbase Wallet ️ (@CoinbaseWallet) <a href=\"https://twitter.com/CoinbaseWallet/status/1732091130169176510?ref_src=twsrc%5Etfw\">December 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p >Clicking the link will take the recipient to their device’s app store to download Coinbase Wallet — if not already downloaded — where they can create a wallet in one click, Coinbase noted.</p><p >If the funds aren’t claimed within two weeks, they will be returned to the sender.</p><p >Coinbase also made a “simple mode” for its wallet to help new and less savvy tech users which only shows basic functions like buying, sending, receiving and viewing assets.</p><p ><strong><em>Related:</em></strong><a href=\"https://cointelegraph.com/news/how-prepare-next-crypto-bull-market-5-simple-steps\"><strong><em> </em></strong><strong><em>How to prepare for the next crypto bull market: 5 simple steps</em></strong></a></p><p><a href=\"https://cointelegraph.com/news/coinbase-wallet-crypto-transfer-links-social-media-messaging\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-05T22:50:58.000Z",
    "title": "Spotlight on AI, digital assets at House subcommittee hearing",
    "url": "https://cryptoslate.com/spotlight-on-ai-digital-assets-at-house-subcommittee-hearing/",
    "description": "<p>The House Financial Services Subcommittee on Digital Assets, Financial Technology, and Inclusion convened a pivotal hearing on Dec. 5, to hear from high-ranking representatives from federal agencies, including the Federal Reserve, Securities and Exchange Commission (SEC), and the Office of the Comptroller of the Currency (OCC), spoke on the increasing influence of new technologies such [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/spotlight-on-ai-digital-assets-at-house-subcommittee-hearing/\">Spotlight on AI, digital assets at House subcommittee hearing</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-05T23:01:44.000Z",
    "title": "Coinbase Wallet unveils USDC transfers via Facebook, TikTok, and WhatsApp",
    "url": "https://cryptobriefing.com/coinbase-wallet-usdc-transfers-facebook-tiktok-whatsapp/?utm_source=feed&utm_medium=rss",
    "description": "Coinbase wallet now allows USD Coin transfers with no fees through links on messaging, social apps globally."
  },
  {
    "source": "NullTX",
    "date": "2023-12-05T23:05:22.000Z",
    "title": "IOTX Shows Strong Bullish Momentum With Over 50% Gain",
    "url": "https://nulltx.com/iotx-shows-strong-bullish-momentum-with-over-50-gain/",
    "description": "Iotex&#8217;s IOTX has experienced a substantial surge, climbing from $0.2816 to $0.4425, marking an impressive gain of over 50% within the past 24 hours. The cryptocurrency is now eyeing the possibility of surpassing its previous yearly high if this upward momentum continues. The sudden surge was triggered after a significant [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-05T22:57:49.000Z",
    "title": "Aurora Achieves Remarkable Yearly Highs At $0.6746 Following Recent Performance",
    "url": "https://nulltx.com/aurora-achieves-remarkable-yearly-highs-at-0-6746-following-recent-performance/",
    "description": "Under the governance of AuroraDAO, Aurora emerges as a valuable tool facilitating the smooth transition of Ethereum users and dApps to the NEAR blockchain. Its versatile functionalities include allowing users to upload and interact with Solidity smart contracts on the NEAR blockchain and facilitating the movement of assets, including ERC-20 [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-05T23:00:53.000Z",
    "title": "8 Green Candles: Here’s What Happened To Bitcoin The Last Time It Appeared",
    "url": "https://www.newsbtc.com/news/bitcoin/8-green-candles-bitcoin/",
    "description": "Bitcoin is on an impressive run and finally broke above $40,000 for the first time in over a year. This run has been in the making for a few months with the climax coming between the months of October and December. As a result, Bitcoin has now recorded 8 green candles on the weekly chart and historical performance suggests that this is bullish for the price. 8 Green Candles For BTC On The Weekly Chart In the last two months, the Bitcoin price has consistently closed in the green, a trend that seemed foreign only a few months ago. This green trend has continued through November which was expected to be a bearish month and with the start of December, Bitcoin saw another green weekly close. Related Reading: LUNC Stuns With 300% Gains, Can It Reach Its Previous ATH Market Cap? During this time that the BTC price has seen consistent green closes on the weekly chart, the price has gone from as low as $27,000 to as high as $42,000. This means that the price has risen approximately 50%, adding around $15,000 to its value in this two-month period. This comes amid a time of polarizing views between the bulls and the bears despite the bullish indicators continuously winning out. The gains of the last eight weeks have completely washed out a year of intense bearish headwinds and have seen the Bitcoin price completely recover all its losses from the FTX collapse, as well as its far-reaching contagion. BTC price readies for another leg up &#124; Source: BTCUSD on Tradingview.com What Happens To Bitcoin The Last Time? With Bitcoin, historical performance can often be a good pointer to future performance, especially when important trends are being repeated. For example, the last time that the digital asset confirmed 8 green candles on the weekly chart, the price exploded not too long after. Related Reading: AVAX Uprising: Crypto Analyst Predicts Bullish Wave To Push Price To $30 This is seen back in 2017 right at the start of the bull market where the price went from around $1,100 to $2,900 before a slight pullback. However, once the pullback was over, the price would begin another uptrend that would send Bitcoin above $10,000 for the first time ever. If this trend were to repeat itself this time around, then a pullback from this level is likely, but not expected to last. The resulting pump from the pullback will likely be the confirmation of the bull market, leading to a new all-time high price. Bitcoin has also done incredibly well following 8 green candles on the daily charts. As reported by NewBTC, the Bitcoin price has also risen quickly when these green candles appear. As such, it is an all-around bullish signal for Bitcoin. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Eclectic Withcraft, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-05T23:01:24.000Z",
    "title": "US Crypto Firms Break New Record, Spending $18.96 Million on Lobbying in 2023: Report",
    "url": "https://dailyhodl.com/2023/12/05/us-crypto-firms-break-new-record-spending-18-96-million-on-lobbying-in-2023-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/stand-with-crypto-lobby.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/stand-with-crypto-lobby.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/stand-with-crypto-lobby.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/stand-with-crypto-lobby.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/stand-with-crypto-lobby.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/stand-with-crypto-lobby.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/stand-with-crypto-lobby.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>US crypto firms are reportedly breaking records in terms of how much they’ve spent on lobbying in 2023. According to a new report by Reuters, the US crypto industry spent a combined $18.96 million on lobbying in the first three quarters of 2023, $2.86 million more than it spent during the same period in 2022. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/05/us-crypto-firms-break-new-record-spending-18-96-million-on-lobbying-in-2023-report/\">US Crypto Firms Break New Record, Spending $18.96 Million on Lobbying in 2023: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]