[
  {
    "source": "CoinDesk",
    "date": "2023-12-29T21:11:58.000Z",
    "title": "BlackRock, Valkyrie Name Authorized Participants Including JPMorgan for Bitcoin ETF",
    "url": "https://www.coindesk.com/business/2023/12/29/blackrock-names-jp-morgan-jane-street-as-authorized-participants-for-bitcoin-etf/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BlackRock will use J.P. Morgan and Jane Street as their authorized participants. Valkyrie has also named Jane Street in addition to Cantor Fitzgerald."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-29T21:21:46.000Z",
    "title": "PancakeSwap community passes proposal to reduce token supply by 300M",
    "url": "https://cryptoslate.com/pancakeswap-community-passes-proposal-to-reduce-token-supply-by-300m/",
    "description": "<p>In a landmark decision, decentralized exchange (DEX) PancakeSwap has successfully passed a proposal to reduce the total supply of its native token, CAKE, to a maximum cap of 450 million from  750 million. The proposal, which closed on Dec. 29, garnered an overwhelming 97.88% approval rate from the voting community, reflecting a significant shift in [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/pancakeswap-community-passes-proposal-to-reduce-token-supply-by-300m/\">PancakeSwap community passes proposal to reduce token supply by 300M</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T21:38:33.000Z",
    "title": "Crypto’s uncertain path: The Bitcoin ETF dilemma in America",
    "url": "https://www.cryptopolitan.com/the-bitcoin-etf-dilemma-in-america/",
    "description": "The narrative around the emergence of a Bitcoin ETF in the U.S. paints a picture of inevitability and positive outcomes. Recent developments, such as asset management behemoth BlackRock aligning with the Securities and Exchange Commission&#8217;s (SEC) preferred ETF model, indicate a readiness to tap into the so-called “pent-up interest” that Larry Fink of BlackRock referred [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T21:34:45.000Z",
    "title": "CZ’s U.S. departure denied again as sentencing looms",
    "url": "https://www.cryptopolitan.com/cz-us-departure-denied-again/",
    "description": "Changpeng Zhao, commonly known as &#8220;CZ,&#8221; the former CEO of Binance Holdings Ltd., has found himself in a legal bind. His request for permission to leave the United States has been denied once again, as he awaits sentencing for violating banking laws. This second denial of his travel request was ordered by US District Judge [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T21:29:08.000Z",
    "title": "What’s the fate of UK’s housing market in 2024?",
    "url": "https://www.cryptopolitan.com/whats-the-fate-of-uks-housing-market-in-2024/",
    "description": "The UK&#8217;s housing market, a barometer of the nation&#8217;s economic health, is on a trajectory that has both homeowners and potential buyers alike in a state of anticipation. According to Nationwide, a major mortgage lender, the UK housing market experienced a 1.8% decline in 2023. This trend is predicted to either stagnate or continue its [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T21:24:55.000Z",
    "title": "Nigeria’s naira is about to have its worst year ever",
    "url": "https://www.cryptopolitan.com/naira-is-about-to-have-its-worst-year-ever/",
    "description": "The Nigerian naira is teetering on the edge of an unprecedented slump, set to mark its most dismal performance since the nation embraced democracy in 1999. Analysts are casting a bleak forecast for the naira in 2024, following a dramatic plunge of 55% this year to 1,043 per dollar, as reported on Thursday. This nosedive [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T21:17:59.000Z",
    "title": "Zcash and Monero on the chopping block for delisting",
    "url": "https://www.cryptopolitan.com/zcash-monero-on-chopping-block-for-delisting/",
    "description": "In the world of cryptocurrencies, privacy coins like Zcash and Monero are finding themselves increasingly in the crosshairs of major crypto exchanges. Recently, OKX, a prominent player in the crypto exchange arena, announced its decision to delist 20 spot trading pairs, including the top privacy-focused cryptocurrencies Monero (XMR), Zcash (ZEC), and Dash (DASH). This move, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-29T21:14:05.000Z",
    "title": "OKX exchange delists privacy coins, including Monero, Dash, and Zcash",
    "url": "https://www.cryptopolitan.com/okx-delists-privacy-coins-monero-dash-zcash/",
    "description": "OKX, a prominent exchange, announced the delisting of 20 trading pairs, including major privacy coins Monero (XMR), Dash (DASH), and Zcash (ZEC). The decision, effective from January 5, comes as OKX cited non-compliance with its listing criteria for removing these pairs. Delisted trading pairs and OKX&#8217;s criteria The affected trading pairs include KSM-USDC, FLOW-USDC, JST-USDC, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-29T21:38:36.000Z",
    "title": "BlackRock designates JPMorgan, Jane Street as Bitcoin ETF authorized participants",
    "url": "https://crypto.news/blackrock-designates-jpmorgan-jane-street-as-bitcoin-etf-authorized-participants/",
    "description": "BlackRock disclosed JPMorgan Securities and Jane Street as intended participants for its proposed Bitcoin ETF before the SEC decision."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-29T21:30:34.000Z",
    "title": "Why Aleph.im jumped up 61% in just hours today",
    "url": "https://crypto.news/aleph-im-jumped-up-61-in-just-hours-today-why/",
    "description": "Trading volume for Aleph.im spiked 2,430% in the last day to over $7.8 million after being around $310,000 earlier this week. The price of Aleph.im (ALEPH), an Ethereum-based (ETH) token aimed at decentralized cloud services, rose 39% from yesterday&#8217;s closing&#8230;"
  }
]