[
  {
    "source": "Bitcoin.com",
    "date": "2023-05-31T11:30:32.000Z",
    "title": "Crypto Exchange Bybit Granted In-principle Approval to Operate in Kazakhstan",
    "url": "https://news.bitcoin.com/crypto-exchange-bybit-granted-in-principle-approval-to-operate-in-kazakhstan/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_696950431-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto Exchange Bybit Granted In-principle Approval to Operate in Kazakhstan\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_696950431-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_696950431-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_696950431-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_696950431-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_696950431-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_696950431-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_696950431.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Cryptocurrency exchange Bybit has received an in-principle approval to work in Kazakhstan, a jurisdiction increasingly seen by crypto companies as a gateway to the former-Soviet space. The trading platform wants to expand its presence in the region and other emerging markets. Bybit on Route to Winning Kazakhstan Crypto License Singapore-based Bybit, one of the world’s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T11:21:08.000Z",
    "title": "Former TrustToken executive Roshan Dharia assumes leadership of Paxful in a bid for stability",
    "url": "https://www.cryptopolitan.com/former-trusttoken-executive-roshan-dharia-assumes-leadership-of-paxful-in-a-bid-for-stability/",
    "description": "In a twist of digital trading, Roshan Dharia, a well-known figure in the crypto world, is set to don a new hat as the interim CEO of Paxful, an acclaimed peer-to-peer Bitcoin marketplace. This exciting development comes amidst a maelstrom of corporate disagreement and internal struggles within the company. Known for his sterling track record ... <a title=\"Former TrustToken executive Roshan Dharia assumes leadership of Paxful in a bid for stability\" class=\"read-more\" href=\"https://www.cryptopolitan.com/former-trusttoken-executive-roshan-dharia-assumes-leadership-of-paxful-in-a-bid-for-stability/\" aria-label=\"More on Former TrustToken executive Roshan Dharia assumes leadership of Paxful in a bid for stability\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-31T11:10:21.000Z",
    "title": "Shiba Inu: What’s Stifling The Meme Coin From Entering A Bullish Market Phase?",
    "url": "https://www.newsbtc.com/news/shiba-inu-entering-a-bullish-market-phase/",
    "description": "Shiba Inu (SHIB), a popular cryptocurrency known for its vibrant online community and adorable dog-inspired branding, is currently facing a liquidity crisis. The situation has been persistent, with no signs of immediate improvement. Despite its initial success and enthusiastic following, Shiba Inu has encountered challenges related to liquidity, which refers to the ease of buying or selling an asset without causing significant price fluctuations.  Liquidity crises can arise when there is an insufficient number of buyers or sellers in the market, leading to increased volatility and potential difficulties in executing trades. Related Reading: Pepecoin Eyes Rebound As It Finds Support In Strong Algorithm Data Score Constrained Volume And Diminished Stability The meme coin finds itself entangled in a liquidity crisis, which is primarily characterized by restricted availability of its tradable tokens. Insufficient liquidity jeopardizes the stability of the asset, creating a discouraging environment for potential investors and causing existing holders to reconsider their positions.  As a result, SHIB&#8217;s upward price momentum is stifled, impeding its progress, and hindering its ability to enter an uptrend.  Related Reading: Floki Inu: Does Meme Coin Have What It Takes To Re-Enter Top 100 Spot? Underwhelming APYs Adding to the liquidity challenges, the liquidity pools associated with SHIB offer unimpressive Annual Percentage Yields (APYs). These lackluster returns serve as an additional burden for liquidity providers, as they are not sufficiently incentivized to stake their SHIB tokens in decentralized finance (DeFi) pools.  The unappealing APYs further contribute to the scarcity of liquidity, exacerbating SHIB&#8217;s liquidity crisis. Low TVL: A Sign Of Investor Mistrust The Total Value Locked (TVL), which represents the total assets staked in SHIB&#8217;s network or DeFi protocols, is another worrying aspect of the liquidity crisis. A low TVL indicates diminished activity within the network and is often interpreted as a lack of investor trust in the asset&#8217;s potential for generating yield.  This lack of engagement from investors acts as a deterrent, impeding the inflow of new capital into SHIB and subsequently curbing its price growth. Shiba Inu Price Shiba Inu&#8217;s price on CoinGecko stands at a minuscule $0.00000853, experiencing a 2.3% dip over the past 24 hours and a gradual seven-day decline of 1.6%. Source: Coingecko Shiba Inu&#8217;s liquidity crisis has undoubtedly posed challenges to its stability and growth. Nevertheless, with a dedicated community and a proactive approach, the path to overcoming these obstacles can be paved. By fostering a robust and liquid market, Shiba Inu can regain investor trust, attract new users, and stimulate price growth. As the journey unfolds, the cryptocurrency world watches with anticipation to see how Shiba Inu will navigate its liquidity challenges and continue its quest for success in the ever-evolving digital landscape. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk) -Featured image from The Sports Physio"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-05-31T11:11:04.000Z",
    "title": "A Review of Paradox Metaverse",
    "url": "https://www.altcoinbuzz.io/metaverse/a-review-of-paradox-metaverse/",
    "description": "<p>Unreal Engine 5, AAA games, and blockchain. Sounds familiar? There are a handful of on-chain games available that have these features. The Paradox Metaverse is one of them. It&#8217;s free-to-play and Play-to-Earn (P2E) that has its own native currency and ecosystem. So, let&#8217;s take a dive into the Paradox Metaverse. The following video gives a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/metaverse/a-review-of-paradox-metaverse/\">A Review of Paradox Metaverse</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-31T11:21:38.000Z",
    "title": "Bitcoin Outperforms Major Commodities Over Last 90 Days: Glassnode",
    "url": "https://coinedition.com/bitcoin-outperforms-major-commodities-over-last-90-days-glassnode/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/latest_Week_On_Chain_evaluating_the_equilibrium_present_in_the_current-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/latest_Week_On_Chain_evaluating_the_equilibrium_present_in_the_current-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/latest_Week_On_Chain_evaluating_the_equilibrium_present_in_the_current-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/latest_Week_On_Chain_evaluating_the_equilibrium_present_in_the_current-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/latest_Week_On_Chain_evaluating_the_equilibrium_present_in_the_current-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/latest_Week_On_Chain_evaluating_the_equilibrium_present_in_the_current-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/latest_Week_On_Chain_evaluating_the_equilibrium_present_in_the_current.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Glassnode revealed that Bitcoin has emerged as the strongest performing asset as compared to other major commodities. According to data from Glassnode, a prominent market intelligence firm, recent trends in the financial markets show mixed performance across various assets. Over the last 90 days, crude oil (WTI) has experienced a decline of 4.0%. In contrast, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-outperforms-major-commodities-over-last-90-days-glassnode/\">Bitcoin Outperforms Major Commodities Over Last 90 Days: Glassnode</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]