[
  {
    "source": "CryptoSlate",
    "date": "2023-09-26T20:50:52.000Z",
    "title": "Lawmakers from both parties urge Gensler to approve spot Bitcoin ETF ‘immediately’",
    "url": "https://cryptoslate.com/lawmakers-from-both-parties-urge-gensler-to-approve-spot-bitcoin-etf-immediately/",
    "description": "<p>Four members of Congress have dispatched a letter to the Securities and Exchange Commission (SEC) today calling for immediate approval of a spot Bitcoin Exchange-Traded Fund (ETF). The letter argues that the SEC&#8217;s recent appeals court loss to Grayscale Investments underscores the untenability and unlawfulness of the agency&#8217;s existing policy of rejecting such ETFs. &#8220;There [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/lawmakers-from-both-parties-urge-gensler-to-approve-spot-bitcoin-etf-immediately/\">Lawmakers from both parties urge Gensler to approve spot Bitcoin ETF &#8216;immediately&#8217;</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T21:05:51.000Z",
    "title": "Musk’s X outshines as Zuck’s Threads lags",
    "url": "https://www.cryptopolitan.com/musks-x-outshines-as-zucks-threads-lags/",
    "description": "While the digital arena usually presents itself as a whirlwind of innovation, not every product launched in this space garners the spotlight. Meta&#8217;s latest endeavor, Threads, finds itself dwindling in the race for users&#8217; attention, overshadowed by the more resilient X, backed by none other than tech magnate Elon Musk. Meta&#8217;s Threads: A Star that ... <a title=\"Musk&#8217;s X outshines as Zuck&#8217;s Threads lags\" class=\"read-more\" href=\"https://www.cryptopolitan.com/musks-x-outshines-as-zucks-threads-lags/\" aria-label=\"More on Musk&#8217;s X outshines as Zuck&#8217;s Threads lags\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T20:56:00.000Z",
    "title": "The US-China estrangement no one’s talking about",
    "url": "https://www.cryptopolitan.com/us-china-estrangement-no-ones-talking-about/",
    "description": "Tensions are nothing new when discussing the US-China dynamic. Yet, beneath the surface of mainstream discussions, a different type of estrangement looms &#8211; a financial divergence that might very well reshape global investment patterns for years to come. Shifting Sands in Private Equity Land Dive deep into the world of private equity, and you&#8217;ll find ... <a title=\"The US-China estrangement no one&#8217;s talking about\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-china-estrangement-no-ones-talking-about/\" aria-label=\"More on The US-China estrangement no one&#8217;s talking about\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T20:46:43.000Z",
    "title": "Why does the Federal Reserve hate stablecoins so much?",
    "url": "https://www.cryptopolitan.com/why-the-federal-reserve-hate-stablecoins/",
    "description": "Ever wonder why the Fed seems to have an aversion to stablecoins? An unsettling thought for crypto enthusiasts, it&#8217;s clear the Federal Reserve has its reservations. A recent exploration into the matter brought to light intriguing comparisons between the seemingly resilient stablecoins and the age-old money market funds, suggesting that these contemporary digital assets might, ... <a title=\"Why does the Federal Reserve hate stablecoins so much?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-the-federal-reserve-hate-stablecoins/\" aria-label=\"More on Why does the Federal Reserve hate stablecoins so much?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T20:45:13.000Z",
    "title": "Ripple taps ex-Obama White House official to head U.S. public policy",
    "url": "https://www.cryptopolitan.com/ripple-taps-ex-obama-white-house-official/",
    "description": "In an effort to strengthen its position in the rapidly evolving regulatory landscape of the crypto industry, Ripple has recruited Lauren Belive, a former Obama administration White House official. Belive, who has extensive expertise in government affairs, will serve as the head of public policy and government for the United States at Ripple. Who is ... <a title=\"Ripple taps ex-Obama White House official to head U.S. public policy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-taps-ex-obama-white-house-official/\" aria-label=\"More on Ripple taps ex-Obama White House official to head U.S. public policy\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-26T21:00:40.000Z",
    "title": "Bitcoin In Spotlight: Robert Kiyosaki Questions BTC’s Future Amid Citibank’s Blockchain Play",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-in-spotlight-robert-kiyosaki-questions-btc/",
    "description": "The financial sector was abuzz recently, with Citibank announcing a platform backed by blockchain technology to transform institutional savings into tokens. This news drew interest from various quarters, including prominent financial educator and &#8220;Rich Dad Poor Dad&#8221; author Robert Kiyosaki, who tied it to Bitcoin. Using the X (formerly known as Twitter) platform, Kiyosaki expressed curiosity about the potential ramifications this could have for Bitcoin and the US dollar, igniting a flurry of responses from the online community. Related Reading: Why This Bank CEO Wants 99% Of The Crypto Industry Gone Citibank&#8217;s Dive Into Tokenization Citibank&#8217;s recent dive into the realm of blockchain technology marks a significant shift for the institution. Their new offering, a tokenization service, specifically focuses on cash management within the finance sphere. This latest development is tailored to cater to institutional clients&#8217; unique needs, leveraging blockchain technology&#8217;s features and smart contracts. The announcement by the bank provides a deeper insight into the vision behind this initiative. According to the update, Citibank intends these smart contracts to act as modern substitutes for long-standing banking instruments like bank guarantees and letters of credit. The decision symbolizes not just an adaptation to current technological trends but a response to the changing dynamics of the financial world. At its core, Citibank&#8217;s strategy revolves around recognizing and meeting the growing demand for &#8216;always-on,&#8217; flexible financial services. This demand comes in an age where businesses operate globally, and the need for instantaneous transactions is paramount. To address this, Citi Token Services is poised to change how institutions handle their finances. The service promises to enable uninterrupted cross-border payments, ensure liquidity, and deliver automated trade finance solutions, all operating on a 24/7 basis.  Kiyosaki&#8217;s Inquiry And The Crypto Community&#8217;s Response Kiyosaki’s inquiry on the X platform was straightforward: with Citibank&#8217;s new technological adoption, is this the end of Bitcoin and the US dollar as we know them? The crypto community was swift in its response, dismissing any looming threats to Bitcoin due to Citibank’s tokenization initiative. BYE BYE Bitcoin &#38; US Dollar? Citibank announced today it is offering bank block chain technology to turn institutional savings into Citibank tokens which can be used for instaneous 24/7 cross border transactions. Bye bye BC &#38; US $? — Robert Kiyosaki (@theRealKiyosaki) September 26, 2023 Shivam Sharma, a user on the X platform, emphasized the unique value proposition of Bitcoin, noting that Citibank&#8217;s tokens are essentially digital ledgers. They operate in a different space, he suggests, from Bitcoin, which has carved its niche as a decentralized currency. Related Reading: Is The Bitcoin Dream Fading? Glassnode Data Reveals Newbies Facing Steep Losses Another user with the handle Happenings NFT said: A software is not an asset &#38; other banks don’t trust other banks. Banks will need a third party to facilitate instant cross-border payments because they don’t trust each other. This is why the JPM coin didn’t work.&#8221; Featured image from iStock, Chart from TradingView"
  }
]