[
  {
    "source": "CryptoGlobe",
    "date": "2023-09-29T01:00:00.000Z",
    "title": "Crypto.com Becomes a ‘Preferred’ Exchange for PayPal’s PYUSD Stablecoin",
    "url": "https://www.cryptoglobe.com/latest/2023/09/crypto-com-becomes-a-preferred-exchange-for-paypals-pyusd-stablecoin/",
    "description": "Popular Singapore-based cryptocurrency exchange Crypto.com has announced a new partnership with PayPal and Paxos for it to become a preferred exchange for the PayPal USD (PYUSD) stablecoin that the payments giant launched last month. The cryptocurrency exchange has said in a press release that it has already listed PYUSD on its platform for both retail […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T00:58:34.000Z",
    "title": "Yaccarino promises a fresh start for troubled X bankers",
    "url": "https://www.cryptopolitan.com/yaccarino-fresh-start-for-troubled-x-bankers/",
    "description": "In the complex world of finance and social media mergers, few have been as rife with tension and turmoil as Elon Musk&#8217;s acquisition of what we once recognized as Twitter. Now called X, the platform is facing its share of challenges. At the heart of the storm stands Linda Yaccarino, the woman who&#8217;s now tasked ... <a title=\"Yaccarino promises a fresh start for troubled X bankers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/yaccarino-fresh-start-for-troubled-x-bankers/\" aria-label=\"More on Yaccarino promises a fresh start for troubled X bankers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T00:51:26.000Z",
    "title": "Is China even worth the headache its giving Europe?",
    "url": "https://www.cryptopolitan.com/china-worth-the-headache-its-giving-europe/",
    "description": "Europe&#8217;s foray into international trade with China hasn&#8217;t been a walk in the park. As economic dynamics shift and political leaders grapple with decisions that could define the future of their economies, many are left wondering: is engaging with China worth all the troubles it&#8217;s been causing? A Sea Change in EU&#8217;s Trade Philosophy The ... <a title=\"Is China even worth the headache its giving Europe?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-worth-the-headache-its-giving-europe/\" aria-label=\"More on Is China even worth the headache its giving Europe?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T00:45:40.000Z",
    "title": "Bank of England shakes up lending for non-banks",
    "url": "https://www.cryptopolitan.com/bank-of-england-change-lending-for-non-banks/",
    "description": "In a groundbreaking move, England&#8217;s central bank, the Bank of England, is shaking up the financial sphere, embarking on a mission to offer a continuous lending hand to non-bank financial entities, specifically during periods of financial strain. This new initiative underscores the pressing necessity to adapt and evolve in an ever-changing financial environment, especially as ... <a title=\"Bank of England shakes up lending for non-banks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bank-of-england-change-lending-for-non-banks/\" aria-label=\"More on Bank of England shakes up lending for non-banks\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-29T01:00:23.000Z",
    "title": "Billionaire Takes Over As GameStop CEO, Bullish For Dogecoin?",
    "url": "https://www.newsbtc.com/news/dogecoin/gamestop-billionaire-ceo-bullish-dogecoin/",
    "description": "Billionaire investor Ryan Cohen has been appointed as the new Chief Executive Officer (CEO) of GameStop, a brick-and-mortar video game retailer in the United States, a move that could potentially impact Dogecoin. GameStop&#8217;s stock and the Dogecoin price have shown signs of correlation. Before assuming this role, Cohen had been the Executive Chairman of GameStop since January 2022 and remained the largest shareholder. The experienced investor takes over in what analysts said is an attempt by the board to turn around the fortunes of the public company. Pro-GameStop Billionaire Takes Over As CEO In this role, Cohen takes over as the President, Chief Executive, and Chairman of GameStop, representing a move to overhaul and possibly revive the company&#8217;s leadership structure. While he assumes several positions, reports indicate that the billionaire won&#8217;t receive a salary.  Following news of Cohen&#8217;s announcement, GameStop prices surged 10%. Analysts interpret this expansion as confidence in the experienced investor&#8217;s capability and even genuine commitment to sparking a turnaround following challenges in 2022 and the shifting landscape that has seen sales in brick-and-mortar stores fall.  Related Reading: Research Firm Reveals Its “Altcoin Trading Playbook” The appointment is bullish for GameStop because Cohen is one of the largest shareholders. From September 2020, the billionaire started accumulating aggressively through to December 2020.  The billionaire publicly supported a stock that hedge funds had ignored, as they were betting on a video game retailer to go bankrupt. However, in January 2021, due to a &#8220;short squeeze,&#8221; GameStop&#8217;s stock prices surged by 1,500% as retailers jumped on board, causing the stock to reach around $81. Will Dogecoin Mirror GameStop&#8217;s Rally Of 2021? The sharp expansion of GameStop in January due to FOMO and retailers banking on a &#8220;meme stock&#8221; bear the same characteristics as the sudden rally of Dogecoin in the first half of 2021. At peaks, Dogecoin soared to as high as $0.78 as support from Elon Musk, the world&#8217;s richest entrepreneur, pumped the coin to record levels. The CEO of X openly expressed support for DOGE, even appearing on Sunday Night Live (SNL) as the &#8220;Doge Master.&#8221; Related Reading: Maker (MKR) Rockets To $1,500 With 15% Surge, Will This Run Continue? Beyond Elon Musk, Dogecoin&#8217;s status as the first meme coin and its alignment with the broader trend of meme stocks rallying in early 2021, driven chiefly by online communities and social media, fueled DOGE prices. DOGE prices have since cooled off, falling by over 80% as bears pressed on, reversing the project&#8217;s huge valuations. Even so, supporters remain bullish, expecting the meme coin to recover in the sessions ahead.  It remains to be seen if Elon Musk will continue tweeting frequently about DOGE. The billionaire is being sued in New York for allegedly promoting Dogecoin as a &#8220;get-rich-quick&#8221; scheme. The lawsuit claims that Musk, Tesla, and SpaceX were involved in a &#8220;racketeering conspiracy&#8221; to support DOGE. Feature image from Canva, chart from TradingView"
  }
]