[
  {
    "source": "Cointelegraph",
    "date": "2023-10-25T20:01:22.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "http://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Sam Bankman-Fried will testify at his criminal trial, his defense lawyers confirmed. Meanwhile, crypto trading firm Matrixport has doubled down on its prediction that Bitcoin will hit $45,000 by the end of 2023, and the crypto space is keeping such a close watch on spot Bitcoin ETFs that the Depository Trust and Clearing Corporation’s (DTCC) website crashed.</p><h3>SBF to testify at criminal trial</h3><p>The former FTX CEO, Sam Bankman-Fried, <a href=\"https://cointelegraph.com/news/sam-bankman-fried-testify-criminal-trial\">will testify as part of his defense case</a>, attorney Mark Cohen confirmed on Oct. 25. </p><p>In a telephone conference between Bankman-Fried's legal counsel, prosecutors and Judge Lewis Kaplan, Cohen said his client will take the stand along with three witnesses. The testimony will begin after the prosecution completes its case on Oct. 26. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Subscribe to our ‘1 Minute Letter’ NOW for daily deep-dives straight to your inbox! ⚖️ Be the first to know every twist and turn in the Sam Bankman-Fried case! Subscribe now: <a href=\"https://t.co/jQOIYUv6IW\">https://t.co/jQOIYUv6IW</a>  <a href=\"https://twitter.com/hashtag/SBF?src=hash&amp;ref_src=twsrc%5Etfw\">#SBF</a> <a href=\"https://t.co/gp7zJu5sgy\">pic.twitter.com/gp7zJu5sgy</a></p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1709911708049772942?ref_src=twsrc%5Etfw\">October 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Cohen said that the defense is not expected to take more than three days to <a href=\"https://cointelegraph.com/news/sam-bankman-fried-testify-criminal-trial\">question the potential witnesses</a>.</p><p>Bankman-Fried's testimony would follow statements from other notable former FTX employees, including Caroline Ellison, Gary Wang and Nishad Singh.</p><h3>Matrixport doubles down on $45K Bitcoin year-end prediction</h3><p>Matrixport, a cryptocurrency trading firm founded by Bitmain co-founder Wu Jihan, has doubled down on its prediction that Bitcoin will hit $45,000 by the end of 2023.</p><p>After first setting its 2023-year-end BTC price target at $45,000 in early 2023, Matrixport reiterated its bold Bitcoin prediction in a blog post on Oct. 24.</p><p>Titled “Bitcoin Targets $45,000 — FOMO Is Hitting the Market,” the blog post provides a brief analysis of Matrixport’s previous market forecasts, noting that the firm successfully predicted several market events.</p><p>Matrixport specifically cited its “October Ignites a Bitcoin Boom: Institutions Fueling the Price Surge” report from September 2023, which has so far successfully predicted significant action on the Bitcoin market in October.</p><p>The firm predicted that October would be a strong month for Bitcoin due to excitement around potential approvals of a spot BTC exchange-traded fund (ETF). The firm also pointed out that October has historically been the strongest month for Bitcoin with average returns of 20%.</p><h3>All eyes on DTCC's site for spot Bitcoin ETFs</h3><p>The crypto space has been keeping a close watch on the Depository Trust and Clearing Corporation’s (DTCC) website for any move on a spot Bitcoin (BTC) exchange-traded fund (ETF).</p><p>Eagle-eyed watchers noticed the ticker for BlackRock's ETF — IBTC — <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-ibtc-relisted-dtcc\">vanished from the site</a> before it returned a few hours later. Bitcoin‘s price dropped nearly 3% with the disappearance, indicating much of the trading activity is focused on ETF developments.</p><p>The hype around IBTC also seemingly caused DTCC's site to crash. Senior Bloomberg ETF analyst Eric Balchunas noted the DTCC doesn’t typically get this level of attention, which “speaks to the uniqueness and intensity of this entire  saga.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">DTCC is def not used to this kind of attn or action, it lives behind scenes, very boring. Speaks to the uniqueness and intensity of this entire saga</p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1716857160724820346?ref_src=twsrc%5Etfw\">October 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Early on Oct. 25 <a href=\"https://cointelegraph.com/news/ark-21shares-spot-bitcoin-etf-not-dtcc-listed\">rumors spread across social media</a> that ARK Invest and 21 Shares’ joint spot Bitcoin ETF had been listed on the DTCC’s site — in reality, many mistook ARK’s futures ETF tickers for the pair’s spot fund.</p><p>Social media posts referred to the ticker “ARKA,” the yet-to-be-approved ARK 21Shares Active Bitcoin Futures ETF along with the tickers \"ARKY\" and \"ARKZ\" which respectively refer to the ARK 21Shares Active Ethereum Futures ETF and the ARK 21Shares Active Bitcoin Ethereum  Strategy ETF.</p><p>The most recent amended <a href=\"https://www.sec.gov/Archives/edgar/data/1869699/000119312523254102/d549524ds1a.htm\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> for ARK’s spot Bitcoin ETF from Oct. 11 shows that the fund will trade using the ticker “ARKB.”</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-25T19:46:53.000Z",
    "title": "Neon Machine raises $20M Series A for blockchain-based Call of Duty competitor ‘Shrapnel’",
    "url": "http://cointelegraph.com/news/neon-machine-raises-20-m-series-a-web-3-blockchain-based-call-of-duty-competitor-shrapnel",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/52cf114d-deb5-4583-ade4-fa7e75d5933e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The company claims a cast of employees whose collective entertainment industry resume contains titles such as Halo, Call of Duty, and Westworld.</p>\n                    <p><p>Web3 gaming developer Neon Machine raised $20 million in series A funding toward the development of its highly-anticipated extraction shooter “Shrapnel.” </p><p>This round follows a $10.5 million seed round completed in June of 2021. It was led by Polychain Capital and included funding from Griffin Gaming Partners, Brevan Howard Digital, Franklin Templeton, IOSG Ventures, and Tess Ventures.</p><p>Shrapnel is an ambitious gaming project touted by Neon Machine as a “AAA game” — a non-standard designation used to indicate a video game with top-tier production value, budgeting, and marketing. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/9JPBeF5Unkg\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>According to gameplay footage shown on Neon Machine’s YouTube page and documentation on the game’s website, Shrapnel is a first-person perspective shooter (FPS) featuring multiplayer components. Competition in the game — which currently has yet to enter pre-alpha testing — will purportedly come in the form of “extraction” mechanics requiring the player to escape with any loot they find in game in order to retain those items. </p><p>Early gameplay videos show what appears to be a gameplay loop consistent with Call of Duty: Warzone, a popular free-to-play extraction shooter developed by Microsoft’s Activision-Blizzard-King studios. </p><p>What separates Shrapnel from similar AAA competition is its reliance on Web3 and blockchain. While other games, such as The Division 2 have mechanics in place where players can “extract” valuable items in order to apply them to their character and profiles, <a href=\"https://cointelegraph.com/news/behind-the-scenes-of-the-first-aaa-shooter-game-built-on-the-blockchain\">the assets in Shrapnel are connected to the blockchain</a>.</p><p>According to the studio, this allows the players full ownership over the assets.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blockchain-game-shrapnel-restrict-us-players-fearing-securities-laws\"><strong><em>Shrapnel Web3 shooter won’t let US users cash out, thanks to Gensler</em></strong></a></p><p>Shrapnel will also feature a modding toolset that, theoretically, could allow players or developers to insert other blockchain assets into the game world for players to interact with. This could, hypothetically, create an intriguing scenario for both seasonal competition and tournament play. </p><p>The game is slated for early-access testing for paid subscribers in December, according to a press release from Neon Machine. Once the initial evaluation period ends the company intends to launch the game as a free-to-play title “sometime” in 2024. </p><p>Beyond the development and launch of Shrapnel, Neon Machine has also said that it intends to eventually license its Web3 developer’s API platform, GameBridge, after the launch.</p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-25T20:00:44.000Z",
    "title": "FTX Debtors Evaluate Bids for Dormant Crypto Exchange’s Revival",
    "url": "https://news.bitcoin.com/ftx-debtors-evaluate-bids-for-dormant-crypto-exchanges-revival/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/ftx-2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/ftx-2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ftx-2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ftx-2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ftx-2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ftx-2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ftx-2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ftx-2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Insiders reveal that FTX creditors are sifting through bids from various entities eager to breathe life into the dormant crypto exchange. The company&#8217;s investment banker highlighted that FTX interacts with &#8220;multiple parties every day.&#8221; FTX Creditors Sift Through Offers for Exchange&#8217;s Possible Reawakening Throughout the year, whispers of FTX&#8217;s potential revival have surfaced approximately four [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-25T20:00:10.000Z",
    "title": "Walmart and Outlier Venture to launch 5 Web3 accelerator",
    "url": "https://www.cryptopolitan.com/5-web3-accelerators-by-walmart-and-outlier/",
    "description": "The crypto realm has been met by recent developments that have favored the growth of cryptocurrencies all over the globe and the adoption of Web3. A new venture has been realized as prominent players take to invest in the future of digital currencies.&#160; Outlier Ventures and Walmart have joined forces in launching a groundbreaking milestone ... <a title=\"Walmart and Outlier Venture to launch 5 Web3 accelerator\" class=\"read-more\" href=\"https://www.cryptopolitan.com/5-web3-accelerators-by-walmart-and-outlier/\" aria-label=\"More on Walmart and Outlier Venture to launch 5 Web3 accelerator\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-25T19:52:07.000Z",
    "title": "BRICS comments on Argentina’s intention to dump the Peso for the US Dollar",
    "url": "https://www.cryptopolitan.com/argentina-to-dump-peso-for-usd-brics-speak/",
    "description": "Argentina is facing the worst possible inflation crisis, and the survival of its people is in a risky place. The world of international finance has experienced its fair share of events that have been coupled with decisions that could have far-fetched implications for global economic and political sectors.&#160; Argentina was invited to join the BRICS ... <a title=\"BRICS comments on Argentina&#8217;s intention to dump the Peso for the US Dollar\" class=\"read-more\" href=\"https://www.cryptopolitan.com/argentina-to-dump-peso-for-usd-brics-speak/\" aria-label=\"More on BRICS comments on Argentina&#8217;s intention to dump the Peso for the US Dollar\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-25T19:44:27.000Z",
    "title": "SBF’s defense seeks to highlight Gary Wang and Nishad Singh’s ‘Inconsistent statement’ ",
    "url": "https://www.cryptopolitan.com/sbfs-defense-testimonies-are-inconsistent/",
    "description": "The FTX legal battle representing SBF has been in the spotlight amid new developments in the case that have set the crypto world in awe. In a dramatic turn, the SBF legal defense team has made its intentions clear on claiming ‘inconsistent statements’ made by the prosecution witnesses who took the stand last week.&#160; Among ... <a title=\"SBF’s defense seeks to highlight Gary Wang and Nishad Singh&#8217;s ‘Inconsistent statement’ \" class=\"read-more\" href=\"https://www.cryptopolitan.com/sbfs-defense-testimonies-are-inconsistent/\" aria-label=\"More on SBF’s defense seeks to highlight Gary Wang and Nishad Singh&#8217;s ‘Inconsistent statement’ \">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-25T20:00:38.000Z",
    "title": "Are Bitcoin Derivatives Behind The Latest Rally? Glassnode Answers",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-derivatives-latest-rally-glassnode-answers/",
    "description": "Since the latest Bitcoin rally started, there has been speculation going on as to whether derivatives fuel the surge. Here&#8217;s what Glassnode says. Bitcoin Funding Rates Have Remained Cool Recently In its latest weekly report, the on-chain analytics firm Glassnode has talked about what the derivatives side of the market has looked like while the latest rally in the asset has occurred. First, the report has looked into the open interest of the perpetual swap markets, where &#8220;open interest&#8221; refers to the total amount of Bitcoin contracts currently open. The metric has been measured in terms of BTC here so that the USD price fluctuations don&#8217;t affect the trend. Looks like the value of the metric has plunged in recent days &#124; Source: Glassnode's The Week Onchain - Week 43, 2023 From the chart, it&#8217;s visible that the Bitcoin open interest saw two large liquidation squeezes back in January and August, with the former one being a short squeeze and the latter one being a long squeeze. Related Reading: Will Ethereum Rally Continue? These Could Be The Factors To Watch Since the latest rally started, BTC has observed two liquidation events: one of 25,000 BTC and the other of 33,000 BTC. This combined short squeeze is now of the same scale as the aforementioned mass liquidation events. In terms of the USD values of the liquidation events, the latest squeeze is again comparable with the other ones this year: A large amount of short liquidations seem to have occurred recently &#124; Source: Glassnode's The Week Onchain - Week 43, 2023 On the topic of liquidations, Glassnode reveals that, interestingly, the market has been dominated by long liquidations throughout the history of Bitcoin. There have only been a few phases where shorts have dominated the longs over 30 days. The latest large short liquidations have resulted in the shorts just overtaking the longs, as the chart below shows. Short liquidations have surpassed long liquidations &#124; Source: Glassnode's The Week Onchain - Week 43, 2023 Curiously, it would appear that during the few periods that the short liquidations have dominated the market (highlighted in yellow), Bitcoin has observed a point of extreme in its price. While the liquidation data would suggest that the derivatives have indeed played a role in driving the market through this latest rally, the funding rates could tell a different story. The funding rates have been positive recently &#124; Source: Glassnode's The Week Onchain - Week 43, 2023 &#8220;Of note is that funding rates and cash-and-carry basis in futures markets have remained relatively calm all things considered,&#8221; explains Glassnode. &#8220;2023 has generally seen futures markets yield annualized rates over 6%, which are greater than US treasury rates.&#8221; Related Reading: Bitcoin Long-Term Holders Stay Resolute Despite Rally, Supply Hits New ATH Back in August, however, the selloff cooled off these funding rates, and they have since remained relatively low. Even with the latest chaos in the market, the metric still hasn&#8217;t seen any significant uptick. The analytics firm notes that this could imply the Bitcoin rally is only partially driven by leveraged speculation. BTC Price At the time of writing, Bitcoin is trading at around $34,300, up 23% in the past week. BTC has observed some sharp bullish momentum in the past few days &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-25T20:00:49.000Z",
    "title": "Bitcoin To Repeat Gold’s 475% Post ETF Rally? Bitwise’s Matt Hougan Says Approval Will Unleash New Capital Wave",
    "url": "https://dailyhodl.com/2023/10/25/bitcoin-to-repeat-golds-475-post-etf-rally-bitwises-matt-hougan-says-approval-will-unleash-new-capital-wave/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-to-repeat-rally.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-to-repeat-rally.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-to-repeat-rally.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-to-repeat-rally.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-to-repeat-rally.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-to-repeat-rally.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-to-repeat-rally.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The chief investment officer at the largest crypto index fund manager in the US is very optimistic about what a spot Bitcoin (BTC) exchange-traded fund (ETF) approval could do for the king crypto&#8217;s price. Matt Hougan, CIO of Bitwise, draws a comparison to what happened to gold&#8217;s price after the precious metal secured its first [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/25/bitcoin-to-repeat-golds-475-post-etf-rally-bitwises-matt-hougan-says-approval-will-unleash-new-capital-wave/\">Bitcoin To Repeat Gold’s 475% Post ETF Rally? Bitwise’s Matt Hougan Says Approval Will Unleash New Capital Wave</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-25T19:55:48.000Z",
    "title": "‘Historic Move’ Ahead for Bitcoin With BTC Setup Looking Stronger Than 2020, Says Crypto Analyst",
    "url": "https://dailyhodl.com/2023/10/25/historic-move-ahead-for-bitcoin-with-btc-setup-looking-stronger-than-2020-says-crypto-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/Says-Gold-and-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/Says-Gold-and-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/Says-Gold-and-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/Says-Gold-and-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/Says-Gold-and-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/Says-Gold-and-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/Says-Gold-and-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is predicting an unprecedented bullish move by Bitcoin (BTC) based on two key indicators. Pseudonymous analyst TechDev tells his 419,400 followers on the social media platform X that the total market capitalization of digital assets appears ready for a huge breakout. “The monthly crypto market cap is at its highest [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/25/historic-move-ahead-for-bitcoin-with-btc-setup-looking-stronger-than-2020-says-crypto-analyst/\">‘Historic Move’ Ahead for Bitcoin With BTC Setup Looking Stronger Than 2020, Says Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]