[
  {
    "source": "NewsBTC",
    "date": "2024-04-07T07:47:03.000Z",
    "title": "Genesis Acquires Over 32,000 BTC After Offloading GBTC Shares",
    "url": "https://www.newsbtc.com/crypto/genesis-acquires-over-32000-btc-after-offloading-gbtc-shares/",
    "description": "Embattled crypto lender Genesis Global Capital has continued to ramp up efforts to pay up creditors after filing for bankruptcy protection in January 2023. As part of these efforts, Genesis has now reportedly sold off the entirety of its Grayscale GBTC holdings to acquire a substantial amount of Bitcoin in order to implement its repayment strategy.  Related Reading: Bitcoin Dips, But Don’t Panic: ETFs See Three Days Of Bullish Inflow Genesis Converts GBTC Shares To Bitcoin In Preparation For Debt Settlement According to a Friday report by Bloomberg Law, Genesis finalized the sale of its 36 million GBTC shares, as revealed by the company’s lawyers in a court filing on April 2. Genesis had initially received legal approval to liquidate its GBTC holdings on February 2 with each unit share valued at $38.50. However, court documents showed that the current price of GBTC as at the time of sale on April 2 was $58.50 resulting in a total sale price of $2.1 billion.  Bloomberg’s report disclosed that the bankrupt crypto lender then used these proceeds to purchase 32,041 Bitcoin at a market price of $65,685, which will be distributed to creditors as part of its repayment plan, especially those who were previously enrolled in the Gemini Earn program.  These recent transactions align with Genesis’s bankruptcy plan which allows the conversion of GBTC shares to either Bitcoin or direct cash for the settlement of its existing debt. Currently, the crypto lender owes $3.5 billion to creditors and will commence repayment following court approval.  However, Genesis faces fierce opposition from its parent company, Digital Currency Group (DCG), over its proposed repayment plan. In a petition filed in February, DCG argues that its bankrupt subsidiary looks to settle creditors&#8217; claims at amounts higher than their respective entitlement.  DCG believes such a repayment strategy violates the Bankruptcy Code and is “unfair” since it will only benefit senior creditors who will largely gain from an appreciation in Genesis’s crypto assets value while equity holders and company stakeholders are left in unfavorable positions. Founded in 2013, Genesis is one of the prominent crypto firms to file for bankruptcy. Its insolvency is largely linked to the sudden collapse of the defunct crypto exchange FTX. Related Reading: Bitcoin Whales Maintain Positive Accumulation Behavior Ahead Of 2024 Halving: Report Bitcoin Price Overview In other news, Bitcoin gained by 2.55% in the last day to reach a price of $69,339. Such price gain would be encouraging to investors especially following the token&#8217;s overall negative performance in the past week. On higher timeframes, BTC largely remains largely bullish as anticipation continues to build ahead of the halving event on April 19.  The fourth halving in Bitcoin&#8217;s history is expected to reduce the mining reward from 6.25 BTC to 3.125 BTC. BTC trading at $69,314 on the daily chart &#124; Source: BTCUSDT chart on Tradingview.com Featured Image from Nairametrics, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-04-07T08:00:43.000Z",
    "title": "Wormhole (W) and Dogecoin (DOGE) Whales Explore Algotech for Stunning DeFi Features",
    "url": "https://www.crypto-news-flash.com/wormhole-w-and-dogecoin-doge-whales-explore-algotech-for-stunning-defi-features/?utm_source=rss&utm_medium=rss&utm_campaign=wormhole-w-and-dogecoin-doge-whales-explore-algotech-for-stunning-defi-features",
    "description": "<img width=\"1456\" height=\"816\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/gddb.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/gddb.png 1456w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/gddb-300x168.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/gddb-1200x673.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/gddb-768x430.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/gddb-150x84.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/gddb-450x252.png 450w\" sizes=\"(max-width: 1456px) 100vw, 1456px\" />Decentralized finance is a vibrant industry that draws investors of all stripes. Whales from well-known DeFi ecosystems like Wormhole (W) and Dogecoin (DOGE) have reportedly taken an interest in a new name: Algotech (ALGT). This article explores the possible motivations for this migration and how Algotech&#8217;s unique proposition could transform DeFi. What are DeFi whales [...]"
  }
]