[
  {
    "source": "CryptoSlate",
    "date": "2023-10-05T17:20:50.000Z",
    "title": "FTX backdoor reportedly discovered by US-based employees: WSJ",
    "url": "https://cryptoslate.com/ftx-backdoor-reportedly-discovered-by-us-based-employees-wsj/",
    "description": "<p>Some U.S.-based employees of FTX reportedly knew that the exchange had a backdoor that allowed Alameda to withdraw customers&#8217; funds, The Wall Street Journal (WSJ) reported on Oct. 5. According to the report, the employees stumbled upon this backdoor while examining the feasibility of replicating the code used by FTX International for FTX US. These [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ftx-backdoor-reportedly-discovered-by-us-based-employees-wsj/\">FTX backdoor reportedly discovered by US-based employees: WSJ</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-05T17:21:48.000Z",
    "title": "How to Hurdle the Unique Challenges of AI Regulation – Exclusive Report",
    "url": "https://www.cryptopolitan.com/hurdle-unique-challenges-of-ai-regulation/",
    "description": "Artificial Intelligence (AI) has ceaselessly woven its way into the tapestry of modern society, heralded as a cornerstone of the next phase of digital evolution. AI&#8217;s vast potential is expanding, from powering smart cities to transforming healthcare diagnostics. As its influence grows, so do the voices advocating for tighter controls and regulations, primarily driven by ... <a title=\"How to Hurdle the Unique Challenges of AI Regulation &#8211; Exclusive Report\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hurdle-unique-challenges-of-ai-regulation/\" aria-label=\"More on How to Hurdle the Unique Challenges of AI Regulation &#8211; Exclusive Report\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-05T17:31:20.000Z",
    "title": "EU’s CBDC faces opposition by local lawmakers",
    "url": "https://crypto.news/eus-cbdc-faces-opposition-by-local-lawmakers/",
    "description": "The development of a central bank digital currency by the European Central Bank faces pushback from European lawmakers."
  }
]