[
  {
    "source": "NewsBTC",
    "date": "2023-05-29T03:27:18.000Z",
    "title": "Ethereum Price Gearing For Another Lift-Off to $2K: Recovery Isn’t Over Yet",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-lift-to-2k/",
    "description": "Ethereum price started a recovery wave above the $1,850 level against the US Dollar. ETH must clear $1,920 to continue higher in the near term. Ethereum is currently showing positive signs above the $1,850 resistance zone. The price is trading above $1,880 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support near $1,870 on the hourly chart of ETH/USD (data feed via Kraken). The pair could rise further if it clears the $1,920 resistance. Ethereum Price Recovers 4% Ethereum’s price remained supported above the $1,750 level. ETH formed a base and recently started a fresh increase above the $1,820 resistance, similar to Bitcoin. The bulls were able to pump the price above the $1,850 resistance. It even spiked above the $1,900 level. However, the bears are still active near the $1,920 resistance. A high is formed near $1,929 and the price is now consolidating gains. Ether is trading above $1,880 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support near $1,870 on the hourly chart of ETH/USD. The price is now trading near the 23.6% Fib retracement level of the recent increase from the $1,837 swing low to the $1,929 high. Immediate resistance is near the $1,920 zone. The next major resistance is near the $1,930 level. A close above the $1,930 resistance could send Ether toward $2,000. Source: ETHUSD on TradingView.com The next resistance sits near $2,050, above which Ethereum could rise toward $2,120. Any more gains above the $2,120 resistance zone could push the price toward the $2,250 resistance. Are Dips Supported in ETH? If Ethereum fails to clear the $1,920 resistance, it could start a downside correction. Initial support on the downside is near the $1,900 level. The next major support is near the $1,880 zone or the trend line or the 61.8% Fib retracement level of the recent increase from the $1,837 swing low to the $1,929 high. If there is a close below the $1,870 support, the price could revisit the $1,840 support. Any more losses may perhaps send the price toward the $1,800 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is above the 50 level. Major Support Level – $1,870 Major Resistance Level – $1,920"
  }
]