[
  {
    "source": "Cointelegraph",
    "date": "2024-04-03T07:28:15.000Z",
    "title": " Bitfarms announces $240M mining upgrade to triple post halving hash rate ",
    "url": "https://cointelegraph.com/news/bitfarms-bitcoin-mining-triple-hash-rate",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvOTNjNjQ0OWYtMWI5NC00MjJhLWFhY2ItMDY5NDBmNDQzNDQ0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitfarms holds $66 million in cash and 806 BTC in its treasury giving it a total liquidity of $123 million.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) mining company Bitfarms will invest nearly $240 million to upgrade its Bitcoin mining equipment as it aims to remain profitable post-<a href=\"https://cointelegraph.com/news/bitcoin-halving-2024\">Bitcoin halving 2024</a>.</p><p>Bitfarms’ prep work for Bitcoin halving revolves around performance and profitability. Speaking to Cointelegraph, Bitfarms chief financial officer Jeffrey Lucas laid out the firm’s drive to procure 88,000 highly efficient Bitcoin miners. </p><p>Bitfarms previously purchased 35,888 Bitmain’s Bitcoin Miner T21. Other efforts include exercising a purchase option to acquire an additional 28,000 T21 miners and further purchases of 19,280 Bitmain T21 miners, 3,888 Bitmain S21 miners, and 740 Bitmain S21 hydro miners.</p><p><a href=\"https://cointelegraph.com/news/bitfarms-bitcoin-mining-triple-hash-rate\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-04-03T07:22:57.000Z",
    "title": "Fear of Retrospective IRS Regulation Changes Discourages Filing, Says Crypto Tax Expert",
    "url": "https://news.bitcoin.com/fear-of-retrospective-irs-regulation-changes-discourages-filing-says-crypto-tax-expert/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/04/shutterstock_2104316216-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/04/shutterstock_2104316216-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/shutterstock_2104316216-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/shutterstock_2104316216-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/shutterstock_2104316216-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/shutterstock_2104316216-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/shutterstock_2104316216-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/shutterstock_2104316216.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Many cryptocurrency users have not filed their tax returns, fearing that the Internal Revenue Service (IRS) might change regulations after they submit their returns, according to a cryptocurrency tax expert. The expert stated that the IRS has the discretion to apply laws retroactively or retrospectively interpret them. Complex Filing Process Clinton Donnelly, CEO of Crypto [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-03T07:22:06.000Z",
    "title": "Samsung Unveils BESPOKE AI Home Appliance Lineup: A Game-Changer in Smart Living",
    "url": "https://www.cryptopolitan.com/samsung-unveils-bespoke-ai-home-appliances/",
    "description": "With the global launch of its innovative BESPOKE AI lineup, Samsung has leaped forward in home appliance technology. This cutting-edge range, introduced at CES 2024, encompasses 14 new products to revolutionize household tasks. With an emphasis on connectivity, convenience, and intelligence, Samsung&#8217;s latest offerings are poised to redefine the modern home experience. Central to the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-03T07:20:39.000Z",
    "title": "Ghost in the Machine: Deepfake Tools Altering India’s Political Landscape",
    "url": "https://www.cryptopolitan.com/ghost-in-deepfake-altering-indias-political/",
    "description": "The rise of deepfake technology in the run-up to national elections is now opening a new frontier for India&#8217;s political space. Political parties can use such sophisticated tools to bring back from the dead their leaders in the digital world, creating video clips and voice messages where reality speaks, testing the threshold between fact and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-03T07:14:47.000Z",
    "title": "DRIFE Web3 decentralized ride hailing platform integrates with SUI Blockchain",
    "url": "https://www.cryptopolitan.com/drife-web3-decentralized-ride-hailing-platform-integrates-with-sui-blockchain/",
    "description": "DRIFE, a Web3 Mobility infrastructure provider, and the first ride-hailing decentralized application to operate in India and the UAE, has announced its integration with Sui, a Layer 1 smart contract platform and Blockchain. DRIFE with this move, aims to offer a seamless, simplified onboarding process for ride hailing users and ecosystem partners. The migration of [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-04-03T07:22:50.000Z",
    "title": "$ENA: The Latest Addition to Binance Launchpool Sparks Market Excitement",
    "url": "https://nulltx.com/ena-the-latest-addition-to-binance-launchpool-sparks-market-excitement/",
    "description": "The newest addition to Binance Launchpool, $ENA, is generating significant buzz within the cryptocurrency community. Positioned as a synthetic dollar protocol built on Ethereum, $ENA aims to provide a crypto-native solution for money, offering users a versatile and efficient financial tool. Reports indicate that GSR Markets and Wintermute, prominent market [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-03T07:34:32.000Z",
    "title": "Canine Comeback? KNINE Brushes Off 50% Loss, Gets Listed On Major Exchange",
    "url": "https://www.newsbtc.com/news/canine-comeback-knine-gets-listed-on-major-exchange-after-50-drop/",
    "description": "Shiba Inu&#8217;s Layer-2 blockchain, Shibarium, is experiencing a shot of optimism amidst a bearish crypto market. K9 Finance (KNINE), a project aiming to become the go-to platform for liquid staking derivatives (LSD) on Shibarium, has secured a listing on BitMart, a major cryptocurrency exchange. This move, coupled with the upcoming launch of the K9 Finance dApp, is seen as a potential catalyst for growth within the Shibarium ecosystem. Related Reading: Cardano Rides The ETF Wave: Inflows Surge To Over $1 Million – Details K9 Finance offers functionality similar to Lido Finance on Ethereum. Lido allows users to stake their Ethereum (ETH) while receiving Lido Staked Ether (stETH) which can be used for further DeFi activities. K9 Finance envisions a similar mechanism for Shibarium, enabling users to stake their tokens and receive a liquid derivative in return. This not only increases participation in the Shibarium network but also unlocks additional utility for staked assets. Official $SHIB Partner $KNINE will list on @BitMartExchange Tomorrow. Congrats on the new listing. Let&#8217;s Moon Together! 🔥🚀 https://t.co/rHApwjJMAu — $SHIB KNIGHT (@army_shiba) April 1, 2024 KNINE Price At A Glance At the time of writing, the price of the KNINE token has decreased by 9% over the previous 24 hours and is worth $0.00009063. As a result, SHIB&#8217;s companion token gained a bearish hue today, in contrast to the optimistic sentiments that arose in response to the listing announcement. Despite securing a significant exchange listing, the K9 Finance DAO (KNINE) token experienced a sharp decline of 50% over the past 14 days, plunging 75% from its all-time high of $0.0003468 on March 10, 2024. KNINE&#8217;s drop today looks to be consistent with the overall slump in Shiba Inu, since SHIB&#8217;s stock also fell significantly on Wednesday. Shiba Inu traded at $0.00002692, down nearly 11% in the last 24 hours, fueling speculation about potential price swings. Total crypto market cap at $2.4 trillion on the daily chart: TradingView.com The listing on BitMart, the 44th largest crypto exchange by monthly traffic, is a significant win for K9 Finance. It provides increased exposure and liquidity for the KNINE token, potentially attracting new investors and users to the Shibarium ecosystem. Major Developments Ahead Adding further fuel to the fire, K9 Finance recently unveiled a sneak peek of its upcoming dApp. The platform will reportedly utilize Shiba Inu&#8217;s BONE token for validator rewards. Users who stake their BONE on K9 Finance will receive a wrapped version (knBONE) while their original tokens remain locked, allowing them to participate in governance and earn rewards simultaneously. This integration with BONE creates a symbiotic relationship between the two projects and incentivizes participation within the wider Shibarium ecosystem. Related Reading: Investor Alert: Ethereum Q2 Potential Promises Double-Digit Gains – Analyst While K9 Finance paints a promising picture for Shibarium&#8217;s future, some factors require consideration. The current crypto market slump could lead to price volatility for KNINE. Additionally, the overall success of K9 Finance hinges on the wider adoption of Shibarium itself. As a relatively new Layer-2 solution, Shibarium needs to attract developers and users to establish a robust ecosystem. Featured image from Pexels, chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2024-04-03T07:21:17.000Z",
    "title": "Base’s Meme Coins Excel: Daily Transactions Exceed 2.34 Million",
    "url": "https://coinedition.com/bases-meme-coins-excel-daily-transactions-exceed-2-34-million/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Base’s TVL Hits $1.202B: Daily Transactions Reach 2.34M\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million.jpg 730w, https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/04/Bases_Meme_Coins_Excel_Daily_Transactions_Exceed_2_34_Million-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In an astounding turn of events, Coinbase’s Layer 2 Blockchain, Base, has seen remarkable growth in daily transactions and total value locked (TVL). The increase in transactions and daily activities on the L2 platform could be mainly attributed to the growing popularity of the memecoins associated with Base. According to DefiLlama data, Base’s TVL has [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bases-meme-coins-excel-daily-transactions-exceed-2-34-million/\">Base’s Meme Coins Excel: Daily Transactions Exceed 2.34 Million</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]