[
  {
    "source": "Decrypt",
    "date": "2024-02-21T17:50:15.000Z",
    "title": "Portal Launch Set as Binance Offers 50 Million Ethereum Gaming Token Rewards",
    "url": "https://decrypt.co/218377/portal-ethereum-gaming-token-launch-binance-rewards",
    "description": "Portal’s cross-chain gaming token picks a date after the airdrop push, with the price estimated above $1 in pre-market trading."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-21T17:58:04.000Z",
    "title": " Volatility hits PLANET token after Lionel Messi’s partnership for RWA  ",
    "url": "https://cointelegraph.com/news/volatility-hits-planet-token-lionel-messi-partnership-rwa",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYjU5YmU2Y2UtOGEyMy00ODMzLTg2OTItYWRjMTU0NWQzOTVlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Soccer star Lionel Messi has disclosed his upcoming RWA in partnership with the Join The Planet initiative, spiking volatility for the project’s native token. </p>\n                    <p><p>Crypto token PLANET is facing a volatile week as traders flock to capitalize on the upcoming release of its first tokenized product in collaboration with soccer legend Lionel Messi.</p><p>According to data from crypto aggregator CoinCodex, the token's volatility <a href=\"https://coincodex.com/crypto/planet-token/\" target=\"_blank\" rel=\"noopener nofollow\">reached</a> 6.82% on Feb. 21, which is considered high under the methodology that defines high volatility within the range of 5% to 10%.</p><p>PLANET’s price climbed to $0.00011 on Feb. 19, gathering over $23.5 million of trading volume in 24 hours after Argentine Messi announced the release of a tokenized product in partnership with Join The Planet, an environmental nonprofit organization behind the PLANET token. </p><p><a href=\"https://cointelegraph.com/news/volatility-hits-planet-token-lionel-messi-partnership-rwa\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-21T17:57:17.000Z",
    "title": " Do Kwon to be extradited to US following last-ditch effort in Montenegrin court: Report ",
    "url": "https://cointelegraph.com/news/terraform-do-kwon-extraditon-united-states-montenegrin-court",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvOTMyMGE5ZjQtZGMwMy00Mzg3LWI0YTItZDIzZjMxMDIzYzU0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The High Court of Podgorica in Montenegro reportedly rejected a request to extradite Terraform Labs co-founder Do Kwon to South Korea.</p>\n                    <p><p>Terraform Labs co-founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/do-kwon\">Do Kwon</a>, who has been in Montenegro since his arrest in March 2023, will reportedly be extradited to the United States to face fraud charges.</p><p>According to a Feb. 21 report from Montenegrin news outlet Pobjeda, the High Court of Podgorica <a href=\"https://www.pobjeda.me/clanak/do-kvon-bice-izrucen-sad-u\" target=\"_blank\" rel=\"noopener nofollow\">rejected</a> a request to extradite Kwon to South Korea before the United States. The decision <a href=\"https://cointelegraph.com/news/montenegro-revokes-do-kwon-extradition\">followed an appeal</a> by Kwon’s legal team, arguing that Montenegro’s Justice Minister had the final authority to decide on the Terraform co-founder’s extradition — a claim the high court rejected. </p><p>It’s unclear when Kwon will travel to the United States. After the collapse of Terra in May 2022, his whereabouts were largely unknown until March 2023, when Montenegrin authorities <a href=\"https://cointelegraph.com/news/do-kwon-reportedly-arrested-in-montenegro\">arrested Kwon for using</a> falsified travel documents. He was sentenced to four months in prison and has been involved in extradition proceedings while in custody.</p><p><a href=\"https://cointelegraph.com/news/terraform-do-kwon-extraditon-united-states-montenegrin-court\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-21T17:56:57.000Z",
    "title": "Crypto investment products show $2.5 billion inflows in a week",
    "url": "https://cryptobriefing.com/crypto-products-25-billion-inflows-a-week/",
    "description": "Ethereum adds $21M to AUM amidst Bitcoin's 99% inflow dominance."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-21T18:08:37.000Z",
    "title": "Buy the rumor, Sell the news; Ethereum (ETH) holders pile in early to Kelexo (KLXO) lending platform as 40x rumors continue",
    "url": "https://cryptodaily.co.uk/2024/02/buy-the-rumor-sell-the-news-ethereum-eth-holders-pile-in-early-to-kelexo-klxo-lending-platform-as-40x-rumors-continue",
    "description": "Holders of Ethereum (ETH) are grabbing hold of the chance early in the highly volatile cryptocurrency industry,"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-21T17:51:42.000Z",
    "title": "Bitcoin ETFs spark fierce debate in South Korea’s election run-up",
    "url": "https://www.cryptopolitan.com/bitcoin-etfs-and-south-koreas-elections/",
    "description": "In the lead-up to the South Korean election, the topic of Spot Bitcoin ETFs has emerged as a prominent issue within the political landscape. Various political parties, including the ruling Democratic Party and the People Power Party, are actively discussing the legalization of Spot Bitcoin ETFs, reflecting the growing significance of crypto in the financial [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-21T17:47:49.000Z",
    "title": "$1B Bitcoin Exodus from Coinbase sparks market frenzy",
    "url": "https://www.cryptopolitan.com/1b-bitcoin-exodus-from-coinbase/",
    "description": "Bitcoin ($BTC) whales, referring to investors holding substantial amounts of the crypto, have recently withdrawn over $1 billion worth of Bitcoin from Coinbase, one of the largest crypto exchanges globally. This significant movement of funds has sparked speculation within the crypto community and financial markets.&#160; The withdrawal of such a substantial amount of Bitcoin from [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-21T17:43:40.000Z",
    "title": "The Graph Price Prediction 2024-2033: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2024-2033 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-21T17:43:20.000Z",
    "title": "Winklevoss Twins’ $4.9M donation rocks the crypto-political landscape",
    "url": "https://www.cryptopolitan.com/winklevoss-twins-4-9m-political-donation/",
    "description": "The Winklevoss twins, Cameron and Tyler, renowned figures in the crypto space and co-founders of Gemini exchange, have made headlines by donating $4.9 million to Fairshake, a crypto-focused super political action committee (PAC). This substantial contribution underscores their commitment to advancing cryptocurrency-friendly policies and supporting candidates sympathetic to the digital asset industry. Winklevoss Twins drop [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-21T17:56:47.000Z",
    "title": "Lido, 1inch partner for faster stETH, wstETH withdrawals",
    "url": "https://crypto.news/lido-1inch-withdrawals-ethereum-staked-wrapped/",
    "description": "Lido and 1inch's partnership aims to streamline the swapping process for stETH, wstETH, and ETH, particularly during the unstaking phase."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-21T18:00:17.000Z",
    "title": "Bitcoin Bulls In Jeopardy? Analyst Sounds Warning Of Possible Retest",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-bulls-in-jeopardy-analyst-sounds-warning-of-possible-retest/",
    "description": "Bitcoin has been on a bullish trend, reaching $50,000 for the first time in two years, but some crypto analysts still anticipate that the token might be gearing up for a potential correction. Bitcoin Could See A Pullback At Any Moment According to the recent analysis by cryptocurrency expert Crypto Jelle, Bitcoin could undergo a retest anytime soon. Jelle shared his latest projections with his thousands of followers on the social media platform X (formerly Twitter). Related Reading: The Bitcoin “Big Money Algos” Are Here: Will BTC Breach $70,000? A chart of Bitcoin accompanied his X post to demonstrate his observations and further back up his claims visually. Crypto Jelle&#8217;s analysis examines the current and past position of Bitcoin and has identified the presence of a &#8220;rising channel.&#8221;  He stated that Bitcoin has been in this rising channel &#8220;over the past 6 years.&#8221; He further pointed out that the crypto asset is not breaking out of the &#8220;channel anytime soon.&#8221; Due to this, Crypto Jelle believes that the price of BTC might witness a &#8220;retest of the mid-range.&#8221; Thus, he has urged investors to get involved with the token to increase prices and avoid the impending pullback. The post read: Bitcoin has spent the past 6 years inside this rising channel. Doesn&#8217;t look like that&#8217;s going to change anytime soon. In fact, it seems about time for a retest of the mid-range. Send it higher. Jelle has also underscored the potential for the digital asset to soar higher to a new all-time high. In another X post, he highlighted that today is &#8220;one of those days to recall the part of the cycle we are in.&#8221; Jelle has underlined two distinct timeframes for Bitcoin, which include the lower timeframe and the higher timeframe. He asserted that in the lower timeframe, BTC&#8217;s performance looks like &#8220;dog poop.&#8221; Meanwhile, in the higher timeframe, BTC&#8217;s performance looks promising, suggesting a move to a new price level. Jelle appears bullish on Bitcoin as he has encouraged the community not to be &#8220;shaken out&#8221; of the market. Massive Sell-Off By BTC Whales Despite the upward momentum, reports have revealed a significant selling spree from BTC whales. Ali Martinez, a well-known crypto analyst, reported Tuesday&#8217;s development on the X platform. Related Reading: Bitcoin Whales Steer Clear Of Significant Short Positions, Show Confidence In Price Surge Per Martinez&#8217;s post, Bitcoin whales might lose their confidence in the token. Martinez asserted that whales have sold over 30,000 BTC valued at $1.56 billion in the past 2 days. The report has sent quite a frenzy in the community, leaving crypto enthusiasts to ponder the impact of the sell-off. However, it is believed that this could be a notable development, indicating the start of a distribution phase, which could extend the low timeframe bearish action.  Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-21T17:55:59.000Z",
    "title": "Investment Funds Will Be Allowed To Hold Crypto Under New Legislation in Japan: Report",
    "url": "https://dailyhodl.com/2024/02/21/investment-funds-will-be-allowed-to-hold-crypto-under-new-legislation-in-japan-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/to-hold-new-japan.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/to-hold-new-japan.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/02/to-hold-new-japan.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/to-hold-new-japan.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/to-hold-new-japan.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/to-hold-new-japan.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/02/to-hold-new-japan.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>If newly proposed legislation passes, Japan will start allowing investment funds to hold digital assets. According to a new Bloomberg report, the administration of Japan’s Prime Minister Fumio Kishida is proposing revised legislation that lifts a restriction that prevents investment funds and venture capital firms from directly holding cryptocurrencies. Says the proposal, which was approved [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/21/investment-funds-will-be-allowed-to-hold-crypto-under-new-legislation-in-japan-report/\">Investment Funds Will Be Allowed To Hold Crypto Under New Legislation in Japan: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-21T17:42:34.000Z",
    "title": "XDFi, World’s First Compliant Decentralized Futures Protocol, To Launch on Flare Network",
    "url": "https://dailyhodl.com/2024/02/21/xdfi-worlds-first-compliant-decentralized-futures-protocol-to-launch-on-flare-network/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/UPSCALED-Flare-Network-Crypto-Livewire-Featured-Image-Template.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/UPSCALED-Flare-Network-Crypto-Livewire-Featured-Image-Template.jpg 1500w, https://dailyhodl.com/wp-content/uploads/2024/02/UPSCALED-Flare-Network-Crypto-Livewire-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2024/02/UPSCALED-Flare-Network-Crypto-Livewire-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2024/02/UPSCALED-Flare-Network-Crypto-Livewire-Featured-Image-Template.jpg?resize=768,768 768w, https://dailyhodl.com/wp-content/uploads/2024/02/UPSCALED-Flare-Network-Crypto-Livewire-Featured-Image-Template.jpg?resize=1024,1024 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/UPSCALED-Flare-Network-Crypto-Livewire-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2024/02/UPSCALED-Flare-Network-Crypto-Livewire-Featured-Image-Template.jpg?resize=350,350 350w, https://dailyhodl.com/wp-content/uploads/2024/02/UPSCALED-Flare-Network-Crypto-Livewire-Featured-Image-Template.jpg?resize=750,750 750w, https://dailyhodl.com/wp-content/uploads/2024/02/UPSCALED-Flare-Network-Crypto-Livewire-Featured-Image-Template.jpg?resize=1140,1140 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>February 21, 2024 – Dubai, United Arab Emirates Flare, the blockchain for data, has announced a partnership with Sindric Solutions to launch XDFi, a new decentralized futures protocol created by Wall Street veterans. XDFi aims to raise industry standards for compliance and efficiency, delivering a trustless, non-custodial futures contract-purchasing environment that operates 24/7. With regulatory [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/21/xdfi-worlds-first-compliant-decentralized-futures-protocol-to-launch-on-flare-network/\">XDFi, World’s First Compliant Decentralized Futures Protocol, To Launch on Flare Network</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]