[
  {
    "source": "Cointelegraph",
    "date": "2023-09-28T18:21:06.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Sam Bankman-Fried’s renewed request for temporary release from jail before his upcoming trial was denied, mirroring an earlier request from the U.S. government. Meanwhile, Ethereum futures ETFs could see the light of day as early as next week. </p><p>A federal judge has <a href=\"https://cointelegraph.com/news/judge-denies-sam-bankman-temporary-release\">denied Sam Bankman-Fried’s pretrial request</a> for temporary release and will remain in jail at least until the start of his trial on Oct. 3.</p><p>In a Sept. 28 hearing, New York Judge Lewis Kaplan deemed Bankman-Fried to be a potential flight risk if “things begin to look bleak” during his trial. Judge Kaplan said Bankman-Fried will still be able to arrive at court early on certain days to meet with his legal counsel.</p><p>On Sept. 27, Judge Kaplan <a href=\"https://cointelegraph.com/news/sam-bankman-fried-appear-suit-tie-trial\">granted Bankman-Fried permission</a> to wear a suit and tie at his upcoming trial.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Sam Bankman-Fried asks judge for suits to wear at trial <a href=\"https://t.co/2kdVPMenLu\">https://t.co/2kdVPMenLu</a> <a href=\"https://t.co/iwzTVfg1wj\">pic.twitter.com/iwzTVfg1wj</a></p>&mdash; Reuters (@Reuters) <a href=\"https://twitter.com/Reuters/status/1707057748578336853?ref_src=twsrc%5Etfw\">September 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Next week’s trial will be the first of two for the former FTX CEO, who faces several charges related to the misuse of customer funds. His second trial is scheduled to begin in March 2024. </p><h3>SBF denied temporary release</h3><h3>FTX founder’s plea for temporary release should be denied, prosecution says</h3><p>The United States government sent a letter to Judge Lewis Kaplan on Sept. 27 stating that it opposes the motion by Sam Bankman-Fried (SBF) and his representation for temporary release from jail before his Oct. 3 trial. The judge is scheduled to hear arguments from both sides later today.</p><p>In its filing, the government asked Kaplan to deny SBF’s request, which was submitted on Sept. 25.</p><p>The government said that the defendant’s claims of not being able to “meaningfully participate” in his own defense, which warrants release, “does not outweigh the danger posed by such release conditions in light of the defendant’s prior course of conduct.”</p><p>The “danger” is listed as “danger to the community and/or flight.“ It also said the renewed motion “recycles” generalized claims and cited two previous times when the court objected to similar requests.</p><p>Bankman-Fried’s criminal trial in New York City is scheduled for Oct. 3, during which we will face seven fraud-related counts that occurred during his time at FTX and Alameda Research. </p><p>In March 2024, he will be tried for five additional counts in a separate criminal trial. SBF has already pleaded not guilty to all charges.</p><h3>Ethereum futures ETFs could start trading next week</h3><p>Ethereum futures exchange-traded funds (ETFs) could start trading for the first time in the United States as early as next week, according to Bloomberg analysts.</p><p>On Sept. 28, Bloomberg Intelligence analyst James Seyffart said it was “looking like the SEC is gonna let a bunch of Ethereum futures ETFs go next week potentially.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Looking like the SEC is gonna let a bunch <a href=\"https://twitter.com/hashtag/Ethereum?src=hash&amp;ref_src=twsrc%5Etfw\">#Ethereum</a> futures ETFs go next week potentially <a href=\"https://t.co/YoBD1d1ay8\">https://t.co/YoBD1d1ay8</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1707203966101008521?ref_src=twsrc%5Etfw\">September 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>His comments were in response to fellow ETF analyst Eric Balchunas who said he was hearing that the SEC wanted to “accelerate the launch of Ether futures ETFs.”</p><p>“They want it off their plate before the shutdown,” he said, adding that he's heard the various filers to update their documents by Friday afternoon so they can start trading as early as Tuesday next week.</p><p>There are 15 Ethereum futures ETFs from nine issuers currently awaiting approval, according to the analysts in a Sept. 27 note.</p><p>Companies proposing an Ethereum futures or hybrid ETF product include VanEck, ProShares, Grayscale, Volatility Shares, Bitwise, Direxion, and Roundhill.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T18:32:51.000Z",
    "title": "Coinbase International Exchange unlocks perpetual futures for non-US retail traders",
    "url": "https://www.cryptopolitan.com/coinbase-international-exchange-perpetual-futures-for-non-us-retail-traders/",
    "description": "Coinbase International Exchange has garnered additional regulatory approval from the Bermuda Monetary Authority (BMA), enabling it to extend its perpetual futures trading services to non-US retail customers. This move is a significant milestone in the crypto exchange&#8217;s global expansion strategy, which was initiated in May 2023. Moreover, the approval comes at a pivotal moment when ... <a title=\"Coinbase International Exchange unlocks perpetual futures for non-US retail traders\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-international-exchange-perpetual-futures-for-non-us-retail-traders/\" aria-label=\"More on Coinbase International Exchange unlocks perpetual futures for non-US retail traders\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T18:25:34.000Z",
    "title": "Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?",
    "url": "https://www.cryptopolitan.com/rollbit-price-prediction/",
    "description": "Rollbit coin price prediction 2023-2032 Rollbit has quickly become one of the most popular crypto casinos and trading platforms. Launched in 2019, Rollbit offers a wide range of gaming, sports betting, futures trading, and NFT options for users. With no KYC requirements and support for numerous cryptocurrencies, Rollbit provides an easy entry into the world ... <a title=\"Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rollbit-price-prediction/\" aria-label=\"More on Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\">Read more</a>"
  }
]