[
  {
    "source": "Decrypt",
    "date": "2023-06-07T16:04:49.000Z",
    "title": "Do Kwon Claims to Have Backed Political Party in Montenegro: Report",
    "url": "https://decrypt.co/143690/do-kwon-claims-to-have-backed-political-party-in-montenegro-report",
    "description": "Terra co-founder Do Kwon allegedly had financial relations with the leader of a political party in Montenegro."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-07T15:58:36.000Z",
    "title": "Ex-Oasis Rocker Noel Gallagher Turns to NFTs to Top Foo Fighters in UK Chart Race",
    "url": "https://decrypt.co/143693/oasis-rocker-noel-gallagher-turns-nfts-top-foo-fighters-uk-chart-race",
    "description": "It’s a fervent fight to top the album charts, and Noel Gallagher’s High Flying Birds is launching an NFT edition to try and eke out a win."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-07T15:56:00.000Z",
    "title": "As the crypto ship steadies, is Tether next?",
    "url": "https://cryptodaily.co.uk/2023/06/as-the-crypto-ship-steadies-is-tether-next",
    "description": "<p>Major exchanges have been broadsided by the SEC, including Binance and Coinbase just recently. Is Tether going to be the next port of call for the SEC?</p>\nSEC master plan\n<p>All the grandmasters of chess were able to think many moves ahead and thus lay ambushes for their opponents. While the SEC can hardly be likened to a grandmaster, it probably has it in mind that in order to cause the most consternation in the crypto world a Wells Notice for Tether would be a good move.</p>\n<p>The SEC, led by its captain Gary Gensler, isn&rsquo;t the fastest moving or rapier like opponent for crypto, but it does have bludgeoning force. Sending in a suit against Binance was like a typhoon. Then pouring it on by suing Coinbase was akin to a hurricane. Going next for Tether would hit the crypto markets like a tsunami.</p>\nChoppy seas remain\n<p>Currently, the crypto market is in rather stormy waters. Bitcoin suffered a 6.4% fall on Tuesday when the Coinbase news came roaring in. The rest of the crypto market followed suit and many cryptocurrencies fell in the double digits.</p>\n<p>However, perhaps big capital funds were nimble enough to jump into the market when things looked pretty bad and bought the dip, sending Bitcoin and crypto back up to pretty much where they were at the start of the day on Tuesday.</p>\n<p>So the SEC- inspired storm hit, caused a fair bit of havoc and carnage, but as with all storms it blew over after a while and much fairer weather ensued.</p>\n<p>Today, the same old lingering fear is palpably still there in crypto. All must be asking themselves that if the SEC cuts off all the banks, swamps the big exchanges with litigation, has a quiet word with the big market makers, and brings in crushing regulation, then how on earth is the industry going to survive?</p>\nTether next?\n<p>And on top of that there is the potential of an SEC move against Tether. John Reed Stark, former SEC Head of Internet Enforcement, has stated that Tether needs to undergo a full traditional financial audit, expressing his astonishment that Tether is allowed to continue without one.</p>\n<p>John Reed Stark is only a self-styled expert on these matters but he still may have the ear of the SEC and could also be aware of impending moves that the agency might be preparing.</p>\nFairer weather for Bitcoin\n<p>So for crypto at least, the next few weeks and months could see a fair bit of volatility, especially when the waves of bad news come crashing in. However, Bitcoin appears to be outside of all of this. It is one of the only cryptos that the SEC grudgingly admits to being a commodity.</p>\n<p>That its bull market has begun is a very strong possibility. Also, with other asset classes potentially about to be pummelled should the US and other major economies enter recession, Bitcoin could finally be that hedge out of the toxic traditional financial system that it has wanted to be for so long.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-07T15:55:26.000Z",
    "title": "Bitcoin rebounds, briefly surges above $27k",
    "url": "https://crypto.news/bitcoin-rebounds-briefly-surges-above-27k/",
    "description": "Despite regulatory uncertainty with news of the SEC lawsuit against Binance and Coinbase, bitcoin saw a strong rebound over the last 24 hours."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-07T16:00:25.000Z",
    "title": "Bitcoin Realized Loss Remains Low Despite Volatility, What Does This Mean?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-realized-loss-low-despite-volatility-what-mean/",
    "description": "On-chain data shows the Bitcoin realized loss metric has stayed at a low value recently, despite the volatility that the coin has experienced. Bitcoin Realized Loss Continues To Be At A Relatively Low Value According to data from the on-chain analytics firm Glassnode, investors realized just $112 million in losses during the recent plummet in the cryptocurrency&#8217;s value. The &#8220;entity-adjusted realized loss&#8221; is a metric that measures the total amount of loss (in USD) that Bitcoin investors have recently been realizing on the blockchain. Whenever a coin sits still on the network for a while (meaning that it hasn&#8217;t been transferred to another address) and the price goes above or below the value at which it was acquired, the coin is said to gain an &#8220;unrealized profit/loss.&#8221; When such a coin that&#8217;s carrying an unrealized profit or loss is finally moved or sold on the blockchain, the profit/loss it was carrying previously then becomes &#8220;realized.&#8221; The realized loss metric specifically tracks such losses being harvested throughout the network (and naturally, the counterpart indicator, the realized profit, measures the profits). Related Reading: Dogecoin Plunges 7% As Whales Make Large Moves Now, here is a chart that shows the trend in the Bitcoin entity-adjusted realized loss over the last couple of years: Looks like the value of the metric has been relatively unchanged in recent weeks &#124; Source: Glassnode on Twitter As shown in the above graph, when Bitcoin crashed a couple of days back after the news of fresh regulatory pressure on the cryptocurrency exchange Binance, the realized loss had measured around $112 million. Then, the following day, losses were almost halved as the metric measured to around only $64 million. Usually, during volatile events like crashes, there are a large number of investors who panic and sell off their coins, even if they are holding them at a loss. Such investors are generally inexperienced short-term holders, who are quick to lose their conviction in the asset. Because of this reason, sharp plunges in the price of the cryptocurrency have historically been marked by huge capitulation events where the realized loss indicator registers a large spike. Related Reading: Bitcoin Crash To $25,800 Sends 6.5% Of Supply Into Loss From the chart, it&#8217;s visible that the May 2021 crash, the LUNA collapse in May 2022, the 3AC bankruptcy in June 2022, and the FTX collapse in November 2022 all saw widespread capitulation from the holders. Out of these, the crash after the 3AC bankruptcy saw the largest amount of realized losses, as the indicator&#8217;s value hit around $3.1 billion during it, while the FTX collapse saw the least amount of losses at $1.45 billion. Both of these values are, however, extremely large when compared to the losses that Bitcoin investors have harvested in this latest period of price volatility. According to Glassnode, this trend would suggest &#8220;an increased degree of resilience amongst market participants.&#8221; BTC Price At the time of writing, Bitcoin is trading around $26,800, down 1% in the last week. The asset seems to have made recovery during the past day &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T16:00:40.000Z",
    "title": "8 Best Crypto Presales for June 2023 – Definitive List with ApeMax, Big Eyes, Dogetti, Pepe Coin and more.",
    "url": "https://www.crypto-news-flash.com/8-best-crypto-presales-for-june-2023-definitive-list-with-apemax-big-eyes-dogetti-pepe-coin-and-more/?utm_source=rss&utm_medium=rss&utm_campaign=8-best-crypto-presales-for-june-2023-definitive-list-with-apemax-big-eyes-dogetti-pepe-coin-and-more",
    "description": "<p>Engaging in crypto presales offers a remarkable prospect to enter the market at the initial stages of emerging cryptocurrency tokens. The market presents both potential rewarding opportunities and risks for knowledgeable purchasers. Given the remarkable expansion of the crypto industry in the past couple of years, it is currently an opportune moment to investigate the [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/8-best-crypto-presales-for-june-2023-definitive-list-with-apemax-big-eyes-dogetti-pepe-coin-and-more/\">8 Best Crypto Presales for June 2023 &#8211; Definitive List with ApeMax, Big Eyes, Dogetti, Pepe Coin and more.</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-06-07T15:54:03.000Z",
    "title": "Change Log: Version 1.73",
    "url": "https://blog.bitfinex.com/changelogs/change-log-version-1-73/",
    "description": "<p>The Bitfinex Change Log is an overview of all performance and UI changes made to the Bitfinex trading platform. For an overview of all previous changes, please refer to blog.bitfinex.com/category/changelogs. Version 1.73 Features Addition of a revenue multiplier in the Affiliates section Updated the Search...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/changelogs/change-log-version-1-73/\">Change Log: Version 1.73</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]