[
  {
    "source": "CoinDesk",
    "date": "2023-12-06T15:05:31.000Z",
    "title": "Elon Musk Halts Dogecoin Surge by Saying His AI Business Is 'Not Raising Money'",
    "url": "https://www.coindesk.com/markets/2023/12/06/elon-musk-halts-dogecoin-surge-by-saying-his-ai-business-is-not-raising-money/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "DOGE surged Tuesday after an SEC filing showed xAI had already raised $134.7 million and might seek $1 billion."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-06T15:00:00.000Z",
    "title": "Crypto Lending Firm Ledn Offers Low-Risk Custodied Loans",
    "url": "https://www.coindesk.com/business/2023/12/06/crypto-lending-firm-ledn-offers-low-risk-custodied-loans/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Cryptocurrency lending company Ledn is offering customers crypto-backed loans where all the assets remain locked up with a qualified custodian, as the company adapts its centralized finance approach to a post-FTX world."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-06T14:59:11.000Z",
    "title": "Crypto ETP Provider 21Shares Loses COO",
    "url": "https://www.coindesk.com/business/2023/12/06/crypto-etp-provider-21shares-loses-coo/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Lucy Reynolds had been with the company since September 2020."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-06T14:45:35.000Z",
    "title": "Legacy media skepticism playing catch up to Bloomberg for Bitcoin coverage",
    "url": "https://cryptoslate.com/legacy-media-skepticism-playing-catch-up-to-bloomberg-for-bitcoin-coverage/",
    "description": "<p>Recent developments in crypto, particularly Bitcoin&#8217;s price surge, starkly contrast with the continued skeptical and sensationalist coverage by legacy media.  Granted, Bitcoin&#8217;s journey in the digital currency landscape has often been tumultuous, marked by significant price fluctuations and evolving public perceptions. However, despite a remarkable 168% increase in value this year, Bitcoin continues to face [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/legacy-media-skepticism-playing-catch-up-to-bloomberg-for-bitcoin-coverage/\">Legacy media skepticism playing catch up to Bloomberg for Bitcoin coverage</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-06T14:54:13.000Z",
    "title": "Palm Foundation Provides $45K Grant to NFT Artists at ZsONAMACO",
    "url": "https://cryptodaily.co.uk/2023/12/palm-foundation-provides-45k-grant-to-nft-artists-at-zsonamaco",
    "description": "The Palm Foundation has unveiled its latest grant for artists working to advance the development of digital artifacts, better known as NFTs."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T15:09:07.000Z",
    "title": "Discord redesigns its mobile app to unveil new features",
    "url": "https://www.cryptopolitan.com/discord-redesigns-mobile-app-new-features/",
    "description": "Discord’s recent mobile app refresh marks a significant evolution, responding to user feedback and adapting to the changing landscape of user preferences. Originally conceived in 2015 with a primary focus on serving as a companion app for PC gamers, Discord has since grown exponentially in terms of functionality and user base. The latest redesign, rolling ... <a title=\"Discord redesigns its mobile app to unveil new features\" class=\"read-more\" href=\"https://www.cryptopolitan.com/discord-redesigns-mobile-app-new-features/\" aria-label=\"More on Discord redesigns its mobile app to unveil new features\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T15:00:50.000Z",
    "title": "Bitcoin ordinals cause commotions amid congestion issues",
    "url": "https://www.cryptopolitan.com/bitcoin-ordinals-commotions-congestion-issue/",
    "description": "Bitcoin’s recent flirtation with the $45,000 mark has reignited discussions around the contentious topic of ordinal inscriptions. Luke Dashjr, a Bitcoin Core developer, has raised concerns about inscriptions exploiting a vulnerability in Bitcoin Core, effectively spamming the blockchain. Bitcoin ordinals cause concerns about the blockchain This concern is mirrored in the data, with over 260,000 ... <a title=\"Bitcoin ordinals cause commotions amid congestion issues\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-ordinals-commotions-congestion-issue/\" aria-label=\"More on Bitcoin ordinals cause commotions amid congestion issues\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T14:51:25.000Z",
    "title": "Twitch announces plans to cease operations in South Korea",
    "url": "https://www.cryptopolitan.com/twitch-plans-to-cease-operations-south-korea/",
    "description": "Twitch, a prominent video streaming service, has recently announced its decision to terminate operations in South Korea by February 27. The move comes as a result of the platform deeming the costs of maintaining a presence in one of the world’s largest esports markets as excessively high. Twitch CEO blames operating costs for the decision ... <a title=\"Twitch announces plans to cease operations in South Korea\" class=\"read-more\" href=\"https://www.cryptopolitan.com/twitch-plans-to-cease-operations-south-korea/\" aria-label=\"More on Twitch announces plans to cease operations in South Korea\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T14:44:03.000Z",
    "title": "Debt Box urges the court to dismiss SEC’s lawsuit",
    "url": "https://www.cryptopolitan.com/debt-box-urges-the-court-dismiss-sec-lawsuit/",
    "description": "In a recent legal development, Debt Box and several co-defendants are vigorously seeking the dismissal of a lawsuit brought forth by the United States Securities and Exchange Commission (SEC). This move follows a court’s determination that the SEC employed deceptive tactics to secure a temporary restraining order against them. Debt Box wants allegations against the ... <a title=\"Debt Box urges the court to dismiss SEC’s lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/debt-box-urges-the-court-dismiss-sec-lawsuit/\" aria-label=\"More on Debt Box urges the court to dismiss SEC’s lawsuit\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-06T15:02:35.000Z",
    "title": "CoinMarketCap: BitTorrent top performer with 104% price gain",
    "url": "https://crypto.news/coinmarketcap-bittorrent-top-performer-with-104-price-gain/",
    "description": "On Dec. 6, CoinMarketCap, a highly referenced price-tracking website for cryptoassets, reported BitTorrent was the top gainer."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-06T15:00:56.000Z",
    "title": "Crypto Analyst Predicts Dogecoin Price Pump Of Epic Proportions To $0.7, Here’s When",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-price-pump-to-0-7/",
    "description": "A crypto analyst has shared his projections on the future trajectory of the foremost meme coin, Dogecoin (DOGE). He also hinted as to when DOGE would experience this tremendous rally that would make it rise to $0.7. When DOGE Will Hit $0.7 In a post shared on his X (formerly Twitter) platform, crypto analyst Captain Faibik stated that an “epic pump” is not far for Dogecoin. From the accompanying chart he shared, this projected rally would see the meme coin rise to $0.7. This move, which will see DOGE gain over 900%, is expected to happen in the first half of 2024.   Related Reading: Shiba Inu Burn Rate Surges With Over 8 Billion SHIB Burned, Here’s The Trigger Source: X There seems to be a general bullish sentiment around Dogecoin from a technical analysis perspective. Recently, crypto analyst MonoCoinSignal highlighted how DOGE’s price had entered an important zone. He noted that this zone, alongside other indicators, suggests a bullish momentum as the meme coin could be on its way up.  Another crypto analyst who goes by Jhonnybrah on Tradingview had also hinted that a god candle might be incoming for DOGE’s price. Unlike MoonCoinSignal, Jhonnybrah provided potential price targets that DOGE could hit. The first target for the god candle happens to be just below $0.14, with the second target above the $0.22 mark.  DOGE price rises above $0.1 &#124; Source: DOGEUSD on Tradingview.com A Dogecoin Parabolic Move In 2024 Confirmed? Crypto analyst JD also recently shared his thoughts on DOGE’s price action. The crypto analyst suggested that the charts were properly set up for a significant rally in the meme coin’s price. He stated that the “King of Memcoins” had a “beautiful chart structure” based on the monthly chart he shared.  JD noted that the MACD (Moving Average Convergence Divergence) was on the verge of having another bullish cross. The last two times this happened are said to be in 2017 and 2021, when DOGE saw a 62x and 370x, respectively, in its price. Based on the chart he shared, 2024 could be when DOGE experiences this bullish cross again.  Related Reading: Crypto Expert Delivers Top 8 Altcoins To Buy On Binance There seems to be no doubt about Dogecoin’s incoming pump, especially considering that the meme coin’s price has trended low for a while now. Several macro factors are also aligning toward this upward trend. Recently, Bitcoinist reported that the open interest on Dogecoin has crossed the $500 million threshold.  Meanwhile, Dogecoin recently achieved a new milestone as it was reported that over 5 million addresses now hold DOGE tokens. The belief in the meme coin seems to be growing, and with that in mind, more liquidity could flow into its ecosystem soon enough.  At the time of writing, DOGE is trading at around $0.10, up over 17% in the last 24 hours, according to data from CoinMarketCap.  Featured image from Inside Telecom, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-06T15:01:00.000Z",
    "title": "BTC’s Indicators Continue to Signal Bullish; Will Bitcoin Break Beyond $50K?",
    "url": "https://coinedition.com/btcs-indicators-continue-to-signal-bullish-will-bitcoin-break-beyond-50k/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/10.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BTC Indicators Signal Bullish\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/10.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/10-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/10-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/10-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/10-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/10-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>With the Fear and Greed Index showing extreme greed signals, BTC is moving closer to the $45,000 mark as level traders and analysts are keenly observing its momentum. Bitcoin is currently priced at $43,858.22 after experiencing a surge of 5.17% in 24 hours. At the time of writing, the king of cryptocurrencies was able to [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/btcs-indicators-continue-to-signal-bullish-will-bitcoin-break-beyond-50k/\">BTC’s Indicators Continue to Signal Bullish; Will Bitcoin Break Beyond $50K?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]