[
  {
    "source": "NewsBTC",
    "date": "2023-09-19T00:00:57.000Z",
    "title": "Next Bitcoin Peak: Why It Could Still Be 2 Years Away",
    "url": "https://www.newsbtc.com/bitcoin-news/next-bitcoin-peak-why-it-could-still-be-2-years-away/",
    "description": "Bitcoin&#8217;s last all-time high was $69,000 in November 2021; as of September 2023, it&#8217;s been 22 months since that peak. While estimating what price Bitcoin could reach next can be very useful, it&#8217;s also important to estimate when a new peak could occur. History suggests this may still be some time away, as analysis shows that the next Bitcoin peak could arise around the end of 2025. Previous Cycles A specific pattern seems to occur when looking at previous tops and bottoms. The three previous bottoms, January 2015, December 2018, and November 2022, were all exactly 47 months apart. Similarly, the previous three tops, November 2013, December 2017, and November 2021, are either 49 or 47 months apart. Market participants could anticipate the next Bitcoin peak around October-December 2025 if this pattern persists. The subsequent bottom could then occur around October 2026. Source BTCUSD on TradingView.com This phenomenon of tops and bottoms forming cyclically is a widely held belief in investing. Both stock markets and economies are believed to experience periods of expansion, marked by increased economic activity and rising stock market prices, and contraction, during which the stock market prices decline, and economic growth slows. What&#8217;s particularly interesting about Bitcoin is its consistent pattern of forming its tops and bottoms roughly every four years. The &#8216;halving theory&#8217; is a popular explanation for this observed pattern. Related Reading: Is Bitcoin Forming A Double Bottom? Here’s What Needs To Happen The Halving Theory Approximately every four years, Bitcoin undergoes a &#8216;halving&#8217; event, during which the reward for mining new blocks (i.e. the new supply of Bitcoin) is halved. This mechanism ensures the scarcity of Bitcoin, which is capped at a maximum supply of 21 million coins. A simple economic principle suggests that prices rise when supply drops while demand stays constant or grows. Historically, Bitcoin has reached a new peak a year after each halving. Given that the next halving is projected to be in April 2024, it aligns with the chart above, showing the next Bitcoin peak to be around the end of 2025. Related Reading: Glassnode Co-Founders Weigh In On Bitcoin (BTC) Path To $30,000 Next Bitcoin Peak &#8211; Will This Time Be Different? While historical data points provide valuable insights into the potential future performance of an asset, it&#8217;s crucial to understand that history does not always exactly repeat itself &#8211; it often rhymes. This suggests that while certain patterns from the past might re-emerge, they don&#8217;t necessarily play out in the same way. Various factors, such as technological advances, macroeconomic conditions, and regulatory changes, can introduce differences. In the current market scenario, Bitcoin is navigating through a high-inflation and high-interest-rate environment for the first time. These conditions can lower market liquidity as investors might have reduced capital available for investment. Additionally, faced with such an environment, many investors could turn to savings or bonds, which may present more attractive and stable returns than other assets. Investment Disclaimer: The content provided in this article is for informational and educational purposes only. It should not be considered investment advice. Please consult a financial advisor before making any investment decisions. Trading and investing involves substantial financial risk. Past performance is not indicative of future results. No content on this site is a recommendation or solicitation to buy or sell any securities or cryptocurrencies. Featured image from iStockPhoto, Charts from TradingView.com Predycto is the author of a cryptocurrency newsletter. Sign up for free. Follow @Predycto on Twitter."
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-19T00:00:19.000Z",
    "title": "Ex-Goldman Sachs Executive Lays Out Bull Case for Ethereum Rival Solana, Says SOL Best Story Outside of ETH",
    "url": "https://dailyhodl.com/2023/09/18/ex-goldman-sachs-executive-lays-out-bull-case-for-ethereum-rival-solana-says-sol-best-story-outside-of-eth/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/solana-phone.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/solana-phone.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/solana-phone.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/solana-phone.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/solana-phone.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/solana-phone.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/solana-phone.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Former Goldman Sachs executive Raoul Pal says that Solana (SOL) is one of his top altcoin picks and is potentially the most promising project outside of Ethereum (ETH). In a new interview with Altcoin Daily, the Real Vision founder says Solana co-founder Anatoly Yakovenko, commonly referred to as Toly, is becoming an important thought leader [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/18/ex-goldman-sachs-executive-lays-out-bull-case-for-ethereum-rival-solana-says-sol-best-story-outside-of-eth/\">Ex-Goldman Sachs Executive Lays Out Bull Case for Ethereum Rival Solana, Says SOL Best Story Outside of ETH</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]