[
  {
    "source": "Decrypt",
    "date": "2023-07-28T11:04:21.000Z",
    "title": "Feuding Bankrupt Crypto Firms Genesis and FTX Reach in Principle Agreement",
    "url": "https://decrypt.co/150442/feuding-bankrupt-crypto-firms-genesis-and-ftx-reach-principle-agreement",
    "description": "FTX claims Genesis owes it $2 billion while Genesis claims it owes nothing. A joint letter to the courts now suggests they’ve settled."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T10:46:11.000Z",
    "title": "Why the U.S. and China Struggle for AI Dominance Is Strategic, Former Pentagon Chief Warns",
    "url": "https://www.cryptopolitan.com/us-china-ai-dominance-pentagon-chief/",
    "description": "Former Defense Secretary Mark Esper has emphasized the critical nature of the ongoing competition for AI dominance between the United States and China. He believes AI will revolutionize multiple industries and has stressed the need for the U.S. to take the lead and dominate this technological space. The U.S. military is now turning to AI ... <a title=\"Why the U.S. and China Struggle for AI Dominance Is Strategic, Former Pentagon Chief Warns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-china-ai-dominance-pentagon-chief/\" aria-label=\"More on Why the U.S. and China Struggle for AI Dominance Is Strategic, Former Pentagon Chief Warns\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-28T10:53:46.000Z",
    "title": "FTX and Genesis reach settlement in bankruptcy case",
    "url": "https://crypto.news/ftx-and-genesis-reach-settlement-in-bankruptcy-case/",
    "description": "FTX and Genesis representatives informed the US court that they are ready to settle the bankruptcy case. In a filing to Judge Lane of the United States Bankruptcy Court, FTX and Genesis lawyers state that they agreed on a potential&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-28T11:00:26.000Z",
    "title": "DeFi Protocol Sparks Speculation Of $16 Million Rug Pull After Severing Lines of Communication",
    "url": "https://www.newsbtc.com/news/defi/defi-protocol-sparks-speculation-of-rug-pull/",
    "description": "DeFi protocol, Hector Network, has closed its official Discord server, leaving many investors in the dark. The move comes amidst growing suspicions of a $16 million rug pull engineered through a so-called hard rug, a process where funds are quickly moved, leaving investors with shitcoins. This comes after a controversial rage-quit vote organized by the project’s DAO.  DeFi Protocol Hector Network Leaves Investors In Limbo Hector Network investors woke up to the news that the DeFi protocol had cut off communications on its official Discord server. The Discord server was the only means of communication between the network’s team and its investors which was established after the Hector Network team censored them from the official server in April.  Related Reading: Lacoste Unveils Exclusive Ethereum-Based Virtual Store For NFT Holders The server was meant to run parallel to the official Discord, preserving data from the latter. Since then, it has become the only means of communication among DAO members. The move has left the network’s investors in a state of shock since they no longer have any means of communication with the network’s team. This has led to a lot of backlash, and according to Libagscientist, an investor and vocal critic of the platform, “there is no backchannel open anymore.”  In the absence of any official communication, dejected investors are accusing the network of siphoning the $16 million left in its treasury.  According to investors, the team embezzled the project’s funds over an 18-month period starting in 2021. According to records of DAO votes, the Hector team received over $51 million in salaries during this period without delivering on any meaningful milestone. An aggrieved investor identified as Jintu said, “..not one thing has actually moved forwards.” A Story of Sheer Incompetence and Greed The Hector Network is part of several Olympus DAO forks, a prominent cryptocurrency reserve currency project that peaked during the DeFi summer of 2021. The Hector Network, like other Olympus DAO forks, promised huge annualized yields of about 100,000% in the beginning, and the early successes of Olympus DAO attracted many investors hunting for massive returns.  During its hay days, Hector Network’s native token, HEC reached $357 in late 2021. However, the platform&#8217;s challenge lies in the fact that its inflationary yield needs to be supported with a steady influx of investor cash to keep the HEC token valuable and maintain its high yields.  Related Reading: European Central Bank Follows US Fed’s Footsteps With 25 BPS Hike Following the crypto winter that began in November 2021, the platform has been unable to recover. Aggrieved investors believe that the team should have applied the funds held in its treasury toward developing value for token holders.  Many have now accused the team of being greedy and unconcerned about meeting the targets of the network and the current saga might eventually end up in the courts. However, investors’ top priority remains to recoup their funds. Hector Network has declined requests for comments but has unequivocally rejected the allegations in a statement released on June 14. HEC token price trending low at $3.2 &#124; Source: HECBUSD on Tradingview.com Featured image from Bitcoinist, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T11:00:12.000Z",
    "title": "Will This New Hybrid Memecoin Eclipse Dogecoin (DOGE) Spectacular Growth and Rewrite Memecoin History?",
    "url": "https://www.crypto-news-flash.com/will-this-new-hybrid-memecoin-eclipse-dogecoin-doge-spectacular-growth-and-rewrite-memecoin-history/?utm_source=rss&utm_medium=rss&utm_campaign=will-this-new-hybrid-memecoin-eclipse-dogecoin-doge-spectacular-growth-and-rewrite-memecoin-history",
    "description": "<img width=\"512\" height=\"286\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T134912.460.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T134912.460.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T134912.460-300x168.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The power tussle in the memecoin niche is ever-raging, and new coins are springing up every day to disrupt the power hierarchy. Dogecoin (DOGE), which has established its authority as an industry-leading meme coin over the years, is set to be eclipsed by a new hybrid meme coin. The news of the potential and utility [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T10:47:54.000Z",
    "title": "Grayscale Urges SEC for Simultaneous Approval of All Proposed Spot Bitcoin ETFs to Ensure Fair Competition",
    "url": "https://www.crypto-news-flash.com/grayscale-urges-sec-for-simultaneous-approval-of-all-proposed-spot-bitcoin-etfs-to-ensure-fair-competition/?utm_source=rss&utm_medium=rss&utm_campaign=grayscale-urges-sec-for-simultaneous-approval-of-all-proposed-spot-bitcoin-etfs-to-ensure-fair-competition",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/12/btc-g9e6e35ba2_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/12/btc-g9e6e35ba2_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/btc-g9e6e35ba2_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/btc-g9e6e35ba2_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/btc-g9e6e35ba2_1920-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/btc-g9e6e35ba2_1920-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/btc-g9e6e35ba2_1920-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/btc-g9e6e35ba2_1920-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/btc-g9e6e35ba2_1920-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/btc-g9e6e35ba2_1920-48x32.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Grayscale Exec urges the SEC to approve all spot Bitcoin ETF applications together. The hope may be strained with the SSA-linked to Coinbase exchange. Asset management firm Grayscale Investments is encouraging American regulator the Securities and Exchange Commission (SEC) to simultaneously approve all the filed applications for a spot Bitcoin (BTC) Exchange Traded Fund (ETF). [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-28T10:41:57.000Z",
    "title": "Top 5 MOONSHOT Cryptos in Polygon",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-5-moonshot-crypto-in-polygon/",
    "description": "<p>Do you keep looking for early opportunities for making millions in crypto?  Let me tell you a secret. These opportunities are 99% of the time found in ecosystems that are exploding.  Polygon has been outcompeting all other L2 solutions like Optimism and Arbitrum in terms of users, revenue, and transactions. One of the reasons behind [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-5-moonshot-crypto-in-polygon/\">Top 5 MOONSHOT Cryptos in Polygon</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]