[
  {
    "source": "CoinDesk",
    "date": "2023-07-11T09:00:00.000Z",
    "title": "Crypto Can’t Be Used as Money Due to ‘Inherent Flaws,’ BIS Tells G20",
    "url": "https://www.coindesk.com/policy/2023/07/11/crypto-cant-be-used-as-money-due-to-inherent-flaws-bis-tells-g20/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Central bankers, wary of displacing their own fiat currencies, pointed to the past year's prominent hacks and collapses."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-11T09:00:00.000Z",
    "title": "Starbucks Partners With Micah Johnson’s Aku NFT Collection",
    "url": "https://cryptodaily.co.uk/2023/07/starbucks-partners-with-micah-johnsons-aku-nft-collection",
    "description": "<p>Starbucks&rsquo; Web3 loyalty program Odyssey has announced a collaboration with the Aku non-fungible token (NFT) collection.&nbsp;</p>\n<p>The collaboration will see the next Starbucks Odyssey Journey feature a stamp &ldquo;designed by Aku&rdquo; and a donation to a non-profit.&nbsp;</p>\nThe Starbucks-Aku Collaboration&nbsp;\n<p>Starbucks has collaborated with the Aku NFT collection for its next digital collectible Stamp, available on its dedicated Discord channel. The Aku NFT collection was created by former Major League Baseball player Micah Johnson and focuses on empowering young kids to dream big and pursue their dreams. The collection has attracted interest from several high-profile celebrities, with NFTs from the collection having been purchased by Pusha T, Trevor Noah, and Tyra Banks.&nbsp;</p>\n<p>Micah Johnson thanked Starbucks for their support, tweeting on his official Twitter handle,&nbsp;</p>\n\n<p>&ldquo;I&rsquo;m extremely grateful to @Starbucks for supporting our mission to not just be a character that represents good but a character that actually does good.&rdquo;</p>\n\nThe New Journey&nbsp;\n<p>Starbucks plans to launch the new Journey on the 17th of July. The new Journey, called &ldquo;Aku Adventure,&rdquo; will allow Odyssey members to &ldquo;embark on a new mission with Aku.&rdquo; A post on the Discord channel states that the new Stamp has been &ldquo;designed by Aku,&rdquo; and the Journey will be available exclusively to Odyssey members until the 13th of August, 2023. Additionally, as part of the launch, Starbucks has also announced that it would be donating $100,000 to Blessings in a Backpack, a non-profit dedicated to addressing food insecurity among children.&nbsp;</p>\nThe Odyssey Program&nbsp;\n<p>Starbucks had launched its highly anticipated Odyssey program in December 2022, combining customer loyalty rewards with NFTs and other gamified elements. The Web3 extension of the hugely popular Starbucks Rewards Program was opened to a select group of waitlist members which included customers and existing employees. Those joining the program could engage in interactive &ldquo;Journeys&rdquo; and earn &ldquo;Journey Stamps,&rdquo; which came in the form of Polygon-based NFTs. Users could also collect Odyssey Points and gain access to new benefits and experiences in the future.&nbsp;</p>\n<p>At the time of launch, the company had released a statement which said,&nbsp;</p>\n\n<p>&ldquo;Starbucks Odyssey is an experience surrounded by a digital community where members can come together, interact, and share their love of coffee. Starbucks is using meaningful elements of Web3 technology to reward members in innovative ways.&rdquo;</p>\n\n<p>The company has been rolling out limited-edition NFTs to the members of the invitation-only Odyssey loyalty program for a considerable amount of time. Back in March, the company announced the release of &ldquo;The Siren Collection,&rdquo; which offered 2000 Stamps, each priced at $100. The Siren Collection saw staggering demand, with collectors complaining of a wave of technical glitches and long wait times. More recently, Starbucks launched the &ldquo;Starbucks First Store Collection.&rdquo; The collection consisted of 5000 stamps, each priced at $99. This launch had a far smoother launch than the Siren Collection.&nbsp;</p>\n<p>CMO Bradley Brewer stated that Starbucks wanted to invest in blockchain for a considerable amount of time but was waiting for a concrete way of using the technology to help expand its business and loyalty program. According to Brewer, the company wanted to make NFTs the gateway to the digital community but obscured the exact nature of the technology to bring more users to the Web3 platform.&nbsp;</p>\n\n<p>&ldquo;It happens to be built on blockchain and web3 technologies, but the customer &mdash; to be honest &mdash; may very well not even know that what they&rsquo;re doing is interacting with blockchain technology. It&rsquo;s just the enabler.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-11T08:55:58.000Z",
    "title": "Grayscale Demands to Know Why Riskier Leveraged ETFs Are Approved",
    "url": "https://cryptodaily.co.uk/2023/07/grayscale-demands-to-know-why-riskier-leveraged-etfs-are-approved",
    "description": "<p>Grayscale Investments has sent a letter to the US Court of Appeal, demanding to know how the SEC can allow a leveraged 2x Bitcoin ETF to be approved but not a spot Bitcoin ETF. </p>\n<p>A lawyer for Grayscale Investments sent a letter to a US Circuit Court, questioning the SEC&rsquo;s refusal to allow Grayscale&rsquo;s Bitcoin ETF (exchange-traded fund) to trade.</p>\n<p>On Monday, Donald B Verilli, Jnr. sent a letter to Judge Mark Langer of the US Court of Appeals, pointing out that the US SEC has allowed Volatility Shares&rsquo; 2X Bitcoin Strategy ETF (BITX) to trade.</p>\n\n<p dir=\"ltr\" lang=\"en\">Today, our attorneys filed a letter with the DC Circuit highlighting the disparity between the SEC&rsquo;s approval of a leveraged #bitcoin futures ETF while continuing to deny approval of spot bitcoin ETFs like $GBTC. Let&rsquo;s dive deeper. 🧵/6 pic.twitter.com/z7WyGBthhT</p>\n&mdash; Grayscale (@Grayscale) July 10, 2023\n<p>\n\n</p>\nGrayscale Applies for Spot Bitcoin ETF\n<p>Verilli&rsquo;s questions come after Grayscale applied to convert its spot Bitcoin Trust into a spot Bitcoin ETF, to which the SEC answered no.</p>\n<p>Grayscale believes that BITX is a riskier product than the one regulators refuse to approve and poses the question about the rationality behind allowing the trade of a riskier product but refusing the trade of a safer one.</p>\nGrayscale Questions Why Riskier Products Receive Regulatory Approval\n<p>In the letter, Verilli argued:</p>\n\n<p>It exposes investors to an even riskier investment product than the traditional bitcoin futures exchange-traded products . . . which encompass risks related to both the futures and spot bitcoin markets.</p>\n\n<p>He noted that the 2X Bitcoin Strategy ETF seeks to double the performance of the S&amp;P CME Bitcoin Futures Daily Roll Index every day and highlighted that it is leveraged.</p>\n<p>Verilli further quoted BITX&rsquo;s registration statement, which clarifies that the product may lead to massive losses if left in the hands of those who do not have enough knowledge about it. In its stamen, BITX&rsquo;s conceded its product is suitable for &ldquo;knowledgeable investors.&rdquo;</p>\n<p>Verilli also argued that approving the Volatility Shares ETF contradicts the SEC&rsquo;s view against any fund dealing with the spot market.</p>\n<p>He wrote:</p>\n\n<p>The fact that the Commission has allowed a leveraged bitcoin futures ETP to begin trading demonstrates that the Commission continues to arbitrarily treat spot Bitcoin ETPs differently than bitcoin futures ETPs.</p>\n\nSEC&rsquo;s Arguments Lack Consistency\n<p>The SEC&rsquo;s refusal of Grayscale&rsquo;s application rested on the argument it lacked an appropriate plan to monitor the impact on spot prices stemming from fraud and market manipulation. Grayscale rejected the SEC&rsquo;s statement by saying futures prices themselves are drawn from spot markets.</p>\n<p>The SEC&rsquo;s rejection of the Volatility Shares ETF shows the agency&rsquo;s inconsistency. Verilli argued in his letter that by dealing with futures markets using leverage to achieve larger returns, the fund exposes investors to higher risk than a spot or traditional ETF would. Mr Verilli claims his argument should invalidate the SEC&rsquo;s reason for rejecting Grayscale&rsquo;s filing.</p>\n<p>Verilli stated:</p>\n\n<p>While the commission could theoretically correct its discriminatory treatment of spot bitcoin ETPs by rescinding its approval of all Bitcoin-based ETPs, the Commission&rsquo;s apparent willingness to permit even a leveraged bitcoin futures ETP&mdash;a particularly high-risk version of a Bitcoin futures product&mdash;makes clear [it] has no intention of doing so.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-11T09:00:00.000Z",
    "title": "DigiToads among the top-3 crypto presales investors are actively participating in",
    "url": "https://crypto.news/digitoads-among-the-top-3-crypto-presales-investors-are-actively-participating-in/",
    "description": "The DigiToads presale which has raised over $5.9 million is one of the top-3 crypto presales investors are actively participating in"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-11T08:45:36.000Z",
    "title": "Hong Kong bank freezes user accounts previously involved in crypto",
    "url": "https://crypto.news/hong-kong-bank-freezes-user-accounts-previously-involved-in-crypto/",
    "description": "Mox Bank, an online-only bank in Hong Kong, blocked some user accounts previously involved in crypto transactions. Some complain they have nothing to do with digital currencies. Although the virtual bank started to review the issue, some users have pointed&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-11T08:50:31.000Z",
    "title": "Bitcoin At Mid-Cycle Point: Historical Pattern Repeating Itself?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-mid-cycle-point-historical-pattern-repeating/",
    "description": "Bitcoin has reached a critical juncture in its current market cycle, according to a recent analysis conducted by on-chain analytics firm Glassnode. The data reveals striking similarities to historical patterns, raising questions about the potential emergence of a familiar phenomenon: the re-accumulation period. A Resilient Market: Bitcoin Holds Firm At Mid-Cycle The Glassnode analysis reveals that Bitcoin is consolidating around the $30,000 mark, which acts as a significant mid-point within the 2021-2023 cycle. The historical significance of this level is not to be overlooked, as it has been tested repeatedly in previous cycles. Remarkably, the mid-cycle phenomenon is not exclusive to the current cycle; similar mid-cycle points were observed in both 2013-2016 and 2018-2019, displaying analogous supply dynamics. As Bitcoin currently hovers around the $30,000 mid-point, approximately 75% of the total supply is currently held in a profitable state, while the remaining 25% remains in a loss position. This balance of supply held in profit versus loss is reminiscent of equilibrium points witnessed during previous cycles, indicating a potential re-accumulation period. Related Reading: Bitcoin Hash Rate Retakes All-Time High As Miners Continue To Expand Capacity As Glassnode explains, &#8220;This 75:25 balance of supply held in profit:loss is the equilibrium point for Bitcoin. 50% of all trading days have seen a higher Profit-to-Loss balance, and 50% a lower one.&#8221; Such equilibrium points have historically required time for the market to digest and re-consolidate around, often accompanied by a period of sideways trading and volatility. This has become known as the &#8220;re-accumulation period.&#8221; At the moment, The supply held &#8220;in-loss&#8221; has declined to just 4.79 million BTC, reaching similar levels seen in July 2021 ($30k), July 2020 ($9.2k), April 2016 ($6.5k), and March 2016 ($425). Robust Recovery And Historical Comparisons According to Glassnode, Bitcoin&#8217;s price performance in 2023 has demonstrated remarkable resilience, with a maximum drawdown of only -18% thus far, a shallow correction compared to previous cycles. This suggests a substantial underlying demand for the asset and indicates a potential strong degree of investor support. Related Reading: Bitcoin Google Search Interest Stands At Critical Level, What This Forecast For BTC Glassnode&#8217;s analysis further highlights the similarities between the current recovery rally and those observed in prior cycles. Historically, recovery rallies following a similar magnitude move off the cycle&#8217;s bottom often marked the genesis of a new cyclical uptrend. While exceptions exist, the parallels between the current recovery and those of the past offer an intriguing possibility for Bitcoin&#8217;s future trajectory. The report notes, &#8220;With the exception of 2019, all prior cycles which experienced a similar magnitude move off the bottom were, in fact, the genesis point of a new cyclical uptrend.&#8221; Remarkably, previous re-accumulation periods were characterized by a lack of macro market direction and tending to trade sideways. “With the market back at this equilibrium point, it remains to be seen if a similarly lengthy and choppy process is needed to overcome it,” concludes Glassnode. The Takeaway: Will History Repeat For BTC? Glassnode&#8217;s analysis unveils a fascinating narrative within Bitcoin&#8217;s ongoing market cycle. The emergence of the mid-cycle point and the familiar supply dynamics indicate that historical patterns are repeating themselves. While no crystal ball can predict the future with certainty, these insights offer intriguing possibilities for Bitcoin&#8217;s trajectory. At press time, the BTC price was at $30,626 and remained in the trading range of the last two weeks. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-11T09:00:28.000Z",
    "title": "Traders Predict Price Surges For Render Token, Cosmos, Tradecurve – Here Are Their Targets",
    "url": "https://www.crypto-news-flash.com/traders-predict-price-surges-for-render-token-cosmos-tradecurve-here-are-their-targets/?utm_source=rss&utm_medium=rss&utm_campaign=traders-predict-price-surges-for-render-token-cosmos-tradecurve-here-are-their-targets",
    "description": "<img width=\"512\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-11T100528.253.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-11T100528.253.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-11T100528.253-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As we move into the second half of 2023 investors are placing their bets on what projects will increase in value. Though many are split in their opinion about many options, most agree that Render Token, Cosmos, and Tradecurve could experience huge price surges, with Tradecurve holders already enjoying profits of 80%.  As Render Token [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-11T08:46:06.000Z",
    "title": "Top 3 Hidden Crypto Gems Ready to Break Out",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-hidden-crypto-gems-ready-to-break-out/",
    "description": "<p>While well-known cryptocurrencies dominate the headlines, there are hidden gems within the crypto space that possess tremendous potential for explosive growth. In this article, we will explore three such hidden crypto gems that have been quietly making waves in the industry. We will delve into their unique features, use cases, and highlight their latest achievements, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-hidden-crypto-gems-ready-to-break-out/\">Top 3 Hidden Crypto Gems Ready to Break Out</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]