[
  {
    "source": "Cointelegraph",
    "date": "2023-08-18T14:33:41.000Z",
    "title": "BTC price nears $26K amid warning Bitcoin sell pressure can 'double'",
    "url": "https://cointelegraph.com/news/btc-price-26k-warning-bitcoin-sell-pressure-double",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/93c81e0a-4822-438c-ba16-3f738a3a67e1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price weakness continues into Wall Street trading, and Bitcoin has yet to rival seller capitulation from earlier this year.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) stayed near two-month lows at the Aug. 18 Wall Street open as markets came to terms with extreme liquidations.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/17343861-644c-4144-a639-c8bb79e89136.png\"  /></figure><h2>\"Drying liquidity\" costs BTC price key support</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed BTC price action tracking sideways after a single daily candle spawned 8% losses.</p><p>The largest cryptocurrency saw a <a href=\"https://cointelegraph.com/news/bitcoin-ether-price-slump-crypto-bloodbath-1-b-liquidations\">cascade of liquidations</a> across derivatives markets, with these accounting for an “outsized” majority amid relatively slack spot selling.</p><p>“In Deribit it is likely that a large account got wiped, considering the immense short liquidation that occured together,” trading firm QCP Capital wrote in a market update sent to Telegram channel subscribers on the day.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/1138f5c0-d100-4207-afe1-4115c1512f36.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin liquidations composite chart. Source: QCP Capital</em></figcaption></figure><p>QCP, like others, noted that the market reaction to the alleged trigger — a write-down of SpaceX’s $373 million BTC holdings — <a href=\"https://cointelegraph.com/news/elon-musk-spacex-bitcoin-write-down-bitcoiners-elon-musk\">appeared exaggerated</a>.</p><p>“This brought back the 2021 and 2022 ghosts of Elon-driven tops and bottoms, and we certainly hope the market will not revert back to those times again,” it continued, referring to <a href=\"https://cointelegraph.com/news/tesla-selling-bitcoin-last-year-turned-out-to-be-a-500m-mistake\">previous Bitcoin sales</a> and accompanying comments from Elon Musk, joint CEO of SpaceX and Tesla.</p><p>Total liquidations challenged those seen in the immediate aftermath of the FTX exchange meltdown — the event which resulted in BTC/USD <a href=\"https://cointelegraph.com/news/bitcoin-price-hits-multi-year-low-at-15-6k-analysts-expect-further-downside\">dipping to two-year lows of $15,600</a> in November 2022.</p><p>“This feels like yet another sign of the drying liquidity markets have seen over the last few weeks,” financial commentary resource The Kobeissi Letter <a href=\"https://twitter.com/KobeissiLetter/status/1692531047110500352\" target=\"_blank\" rel=\"noopener nofollow\">added</a> in part of its own reaction.</p><h2>Analyst: Spot sell volume still 50% below 2023 high</h2><p>As BTC price drifted slowly toward $26,000, market participants diverged over the true nature of the situation and its future implications.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/how-low-can-the-bitcoin-price-go\"><strong><em>How low can the Bitcoin price go?</em></strong></a></p><p>For popular trader and analyst Rekt Capital, the picture was bleak — a <a href=\"https://cointelegraph.com/news/bitcoin-spot-selling-btc-price-dips-below-28-7k\">double top formation</a> for BTC/USD in 2023, and a complete lack of support from trend lines and moving averages during the breakdown.</p><p>“BTC formed its Higher High at ~$31000 on inclining volume. But price formed the second half of its Double Top on declining volume,” he <a href=\"https://twitter.com/rektcapital/status/1692526837824377107\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in part of multiple X posts.</p><p>An accompanying chart showed trading volume on daily timeframes, as Rekt Capital warned that capitulation had likely not yet matched previous sell-offs.</p><p>“Though there was a small breakout in seller volume on this crash… It's still nowhere near the Seller Exhaustion volume levels (green box) of previous BTC reversals (yellow circles),” he explained.</p><blockquote>“In fact, current Seller Volume would need to probably double to reach those Seller Exhaustion volume levels that prompted price reversals in early &amp; late March as well as mid-June.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/1db38200-6151-429e-8144-8199854414e5.jpg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Rekt Capital/X</em></figcaption></figure><p>Others were more optimistic, including trader CryptoCon, who identified key two completed tasks common to successful BTC price rebounds during bull market retracements.</p><p>These involved relative strength index (RSI) values bouncing at the 0.382 Fibonacci retracement level.</p><p>“Every cycle, the Weekly Bitcoin RSI experiences a fake out of the bull market start line, some lasting longer than others,” he <a href=\"https://twitter.com/CryptoCon_/status/1692528264282100147\" target=\"_blank\" rel=\"noopener nofollow\">explained</a>.</p><blockquote>“And every one of them makes a revisit to the .382 Fibonacci retrace of the move. With the latest drop, both of those things are now complete.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/442aff1c-db5c-46c2-97a9-6b800732739a.jpg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart with weekly RSI. Source: CryptoCon/X</em></figcaption></figure><p>Rekt Capital noted that daily RSI was now at its most “oversold” since June 2022, with only two episodes in Bitcoin’s history, both in bear markets, beating it.</p><p>Looking ahead, QCP meanwhile flagged next week’s commentary from Jerome Powell, Chair of the United States Federal Reserve, as the next potential source of volatility.</p><p>“We believe that a lot now rests on Powell's speech at Jackson Hle next week,” it concluded.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/banning-ransomware-payments-attractive-dangerous-idea/\">Should we ban ransomware payments? It’s an attractive but dangerous idea</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-18T14:30:15.000Z",
    "title": "AI is helping expand accessibility for people with disabilities",
    "url": "https://cointelegraph.com/news/ai-accessibility-disabilities",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/1df1166d-74ae-49a5-8641-e00d157e7fd4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A holistic approach to empowering lives: how AI redefines the accessibility landscape for people with disabilities. </p>\n                    <p><p><a href=\"https://www.who.int/news-room/fact-sheets/detail/disability-and-health\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to data from the World Health Organization (WHO), more than one billion people are living with some significant disability today. Moreover, with the market for AI-related technologies set to <a href=\"https://www.fortunebusinessinsights.com/industry-reports/artificial-intelligence-market-100114\" target=\"_blank\" rel=\"noopener nofollow\">grow</a> to a cumulative valuation of over $2 trillion in the next seven years, it is reasonable to suggest that the marriage of these spaces can help introduce a new era of accessibility.</p><h2>Transforming the lives of people with speech impediments</h2><p>A key area where AI is making its presence felt is when it comes to supporting people with non-standard speech. Voiceitt is an accessible speech recognition technology company that uses AI and machine learning to assist people with speech impairments.</p><p>The tech is designed to recognize and adapt to non-standard speech patterns, thereby enabling clearer communication. The technology is particularly beneficial for individuals who have cerebral palsy, Parkinson’s disease and Down syndrome, wherein producing clear speech can be challenging.</p><p>As the realm of artificial intelligence (AI) has grown, this still-emerging technology has <a href=\"https://scholarlykitchen.sspnet.org/2023/06/05/guest-post-accessibility-powered-by-ai-how-artificial-intelligence-can-help-universalize-access-to-digital-content/\" target=\"_blank\" rel=\"noopener nofollow\">exhibited</a> an ability to help improve the quality of life for people living with different kinds of disabilities. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/D4ao_JvDnsY\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Dr. Rachel Levy, speech-language pathologist and customer success manager at Voiceitt, told Cointelegraph, “The way our technology works is that people input their speech data into our system, and we have a huge database of non-standard speech. So we have held all of this speech data plus the individuals’ speech data that affects their own model.” </p><p>“This means that the technology learns from the individual’s unique speech patterns and uses this information to translate their speech into a form that is easily understood by others,” she added.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/banning-ransomware-payments-attractive-dangerous-idea/\">Should we ban ransomware payments? It’s an attractive but dangerous idea</a></em></strong></p><p>Levy further explained how the technology adapts to changing speech patterns, particularly for individuals with degenerative disorders. Therefore, as these individuals use the tool, Voiceitt continues to record their speech while human annotators transcribe the data to increase recognition accuracy. So if there’s deterioration in their speech intelligibility, the platform can adapt accordingly and retrain its data models to incorporate the new speech patterns.</p><p>Voiceitt also has a live captioning capability. This feature allows for real-time speech transcription during video conference calls or live interactions, making conversations more accessible for individuals with speech impediments. Levy demonstrated this feature to Cointelegraph, showing how the technology can transcribe speech into text and even share it on social media or via email.</p><h2>Enhancing vision</h2><p><a href=\"https://www.who.int/news-room/fact-sheets/detail/blindness-and-visual-impairment#:~:text=Globally%2C%20at%20least%202.2%20billion,has%20yet%20to%20be%20addressed.\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a 2023 study by the WHO, more than 2.2 billion people have some sort of vision impairment, and at least one billion of these cases are easily treatable. </p><p>AI-powered imaging tools now have the potential to assist by converting visual data into various kinds of interpretable formats. For instance, tools like OCR.best and Image2TxT are designed to automatically decipher visual cues and convert them into text and audio-based responses. </p><p>Similarly, advanced AI models like ChatGPT-4 and Claude 2 have introduced plugins that are capable of decoding extremely complex info (such as scientific data) contained in images, and interpret them with optical character recognition tools.</p><p>Lastly, AI-based image tools can increase and decrease contrast and optimize the resolution quality of images in real time. As a result, individuals with conditions like myopia and hyperopia can alter the resolution of images to suit their visual abilities.</p><h2>Redefining hearing </h2><p>As of Q1 2023, the WHO <a href=\"https://www.who.int/news-room/fact-sheets/detail/deafness-and-hearing-loss\" target=\"_blank\" rel=\"noopener nofollow\">estimates</a> that approximately 430 million people currently have “severe disabling hearing loss,” which accounts for nearly 5% of the global population. Moreover, the research body has indicated that by 2050, over 700 million people — or one in every 10 people — will have disabling hearing loss.</p><p>Recent AI-assisted hearing tools have allowed individuals with compromised hearing to obtain live captions, audio and video content transcripts. For example, Ava is a transcription app providing the text of any conversation happening around its periphery. Similarly, Google’s Live Transcribe provides a similar service, making everyday conversations more accessible for people with hearing impairments.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/jLCwjIaPXwA\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Another platform called Whisper harnesses sound separation technology to enhance the quality of incoming speech while reducing background noise to deliver sharper audio signals. The platform also uses algorithms to learn and adapt to a user’s listening preferences over time.</p><h2>AI-enabled mobility </h2><p>The Centers for Disease Control and Prevention <a href=\"https://www.cdc.gov/ncbddd/disabilityandhealth/infographic-disability-impacts-all.html\" target=\"_blank\" rel=\"noopener nofollow\">notes</a> that a little over 12% of Americans experience mobility issues. </p><p>Recent innovations in AI-enabled mobility assistants have aimed to build upon already existing mobility aids like wheelchairs.</p><p>For example, there are now AI-powered wheelchairs that can take audio cues from the user, thus opening up a new dimension of freedom and mobility. Firms like UPnRIDE and WHILL have created products that offer autonomous navigation and movement capabilities.</p><p>AI also appears in mobility-focused exoskeletons and prosthetic limbs, improving the autonomy of finer movements in prosthetic arms and boosting the power of electromyography-controlled nerve interfaces for electronic prosthetics. </p><p>AI-based systems can actuate and read different nerve inputs simultaneously, improving the overall function and dexterity of the devices.</p><p>The University of Stanford has also developed an exoskeleton prototype that uses AI to improve energy expenditure and provide a more natural gait for users.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/-vTk-TRN0C8\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><h2>Challenges for AI-enabled devices</h2><p>AI requires the processing of massive data sets to be able to deliver high-quality results. However, in the context of disability, this involves collecting and storing sensitive personal information regarding an individual’s health and physical or cognitive abilities, raising significant privacy concerns. </p><p>In this regard, Voiceitt’s Levy stressed that the platform complies with various data privacy regulatory regimes, like the United States Health Insurance Portability and Accountability Act and the European Union’s General Data Protection Regulation.</p><p>She also said it is standard practice to “de-identify all of the speech data separating personal data from audio recordings. Everything is locked in a secure database. We don’t share or sell any of our voice data with anyone unless expressly given permission by the user.”</p><p>Secondly, because AI tech is expensive to devise, the development of personalized tools for people with specific ailments can be costly and time-consuming. Moreover, the cost of maintaining and updating these systems is also significant. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/paypal-stablecoin-crypto-adoption\">PayPal’s stablecoin opens door for crypto adoption in traditional finance</a></em></strong></p><p>To this point, Jagdeep Sidhu, CEO of Syslabs — the firm behind SuperDapp, an AI-enhanced platform supporting multilingual voice translation and recognition — told Cointelegraph:</p><blockquote>“When it comes to people with visual, auditory, or mobility-related impairments, there is no denying that AI-driven technologies hold incredible potential. That said, one of the most significant hurdles in integrating AI for accessibility lies in the realm of cost. It’s an unfortunate reality that people with disabilities often face steeper costs and challenges to perform everyday tasks compared to those without disabilities.”</blockquote><p>As AI and its associated technologies see increased adoption, there is reason to believe that people with disabilities will increasingly explore this space to enhance their lives. </p><p>Even recent <a href=\"https://www.edf-feph.org/content/uploads/2020/12/final_edf_transposition_toolkit_accessibility_act.pdf\" target=\"_blank\" rel=\"noopener nofollow\">legislation</a> across Europe and North America is being tailored to improve accessibility and inclusivity, suggesting that AI will play a crucial role within this realm. </p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-18T14:20:14.000Z",
    "title": "Bitget and crypto influencer embroiled in legal saga after ReelStar token listing fiasco",
    "url": "https://cointelegraph.com/news/bitget-faces-lawsuit-influencer-reelstar-token",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/53990dcb-7879-4ca0-af06-8a75e01c721c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Evan Luthra says Bitget froze his account in April. The exchange claims it was done on suspicions of market manipulation related to the sale of REELT tokens.</p>\n                    <p><p class=\"post-content__disclaimer\"><em>Update (Aug. 18 at 2:09 pm UTC): This article has been updated with both sides’ perspectives and additional information. Further commentaries are expected from both sides.</em></p><p>Crypto influencer Evan Luthra has brought a lawsuit against crypto exchange Bitget for freezing his account after a new token listing in March. <a href=\"https://twitter.com/evanluthra/status/1687485217299222529?s=46&amp;t=QIEydTQbX5PcK7bSykEd_w\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to Luthra, the exchange suspended his withdrawals and froze $200,000 in Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) while attempts to seek clarification went unanswered. </p><p>Luthra’s involvement with the ReelStar project serves as a backdrop to these events. The influencer was hired as an adviser to ReelStar, a startup developing a social media app for creators. As compensation, Luthra was offered Reel Tokens (REELT), the project’s utility token. Upon its listing, the influencer sold 1.3 million REELT tokens on Bitget. Luthra’s account was then frozen under suspicion of market manipulation. A spokesperson from Bitget told Cointelegraph about the decision:</p><blockquote>“Bitget faced a manipulative attack by a group of traders attempting to profit by manipulating trades on the exchange. Their target was a new coin called REELT, which they tried to dump immediately after its listing on Bitget, causing a large drop in the coin’s price.“</blockquote><p>Additionally, Bitget claims to have contacted the crypto influencer for an explanation: “In response, he admitted to selling the tokens. However, when we asked for the reasons behind this abnormal behavior, we did not receive active feedback or satisfactory response.“</p><p>Luthra claims innocence, citing ReelStar CEO Navdeep Sharma’s alleged approval of his token sale plans. The influencer now seeks a substantial $16 million in damages, along with the $200,000 held in his account. His lawsuit encompasses Bitget, Foresight Ventures and key executives.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Finally, I just served Bitget $16,000,000+ for the damages and money they stole from me.<br><br>They are boldly disregarding the laws and regulations &amp; continuing their scam.<br><br>But, we won&#39;t stop.<br><br>If you have funds in Bitget, take them out before they go down.<br><br>Here&#39;s why: <a href=\"https://t.co/EHOiYREoMN\">pic.twitter.com/EHOiYREoMN</a></p>&mdash; EvanLuthra.eth (@EvanLuthra) <a href=\"https://twitter.com/EvanLuthra/status/1687485217299222529?ref_src=twsrc%5Etfw\">August 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“Bitget prevented me, a Fully KYCed user of their platform, from withdrawing my tokens,” Luthra stated to Cointelegraph, adding:</p><blockquote>“After I sold this portion of my allocated tokens, my funds —including the crypto [...] I already had on the exchange before REELT — were blocked, and the company stole what my tokens were worth for themselves.“</blockquote><p>According to Gracy Chen, Bitget’s managing director, the exchange previously <a href=\"https://www.bitget.com/support/articles/12560603778479\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> an investigation into the case, disclosing the findings weeks later along with a compensation plan for more than 500 clients using both the company’s own funds and funds from frozen transactions.</p><p>“At Bitget, user protection is our top priority. When we detect any illegal or fraudulent behaviors on our platform, we take immediate action,” she wrote in a post on Aug. 4, saying the exchange had not been notified of the lawsuit at that time.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Some recent news mentioning a potential lawsuit about us from one advisor of REELT project, contains both facts and FUDs. Regarding the &quot;abnormal trading behavior&quot; of the REELT token back in April, we have announced the investigation results and user compensation plan in our…</p>&mdash; Gracy Chen @Bitget (@GracyBitget) <a href=\"https://twitter.com/GracyBitget/status/1687651172721831936?ref_src=twsrc%5Etfw\">August 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In response to Chen, Luthra noted that he was just an “ordinary user who received the tokens as compensation for a consultation” and should not be considered part of the project team. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I am an ordinary user who received tokens as compensation for consultation, just as you received tokens for listing.<br><br>Holding me responsible for the price drop or considering me a part of the project is an unreasonable assumption. I am no more involved in the project than you…</p>&mdash; EvanLuthra.eth (@EvanLuthra) <a href=\"https://twitter.com/EvanLuthra/status/1644020077547888640?ref_src=twsrc%5Etfw\">April 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In its blog post, Bitget issued a <a href=\"https://www.bitget.com/blog/articles/Addressing-FUD-Bitget-Responds-to-a-Crypto-Influencers-Claims-about-His-Stolen-200000-USD\" target=\"_blank\" rel=\"noopener nofollow\">response</a> to the event and outlined that it was in communication with Luthra soon after the event took place. The exchange explained the reasoning behind its actions: “After our investigation, we believe the account mentioned has been involved in suspicious trading behaviors on Bitget.“ </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/6c370c24-4ad8-48d7-ab17-e3172ca0b7e8.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Bitget blog post excerpt. Source: Bitget</em></figcaption></figure><p>On X (formerly Twitter), crypto community members expressed mixed reactions to the lawsuit. While some of Luthra’s supporters <a href=\"https://twitter.com/statuses/1687527994435239941\" target=\"_blank\" rel=\"noopener nofollow\">observed</a> that the case exposes common issues faced by users of centralized crypto exchanges, others claimed otherwise, <a href=\"https://twitter.com/Izzheey/status/1688963017508110336\" target=\"_blank\" rel=\"noopener nofollow\">saying</a> Bitget acted correctly by protecting its users.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Best support by cex exchange in the <a href=\"https://twitter.com/hashtag/Crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#Crypto</a> ecosystem is always more important than their services. <br>Similar it doesn&#39;t matter that you have made best product but if you don&#39;t have enough good service center then it is worthless. <br>Without support the product and services is…</p>&mdash; AmanSai (@amansaiofficial) <a href=\"https://twitter.com/amansaiofficial/status/1687520070795493376?ref_src=twsrc%5Etfw\">August 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Several prominent figures from the crypto community jumped in to have their say on the matter, including Changpeng Zhao, the CEO of Binance. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">You should talk to them, right? We are not a regulator for other exchanges.</p>&mdash; CZ  Binance (@cz_binance) <a href=\"https://twitter.com/cz_binance/status/1643998978730770432?ref_src=twsrc%5Etfw\">April 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-18T14:15:00.000Z",
    "title": "No More On-Chain Royalty Enforcement On OpenSea",
    "url": "https://cryptodaily.co.uk/2023/08/no-more-on-chain-royalty-enforcement-on-opensea",
    "description": "<p>NFT marketplace OpenSea will be sunsetting its on-chain royalty enforcement tool, Operator Filter.&nbsp;</p>\nOperator Filter Falls Short Of Expectations\n<p>On Thursday, OpenSea announced on X (formerly Twitter) that it would be removing the Operator Filter tool from its platform. The tool was introduced on the platform back in November 2022 to allow creators to blacklist NFT marketplaces that didn't adhere to royalty enforcement standards. However, according to founder and CEO Devin Finzer, the tool's effectiveness fell short of expectations.</p>\n<p>Starting August 31, the Operator Filter will cease to block any marketplaces. For existing collections on non-Ethereum blockchains and those currently using the tool, creator fees will remain enforced until February 29, 2024.&nbsp;</p>\n<p>Finzer clarified,&nbsp;</p>\n\n<p>\"To be clear, creator fees aren&rsquo;t going away &mdash; simply the ineffective, unilateral enforcement of them.\"</p>\n\nOperator Filter Rendered Useless\n<p>The Operator Filter, touted as a \"simple code snippet,\" aimed to limit NFT sales exclusively to marketplaces that upheld creator fees. Yet, its impact didn't align with the aspirations of its creators, as Finzer pointed out that the NFT ecosystem's support for the tool was insufficient.</p>\n<p>Additionally, certain NFT marketplaces like Blur, Dew, and LooksRare managed to bypass the filter by integrating Seaport Protocol, which helped them circumvent OpenSea's blacklist and thus avoid creator fees.</p>\nCreator Concerns and Redirecting Efforts\n<p>Creators themselves expressed concerns about the Operator Filter infringing upon their control over where their collections were sold.</p>\n<p>He said,&nbsp;</p>\n\n<p>&ldquo;We have heard from some creators that the Operator Filter limits their sense of control over where their collections are sold, and at the same time may collide with a collector&rsquo;s expectation of full ownership&hellip;The Operator Filter&rsquo;s restrictions come at the expense of decentralized ownership.&rdquo;</p>\n\n<p>Finzer also emphasized that while creator fees play a role in specific business models, they constitute only one among many revenue streams available to creators. OpenSea is redirecting its efforts toward enabling new use cases, such as digital and physical redeemables, and promoting these use cases more effectively in primary and secondary experiences.</p>\nMixed Reactions from the NFT Community\n<p>This decision from OpenSea holds implications for NFT artists seeking passive income. Some creators expressed disappointment, suggesting that collectors should support them on platforms that enforce royalties.&nbsp;</p>\n<p>However, a Reddit avatar artist posited that the move might have been prudent, as the existing business model appeared to profit excessively from hype trading.</p>\n<p>OpenSea's cessation of the Operator Filter reflects a shift in approach to NFT market dynamics. While the decision might disappoint some in the NFT community, the move aims to strike a balance between creator autonomy and the evolving landscape of NFT technology applications.&nbsp;&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-18T14:30:25.000Z",
    "title": "Report: SEC on Cusp of Approving Ethereum Futures Amidst Crypto Market Rollercoaster",
    "url": "https://news.bitcoin.com/report-sec-on-cusp-of-approving-ethereum-futures-amidst-crypto-market-rollercoaster/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ether-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Report: SEC on Cusp of Approving Ethereum Futures Amidst Crypto Market Rollercoaster\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ether-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ether-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ether-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ether-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ether-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ether-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ether.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Securities and Exchange Commission (SEC) is said to be on the verge of greenlighting futures products tied to ethereum (ETH), as per a Bloomberg report. One insider privy to the development indicated that a handful could secure approval come October. Unnamed Sources Reveal SEC May Soon Greenlight Ethereum Futures Products In recent weeks, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T14:37:31.000Z",
    "title": "OpenChat Explored: Reimagining messaging on the ICP blockchain",
    "url": "https://www.cryptopolitan.com/openchat-explored-icp-blockchain/",
    "description": "In an era dominated by centralized communication platforms, decentralized alternatives shift how we connect and interact. Among these disruptors is the OpenChat dApp, an application reimagining messaging within the context of blockchain technology. As the digital landscape evolves and users seek more control over their data and interactions, OpenChat offers a unique proposition: a fully-featured ... <a title=\"OpenChat Explored: Reimagining messaging on the ICP blockchain\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openchat-explored-icp-blockchain/\" aria-label=\"More on OpenChat Explored: Reimagining messaging on the ICP blockchain\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-18T14:30:54.000Z",
    "title": "Valkyrie Taps Into Ethereum Momentum With New ETF Filing",
    "url": "https://www.newsbtc.com/news/ethereum/valkyrie-ethereum-etf-filing/",
    "description": "In a filing dated August 4, Valkyrie applied to add an Ethereum futures ETF to its Bitcoin Strategy ETF (BTF). However, it would seem this move was pushed back by the SEC as the asset manager has now filed a separate application to offer an Ether futures ETF.   Valkyrie Moves To Offer Ethereum Futures ETF In an application dated August 16, Valkyrie seeks the United States Securities and Exchange Commission&#8217;s (SEC) approval to offer an Ethereum futures exchange-traded fund (ETF).  If approved, the fund will not directly invest in Ether. Instead, it will focus on purchasing several ether futures contracts to match the total value of the ether underlying the futures contracts with the net assets of the fund.  Related Reading: Post-Hack Shenanigans: Curve (CRV) To Launch On TRON Following $2 Million Investment While this fund is relatively similar to the Bitcoin futures ETF, which has existed since 2021, it differs from the Spot Bitcoin ETF, which prominent institutional firms have filed for. Spot ETFs track the crypto asset&#8217;s price, while futures ETFs focus on the asset’s future contracts.  Valkyrie categorically noted this fact as part of its application and stated that investors looking to invest in the price of ether directly should consider investments other than this particular fund. The application also highlighted the risks involved in investing in this fund as, according to Valkyrie, “the Fund’s investments could decline rapidly, including to zero.” As such, investors should understand that they could lose their entire investment.  As is common with applications such as this, applicants must prove to the SEC that the underlying asset has a regulated market of significant size. And Valkyrie’s filing stated that its fund would be guided by the futures contracts traded on the Chicago Mercantile Exchange (CME).  ETH price recovers to $1,685 &#124; Source: ETHUSD on TradingView.com No First Mover Advantage? Valkyrie failed to clarify the status of its initial filing in its most recent application. The asset manager had previously tried to add ETH futures contracts to its Valkyrie Bitcoin Strategy ETF (BTF) in a bid to gain a first-mover advantage over other applicants.  Several other asset managers, including Bitwise, ProShares, Grayscale, and Volatility Shares, have also applied to offer an Ethereum futures ETF. However, it remains uncertain in what order the SEC is likely to approve (if it does) these applications, especially with this recent development.  Related Reading: Ledger Users Can Now Buy Crypto Directly Using PayPal Just like Cathie Wood has suggested regarding the pending Spot Bitcoin ETF applications, the SEC can approve multiple applications at once, which will likely eliminate the first mover advantage, or it can decide to approve them in the order in which these applications came in.  Despite expectations that the regulator will approve an Ether ETF this year, the probability of the SEC approving any of these applications remains uncertain as optimism dwindles.  Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-18T14:26:20.000Z",
    "title": "Polygon Labs Envisions Game-Changing Shift as Take-Two Ventures into Crypto Gaming",
    "url": "https://www.crypto-news-flash.com/polygon-labs-envisions-game-changing-shift-as-take-two-ventures-into-crypto-gaming/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-labs-envisions-game-changing-shift-as-take-two-ventures-into-crypto-gaming",
    "description": "<img width=\"1043\" height=\"606\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/polygon-network-.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/polygon-network-.png 1043w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/polygon-network--300x174.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/polygon-network--1024x595.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/polygon-network--768x446.png 768w\" sizes=\"(max-width: 1043px) 100vw, 1043px\" />The gaming industry is expected to be a huge catalyst for the mainstream adoption of blockchain technology and digital assets. Most prominent Web2 gaming projects have already begun investing in the Web3 gaming industry to secure future growth prospects. The mainstream adoption of blockchain technology has grown exponentially year over year. However, some businesses have [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-18T14:30:00.000Z",
    "title": "Mastercard Partners with Ripple, Consensys, to Drive CBDC Understanding",
    "url": "https://coinedition.com/mastercard-partners-with-ripple-consensys-to-drive-cbdc-understanding/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Mastercard_established_a_CBDC_partner_initiative_in_collaboration-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Global payment giant Mastercard has unveiled its new Partner Program to enhance understanding of Central Bank Digital Currencies (CBDCs). The CBDC Partner Program aims to facilitate collaboration with key players in the blockchain technology and payment service sectors. The partners in the inaugural cohort include Ripple, Consensys, Fluency, Idemia, Consult Hyperion, Giesecke+Devrient, and Fireblocks. Jesse [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/mastercard-partners-with-ripple-consensys-to-drive-cbdc-understanding/\">Mastercard Partners with Ripple, Consensys, to Drive CBDC Understanding</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]