[
  {
    "source": "CryptoSlate",
    "date": "2024-01-05T22:00:34.000Z",
    "title": "Ethereum staking exit queue hits record high amid Celsius unlocks",
    "url": "https://cryptoslate.com/ethereum-staking-exit-queue-hits-record-high-amid-celsius-unlocks/",
    "description": "<p>The Ethereum network is witnessing a surge in validator exits, which hit a record high of over 16,000 validators in the exit queue on Jan. 5, on-chain data showed. The rise in exits has caused the wait time for unstaking to spike to an average of 5.6 days. Around 15,140 validators are still in the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ethereum-staking-exit-queue-hits-record-high-amid-celsius-unlocks/\">Ethereum staking exit queue hits record high amid Celsius unlocks</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-05T22:00:49.000Z",
    "title": "New Report Predicts When The XRP Price Will Cross $1.56",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-will-cross-1-56/",
    "description": "A recent crypto report has delved into the XRP price, forecasting the cryptocurrency to surpass the $1 peg in 2024. The report also included predictions for the cryptocurrency’s pricing over the next few decades.  2024 Monthly Prediction Popular cryptocurrency exchange, Changelly published a new XRP price report on January 5, providing a comprehensive forecast of the cryptocurrency for each month in 2024. Before outlining its predictions, the crypto exchange delved into XRP’s past successes and hurdles between 2017 till date. In 2018, when XRP reached its price peak of $3.84, the cryptocurrency was valued as the world’s second most capitalized cryptocurrency after Bitcoin.  Related Reading: Shibarium Transactions Crash Almost 50%, Shiba Inu Price Wobbles XRP experienced a significant decline in the following years but recovered majorly in early 2021 during the bull run. Presently XRP is showing slight recovery after being in a three-year-long legal battle with the United States Securities and Exchange Commission (SEC). This optimistic sentiment and steady growth have contributed to the restoration of the cryptocurrency’s reputation, paving the way for positive price forecasts for XRP.  According to Changelly, the value of XRP is expected to increase by 21.68% to reach $0.714 by January 6. It’s important to note that the price of XRP at the time of writing is trading at $0.577 as reported by CoinMarketCap. Changelly has also forecasted XRP to reach an average price of $0.68 in January 2024. With a maximum and minimum price prediction of $0.79 and $0.58 respectively. In February, XRP is expected to trade at an average value of $0.62. Its maximum and minimum price forecast is reported to reach $0.64 and $0.60 respectively.  From March up until October, Changelly has predicted the value of XRP to range from $0.5 to above $0.6, without crossing the $0.7 price mark.  Lastly, November and December price forecasts depict a bearish trend for XRP. The cryptocurrency is expected to be trading at average prices below $0.52 while the maximum and minimum trading price of XRP in December are projected at $0.54 and $0.37 respectively. Changelly has reported its overall price prediction for XRP in 2024 to be around $0.93 on average. While the minimum and maximum price value of the cryptocurrency are assumed to be $0.90 and $1.10 respectively.  XRP price at $0.56 &#124; Source: XRPUSD On Tradingview.com XRP Price Prediction For 2025 To 2050 In its analysis of XRP, Changelly provided a brief report on the price prediction of XRP from 2025 to 2050. The crypto exchange forecasted the price of XRP to reach an average of $1.33 in 2025 with a maximum and minimum price value of $1.56 and $1.28 respectively.  From 2026 up until 2029, XRP price is predicted to grow from an average of $1.84 to breach the $3 price mark and surpass $5 in 2029. Related Reading: Crypto Analyst Predicts Cardano Price Jump In January – Here’s The Target The year 2030 also shows a strong bullish growth for the price of XRP. According to Changelly from 2030 to 2032 XRP is projected to grow to an average price above $7 to cross the $10 price mark and surge to $17.32 in 2032. The crypto exchange’s XRP price prediction for 2040 is set at an average trading price of $296.93, with a maximum and minimum price value of $341.26 and $272.51 respectively. Lastly, for 2050, the XRP price value is expected to reach a staggering average price of $446.52. The maximum and minimum price projection for that year is set at $493.44 and $428.69 respectively.  Featured image from CrytoRank, chart from Tradingview.com"
  }
]