[
  {
    "source": "CoinDesk",
    "date": "2023-06-30T13:51:58.000Z",
    "title": "Why Tokenized Assets Are Safer During a Banking Crisis",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/30/why-tokenized-assets-are-safer-during-a-banking-crisis/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Recent U.S. bank failures exposed a strange truth: depositing your money on-chain is safer than trusting banks to make good on your holdings, argues Copper’s Fadi Aboualfa."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-30T13:49:07.000Z",
    "title": "Bitcoin Tumbles on Report of SEC Saying Spot BTC ETF Filings Inadequate",
    "url": "https://www.coindesk.com/markets/2023/06/30/bitcoin-tumbles-on-report-of-sec-saying-spot-btc-etf-filings-inadequate/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Spot bitcoin ETF applications from BlackRock and Fidelity, among others, had helped drive bitcoin higher over the past two weeks."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-30T14:03:57.000Z",
    "title": "Bitcoin breaks below $30k as WSJ reports SEC will block spot Bitcoin ETFs again",
    "url": "https://cryptoslate.com/bitcoin-falls-below-30k-as-wsj-suggests-sec-will-block-spot-bitcoin-etfs-again/",
    "description": "<p>Bitcoin&#8217;s value slid below the $30,000 mark as the Securities and Exchange Commission (SEC) signals an impending block on spot Bitcoin exchange-traded funds (ETFs), according to a report by the Wall Street Journal. This development comes amidst a flurry of spot ETF applications by numerous asset managers seeking broader market access to the cryptocurrency. Quick [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-falls-below-30k-as-wsj-suggests-sec-will-block-spot-bitcoin-etfs-again/\">Bitcoin breaks below $30k as WSJ reports SEC will block spot Bitcoin ETFs again</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-30T14:00:17.000Z",
    "title": "Vitalik Buterin shows empathy for rival crypto projects amid increasing US regulatory pressures",
    "url": "https://cryptoslate.com/vitalik-buterin-shows-empathy-for-rival-crypto-projects-amid-increasing-us-regulatory-pressures/",
    "description": "<p>Ethereum (ETH) co-founder Vitalik Buterin expressed his concern over the recent regulatory pressures faced by rival crypto projects, including Solana (SOL), in a June 30 tweet. Buterin pointed out that these projects do not deserve such treatment, adding that this would not be an honorable way for Ethereum to &#8220;win&#8221; if other blockchain networks get [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/vitalik-buterin-shows-empathy-for-rival-crypto-projects-amid-increasing-us-regulatory-pressures/\">Vitalik Buterin shows empathy for rival crypto projects amid increasing US regulatory pressures</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-30T13:45:34.000Z",
    "title": "WebX Conference Welcomes Distinguished Guests: Japan PM, Yuga Labs CEO, Kabosu (Doge), Desdemona (AI Robot)",
    "url": "https://news.bitcoin.com/webx-conference-welcomes-distinguished-guests-japan-pm-yuga-labs-ceo-kabosu-doge-desdemona-ai-robot/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/-2023-06-28-18-46-04-1-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/-2023-06-28-18-46-04-1-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/-2023-06-28-18-46-04-1-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/-2023-06-28-18-46-04-1-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/-2023-06-28-18-46-04-1-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/-2023-06-28-18-46-04-1-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/-2023-06-28-18-46-04-1.png 800w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. WebX, Asia&#8217;s leading Web3 conference (July 25-26), is thrilled to announce the participation of more esteemed guests at this year&#8217;s event: Japan prime minister Fumio Kishida, Yuga Labs CEO Daniel Alegre, the Dogecoin dog Kabosu, and the groundbreaking AI robot Desdemona (Made by Hanson Robotics, sister to Sophia the Robot). WebX is a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T13:41:57.000Z",
    "title": "Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices considering investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand&#8217;s price prediction from 2023 to 2032, its expected minimum price, and what it brings. For ... <a title=\"Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-30T13:58:53.000Z",
    "title": "Disney Stock Forecast Offers 30% Upside According To Avorak AI",
    "url": "https://nulltx.com/disney-stock-forecast-offers-30-upside-according-to-avorak-ai/",
    "description": "As investors consider their next moves in the stock market, Disney has become an intriguing option. Recent market fluctuations and news surrounding the company have sparked questions about the future of Disney stock. Some might wonder why the stock has experienced a downturn and what its current price is. However, according to Avorak AI, there [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-30T13:47:12.000Z",
    "title": "Golteum (GLTM): Navigating Regulatory Challenges for Long-Term Investment Success",
    "url": "https://nulltx.com/golteum-gltm-navigating-regulatory-challenges-for-long-term-investment-success/",
    "description": "In the ever-evolving world of cryptocurrencies, Golteum (GLTM) emerges as a trailblazer in the realm of multi-asset Web3 platforms. As a cutting-edge platform that merges the benefits of various asset classes, Golteum empowers users to trade precious metals and cryptocurrencies seamlessly. With a focus on accessibility, control, and the integration of tokenized NFTs with crypto [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-30T14:00:00.000Z",
    "title": "Binance Survey Says 88% Of Institutional Users Have a Positive Outlook For Crypto Assets",
    "url": "https://www.newsbtc.com/crypto/binance-survey-says-88-of-institutional-users-have-a-positive-outlook-for-crypto-assets/",
    "description": "Institutional investors are paying more attention to cryptocurrencies and digital assets. According to a recent survey report by Binance Research and Binance VIP &#38; Institutional, 88% of institutional users have a long-term, optimistic outlook on crypto for the next decade. The crypto market is known for its high volatility, but the majority of big-money players see crypto as an important part of their portfolio for years to come. Institutional Interest In Crypto Assets Is Growing The Institutional Crypto Outlook Survey, which surveyed 208 Binance VIP and Institutional users from 31st March to 15th May 2023, found out that a growing number of institutional crypto investors are in it for the long haul. According to the survey, 63.5% of these users had a positive outlook on digital assets over the next 12 months, while 88% are more positive over the next decade. Related Reading: Ethereum Continues Uptrend As Staked ETH Soars To New High Of the respondents, 50% expect to increase their crypto asset exposure over the next five years. Only 4.3% said they plan to decrease exposure. That signals a lot of confidence and optimism about the future growth and mainstream adoption of cryptocurrencies. Bitcoin remains Most Popular Crypto Asset Among Institutions Bitcoin remains the most popular choice among institutional investors, with a larger proportion of respondents more positive about Bitcoin as compared to the broader crypto sector. This is not surprising given that Bitcoin is the largest crypto by market cap and the most established. Bitcoin is seen as the &#8220;digital gold&#8221; of the crypto world and a store of value and hedge against inflation. BTC crosses $31,000 as institutional interest grows &#124; Source: BTCUSD on TradingView.com 42.8% of investors are more interested in the potential for large investment returns. However, 37.5% are more motivated by the long-term exposure to the technology behind digital assets, with 48.1% and 43.8% of respondents investing in Layer 1 and Layer 2 technologies respectively. Institutional Trade Still Mostly Done On Centralized Exchanges Centralized exchanges remain the most popular platform for institutional trading. While many crypto investors advocate for decentralized exchanges on the rise, centralized exchanges like Binance offer a one-stop shop for institutional traders to easily buy, sell and convert a wide range of cryptocurrencies. The survey found that 90.5% of institutional investors would rather trade on centralized exchanges. Related Reading: Whales Dive Into XRP, Accumulating $170 Million Worth: What’s Their Game Plan? While some institutional investors remain skeptical about cryptocurrency, it&#8217;s clear that mainstream interest in this asset class is building steadily. If institutional adoption continues to rise, it&#8217;s likely to drive broader mainstream acceptance of cryptocurrencies in financial institutions like banks. Featured image from Unsplash, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T13:55:35.000Z",
    "title": "Stellar (XLM) Shines Bright with 17% Surge – What’s Driving the Altcoin’s Meteoric Rise, and Is Now the Time to Invest?",
    "url": "https://www.crypto-news-flash.com/stellar-xlm-shines-bright-with-17-surge-whats-driving-the-altcoins-meteoric-rise-and-is-now-the-time-to-invest/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-xlm-shines-bright-with-17-surge-whats-driving-the-altcoins-meteoric-rise-and-is-now-the-time-to-invest",
    "description": "Stellar (XLM) remains one of the best-performing altcoins in the market today. Triggers for its growth are diverse but its role as a payment network stands out. It is safe to say that Stellar (XLM) has outdone several other altcoins after a significant price surge a few days ago. Investors and enthusiasts became more confident [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T13:45:26.000Z",
    "title": "Golteum’s (GLTM) Unique Tokenization Draws in Investors as Presale Ramps Up",
    "url": "https://www.crypto-news-flash.com/golteums-gltm-unique-tokenization-draws-in-investors-as-presale-ramps-up/?utm_source=rss&utm_medium=rss&utm_campaign=golteums-gltm-unique-tokenization-draws-in-investors-as-presale-ramps-up",
    "description": "Considering the state of its presale, it seems like Golteum (GLTM) is towing the path of popular decentralized finance (DeFi) tokens Polygon (MATIC) and Cardano (ADA). When crypto enthusiasts first heard about Cardano and the promises it held, millions of investors queued up to purchase the unique token. Investors saw it as the “Ethereum Killer” [...]"
  }
]