[
  {
    "source": "Decrypt",
    "date": "2024-03-23T11:01:02.000Z",
    "title": "This Week in Coins: After Setting a New All-Time High, Bitcoin Struggles to Retake $69K",
    "url": "https://decrypt.co/223046/this-week-in-coins-after-setting-a-new-all-time-high-bitcoin-struggles-to-retake-69k",
    "description": "All major coins and tokens are down this week, and the sell off hasn't been pretty."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-23T10:56:36.000Z",
    "title": "Meme Coin Showdown: SLERF vs. Shiba Inu vs. BEFE Coin – Evaluating Their Potential",
    "url": "https://www.cryptopolitan.com/meme-coin-showdown-slerf-vs-shiba-inu-vs-befe-coin-evaluating-their-potential/",
    "description": "Shiba Inu (SHIB): Shiba Inu is one of the top meme coins, which ranks second in the meme category. It has an active community of supporters, this token exploded over 137% higher in the past year. With a $15.65 billion market cap, Shiba Inu is undeniably a big dog on the scene these days. Shiba [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-23T10:52:49.000Z",
    "title": "Redefining the AI-first paradigm, collective intelligence takes the lead in tech evolution",
    "url": "https://www.cryptopolitan.com/ai-first-paradigm-collective-intelligence/",
    "description": "In a study published in the prestigious journal, *Nature Machine Intelligence*, a consortium of computer experts from Loughborough University, Yale University, and the Massachusetts Institute of Technology (MIT) has unveiled a visionary concept &#8211; Collective AI. Echoing the hive-mind structure of the Borg from Star Trek, Collective AI envisions a network where multiple AI units [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-23T10:51:01.000Z",
    "title": "Decoding the Meme Coin Craze: SLERF, Shiba Inu, and BEFE Coin Compared",
    "url": "https://www.cryptopolitan.com/decoding-the-meme-coin-craze-slerf-shiba-inu-and-befe-coin-compared/",
    "description": "The crypto market is in an uptrend since the Bitcoin halving is approaching. MEME coins like Dogecoin, Shiba Inu, BFEF, and SLERF are making trends. Let&#8217;s see which meme coin can ride this craze and has potential. SLERF: The Faltering Former King SLERF is the Solana-based-meme coin. This Solona canine-themed token rode a speculative wave [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-23T10:45:30.000Z",
    "title": "Shiba Inu, PEPE Coin, or Bitgert Coin: Making the Right Choice",
    "url": "https://www.cryptopolitan.com/shiba-inu-pepe-coin-or-bitgert-coin-making-the-right-choice/",
    "description": "The crypto market has been undergoing correction ever since Bitcoin lost track of its rising trajectory. After touching a formidable target of $73K, Bitcoin has been unable to look up and is trading between $66k and $68k.&#160; The most tantalizing gains have come from memecoins and mid-cap tokens like Bitgert. Solana is the new hub [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-23T10:42:37.000Z",
    "title": "Shiba Inu vs. Pepe Coin vs. Bitgert Coin: Decoding the Cryptocurrency Trifecta",
    "url": "https://www.cryptopolitan.com/shiba-inu-vs-pepe-coin-vs-bitgert-coin-decoding-the-cryptocurrency-trifecta/",
    "description": "The crypto market&#8217;s fortunes started turning in December 2023. The ETF approval added fuel to the fire, and the prices of most cryptocurrencies skyrocketed. The market cap touched $2.77 trillion in a matter of months before the correction.&#160; The market correction saw Bitcoin prices slashed by 10% in a few days. The rest of the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-23T11:07:11.000Z",
    "title": "Decentralized e-commerce platform Pushd draws BTC, ETH fans",
    "url": "https://crypto.news/decentralized-e-commerce-platform-pushd-draws-btc-eth-fans/",
    "description": "Pushd (PUSHD) emerges during a period of market volatility, captivating Bitcoin and Ethereum holders with its decentralized e-commerce platform. Now in its sixth presale stage, Pushd is drawing significant interest. #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-23T11:07:00.000Z",
    "title": "Is the IDF weaponizing blockchain? Are cartels paying ransomware on the dark web? #hearsay | Opinion",
    "url": "https://crypto.news/is-the-idf-weaponizing-blockchain-are-cartels-paying-ransomware-on-the-dark-web-hearsay-opinion/",
    "description": "Welcome to #hearsay, Dorian Batycka’s weekly crypto gossip column. This week’s edition brings you a small dose of dark web cartels, a potential blockchain interface for the Israel Defense Force (IDF), and one NFT collector’s hilarious flex fail. "
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-23T11:05:00.000Z",
    "title": "Tech Giant Google Integrates ENS Wallet Balance in Search Results",
    "url": "https://coinedition.com/tech-giant-google-integrates-ens-wallet-balance-in-search-results/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Google-Integrates-Ethereum-Merge-Countdown-As-Event-Approaches.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ENS Users Can Now View Their Wallet Balances Via Google Search\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Google-Integrates-Ethereum-Merge-Countdown-As-Event-Approaches.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Google-Integrates-Ethereum-Merge-Countdown-As-Event-Approaches-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Google-Integrates-Ethereum-Merge-Countdown-As-Event-Approaches-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Google-Integrates-Ethereum-Merge-Countdown-As-Event-Approaches-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Google-Integrates-Ethereum-Merge-Countdown-As-Event-Approaches-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Google has reportedly added functionality to show Ethereum Name Service (ENS) wallet balances in search results. The addition leverages data from Etherscan, simplifying checking Ethereum wallet balances linked to ENS domains. In a recent post, Brantly Millegan, a crypto personality on X, considered the public face of ENS, expressed excitement after discovering the new feature. [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/tech-giant-google-integrates-ens-wallet-balance-in-search-results/\">Tech Giant Google Integrates ENS Wallet Balance in Search Results</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]