[
  {
    "source": "Decrypt",
    "date": "2023-11-14T00:57:12.000Z",
    "title": "New Nvidia Supercomputing Chips to ‘Fuel the Acceleration’ of AI",
    "url": "https://decrypt.co/205899/new-nvidia-supercomputing-chips-to-fuel-the-acceleration-of-ai",
    "description": "At its Supercomputing 2023 event, Nvidia unveiled upgraded chips and a supercomputer that can accelerate scientific research."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-14T01:00:05.000Z",
    "title": "ETH-BTC Ratio Shifting: Is An Ethereum Mega Rally Incoming?",
    "url": "https://www.newsbtc.com/news/ethereum/eth-btc-ratio-shifting-ethereum-mega-rally/",
    "description": "Ethereum prices are firm at spot rates, still trading above the $2,000 level, and multiple other factors point to possible trend continuation. According to Kaiko&#8217;s data on November 12, not only is the ETH-BTC ratio shifting and reversing after extended periods of lower lows, but also there is a notable uptick in trading volume with funding rates in crypto derivative platforms shifting from negative to positive, suggesting increasing demand. Ethereum Breakout Above $2,000 As of writing on November 13, Ethereum is relatively firm and changing hands at around the $2,090 level. Despite the expected contraction in trading volume over the past couple of days following the rally on November 9, the uptrend remains in place. Related Reading: Chainlink Forms Sell Signal, Analyst Predicts Pullback To This Level So far, the immediate support level technical analysts are watching remain at $2,000, marking July 2023 highs. Conversely, the $2,100 zone, marking the April high, is a critical liquidation level that optimistic bulls must break for a buy trend continuation pattern.  As it is, traders are optimistic. However, whether the uptrend will continue depends primarily on trader sentiment and if existing fundamental factors might spark more demand, lifting ETH to new 2023 highs. Thus far, even though the general ETH support base remains upbeat, the coin, unlike Bitcoin (BTC), is struggling to break key resistance levels recorded in H1 2023, which is a concern. ETHBTC Turning Bullish As Funding Rate Flips Positive On the positive side, looking at the ETHBTC candlestick arrangement in the daily chart, the sharp reversal of ETH fortunes on November 9 could anchor the next leg up, signaling a new shift in a trend that favors Ethereum buyers. Looking at the ETHBTC formation, Bitcoin bulls have had the upper hand in 2023. Related Reading: XRP Price Path To $1: Exploring Two Potential Outcomes From The $0.66 Resistance Level To quantify, BTC is up 33% versus ETH, with the climactic sell-off of October 23 pushing BTC to the highest point against the second most valuable coin in 2023. However, the sharp recovery on November 9 and the subsequent failure of BTC bulls to reverse losses suggest that ETH has the upper hand. Thus far, ETHBTC prices are trending inside the November 9 bullish engulfing bar at the back of light trading volumes, a net positive for bullish ETH holders. Following this surge, Kaiko notes that the funding rate of the ETHUSDT pair is positive, signaling increasing demand in the crypto derivatives scene. When funding rates turn positive from negative, it means &#8220;long&#8221; traders are paying &#8220;short&#8221; traders to keep their positions open. This development indicates that more traders are long ETH, expecting prices to rise in the sessions ahead. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-14T01:00:20.000Z",
    "title": "Much Higher Prices Are in Store for Sushi and Apecoin, Says Top Trader – Here Are His Targets",
    "url": "https://dailyhodl.com/2023/11/13/much-higher-prices-are-in-store-for-sushi-and-apecoin-says-top-trader-here-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/Altcoin-Explodes-44-in.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/Altcoin-Explodes-44-in.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/Altcoin-Explodes-44-in.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/Altcoin-Explodes-44-in.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/Altcoin-Explodes-44-in.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/Altcoin-Explodes-44-in.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/Altcoin-Explodes-44-in.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto strategist says more rallies are up ahead for prominent decentralized exchange (DEX) Sushi (SUSHI) and Apecoin APE, the digital asset associated with the Bored Ape Yacht Club non-fungible token (NFT) collection. Pseudonymous analyst The Flow Horse tells his 185,400 followers on the social media platform X that SUSHI looks bullish after recovering the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/13/much-higher-prices-are-in-store-for-sushi-and-apecoin-says-top-trader-here-are-his-targets/\">Much Higher Prices Are in Store for Sushi and Apecoin, Says Top Trader – Here Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]