[
  {
    "source": "CryptoSlate",
    "date": "2023-09-20T02:00:40.000Z",
    "title": "Grayscale applies for new Ethereum futures ETF",
    "url": "https://cryptoslate.com/grayscale-applies-for-new-ethereum-futures-etf/",
    "description": "<p>Grayscale has submitted a filing for a new Ethereum futures exchange-traded fund (ETF), the Wall Street Journal said on Sept. 19. According to that report, Grayscale submitted its filing under the Securities Act of 1933. The filing is distinct from Grayscale&#8217;s previous attempts at an Ethereum futures ETF, which it submitted under the Investment Company [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/grayscale-applies-for-new-ethereum-futures-etf/\">Grayscale applies for new Ethereum futures ETF</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-20T02:00:00.000Z",
    "title": "$500 Billion Investment Banking Titan Nomura Launches Bitcoin Adoption Fund for Institutional Investors",
    "url": "https://www.cryptoglobe.com/latest/2023/09/500-billion-investment-banking-titan-nomura-launches-bitcoin-adoption-fund-for-institutional-investors/",
    "description": "Japan’s largest investment bank Nomura, with a portfolio of over $500 billion in assets under management, has marked another strategic move into the digital asset market through its digital subsidiary Laser Digital Asset Management, which announced the launch of a Bitcoin Adoption Fund for institutional investors. The Bitcoin-based fund is set to be the first […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-20T02:00:09.000Z",
    "title": "Wyckoff Support Holds Strong: Bitcoin Bulls Eyeing $31,000 In Near-Term Rally",
    "url": "https://www.newsbtc.com/bitcoin-news/wyckoff-support-holds-strong-bitcoin-bulls-eyeing-31000-in-near-term-rally/",
    "description": "Bitcoin (BTC), the dominant cryptocurrency, is experiencing a resurgence as recent developments in technical indicators and on-chain fundamentals instill renewed optimism among investors.  Capriole Invest, a prominent investment firm, has unveiled its Bitcoin Macro Index. This comprehensive machine learning model combines 40 influential on-chain, macro market, and equity metrics, providing valuable insights into Bitcoin&#8217;s fundamentals and shedding light on its potential future trajectory. Bitcoin Fundamentals Signal Renewed Optimism According to Capriole’s latest report, Bitcoin&#8217;s low timeframe technicals have continued to conform to the Wyckoff schematic over the past weeks, with a significant failed breakdown at the $26,000 level, signaling a locally bullish sentiment. This event has further bolstered the credibility of the structure.  Related Reading: Shiba Inu Team Member Reveals What Investors Should Do If They Want SHIB Burns After a two-month decline that contributed to Bitcoin&#8217;s price drop from $29,000, there are now encouraging signs of progress in the cryptocurrency&#8217;s fundamentals. This suggests a potential turning point in the market.  Per the report, analysts are now closely monitoring a potential break from support, particularly a close above $28,000, as this would confirm a continuation towards at least $31,000.  Reaching this milestone would mark a crucial phase in completing the Wyckoff structure, potentially heralding the next major upward move for Bitcoin. Furthermore, while the opportunity to purchase Bitcoin in the $24,000 zone appears less likely, the failed breakdown and solid improvement in fundamental data present a more bullish outlook.  Barring significant changes in data, Capriole Invest expects Bitcoin&#8217;s price to continue its upward trajectory, with a target of at least $31,000 in the near term. However, Capriole believes that BTC’s trajectory will be influenced by the support level at $26,000 and the performance of the Macro Index&#8217;s fundamentals.  Persistent Resistance At $27,500 Amidst Market Suppression Bitcoin&#8217;s recent price movements have been met with strong resistance as it approaches the $27,500 mark, with market sell orders flooding the order book and impeding further upward momentum.  Material Indicators, a leading firm specializing in market analysis, has identified this trend as a deliberate effort to suppress BTC’s price. This behavior is expected to persist, particularly in light of the upcoming interest rate hike announcement by Federal Reserve Chairman Jerome Powell on Wednesday. Per the firm’s analysis, over the past eight hours, a significant influx of ask liquidity has emerged every time Bitcoin&#8217;s price has neared the $27,500 level. This surge in sell orders has effectively thwarted any potential breakthrough at this key resistance level.  Related Reading: Terra Validator Opposes USTC Burning, Pushes Alternative Plan To Regain Dollar Peg This suggests that Bitcoin&#8217;s price may face significant hurdles soon. The actions of market participants indicate a deliberate intention to keep the price in check, at least until the outcome of the interest rate decision is known.  At the time of writing, the leading cryptocurrency in the market is trading at $27,100, reflecting a 1.6% increase over the past 24 hours.  Featured image from iStock, chart from TradingView.com "
  }
]