[
  {
    "source": "CoinDesk",
    "date": "2024-01-26T19:54:02.000Z",
    "title": "Why Is Everyone Suddenly Bearish About Bitcoin?",
    "url": "https://www.coindesk.com/consensus-magazine/2024/01/26/why-is-everyone-suddenly-bearish-about-bitcoin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The cryptocurrency has dipped following the most bullish recent event in crypto history, the launch of spot bitcoin ETFs, apparently causing a crisis in faith."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-26T19:46:02.000Z",
    "title": "‘Razzlekhan’: Amazon Is Turning $4 Billion Bitfinex Bitcoin Heist Into Feature Film",
    "url": "https://decrypt.co/214436/razzlekhan-amazon-bitfinex-bitcoin-heist-movie",
    "description": "The film, directed by Hannah Marks, follows the life of the rapper-turned-crypto-thief and her husband, who pled guilty to the Bitcoin heist."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-26T19:40:00.000Z",
    "title": " BNB bull flag and blockchain DApp activity hint at price recovery  ",
    "url": "https://cointelegraph.com/news/bnb-bull-flag-and-blockchain-dapp-activity-hint-at-price-recovery",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNjE4YTIyMzktNWM4NC00ZDI0LTlkMjQtNTU4YTk2ZWRiY2I3LkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>BNB eyes new year-to-date highs as BNB Chain DApp activity increases and a new Binance incentive program launches.</p>\n                    <p><p>Binance Coin (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>), the native token of BNB Chain, began a recovery on Jan. 26, rising by 3% to reclaim the $300 level and although BNB remains weak, the ongoing recovery is backed by increasing network activity.</p><p>A significant portion of <a href=\"https://cointelegraph.com/learn/what-is-binance-coin-bnb-and-how-does-it-work\">BNB</a> token's value comes from reduced trading fees and exclusive launchpad offers and services from <a href=\"https://cointelegraph.com/news/binance-growth-led-to-compliance-failures-ceo-richard-teng\">Binance</a>.</p><p>A recently launched ‘dual investment’ product from Binance could add to BNB’s volumes, which have exceeded $998 million over the last 24 hours.</p><p><a href=\"https://cointelegraph.com/news/bnb-bull-flag-and-blockchain-dapp-activity-hint-at-price-recovery\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-26T19:40:00.000Z",
    "title": " Hacker mocks Algorand after maintaining control of CEO’s X account for 15 hours ",
    "url": "https://cointelegraph.com/news/hackers-algorand-ceo-twitter-account",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZWM2ZjMwY2YtOTNjNy00YzY3LWE5OTUtNWViMzM3NWRjMjM3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Algorand Foundation said on Jan. 25 that it was “in the process” of recovering Staci Warden’s account, but posts containing racial slurs and other insults continue to appear.</p>\n                    <p><p>An unknown party is still posting on the X (formerly Twitter) account of Algorand Foundation CEO Staci Warden after almost a day, mocking followers and the platform alike.</p><p>As of 6:28 pm UTC on Jan. 26, the unnamed hacker has continued to be active on X, roughly 15 hours after Algorand <a href=\"https://cointelegraph.com/news/algorand-ceo-social-media-x-hacked-warning\">posted that it was</a> “in the process” of recovering Warden’s account. The individual has used their time on the platform to post messages containing racial slurs and insults about Warden, both while posting and replying to X users. </p><p>Many of the hacker’s activities using the compromised account attacked Warden personally — by changing her profile to claim she “drained 6 figures from my customers and gaslit them into thinking it was a hack” and worked as a “semi professional pole dancer.” However, many X users <a href=\"https://twitter.com/buxdabomb/status/1750820885265842382\" target=\"_blank\" rel=\"noopener nofollow\">seemed</a> to be amused by the disruption, claiming to prefer the hacker’s posts over Warden’s:</p><p><a href=\"https://cointelegraph.com/news/hackers-algorand-ceo-twitter-account\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-26T20:00:59.000Z",
    "title": "Trezor Issues Urgent Alert on New Phishing Scam",
    "url": "https://news.bitcoin.com/trezor-issues-urgent-alert-on-new-phishing-scam/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/trezor_phishing_email-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Trezor Alerts Users to Phishing Danger Amidst Ongoing Security Challenges\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/trezor_phishing_email-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/trezor_phishing_email-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/trezor_phishing_email-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/trezor_phishing_email-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/trezor_phishing_email-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/trezor_phishing_email-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/trezor_phishing_email.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Trezor has confirmed a series of deceptive phishing emails targeting its users, coming just days after a security breach at their support portal. The company has issued an urgent security alert, advising users to be extra cautious. Trezor Alerts Users to Phishing Danger Amidst Ongoing Security Challenges Hardware wallet provider Trezor has issued an urgent [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T20:08:18.000Z",
    "title": "Estonia approves extradition of HashFlare ponzi scheme founders to the U.S.",
    "url": "https://www.cryptopolitan.com/estonia-extradition-hashflare-founders-u-s/",
    "description": "Estonia has given the green light for the extradition of Ivan Turogin and Sergei Potapenko, the individuals behind the $575 million cryptocurrency Ponzi scheme known as HashFlare, to the United States. This decision comes despite a prior block by the Tallinn court, which criticized the Estonian government for insufficiently investigating key circumstances related to the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T20:01:31.000Z",
    "title": "Spot Bitcoin ETFs fuel the rise of a new derivatives market",
    "url": "https://www.cryptopolitan.com/bitcoin-etfs-fuel-rise-of-derivatives-market/",
    "description": "The financial arena is witnessing a seismic shift with the advent of the first derivative-based strategies that leverage the burgeoning market of US-listed Bitcoin ETFs. It&#8217;s like watching a high-stakes poker game where the players have just been dealt a new hand, courtesy of Roundhill Investments&#8217; Bitcoin Covered Call ETF (YBTC). This clever financial instrument [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T20:00:00.000Z",
    "title": "Experts Indicate Two Cryptocurrencies Below $1 Poised to Reach $10 by 2024",
    "url": "https://www.cryptopolitan.com/experts-indicate-two-cryptocurrencies-below-1-poised-to-reach-10-by-2024/",
    "description": "The crypto market is filled with coins trying to solve real-world problems and provide value to users. While most fail, a few stand out as potential winners. According to experts, two cryptocurrencies under $1 that are poised to reach $10 by 2024 are Pandoshi (PAMBO) and Cardano (ADA). Both projects have strong fundamentals and growing [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T19:51:56.000Z",
    "title": "Identifying the Achilles’ Heel of Spot Bitcoin ETF",
    "url": "https://www.cryptopolitan.com/the-achilles-heel-of-spot-bitcoin-etf/",
    "description": "The recent bloom of Bitcoin ETFs on the grand stage of US stock markets is like watching a new star-studded series unfold – you know there&#8217;s drama, you just don&#8217;t know which episode will bring the cliffhanger. Barely a fortnight into their existence, these shiny new financial instruments are drawing eyeballs for reasons both flashy [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T19:42:54.000Z",
    "title": "Federal Reserve plays a trick before rate cut decision",
    "url": "https://www.cryptopolitan.com/federal-reserve-plays-trick-before-rate-cut/",
    "description": "The wizards at the Federal Reserve are keeping everyone on their toes with their latest monetary policy maneuvers, and it&#8217;s not just a simple sleight of hand. While the masses were expecting a straightforward narrative of interest rate cuts, the Fed decided to throw a curveball. With the U.S. economy showing resilience, particularly in consumer [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T19:39:59.000Z",
    "title": "OKX discontinues crypto mining pool services",
    "url": "https://www.cryptopolitan.com/okx-discontinues-crypto-mining-pool-services/",
    "description": "In a recent statement released on January 26, 2024, the cryptocurrency exchange OKX made a significant announcement regarding its mining pool services. The platform has revealed its decision to discontinue these services due to what it has referred to as &#8220;business adjustments.&#8221; This move marks the end of an era for many users who have [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-26T20:00:21.000Z",
    "title": "Analyst Predicts Bitcoin to Hit $250,000 Before Halving",
    "url": "https://www.newsbtc.com/bitcoin-news/analyst-bitcoin-250000-before-halving/",
    "description": "In a post shared on X on January 26, crypto analyst BitQuant forecasts that Bitcoin (BTC) will recover from the current downtrend and surge past its all-time high of $69,000 to over $250,000 before the upcoming Bitcoin halving in April. Bitcoin To $250,000 Before Halving? From the chart shared, BitQuant notes that Bitcoin is still trending inside a rising channel. Out of the multi-year uptrend that the coin is in, this channel&#8217;s next &#8220;touch&#8221; is projected to be at around $250,000. For now, if the trend line guides, Bitcoin has immediate resistance at about $80,000. This level should be the next key target for bulls to retest. According to BitQuant, it is likely that Bitcoin will float above this line to $250,000 by April before the network automatically halves block mining rewards. Extrapolating from the analyst&#8217;s preview, the Bitcoin uptrend remains valid until the upper limit defined by the rising trend line is &#8220;touched.&#8221; Even so, when this level will be breached is not specified. Related Reading: Is Chainlink (LINK) Ready To Soar? Key Indicators To Monitor Once this line is tested, placing the coin at over $250,000, it will likely follow its historical pattern by cooling off. The depth of this retracement is not also defined but is expected to be deep since BitQuant said the coin will &#8220;die.&#8221; BitQuant explained that this &#8220;dying&#8221; period refers to Bitcoin&#8217;s price going below its previous all-time high. The retracement will be expected. This is common after halving since supply tends to increase as demand for the coin softens. Despite this temporary setback, BitQuant remains confident that BTC will regain momentum and continue its long-term upward trend. Spot Bitcoin ETF Issuers Buying, BTC Stabilizes Above $39,500 Though the analyst remains bullish, it is unclear how prices will pan out for now. The United States Securities and Exchange Commission (SEC) recently approved multiple spots for Bitcoin exchange-traded funds (ETFs). Though issuers have been ramping up purchases, Grayscale Investments have liquidated their Grayscale Bitcoin Trust (GBTC), selling shares and dumping coins via exchanges. Related Reading: Report Shows Polygon Users Rivaled Ethereum In 2023, But Why Has Price Failed To Clear $1? Recent data from Lookonchain reveals that GBTC reduced 10,872 BTC worth over $447 million on January 25. Meanwhile, eight spot Bitcoin ETF issuers added 8,744 BTC, with BlackRock adding 4,284 BTC. On January 24, GBTC reduced 13,179 BTC with Fidelity Investments, another spot Bitcoin ETF issuer, buying 4,023 BTC. With BTC finding demand, prices have started stabilizing, looking at the development in the daily chart. The coin is steady above $39,500, rejecting the intense selling pressure of January 22. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-26T19:45:53.000Z",
    "title": "Crypto Trader Michaël van de Poppe Predicts Top Ethereum Rival Will Surge by Over 160%, Updates Outlook on Bitcoin",
    "url": "https://dailyhodl.com/2024/01/26/crypto-trader-michael-van-de-poppe-predicts-top-ethereum-rival-to-surge-by-over-160-updates-outlook-on-bitcoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/rival-on-bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/rival-on-bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/rival-on-bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/rival-on-bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/rival-on-bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/rival-on-bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/rival-on-bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The widely followed cryptocurrency analyst and trader Michaël van de Poppe believes that one of the major competitors of Ethereum (ETH) could more than double its price from the current level. Van de Poppe tells his 685,900 followers on the social media platform X that a correction in the crypto market has presented many opportunities, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/26/crypto-trader-michael-van-de-poppe-predicts-top-ethereum-rival-to-surge-by-over-160-updates-outlook-on-bitcoin/\">Crypto Trader Michaël van de Poppe Predicts Top Ethereum Rival Will Surge by Over 160%, Updates Outlook on Bitcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-26T19:41:12.000Z",
    "title": "Bitcoin Whale Abruptly Moves Over $280,000,000 in BTC – Here’s Where the Crypto’s Headed",
    "url": "https://dailyhodl.com/2024/01/26/bitcoin-whale-abruptly-moves-over-280000000-in-btc-heres-where-the-cryptos-headed/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/07/btc-whales-react.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/07/btc-whales-react.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/07/btc-whales-react.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/07/btc-whales-react.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/07/btc-whales-react.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/07/btc-whales-react.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/07/btc-whales-react.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New data reveals that a Bitcoin (BTC) whale is suddenly shifting around billions of dollars worth of the top crypto asset by market cap to and from wallets and crypto exchange platforms. According to whale-surveying platform Whale Alert, the deep-pocketed BTC investor shifted 7,000 BTC, worth just over $280 million, on the night of January [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/26/bitcoin-whale-abruptly-moves-over-280000000-in-btc-heres-where-the-cryptos-headed/\">Bitcoin Whale Abruptly Moves Over $280,000,000 in BTC – Here’s Where the Crypto’s Headed</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]