[
  {
    "source": "CoinDesk",
    "date": "2023-12-20T14:54:10.000Z",
    "title": "Stacks' STX Soars 27% on Positive Comments From Tim Draper",
    "url": "https://www.coindesk.com/business/2023/12/20/stacks-stx-soars-27-on-positive-comments-from-tim-draper/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Stacks [STX], the native token of Stacks Network, rose by 25% on Wednesday on the back of praise from legendary investor Tim Draper."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-20T15:02:40.000Z",
    "title": " Cardano Foundation teams up with Brazil’s oil giant Petrobras for blockchain education ",
    "url": "https://cointelegraph.com/news/cardano-foundation-teams-up-brazil-oil-giant-petrobras-blockchain-education",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMjI3YmY5YWUtODdlZS00YzkyLTg5NDEtNWM2NmRkYjQ5NjQ5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Cardano Foundation is partnering with Petrobras, the largest corporation in Brazil, to offer blockchain education and explore use cases in the energy sector.</p>\n                    <p><p>The Cardano Foundation is joining forces with Brazil's state-owned oil company Petrobras to provide blockchain education and explore technology use cases in the energy sector.</p><p>According to an announcement on Dec. 20, the foundation will lead blockchain education workshops for Petrobras' 45,000 employees, with Cardano Academy content available via the Petrobras University. Founded in 1953, Petrobras is the largest corporation in Brazil and South America, with revenues of $124.7 billion in 2022.</p><p>The program’s scope will cover diverse blockchain applications and use cases, as well as interactive quizzes. To mark the launch of the program, the Cardano Foundation conducted two workshops in the Metaverse, looking at blockchain regulations in Brazil and around the world. </p><p><a href=\"https://cointelegraph.com/news/cardano-foundation-teams-up-brazil-oil-giant-petrobras-blockchain-education\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-20T15:05:49.000Z",
    "title": "Bitcoin briefly surges past $44,000, $50 million liquidated in an hour",
    "url": "https://cryptoslate.com/insights/bitcoin-briefly-surges-past-44000-50-million-liquidated-in-an-hour/",
    "description": "<p>Quick Take Bitcoin broke past the $44,000 barrier for the first time since Dec. 10, hitting a high of $44,164 on Bitstamp before falling back below $44,000. This price increase led to significant market activity. According to Coinglass, there were about $160 million in liquidations across the digital asset market in the past 24 hours. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-briefly-surges-past-44000-50-million-liquidated-in-an-hour/\">Bitcoin briefly surges past $44,000, $50 million liquidated in an hour</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-20T14:45:36.000Z",
    "title": "Celsius sold off $250 million in ETH and other assets in 30 days",
    "url": "https://cryptoslate.com/celsius-sold-off-250-million-in-eth-and-other-assets-in-30-days/",
    "description": "<p>Bankrupt cryptocurrency lender Celsius has sold off $250 million worth of digital assets, including Ethereum, in the last 30 days, according to on-chain data. Crypto sleuth Apes_Prologue reported that Ether accounted for $243 million, or 97%, of the bankrupt firm&#8217;s selling activities during the period. Separately, blockchain analytical firm Peckshield confirmed that the defunct lender transferred [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/celsius-sold-off-250-million-in-eth-and-other-assets-in-30-days/\">Celsius sold off $250 million in ETH and other assets in 30 days</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-20T15:05:29.000Z",
    "title": "The Next Cryptocurrencies To Explode In 2024",
    "url": "https://cryptodaily.co.uk/2023/12/the-next-cryptocurrencies-to-explode-in-2024",
    "description": "Discover the most promising cryptocurrencies set to soar in 2024. This insightful guide highlights emerging digital currencies with high potential for explosive growth, offering valuable insights into their technology, market trends, investment strategies, and future prospects. Ideal for investors seeking the next big opportunity in the dynamic world of cryptocurrency."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T15:04:37.000Z",
    "title": "Shiba Inu team partners with D3 to apply for the “.shib” domain",
    "url": "https://www.cryptopolitan.com/shiba-inu-team-partners-with-d3-to-apply/",
    "description": "In a recent development, the team behind the popular dog-themed memecoin, Shiba Inu (SHIB), has made a significant move in cryptocurrency and internet domain names. They have applied for a &#8220;.shib&#8221; top-level domain (TLD) with internet domain firm D3.&#160; This move could open new avenues for SHIB holders and enhance the interoperability between Web2 and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T14:58:20.000Z",
    "title": "Controversial anti-crypto bill allegedly assisted by big banks",
    "url": "https://www.cryptopolitan.com/controversial-anti-crypto-bill-allegedly/",
    "description": "In a surprising revelation, United States Senators Roger Marshall and Elizabeth Warren have reportedly sought assistance from major banks in crafting their contentious anti-crypto bill, the Digital Asset Anti-Money Laundering Act.&#160; The bill, introduced in December 2022, aims to subject various crypto technologies, including noncustodial wallets, validators, and mining pools, to stringent banking regulations within [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T14:54:11.000Z",
    "title": "GameFi projects to watch out for in Q1 2024",
    "url": "https://www.cryptopolitan.com/top-gamefi-projects-set-to-dominate-in-2024/",
    "description": "As the GameFi universe continues to expand, it&#8217;s time to focus on the trailblazers poised to dominate in the first quarter 2024. The digital landscape is changing rapidly, and these three GameFi projects are at the forefront of this evolution, promising not only immersive gaming experiences but also lucrative opportunities for gamers and investors alike. [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-20T14:51:00.000Z",
    "title": "Bybit expands proof-of-reserves audit",
    "url": "https://crypto.news/bybit-expands-proof-of-reserves-audit/",
    "description": "Cryptocurrency exchange Bybit has expanded its proof-of-reserves audit to now cover 32 different cryptocurrencies"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-20T15:00:33.000Z",
    "title": "Dogecoin Price In Trouble: Whale Transfers 85 Million DOGE To Robinhood",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-price-85-million-doge/",
    "description": "The Dogecoin price has been put in a perilous position once more after a DOGE whale made a massive transaction to an exchange. The transaction which was flagged by a DOGE community member has raised eyebrows in the space and could possibly be putting sell pressure on the altcoin. Dogecoin Whale Transfers Full Balance To Robinhood On Tuesday, a single transaction carrying over $7 million worth of DOGE was noticed by a Dogecoin community member who posted the transaction on X (formerly Twitter). This transaction caught the attention of the community because it was carrying a little over 85 million DOGE. At the time of the transaction, this tranche of coins was worth approximately $7.57 million, making it a large whale transaction. The destination of the transaction was even more concerning given that the coins were being sent to the Robinhood platform. Now, the reason that this transaction is important is the fact that crypto holders will usually send their coins to centralized exchanges such as Robinhood to sell their coins. This is because they can take advantage of the cheap fees, as well as the deep liquidity provided by these platforms, to enable them to sell such large transactions with ease. Furthermore, the X user noted an interesting thing about the sender’s address after the transaction. The whale no longer holds any Dogecoin on their account balance, which means they have sent all their coins to the exchange. This could signal that the whale is looking to completely exit their position as Dogecoin fails to launch. DOGE price at $0.09 &#124; Source: DOGEUSD on Tradingview.com What Happens To DOGE Price? The DOGE price could be seeing some negative headwinds ahead especially if this whale is really selling their coins. With sell pressure already pushing down the price, selling such a large amount of Dogecoin would no doubt trigger a further decline. This sell pressure is already evident in the meme coin’s price which has fallen drastically over the past week. In the last day alone, DOGE’s price is down 3.28%, deviating from the Bitcoin trend that has seen the pioneer cryptocurrency recover from yesterday’s lows. Related Reading: Crypto Analyst Predicts XRP 1,500% Move Against Bitcoin, What Are The Terms? However, there could be a change in this sell pressure soon as bids for the meme coin start to ramp up. According to data from IntoTheBlock, bids are starting to overtake asks again, meaning that buyers are coming back to the market. If this continues, then Dogecoin could look to reclaim $0.1 once again. At the time of writing, Dogecoin is trading at $0.08994, with a 2.37% decline on the weekly chart. Its market cap is sitting at $12.79 billion, making it the 10th-largest cryptocurrency in the space behind Avalanche (AVAX). Featured image from 36Crypto, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-20T15:05:00.000Z",
    "title": "XRP to Defy Imminent Sell-Offs and Hit $1? Here Are the Prospects",
    "url": "https://coinedition.com/xrp-to-defy-imminent-sell-offs-and-hit-1-here-are-the-prospects/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/xRP-1-Day-Chart-says-we-had-the-RSI-top.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/xRP-1-Day-Chart-says-we-had-the-RSI-top.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/xRP-1-Day-Chart-says-we-had-the-RSI-top-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/xRP-1-Day-Chart-says-we-had-the-RSI-top-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/xRP-1-Day-Chart-says-we-had-the-RSI-top-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/xRP-1-Day-Chart-says-we-had-the-RSI-top-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/xRP-1-Day-Chart-says-we-had-the-RSI-top-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Ripple (XRP) tokens worth $13.32 million have been transferred from an unknown wallet to the Bitstamp exchange, Whale Alert posted on X. The transaction which occurred on December 20 came at a time when XRP was trading at $0.61. However, the transaction was only one of many large transfers involving XRP. On December 18, a [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/xrp-to-defy-imminent-sell-offs-and-hit-1-here-are-the-prospects/\">XRP to Defy Imminent Sell-Offs and Hit $1? Here Are the Prospects</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-12-20T15:00:00.000Z",
    "title": "First Tokenised Bond Raises More Than $5M USDt on Bitfinex Securities ",
    "url": "https://blog.bitfinex.com/media-releases/first-tokenised-bond-raises-more-than-5m-usdt-on-bitfinex-securities/",
    "description": "<p>ASTANA, Kazakhstan, December 20, 2023 &#8211; Bitfinex Securities Ltd, (https://www.bitfinex.com/securities/), which offers listing and trading services for security tokens, is pleased to announce the successful raise of $5,200,100 USDt in one of the world’s first tokenised bond issuances. The raise by ALTERNATIVE, a Luxembourg-based securitization...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/media-releases/first-tokenised-bond-raises-more-than-5m-usdt-on-bitfinex-securities/\">First Tokenised Bond Raises More Than $5M USDt on Bitfinex Securities </a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-12-20T14:40:05.000Z",
    "title": "Bitfinex Pay – Release V0.5.3",
    "url": "https://blog.bitfinex.com/bitfinex-pay/bitfinex-pay-release-v0-5-3/",
    "description": "<p>The Bitfinex Pay Merchant Dashboard is an internal tool designed to provide our Merchants with powerful reports and features to manage their Merchant crypto gateway. We’re pleased to share the latest updates to Bitfinex Pay. For more on Bitfinex Pay, please refer to https://blog.bitfinex.com/category/bitfinex-pay/. Merchant...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/bitfinex-pay/bitfinex-pay-release-v0-5-3/\">Bitfinex Pay &#8211; Release V0.5.3</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]