[
  {
    "source": "Decrypt",
    "date": "2023-07-03T21:55:33.000Z",
    "title": "Belarus Working to Ban P2P Crypto Transactions to Fight Fraud",
    "url": "https://decrypt.co/147217/belarus-crypto-ban-p2p-transactions-fraud",
    "description": "The country will still allow people to buy and sell crypto through registered exchanges."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-03T21:54:00.000Z",
    "title": "My Pet Hooligan Could Rival Fortnite With Its Vibrant Battle Royale Combat",
    "url": "https://decrypt.co/147206/my-pet-hooligan-could-rival-fortnite-vibrant-battle-royale-combat",
    "description": "PREVIEW: Currently in alpha, My Pet Hooligan offers cheeky lore, fun guns, great movement, and bunnies in their underpants."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-03T21:51:00.000Z",
    "title": "Behind the Scenes with AMGI Studios and My Pet Hooligan",
    "url": "https://decrypt.co/videos/live-events/eQ71oapI/behind-the-scenes-with-amgi-studios-and-my-pet-hooligan",
    "description": "Decrypt's Kate Irwin goes to Burbank, California for a behind-the-scenes tour of AMGI Studios, the developers of upcoming game My Pet Hooligan."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-03T21:56:51.000Z",
    "title": "After years of relative obscurity, Litecoin is finally having a moment in the sun",
    "url": "https://cryptoslate.com/after-years-or-relative-obscurity-litecoin-is-finally-having-a-moment-in-the-sun/",
    "description": "<p>Litecoin, one of the oldest digital assets in the industry, has recently seen a significant resurgence. After a period of relative obscurity, the &#8220;digital silver&#8221; to Bitcoin&#8217;s digital gold suddenly surged into the limelight. Litecoin&#8217;s price has risen by 183% since last year&#8217;s June lows, with a 60% increase in just the last two weeks. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/after-years-or-relative-obscurity-litecoin-is-finally-having-a-moment-in-the-sun/\">After years of relative obscurity, Litecoin is finally having a moment in the sun</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-03T22:00:09.000Z",
    "title": "Nasdaq Resubmits Blackrock Spot Bitcoin ETF Application, Inks Agreement With Coinbase for Surveillance-Sharing",
    "url": "https://news.bitcoin.com/nasdaq-resubmits-blackrock-spot-bitcoin-etf-application-inks-agreement-with-coinbase-for-surveillance-sharing/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/br5689-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/br5689-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/br5689-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/br5689-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/br5689-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/br5689-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/br5689-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/br5689.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />After the four firms that filed for spot bitcoin exchange-traded funds (ETFs) resubmitted their applications with the U.S. Securities and Exchange Commission (SEC), the asset manager Blackrock followed suit with an amended application. Similar to Cboe&#x2019;s refiling of registrations from Fidelity, Vaneck, Invesco, and Wisdomtree, Nasdaq amended the Blackrock spot bitcoin ETF filing, by incorporating [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T21:45:18.000Z",
    "title": "Experts Propose AI as a Vital Tool for Safeguarding Critical Networks",
    "url": "https://www.cryptopolitan.com/ai-as-a-vital-tool-for-safeguarding-networks/",
    "description": "International experts in the field of artificial intelligence (AI) have put forth a groundbreaking proposition to employ AI in protecting critical infrastructure, including power grids, water systems, and communication networks. A team of researchers from Flinders University in collaboration with Brazilian experts, has developed an innovative algorithm that enables early identification of software virus attacks, ... <a title=\"Experts Propose AI as a Vital Tool for Safeguarding Critical Networks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-as-a-vital-tool-for-safeguarding-networks/\" aria-label=\"More on Experts Propose AI as a Vital Tool for Safeguarding Critical Networks\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-03T22:00:15.000Z",
    "title": "Crypto Market Cap Poised For Breakout: Analyst Predict 23% Upside Potential",
    "url": "https://www.newsbtc.com/news/crypto-market-cap-poised-for-breakout-analyst-predict-23-upside-potential/",
    "description": "The crypto market has been on a rollercoaster this year, with prices fluctuating wildly and regulatory pressures causing significant drops. However, recent developments have given investors renewed confidence in the market, leading to a total crypto market cap recovery. On June 15th, the total crypto market cap hit a low point of $972 billion, following the Securities and Exchange Commission’s (SEC) regulatory pressure on the industry. But since then, the market has rebounded. This recovery has been driven partly by the entrance of major financial players into the crypto space. Several applications for a Bitcoin Spot Exchange-Traded Fund (ETF) by major financial players such as Blackrock and Fidelity have been filed, indicating that they are interested in betting on cryptocurrencies.  This has helped to rebuild investor confidence in the market, leading to increased investments and a rise in the total crypto market cap. Crypto Market Cap&#8217;s Moment Of Truth Cryptocurrency investors are closely monitoring the total crypto market cap as it attempts to break through a significant resistance level. According to crypto analyst Rekt Capital, if the market can successfully breach this level, it could pave the way for continued upward momentum and potentially significant gains for the overall market. At the time of writing, the total crypto market cap is around $1.17 trillion, with Bitcoin making up the lion&#8217;s share of this value. However, the market has been trading in a relatively tight range over the past few weeks, with many investors looking for a catalyst to drive prices higher. Rekt Capital believes that a breakout above the current resistance level could be just the catalyst that the market needs to see a sustained uptrend. Rekt Capital suggests that the market could see gains of between 10% and 23% over time if this breakout occurs. As depicted in the chart, the immediate resistance levels for the global market cap of the cryptocurrency industry are currently at $1.18 and $1.25. The latter represents the highest level achieved in 2023. Related Reading: Historical Litecoin Bearish Signal Goes Off, Correction Incoming? However, certain conditions must be met for the market to break through these levels. Firstly, there needs to be an improvement in current market conditions, including a relaxation of crypto regulations by regulators globally, particularly in the US. Additionally, there needs to be a resolution of the ongoing Bitcoin Spot ETF applications by major financial players with the SEC. If these conditions are met, it could lead to an influx of financial players and investors into cryptocurrency. Many investors are looking to cryptocurrencies as a hedge against inflation, and greater regulatory clarity and the approval of a Bitcoin ETF could make the industry more attractive to traditional investors. Cryptocurrency Trading Volume Drops To 2020 Levels  Crypto trading volumes have reached their lowest levels since 2020, despite the ongoing rally in June. According to a report by crypto market data provider Kaiko, spot trade volumes have significantly declined in Q2, with Binance registering the strongest drop in trading activity. Binance, one of the world&#8217;s largest crypto exchanges, saw volumes fall by nearly 70% after the exchange reintroduced fees for its most liquid Bitcoin pairs. This move, aimed at reducing market manipulation, appears to have significantly impacted trading activity on the platform. However, Binance was not the only exchange to see a significant decline in trading volumes. Other popular exchanges, including Coinbase, Kraken, OKX, and Huobi, also saw volumes decline by over 50% in Q2. Related Reading: Bitcoin Bulls Dominate, But Expert Warns Of Potential $20,000 Retest The decline in trading volumes is surprising, given the recent rally in the crypto market. Bitcoin, the largest cryptocurrency by market cap, has been bullish in June, reaching a high of over $31,000. Despite this, trading volumes have remained subdued, suggesting that investors are not as active in the market as they have been. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-03T22:01:26.000Z",
    "title": "Economist Alex Krüger Says Bitcoin (BTC) on the Edge of a Breakout With Room To Run – Here’s His Target",
    "url": "https://dailyhodl.com/2023/07/03/economist-alex-kruger-says-bitcoin-btc-on-the-edge-of-a-breakout-with-room-to-run-heres-his-target/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-ETF-Battle-With.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-ETF-Battle-With.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-ETF-Battle-With.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-ETF-Battle-With.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-ETF-Battle-With.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-ETF-Battle-With.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-ETF-Battle-With.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Economist and crypto analyst Alex Krüger is bullish on Bitcoin (BTC), saying that the king crypto could mount strong rallies in the near future. In a new Wolf of All Streets stream, Krüger explains the importance of the BlackRock spot BTC exchange-traded fund (ETF) application. He also says that technically speaking, Bitcoin has a liquidity [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/03/economist-alex-kruger-says-bitcoin-btc-on-the-edge-of-a-breakout-with-room-to-run-heres-his-target/\">Economist Alex Krüger Says Bitcoin (BTC) on the Edge of a Breakout With Room To Run – Here&#8217;s His Target</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]