[
  {
    "source": "CoinDesk",
    "date": "2024-02-01T22:17:23.000Z",
    "title": "U.S. Lawmakers Seek to Overturn SEC's Crypto Accounting Policy",
    "url": "https://www.coindesk.com/policy/2024/02/01/us-lawmakers-seek-to-overturn-secs-crypto-accounting-policy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Members of Congress are trying to delete the controversial U.S. Securities and Exchange Commission accounting bulletin that implies restrictions on companies that want to hold their customer's crypto assets."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-01T22:15:28.000Z",
    "title": " Three Arrows co-founders’ OPNX exchange is shutting down ",
    "url": "https://cointelegraph.com/news/three-arrows-capital-opnx-exchange-shutting-down-february",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYWQ4MDU3ODQtNWNmNC00YjgwLWIwYjgtMDliYmZhZmJhMGY1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Crypto bankruptcy claims and trading platform Open Exchange has urged users to settle all positions by Feb. 7 and withdraw by Feb. 14.</p>\n                    <p><p>Crypto bankruptcy claims platform OPNX — launched by the co-founders of failed hedge fund Three Arrows Capital — has announced that it will officially cease all operations and shut down by Feb. 14. </p><p>In an email to users of the exchange, viewed by Cointelegraph, OPNX \"strongly advised\" its users to settle all positions by Feb. 7 and withdraw their funds from the platform by Feb. 14. Following this date, all withdrawl functionality will be disabled. </p><p>OPNX, short for Open Exchange, is a hybrid bankruptcy claims platform and crypto exchange that allows users to trade creditor claims of bankrupt crypto companies.</p><p><a href=\"https://cointelegraph.com/news/three-arrows-capital-opnx-exchange-shutting-down-february\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-01T22:30:27.000Z",
    "title": "Bullish on Bitcoin: Global Survey Respondents Anticipate BTC Price Spike to $60K and Beyond in 2024",
    "url": "https://news.bitcoin.com/bullish-on-bitcoin-global-survey-respondents-anticipate-btc-price-spike-to-60k-and-beyond-in-2024/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/bull-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bullish on Bitcoin: Global Survey Respondents Anticipate BTC Price Spike to $60K and Beyond in 2024\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/bull-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bull-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bull-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bull-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bull-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bull-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bull.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A recent international survey by Bitget has illuminated the crypto market&#x2019;s hopeful perspective, drawing insights from close to 10,000 individuals across areas such as West Europe, East Europe, Southeast Asia, East Asia, MENA, and Latin America. More than half of the participants globally anticipate that bitcoin prices will hover between $30,000 and $60,000 during the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-01T22:25:51.000Z",
    "title": "Genesis reaches $21 million settlement with SEC amid bankruptcy",
    "url": "https://www.cryptopolitan.com/genesis-reaches-21-million-settlement-sec/",
    "description": "Genesis, a Digital Currency Group (DCG) subsidiary, has settled with the Securities and Exchange Commission (SEC), agreeing to pay $21 million over allegations related to its lending program.  Bankruptcy and legal challenges This settlement resolves a significant legal challenge for Genesis, which had been embroiled in a lawsuit with the SEC concerning the unregistered sale [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-01T22:30:33.000Z",
    "title": "POLKADOT PRICE ANALYSIS & PREDICTION (February 1) – DOT Ends Recovery With Sharp Rejection, Resumes Bearish ",
    "url": "https://nulltx.com/polkadot-price-analysis-prediction-february-1-dot-ends-recovery-with-sharp-rejection-resumes-bearish/",
    "description": "Polkadot DOT resumed a downtrend this week after failing to sustain recovery. The bears appeared back in control as they slowly released pressure. We can expect bigger drops if the price breaks below $6. After ending a week retracement at $7.3, DOT initiated a fresh drop on Monday and continued [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-01T22:24:55.000Z",
    "title": "AVALANCHE PRICE ANALYSIS & PREDICTION (February 1) – Avax Targets $27.3 In The Latest Meltdown, Can It Crackdown? ",
    "url": "https://nulltx.com/avalanche-price-analysis-prediction-february-1-avax-targets-27-3-in-the-latest-meltdown-can-it-crackdown/",
    "description": "After witnessing a nice recovery all through last week, Avax tumbles and turns weak again due to the latest drops. It has registered a 7% loss in the last 48 hours and will likely shed more in the coming days. Last week, Avax took a little break from the dip [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-01T22:30:12.000Z",
    "title": "BitMEX Whales Buy Bitcoin: What History Says Will Happen Next",
    "url": "https://www.newsbtc.com/bitcoin-news/bitmex-whales-buy-bitcoin-what-history-happen/",
    "description": "On-chain data shows the Bitcoin price has followed a particular pattern when the BitMEX whales have made large withdrawals. Bitcoin Exchange Netflow For BitMEX Has Seen A Red Spike Recently As an analyst in a CryptoQuant Quicktake post pointed out, the cryptocurrency exchange BitMEX has recently observed significant withdrawals from the whales. The indicator of interest here is the &#8220;exchange netflow,&#8221; which tracks the amount of Bitcoin entering or leaving any exchange&#8217;s wallets. The metric&#8217;s value is calculated by subtracting the outflows from the inflows. When the value of this metric is positive, it means that the inflows outweigh the outflows right now, implying that the investors are depositing a net number of coins to the platform. Related Reading: XRP Whales Are On The Move, What Are They Up To? Generally, one of the main reasons holders want to transfer their BTC to exchanges is for selling-related purposes, as this trend can have a bearish impact on the asset&#8217;s price. On the other hand, the negative indicator implies net withdrawals are taking place on the exchange. Such a trend can suggest either some fresh buying is occurring or some existing investors are simply transferring the BTC they already own towards self-custody. In either case, the holders withdrawing from the exchange&#8217;s custody can be a bullish sign for the cryptocurrency, implying that these investors potentially plan to hold onto their coins for extended periods. Now, here is a chart that shows the trend in the Bitcoin exchange netflow for the BitMEX platform over the last few months: The value of the metric appears to have been quite negative in recent days &#124; Source: CryptoQuant As displayed in the above graph, the Bitcoin exchange netflow for BitMEX has registered large negative values just recently. The investors have withdrawn about 4,000 BTC (equivalent to $168.3 million at the current exchange rate) from the platform during this net outflow spree. The quant has explained that the price of the cryptocurrency and this metric have followed a specific pattern whenever this trend has occurred. Below is a zoomed-out indicator chart showing the previous instances where negative spikes took form. The trend in the BitMEX exchange netflow over the last few years &#124; Source: CryptoQuant &#8220;When a significant volume of Bitcoins is observed leaving BitMEX, one of the leading cryptocurrency trading platforms, it often signals the formation of local bottoms in the price of Bitcoin (BTC),&#8221; notes the analyst. The graph shows that large net withdrawals also occurred on the exchange right before the current rally in the cryptocurrency&#8217;s price began in October of last year. It&#8217;s possible that these historical negative spikes in the indicator corresponded to buying from these BitMEX whales, which helped the price bottom out and turned around. Related Reading: Bitcoin Miner Selloff Poses “Negligible Impact”, Quant Argues Given this historical pattern, the latest net withdrawals may have a similar effect to some degree on the coin. The quant cautions, however, that &#8220;it is essential to closely monitor these trends, as large inflows into the exchange can have the opposite effect, potentially leading to a decrease in BTC price.&#8221; BTC Price Bitcoin has erased its recent recovery as the asset&#8217;s price has returned to the $42,000 mark now. Looks like the price of the asset has returned to an overall sideways trajectory &#124; Source: BTCUSD on TradingView Featured image from Thomas Lipke on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-01T22:39:00.000Z",
    "title": "Hex Trust Integrates with XRP Ledger to Enhance Digital Asset Services",
    "url": "https://coinedition.com/hex-trust-integrates-with-xrp-ledger-to-enhance-digital-asset-services/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Main-Features-of-XRPL.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Hex Trust Integrates XRP Ledger to Enhance User Experience\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Main-Features-of-XRPL.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Main-Features-of-XRPL-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Main-Features-of-XRPL-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Main-Features-of-XRPL-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Main-Features-of-XRPL-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Main-Features-of-XRPL-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Hex Trust, a digital asset custodian, has recently announced its integration with the XRP Ledger (XRPL), significantly broadening its service offerings. This integration capitalizes on XRPL&#8217;s decentralized blockchain technology, celebrated for its rapid transaction speeds, minimal costs, and energy efficiency. By aligning with XRPL, Hex Trust aims to enrich its Hex Safe platform, offering users [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/hex-trust-integrates-with-xrp-ledger-to-enhance-digital-asset-services/\">Hex Trust Integrates with XRP Ledger to Enhance Digital Asset Services</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]