[
  {
    "source": "Crypto Daily",
    "date": "2023-07-29T08:30:00.000Z",
    "title": "India’s Supreme Court Criticizes Lack Of Crypto Regulation",
    "url": "https://cryptodaily.co.uk/2023/07/indias-supreme-court-criticizes-lack-of-crypto-regulation",
    "description": "<p>The Supreme Court of India came down heavily on the central government, expressing displeasure over the lack of a clear law or regulations when it came to cryptocurrencies.&nbsp;</p>\n<p>The Apex court also noted a lack of an expert agency to probe criminal cases involving cryptocurrencies.&nbsp;</p>\nCourt Questions Government&nbsp;\n<p>The Supreme Court stated that it was unfortunate that the central government had not brought in any type of legislation to regulate cryptocurrencies. The court also asked the central government to clarify whether it intended to set up a federal agency to investigate criminal cases that involve crypto. It also stressed the importance of setting up an agency capable of comprehending and thoroughly investigating cases involving crypto at a national level, adding that it is in the country&rsquo;s interests to have such an agency in place.&nbsp;</p>\n<p>The bench, comprising of Justice Dipankar Datta and Justice Surya Kant, also questioned the quality of investigations carried out by the police, stating they may not possess the necessary expertise to handle such cases but are still being promoted to higher ranks and positions. The bench remarked,&nbsp;</p>\n\n<p>&ldquo;You still don&rsquo;t have any law, unfortunately. Do you have an agency at the national level to understand these cases and investigate them properly? We want you to identify a national specialized agency in the national interest. What kind of a quality investigation can you expect when you have a police constable who gets promoted to an assistant sub-inspector or a sub-inspector to handle such cases?&rdquo;</p>\n\nInnocent Investors Suffering&nbsp;\n<p>The court urged the government to devise a legal regime to handle cases involving cryptocurrencies at the earliest. The bench expressed anguish that innocent investors were being duped while the government had no capable agency present at the national level to investigate the complex nature of crypto transactions. The bench remarked to the additional solicitor general, Vikramjit Bannerjee, stating,&nbsp;</p>\n\n<p>&ldquo;There has to be some legislative mechanism. You can tell us that it is for you to decide whether or not you want it. But so long you don&rsquo;t have a mechanism, how do you investigate people and keep them behind bars? It&rsquo;s, after all, the country&rsquo;s money that is being siphoned off. It&rsquo;s like Hawala. Who has the responsibility to stop it? We thought you would yourself come forward and provide some solution.&rdquo;</p>\n\nThe Case In Question&nbsp;\n<p>The bench made the remarks while hearing a case involving a Delhi resident facing charges of crypto fraud in multiple cases, including Gujarat, Maharashtra, and Jharkhand. The accused individual, Ganesh Shivkumar Sagar, has filed several petitions seeking bail and asking that all cases against him be transferred to a central agency for further investigation.&nbsp;</p>\n<p>In another incident, the CBI apprehended a Delhi resident who posed as a Canadian government official, tricking his victims into transferring their digital assets to crypto wallets that were then misappropriated with the help of multiple accomplices. A subsequent search operation saw the agency recover over 1 crore in cash from the prime accused&rsquo;s premises located in Delhi.&nbsp;</p>\n<p>According to the first information report (FIR) filed by the CBI, the main accused, along with an accomplice, pretended to be Canadian government officials. The accused then tricked an individual based in Quebec, coercing them into depositing over 7000 CAD, equivalent to around Rs. 4.30 lakh, into a crypto wallet.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-29T08:30:11.000Z",
    "title": "Double Standards in Finance: SBF’s Legal Troubles Spark Concerns",
    "url": "https://news.bitcoin.com/double-standards-in-finance-sbfs-legal-troubles-spark-concerns/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/sbf-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Double Standards in Finance: SBF&#039;s Legal Troubles Spark Concerns\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/sbf-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sbf-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sbf-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sbf-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sbf-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sbf-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sbf-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Cryptocurrencies and DeFi have shaken up the world of finance, but the spotlight on Sam Bankman-Fried (SBF), the mysterious FTX founder, has raised serious concerns about how the U.S. government handles financial regulation and fairness. SBF faces some serious accusations like misusing customer funds, market manipulation, insider trading, witness tampering, and money laundering. Some folks [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-29T08:31:33.000Z",
    "title": "Is Robot Control Going Natural with AI Tech? Google’s RT-2 Promises So!",
    "url": "https://www.cryptopolitan.com/robot-control-natural-ai-tech-googles-rt-2/",
    "description": "Google&#8217;s latest innovation in artificial intelligence, the Robotics Transformer 2 (RT-2), is breaking new ground in the world of robotics. Leveraging cutting-edge AI tech similar to the systems powering AI chatbots like Bard and ChatGPT, Google aims to enable robots to perform tasks more efficiently and effectively. Vincent Vanhoucke, the head of robotics for Google ... <a title=\"Is Robot Control Going Natural with AI Tech? Google&#8217;s RT-2 Promises So!\" class=\"read-more\" href=\"https://www.cryptopolitan.com/robot-control-natural-ai-tech-googles-rt-2/\" aria-label=\"More on Is Robot Control Going Natural with AI Tech? Google&#8217;s RT-2 Promises So!\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-29T08:22:00.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-29T08:32:02.000Z",
    "title": "CryptoPunks Toughness Tested As NFT Succumbs To 60% Drop In 1 Week",
    "url": "https://www.newsbtc.com/news/cryptopunks-toughness-tested-as-nft-succumbs-to-60-drop-in-1-week/",
    "description": "Non-fungible tokens continue to play a significant role in developing the Web3 ecosystem, despite the enthusiasm around them having subsided since its peak in 2021. Unquestionably, these distinctive digital assets have been a significant force behind the NFT transformations that have taken place. Despite the wide variety of NFT collections and their accomplishments, it is crucial to recognize that some particular ones have recently been severely affected by market pressures and are now beginning to fall from their lofty positions. Consider the situation with CryptoPunks. CoinGecko discovered that of the top 11 &#8220;blue chip&#8221; NFT projects studied, CryptoPunks suffered the worst losses. Non-fungible tokens known as &#8220;blue chip NFTs&#8221; are regarded as highly precious and prestigious in digital assets. These NFTs are frequently linked to well-known and recognized producers or organizations, such as renowned artists, enduring businesses, or essential historical items. Source: CoinGecko Collectors and investors widely seek after them due to scarcity, historical relevance, and the artist&#8217;s reputation that determine their value. Alarming statistics currently facing CryptoPunks are raising questions among NFT enthusiasts. These formerly well-liked digital assets have recently encountered a worrying situation, sparking disputes and disagreements among investors and fans. Related Reading: Traders’ Interest In XRP Remains Solid Despite Price Retreat, Data Shows Source: NFT Floor Price At the time of writing, the floor price for these NFT collections was set at 47.69 ETH. Data from NFT Floor Price shows that the collection&#8217;s value declined after reaching a high of 11,000ETH during the 2021 NFT bull market. The volume and sales of CryptoPunks have significantly decreased during the past seven days, claims OpenSea. Sales were down 60%, while volume dropped sharply by 64%. Bitcoin slightly above the  $29K level. Chart: TradingView.com Due to their distinctiveness and variable rarity, CryptoPunks, developed by Larva Labs in 2017 and helped increase generative PFP collections, are still incredibly sought-after NFTs. CryptoPunks, regarded as art and collectibles, have generated respectable profits for their owners. CryptoPunk #5822, which sold for $23 million in February last year, was the most expensive ever. Related Reading: Dogecoin Ascendance: How It Captured PEPE Investors’ Attention Now, in terms of the number of unique active wallets, CryptoPunks has seen a depressing reduction of about 20%, and transactions have also suffered, losing more than 32% of their values. Meanwhile, CryptoPunks&#8217; monthly sales volume is also feeling the heat, declining precipitously since March. The NFT initiative reported sales of $30.43 million for the month, but by the end of June, those figures had substantially dropped to less than $10 million. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Reuters"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-29T08:35:23.000Z",
    "title": "Top 3 Bullish cryptos to buy this summer: Litecoin (LTC), Filecoin (FIL) and InQubeta (QUBE)",
    "url": "https://www.crypto-news-flash.com/top-3-bullish-cryptos-to-buy-this-summer-litecoin-ltc-filecoin-fil-and-inqubeta-qube/?utm_source=rss&utm_medium=rss&utm_campaign=top-3-bullish-cryptos-to-buy-this-summer-litecoin-ltc-filecoin-fil-and-inqubeta-qube",
    "description": "<img width=\"512\" height=\"353\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-29T112709.131.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-29T112709.131.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-29T112709.131-300x207.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Summer for crypto enthusiasts isn&#8217;t just for beach-dipping or basking in the heat. The crypto market is bustling with excitement and fervor as investors seek bullish assets with the potential for explosive returns. Among the many cryptocurrencies in the market, investors are most bullish on Litecoin, Filecoin, and InQubeta. Their innovative approach and enthusiasm around [...]"
  }
]