[
  {
    "source": "CoinDesk",
    "date": "2023-08-29T11:00:00.000Z",
    "title": "Tokenized U.S. Treasuries Arrive to XDC Network as Digital Bond Market Grows",
    "url": "https://www.coindesk.com/markets/2023/08/29/tokenized-us-treasuries-arrive-to-xdc-network-as-digital-bond-market-grows/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The market for tokenized U.S. Treasuries has grown nearly sixfold to $622 million this year, as real-world assets on blockchains keep expanding."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-29T10:55:54.000Z",
    "title": "Binance Mulls ‘Full Exit’ From Russia Amid Mounting Regulatory Pressure: Report",
    "url": "https://decrypt.co/154098/binance-mulls-full-exit-from-russia-amid-mounting-regulatory-pressure-report",
    "description": "The crypto exchange is reportedly considering whether to withdraw entirely from the Russian market as regulatory pressure mounts."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-29T11:01:14.000Z",
    "title": "DOJ seeks to dismiss star lineup of expert witnesses in Sam Bankman-Fried trial",
    "url": "https://cryptoslate.com/doj-seeks-to-dismiss-star-lineup-of-expert-witnesses-in-sam-bankman-fried-trial/",
    "description": "<p>The U.S. Department of Justice wants the court to disqualify all the expert witnesses of Sam Bankman-Fried, per an Aug. 28 court filing. According to the DOJ, SBF experts&#8217; disclosure filings are insufficient, and their experience is misleading. The prosecutors further argued that these witnesses&#8217; testimony may be irrelevant to the case. The DOJ discredited [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/doj-seeks-to-dismiss-star-lineup-of-expert-witnesses-in-sam-bankman-fried-trial/\">DOJ seeks to dismiss star lineup of expert witnesses in Sam Bankman-Fried trial</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-29T11:00:00.000Z",
    "title": "\n                        Robinhood Emerges as the Third-Largest Bitcoin Holder\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/robinhood-emerges-as-the-third-largest-bitcoin-holder",
    "description": "\n                        <p dir=\"ltr\">The crypto community has been abuzz with discussions about a mysterious Bitcoin wallet that rapidly accumulated a staggering $3 billion worth of Bitcoin in just three months. The identity of this enigmatic Bitcoin behemoth has finally been unveiled.</p>\nWallet identified\n<p dir=\"ltr\">The wallet in question, which surprisingly climbed the ranks to become the third-largest Bitcoin holder globally in merely over three months, has been identified as belonging to Robinhood: Jump Trading Custody, according to&nbsp;insights from blockchain intelligence platform Arkham Intelligence.</p>\n<p dir=\"ltr\">The journey of this wallet began on March 8, as per data from BitInfoCharts. In the subsequent three months and two weeks, the wallet amassed an impressive 118,000 BTC, which, at current market rates, is valued at approximately $3.08 billion.</p>\nConjecture\n<p dir=\"ltr\">The swift and substantial accumulation of Bitcoin by this single address led to a flurry of theories and conjectures. While some believed it to be a crypto exchange shuffling its funds, others on Crypto Twitter had a more audacious theory.&nbsp;</p>\n<p dir=\"ltr\">It was speculated that the global investment management corporation, BlackRock, might be the entity behind this massive accumulation. This theory, albeit lacking concrete evidence, gained traction when enthusiasts pointed out the timeline of BlackRock's spot Bitcoin ETF filing, which coincided with the wallet's major transactions.</p>\n<p dir=\"ltr\">However, with the revelation from Arkham Intelligence, the fog of mystery seems to have lifted. The top two spots for the largest Bitcoin wallets globally are held by Binance and Bitfinex, known for their Bitcoin cold wallets. Following Robinhood's wallet in the third position is another Binance cold wallet.</p>\n\n<p class=\"MsoNormal\">&nbsp;Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-29T11:00:23.000Z",
    "title": "DeOrderBook Set to Launch on Ethereum Mainnet, Pioneering Truly Trustless DeFi Optionality",
    "url": "https://news.bitcoin.com/deorderbook-set-to-launch-on-ethereum-mainnet-pioneering-truly-trustless-defi-optionalitym/",
    "description": "<img width=\"768\" height=\"437\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/a34db96f-e2c8-4a36-8f29-95c949ebfca9-768x437.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/a34db96f-e2c8-4a36-8f29-95c949ebfca9-300x171.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/a34db96f-e2c8-4a36-8f29-95c949ebfca9-1024x583.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/a34db96f-e2c8-4a36-8f29-95c949ebfca9-768x437.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/a34db96f-e2c8-4a36-8f29-95c949ebfca9-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/a34db96f-e2c8-4a36-8f29-95c949ebfca9.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. DeOrderBook, a groundbreaking decentralized finance (DeFi) optionality protocol, is gearing up for its Ethereum mainnet launch, ushering in a new era for DeFi users who seek unprecedented capital flexibility, advanced hedging mechanisms, and sustainable real yield. At launch, the protocol supports $WBTC and $USDC although the team is actively working on support for [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T11:06:12.000Z",
    "title": "What is Microsoft’s “Algorithm of Thoughts” and how does it enhance AI reasoning?",
    "url": "https://www.cryptopolitan.com/microsoft-algorithm-of-thoughts-ai-reasoning/",
    "description": "In a significant leap forward for artificial intelligence (AI) research, Microsoft has introduced a groundbreaking AI training technique known as the &#8220;Algorithm of Thoughts&#8221; (AoT). Designed to bridge the gap between human-like intuition and algorithmic precision, this approach aims to enhance the reasoning abilities of large language models, propelling AI technology further towards human-like cognition. ... <a title=\"What is Microsoft&#8217;s &#8220;Algorithm of Thoughts&#8221; and how does it enhance AI reasoning?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/microsoft-algorithm-of-thoughts-ai-reasoning/\" aria-label=\"More on What is Microsoft&#8217;s &#8220;Algorithm of Thoughts&#8221; and how does it enhance AI reasoning?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T10:52:16.000Z",
    "title": "Nigerian Government Launches Global Initiative to Recruit Top Researchers for AI Strategy Implementation",
    "url": "https://www.cryptopolitan.com/nigerian-launches-ai-strategy-implementation/",
    "description": "In a significant move aimed at propelling Nigeria&#8217;s technological advancement, the Nigerian government has embarked on a global mission to identify and recruit top-tier researchers to spearhead the execution of the nation&#8217;s artificial intelligence (AI) strategy. This initiative comes as AI technology continues to redefine industries across the globe, and Nigeria aims to position itself ... <a title=\"Nigerian Government Launches Global Initiative to Recruit Top Researchers for AI Strategy Implementation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nigerian-launches-ai-strategy-implementation/\" aria-label=\"More on Nigerian Government Launches Global Initiative to Recruit Top Researchers for AI Strategy Implementation\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-29T10:58:54.000Z",
    "title": "Ethereum sees sell-offs amid drop in transaction volume",
    "url": "https://crypto.news/ethereum-sees-sell-offs-amid-drop-in-transaction-volume/",
    "description": "Ethereum (ETH) faces a dual challenge as sustained whale sell-offs coincide with a drop in transaction volume despite a bullish trend of persistent development activity. Behavior analytics resource Santiment called attention to these metrics in its latest insights on the&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-29T10:49:03.000Z",
    "title": "Toncoin price surges with small investors interest",
    "url": "https://crypto.news/toncoin-price-surges-with-small-investors-interest/",
    "description": "Toncoin’s (TON) price has consistently risen over the past ten days despite low whale activity. This shows the upward momentum has come from small investors. According to data provided by Santiment, the number of TON whale transactions, consisting of at&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-29T11:00:07.000Z",
    "title": "Bloomberg Expert Analyst Explains Why A Fall To $10,000 Isn’t Bad For Bitcoin",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-fall-to-10000/",
    "description": "Since the price of Bitcoin fell below $30,000, numerous forecasts have been made on the currency&#8217;s potential future price outlook of the asset. As the biggest cryptocurrency in the world, Bitcoin has amassed price headlines, some of which are optimistic while others are pessimistic.  However, a question that lingers is whether another crash is really the end of the world for Bitcoin. In such an event, Mike McGlone, a senior analyst at Bloomberg, believes that even a decrease in price to $10,000 would not be bad for Bitcoin. Bitcoin Still Outperforming The Stock Market A fall in Bitcoin to $10,000 would definitely lead to a chain of events in other cryptocurrencies, as most of the general market sentiment relies on Bitcoin. While many short-term holders and some long-term holders may panic sell, the long-term outlook is still bullish.  Related Reading: JP Morgan Explains Why Bitcoin Price May Not Fall Further Market analyst Mike McGlone puts the Bitcoin performance in comparison with the stock market, and the Amazon stock in particular. He points out that even with a 50% drop in its current price, BTC would still be outperforming Amazon stock. Amazon has had one of the best growth in terms of stock price in 20 years. Over the past 20 years, Amazon shares have generated a total return of over 7,000%. However, this is small when compared to how much BTC has grown since its launch in 2009 since the asset is up 26,000x since it first traded for $1 in 2011.  “Bitcoin compares with 130% for Amazon on a similar measure, but that took about 25 years. Heading back towards $10,000 would still maintain Bitcoin’s unprecedented performance,” he said.  &#8216;It Went Up, So Will Keep Going Up&#8217; Risks in Bitcoin &#8211; The lessons of high-performing, widely hyped assets show price reversion may be the greater risk once the masses jump on board. #Bitcoin at about $26,000 on Aug. 28 is slightly below the end of 2020, similar to… pic.twitter.com/3UdAbpLNLe — Mike McGlone (@mikemcglone11) August 28, 2023 Bitcoin is known for wild price swings since digital currencies are emerging assets, and volatility comes with the territory. With a current market cap of $506 billion, BTC has a 48.3% dominance in the crypto market. BTC price fails to reclaim $26,000 &#124; Source: BTCUSD on Tradingview.com What’s Next For BTC? Bitcoin is currently trading at $26,000 after the cryptocurrency climbed over $30,000 earlier this year but fears have pushed the price back down to its current level. At its current levels, however, BTC is up more than 30.75% from the same period last year, showing a better price sentiment than in 2022. While BTC could definitely fall further below $26,000, a fall toward $10,000 is highly unlikely as many things would have to go wrong for BTC to reach $10,000. BTC is also gaining more mainstream traction from institutions, especially with current spot Bitcoin ETF filings. As a result, there is a greater possibility of Bitcoin&#8217;s price increasing than decreasing in the coming months.  Related Reading: Another Bitcoin Metric Is About To Reach A New All-Time High Despite The Bear Market This is not the first time $10,000 price predictions have come in regarding BTC. Late last year, Mark Mobius, founder of Mobius Capital predicted Bitcoin might drop to $10,000 in the short term.  On the other hand, there have been some optimistic forecasts made recently. Tom Fundstrat, one of the co-founders of Fundstrat, believes the price of BTC could reach $150,000 or maybe even further by the end of next year. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-29T11:02:39.000Z",
    "title": "Hong Kong’s Hashkey Launches Retail Bitcoin and Ethereum Exchange: Will New Trillions Flow into the Market Backed by China?",
    "url": "https://www.crypto-news-flash.com/hong-kongs-hashkey-launches-retail-bitcoin-and-ethereum-exchange-will-new-trillions-flow-into-the-market-backed-by-china/",
    "description": "<img width=\"1920\" height=\"1272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/hong-kong-376777_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/hong-kong-376777_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/hong-kong-376777_1920-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/hong-kong-376777_1920-1024x678.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/hong-kong-376777_1920-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Hong Kong&#8217;s decision to embrace crypto trading enables Hashkey Exchange to upgrade its license to offer services to retail Investors.  Hashkey projects that 500,000 to 1 million users could sign up on the platform by the end of the year.  Amid the recent decision of Hong Kong to take crypto adoption to the next level, [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-29T10:46:00.000Z",
    "title": "How Many BTCs to Join the Top 1% of Bitcoiners?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-many-btcs-to-join-the-top-1-of-bitcoiners/",
    "description": "<p>The allure of becoming part of the top echelon of Bitcoin holders is captivating, but how much Bitcoin do you need to accumulate in order to rank among the top 1%? In this article, we will explore this question, shedding light on the potential required amount and discussing five strategies to accumulate Bitcoin effectively. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-many-btcs-to-join-the-top-1-of-bitcoiners/\">How Many BTCs to Join the Top 1% of Bitcoiners?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]