[
  {
    "source": "Cointelegraph",
    "date": "2023-06-19T05:29:00.000Z",
    "title": "‘Britcoin’ launch inches closer after Project Rosalind CBDC tests",
    "url": "https://cointelegraph.com/news/uk-cbdc-closer-after-project-rosalind-tests",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/d52b4eb3-2847-4cfb-9ac3-55a5d6b6e78e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A major study between the BIS and the U.K. central bank found a retail CBDC could make peer-to-peer payments cheaper and easier.</p>\n                    <p><p>The Bank of England (BoE) is a step closer to launching its central bank digital currency (CBDC) dubbed “Britcoin” following the conclusion of a trial study called Project Rosalind.</p><p>The Bank for International Settlements (BIS) along with the BoE launched the joint experiment in July 2022 to explore how prototypes of an application programming interface (API) could be implemented in retail CBDC transactions. </p><p>A June 16 <a href=\"https://www.bis.org/publ/othp69.pdf\" target=\"_blank\" rel=\"noopener nofollow\">report</a> which summed up phase two of Project Rosalind found a CBDC could make payments between individuals cheaper and more efficient while allowing firms to create new financial products that work to reduce fraudulent financial activity. </p><p>Overall, the study developed 33 API functionalities and explored “more than 30 retail CBDC use cases.” </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/c2868baf-e03c-4a8e-84d7-232675dfffde.jpg\"  /><figcaption style=\"text-align: center;\"><em>Project Rosalind CBDC API summary. Source: BIS.</em></figcaption></figure><p>In addition to looking at how a CBDC would function on smartphones, retail vendors and online stores, the study also explored the concept of “programmability” — a term that refers to customizing digital money to behave in specific ways once certain conditions are met. </p><p>CBDC programmability has been <a href=\"https://cointelegraph.com/news/programmable-money-should-terrify-you-layah-heilpern\">met with considerable skepticism</a>, as critics claim a CBDC could be programmed to “work against” those who use it. </p><p>Overall, the study concluded a “well-designed” API layer could enable a central bank to interact with the private sector to “safely provide” retail CBDC payments.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Project Rosalind, from the <a href=\"https://twitter.com/hashtag/BISInnovationHub?src=hash&amp;ref_src=twsrc%5Etfw\">#BISInnovationHub</a> London Centre &amp; <a href=\"https://twitter.com/bankofengland?ref_src=twsrc%5Etfw\">@bankofengland</a>, explored how a universal and extensible <a href=\"https://twitter.com/hashtag/API?src=hash&amp;ref_src=twsrc%5Etfw\">#API</a> layer could connect central bank and private sector infrastructures and facilitate retail <a href=\"https://twitter.com/hashtag/CBDC?src=hash&amp;ref_src=twsrc%5Etfw\">#CBDC</a> payments <a href=\"https://t.co/HL7EmI7RWx\">https://t.co/HL7EmI7RWx</a> <a href=\"https://t.co/kDeo0yhrsR\">pic.twitter.com/kDeo0yhrsR</a></p>&mdash; Bank for International Settlements (@BIS_org) <a href=\"https://twitter.com/BIS_org/status/1669634441025650688?ref_src=twsrc%5Etfw\">June 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“The Rosalind experiment has advanced central bank innovation in two key areas: by exploring how an API layer could support a retail CBDC system and how it could facilitate safe and secure CBDC payments through a range of different use cases,” said Francesca Road, head of the BIS London Innovation Hub in a press release. </p><p>Despite the positive findings yielded in Project Rosalind, the BoE Deputy Governor Jon Cunliffe said a final decision on if the country would launch a CBDC is still “some years” away. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/privacy-anonymity-considered-retail-cbdc-treasury\"><strong><em>Privacy should be considered in ‘potential retail CBDC’ — Treasury official</em></strong></a></p><p>According to a June 16 Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2023-06-15/boe-s-cunliffe-says-decision-on-britcoin-cbdc-is-some-years-away\" target=\"_blank\" rel=\"noopener nofollow\">report</a>, Cunliffe told attendees of Politico’s Global Tech Day conference that the odds of a CBDC project going ahead currently stand at “seven out of ten.”</p><p>On the same day the findings from Project Rosalind were released, enterprise blockchain <a href=\"https://cointelegraph.com/learn/what-is-quant-network-a-beginners-guide-to-qnt-cryptocurrency\">Quant Network</a> <a href=\"https://www.businesswire.com/news/home/20230616551494/en/Quant-Collaborates-With-Bank-for-International-Settlements-and-Bank-of-England-on-Project-Rosalind-as-Technology-Vendor\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> its role as a vendor in the study. The announcement saw the price of Quant’s native QNT (<a href=\"https://cointelegraph.com/quant-qnt-price-index\">QNT</a>) token surge more than 20% from $96 to $117 within 12 hours. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\"><strong><em>Bitcoin is on a collision course with ‘Net Zero’ promises</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T05:38:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-19T05:14:58.000Z",
    "title": "BNB Price Prediction: Fresh Increase Possible Above 100 SMA",
    "url": "https://www.newsbtc.com/analysis/bnb/bnb-price-prediction-fresh-increase-260/",
    "description": "BNB price (Binance coin) is recovering above $240 against the US Dollar. The price might gain bullish momentum if it clears $260 and $270. Binance coin price is attempting a recovery wave above $240 against the US Dollar. The price is now trading below $260 and the 100 simple moving average (4 hours). There is a key bullish trend line forming with support near $242 on the 4-hour chart of the BNB/USD pair (data source from Binance). The pair might struggle to gain bullish momentum above $260 and $270. Binance Coin Price Faces Resistance In the past few days, BNB price saw a major decline below the $260 support. There was a move below the $250 support zone, sparking bearish moves in Bitcoin and Ethereum. The price even dived toward the $220 support. A low is formed near $220.6 and the price is now attempting a recovery wave. There was a move above the $240 resistance. The price climbed above the 23.6% Fib retracement level of the key decline from the $317.0 swing high to the $220.6 low. The price is now consolidating below $260 and the 100 simple moving average (4 hours). There is also a key bullish trend line forming with support near $242 on the 4-hour chart of the BNB/USD pair. On the upside, BNB is facing resistance near the $254 level. The next major resistance is near $260 and the 100 simple moving average (4 hours). The main resistance is now forming near $268 and the 50% Fib retracement level of the key decline from the $317.0 swing high to the $220.6 low. Source: BNBUSD on TradingView.com A clear move above the $260 resistance and $268 might start a steady increase. The next major resistance is near the $280 level, above which the price might rise toward the $300 resistance. Fresh Decline in BNB? If BNB fails to clear the $260 resistance, it could start another decline. Initial support on the downside is near the $242 level and the trend line. The next major support is near the $230 level. If there is a downside break below the $230 support, the price could revisit the $220 support. Any more losses could send the price toward the $200 support. Technical Indicators 4-Hours MACD – The MACD for BNB/USD is losing pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for BNB/USD is currently above the 50 level. Major Support Levels – $242, $230, and $220. Major Resistance Levels – $260, $268, and $270."
  }
]