[
  {
    "source": "Cointelegraph",
    "date": "2024-03-06T15:52:36.000Z",
    "title": " Hut 8 closes Bitcoin mining site, citing surging energy costs ",
    "url": "https://cointelegraph.com/news/hut-8-closes-bitcoin-mining-site-citing-surging-energy-costs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZWVkM2E3ZTUtODdhZC00MzJhLWE4NWQtMjg2ZjhkNDBmZTE0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Drumheller, Alberta, mining site produces an annualized rate of 48 Bitcoins per year. </p>\n                    <p><p>Bitcoin miner Hut 8 is closing its mining site in Drumheller, Alberta, Canada, due to power disruptions and surging energy costs.</p><p>According to the March 6 <a href=\"https://www.globenewswire.com/news-release/2024/03/06/2841217/0/en/Hut-8-Streamlines-Operations-with-Closure-of-Drumheller-Site.html\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, Hut 8's Drumheller mining facility, which mines approximately 1.4% of the firm's Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) but at the cost of around 11% of its hash rate, will be closed effective immediately.</p><p>\"Following a comprehensive analysis, we have determined that the profitability of Drumheller has been impacted significantly by various factors, including elevated energy costs and underlying voltage issues,\" Asher Genoot, CEO of Hut 8, said in a statement. Effectively immediately, all of the company's Bitcoin miners will be relocated to its Medicine Hat, Alberta, Canada facility. \"Hut 8 will maintain its lease at the site and the option value of re-energizing the site if market conditions improve,\" its staff wrote.</p><p><a href=\"https://cointelegraph.com/news/hut-8-closes-bitcoin-mining-site-citing-surging-energy-costs\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-06T15:41:50.000Z",
    "title": "Is the Recent Dip in Cardano (ADA) and Polygon (MATIC) Forecasting a Major Altcoin Rally?",
    "url": "https://cryptodaily.co.uk/2024/03/is-the-recent-dip-in-cardano-ada-and-polygon-matic-forecasting-a-major-altcoin-rally",
    "description": "(MATIC) are shaking the crypto world! Dive into the latest insights on ADA's market dip and MATIC's surge. Don't miss out on the key technical analysis and future predictions for these trending altcoins. Click now for exclusive insights!"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-06T16:00:00.000Z",
    "title": "BlockDAG’s Price Explosion In Presale Ignites Interest Among Render and Helium Investors",
    "url": "https://www.cryptopolitan.com/blockdags-price-explosion-in-presale-ignites-interest-among-render-and-helium-investors/",
    "description": "BlockDAG (BDAG) has emerged as an irresistible beacon of potential in the market, charged with anticipation and promise. The recent presale explosion has sent shockwaves across the industry, capturing the attention of curious investors and rousing the interest of Render competitors. Amidst this unfolding excitement, another key player, Helium (HNT) has also seen price surges.&#160; [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-06T16:00:52.000Z",
    "title": "Analyst Cites Key Indicators That Signal Bitcoin Correction",
    "url": "https://www.newsbtc.com/news/bitcoin/indicators-that-signal-bitcoin-correction/",
    "description": "The price of Bitcoin witnessed a pullback on Tuesday amid a general bearish sentiment around the crypto market, after the digital asset reached the $69,000 threshold. Bitcoin Might Undergo Further Correction Following the correction, several predictions of a further decline in the price of Bitcoin from top crypto analysts have surfassed. Cryptocurrency analyst and trader Ali Martinez has highlighted a few indicators that suggest a continuous retracement in price. Related Reading: Bitcoin Extreme Greed At Levels Higher Than Nov. 2021 Peak, Top Signal? Martinez took to the social media platform X (formerly Twitter) to share his projections with the crypto community. According to Ali Martinez, on the daily chart of Bitcoin, the Tom DeMark (TD) Sequential indicator presently &#8220;flashed a sell signal.&#8221; The crypto analyst believes that this development deserves to be closely monitored. This is because the indicator &#8220;boasts a solid history of predicting Bitcoin trends&#8221; since the beginning of the year. He further pointed out that the indicator suggested a buy signal earlier in January, which was followed by a 34% rise in Bitcoin&#8217;s price. In addition, in the middle of last month, the indicator also suggested a sell signal, after which Bitcoin plummeted by over 4%. With the TD Sequential presently developing a sell signal, BTC might be poised to undergo a correction in the short term. However, there is no guarantee that the price of BTC will see a correction following the signal. Martinez also underscored the accuracy of the pointer in predicting BTC&#8217;s price movement, which he believes to be &#8220;remarkably insane.&#8221; In a previous projection, Martinez asserted that BTC has declined by &#8220;1.5% to 4.7%, each time the indicator recommends a selling&#8221; since February 15. As a result, short-term traders should carefully observe the trend in order to position themselves for future gains. So far, some market watchers feel that Bitcoin&#8217;s retracement was necessary, and they perceive the fall as a positive move. BTC Could See A 20% Drop This Time Around Martinez is not the only expert that has predicted a pullback in the short term. Crypto Jelle has also shared his negative forecast for BTC, pointing to a 20% price correction. Related Reading: Bitcoin Crossroads: Analyst Identifies Level Set To Determine Next Move Jelle noted as BTC moves towards its all-time high of $69,000, &#8220;there will be downturns along the way.&#8221; He further stated that this &#8220;time around,&#8221; it seems BTC might decline by 20%. Thus, the crypto analyst has urged not to be shaken by the outcome while telling them to &#8220;take advantage&#8221; of the development when it occurs. This is because Jelle believes that the key to making it in the crypto space is patience. Currently, the price of Bitcoin is down by over 2% in the last 24 hours, trading slightly above $66,000. Despite the price drop, its trading volume is up by over 37%, while its market cap is down by 2%. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-06T16:04:00.000Z",
    "title": "Bitcoin Records Nearly $10K Daily Candle in Flash Dip, What Does It Mean?",
    "url": "https://coinedition.com/bitcoin-records-nearly-10k-daily-candle-in-flash-dip-what-does-it-mean/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Will-BTC-see-9K-to-12K-or-What.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin Records Nearly $10K Daily Candle in Flash Dip, What Does It Mean?\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Will-BTC-see-9K-to-12K-or-What.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Will-BTC-see-9K-to-12K-or-What-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Will-BTC-see-9K-to-12K-or-What-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/Will-BTC-see-9K-to-12K-or-What-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Will-BTC-see-9K-to-12K-or-What-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Will-BTC-see-9K-to-12K-or-What-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Kyle du Plessis, a renowned crypto market analyst, has highlighted that Bitcoin fell by nearly $10,000 in one day during a flash to the downside. Plessis noted that the price drop led to mass liquidation, even though most cryptocurrencies are making impressive recoveries.&#160; In a recently uploaded video, the analyst highlighted around $1 billion in [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bitcoin-records-nearly-10k-daily-candle-in-flash-dip-what-does-it-mean/\">Bitcoin Records Nearly $10K Daily Candle in Flash Dip, What Does It Mean?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]