[
  {
    "source": "Cointelegraph",
    "date": "2023-10-29T21:19:01.000Z",
    "title": "Bitcoin price hovers near $35K as ETH, APT, QNT and RUNE turn bullish",
    "url": "http://cointelegraph.com/news/bitcoin-price-near-35-k-eth-apt-qnt-and-rune-turn-bullish",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/4cce8a6a-bfde-42a7-b37c-c6436fcfbd2b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price advances toward $35,000, potentially opening the door for ETH, APT, QNT and RUNE to move higher.</p>\n                    <p><p>Hopes of approval for a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund by the United States Securities and Exchange Commission boosted Bitcoin’s price by 27% in October. This improved sentiment, attracting aggressive buying by crypto investors.</p><p>Bloomberg senior ETF analyst Eric Balchunas highlighted in a post on X (formerly Twitter) that ProShares Bitcoin Strategy ETF (BITO), the first futures-based ETF to get regulatory consent in the U.S. in 2021, saw its <a href=\"https://cointelegraph.com/news/first-bitcoin-etf-trades-gbtc-discount-69k-btc-price\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/first-bitcoin-etf-trades-gbtc-discount-69k-btc-price/amp\">second biggest trading week ever at $1.7 billion</a>. Similarly, Grayscale Bitcoin Trust (GBTC) recorded a volume of $800 million. The sharp uptick in volume in the existing instruments shows that spot Bitcoin ETFs are likely to witness huge volumes when they see the light of the day. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/792772ac-5955-4fb5-8759-8f047276c7db.png\"><figcaption style=\"text-align: center;\"><em>Crypto market data daily view. Source:</em><em> </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>When the leader starts performing, it generally lifts the entire sector. That is seen in the strong performance of altcoins, which have risen sharply from their multi-year lows. </p><p>However, after the initial rally, some altcoins will struggle to maintain their up-move while a few will lead the markets higher. It is better to stick with the leaders as they are most likely to outperform during the next crypto bull phase.</p><p>Let’s look at the charts of the top-5 cryptocurrencies that may extend their rally in the next few days.</p><h2>Bitcoin price analysis</h2><p>Bitcoin pulled back from $35,280 on Oct. 24, indicating that higher levels are attracting selling by traders. The bears tried to start a deeper pullback on Oct. 27 but the long tail on the candlestick shows solid buying at lower levels. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/3276a1ad-4b92-48bf-aa17-89a473ae741e.png\"><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Although the rising moving averages indicate advantage to buyers, the overbought levels on the relative strength index (RSI) suggest that the BTC/USDT pair may spend some more time in consolidation.</p><p>The important level to watch out for on the downside is $32,400 and then $31,000. Sellers will have to pull the price below this zone to seize control. </p><p>Conversely, if the price turns up from the current level and breaks above $35,280, it will indicate the bulls are back in the driver’s seat. The pair may then surge to the next target objective at $40,000.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/05ea1899-c337-411d-b2f7-5dfd4b4cd3c5.png\"><figcaption style=\"text-align: center;\"><em>BTC/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The 20-EMA is gradually flattening out, indicating that the bulls are losing their grip in the near term. That could keep the pair range-bound between $35,280 and $33,200 for some time. If the bears yank the price below $33,200, the pair may tumble to $32,400.</p><p>On the contrary, if the price turns up and rallies above $35,280, it will indicate that the current consolidation was a continuation pattern. The pair could then skyrocket toward $40,000.</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) climbed above the $1,746 resistance on Oct. 23 and reached $1,865 on Oct. 26. This level attracted selling by short-term traders which pulled the price back toward the breakout level of $1,746.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/fe776d5f-e537-4756-9549-52698d45eb4b.png\"><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls successfully defended the retest to $1,746, indicating that the level may act as a new floor. The rising 20-day EMA ($1,693) and the RSI near the overbought zone, indicate that the bulls are in command. Buyers will then strive to push the price above $1,865. If they succeed, the ETH/USDT pair could soar to $2,000.</p><p>If bears want to prevent the upside, they will have to yank and sustain the price below $1,746. That could open the doors for a fall to the 20-day EMA. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/3ef3268b-fe80-48b9-8d82-7f17d754ed29.png\"><figcaption style=\"text-align: center;\"><em>ETH/USDT 4-hour chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AethUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The 20-EMA on the 4-hour chart is flattening out and the RSI is near the midpoint, indicating a range-bound action in the near term. The pair may continue to swing between $1,746 and $1,865 for some time.</p><p>If bulls kick the price above $1,812, the likelihood of a rally to the overhead resistance of $1,865 increases. On the other hand, if the price maintains below the 20-EMA, the bears will attempt to tug the pair below $1,746. If that happens, the short-term trend will turn bearish.</p><h2>Aptos (APT) price analysis</h2><p>Aptos (<a href=\"https://cointelegraph.com/aptos-apt-price-index\">APT</a>) rallied sharply in the past few days, indicating that the bulls are attempting to make a comeback.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/e5aff9f4-8760-4eb6-9955-5444517f84ce.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>APT/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The APT/USDT pair witnessed profit-booking near $7 but a minor positive is that the bulls did not give up much ground. This shows that every minor dip is being purchased. The bulls will again try to overcome the obstacle at $7. If they manage to do that, the pair may start its march toward $8.</p><p>Instead, if the price turns down from $7, it will suggest that the bears remain active at higher levels. The pair may then spend some more time inside a tight range between $7 and $6.20. A break below this support could signal the start of a deeper correction.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/0e286d65-f166-4ce7-9812-f9be5e81b425.png\"><figcaption style=\"text-align: center;\"><em>APT/USDT 4-hour chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AaptUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The pair has been finding support at the 20-EMA but the negative divergence on the RSI suggests that the bullish momentum may be slowing down. If the price breaks and sustains below the 20-EMA, it will indicate the start of a deeper correction to the 50-SMA. </p><p>This remains the key level to watch on the downside because if it cracks, the pair may slump to $5.80. On the upside, the bulls will have to thrust the price above $7.02 to indicate the start of the next leg of the recovery.</p><p><strong><em>Related: </em><a href=\"https://cointelegraph.com/news/ripple-ceo-criticizes-former-sec-chair-jay-clayton-comments\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ripple-ceo-criticizes-former-sec-chair-jay-clayton-comments/amp\"><em>Ripple CEO criticizes former SEC Chair Jay Clayton’s comments</em></a></strong></p><h2>Quant price analysis</h2><p>Quant (<a href=\"https://cointelegraph.com/quant-qnt-price-index\">QNT</a>) rose above the breakdown level of $95 on Oct. 23, indicating that the markets have rejected the lower levels. The buying continued and the bulls propelled the price above the downtrend line on Oct. 25. This signals a potential trend change. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/49df2f58-443f-45b4-83a4-0d3e40f8b436.png\"><figcaption style=\"text-align: center;\"><em>QNT/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The short-term bulls seem to be booking profits after the recent rally. That may pull the price down to the downtrend line. This is an important level to keep an eye on because a drop below it may suggest that the rise above the downtrend line may have been a bull trap.</p><p>On the contrary, if the price snaps back from the downtrend line, it will suggest that the bulls have flipped the level into support. If buyers clear the hurdle at $110, it will indicate the resumption of the rally to $120 and then to $128.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/bdbebc43-b88d-4465-9b8f-1a7127b95015.png\"><figcaption style=\"text-align: center;\"><em>QNT/USDT 4-hour chart. Source: </em><a href=\"https://www.tradingview.com/chart/jDQu9g33/?symbol=BINANCE%3AqntUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The 4-hour chart shows that the QNT/USDT pair is facing selling near $108. The bears pulled the price below the 20-EMA, indicating that the short-term traders are booking profits. If the price slips below $103, the pair may drop to $100.</p><p>Instead, if bulls sustain the price above the 20-EMA, it will suggest that lower levels continue to attract buyers. The bulls will then make one more attempt to drive the price above $110 and start the next leg of the up-move.</p><h2>THORChain price analysis</h2><p>THORChain (<a href=\"https://cointelegraph.com/thorchain-rune-price-index\">RUNE</a>) broke and closed above the overhead resistance of $2 on Oct. 23, completing a bullish inverse head and shoulders pattern.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/f4e6a892-a3ba-4010-9263-1333a9984538.png\"><figcaption style=\"text-align: center;\"><em>RUNE/USDT daily chart. Source: TradingView</em></figcaption></figure><p>Both moving averages are sloping up and the RSI is in the overbought zone indicating that bulls remain in command. However, in the short term, the RUNE/USDT pair may enter a minor correction or consolidation.</p><p>If the pair does not give up much ground from the current level, it will suggest that the bulls are holding on to their positions. That may improve the prospects of a rally to $3 and subsequently to the pattern target of $3.23. If bears want to prevent this uptrend, they will have to pull and sustain the price below $2.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/8b51324d-c1d3-4e45-8448-5c999a658f2d.png\"><figcaption style=\"text-align: center;\"><em>RUNE/USDT 4-hour chart. Source: </em><a href=\"https://www.tradingview.com/chart/jDQu9g33/?symbol=BINANCE%3AruneUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The pair has been in a strong uptrend with the bulls buying the dips to the 20-EMA. Although the upsloping moving averages indicate advantage to buyers, the negative divergence on the RSI suggests that the bullish momentum may be weakening.</p><p>If the price skids below the 20-EMA, it could tempt short-term traders to book profits. That could pull the price to the 50-SMA. </p><p>Contrarily, if the price rebounds off the 20-EMA with strength, it will signal that the sentiment remains positive. The bulls will then try to resume the up-move with a break and close above $2.57.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p>\n</p>\n                \n            "
  }
]