[
  {
    "source": "Cointelegraph",
    "date": "2024-02-23T04:31:54.000Z",
    "title": " Jack Dorsey’s Block posts 90% boost in Bitcoin gross profits ",
    "url": "https://cointelegraph.com/news/jack-dorsey-block-boost-in-bitcoin-gross-profits-q4-earnings",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZjQ2MDQ4ZGEtMTFhZS00NTFiLThjMWItYzk5OWYxZGU4YWQ2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Cash App generated $66 million in Bitcoin gross profit in Q4 2023, up 90% year-over-year.  </p>\n                    <p><p>Jack Dorsey-led payments firm Block earned $66 million in gross profit from selling Bitcoin through Cash App, increasing a whopping 90% from the prior year. </p><p>On Feb. 22, Block released its earnings <a href=\"https://s29.q4cdn.com/628966176/files/doc_financials/2023/q4/Block_4Q23_Shareholder-Letter_Block.pdf\" target=\"_blank\" rel=\"noopener nofollow\">report</a> for the fourth quarter, which saw the total sale amount of BTC sold to customers (shown as Bitcoin revenue) at $2.5 billion, up 37% year-over-year in Q4. </p><p>Full-year results paint a similar picture of growth, with Bitcoin revenue standing at $9.5 billion, up 34% year-on-year, while Bitcoin gross profit was up 31% to $205 million.</p><p><a href=\"https://cointelegraph.com/news/jack-dorsey-block-boost-in-bitcoin-gross-profits-q4-earnings\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-23T04:30:43.000Z",
    "title": "Reddit Embraces Crypto: IPO Filing Reveals Bitcoin, Ether Investments",
    "url": "https://news.bitcoin.com/reddit-embraces-crypto-ipo-filing-reveals-bitcoin-ether-investments/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/reddit-bitcoin-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Reddit Embraces Crypto: IPO Filing Reveals Bitcoin, Ether Investments\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/reddit-bitcoin-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/reddit-bitcoin-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/reddit-bitcoin-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/reddit-bitcoin-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/reddit-bitcoin-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/reddit-bitcoin-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/reddit-bitcoin.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Reddit Inc. has disclosed cryptocurrency investments in its initial public offering (IPO) filing with the U.S. Securities and Exchange Commission (SEC). The social media giant noted that as of the end of December last year, &#8220;we did not hold digital assets other than bitcoin and ether for treasury purposes, and our investment policy requires approval [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T04:26:00.000Z",
    "title": "Report: Weighing AI Pros and Cons in Healthcare",
    "url": "https://www.cryptopolitan.com/weighing-ai-pros-and-cons-in-healthcare/",
    "description": "Artificial Intelligence (AI) proposes a new way of conduct within the healthcare industry. The technology is revolutionizing medical diagnosis, treatment, and patient care. Its utility is also growing in administrative tasks within healthcare facilities. AI&#8217;s role in healthcare delivery is growing, and this calls for considerations of ethical, privacy, and social implications. How do we [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-23T04:28:45.000Z",
    "title": "ADA Price Reaches Key Juncture – Can Cardano Start A Fresh Surge?",
    "url": "https://www.newsbtc.com/analysis/ada/ada-price-reaches-key-juncture-555/",
    "description": "Cardano (ADA) is correcting gains from the $0.642 resistance zone. ADA could start a fresh rally if it stays above the $0.5550 support zone. ADA price is showing a few bearish signs below the $0.600 level. The price is trading above $0.5550 and the 100 simple moving average (4 hours). There was a break below a key bullish trend line with support at $0.610 on the 4-hour chart of the ADA/USD pair (data source from Kraken). The pair could attempt a fresh increase if the bulls remain active above the $0.570 support. Cardano Price Dips To Support After forming a base above the $0.520 level, Cardano started a fresh increase. ADA price was able to climb above the $0.555 and $0.565 resistance levels to move into a positive zone, like Bitcoin and Ethereum. The bulls pushed the pair above the $0.600 resistance zone. However, the bears were active near the $0.6420 resistance zone. A high was formed near $0.6419 and the price started a downside correction. There was a move below the $0.600 level. There was also a break below a key bullish trend line with support at $0.610 on the 4-hour chart of the ADA/USD pair. The price declined below the 23.6% Fib retracement level of the upward move from the $0.4718 swing low to the $0.6419 high. ADA price is now trading below $0.600 and the 100 simple moving average (4 hours). The bulls might remain active near the $0.5700 support or the 50% Fib retracement level of the upward move from the $0.4718 swing low to the $0.6419 high. Source: ADAUSD on TradingView.com On the upside, immediate resistance is near the $0.600 zone. The first resistance is near $0.612. The next key resistance might be $0.620. If there is a close above the $0.620 resistance, the price could start a strong rally. In the stated case, the price could rise toward the $0.642 region. Any more gains might call for a move toward $0.680. More Losses in ADA? If Cardano’s price fails to climb above the $0.600 resistance level, it could continue to move down. Immediate support on the downside is near the $0.570 level. The next major support is near the $0.5550 level. A downside break below the $0.5500 level could open the doors for a test of $0.5120. The next major support is near the $0.500 level. Technical Indicators 4 hours MACD – The MACD for ADA/USD is losing momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for ADA/USD is now below the 50 level. Major Support Levels – $0.570, $0.5550, and $0.5120. Major Resistance Levels – $0.600, $0.6120, and $0.6420."
  }
]