[
  {
    "source": "Cointelegraph",
    "date": "2023-09-11T22:09:50.000Z",
    "title": "Crypto companies form Texas blockchain group to advocate for clear regulations",
    "url": "https://cointelegraph.com/news/crypto-companies-form-texas-blockchain-group-advocate-clear-regulations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/bce178d4-a546-48e4-9c9a-8ed6745e6f95.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>a16z crypto, Coinbase, Ledger, Bain Capital Crypto, Blockchain Capital, and Paradigm joined to advocate for clear regulations.</p>\n                    <p><p>A group of crypto and blockchain firms joined together to create a Texas crypto advocacy group, according to a Sept. 11 announcement. The group is called “Crypto Freedom Alliance of Texas,” and is founded by a16z crypto, Coinbase, Ledger, Bain Capital Crypto, Blockchain Capital, and Paradigm. The group is promoting “the development of coherent and predictable regulations for digital assets in Texas.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#Crypto</a> Freedom Alliance of Texas Launches to Support Clear Digital ... - Business Wire <a href=\"https://t.co/kn9LdN5zj1\">https://t.co/kn9LdN5zj1</a> <a href=\"https://t.co/VzgqpEc0uC\">pic.twitter.com/VzgqpEc0uC</a></p>&mdash; Stock Market News (@Stock_Market_Pr) <a href=\"https://twitter.com/Stock_Market_Pr/status/1701236720954495249?ref_src=twsrc%5Etfw\">September 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>To further its goals, the Crypto Freedom Alliance will foster educational initiatives that will target government officials, corporations, non-profits, and other organizations in an effort to highlight the value of Web3 in the state of Texas, the announcement stated.</p><p>Cointelegraph met up with a16z crypto’s global head of policy, Brian Quintenz, at the Permissionless II conference in Austin to get further details on the new group. According to Quintenz, Texas is uniquely suited to become a haven for Web3 developers, but this necessitates forming an advocacy group to tackle issues in the state.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/riot-platforms-texas-energy-strategy-reduced-production-costs-31-million\"><strong>Riot Platforms says Texas energy strategy reduced production costs by $31M</strong></a></em></p><p>For example, Quintenz argued that decentralized autonomous organizations (DAOs) often need legal jurisdiction to operate. Texas is an attractive state, thanks to its adoption of the Uniform Code of Unincorporated Associations.</p><p>“Modifying the unincorporated association law that applies more generally to limited liability types of entities is a state issue, and there are only a few states that have adopted the Uniform Code of Unincorporated Associations […] Texas is one of them,” Quintenz stated.</p><p>However, small changes would need to be made to this code to allow DAOs to be recognized as legal entities:</p><blockquote>“One of the things we continue to try to do is to advocate and educate around creating a legal entity for DAOs that makes some changes to the unincorporated association framework but makes it more restrictive. We don’t want to just open it up to anybody and say ‘Oh, I’m a DAO.’ You can only really qualify for this if you’re a decentralized kind of organization.”</blockquote><p>In addition to advocating for changes to the unincorporated association laws, Quintenz said the group would also push for crypto-friendly tax laws, bank charter laws and bank regulations. He considered Wyoming’s bank charter laws to be “a positive example” of what can be accomplished by crypto-friendly legislatures.</p><p>Texas is a popular hub for crypto mining in the U.S. Genesis Digital Assets <a href=\"https://cointelegraph.com/news/genesis-digital-assets-opens-three-new-facilities-south-carolina-us-expansion\">bases most of its CPUs</a> in Texas. On July 3, crypto mining firm Hut8 also <a href=\"https://cointelegraph.com/news/hut8-relocates-6-400-rigs-sees-growth-in-ai-high-performance-computing\">moved 6,400 mining computers</a> to the state.</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-11T22:10:40.000Z",
    "title": "Meta reportedly building new AI model to compete against OpenAI’s ChatGPT",
    "url": "https://cryptoslate.com/meta-reportedly-building-a-new-ai-model-to-compete-against-openais-chatgpt/",
    "description": "<p>Meta, formerly Facebook, is developing a new artificial intelligence (AI) model to compete with OpenAI, the Wall Street Journal said on Sept. 10. According to that report, Meta intends for its new AI model to be several times more powerful than its current model, Llama 2. The company also expects that the new model will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/meta-reportedly-building-a-new-ai-model-to-compete-against-openais-chatgpt/\">Meta reportedly building new AI model to compete against OpenAI&#8217;s ChatGPT</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-11T22:33:00.000Z",
    "title": "$XRP Price Could Hit $500, Predicts Popular Analyst Citing Ripple’s $250 Trillion Cross-Border Report",
    "url": "https://www.cryptoglobe.com/latest/2023/09/xrp-price-could-hit-500-predicts-popular-analyst-citing-ripples-250-trillion-cross-border-report/",
    "description": " Shannon Thorpe, a Business Support Manager at Wells Fargo and a popular financial expert, has recently revealed she believes that price of the native token of the XRP Ledger, $XRP, could be trading at $500 in the future. Thorpe’s prediction is based on Ripple managing to take over cross-border payments using its XRP-powered solutions, which, […]\n"
  }
]