[
  {
    "source": "Crypto Briefing",
    "date": "2023-12-08T00:56:46.000Z",
    "title": "Robinhood enters EU crypto market, embracing regulatory clarity",
    "url": "https://cryptobriefing.com/robinhood-enters-eu-crypto-market-embracing-regulatory-clarity/?utm_source=feed&utm_medium=rss",
    "description": "Seeking more crypto-friendly shores, Robinhood launches its services in the EU, capitalizing on MiCA's potential for smoother operations."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-08T00:53:09.000Z",
    "title": "Bitcoin community clashes over censorship and privacy tools",
    "url": "https://cryptobriefing.com/bitcoin-community-clashes-over-censorship-and-privacy-tools/?utm_source=feed&utm_medium=rss",
    "description": "Amid accusations, Bitcoin developer DashJr refutes claims of censorship in sparking a back-and-forth exchange with Samourai Wallet."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-08T01:00:17.000Z",
    "title": "JPMorgan CEO Jamie Dimon Says He’d Close Crypto Down if He Were the Government",
    "url": "https://news.bitcoin.com/jpmorgan-ceo-jamie-dimon-says-hed-close-crypto-down-if-he-were-the-government/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/jamie-dimon-bitcoin-close-down-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/jamie-dimon-bitcoin-close-down-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/jamie-dimon-bitcoin-close-down-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/jamie-dimon-bitcoin-close-down-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/jamie-dimon-bitcoin-close-down-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/jamie-dimon-bitcoin-close-down-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/jamie-dimon-bitcoin-close-down-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/jamie-dimon-bitcoin-close-down.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />JPMorgan Chase CEO Jamie Dimon told U.S. senators in a congressional hearing that he would close down crypto if he were the government. Emphasizing that he has always been &#8220;deeply opposed&#8221; to crypto and bitcoin, the executive stressed that the true use case of crypto is criminals, drug traffickers, money laundering, and tax avoidance. Jamie [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-08T01:08:05.000Z",
    "title": "Solana’s Kamino Finance introduces points program, eyeing future token airdrop",
    "url": "https://www.cryptopolitan.com/kamino-finance-introduces-points-program/",
    "description": "Solana&#8217;s burgeoning decentralized finance (DeFi) sector is witnessing significant growth, largely propelled by Kamino Finance, its fastest-developing protocol. The recent announcement of a points program by Kamino Finance marks a strategic move, potentially laying the groundwork for a future token airdrop. This development comes as the Solana network experiences a robust resurgence, with its SOL ... <a title=\"Solana&#8217;s Kamino Finance introduces points program, eyeing future token airdrop\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kamino-finance-introduces-points-program/\" aria-label=\"More on Solana&#8217;s Kamino Finance introduces points program, eyeing future token airdrop\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-12-08T00:43:49.000Z",
    "title": "Cardano’s ADA Market Value Surges, Nearing Yearly High, Hitting Major Market Cap Milestone ",
    "url": "https://nulltx.com/cardanos-ada-market-value-surges-nearing-yearly-high-hitting-major-market-cap-milestone/",
    "description": "Over the last 24 hours, Cardano&#8217;s native cryptocurrency, ADA, has experienced a remarkable surge, witnessing an impressive increase in market capitalization exceeding $1 billion. This surge has propelled Cardano to a total market capitalization of $15.83 billion, solidifying its position as the 8th-largest cryptocurrency according to CoinMarketCap. In this recent [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-08T01:00:56.000Z",
    "title": "Sam Altman-Backed Crypto Startup Looks To Secure $100 Million For Bitcoin Private Credit Fund",
    "url": "https://www.newsbtc.com/bitcoin-news/sam-altman-backed-crypto-startup-looks-to-secure-100-million-for-bitcoin-private-credit-fund/",
    "description": "Meanwhile Advisors, a crypto startup backed by the American entrepreneur Sam Altman, has announced plans to raise $100 million for a Bitcoin (BTC) private credit fund.  The fund, known as Meanwhile Private Credit Fund aims to provide institutional investors with access to BTC while targeting an additional 5% yield denominated in the cryptocurrency. Bitcoin Rally Sparks Launch Of Meanwhile Advisors Fund According to a report by The Block, Meanwhile Advisors has launched the fund as Bitcoin continues its recent rally, with prices currently falling from the $44,000 level down to the $43,200 mark.  Zac Townsend, the co-founder and CEO of Meanwhile Group, stated that the belief is that Bitcoin will appreciate significantly in the future, and the fund offers investors a unique opportunity to increase their exposure to digital assets. Related Reading: Solana Ascending Triangle Formation Anticipates Price Surge, $90 Target In Sight The Meanwhile BTC Private Credit Fund adopts a single-close, closed-end structure. Participating limited partners (LPs) will contribute US dollars to the fund, which will be immediately converted to Bitcoin following the single close.  Meanwhile will lend this BTC to borrowers to generate the targeted 5% return in Bitcoin. This structure allows LPs to accumulate more Bitcoin if its price appreciates during the fund&#8217;s lifecycle without requiring additional principal investment. Townsend mentioned that the minimum investment amount per LP is $250,000, with no maximum limit. The fund&#8217;s investment period spans three years, followed by a four-year harvest period, resulting in a total term of seven years.  However, capital is returned to investors during harvest, meaning a significant portion of the invested capital may be returned well before the seven-year mark. Innovative Fee Approach?  Per the report, the Meanwhile BTC Private Credit Fund charges a 2% management fee and a 20% carried interest fee, both in Bitcoin. The carried interest fee only applies when the LP&#8217;s Bitcoin holdings are increased.  This fee structure ensures that if Bitcoin experiences substantial price appreciation, Meanwhile does not benefit from the price appreciation itself but rather from generating more Bitcoin for the LPs. Addressing concerns about risk management, Townsend highlighted that the closed structure of the fund eliminates the risk of a &#8220;bank run&#8221; scenario that can lead to insolvency. Moreover, the fund focuses on making conservative loans to “creditworthy institutional borrowers”, mitigating risks associated with lending to retail investors at higher rates. Related Reading: Why Bitcoin’s Staggering 260% YTD Surge Could Be Just The Start The Block also reported that Anchorage Digital serves as the fund&#8217;s custodian. Meanwhile Group&#8217;s insurance unit has previously launched a Bitcoin-denominated life insurance policy, and Townsend mentioned plans to introduce an accidental death coverage policy in Bitcoin as well. When writing, the leading cryptocurrency in the market is trading at $43,200, marking a decrease of nearly 2% within the last 24 hours. This decline follows an unsuccessful attempt to solidify its position above the significant $44,000 milestone.  Nevertheless, Bitcoin has managed to maintain a 14% increase over the past seven days and is currently holding strong at the support level of $43,000, as it sets its sights on achieving a new annual peak. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-08T01:00:26.000Z",
    "title": "Massive Uptick in Exchange Volumes Could Suggest Growing Institutional Demand Ahead of ETF Approval: Glassnode",
    "url": "https://dailyhodl.com/2023/12/07/massive-uptick-in-exchange-volumes-could-suggest-growing-institutional-demand-ahead-of-etf-approval-glassnode/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/massive-uptick-ahead-etf.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/massive-uptick-ahead-etf.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/12/massive-uptick-ahead-etf.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/massive-uptick-ahead-etf.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/massive-uptick-ahead-etf.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/massive-uptick-ahead-etf.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/12/massive-uptick-ahead-etf.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A massive surge in crypto exchange flows suggests institutions could be preparing for the potential approval of spot market Bitcoin (BTC) exchange-traded funds (ETFs), according to the market intelligence firm Glassnode. Glassnode notes in a new analysis report that the 30-day simple moving average (SMA) of Bitcoin flows in and out of exchanges grew from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/07/massive-uptick-in-exchange-volumes-could-suggest-growing-institutional-demand-ahead-of-etf-approval-glassnode/\">Massive Uptick in Exchange Volumes Could Suggest Growing Institutional Demand Ahead of ETF Approval: Glassnode</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]