[
  {
    "source": "CoinDesk",
    "date": "2023-10-10T19:23:24.000Z",
    "title": "BlockFi Bankruptcy Judge Says He Wants 3AC’s $284M Claim Resolved in Mediation",
    "url": "https://www.coindesk.com/policy/2023/10/10/blockfi-bankruptcy-judge-says-he-wants-3acs-284m-claim-resolved-in-mediation/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Failed crypto hedge fund Three Arrows Capital’s (3AC) attempt to pursue a $284 million claim against crypto lender BlockFi was put into mediation by the U.S. bankruptcy judge overseeing BlockFi’s case."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-10T19:18:05.000Z",
    "title": "Protocol Village: Spark Protocol Expands Beyond Ethereum to Gnosis",
    "url": "https://www.coindesk.com/tech/2023/10/09/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the week of Oct. 9-15, with live updates throughout."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-10T19:30:00.000Z",
    "title": "FTX co-founder Wang discusses plea deal, knowledge of financial concepts at SBF trial",
    "url": "https://cointelegraph.com/news/ftx-co-founder-wang-plea-deal-knowledge-financial-concepts-sbf-trial",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/f00ef9f6-db85-44a9-9c68-b1b8fd763a0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In the final day of his testimony, FTX co-founder Wang discussed talking to the feds and his interpretation of the “FTX is fine” tweet.</p>\n                    <p><p>Day 6 of the trial of Sam Bankman-Fried saw the conclusion of former FTX chief technology officer Gary Wang’s testimony and the beginning of former Alameda Research CEO Caroline Ellison’s. Wang testified about his plea deal, among other things.</p><p>According to Inner City Press on X (formerly Twitter), Assistant United States Attorney Nicolas Roos asked Wang, “At your first meeting with the government, did you admit to committing crimes with the defendant?” Wang replied that he did.</p><p>“What were you told to do?” Roos asked. </p><p>“To tell the truth or not get a 5K letter, or worse,” Wang replied. </p><p>“5K letter” refers to a motion filed by the government under <a href=\"https://www.ussc.gov/guidelines/2015-guidelines-manual/archive/2014-chapter-5#5k11\" target=\"_blank\" rel=\"noopener nofollow\">Section 5K1.1</a> of the U.S. Sentencing Guidelines, which is the policy statement on “substantial assistance to authorities.” It allows the government to make “the appropriate reduction” to a sentence in consideration for a variety of forms of cooperation.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/caroline-ellison-testifies-sam-bankman-fried-trial\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/caroline-ellison-testifies-sam-bankman-fried-trial/amp\">Caroline Ellison blames Sam Bankman-Fried for misuse of FTX user funds at trial</a></em></strong></p><p>U.S. Attorney for the Southern District of New York Damian Williams <a href=\"https://twitter.com/SDNYnews/status/1605745361842327552?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1605745361842327552%7Ctwgr%5Ef69fced2b53dcf17fc42c62b4b14bac8c167cd29%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fcointelegraph.com%2Fnews%2Fcaroline-ellison-gary-wang-plead-guilty-to-fraud-charges\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> on Dec. 21 that charges were filed against Wang and Ellison “in connection with their roles in the fraud that contributed to FTX’s collapse.” The two <a href=\"https://cointelegraph.com/news/caroline-ellison-gary-wang-plead-guilty-to-fraud-charges\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/caroline-ellison-gary-wang-plead-guilty-to-fraud-charges/amp\">had pleaded guilty to the charges</a> and were cooperating with the government’s investigation. </p><p>Roos noted that Wang pleaded guilty to four charges, including conspiracy charges. “With who” did he conspire, Roos asked. “With Sam, [former FTX engineering director] Nishad [Singh] and Caroline,” Wang said.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Live tweeting of Ellison testimony will resume at 2 pm, here. Inner CIty Press is covering the case <a href=\"https://t.co/jsd2LKKf7U\">https://t.co/jsd2LKKf7U</a> & <a href=\"https://t.co/cGS6liUb3n\">https://t.co/cGS6liUb3n</a> and fillings: <a href=\"https://t.co/Sm5clS6qXb\">https://t.co/Sm5clS6qXb</a>  Watch this feed - at 2 pm and beyond...</p>— Inner City Press (@innercitypress) <a href=\"https://twitter.com/innercitypress/status/1711785793012761014?ref_src=twsrc%5Etfw\">October 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to another account of the trial, Wang <a href=\"https://twitter.com/alexiskweed/status/1711796353095860573\" target=\"_blank\" rel=\"noopener nofollow\">said</a> he met with government officials 18 times. The first two meetings were with agents of Justice Department, Federal Bureau of Investigation, Securities and Exchange Commission and Consumer Financial Protection Bureau, and he told them that Bankman-Fried’s Nov. 7 tweet, “FTX is fine. Assets are fine,” was true. </p><p>Wang testified that later he said that the tweet was true but misleading. It was not possible to liquidate the exchange’s FTT tokens, as a sale of that magnitude would cause the token’s price to fall, he said.</p><p>Earlier, Bankman-Fried's defense attorney had asked Wang, “Do you know the difference between solvency and liquidity?” Wang responded that he did. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\">Deposit risk: What do crypto exchanges really do with your money?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-10T19:28:56.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Binance freezes Hamas-linked accounts after Israeli request, Sam “SBF” Bankman-Fried’s legal team seeks permission to cross-examine Gary Wang over FTX lawyers’ involvement in Alameda loan approvals. And a Bitcoin developer has proposed a way to bring more expressive off-chain smart contracts to Bitcoin.</p><h2>Binance freezes Hamas-linked accounts after Israeli request</h2><p>Binance has frozen accounts linked to Hamas militants, according to the company’s co-founder Yi He. </p><p>This move comes in response to a request from Israeli law enforcement authorities. According to Yi He:</p><blockquote>“Hamas is a designated terrorist organization by the United Nations. Therefore, any organization, including banks and trading platforms, will need to cooperate on the receipt of freeze requests. This is not something Binance can decide on its own.“</blockquote><p>The company co-founder also added that “Palestine has an organized government. Hamas is a local militant group. They kill civilians; that’s the problem. Hamas is not Palestine; the freeze is targeted towards Hamas, not Palestine.“</p><p>They also issued assurances that <a href=\"https://cointelegraph.com/news/binance-freezes-hamas-linked-accounts-israeli-request\">the freeze would only affect Hamas-linked accounts</a>. With “ordinary civilian accounts” being unaffected. </p><h3>SBF seeks to probe FTX lawyers’ roles in $200 million Alameda loans</h3><p>SBF’s legal team is looking for permission to probe the alleged involvement of FTX lawyers in the issuance of $200 million worth of loans from Alameda that were approved by Gary Wang.</p><p>As previously reported in the build-up to the highly anticipated trial, an Oct. 1 court ruling provisionally barred SBF from apportioning blame to FTX lawyers who were allegedly involved in structuring and approving loans between Alameda and FTX.</p><p>United States Judge Lewis Kaplan granted the government’s motion and ruled that Bankman-Fried’s legal team would have to request permission to make any mention of FTX lawyers’ involvement throughout the trial.</p><p>SBF’s attorneys argue that the prosecution has already established that FTX lawyers were present and involved in structuring and executing the loans and intend to carry out their own line of questioning over the scope of FTX counsel involvement.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/5d090db4-9419-48fc-b513-26a43cd1c99f.png\"  /></figure><p>The defense adds that it could potentially introduce promissory notes that memorialized the loans to Wang, who has previously indicated to the prosecution in proffer meetings that he did not suspect FTX lawyers would coerce him to sign illegal agreements.</p><h3>Bitcoiner drops BitVM paper: ‘Compute anything on Bitcoin’</h3><p>A Bitcoin developer has made waves among the crypto community after proposing a new way to bring more expressive <a href=\"https://cointelegraph.com/news/bitcoin-bitvm-whitepaper-computation-smart-contracts\">off-chain smart contracts to Bitcoin</a>.</p><p>Announced in an Oct.9 white paper <a href=\"https://bitvm.org/bitvm.pdf\" target=\"_blank\" rel=\"noopener nofollow\">titled</a> “BitVM: Compute Anything on Bitcoin” by ZeroSync’s project lead Robin Linus, BitVM enables Turing-complete Bitcoin contracts without altering Bitcoin’s consensus rules.</p><p>Linus explained that Bitcoin, in its current form, is limited to basic operations, such as signatures, timelocks and hashlocks, but that can now be broadened with BitVM, which Linus says can compute a host of interesting applications.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BitVM: Everything you need to know (and more...)<br><br>BitVM is a new Optimistic Roll Up + Fraud Proof + Taproot Leaf + Bitcoin Script computing paradigm designed by Robin Linus at Zero Sync. They published an excellent white paper this morning reviewed by Super Testnet and Sam Parker… <a href=\"https://t.co/9rjIZZrSSI\">pic.twitter.com/9rjIZZrSSI</a></p>&mdash; Bob Bodily, PhD  | #BTC #ETH #ICP (@BobBodily) <a href=\"https://twitter.com/BobBodily/status/1711581484254192013?ref_src=twsrc%5Etfw\">October 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“Potential applications include games like Chess, Go, or Poker and particularly, verification of validity proofs in Bitcoin contracts.”</p><p>Many Bitcoiners appeared impressed with the proposal, though others say the proof is in the pudding when it comes to implementation. </p><p>Prominent Bitcoiner Eric Wall posted on X (formerly Twitter) that the concepts outlined in the BitVM white paper “check out” and is “cautiously excited” to see what real-world experiments stem from it.</p><p>Adam Back, a Bitcoin Core contributor, <a href=\"https://x.com/adam3us/status/1711416337975652841\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> that people shouldn’t get too excited about the development as it is “effectively a generalization of a two-party game.” </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  }
]