[
  {
    "source": "CoinDesk",
    "date": "2023-07-26T20:57:09.000Z",
    "title": "Private Banking Firm With $14B Assets Starts First Crypto Fund of Spain",
    "url": "https://www.coindesk.com/business/2023/07/26/private-banking-firm-with-14b-assets-starts-first-crypto-fund-of-spain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The fund will be accessible to professional investors only and will be audited by PwC."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-26T20:52:47.000Z",
    "title": "RFK Jr. Confirms Bitcoin Purchases",
    "url": "https://www.coindesk.com/business/2023/07/26/rfk-jr-confirms-bitcoin-purchases/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. presidential candidate said her purchased two bitcoin for each of his seven children."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-26T21:01:57.000Z",
    "title": "Accusations of a Government Cover-Up Dominate Congressional UFO Hearing",
    "url": "https://decrypt.co/150243/ufo-hearing-evidence-cover-up-whistleblower-crypto-tokens",
    "description": "Witnesses claim there is first-hand evidence of the existence—and possession—of alien spacecraft."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-26T21:00:17.000Z",
    "title": "Federal Reserve resumes rate hikes at FOMC meeting, bringing federal funds rate to 22-year high",
    "url": "https://cryptoslate.com/federal-reserve-resumes-rate-hikes-at-fomc-meeting-bringing-federal-funds-rate-to-22-year-high/",
    "description": "<p>The Federal Reserve has escalated interest rates to a range of 5.25 to 5.5%, marking the highest level since 2001. This action is part of its strategy to reduce the target inflation rate to 2%. At the press conference following the meeting, Jerome Powell, the Chair of the Federal Reserve, reiterated familiar themes on viewing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/federal-reserve-resumes-rate-hikes-at-fomc-meeting-bringing-federal-funds-rate-to-22-year-high/\">Federal Reserve resumes rate hikes at FOMC meeting, bringing federal funds rate to 22-year high</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-26T21:04:11.000Z",
    "title": "Aethir Completes $150M Valuation Pre-A Funding Round",
    "url": "https://cryptobriefing.com/aethir-completes-150m-valuation/?utm_source=feed&utm_medium=rss",
    "description": "Singapore-based Aethir has completed its Pre-A funding round, raising over $9 million, with its valuation reaching $150 million, the company announced on July 27 to Crypto Briefing. Aethir, a frontrunner..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T20:54:29.000Z",
    "title": "Here are the crypto affairs of the day – What happened?",
    "url": "https://www.cryptopolitan.com/here-are-the-crypto-affairs-of-the-day/",
    "description": "Need to know what transpired today in crypto? Here is the most recent news regarding daily trends and events affecting the Bitcoin price, blockchain, DeFi, NFTs, Web3, and crypto regulation. According to a recent survey conducted by the CFA Institute, investment professionals in emergent markets and developed markets are divided on the concept of a ... <a title=\"Here are the crypto affairs of the day &#8211; What happened?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/here-are-the-crypto-affairs-of-the-day/\" aria-label=\"More on Here are the crypto affairs of the day &#8211; What happened?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T20:47:44.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here&#8217;s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-26T21:03:37.000Z",
    "title": "Breaking: CoinsPaid targeted in $37.3 million hack",
    "url": "https://crypto.news/breaking-coinspaid-targeted-in-37-3-million-hack/",
    "description": "CoinsPaid, an Estonia-based crypto payment provider, was hacked and lost $37.3 million on July 22"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-26T21:00:34.000Z",
    "title": "Avalanche Foundation Commits $50 Million To Tokenized Asset Purchases",
    "url": "https://www.newsbtc.com/avalanche/avalanche-foundation-commits-50-million-to-tokenized-asset-purchases/",
    "description": "The Avalanche (AVAX) Foundation has launched a $50 million initiative, called Avalanche Vista, to pioneer the future of asset tokenization.  According to the announcement, the foundation will allocate the funds to purchase tokenized assets, often referred to as “real world assets” or “off-chain assets,” minted on the Avalanche blockchain.  KKR Fund Tokenization On AVAX The goal of the program is to support and demonstrate the value of tokenization, the process of creating an on-chain digital representation of an asset, item, or thing. Avalanche&#8217;s consensus mechanism, subnet architecture, and technical innovation aim to facilitate tokenization with greater speed, scalability, and customizability. Furthermore, Avalanche Vista will consider assets across the full liquidity spectrum, including equity, credit, real estate, commodities, as well as those that are blockchain-native.  Related Reading: Singaporean Judge Declares Crypto Is Personal Property In ByBit Case The initiative aims to demonstrate the merits of applying blockchain rails to historically more manual and operationally-intensive use cases, including asset issuance, settlement, transfer, and administration. The initiative follows major milestones in asset tokenization, including Securitize&#8217;s tokenization of an interest in a flagship KKR fund on the Avalanche blockchain, marking the first time exposure to one of KKR’s alternative investment strategies had been offered in a digital format in the U.S. Avalanche Vista aims to accelerate the growth of tokenization and its role in on-chain finance (“OnFi”) by unlocking broader access to private market investing.  Historically, investments in private markets have been primarily reserved for large institutional investors and ultra-high-net-worth individuals. The initiative aims to enable technologies that create significant efficiencies in these processes and improve the asset issuer and investor experience. According to a report by Security Token Advisors, 77% of capital markets participants believe traditional securities will be digitized within 5-10 years, and the size of the tokenized securities market alone is expected to grow to $20 trillion by the end of 2030.  With Avalanche Vista, the Avalanche Foundation is taking a big leap forward toward realizing this future. Avalanche Network Set To Unlock New Frontiers? Tokenization is a powerful technology with a wide range of potential use cases on the Avalanche network.  One of the key applications of tokenization is in the real estate industry, where it can be used to represent ownership in real estate assets. By creating digital tokens that represent fractional ownership in a property, it becomes easier to buy and sell these assets, which can be particularly useful in the context of large commercial properties or high-value residential properties. Related Reading: Maker (MKR) Shows Positive Moves As Top Coins Land In The Red Another area where tokenization can have a significant impact is finance. By representing financial assets such as stocks, bonds, and other securities as digital tokens on the blockchain, it becomes easier to trade and settle these assets securely and transparently.  Tokenization can also be used for identity verification, allowing for the secure storage and transfer of digital identities. This has the potential to reduce the need for central authorities in the verification process, making verifying identities easier and more efficient. Other potential applications of tokenization on the Avalanche network include art and collectibles, renewable energy, and charity and non-profit organizations. As the technology continues to develop, it can be expected to have more innovative use cases, transforming a wide range of industries and applications. Despite the potential for tokenization on the Avalanche network, the price of AVAX has remained relatively stagnant over the past few days. Over this period, AVAX has been trading within a narrow range of $13.10 to $13.53.  As of now, AVAX is trading at $13.18, which represents a decline of 1.2% over the past 24 hours and more than 5% over the past seven days. Featured image from Unsplash, chart from TradingView.com"
  }
]