[
  {
    "source": "Cointelegraph",
    "date": "2023-08-29T13:05:38.000Z",
    "title": "Indian crypto exchanges CoinSwitch, CoinDCX cut staff amid market slump",
    "url": "https://cointelegraph.com/news/coinswitch-coindcx-indian-crypto-exchanges-coin-switch-coin-dcx-cut-staff-amid-bear-market",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/7c2fdc29-c388-4ef3-9219-1240965bb8e6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Indian crypto exchanges like CoinSwitch and CoinDCX have been struggling to maintain headcount amid bear market and TDS.</p>\n                    <p><p>CoinSwitch crypto exchange is the latest crypto trading platform in India that cut its workforce amid the prolonged cryptocurrency winter, the local news agency Moneycontrol <a href=\"https://www.moneycontrol.com/europe/?url=https://www.moneycontrol.com/news/business/startup/coinswitch-lays-off-44-employees-in-customer-support-team-cites-role-redundancy-11272911.html\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on Aug. 28.</p><p>The Indian crypto exchange has reportedly laid off 44 employees from its customer support division in August, citing redundancy in roles amid the bear market-triggered lack of customer queries.</p><p>“We continuously evaluate our business to stay competitive, prioritizing innovation, value, and service for our customers. To that end, we right-sized our customer support team to align with the present volume of customer queries on our platform,” CoinSwitch said. The firm added that this impacted the roles of 44 members of its support team, who “voluntarily resigned from their roles after a detailed discussion with their managers.”</p><p>44 employees account for a significant share — or roughly 8% — of CoinSwitch’s total headcount. According to CoinSwitch’s LinkedIn page, the firm <a href=\"https://www.linkedin.com/company/coinswitch/?originalSubdomain=in\" target=\"_blank\" rel=\"noopener nofollow\">has</a> 519 employees at the time of writing. The firm didn’t immediately respond to Cointelegraph’s request to comment.</p><p>The news about CoinSwitch’s layoffs came just about a week after another major local exchange, CoinDCX, also cut its staff by 12%. According to LinkedIn, the firm <a href=\"https://www.linkedin.com/company/coindcx/?originalSubdomain=in\" target=\"_blank\" rel=\"noopener nofollow\">employs</a> 730 people at the time of writing.</p><p>“We are making the difficult decision to reduce the size of our team by about 12% and some of our incredibly talented team members will be parting ways with the organization,” CoinDCX co-founders Sumit Gupta and Neeraj Khandelwal <a href=\"https://info.coindcx.com/announcement/a-tough-decision-for-a-brighter-future-coindcx/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> on Aug. 22.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/india-modi-global-cryptocurrency-framework-g20-summit\"><strong><em>Indian PM Modi calls for global cryptocurrency framework at G20 Summit</em></strong></a></p><p>CoinDCX founders also referred to market challenges, adding that domestic exchanges have also encountered the impact of the 1% tax deducted at source (TDS), which targets local crypto exchanges. They wrote:</p><blockquote>“These factors had a significant impact on our volumes and thus revenues. To adapt, we undertook several proactive measures, including direct cost optimization and investment in automation to drive efficiency and productivity.”</blockquote><p>According to the announcement, the impacted CoinDCX employees were promised to receive a support package of severance pay equivalent to the full notice period, additional one month of salary, extension of health insurance and other support.</p><p>As previously reported, <a href=\"https://cointelegraph.com/news/30-crypto-tax-becomes-law-in-india-following-finance-bill-approval\">India imposed a 30% tax on crypto gains</a> in 2022, which resulted in a <a href=\"https://cointelegraph.com/news/brain-drain-india-s-crypto-tax-forces-budding-crypto-projects-to-move\">massive exodus</a> of cryptocurrency service providers and a <a href=\"https://cointelegraph.com/news/indian-crypto-exchanges-volume-plunges-down-as-30-tax-goes-into-effect\">sharp decline</a> in crypto trading activity. The country has also adopted a 1% TDS by crypto exchanges, meaning that exchanges are obliged to pay 1% on all transfers of crypto assets.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/recursive-inscriptions-bitcoin-supercomputer-defi-aws-possible/\"><strong><em>Recursive inscriptions — Bitcoin ‘supercomputer’ and BTC DeFi coming soon</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-08-29T13:05:38.000Z",
    "title": "Indian crypto exchanges CoinSwitch, CoinDCX cut staff amid market slump",
    "url": "https://cointelegraph.com/news/coinswitch-coindcx-indian-crypto-exchanges-coin-switch-coin-dcx-cut-staff-amid-bear-market",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/7c2fdc29-c388-4ef3-9219-1240965bb8e6.jpg\"></p><p>Indian crypto exchanges like CoinSwitch and CoinDCX have been struggling to maintain headcount amid bear market and TDS.</p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-29T13:00:00.000Z",
    "title": "\n                        Ronaldinho’s Crypto Controversy: Soccer Star Misses Scam Hearing\n                    ",
    "url": "https://cryptodaily.co.uk/2023/08/ronaldinhos-crypto-controversy-soccer-star-misses-scam-hearing",
    "description": "\n                        <p dir=\"ltr\">Brazilian football legend Ronaldinho Ga&uacute;cho is embroiled in a cryptocurrency scandal, facing potential detention due to his alleged involvement in a pyramid scheme.&nbsp;</p>\nMissed Testimony and Legal Implications\n<p dir=\"ltr\">The former football star's iconic status reportedly led to financial losses for numerous investors. As a result, he was summoned by the Brazilian Chamber of Deputies&rsquo; Financial Pyramids Committee to testify on August 24 regarding his alleged association with the companies 18kRonaldinho and LBLV.&nbsp;</p>\n<p dir=\"ltr\">However, adverse weather conditions disrupted his travel plans, resulting in the cancellation of flights to the hearing's location in Porto Alegre.</p>\n<p dir=\"ltr\">The committee has granted Ronaldinho another chance to testify, rescheduling the hearing for August 31. If he fails to appear again, authorities have warned that law enforcement agents could take more drastic measures.</p>\nKey Players and Allegations\n<p dir=\"ltr\">Other than the former football player, the investigators are also looking into his brother Assis and business partner Marcelo Lara in their involvement in the venture. The firm, 18kRonaldinho, has been accused of orchestrating a cryptocurrency scam reminiscent of a pyramid scheme by allegedly promising daily returns exceeding 2%.&nbsp;</p>\n<p dir=\"ltr\">The company lured investors to commit at least $30 worth of cryptocurrency. These investors are now demanding approximately 300 million reais or $61 million for the damages incurred. They claim the venture deceived them through false promises and illegitimate use of Ronaldinho's name and image.</p>\nAmbassador or Accomplice?\n<p dir=\"ltr\">Despite the allegations, Ronaldinho is maintaining his innocence in the matter. His legal team has contended that he was merely an \"ambassador\" for the company, asserting that his name and image were exploited without proper authorization. They argue that he was also a victim of the fraudulent operation, similar to many investors.</p>\n<p dir=\"ltr\">Despite Assis' claims that Ronaldinho has cooperated with investigations and provided clarifications to the nation's Public Ministry, lawmakers remain skeptical. They insist that Ronaldinho must testify in person to provide a firsthand account of his involvement.</p>\n<p dir=\"ltr\">However, this isn't the first legal issue Ronaldinho has faced. In 2020, he and his brother Assis were arrested in Paraguay for using forged passports. This incident, combined with Assis' involvement in the ongoing cryptocurrency investigation, raises questions about their credibility.</p>\n<p dir=\"ltr\">As the rescheduled hearing approaches, Ronaldinho's fate hangs in the balance. The authorities will scrutinize the football star's credibility and alleged role in the cryptocurrency scandal. Investors and fans alike await further developments in this unfolding controversy.</p>\n<p dir=\"ltr\">Many other football players and sportsperson have hitched their wagons to several crypto projects. Ronaldinho himself has several other projects brewing in the space.&nbsp;</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T12:42:47.000Z",
    "title": "AI’s Job Disruption Sparks Calls for Control and Regulation",
    "url": "https://www.cryptopolitan.com/ais-job-disruption-calls-control-regulation/",
    "description": "In an era dominated by rapid technological advancements, the conventional wisdom that artificial intelligence (AI) wouldn&#8217;t result in substantial job losses is being challenged by mounting evidence. Despite historical precedents of automation leading to job creation, the unique nature of AI&#8217;s impact on service-based economies has experts warning that it might subtract jobs without generating ... <a title=\"AI&#8217;s Job Disruption Sparks Calls for Control and Regulation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ais-job-disruption-calls-control-regulation/\" aria-label=\"More on AI&#8217;s Job Disruption Sparks Calls for Control and Regulation\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-29T13:02:35.000Z",
    "title": "Intrinsic and extrinsic value in options trading",
    "url": "https://crypto.news/intrinsic-and-extrinsic-value-in-options-trading/",
    "description": "This article outlines intrinsic vs. extrinsic value, covers calculations, strategies, and tips for profiting through options trading using these concepts"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-29T12:58:23.000Z",
    "title": "German hosting stored in NATO bunker confronts TornadoCash-like verdict",
    "url": "https://crypto.news/german-hosting-stored-in-nato-bunker-confronts-tornadocash-like-verdict/",
    "description": "CyberBunker, a German web hosting firm previously housed in a NATO bunker, appeals its controversial conviction for facilitating illicit transactions. Back in December 2021, eight people involved with Cyberbunker were sentenced despite the prosecutors being unable to prove that they&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-29T13:00:01.000Z",
    "title": "DYDX Is Up By 11% In A Week, But Investors Must Watch Out For This Event",
    "url": "https://www.newsbtc.com/news/defi/dydx-up-by-11-but-investors-must-watch-out-for-this-event/",
    "description": "DYDX, the native token of a decentralized exchange (DEX) with the same name, has been on a good run in the past few days. According to CoinGecko data, the cryptocurrency’s price jumped by 10.7% in the past week, reflecting a positive performance after an unfavorable start to August. However, there has been rising concern that this spurt of bullish momentum may be short-lived. And the upcoming token unlock event is the primary source of this skepticism. dYdX To Unlock $13.8 Million Worth Of Token In Single Event Token unlock events are not a strange phenomenon in the cryptocurrency space, as many blockchain networks and decentralized finance (DeFi) protocols have a portion of their token supply locked &#8211; to be released periodically. DYDX is one of those tokens with a locked supply and its next token unlock event is happening on Tuesday, August 29. In the latest iteration, the decentralized exchange will unlock $13.82 million worth of its native token to be distributed to its community treasury and rewards for liquidity providers and traders, according to data from Token Unlocks. Related Reading: Ethereum Bulls Put Up A Fight, But Can They Clear This Major Hurdle? The token tracking dashboard shows that the DEX will release 6.52 million DYDX tokens, which accounts for 3.76% of the token’s current circulating supply.  Breaking this figure down, 2.49 million tokens &#8211; equivalent to $5.279 million at the current market price  &#8211; will be allocated to the community treasury, which funds contributor grants, community initiatives, liquidity mining, and so on. Meanwhile, the remaining 4.03 DYDX tokens will be distributed between trading rewards (2.88 million tokens worth roughly $6.11 million) and liquidity provider rewards (1.15 million tokens worth an estimated $2.44 million). This is the second time the DEX will be carrying out an unlock event in August 2023. On August 1, 2023, dYdX executed an identical unlock event, distributing the same amount of tokens to the community treasury, liquidity providers, and traders.  Upon completion of this forthcoming event, over 25% of the total token supply will be unlocked, while less than 75% of the supply will still be locked. Could This Event Hamper DYDX’s Rise? Given that a considerable chunk of the 6.52 million DYDX tokens will be going to liquidity providers and traders, the chances are that a substantial portion of the tokens will be offloaded in the open market. As such, the DYDX price could suffer due to increased selling pressure. The signs are not particularly positive from a historical perspective, either. Price action data reveals that the price of DYDX struggled after the identical unlock event on August 1. Related Reading: MATIC Social Sentiment Slides To Negative Territory – What’s The Impact On Price? The token lost nearly 10% of its value in a few days, reaching $1.91 by August 4. Although the token has witnessed an impressive turnaround, investors could see DYDX fall below the $2 level again if history were to repeat itself. As of this writing, the DYDX token changes hands for $2.12, reflecting a 1.7% price dip in the last 24 hours. CoinGecko data shows that there has been a 36.2% decline in the token’s daily trading volume, signaling a recent fall in market activity. DYDXUSDT trading at $2.135 &#124; Source: daily DYDXUSDT chart on TradingView Featured image from Getty Images, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-29T13:02:16.000Z",
    "title": "Ripple Labs’ UBRI Initiative: Revolutionizing XRPL Banking Interface Prototype",
    "url": "https://www.crypto-news-flash.com/ripple-labs-ubri-initiative-revolutionizing-xrpl-banking-interface-prototype/",
    "description": "<img width=\"800\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"This decline could be just the initial sign of greater challenges for XRP. Whale Alert, a well-known entity tracking significant cryptocurrency transactions, highlighted a remarkable development.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-48x29.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" />WrathofKahneman, a notable XRP figure, highlighted Ripple&#8217;s UBRI initiative update, revealing the University of Waterloo&#8217;s CBDC research on XRPL.  Ripple strengthens Canadian connections, collaborating with the University of Toronto.  Recently, Wrathof Kahmeman, a well-known individual within the XRP circle, brought attention to a fascinating update regarding Ripple Labs&#8217;s UBRI initiative through a tweet. He conveyed [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-29T12:57:25.000Z",
    "title": "Memecoin watch: Shiba Inu (SHIB) down -1% as rival Golden Inu (GOLDEN) rises +18%",
    "url": "https://www.crypto-news-flash.com/memecoin-watch-shiba-inu-shib-down-1-as-rival-golden-inu-golden-rises-18/",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-155.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-155.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-155-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Amidst a favorable day for memecoins, Shiba Inu (SHIB) displayed disappointing results. Over the past 24 hours, the currency experienced a 1% decline in value. While mostly insignificant, this price action is rather disappointing due to how holders were anticipating the price of $SHIB to perform after the launch of Shibarium. Over the past weeks, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-29T12:56:09.000Z",
    "title": "Ethereum On-Chain Metrics Are Relatively Stable: On-chain Data",
    "url": "https://coinedition.com/ethereum-on-chain-metrics-are-relatively-stable-on-chain-data/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/ETH15.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/ETH15.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/ETH15-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/ETH15-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/ETH15-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/ETH15-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/ETH15-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/ETH15-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/ETH15-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/ETH15-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/ETH15-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/ETH15-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/ETH15-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/ETH15-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/ETH15-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/ETH15-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/ETH15-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>On-chain metrics for Ethereum (ETH) are not showing any concerning signs at the moment, according to a Twitter post shared by the market intelligence platform Santiment earlier today. Although ETH is not showing huge signs of struggle, Santiment suggested that now might not be the most opportune time to invest in the leading altcoin. In [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ethereum-on-chain-metrics-are-relatively-stable-on-chain-data/\">Ethereum On-Chain Metrics Are Relatively Stable: On-chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-29T12:55:00.000Z",
    "title": "QuillCon CXO Singapore Returns Bigger and Better– Transcending Boundaries and Forging Connections",
    "url": "https://coinedition.com/quillcon-cxo-singapore-returns-bigger-and-better-transcending-boundaries-and-forging-connections/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/QuillCon_CXO_Singapore_Returns_Bigger_and_Better–_Transcending_Boundaries-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Footsteps Of QuillCon As the QuillAudits team prepares to mark its presence in the Token 2049 event, let’s rewind a bit. It all began with the launch of the first-ever QuillCon Goa edition in August &#8217;23. This exclusive side event marked a pivotal moment as QuillAudits extended its commitment beyond cybersecurity, creating a space for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/quillcon-cxo-singapore-returns-bigger-and-better-transcending-boundaries-and-forging-connections/\">QuillCon CXO Singapore Returns Bigger and Better– Transcending Boundaries and Forging Connections</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]