[
  {
    "source": "Decrypt",
    "date": "2023-12-13T22:26:05.000Z",
    "title": "Social Giant Line Raises $140 Million for NFT Push, 'Brown and Friends' Games",
    "url": "https://decrypt.co/209736/social-giant-line-raises-140-million-nft-push-brown-friends-games",
    "description": "Japanese messaging firm Line is advancing its NFT plans with a raise led by Crescendo, with Line Friends crypto games in the works."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-13T22:30:19.000Z",
    "title": "OFAC and CoinList reach $1.2M settlement over Russian sanctions violations",
    "url": "https://cryptoslate.com/ofac-and-coinlist-reach-1-2m-settlement-over-russian-sanctions-violations/",
    "description": "<p>The U.S. Treasury&#8217;s Office of Foreign Assets Control (OFAC) announced a settlement with the crypto exchange CoinList on Dec. 13. Over a two-year period ending in May 2022, CoinList processed 989 transactions worth $1.25 million from users who ordinarily resided in Crimea. The agency called this an &#8220;apparent violation&#8221; of its sanctions related to Russia [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ofac-and-coinlist-reach-1-2m-settlement-over-russian-sanctions-violations/\">OFAC and CoinList reach $1.2M settlement over Russian sanctions violations</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T22:35:38.000Z",
    "title": "From ghost town to gold rush – DEC 2023 witnesses the revival of NFTs ",
    "url": "https://www.cryptopolitan.com/dec-2023-witnesses-the-revival-of-nfts/",
    "description": "NFTs appear to be making a comeback, with trade volume approaching $1 billion in November. According to data tracking firm DappRadar, NFT trade volume increased by 125% last month. This demonstrates a shift in user behavior about NFTs.&#160; In addition, the average value of NFT transactions increased by 114% last month. The statistics revealed that [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T22:16:51.000Z",
    "title": "SEC Chair Gensler prioritizes Treasury Market Over Crypto in recent interview ",
    "url": "https://www.cryptopolitan.com/gensler-prioritizes-treasury-market-crypto/",
    "description": "In a recent interview with Bloomberg Television, Securities and Exchange Commission (SEC) Chair Gary Gensler displayed a clear prioritization of the U.S. Treasury market over cryptocurrencies, specifically regarding queries about spot bitcoin Exchange-Traded Funds (ETFs). Gensler&#8217;s emphasis on the Treasury Market During the interview,&#160; when questioned about the status of various applications for spot bitcoin [&#8230;]"
  }
]