[
  {
    "source": "CoinDesk",
    "date": "2024-02-21T21:55:10.000Z",
    "title": "Bitcoin Could Hit $150K This Year, Says Fundstrat's Tom Lee",
    "url": "https://www.coindesk.com/markets/2024/02/21/bitcoin-could-hit-150k-this-year-says-fundstrats-tom-lee/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin price can reach as high as $150,000 this year fueled by ETFs, halving and Fed rate cuts, Fundstrat's Tom Lee said."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-21T22:01:02.000Z",
    "title": "Kakao's Metabora Joins Gaming Giants Ubisoft, Sega on Oasys Chain",
    "url": "https://decrypt.co/218464/kakao-metabora-oasys-gaming-chain-ubisoft-sega",
    "description": "One week after Oasys hit a new all-time high price, it has added another notable gaming firm to join its growing stable."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-21T22:00:05.000Z",
    "title": "Is Ethereum Overvalued, Similar ‘To Meme Coins Like Shiba Inu’?",
    "url": "https://www.newsbtc.com/news/ethereum/is-ethereum-overvalued-similar-to-meme-coins-like-shiba-inu/",
    "description": "A crypto investor, Fred Krueger, thinks Ethereum is overvalued at spot rates. Referring to X, Krueger added that  Ethereum supporters are &#8220;detached from reality&#8221; after ETH, the native currency, recently broke above $3,000. The investor pointed to the general declining on-chain activity, fierce competition from alternatives like Solana and Avalanche, for instance, and regulatory uncertainty that makes holding the coin risky. Ethereum Is Slow And Usage Is Shrinking Krueger argues that Ethereum&#8217;s on-chain transactions could be faster and cheaper. In the current landscape marked with scalable and low-fee alternatives, either built on Ethereum or existing as independent chains, the chain&#8217;s challenges no longer justify ETH trading at spot rates of about $3,000.  Related Reading: AVAX Slips, Adding Tension To $365 Million Avalanche Token Unlock Drama Beyond scaling and throughput challenges, the investor also refers to the sharp decline in daily active users (DAUs) on the mainnet. Since 2021, Ethereum and altcoin prices have peaked, and active DAUs have fallen from around 120,000 to approximately 66,000 in February 2024.  Though network supporters said there had been developments like layer-2 platforms like Arbitrum pinning their security on Ethereum, Krueger notes that even the most active and largest protocols by total value locked (TVL) have seen user losses. To illustrate, Uniswap V3, the third version of one of Ethereum&#8217;s largest decentralized exchanges, Uniswap, now records around 16,000 daily active users, significantly lower than previous years. Alternatives Like Solana Offer Better: Is ETH Expensive? The investor argues that the decline in DAUs, pointing to active usage, sharply contrasts with Ethereum&#8217;s rising market capitalization and spot rates. In Krueger&#8217;s opinion, this emerging state of affairs is why Ethereum has become a bloated &#8220;meme coin like Shiba Inu,&#8221; looking at its high market cap. It in the investor&#8217;s assessment that faster and cheaper alternatives like Solana, Avalanche, and Near Protocol offer better value for specific use cases like decentralized finance (DeFi) and games.  Related Reading: Bitcoin FOMO Hasn’t Spiked Yet: Green Signal For Rally To Continue? Krueger also took issue with the lack of regulatory clarity on Ethereum. The United States Securities and Exchange Commission (SEC) recently approved the first spot Bitcoin exchange-traded funds (ETF) batch. Primarily, this is because SEC officials recognize Bitcoin as a commodity. Gary Gensler and the SEC have failed to classify ETH in the same category as BTC. Accordingly, though the broader crypto community is optimistic about the eventual authorization of a spot Ethereum ETF, Krueger thinks it is unlikely. Still, time will only tell how Ethereum and its market valuation will evolve in the coming months. Supporters are optimistic, despite criticism, that rising adoption and ETH&#8217;s deflationary nature will lift prices towards 2021 highs of $5,000. Feature image from DALLE, chart from TradingView"
  }
]