[
  {
    "source": "Decrypt",
    "date": "2024-03-16T17:32:09.000Z",
    "title": "This Week in Coins: Bitcoin Hits All-Time High, Then Gets Battered, While Solana Soars",
    "url": "https://decrypt.co/221983/this-week-in-coins-bitcoin-falls-after-all-time-high-solana-soars",
    "description": "Bitcoin soared above $73,600 per coin before dropping below $69,000. But Solana made gains, with its market cap hitting an all-time high."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-16T17:33:55.000Z",
    "title": "The Investment Dilemma: NuggetRush vs GALA - Which Cryptocurrency Promises Higher Returns?",
    "url": "https://cryptodaily.co.uk/2024/03/the-investment-dilemma-nuggetrush-vs-gala-which-cryptocurrency-promises-higher-returns",
    "description": "NuggetRush (NUGX) is a unique crypto offering a profitable gaming experience supporting artisanal miners"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-16T17:17:15.000Z",
    "title": "Ethereum (ETH) & Polkadot (DOT) Backers Fuel Kelexo (KLXO) Pre-sale Surge, Anticipating 50X Returns in Crypto Lending Sector",
    "url": "https://cryptodaily.co.uk/2024/03/ethereum-eth-polkadot-dot-backers-fuel-kelexo-klxo-pre-sale-surge-anticipating-50x-returns-in-crypto-lending-sector",
    "description": "The recent developments in the crypto lending sectors have gotten many investors excited about what's to come with crypto-lending platforms leading the charge through their innovative and dynamic models. Ethereum (ETH)"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-16T17:36:40.000Z",
    "title": "Bullish Pushd presale sees interest from SHIB, BTC traders",
    "url": "https://crypto.news/bullish-pushd-presale-sees-interest-from-shib-btc-traders/",
    "description": "Amid a bullish crypto market with notable rises in Bitcoin and altcoins like Shiba Inu, the Pushd (PUSHD) presale is drawing attention from seasoned investors, offering tokens at $0.125 in its sixth stage. This interest from the crypto community underscores the potential of Pushd as an emerging Web3 platform. #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-16T17:13:22.000Z",
    "title": "Defi platform Xuirin Finance announces presale",
    "url": "https://crypto.news/defi-platform-xuirin-finance-announces-presale/",
    "description": "Xuirin Finance announces its presale, introducing innovative DeFi solutions aimed at integrating cryptocurrencies with the global economy for enhanced financial autonomy and control. The platform leverages blockchain to improve global financial transactions, offering features like DeFi debit cards and AI-enhanced P2P lending. #sponsored "
  }
]