[
  {
    "source": "Cointelegraph",
    "date": "2023-11-10T17:57:59.000Z",
    "title": "3 theses that will impact Ethereum and Bitcoin in the next bull market",
    "url": "http://cointelegraph.com/news/3-theses-will-impact-ethereum-bitcoin-next-bull-market",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/3d7a80fb-485c-42db-b3fd-8527060c5527.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cryptocurrency is going to break out of its bubble and reach critical mass thanks to layer-2 blockchains — and a couple of other factors.</p>\n                    <p><p>After 2021, we entered an era in cryptocurrency where people stopped talking only about financial decentralization and started to broadly discuss the tokenization of everything, thanks in part to nonfungible tokens (NFTs).</p><p>This shift represents a critical perspective that is set to guide three theses for the upcoming bull market. To fully grasp these theses, it is crucial to understand that everything is data. Money is data. Your engagement with a brand is data. Your credentials are data. The ticket for your favorite show is data.</p><p>Since 2021, the ecosystem has increasingly started to store a large part of this data in the form of fungible tokens, NFTs, and timestamps on the blockchain, which acts as a data repository in this context.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/expect-new-irs-crypto-surveillance-come-with-surge-confiscation\"><strong><em>Expect new IRS crypto surveillance to come with a surge in confiscation</em></strong></a></p><p>While not all data needs to be on the blockchain, the ability to place data on the blockchain radically transforms how we store, share, and utilize data for automated and secure instructions and transactions.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Re: non-financial blockchain use cases. <a href=\"https://t.co/lYZFprXAry\">pic.twitter.com/lYZFprXAry</a></p>&mdash; vitalik.eth (@VitalikButerin) <a href=\"https://twitter.com/VitalikButerin/status/1530268923848839173?ref_src=twsrc%5Etfw\">May 27, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>And it seems that this prospect of tokenizing everything is coming to Bitcoin. This gives rise to the first thesis.</p><h2>Ordinals and similar protocols continue to grow, while Bitcoin becomes a network for multi-assets (or multiple data types)</h2><p>In January 2023, Casey Rodamor publicly released the Ordinals protocol, which, in short, allows for the permanent insertion of any file type into the Bitcoin blockchain.</p><p>In less than a year, the community has already conducted experiments in which music, artwork, journalistic articles, and even video games are being inscribed on the world's leading blockchain.</p><p>The Ordinals protocol was not the first to allow this, but it has gained the most traction. And everything indicates that this is a flame that will not go out.</p><p>More than just a technical protocol, a culture and a mindset have been created where more and more builders see Bitcoin as a canvas for the creation of other projects and applications, and nothing can stop well-established cultural movements.</p><p>But remember: not everything needs to be stored 100% on-chain, as this is expensive and, for some applications, inefficient.</p><p>Therefore, protocols such as Taproot Assets — which enable the creation of other assets — on the Bitcoin network but in a way that keeps most of the information off-chain, will be essential.</p><p>Speaking of storage costs on<a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-understanding-the-layers-of-blockchain-technology\"> layer-1 blockchains</a>, it looks like <a href=\"https://cointelegraph.com/learn/a-beginners-guide-on-blockchain-layer-2-scaling-solutions\">layer-2 blockchains</a> are set to shine.</p><h2>Crypto will break out of its bubble and finally reach the everyday person through layer-2 blockchains</h2><p>Those who were active during the 2021 bull market recall that $50 for a transaction fee on Ethereum was almost the norm, not to mention the spikes, like during the minting of the Otherside NFTs by Yuga Labs, where users paid up to six Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) per transaction.</p><p>It's simple: if the blockchain isn't invisible, it won't reach the mainstream. And expensive and slow transactions make the blockchain highly noticeable.</p><p>That's why layer-2 blockchains — designed to scale layer-1 blockchains — will be so crucial for the next bull market.</p><p>Although they've been around for years, neither they nor the market was mature enough to build on them in the last cycle. On one hand, many companies and developers weren't convinced that layer-2s were stable enough to handle a significant influx from the mainstream. On the other hand, there was also the issue that, in the excitement of the moment, people acted without studying and understanding much.</p><p>The number of projects unnecessarily on Ethereum was significant, and the reasons varied: it was cultural, because some companies didn't even know what secondary layers were, or simply because everyone was building on Ethereum.</p><p>Now, with all the lessons learned and the calm that has settled in with the bear market, it's clear that the mentality for building is much more mature, and the 'jobs to be done' by blockchains have become much clearer to those who are building.</p><p>And the cherry on top will be the implementation of EIP-4844, which is expected to happen in a few months on the Ethereum network, and will further reduce the transaction costs of layer-2 networks, making them even more invisible and robust to attract and retain the mainstream audience.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/a8e9fef4-f2ca-44c9-a561-a7ce72aef57c.jpg\"  /><figcaption style=\"text-align: center;\"><em>Comparison of gas fees before and after EIP-4844. Source: IntoTheBlock</em></figcaption></figure><p>But it's useless for the infrastructure to be invisible if people can't connect to it and companies can't build on it. However, the solution is already here!</p><h2>Abstraction solutions will be the main gateway and retention mechanism for users and large traditional companies on Web3</h2><p>The big issue is that with the tokenization of everything, in some cases decentralization is more of a hindrance than a help.</p><p>If the topic is Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) custody, the topic of decentralization is pertinent. However, when the subject shifts to tokenized tickets or a company's loyalty credentials, the value does not lie in the system's decentralization. Therefore, simplifying the user's experience by abstracting complex processes — such as creating a semi-custodial wallet with social login or eliminating concerns about gas fees — makes total sense and it's necessary.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-beyond-35k-christmas-thank-jerome-powell\"><strong><em>Bitcoin beyond 35K for Christmas? Thank Jerome Powell if it happens</em></strong></a></p><p>Abstraction solutions were the missing bridge so that the crypto universe does not continue to be a technical environment exclusive to technically skilled people willing to face various challenges and complex journeys. But now, they are ready to shine!</p><p>And It's not about ending decentralization, it's about having an option. Those who want to remain 100% decentralized can do so, but those who don't now have an option. This way, it avoids the crypto ecosystem dying in the famous chasm of innovation. Because magnificent infrastructures are pointless if people cannot connect to and navigate them easily in everyday life.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/f1140af5-dc69-4c70-84f4-74286d508705.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>The Technology Adoption Life Cycle highlighting the chasm between early adopters and the mainstream market. Source: \"Crossing The Chasm\" by Geoffrey A. Moore</em></figcaption></figure><p>Something that's not often discussed is how important these abstraction solutions are for traditional companies to effectively join Web3 too. How many companies currently have a team of developers who can program in blockchain languages, like Solidity? Making it easier for builders to get started is also crucial.</p><p>Breaking down the blockchain journey to mainstream into four phases, we could say that the account abstraction solutions, along with the advancements mentioned in thesis two, will propel Web3 into its penultimate phase — with improved infrastructure, fewer technical builders and brands join the game, and the number of applications, projects, and use cases multiply, attracting mainstream attention.</p><p>As of today, it seems that major blockchains will be increasingly viewed as platforms for multi-asset consensus in the next market cycle and less as currencies. The crowning gem will be the quest for scalability, which will make the layers more invisible and less complex for users to navigate and for businesses to integrate. Welcome to t of Ethereum and phase 2 of Bitcoin.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Lugui Tillier</strong> is the chief commercial officer of Lumx Studios, a Web3 studio that counts BTG Pactual Bank, the largest investment bank in Latin America, among its investors. Lumx Studios has previous Web3 cases with Coca-Cola, AB InBev, Nestlé and Meta. The author holds investments related to the Ordinals Protocol, though none named in this article.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-10T17:49:48.000Z",
    "title": "Hodlnaut heading for liquidation after failure of restructuring, sale efforts ",
    "url": "http://cointelegraph.com/news/hodlnaut-liquidation-failure-restructuring-sale-efforts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/4a0732b7-cbf6-49ce-ae01-744d9a878f31.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Recovery from the crypto winter is proceeding, but Hodlnaut won’t survive it. A sealed court order in Singapore appears to spell its doom. </p>\n                    <p><p>Crypto lender Hodlnaut’s days appear to be numbered after the High Court of Singapore ended judicial management and ordered its liquidation. Users’ funds have been frozen since August 2022. </p><p>Former Hodlnaut interim judicial manager (IJM) Aaron Loh Cheng Lee <a href=\"https://assets.ey.com/content/dam/ey-sites/ey-com/en_sg/generic/hodlnaut-pte-ltd-(ijm)/l001-first-circular-11-10-2023.pdf\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> in a letter dated Nov. 10 and posted on the website of EY that he and fellow IJM Ee Meng Yen Angela have been discharged from that position and appointed liquidators. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/fdab8703-6631-43ee-8cf4-3c3372edb4e4.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Aaron Lee's letter of Nov. 10. Source: EY</em></figcaption></figure><p>The liquidation decision was made by the Singapore court in a Winding-up Order in response to their application. According to an attachment to Lee’s letter, that decision is sealed at the moment. </p><p>Singapore-based Hodlnaut <a href=\"https://cointelegraph.com/news/crypto-lending-platform-holdnaut-suspends-services-due-to-liquidity-crisis\">suspended deposits and withdrawals</a> and simultaneously withdrew its licensing application before the Monetary Authority of Singapore on August 8, 2022. The company attributed its decision to “recent market conditions.” According to Lee’s letter, Hodlnaut’s creditors include 17,000 users. Major creditors included Samtrade Custodian, S.A.M. Fintech and the Algorand Foundation.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/algorand-foundation-outlines-35m-exposure-to-crypto-lender-hodlnaut\">Algorand Foundation outlines $35M exposure to crypto lender Hodlnaut</a></em></strong></p><p>Hodlnaut was apparently a victim of the systemic turmoil that struck the industry with the collapse of the Terra ecosystem and Three Arrows Capital (3AC). It did not have exposure to 3AC, but reportedly held around $150 million in Terra stablecoin, since renamed TerraUSD Classic (USTC), at some time. It later <a href=\"https://cointelegraph.com/news/hodlnaut-works-with-potential-buyers-to-sell-firm-and-ftx-claims-report\">took another financial hit</a> with the collapse of FTX.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The value of FLEX token — the proposed settlement digital currency for Hodlnaut’s $30 million buyout — has plummeted 90% since the offer was made in early August. <a href=\"https://t.co/PDgFgiKp4P\">https://t.co/PDgFgiKp4P</a></p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1704123444487770369?ref_src=twsrc%5Etfw\">September 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Hodlnaut <a href=\"https://cointelegraph.com/news/crypto-lender-hodlnaut-seeks-judicial-management-to-avoid-forced-liquidation\">avoided forced liquidation</a> by applying for and receiving court-appointed IJMs. It subsequently<a href=\"https://cointelegraph.com/news/hodlnaut-now-placed-under-creditor-protection-after-freezing-withdrawals\">received creditor protection</a> and <a href=\"https://cointelegraph.com/news/hodlnaut-cuts-80-of-staff-applies-for-singapore-judicial-management\">cut its staff by 80%</a>. It also reportedly <a href=\"https://cointelegraph.com/news/crypto-lender-hodlnaut-reportedly-faces-police-investigation-in-singapore\">faced a police investigation</a> of a delay in its reporting of its USTC holdings.</p><p>Creditors <a href=\"https://cointelegraph.com/news/hodlnaut-creditors-reject-the-restructuring-plan-prefer-liquidation\">rejected a restructuring plan</a> in January and <a href=\"https://cointelegraph.com/news/majority-of-creditors-want-hodlnaut-liquidated\">voted overwhelmingly for liquidation</a> in April. OPNX, founded by former 3AC founders Su Zhu and Kyle Davies, among others, <a href=\"https://cointelegraph.com/news/opnx-exchange-bids-hodlnaut-singapore\">offered $30 million worth</a> of its FLEX token for a 75% share in Hodlnaut in August 2023, but that offer <a href=\"https://cointelegraph.com/news/30-million-hodlnaut-bid-by-opnx-rejected\">was rejected by the IJMs</a> the following month after the value of FLEX plummeted by 90%.</p><p>A U.S. court <a href=\"https://cointelegraph.com/news/court-confirms-celsius-bankruptcy-exit-plan-2-billion-crypto-creditors\">approved the bankruptcy plan</a> of crypto lender Celsius on Nov. 9. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/3ac-opnx-asia-express/\">3AC fugitives in disarray as OPNX faces new peril: Asia Express</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-10T17:40:33.000Z",
    "title": "Price analysis 11/10: BTC, ETH, BNB, XRP, SOL, ADA, DOGE, TON, LINK, MATIC",
    "url": "http://cointelegraph.com/news/price-analysis-11-10-btc-eth-bnb-xrp-sol-ada-doge-ton-link-matic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/aacc6baf-7ce4-4e61-8481-dd698c3d3130.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin and Ether are leading the cryptocurrency markets from the front, but the risk of a short-term pullback remains.</p>\n                    <p><p>News of BlackRock registering the iShares Ethereum Trust increased expectations that the <a href=\"https://cointelegraph.com/news/black-rock-ether-etf-eth-price-btc-etf-done-deal\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/black-rock-ether-etf-eth-price-btc-etf-done-deal/amp\">asset manager may eventually apply</a> for an Ether  (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) spot exchange-traded fund. This is a positive sign as it shows that BlackRock’s cryptocurrency aspirations are not limited to Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>).</p><p>Market observers are increasingly optimistic that spot Bitcoin ETFs will be greenlighted by the United States Securities and Exchange Commission in 2024. Bloomberg Intelligence research analyst James Seyffart said on X (formerly Twitter) that there is still a 90% possibility that the regulator <a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-window-sec-bloomberg-analysts\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-etf-approval-window-sec-bloomberg-analysts/amp\">will approve a spot Bitcoin ETF</a> by Jan. 10 of the next year. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/a692ec1a-5c0c-44e9-94c1-b1cfd4798ace.png\"><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>Galaxy Digital founder Mike Novogratz believes that the approval of the Bitcoin ETF, followed by the Ether ETF, will <a href=\"https://cointelegraph.com/news/bitcoin-etf-will-drive-adoption-in-2024-mike-novogratz\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-etf-will-drive-adoption-in-2024-mike-novogratz/amp\">boost institutional adoption in 2024</a>. During Galaxy Digital’s third-quarter earnings call on Nov. 9, Novogratz exhibited confidence that approval for ETFs “is now not a matter of if but when.”</p><p>Could the expectations regarding ETF approvals sustain the rally in Bitcoin and select altcoins, or will profit-booking set in?</p><p>Let’s analyze the charts of the top 10 cryptocurrencies to find out.</p><h2>Bitcoin price analysis</h2><p>Bitcoin shot up above the ascending channel pattern on Nov. 9, but the higher levels witnessed profit-booking as seen from the long wick on the candlestick.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/af9bde9b-37b2-4289-83e8-c6ad6c08c7ae.png\"><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The relative strength index (RSI) has been trading in the overbought territory for the past several days, indicating that the bulls have maintained the buying pressure. If the current rebound sustains, the buyers will try to propel the BTC/USDT pair to $40,000 again.</p><p>On the contrary, if the price dips back into the channel, it will indicate that markets have rejected the higher levels. That could pull the price down to the 20-day exponential moving average ($34,240), an important level to watch out for. A break below this level will tilt the short-term advantage in favor of the bears.</p><h2>Ether price analysis</h2><p>Ether skyrocketed above the psychological resistance of $2,000 on Nov. 9, indicating aggressive buying by the bulls.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/4ee6cc12-3d53-4831-aeff-6c43620a192b.png\"><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AETHUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The recent rally has propelled the RSI into the overbought territory, suggesting a consolidation or correction may be around the corner. Sellers will try to halt the up-move at $2,200, but if they want to weaken the momentum, they will have to yank the price back below $2,000.</p><p>Contrarily, if the ETH/USDT pair surges above $2,200, it will open the doors for a potential rise to $2,950 as there is no significant resistance in between.</p><h2>BNB price analysis</h2><p>The bulls purchased the dip in BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/binance-coin-price-index\">BNB</a>) on Nov. 9, indicating that the lower levels continue attracting buyers.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/0f035d06-7b68-49b4-9e33-4f791f46de86.png\"><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABNBUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls will try to drive the price above the overhead resistance at $265. If they can pull it off, the BNB/USDT pair could rise to $285 and thereafter attempt a rally to $310. This level is likely to pose a strong challenge for the bulls.</p><p>The crucial support on the downside is the 20-day EMA ($235). Sellers will have to tug the price below this level to gain the upper hand. The pair could then collapse to the 50-day SMA ($220).</p><h2>XRP price analysis</h2><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/xrp-price-index\">XRP</a>) turned down from $0.74 on Nov. 6 and broke below the immediate support at $0.67 on Nov. 9. This suggests profit-booking by the bulls.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/f599aa35-527a-4039-9efe-a3f95706b579.png\"><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AXRPUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The rising 20-day EMA ($0.61) and the RSI in the positive territory indicate that the bulls have the upper hand. </p><p>If the price snaps back from the 20-day EMA, it will suggest that the sentiment remains bullish and traders view the dips as a buying opportunity. That improves the prospects of a break above $0.74. The XRP/USDT pair could then climb to $0.85.</p><p>Contrary to this assumption, a break below the 20-day EMA could deepen the correction to the next support at $0.56.</p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) nudged above the overhead resistance of $48 on Nov. 9 and followed that up with a sharp move above the overhead resistance on Nov. 10.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/1d9156cf-e23d-4010-a9e6-60711b203a16.png\"><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ASOLUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If the SOL/USDT pair maintains above $48, it will signal the start of the next leg of the uptrend. The pair may then ascend to $60.</p><p>The risk to the up-move is from the overbought level on the RSI. This suggests that the rally is overextended in the near term and ripe for a correction or consolidation. The longer the price remains in the overbought territory, the greater the possibility of a sharp pullback. A slump below $48 will be the first sign that the bulls may lose their grip.</p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) pierced the overhead resistance at $0.38 on Nov. 9, but the long wick on the candlestick shows that the markets rejected the higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/d777cbb6-d5d3-4532-a5a7-b8d1b3050a04.png\"><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AADAUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls will again try to shove and sustain the price above the overhead resistance. If they are successful, the ADA/USDT pair could jump to $0.42 and subsequently to $0.46. Buyers may face a formidable resistance at $0.46.</p><p>Alternatively, if the price turns down from $0.38, it could slide to the 20-day EMA ($0.32). This remains the critical level to watch for on the downside. A strong rebound off it could keep the advantage with the buyers, while a break below it may indicate a range-bound action in the near term.</p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) swung wildly on Nov. 9, as seen from the long wick and tail on the candlestick. This suggests indecision among the bulls and the bears.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/1a574d97-8b47-47e3-a51c-87920bdb9fdb.png\"><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOGEUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>A minor positive is that the bulls have not ceded much ground to the bears. This suggests that the bulls expect the recovery to continue. There is a stiff hurdle at $0.08, but if that is crossed, the DOGE/USDT pair may reach $0.10.</p><p>If bears want to make a comeback, they will have to pull the price back below the 20-day EMA ($0.07). The breakdown will suggest that the pair may consolidate inside a large range between $0.08 and $0.06 for some time.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-terminal-price-next-btc-all-time-high-at-least-110k\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-terminal-price-next-btc-all-time-high-at-least-110k/amp\"><strong><em>Bitcoin 'Terminal Price' hints next BTC all-time high is at least $110K</em></strong></a></p><h2>Toncoin price analysis</h2><p>Toncoin (TON) closed above $2.59 on Nov. 8, but the bulls could not maintain the higher levels. The price turned down sharply and slipped back below $2.59 on Nov. 9.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/1cde873d-6627-4678-9de1-0dca2ff65a8d.png\"><figcaption style=\"text-align: center;\"><em>TON/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ALTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>A slight advantage in favor of the bulls is that the 20-day EMA ($2.29) support held on the downside. The bulls will again try to propel the price above the overhead resistance zone between $2.59 and $2.77. If they manage to do that, the TON/USDT pair could pick up momentum and travel toward the pattern target of $4.03.</p><p>This bullish view will be invalidated in the near term if the price continues lower and breaks below the 20-day EMA. The pair may then slump to $2.</p><h2>Chainlink price analysis</h2><p>Chainlink (<a href=\"https://cointelegraph.com/chainlink-price-index\">LINK</a>) reached $15 on Nov. 8, and the bulls tried to extend the rally on Nov. 9 but the long wick on the candlestick shows selling at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/b7f630e4-7317-4bf8-be9b-50272a53d860.png\"><figcaption style=\"text-align: center;\"><em>LINK/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AlinkUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The LINK/USDT pair could slide to the 50% Fibonacci retracement level of $13.24. If the price rebounds off this level with force, the bulls will again try to overcome the obstacle at $15. If they succeed, the pair may surge to $18.</p><p>On the downside, if the price tumbles below $13.24, it will suggest that the traders are rushing to the exit. That could open the doors for a possible decline to the 20-day EMA ($11.94). This level is again expected to witness a tough battle between the bulls and the bears.</p><h2>Polygon price analysis</h2><p>Polygon’s (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) rally picked up pace after it broke above $0.70, but the up-move is facing selling near the overhead resistance at $0.89. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/d4fda02a-4338-4e64-8a30-5b801015989a.png\"><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AMATICUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The price could dip to the 38.2% Fibonacci retracement level of $0.76. If the price rebounds off this level, it will enhance the prospects of a rally above $0.89. If that happens, the MATIC/USDT pair will complete a double bottom pattern. This bullish setup has a target objective of $1.29.</p><p>Conversely, if the price breaks below $0.76, the next stop could be $0.70. Such a deep correction will suggest that the pair may continue oscillating inside the large range between $0.49 and $0.89 for a while longer.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-10T18:00:59.000Z",
    "title": "Bitcoin options open interest soars to unprecedented $18 billion",
    "url": "https://cryptoslate.com/insights/bitcoin-options-open-interest-soars-to-unprecedented-18-billion/",
    "description": "<p>Quick Take The Bitcoin options market is witnessing a surge not seen before, indicative of growing investor confidence and potential market trends. The Options Open Interest, which signifies the total funds allocated in options contracts, marked a record high on Nov. 10 with a notional value of $18.05 billion, equivalent to 491,000 BTC. The lion&#8217;s [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-options-open-interest-soars-to-unprecedented-18-billion/\">Bitcoin options open interest soars to unprecedented $18 billion</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-10T18:02:57.000Z",
    "title": "Bitcoin Fans Eyeing Altcoins with Growth Promise: Solana and Rebel Satoshi on the Radar",
    "url": "https://cryptodaily.co.uk/2023/11/bitcoin-fans-eyeing-altcoins-with-growth-promise-solana-and-rebel-satoshi-on-the-radar",
    "description": "Exploring growth beyond Bitcoin, many investors are eyeing top DeFi projects like Solana and RebelSatoshi."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-10T17:57:43.000Z",
    "title": "French investors increasingly prefer crypto over stocks, survey reveals",
    "url": "https://crypto.news/french-investors-increasingly-prefer-crypto-over-stocks-survey-reveals/",
    "description": "A new study reveals that more French investors own crypto than stocks and ETFs."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-10T18:00:45.000Z",
    "title": "MicroStrategy’s $4.6 Billion Bitcoin Bet Pays Off, Here’s How Much It’s Worth Now",
    "url": "https://www.newsbtc.com/news/bitcoin/microstrategy-4-6-billion-bitcoin/",
    "description": "The cryptocurrency industry has experienced significant growth in recent weeks with an influx of capital. This influx of capital has forced Bitcoin over various price resistances, with the latest being a brief cross over the $37,000 level. MicroStrategy has emerged as a prominent public company that has successfully capitalized on this price push. MicroStrategy&#8217;s blockbuster bet on the world’s largest cryptocurrency has certainly paid off so far. The company has posted over $1 billion in unrealized profit thanks to Bitcoin&#8217;s 36% increase from $26,750 since October 13. Shares of MicroStrategy have also risen simultaneously, soaring more than 55% since the same time period. MicroStrategy’s Bold Bitcoin Bet Paying Off MicroStrategy started buying in Bitcoin in 2020 but the latest acquisition came in October, amidst the influx of money into Bitcoin, where the company announced it had acquired an additional 155 BTC for $5.3 million.  Related Reading: Ripple IPO: Expert Reveals Why Investors Should Be Cautious MicroStrategy now owns a total of 158,245 BTC, acquired at an average total value of $4.68 billion. At BTC&#8217;s current price of around $36,500, MicroStrategy&#8217;s BTC investment is now worth over $5.77 billion, representing an unrealized 26% return of $1.1 billion in around three years. The company’s investment in Bitcoin has also paid off on the back end of its stock price, as it has outperformed many stocks and assets since the adoption of its Bitcoin strategy. The share price has shot up 242% from its open price of $145 at the beginning of the year.  At the time of writing, MicroStrategy share is trading at $497, and Michael Saylor noted that this growth has been largely in part to its innovative Bitcoin strategy. BTC resumes uptrend &#124; Source: BTCUSD on Tradingview.com BTC Putting Microstrategy On The Map MicroStrategy&#8217;s Michael Saylor has been an outspoken proponent of Bitcoin. Saylor’s belief in Bitcoin spearheaded MicroStrategy’s investment in the asset, and a cursory look through his social media page on X shows various posts promoting Bitcoin.  #Bitcoin is Coming. pic.twitter.com/5oE42SQvgC — Michael Saylor⚡️ (@saylor) November 9, 2023 Saylor recently stated, in an interview with Fox Business, that MicroStrategy&#8217;s BTC investments were part of a well-planned strategy to rival tech giants like Google, Microsoft, and Apple.  Related Reading: Analyst Predicts Bitcoin And Crypto Market Crash Of Epic Proportions, Here’s When “What we did in August of 2020 was recognize that there&#8217;s no way we&#8217;re going to outgrow Google and Microsoft and Apple Computer as a mid-sized software company. We realized Bitcoin is like a high-tech dominant digital network growing at 40% or 50% a year, and so we bought it,&#8221; he said in the interview. Saylor also expects the demand for BTC to double in the next 12 months amidst its next halving and the approvals of spot Bitcoin ETFs in the US. Ultimately, he believes that the price of BTC will eventually reach $5 million.  MicroStrategy isn&#8217;t the only company with Bitcoin on its balance sheet. Public companies now own a total of 239,494 BTC, representing 1.23% of the total supply. Marathon Digital, Galaxy Digital, and Tesla are a few of these companies, holding 13,286, 12,545, and 10,500 BTC, respectively. Featured image from MicroStrategy, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-10T17:45:35.000Z",
    "title": "Michael Saylor’s Bitcoin Gamble: $1,000,000,000 in Unrealized Profits and Counting",
    "url": "https://www.crypto-news-flash.com/michael-saylors-bitcoin-gamble-1000000000-in-unrealized-profits-and-counting/?utm_source=rss&utm_medium=rss&utm_campaign=michael-saylors-bitcoin-gamble-1000000000-in-unrealized-profits-and-counting",
    "description": "<img width=\"921\" height=\"515\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Bitcoin-Lightning.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Bitcoin-Lightning.jpg 921w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Bitcoin-Lightning-300x168.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Bitcoin-Lightning-768x429.jpg 768w\" sizes=\"(max-width: 921px) 100vw, 921px\" />MicroStrategy has realized unrealized gains exceeding $1.1 billion as the value of its Bitcoin holdings reached $5.7 billion with Bitcoin surging past $37,000. BlackRock is advancing toward SEC approval for its Spot Bitcoin ETF, with expectations set for January 2024. As the Bitcoin price surges to $37,000 in an unstoppable rally, the one person who&#8217;s [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-10T18:04:39.000Z",
    "title": "$5,940,000 in Cash Handouts Incoming As US State Becomes New Guaranteed Income Testing Ground",
    "url": "https://dailyhodl.com/2023/11/10/5940000-in-cash-handouts-incoming-as-us-state-becomes-new-guaranteed-income-testing-ground/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/income-dollar-ubi.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/income-dollar-ubi.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/income-dollar-ubi.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/income-dollar-ubi.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/income-dollar-ubi.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/income-dollar-ubi.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/income-dollar-ubi.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Millions of dollars will soon be given away with no strings attached as new guaranteed income programs launch on the west coast. Two state-funded programs in California will give a total of $5.94 million to 300 people over the course of 18 months. In San Francisco, 150 participants will receive $1,200 per month, while 150 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/10/5940000-in-cash-handouts-incoming-as-us-state-becomes-new-guaranteed-income-testing-ground/\">$5,940,000 in Cash Handouts Incoming As US State Becomes New Guaranteed Income Testing Ground</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]