[
  {
    "source": "CryptoSlate",
    "date": "2024-01-08T22:49:01.000Z",
    "title": "Standard Chartered: Possible $200k BTC by 2025 hinges on spot Bitcoin ETF approval",
    "url": "https://cryptoslate.com/insights/standard-chartered-possible-200k-btc-by-2025-hinges-on-spot-bitcoin-etf-approval/",
    "description": "<p>Quick Take Standard Chartered Bank&#8217;s recent report, dated Jan 8. 2024, provides an analytical perspective on a possible surge in Bitcoin&#8217;s price, contingent on the projected approval of spot ETFs by the US Securities and Exchange Commission (SEC). The report draws a significant comparison with historical gold price escalations following the approval of gold ETFs, [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/standard-chartered-possible-200k-btc-by-2025-hinges-on-spot-bitcoin-etf-approval/\">Standard Chartered: Possible $200k BTC by 2025 hinges on spot Bitcoin ETF approval</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-08T22:46:33.000Z",
    "title": "Core Scientific emerges from bankruptcy, secures $55 million in new financing",
    "url": "https://cryptobriefing.com/core-scientific-emerges-bankruptcy-secures-55-million-financing/?utm_source=feed&utm_medium=rss",
    "description": "Bitcoin miner Core Scientific closes a $55M equity deal, oversubscribed, as it prepares to emerge from Chapter 11 bankruptcy in January 2023."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-08T23:00:04.000Z",
    "title": "Crypto Analyst Identifies XRP Bear Flag To Trigger A Massive Crash To $0.07",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-bear-flag-massive-crash/",
    "description": "XRP, like the rest of the crypto market, is seeing an active retrace that has sent prices back toward levels not seen since last year. As anticipation around a potential Bitcoin Spot ETF approval builds up for this week, expectations are that this retrace will be short-lived. However, not everyone is bullish on a potential recovery as one crypto analyst expects the price of the altcoin to see a massive crash going forward. XRP Massive Bear Flag Appears Crypto analyst Bitgolder took to TradingView to share an extremely bearish analysis of the XRP price. This analysis identifies the presence of a bear flag, one of the worst ones seen in the altcoin’s chart in recent times. Related Reading: 3 Under The Radar Altcoins Expected To Hit $100 Before The Bitcoin Halving As Bitgolder explains, the XRP price chart looks very bad, leading to the obvious bear flag. Some of the reasons for the formation of this bear flag are the fact that there has been a volume drop over the last week, as well as a decline in interest from investors as the altcoin has failed to live up to expectations following Judge Analisa Torres’s ruling that programmatic XRP sales do not qualify as securities. The crypto analyst explained that the recent price bounce that the coin’s price saw over the last few weeks was in fact not bullish. Rather, it “was just an extended bounce for wave B of this correction from XRP top.” The analyst is also convinced of the weakness being exhibited by XRP, especially given the fact that the altcoin has failed to make a new all-time high in the last bull market while other coins were rallying. Bitgolder warns investors of a slow bleed that is coming for the XRP price despite how bullish the community seems to be. “It’s going to take a while to bleed out because of how many bag holders there are and how much silly YouTubers keep pumping this thing,” Bitgolder warned. “It’s unfortunate that many are going to lose their shirts on this thing.” Token price struggles below $0.6 &#124; Source: XRPUSD on Tradingview.com Price Crash To ‘Single Digit Pennies’ Following the slow bleed-out predicted by Bitgolder, the analyst also expects a further dump that will take the price even lower, even down into the single-digit pennies. The chart shared in the analysis shows an initial decline to $0.39. But then a further dump puts the XRP price as low as $0.07. Source: Tradingview.com The reason behind this dump, according to the analyst, will be the fact that the United States Securities and Exchange Commission (SEC) will eventually win out over Ripple in court. Bitgolder believes that XRP will eventually be considered an unregistered security. Either that or the US SEC will file another lawsuit against the crypto firm, which will lead to investors eventually losing faith and dumping their coins. I used to think that maybe XRP could do some amazing things but after doing more research and looking into on chain metrics I am now convinced this was the biggest pump and dump in history. Related Reading: Crypto Analyst Predicts 100% Surge For Shiba Inu, But There’s A Roadblock However, the analyst also points out that it may not be a straight dump as XRP could still shoot back up to the $0.7 territory once more, which is the top of the bear flag. But Bitgolder refers to this surge as a takeout that would see the rug pulled from under investors once more. “It is hitting some really strong resistance right now so I&#8217;m not sure if it can actually break through this,” the analyst concluded. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Siam Blockchain, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-08T23:01:44.000Z",
    "title": "US Institutions Dominate $151,000,000 in Flows to Crypto Markets Ahead of Expected Bitcoin ETF: CoinShares",
    "url": "https://dailyhodl.com/2024/01/08/us-institutions-dominate-151000000-in-flows-to-crypto-markets-ahead-of-expected-bitcoin-etf-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/Price-Path-for-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/Price-Path-for-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/Price-Path-for-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/Price-Path-for-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/Price-Path-for-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/Price-Path-for-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/Price-Path-for-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says Bitcoin (BTC) and the rest of the crypto markets are having a positive start to the new year amid surging interest from institutional investors. In its latest Digital Asset Fund Flows report, CoinShares finds that institutions are pouring capital into crypto ahead of a highly anticipated spot BTC exchange-traded fund (ETF) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/08/us-institutions-dominate-151000000-in-flows-to-crypto-markets-ahead-of-expected-bitcoin-etf-coinshares/\">US Institutions Dominate $151,000,000 in Flows to Crypto Markets Ahead of Expected Bitcoin ETF: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]