[
  {
    "source": "Cryptopolitan",
    "date": "2024-04-06T22:36:30.000Z",
    "title": "Pantera Capital’s Strategic Triumph: A 66% upsurge registered",
    "url": "https://www.cryptopolitan.com/pantera-capital-66-upsurge-registered/",
    "description": "Pantera Capital Cryptocurrency Investment Fund – in the cryptocurrency investment world, the forever unpredictable place in a strategic game – has proved itself to be a star with 66% gain in Q1’2024 from its Liquid Token Fund. This strong delivery happens in the context of this firm&#8217;s well thought-out strategic ploy to divest heavily from [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-06T22:33:26.000Z",
    "title": "ZachXBT complains of borderline harassment from the IRS",
    "url": "https://www.cryptopolitan.com/zachxbt-borderline-harassment-from-the-irs/",
    "description": "Blockchain sleuth ZachXBT has come out to complain about harassment targeted at him by the Criminal Investigation Unit (CIU) of the United States Internal Revenue Service (IRS). According to his post on X, the blockchain investigator alleged that he is now a target of what he calls ‘borderline harassment’ as the agency continues to seek [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-06T22:31:13.000Z",
    "title": "Creatives Embrace AI as a Powerful Tool at OFFF Barcelona ",
    "url": "https://www.cryptopolitan.com/creatives-embrace-ai-as-a-powerful-tool/",
    "description": "Success and leadership remain the relevant topics at OFFF Barcelona 2022. The various viewpoints alternate between two positions: they will have minds that either see the (?) that supports their view, the one without doubts, or the one with positive self-confidence. AI: A tool for creativity Other than the founder and creative director of the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-06T22:25:12.000Z",
    "title": "Montenegro Supreme Court’s Decisive Extradition Verdict on Terraform Labs Co-Founder Kwon",
    "url": "https://www.cryptopolitan.com/montenegro-court-verdict-terraform-lab-kwon/",
    "description": "One of the latest legal developments in the Montenegro Supreme Court relate to demands for Kwon of Do extradition, the co-founder of Terraform Labs Inc., which is quite a heavy knock with Kwon, because of a lot of legal challenges, that he has faced before. This will be a categorical verdict that will clarify all [&#8230;]"
  }
]