[
  {
    "source": "Decrypt",
    "date": "2023-06-08T21:50:11.000Z",
    "title": "HyperPlay Raises $12 Million to Accelerate Web3 Game Launcher",
    "url": "https://decrypt.co/143913/hyperplay-raises-12-million-accelerate-web3-game-launcher",
    "description": "The round was co-led by Griffin Gaming Partners and Bitkraft Ventures, and will fuel HyperPlay’s growth and expansion."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-08T22:07:19.000Z",
    "title": "CZ denies holding firms received $12B of Binance.US user funds",
    "url": "https://cryptoslate.com/cz-denies-holding-firms-received-12b-of-binance-us-user-funds/",
    "description": "<p>Binance CEO Changpeng Zhao on June 8 countered SEC claims and denied that one of his holding firms received $12 billion in U.S. customer funds. Regarding the supposed $12 billion transfer, Zhao said: &#8220;This is simply false &#8230; To the best of my knowledge, Binance.US had in total roughly $2 billion in user funds.&#8221; Zhao [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/cz-denies-holding-firms-received-12b-of-binance-us-user-funds/\">CZ denies holding firms received $12B of Binance.US user funds</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-08T22:00:51.000Z",
    "title": "Crypto.com’s CRO Firm Despite SEC Lawsuit Fears, Time To Watch The Token?",
    "url": "https://www.newsbtc.com/news/crypto-coms-cro-firm-despite-sec-lawsuit-fears-time-to-watch-the-token/",
    "description": "CRO, the native token of the Cronos blockchain, an open-source, interoperable, and Cosmos-based platform, a centralized crypto asset exchange, is steady despite some community members fearing that the United States Securities and Exchange Commission (SEC), the primary securities regulator in that country, could soon target Crypto.com, the crypto exchange and developer of the blockchain. CRO Stabilizes Despite Fears The SEC Might Sue Crypto.com As of writing on June 8, CRO is trading at $0.05889, stable in the last 24 hours against the USD, Bitcoin, and Ethereum.  All the same, with the CRO average daily trading volumes at $9,098,498, it is down over 25% in the last trading day.  The double-digit contraction in the previous 24 hours comes less than 72 hours after the SEC sued Binance, a dominant cryptocurrency exchange, alleging that it has been facilitating the trading of unregistered securities and illegally allowing Americans to access the platform. The SEC has filed 13 charges against the Changpeng Zhao-led exchange.  Related Reading: Bitcoin Bearish Signal: Dormant 1,433 BTC Moves After 10+ Years The regulator also sued Coinbase in federal court in New York, claiming that, like Binance, the crypto exchange had listed and profited from the trading of unregistered securities. Tokens the SEC claim are securities include ADA, the native currency of Cardano; MANA, the token behind Decentraland; SAND, the ERC-20 token priming The SandBox; ALGO, the native currency of the Algorand proof-of-stake blockchain, and MATIC by Polygon.  Stablecoin, BUSD; NEAR by the NEAR Protocol; CHZ by Chiliz, are some of the tokens mentioned and which the SEC alleges are unregistered securities.  Even so, there was no express mention of CRO in any of the two lawsuits filed by the regulator against the two largest cryptocurrency exchanges.  At the same time, it should be noted that Crypto.com also allows the trading of most tokens that the SEC alleges are unregistered securities. What’s Common in All Tokens The SEC Alleges Are Securities? Within the Cronos blockchain, CRO is used to pay gas fees. Also, because the platform uses a proof-of-stake consensus algorithm, users can stake CRO and receive rewards. Moreover, users can access the decentralized finance (DeFi) ecosystem in Cronos by holding CRO.  In 2018, Crypto.com completed its initial coin offering (ICO), raising over $26 million, which also saw the launch of the CRO token.  Observers have noted that of all the tokens the SEC claims are securities, they all conducted successful crowdfundings.  Additionally, the projects accused of issuing securities also pledged to their respective communities that they would continue improving the underlying protocol via ongoing development.  Related Reading: Stablecoin Market Cap Decreases, But Whales Remain Unfazed: Santiment With this, some of their funds were used to cater for marketing.  Furthermore, each of these teams used social media channels and forums like Twitter, Discord, and others to highlight the advantages of their respective protocols. The determination of whether a token qualifies as a utility, such as Bitcoin, or an unregistered security rests with the judge. Until a ruling is made, exchanges may take precautionary measures, including delisting the asset, to ensure compliance with applicable regulations. Feature Image From Canva, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-08T22:01:06.000Z",
    "title": "Dogecoin Rival Shiba Inu Releases Trailer for Upcoming Rocket Pond Metaverse",
    "url": "https://dailyhodl.com/2023/06/08/dogecoin-doge-rival-shiba-inu-shib-releases-trailer-for-highly-anticipated-rocket-pond-metaverse/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/Support-Major-Shiba-Inu.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/Support-Major-Shiba-Inu.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/Support-Major-Shiba-Inu.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/Support-Major-Shiba-Inu.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/Support-Major-Shiba-Inu.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/Support-Major-Shiba-Inu.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/Support-Major-Shiba-Inu.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Popular dog-themed meme asset and Dogecoin (DOGE) rival Shiba Inu (SHIB) is releasing a trailer for its much anticipated Rocket Pond metaverse. In a new announcement, the development team behind the memecoin has released a one-minute trailer showcasing Rocket Pond, the ecosystem’s upcoming land-based metaverse. In an accompanying blog post, the SHIB developers also unveil [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/08/dogecoin-doge-rival-shiba-inu-shib-releases-trailer-for-highly-anticipated-rocket-pond-metaverse/\">Dogecoin Rival Shiba Inu Releases Trailer for Upcoming Rocket Pond Metaverse</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]