[
  {
    "source": "Decrypt",
    "date": "2024-03-04T18:54:20.000Z",
    "title": "Bitcoin Hardforks BCH, BSV Outpace BTC Gains",
    "url": "https://decrypt.co/220100/bitcoin-bch-bsv-brc-20-ordinals-gains",
    "description": "As Bitcoin flirts with a new all-time high, BCH, BSV, and BRC-20s are also on fire."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-04T19:01:50.000Z",
    "title": " Why is Bitcoin price up today? ",
    "url": "https://cointelegraph.com/news/why-is-bitcoin-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTAvMjk3NTY5OWMtYWJkZC00ZjdiLWJkMzUtNzQyNjdhNTcwMTE3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin price is chasing after its $69,990 all-time high as steady inflows from institutional investors enter the spot BTC ETFs. </p>\n                    <p><p>Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price rally continued, setting a new all-time high market capitalization value at $1.33 trillion. Bitcoin’s market cap has benefitted from inflows to spot BTC ETFs, the upcoming halving, and increasing investor interest in Bitcoin. </p><p>Let’s look into the reasons why Bitcoin price is up today. </p><p>As Bitcoin’s market cap reached an all-time high, investor sentiment turned to “extreme greed” as measured by the Crypto Fear and Greed index. The level of greed on March 3 was the highest seen since Nov. 8, 2021.</p><p><a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-up-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-04T18:43:34.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Shares of MicroStrategy (MSTR) spiked more than 20% on March 4, as the price of Bitcoin crossed $67,000. Meanwhile, Bitcoin has made a new all-time high against the euro at 60,000 euros per coin, with the Mexican peso being its next target. Elsewhere, Coinbase has introduced embedded smart contracts for developers — a move it says will address devs’ pain points when building Web3 applications. </p><p><a href=\"https://cointelegraph.com/news/microstrategy-share-price-rises-over-20-percent-btc-price-continues-skyward\">Shares of MicroStrategy (MSTR)</a> spiked on March 4, as Bitcoin’s ongoing price rally provided the business intelligence firm with additional rocket fuel. </p><p>MSTR surged more than 20% in intraday trading to peak at $1,339. It would later pare some of those gains, but remained firmly above $1,260.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-04T19:06:13.000Z",
    "title": "Ethereum’s Dencun upgrade draws close as fees debate continues",
    "url": "https://www.cryptopolitan.com/ethereums-dencun-upgrade-close-fees-debate/",
    "description": "Ethereum’s forthcoming network upgrade, Dencun, slated for March 13, is poised to reshape the blockchain’s landscape, despite not garnering as much attention as previous upgrades like the transition to proof-of-stake in 2022. Developers anticipate Dencun to be a significant milestone, particularly for layer-2 networks built on Ethereum. Ethereum’s Dencun fees spark debate According to experts [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-04T18:54:51.000Z",
    "title": "Coinbase challenges SEC ruling on insider trading allegations",
    "url": "https://www.cryptopolitan.com/coinbase-challenges-sec-ruling-on-insider-trading/",
    "description": "In the evolving legal confrontation between Coinbase and the Securities and Exchange Commission (SEC), Coinbase&#8217;s Chief Legal Officer, Paul Grewal, has voiced skepticism regarding the value of a recent default judgment by a federal judge. This judgment is part of a broader case alleging insider trading by a former Coinbase employee and his associates. Grewal [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-04T18:51:34.000Z",
    "title": "Bitcoin’s recent rally leaves 97% of wallets in profit",
    "url": "https://www.cryptopolitan.com/bitcoins-rally-leaves-97-wallets-in-profit/",
    "description": "The recent surge in Bitcoin’s value has led to a significant increase in unrealized gains for holders of the cryptocurrency. According to data from analytics firm IntoTheBlock, over 97% of BTC addresses are currently experiencing gains in their investments. This is the highest proportion since November 2021, when Bitcoin reached its all-time high of approximately [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-04T19:00:00.000Z",
    "title": "Ethereum and Dogecoin traders draw by Kelexo’s lending solution",
    "url": "https://crypto.news/ethereum-and-dogecoin-traders-draw-by-kelexos-lending-solution/",
    "description": "In crypto, Ethereum (ETH), Dogecoin (DOGE), and Kelexo (KLXO) continue to play a pivotal role"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-04T19:00:08.000Z",
    "title": "Shiba Inu & Other Memecoins See 3,000% Spike In Volume: Good Sign For Rally?",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-memecoins-3000-spike-volume-rally/",
    "description": "On-chain data shows Shiba Inu (SHIB) and other memecoins in the sector have observed a sharp boost in their volumes alongside their rallies. These Memecoins Have Enjoyed 3,000% Average Volume Increase According to data from the on-chain analytics firm Santiment, the trading volume of the memecoins has shot up recently. The &#8220;trading volume&#8221; here refers to the total amount of a given cryptocurrency involved in trading activities on the various spot exchanges in the sector. When the value of this metric is high, it means that the asset in question is observing a large amount of trades right now. Such a trend implies that the interest around the coin is high among the investors. Related Reading: CryptoQuant’s Bitcoin “Bull-Bear” Indicator Flags Price As Overheated On the other hand, the low indicator suggests that investors may not pay too much attention to the cryptocurrency as they are not making trades. Now, here is a chart that shows the trend in the trading volume for four different memecoins: Shiba Inu, Pepe (PEPE), FLOKI (FLOKI), and Bonk (BONK). Looks like the value of the metric has been quite high for all of these coins recently &#124; Source: Santiment on X As displayed in the above graph, the Bitcoin trading volume for all four of these memecoins has surged to high levels recently as their prices have gone through a rally. Santiment notes that, on average, the trading volume across Shiba Inu, FLOKI, Pepe, and Bonk has increased by more than 3,000% over the past week. This would imply that crowd interest in these assets has witnessed a significant uplift. Generally, it&#8217;s not surprising to see the volume jump alongside price surges, as such sharp price action is attractive to investors, so they tend to make more moves in such periods. For any rally to be sustainable, it must keep attracting fresh volume. This is because moves like these require a large amount of fuel to keep going, which they can only get if more and more interest comes into the asset. Sometimes rallies start sharp, but fail to amass any appreciable volume, so, predictably die off before too long. As the volume of Shiba Inu and others has rocketed up recently, at least their current rallies shouldn&#8217;t face an issue like this. Related Reading: Bitcoin Safe From Drops Under $60,300? On-Chain Data Says So Now, while the trading volume can be something that can help rallies stretch longer, a high volume itself doesn&#8217;t imply a bullish prediction. This is because the volume can also spike during a selloff, as the indicator merely keeps track of the activity and not whether said activity is buying or selling dominated. As such, all that can be said about the implications of the current high trading volume on the prices of Shiba Inu and the company is that they should likely continue to see high volatility in either direction in the coming days. Shiba Inu Price Shiba Inu has enjoyed an extraordinary run of more than 180% in the past week, which has taken its price to the $0.00002746 mark. The price of the asset appears to have been sharply going up recently &#124; Source: SHIBUSD on TradingView Featured image from iStock.com, Santiment.net, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-04T18:57:16.000Z",
    "title": "Shiba Inu, Pepe, BONK and Memecoin Price Explosion Underway As Bitcoin Taps $67,000",
    "url": "https://dailyhodl.com/2024/03/04/shiba-inu-pepe-bonk-and-memecoin-sector-explodes-as-bitcoin-taps-67000-level/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/03/coinbase-sparks-small-cap.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/03/coinbase-sparks-small-cap.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/03/coinbase-sparks-small-cap.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/03/coinbase-sparks-small-cap.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/03/coinbase-sparks-small-cap.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/03/coinbase-sparks-small-cap.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/03/coinbase-sparks-small-cap.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto&#8217;s memecoin sector is experiencing explosive gains as Bitcoin (BTC) crosses the $67,000 level for the first time since late 2021. Shiba Inu (SHIB), Pepe (PEPE) and Bonk (BONK) are among the top memecoins surging in value Monday, putting up double-digit gains. Dog-themed memecoin SHIB is up by more than 61% in the last 24 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/04/shiba-inu-pepe-bonk-and-memecoin-sector-explodes-as-bitcoin-taps-67000-level/\">Shiba Inu, Pepe, BONK and Memecoin Price Explosion Underway As Bitcoin Taps $67,000</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]