[
  {
    "source": "CryptoSlate",
    "date": "2023-12-02T23:17:30.000Z",
    "title": "UK lawmakers wary of launching retail CBDC due to privacy, financial stability concerns",
    "url": "https://cryptoslate.com/uk-lawmakers-wary-of-launching-retail-cbdc-due-to-privacy-financial-stability-concerns/",
    "description": "<p>The U.K. Parliamentary Treasury Committee issued a stern warning about the development of a retail central bank digital currency (CBDC), or &#8216;digital pound,&#8217; and its potential hazards to financial stability. Lawmakers urged the Bank of England and H.M. Treasury to thoroughly consider data privacy and financial stability issues before advancing with the implementation of this [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/uk-lawmakers-wary-of-launching-retail-cbdc-due-to-privacy-financial-stability-concerns/\">UK lawmakers wary of launching retail CBDC due to privacy, financial stability concerns</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-02T23:30:17.000Z",
    "title": "Cambridge Study Unveils Ethereum’s Environmental Impact Post-Merge, Highlighting Major Energy Reduction",
    "url": "https://news.bitcoin.com/cambridge-study-unveils-ethereums-environmental-impact-post-merge-highlighting-major-energy-reduction/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/hopps-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Cambridge Study Unveils Ethereum&#039;s Environmental Impact Post-Merge, Highlighting Major Energy Reduction\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/hopps-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hopps-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hopps-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hopps-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hopps-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hopps-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hopps.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The transformation of the Ethereum network, popularly known as &#8216;The Merge,&#8217; marked a significant shift in the blockchain&#8217;s energy usage and climate impact. A detailed report by the Cambridge Centre for Alternative Finance (CCAF) meticulously dissects this journey, offering invaluable insights into Ethereum&#8217;s historical and current ecological footprint. This transition, deeply rooted in environmental considerations, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-02T23:38:58.000Z",
    "title": "Ethereum Price Sets New 2023 High, Sets Sights On $3,000",
    "url": "https://www.newsbtc.com/ethereum-news/ethereum-price-sets-new-2023-high-sets-sights-on-3000/",
    "description": "Ethereum price action is pushing higher over the weekend, setting a new 2023 high. The move is also a significant sign that an uptrend is forming. Could $3,000 be the next stop for Ether? Ethereum Sets New 2023 High, Uptrend In Progress ETHUSD has struggled to catch up to Bitcoin’s unstoppable dominance throughout most of 2023, but that could soon change. That’s because Ethereum is finally joining in on the bullish price action across crypto, making a new 2023 high. Related Reading: A Golden Opportunity For Ethereum? 600% Buy Signal Returns The move is also a local higher high. A series of higher lows and higher highs is the pure definition of an uptrend. Ether has also satisfied the increasingly higher low market structure. Ether makes new 2023 high, breaks up out of ascending triangle &#124; ETHUSD on TradingView.com ETHUSD Ascending Triangle Targets $3,000 To $4,000 Leaving $2,000 behind after weeks of consolidation above it immediately puts $3,000 in play. Ethereum is also breaking upward out of a 18-month-long ascending triangle pattern, with a target of $4,000 per ETH. Related Reading: Ethereum Price Prediction for 2023, 2024, 2025, 2030 and Beyond If the top altcoin makes it back to such levels, it has a strong chance given the recent momentum in the crypto market, to reach new all-time highs. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  }
]