[
  {
    "source": "CoinDesk",
    "date": "2023-09-19T04:55:25.000Z",
    "title": "FTX Bankruptcy Estate Sues Sam Bankman-Fried's Parents, Joseph and Barbara, to Claw Back 'Misappropriated Funds'",
    "url": "https://www.coindesk.com/policy/2023/09/19/ftx-bankruptcy-estate-sues-sam-bankman-frieds-parents-joseph-and-barbara/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Allan Joseph Bankman and Barabara Fried, the parents of Sam Bankman-Fried, have been sued by the FTX bankruptcy estate."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-19T04:41:07.000Z",
    "title": "Lawyer who laundered $400M from OneCoin scam denied new trial: Report",
    "url": "https://cointelegraph.com/news/onecoin-lawyer-laundered-proceeds-scam-denied-new-trial",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/ed38e3fe-c159-4bdb-9934-b707a9c50557.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A lawyer who laundered $400 million from the OneCoin scam has been denied a new trial despite arguing there were legal mistakes and false testimony in the original trial in 2019.</p>\n                    <p><p>The lawyer responsible for laundering $400 million from the OneCoin fraud has been denied a motion seeking a new trial, despite a prosecution witness having perjured themselves in the trial against him in 2019.</p><p>According to a Sept. 18 <a href=\"https://www.bloomberg.com/news/articles/2023-09-18/cryptoqueen-s-lawyer-denied-new-trial-despite-her-brother-s-lies?utm_source=telegram&amp;utm_content=crypto&amp;utm_medium=social\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from Bloomberg, 54-year-old lawyer Mark Scott argued that he didn’t know OneCoin was a fraudulent operation at the time and should not be charged for his role in setting up the fund that laundered money for OneCoin founder Ruja “Cryptoqueen” Ignatov. </p><p>Scott was found guilty of money laundering and bank fraud conspiracy in November 2019, with prosecutors finding that Scott earned a total of $50 million through a fraudulent fund that processed payments and transactions siphoned from the OneCoin scheme. </p><p>His legal team has been seeking a new trial since, citing a false testimony from a government witness in the original trial. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">As the <a href=\"https://twitter.com/hashtag/OneCoin?src=hash&amp;ref_src=twsrc%5Etfw\">#OneCoin</a> turns: now money launderer Mark Scott&#39;s motion denied. How many years?<br>Docketed today: &quot;ORDER as to Mark S. Scott&#39;s motions for a new trial pursuant to Federal Rules of Criminal Procedure 29 and 33. the motions are DENIED.&quot; <a href=\"https://t.co/CpstHJAkrr\">https://t.co/CpstHJAkrr</a></p>&mdash; Inner City Press (@innercitypress) <a href=\"https://twitter.com/innercitypress/status/1703865401040347612?ref_src=twsrc%5Etfw\">September 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, during a Sept. 18 hearing, United States District Judge Edgardo Ramos denied the attorneys’ request for a new trial, saying he was unconvinced that “an innocent person may have been convicted” despite the false testimony delivered during the 2019 trial by Konstantin Ignatov. </p><p>Konstantin Ignatov was a government witness who admitted to aiding his sister Ruja in the OneCoin fraud.</p><p>Lawyers for Scott said that they would appeal the decision, claiming that his client was “disappointed that the court did not grant a new trial given the undisputed evidence that the Government’s sole cooperating witness perjured himself.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/onecoin-head-of-compliance-facing-40-year-sentence-after-us-extradition\"><strong><em>OneCoin head of compliance facing 40-year sentence after US extradition</em></strong></a></p><p>OneCoin was launched in 2014, and marketed itself as a cryptocurrency that was similar in structure to Bitcoin. However, it was later revealed to be a pyramid scheme that functioned by luring in new users with fictitious claims and promises of high future earnings.</p><p>The prosecution claimed that Scott used the $50 million in proceeds from OneCoin to finance an expensive lifestyle, buying a swathe of luxury goods including numerous multimillion-dollar homes, watches, sports cars and a 17 meter yacht.</p><p>On Sept. 12, Ramos sentenced OneCoin’s co-founder Karl Greenwood <a href=\"https://cointelegraph.com/news/onecoin-co-founder-greenwood-gets-20-years-us-jail-fraud-money-laundering\">to 20 years in prison</a> in the United States, after he was found guilty of a litany of charges including fraud and money laundering. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In 2014, a woman named Ruja Ignatova launched a fake cryptocurrency named &quot;OneCoin&quot;. Despite the currency never existing, Ruja convinced people all over the world to invest. In 2017, after raking in $4 billion profit, she boarded a plane to Greece and hasn&#39;t been seen since. <a href=\"https://t.co/DoJCfmy0Uj\">pic.twitter.com/DoJCfmy0Uj</a></p>&mdash; Informative &amp; Interesting (@infotale_in) <a href=\"https://twitter.com/infotale_in/status/1636072389007282176?ref_src=twsrc%5Etfw\">March 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ruja Ignatov has not been seen since October 2017 and is currently on the <a href=\"https://cointelegraph.com/news/cryptoqueen-ruja-ignatova-makes-fbi-s-ten-most-wanted-list\">Federal Bureau of Investigation’s Ten Most Wanted List</a>.</p><p><strong><em>Big Questions: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-crypto-deaths/\"><strong><em>What’s with all the crypto deaths? </em></strong></a> </p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-19T04:52:07.000Z",
    "title": "Your Ultimate Guide to Playing Starfield – Platforms, Editions, and Cloud Gaming",
    "url": "https://www.cryptopolitan.com/your-guide-to-playing-starfield/",
    "description": "Bethesda, renowned for its iconic titles like Fallout and Skyrim, has ventured into the uncharted territory of space with its latest open-world role-playing game (RPG) &#8211; Starfield. This eagerly anticipated game has been in development for over five years, promising an enthralling experience of space exploration, combat, and outpost construction. However, its availability on different ... <a title=\"Your Ultimate Guide to Playing Starfield &#8211; Platforms, Editions, and Cloud Gaming\" class=\"read-more\" href=\"https://www.cryptopolitan.com/your-guide-to-playing-starfield/\" aria-label=\"More on Your Ultimate Guide to Playing Starfield &#8211; Platforms, Editions, and Cloud Gaming\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-19T04:49:39.000Z",
    "title": "XRP Price Prediction – Will It Break Through This Key Resistance and Rally?",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-prediction-rally-0-55/",
    "description": "Ripple’s token price is rising above $0.50 against the US Dollar. XRP price could start a fresh rally if it clears the $0.515 and $0.525 resistance levels. Ripple’s token price is attempting a move above $0.515 and $0.525 against the US dollar. The price is now trading above $0.500 and the 100 simple moving average (4 hours). There is a connecting bullish trend line forming with support near $0.500 on the 4-hour chart of the XRP/USD pair (data source from Kraken). The pair might gain bullish momentum if there is a close above $0.515. Ripple’s Token Price Could Accelerate Above $0.515 In the last XRP price prediction, we discussed a possible upward move in Ripple’s XRP against the US Dollar. The price did follow a positive path above the $0.480 pivot level, like Bitcoin and Ethereum. There was a clear move above the $0.50 resistance zone. It climbed above the 50% Fib retracement level of the key decline from the $0.5491 swing high to the $0.4590 low. The bulls are now attempting more gains above the $0.515 resistance. XRP is now trading above $0.500 and the 100 simple moving average (4 hours). Besides, there is a connecting bullish trend line forming with support near $0.500 on the 4-hour chart of the XRP/USD pair. On the upside, immediate resistance is near the $0.515 level. It is close to the 61.8% Fib retracement level of the key decline from the $0.5491 swing high to the $0.4590 low.  The next major resistance is near the $0.5250 level. A close above the $0.525 level could send the price toward the $0.550 barrier. Source: XRPUSD on TradingView.com A successful break above the $0.550 resistance level might start a strong rally toward the $0.585 resistance. Any more gains might call for a test of the $0.600 resistance. Are Dips Limited in XRP? If ripple fails to clear the $0.515 resistance zone, it could start a downside correction. Initial support on the downside is near the $0.50 zone and the trend line. The next major support is at $0.490. If there is a downside break and a close below the $0.490 level, XRP’s price could extend losses. In the stated case, the price could retest the $0.458 support zone. Technical Indicators 4-Hours MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $0.500, $0.490, and $0.458. Major Resistance Levels – $0.515, $0.525, and $0.550."
  }
]