[
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T14:17:49.000Z",
    "title": "Visa taps into Solana to widen USDC payment capability ",
    "url": "https://cointelegraph.com/news/visa-taps-into-solana-to-widen-usdc-payment-capability",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/21f9c113-1a51-4145-bc4e-2fac27b8f36a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The global payments firm has expanded its stablecoin settlement capability to include USDC tokens issued on the Solana blockchain.  </p>\n                    <p><p>Global payments processor <a href=\"https://cointelegraph.com/tags/visa\">Visa </a>has rolled out support for USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) payments settled on the Solana blockchain as its stablecoin offering begins to expand.</p><p>Visa revealed that it is carrying out live and completed pilots with issuers and acquirers, moving millions of USDC tokens between partners across the Etheruem and Solana blockchains to settle fiat-based payments.</p><p>An <a href=\"https://www.businesswire.com/news/home/20230905549860/en/Visa-Expands-Stablecoin-Settlement-Capabilities-to-Merchant-Acquirers\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a> from the payments firm outlined the evolution of VISA’s adoption of USDC through pilots involving Crypto.com to integrations with merchant payment processors Worldpay and Nuvei.</p><p>The integration of USDC issued on Ethereum and Solana into Visa’s ecosystem means that the former can leverage Visa’s treasury and settlement systems to bridge traditional finance with Web3. Visa’s head of crypto Cuy Sheffield added that tapping into stablecoins USDC and blockchains like Ethereum and Solana help improve the speed of cross-border settlement.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ We are excited to announce that Visa has expanded our stablecoin settlement capabilities to merchant acquirers launching pilots with <a href=\"https://twitter.com/Worldpay_Global?ref_src=twsrc%5Etfw\">@Worldpay_Global</a> and <a href=\"https://twitter.com/Nuvei?ref_src=twsrc%5Etfw\">@Nuvei</a> utilizing the Solana blockchain<a href=\"https://t.co/E0TjMO5xiH\">https://t.co/E0TjMO5xiH</a></p>&mdash; Cuy Sheffield (@cuysheffield) <a href=\"https://twitter.com/cuysheffield/status/1699031109080945049?ref_src=twsrc%5Etfw\">September 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Visa began testing USDC in 2021 in collaboration with Crypto.com to test stablecoin settlement on the issuance side. The resulting pilot leveraged Ethereum-based USDC to receive payments from Crypto.com for cross-border volume on its Australian card program. </p><p>Settlements for cross-border purchases made on Crypto.com Visa cards had previously required multiple day currency conversion processes and accrued wire transfer fees. As a result the crypto exchange now uses USDC for settlement obligations for its Australian Visa card.</p><p><a href=\"https://cointelegraph.com/news/visa-card-crypto-blockchain-gas-fees-payment\"><strong><em>Related: Visa explores crypto gas fees payments through cards</em></strong></a></p><p>Crypto.com also uses a Visa treasury-managed account with USD Coin issuer Circle to send USDC across border on the Ethereum blockchain which reportedly reduces the length and complexity of international wire transfers.</p><p>Circle co-founder and CEO Jeremy Allaire said that the partnership marks a fundamental blockchain innovation that could alter payments and commerce:</p><blockquote>“Circle built USDC to provide a functional digital dollar that could move at the speed of the internet to facilitate secure, reliable payments.”</blockquote><p>The integration of USDC also allows Visa to send funds to USDC acquirers including Worldpay and Nuvei, which is expected to increase settlement times for merchants using their services.</p><p>The payment processors are then able to route USDC payments to merchants they serve, connecting Visa’s traditional fiat ecosystem through to stablecoins and the wider cryptocurrency space that they serve.</p><p>Worldpay merchant solutions president Jim Johnson said that the Visa’s USDC settlement capability would enable it to offer merchants more choices for receiving funds and better manage its treasury operations. </p><p>In prior conversation with Cointelegraph during Money20/20 in Amsterdam in June 2023, Nabil Manji, Worldpay head of crypto and web3, outlined how the firm had partnered with Coinbase back in 2013 to allow the exchange to become the first to accept fiat-based card payments worldwide.</p><p>Commenting on the latest developments, Manji said Visa’s new USDC settlement service is the first step in allowing Worldpay’s clients to access faster, more cost-efficient settlement of consumer payments.</p><blockquote>\"It opens the door to exploring future enhancements such as 24/7/365 settlement availability and real-time or multiple daily settlements, all of which can help to accelerate cross-border commerce.\"</blockquote><p>As Cointelegraph previously reported, Visa has begun exploring a solution to make off-chain gas fee settlements for Ethereum using a <a href=\"https://twitter.com/zksync/status/1595085989713625088?lang=en\" target=\"_blank\" rel=\"noopener nofollow\">Paymaster smart contract</a>. These types of smart contracts are able to make payments for users and execute logic for various transaction capabilities.</p><p><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><em>Magazine: Deposit risk: What do crypto exchanges really do with your money?</em></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-05T14:30:15.000Z",
    "title": "Visa Expands Stablecoin Settlement to Solana and Merchant Acquirers",
    "url": "https://news.bitcoin.com/visa-expands-stablecoin-settlement-to-solana-and-merchant-acquirers/",
    "description": "<img width=\"696\" height=\"392\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/solanaaavisa.webp\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Visa Expands Stablecoin Settlement to Solana and Merchant Acquirers\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" />Visa is taking a step in advancing digital currency adoption by expanding its stablecoin settlement capabilities to the Solana blockchain network. The payments giant also announced new pilot programs with merchant acquirers Worldpay and Nuvei to explore streamlining settlement in the Circle-issued stablecoin USDC. Visa Expands Stablecoin Settlement to Solana; Partners With Worldpay and Nuvei [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T14:29:39.000Z",
    "title": "BitGo and Hana Bank team up for digital asset custody in South Korea",
    "url": "https://www.cryptopolitan.com/bitgo-and-hana-bank-team-up-for-digital-asset-custody-in-south-korea/",
    "description": "BitGo, a global leader in digital asset custody, has joined forces with South Korea&#8217;s Hana Bank to launch digital asset custody (DAC) services. Targeting the second half of 2024 for the rollout, the partnership aims to navigate South Korea’s rapidly evolving crypto regulatory landscape. BitGo recently closed a Series C financing round, securing $100 million ... <a title=\"BitGo and Hana Bank team up for digital asset custody in South Korea\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitgo-and-hana-bank-team-up-for-digital-asset-custody-in-south-korea/\" aria-label=\"More on BitGo and Hana Bank team up for digital asset custody in South Korea\">Read more</a>"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-05T14:30:59.000Z",
    "title": "Bitcoin Halving Could Be Even Bigger for BTC Than in the Past, Says Wall Street Veteran Caitlin Long",
    "url": "https://dailyhodl.com/2023/09/05/bitcoin-halving-could-be-even-bigger-for-btc-than-in-the-past-says-wall-street-veteran-caitlin-long/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/Bitcoin-Halving-Could-Be.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/Bitcoin-Halving-Could-Be.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/Bitcoin-Halving-Could-Be.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/Bitcoin-Halving-Could-Be.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/Bitcoin-Halving-Could-Be.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/Bitcoin-Halving-Could-Be.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/Bitcoin-Halving-Could-Be.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The CEO of Custodia Bank thinks the next Bitcoin (BTC) halving could have an even bigger impact than previous halving events. In a new interview with Scott Melker, Caitlin Long says that she agrees with a new model put out by digital assets-focused investment firm Pantera Capital. Pantera&#8217;s model predicts Bitcoin will hit $147,843 in early [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/05/bitcoin-halving-could-be-even-bigger-for-btc-than-in-the-past-says-wall-street-veteran-caitlin-long/\">Bitcoin Halving Could Be Even Bigger for BTC Than in the Past, Says Wall Street Veteran Caitlin Long</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]