[
  {
    "source": "Decrypt",
    "date": "2023-09-04T19:27:32.000Z",
    "title": "Solana Is the ‘Most Loved Altcoin Among investors’, Says CoinShares",
    "url": "https://decrypt.co/154920/solana-most-loved-altcoin-among-investors-coinshares-report",
    "description": "Investors have been withdrawing from altcoin crypto funds, but Solana is an exception. "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-04T19:35:51.000Z",
    "title": "Crypto betting platform Stake silent on reported $41M fund drain",
    "url": "https://cryptoslate.com/crypto-betting-platform-stake-mum-on-reported-41m-fund-drain/",
    "description": "<p>Several blockchain security firms, including Peckshield, have reported the suspicious movements of significant funds on crypto-based sports betting platform Stake. Cyvers platform first reported the incident, noting that about $16 million of stablecoins were converted into Ethereum (ETH). On-chain sleuth ZachXBT corroborated the report, adding that &#8220;another $25.6M was drained on Binance Smart Chain (BSC) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/crypto-betting-platform-stake-mum-on-reported-41m-fund-drain/\">Crypto betting platform Stake silent on reported $41M fund drain</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-04T19:30:45.000Z",
    "title": "Lightning Network Sees Sharp 14% Decline in Capacity After Hitting Peak",
    "url": "https://news.bitcoin.com/lightning-network-sees-sharp-14-decline-in-capacity-after-hitting-peak/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/steam-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Lightning Network Sees Sharp 14% Decline in Capacity After Hitting Peak\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/steam-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/steam-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/steam-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/steam-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/steam-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/steam-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/steam.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Data reveals that the Lightning Network&#x2019;s capacity, or the total value of open channels, has dwindled by over 14% since July 9, 2023. Following a peak of 5,468 BTC, an estimated 786 BTC valued at $20.32 million has been withdrawn from the secondary network. From Peak to Plunge: Lightning Network&#x2019;s Capacity Drops by Over $20M [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-04T19:25:00.000Z",
    "title": "China’s economic rollercoaster sparks policymaker alarm bells",
    "url": "https://www.cryptopolitan.com/chinas-economic-rollercoaster-policymaker/",
    "description": "The ebb and flow of China&#8217;s economic status have not only kept global spectators on edge, but now, alarm bells are resounding in the very halls where policymakers decide the nation&#8217;s fate. It seems the Dragon&#8217;s economic vitality, once envied worldwide, is now treading on thin ice. Dwindling Trade and Inflation Indicators: A Prelude to ... <a title=\"China&#8217;s economic rollercoaster sparks policymaker alarm bells\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chinas-economic-rollercoaster-policymaker/\" aria-label=\"More on China&#8217;s economic rollercoaster sparks policymaker alarm bells\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-04T19:17:36.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and platform they need to build blockchain solutions. At this time, we can only make educated guesses about ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-04T19:36:59.000Z",
    "title": "Seoul to target North Korea’s illicit crypto assets with a new cyber bill",
    "url": "https://crypto.news/seoul-to-target-north-koreas-illicit-crypto-assets-with-a-new-cyber-bill/",
    "description": "South Korea plans new legislation and a cybersecurity committee to combat North Korean crypto theft and strengthen digital defenses"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-04T19:21:33.000Z",
    "title": "USDT’s market cap drops for the first time in 2023",
    "url": "https://crypto.news/usdts-market-cap-drops-for-the-first-time-in-2023/",
    "description": "USDT market cap has declined for the first time in almost a year, signaling a potential shift in the stablecoin landscape"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-04T19:30:03.000Z",
    "title": "XRP Summer Showdown: Trading Hype Versus Price Reality, What Lies Ahead?",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-summer-showdown-trading-hype-versus-price-reality-what-lies-ahead/",
    "description": "XRP, the fifth-largest cryptocurrency in the market, has entered a phase of macro consolidation following a significant decline that began on July 20. This consolidation has maintained the token&#8217;s price within a range of $0.4858 and $0.5505, before Ripple Labs&#8217; legal victory against the US Securities and Exchange Commission on July 13.  XRP Consolidation Continues Despite Strong Trading Activity According to insights from crypto market data provider Kaiko, XRP demonstrated extreme trade volume during the summer. XRP&#8217;s average trade volume in the previous month reached $462 million, four times higher than the following most prominent altcoins by trade volume. The question arises as to why XRP failed to sustain its price gains despite its impressive trade volume.  Analyzing the average share of sell volume for XRP provides some insights. Notably, the largest Korean exchange, Upbit, and OKX experienced significant selling pressure, while buying activity was more prominent on US-based Coinbase throughout the previous month. Related Reading: Shiba Inu Whales Begin Accumulation As Shibarium Grows Another interesting observation is the rise in average trade size for XRP on Coinbase, surpassing all other top ten altcoins.  This suggests that buying demand may have been driven by large traders in the United States, as investors regained access to the token following the July court ruling.  However, it is essential to note that even though XRP tops the list on offshore markets, its share of trading volume in the United States remains lower, ranking it as the sixth most traded altcoin by cumulative trade volume. Currently, XRP is trading at $0.5063, displaying a stable price within 24 hours. Moreover, the token has maintained a consistent consolidation phase, experiencing a slight decrease of 2.7% and 1.4% over the past seven and fourteen days, respectively.  This raises whether XRP&#8217;s uptrend will prevail or if further downside movements are looming. Is A Bullish Resurgence Or Downtrend Imminent? Crypto analyst Egrag Crypto recently took to the social media platform X (formerly known as Twitter) to present two contrasting scenarios for XRP&#8217;s price movement.  The first scenario suggested a potential dip to $0.43 or even $0.35, which could be seen as a shakeout before a rebound. The second scenario proposed a more optimistic outlook, with XRP potentially aiming for heights of $0.60 and $0.67 before skyrocketing to new levels. To gain further insights into the likelihood of these scenarios, it is crucial to examine XRP&#8217;s resistance and support lines on the daily chart above. The chart reveals that while surpassing the next resistance level of $0.5401 and regaining bullish momentum, XRP could potentially experience a substantial 27% uptrend toward $0.6700, as predicted by Egrag Crypto. However, the token currently faces two significant hurdles in achieving this. XRP&#8217;s 200-day and 50-day Moving Averages (MAs) can act as solid resistance levels if the token&#8217;s trading volume is not accompanied by sufficient buying pressure. Presently, XRP is trading below these two lines, which adds to the challenge of surpassing the resistance. If XRP fails to overcome these resistances and sustain its consolidation phase, another correction may soon be on the horizon for the token. Related Reading: FTX Wallets Begin Moving Tokens One Month To Sam Bankman-Fried’s Trial On the other hand, bullish investors will need to defend the nearest support floor for XRP at $0.4524. If this level is breached, the token could decline further to the $0.3495 zone or even the $0.2854 line, representing XRP&#8217;s one-year support. Considering the various scenarios and the resistance and support lines depicted in the chart, the absence of catalysts that could propel XRP to higher price territories, coupled with a failed attempt to maintain its macro consolidation zone, may lead XRP towards continuing its downtrend and potentially reaching a new yearly low. Featured image from iStock, chart from TradingView.com"
  }
]