[
  {
    "source": "CoinDesk",
    "date": "2023-11-16T21:50:42.000Z",
    "title": "California, Texas Among States Accusing GS Partners of Misleading Crypto Investors",
    "url": "https://www.coindesk.com/policy/2023/11/16/california-texas-among-states-accusing-gs-partners-of-misleading-crypto-investors/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Multiple U.S. states have ordered GS Partners to halt operations, accusing the company of defrauding investors in a number of crypto schemes, including tokenized pieces of a Dubai skyscraper and stakes of metaverse property."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-16T21:44:06.000Z",
    "title": "Bitcoin Dips 5% to Under $36K as Crypto Rally Runs Into Wall, Liquidating $340M in 2 Days",
    "url": "https://www.coindesk.com/markets/2023/11/16/bitcoin-dips-5-to-under-36k-as-crypto-rally-runs-into-wall-liquidating-340m-in-2-days/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The SEC delaying decision about spot BTC ETFs could leave the market without a catalyst until early January, halting the crypto rally's momentum, K33 analysts said this week."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-16T21:34:21.000Z",
    "title": "Strike Rolls Out Bitcoin Purchases To Users Globally",
    "url": "https://www.coindesk.com/business/2023/11/16/strike-rolls-out-bitcoin-purchases-to-users-globally/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin payments firm Strike has expanded its services on a global scale, now allowing users in 36 countries (soon to be 65+) beyond the U.S. to buy bitcoin through the app, founder Jack Mallers announced in a blog post Thursday."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-16T21:49:21.000Z",
    "title": "Protocol Village: Fhenix, Developer of 'Confidential Blockchain,' Now Plans Ethereum Rollups",
    "url": "https://www.coindesk.com/tech/2023/11/15/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Nov. 16-22, with live updates throughout."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-16T21:25:29.000Z",
    "title": "Polygon Version of Bitcoin Ordinals Sends Gas Fees Skyrocketing",
    "url": "https://decrypt.co/206415/polygon-version-of-bitcoin-ordinals-sends-gas-fees-skyrocketing",
    "description": "Before the drop, Polygon gas fees had increased 1,000% compared to the same time a day ago."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-16T21:18:11.000Z",
    "title": "Why Cathie Wood Is Bullish on Solana",
    "url": "https://decrypt.co/206390/why-cathie-wood-is-bullish-on-solana",
    "description": "\"If you look at Ethereum it was faster and cheaper than Bitcoin in the day. Solana is faster and more cost-effective than Ethereum,\" Wood pointed out."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-16T21:44:42.000Z",
    "title": "Public needs to know blockchain use cases, AI needs regulation now — Andrew Yang",
    "url": "http://cointelegraph.com/news/public-needs-know-blockchain-use-cases-ai-artificial-intelligence-needs-regulation-now-andrew-yang",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/c842549c-d07c-489c-9dfc-66a718c831d1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The former presidential candidate spoke at NABS about opportunities the United States may be missing to blockchain and AI for public good. </p>\n                    <p><p>Andrew Yang, former candidate for United States president and New York City mayor and founder of the Forward Party, had sobering observations about the uses of blockchain, or its lack of use, in the United States and U.S. regulation of artificial intelligence (AI) when he spoke Nov. 16 at the North American Blockchain Summit (NABS) in Fort Worth, TX.</p><p>Yang, who described himself as “enormous believer in smart money, smart currencies,” said he saw blockchain and Web3 technology in a sorry state, especially in the United States, which creates the risk of firms fleeing overseas. Part of the problem is public perception, Yang said:</p><blockquote>“The way to avoid this fate it is to have positive use cases for blockchain in solving problems for the American people. […] Unfortunately, what they see in the news is just Sam Bankman-Fried and FTX.”</blockquote><p> “We have not scratched the surface of what these tools can do to combat poverty,” Yang said. He saw other potential applications of blockchain technology in civic life as well. “Something I'm super passionate about, why is it that we can't vote on our mobile phones?” he said.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ftx-collapse-could-trigger-appetite-for-harsher-regulation-says-andrew-yang\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ftx-collapse-could-trigger-appetite-for-harsher-regulation-says-andrew-yang/amp\">FTX collapse could trigger ‘appetite’ for harsher regulation, says Andrew Yang</a></em></strong></p><p>Yang raised concerns about AI too, saying U.S. policy on  AI is “fairly limited, maybe even incoherent.” Yang was among the 2,600 tech leaders and researchers who signed an open letter calling for a moratorium on training AI systems more powerful than GPT-4. He reiterated at NABS, “We may be getting ahead of ourselves with the development of these generative models.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/d8be1403-8a2e-462f-94f9-9fdd56ef20db.jpg\"><figcaption style=\"text-align: center;\">Andrew Yang at NABS on Nov. 16. Source: Turner Wright, Cointelegraph</figcaption></figure><p>AI is intimately tied to politics, Yang said, because of the effect it could have on campaigning and public life in general. He said:</p><p><strong>“You saw a deep fake of the Pentagon on fire and the markets moved on that.”</strong></p><p>The U.S. regulatory approach — “let's wait until the fiasco happens and then we'll have hearings about it afterwards,” Yang called it — and the “winner-take-all” economy is part of the problem. In that atmosphere, the benefits of the technological advances will be divided highly unevenly, making the existing divisions in U.S. political life worse.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">An IPR special correspondent attended the recent kickoff of the Florida Forward Party, where Andrew Yang stated he is backing Rep. Dean Phillips over President Joe Biden in the Democratic primary. Follow IPR for more! <a href=\"https://twitter.com/hashtag/flapol?src=hash&ref_src=twsrc%5Etfw\">#flapol</a><a href=\"https://t.co/7jl6oR3lsv\">https://t.co/7jl6oR3lsv</a></p>— Independent Political Report (@I_P_R) <a href=\"https://twitter.com/I_P_R/status/1725227234254791142?ref_src=twsrc%5Etfw\">November 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Social media is governed by Section 230 of the Communications Decency Act of 1996, Yang said. Facebook didn’t even exist in 1996. So, while legislation on AI is expected to pass soon in the European Union, “We're in danger of falling right into space because our legislative body is not functioning at a high level.”</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-city-guide-to-new-york/\">Crypto City: Guide to New York</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-16T21:55:10.000Z",
    "title": "Texas, Alabama securities regulators allege fraud against GS Partners in multiple crypto schemes",
    "url": "https://cryptoslate.com/texas-alabama-securities-regulators-allege-fraud-against-gs-partners-in-multiple-crypto-schemes/",
    "description": "<p>Securities regulators in Texas and Alabama have accused a group of companies tied to a metaverse real estate project of fraudulently raising millions from investors. The Texas State Securities Board last week issued an emergency cease and desist order against GS Partners, Swiss Valorem Bank, and several related entities controlled by Josip Heit. The Alabama [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/texas-alabama-securities-regulators-allege-fraud-against-gs-partners-in-multiple-crypto-schemes/\">Texas, Alabama securities regulators allege fraud against GS Partners in multiple crypto schemes</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-16T21:05:05.000Z",
    "title": "Terraform Labs’ Do Kwon loses appeal in Montenegro passport fraud case",
    "url": "https://cryptoslate.com/terraform-labs-do-kwon-loses-appeal-in-montenegro-passport-fraud-case/",
    "description": "<p>Do Kwon, the founder and former CEO of Terraform Labs, lost an appeal after being convicted of passport fraud, a Montenegro court ordered on Nov. 16. In June, Kwon and fellow Terra associate Han Chang-joon were convicted of falsifying passport documents by the Basic Court in Podgorica, Montenegro&#8217;s capital city. Both defendants were sentenced to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/terraform-labs-do-kwon-loses-appeal-in-montenegro-passport-fraud-case/\">Terraform Labs&#8217; Do Kwon loses appeal in Montenegro passport fraud case</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-16T21:16:49.000Z",
    "title": "US Presidential Candidate Vivek Outlines Pro-Crypto Policy Vision",
    "url": "https://cryptobriefing.com/us-presidential-candidate-vivek-crypto-policy-vision/?utm_source=feed&utm_medium=rss",
    "description": "Presidential candidate Vivek unveils a policy vision to liberate crypto innovation, make rules clear, and enable financial independence."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-16T20:42:19.000Z",
    "title": "Market Analyst Forecasts Surge in Ethereum Rival Avalanche, Offers Bitcoin and Chainlink Insights",
    "url": "https://www.cryptoglobe.com/latest/2023/11/market-analyst-forecasts-surge-in-ethereum-rival-avalanche-offers-bitcoin-and-chainlink-insights/",
    "description": "A popular crypto market analyst recently provided insights on the potential future movements of Avalanche (AVAX), an Ethereum competitor, along with updates on Bitcoin (BTC) and Chainlink (LINK). These insights, shared with nearly 200,000 followers on social media, offer a glimpse into the expected market trends for these cryptocurrencies. The analyst, known as Altcoin Sherpa, […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-16T20:40:12.000Z",
    "title": "Solana (SOL) and Ripple (XRP) Price Prediction, Everlodge (ELDG) Continues Bullish Rise",
    "url": "https://cryptodaily.co.uk/2023/11/solana-sol-and-ripple-xrp-price-prediction-everlodge-eldg-continues-bullish-rise",
    "description": "The cryptocurrency market is constantly moving, with each project striving to offer unique features and solutions to address various issues."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-16T22:00:13.000Z",
    "title": "Tether Charts Strategic Course in Bitcoin Mining, Plans $500 Million Infusion",
    "url": "https://news.bitcoin.com/tether-charts-strategic-course-in-bitcoin-mining-plans-500-million-infusion/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/sh666-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Tether Charts Strategic Course in Bitcoin Mining, Plans $500 Million Infusion\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/sh666-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sh666-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sh666-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sh666-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sh666-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sh666-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sh666.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Tether Holdings Ltd., the issuer of the leading stablecoin in terms of market value and trade volume, is poised to become a formidable player in the mining industry, as revealed by its CEO, Paolo Ardoino. On Thursday, Ardoino announced the company&#x2019;s intention to channel approximately $500 million into its mining business over the next six [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-16T21:00:47.000Z",
    "title": "Xi Jinping Vows No Hegemony in China’s Approach to US, Aiming for Stable Ties",
    "url": "https://news.bitcoin.com/xi-jinping-vows-no-hegemony-in-chinas-approach-to-us-aiming-for-stable-ties/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/2204004040-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Xi Jinping Vows No Hegemony in China&#039;s Approach to US, Aiming for Stable Ties\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/2204004040-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/2204004040-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/2204004040-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/2204004040-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/2204004040-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/2204004040-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/2204004040.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Wednesday, Chinese President Xi Jinping delivered a speech emphasizing China&#8217;s aspiration for harmonious ties with the United States. The Chinese head of state conveyed his vision of an enhanced &#8220;friendship in the new era&#8221; between the two influential countries. He firmly declared that &#8220;China will never pursue hegemony or expansion.&#8221; Despite Reported Tensions, China&#8217;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-16T20:47:51.000Z",
    "title": "Dubai’s virtual asset regulatory authority appoints new CEO as it commences fining spree",
    "url": "https://www.cryptopolitan.com/dubais-virtual-asset-regulatory-authority-appoints-new-ceo-as-it-commences-fining-spree/",
    "description": "Dubai’s Virtual Assets Regulatory Authority (VARA) in a press release has announced that Mathew White will be the new CEO of VARA as the authority moves towards the next phase of ramping up to full scale market operations. This comes as VARA gears up towards fining a dozen crypto firms. As per the press release, ... <a title=\"Dubai&#8217;s virtual asset regulatory authority appoints new CEO as it commences fining spree\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dubais-virtual-asset-regulatory-authority-appoints-new-ceo-as-it-commences-fining-spree/\" aria-label=\"More on Dubai&#8217;s virtual asset regulatory authority appoints new CEO as it commences fining spree\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-16T21:37:06.000Z",
    "title": "Project Dojo aims to empower Muskonomy via innovation, technology, and vision",
    "url": "https://crypto.news/project-dojo-aims-to-empower-muskonomy-via-innovation-technology-and-vision/",
    "description": "Project Dojo combines the appeal of crypto with the capabilities of machine learning by using an in-house supercomputer while focusing on sustainability"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-16T21:31:40.000Z",
    "title": "Bitcoin’s Taproot Wizards secures $7.5m funding from Standard Crypto",
    "url": "https://crypto.news/bitcoins-taproot-wizards-secures-7-5m-funding-from-standard-crypto/",
    "description": "Bitcoin's Taproot Wizards project received a fresh $7.5 million investment from Standard Crypto to transform the blockchain ecosystem and compete with major players like Ethereum and Solana."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-16T21:28:48.000Z",
    "title": "FBI uncovers multimillion-dollar crypto fraud scheme",
    "url": "https://crypto.news/fbi-uncovers-multimillion-dollar-crypto-fraud-scheme/",
    "description": "Three individuals have been arrested for defrauding New York-area banks of over $10 million by exploiting security vulnerabilities and converting the stolen funds into crypto."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-16T22:00:09.000Z",
    "title": "Bitcoin Open Interest Tops 19-Month High: Historical Data Shows What To Expect",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-open-interest-19-month-high/",
    "description": "The Bitcoin open interest can often be an indication of where the BTC price might be headed next depending on whether or not the metric is rising or falling. This time around, the Bitcoin open interest has risen drastically, hitting 19-month highs in the process. Using historical data, it is possible to extrapolate what this means for the crypto’s price, especially as investors remain very bullish. Bitcoin Open Interest Surges To $17.04 Billion In an interesting turn of events, the Bitcoin open interest has been rising quickly across various exchanges. In the last 24 hours alone, this metric rose by a cumulative 7.89% across all exchanges in the space, bringing the total open interest to 454,150 BTC worth a staggering $17.04 billion. Related Reading: Ethereum Breakout: Analyst Explains Why The King Of The Altcoins Is Destined For $10,000 For now, most of the Bitcoin open interest is concentrated across the CME, Binance, and ByBit exchanges. But perhaps what is even more interesting is that these open interest levels represent a 19-month high. Source: CoinGlass According to the data presented on the CoinGlass website, the last time that the Bitcoin open interest moved in this fashion and to this high was back in March 2022, before the historical Terra LUNA crash that sent the market into a prolonged bear market stretch. This means that the last time that the Bitcoin open interest rose this much was during a time when investors were still very much in the throes of bull run euphoria. As such, the historical performance of the BTC price back then in relation to the open interest could serve as a guide to what might happen to the digital asset’s price next. BTC price finds support at $37,400 &#124; Source: BTCUSD on Tradingview.com Historical Data Says BTC Price Will Surge Similar to the current trend, the Bitcoin open interest had surged from around 38,000 BTC to over 44,000 BTC in the space of a month, and the BTC price followed quickly. This trend saw the price rise in March 2022 from $38,700 to over $47,000 before the month was over. Related Reading: Stunning Correlation Emerges Between XRP And XLM, What’s Going On? Going by this historical performance and assuming Bitcoin sticks to this trend, the rally may be far from over. The BTC price is also sitting at a similar price point at $37,500 and a similar surge could bring its price toward $45,000 before the month is over. However, there is also the possibility that the open interest could peak at this level and begin to decline. Once this happens, then in the same fashion as in April 2022, the BTC price could begin to decline as the open interest drops. A similar crash would send the price back down toward $27,000. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Yahoo Finance, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-16T21:00:10.000Z",
    "title": "Here’s the Price Range Where Bitcoin Could ‘Hold or Fold’ in Latest Correction: Glassnode",
    "url": "https://dailyhodl.com/2023/11/16/heres-the-price-range-where-bitcoin-could-hold-or-fold-in-latest-correction-glassnode/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/price-range-where-bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/price-range-where-bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/price-range-where-bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/price-range-where-bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/price-range-where-bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/price-range-where-bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/price-range-where-bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analytics firm Glassnode says that Bitcoin (BTC) needs to hold one key price range or a massive sell-off is likely. In a new analysis, the firm says that Bitcoin transaction data shows a key support level of $30,000. Says Glassnode, &#8220;Where might Bitcoin hold or fold? Our latest &#8216;Chart Of The Week&#8217; video pinpoints [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/16/heres-the-price-range-where-bitcoin-could-hold-or-fold-in-latest-correction-glassnode/\">Here’s the Price Range Where Bitcoin Could ‘Hold or Fold’ in Latest Correction: Glassnode</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-16T20:55:39.000Z",
    "title": "Analyst Predicts New Highs for Bitcoin Are ‘Closer’ Than Previously Thought, Breaks Down Three Surging Altcoins",
    "url": "https://dailyhodl.com/2023/11/16/analyst-predicts-new-highs-for-bitcoin-are-closer-than-previously-thought-breaks-down-three-surging-altcoins/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/08/btc-wallet.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/08/btc-wallet.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/08/btc-wallet.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/08/btc-wallet.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/08/btc-wallet.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/08/btc-wallet.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/08/btc-wallet.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst thinks new highs for king crypto Bitcoin (BTC) may be closer than expected. Crypto trader Michaël van de Poppe tells his 673,300 followers on the social media platform X that any potential dips in BTC&#8217;s rise could be potential investing opportunities for traders. &#8220;Actually, new highs are closer than we think [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/16/analyst-predicts-new-highs-for-bitcoin-are-closer-than-previously-thought-breaks-down-three-surging-altcoins/\">Analyst Predicts New Highs for Bitcoin Are ‘Closer’ Than Previously Thought, Breaks Down Three Surging Altcoins</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]