[
  {
    "source": "CoinDesk",
    "date": "2023-07-17T14:00:00.000Z",
    "title": "=nil; Foundation and Semiconductor Startup Partner to Collaborate on ZK Proofs Software, Hardware",
    "url": "https://www.coindesk.com/tech/2023/07/17/nil-foundation-and-semiconductor-startup-partner-to-collaborate-on-zk-proofs-software-hardware/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The effort will accelerate the deployment of zero-knowledge proofs, one of the hottest trends in blockchain technology, they said."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-17T14:00:14.000Z",
    "title": "G20 Body Issues 9 Regulatory Recommendations to Rein in Crypto Industry",
    "url": "https://decrypt.co/148873/g20-body-issues-9-regulatory-recommendations-rein-crypto-industry",
    "description": "The FSB said it had taken into account events of the past year, including the collapse of FTX and Terra, in its newest recommendations."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-17T13:46:02.000Z",
    "title": "zkSync Era Launches Boojum: Consumer-Friendly STARK-based Proof System",
    "url": "https://cryptobriefing.com/zksync-era-launches-boojum/?utm_source=feed&utm_medium=rss",
    "description": "Ethereum layer-2 scaling solution zkSync Era is stepping into the next stage with Boojum, its STARK-based proof system. Promising enhanced transparency and heightened transaction speed, Boojum operates on consumer-grade general..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-17T13:49:29.000Z",
    "title": "Xangle and Republic Crypto Form Strategic Partnership to Power Korean Enterprises’ Adoption of Web3",
    "url": "https://cryptodaily.co.uk/2023/07/xangle-and-republic-crypto-form-strategic-partnership-to-power-korean-enterprises-adoption-of-web3",
    "description": "<p>Seoul, South Korea, July 17th, 2023, Chainwire</p><p>Xangle, a leading web3 data and intelligence platform based in South Korea, has formed a strategic partnership with Republic Crypto, a leading US-based advisory firm that helps global enterprises seamlessly enter the web3 space.</p><p>To date, Xangle has primarily focused on providing web3 data, intelligence and advisory services to Korean enterprises, arming them with the essential tools and knowledge to make informed decisions regarding web3 strategy and its application to their business models. With this strategic partnership, Xangle clients now can gain access to Republic Crypto's renowned experience in web3 execution, offering clients a comprehensive toolkit that includes blockchain infrastructure setup, digital asset management, tokenomics design, and more.</p><p>\"The partnership with Republic Crypto marks a significant milestone for the web3 industry in Asia,\" stated James Kim, Co-Founder and CEO of Xangle. \"Enterprises in Korea now have access to comprehensive strategic and seamless implementation support for their blockchain initiatives. We are thrilled to be at the forefront of onboarding the next wave of mainstream web3 adoption, leveraging the exciting technologies that have matured in recent years.\"</p><p>\"We are excited to work alongside Xangle in expanding our advisory presence in Asia and driving web3 adoption,\" said Bryan Myint, Co-Founder and Head of Republic Crypto&rsquo;s web3 advisory division. \"Asia is positioning itself as a hub for the future wave of web3 innovation and adoption, and our aim is to support any company looking to dive into this exciting new phase of the economy.\"</p><p>This strategic partnership positions Xangle and Republic Crypto to empower enterprises on their path to embracing web3 technologies and seizing the opportunities in the evolving digital and financial landscape. Together, they enable businesses in Korea and other Asian technology hubs to expand into the decentralized frontier, leveraging the combined expertise and dedicated support of both companies. With this alliance, enterprises can confidently navigate the web3 space and unlock the full potential of an increasingly decentralized future.</p><p class=\"ql-align-justify\">About Xangle</p><p class=\"ql-align-justify\">Xangle is one of the leading web3 data &amp; intelligence platforms based in South Korea, providing essential on-chain data infrastructure, solutions &amp; research for various web2&amp;3 stakeholders. Our mission is to foster sustainable growth and mass adoption of blockchain technology via educating the mass by offering comprehensive and granular insights on the blockchain industry by sector, therefore enabling more informed decision making. We also aim to facilitate Web3 adoption from traditional Web2 giants in their respective industries by providing advisory services and bridging with notable Web3 projects.</p><p class=\"ql-align-justify\">About Republic Crypto</p><p class=\"ql-align-justify\">Republic Crypto offers web3 advisory services, blockchain infrastructure, and digital asset management to the world&rsquo;s most ambitious builders and investors. Republic Crypto is part of Republic, a global technology firm pioneering the digital transformation of finance. Republic&rsquo;s ecosystem has made it possible for 2.5M+ community members to deploy $2.5B+ into 2000+ private ventures.</p><p></p><p></p>ContactItai ElizurMarketAcrossitai@marketacross.com"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T14:06:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. BNB prices have dropped by 23.95% since April 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T13:56:58.000Z",
    "title": "China’s Q2 economic performance raises concerns",
    "url": "https://www.cryptopolitan.com/chinas-economic-performance-raises-concerns/",
    "description": "Beneath the glimmer of its global economic prowess, China finds itself facing a worrying slowdown in Q2. Amid plummeting exports, dwindling retail sales, and a sluggish property market, the Eastern giant witnessed a mere 0.8% GDP growth compared to the prior quarter, sparking international concerns. This lukewarm performance serves as a sobering reminder that the ... <a title=\"China&#8217;s Q2 economic performance raises concerns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chinas-economic-performance-raises-concerns/\" aria-label=\"More on China&#8217;s Q2 economic performance raises concerns\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T13:58:43.000Z",
    "title": "Dogecoin, Shiba Inu Coin and Scorpion Casino Token: Overcoming Cryptocurrency Adoption Challenges",
    "url": "https://www.crypto-news-flash.com/dogecoin-shiba-inu-coin-and-scorpion-casino-token-overcoming-cryptocurrency-adoption-challenges/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-shiba-inu-coin-and-scorpion-casino-token-overcoming-cryptocurrency-adoption-challenges",
    "description": "<img width=\"719\" height=\"377\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/WPRO-AAS.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/WPRO-AAS.png 719w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/WPRO-AAS-300x157.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/WPRO-AAS-351x185.png 351w\" sizes=\"(max-width: 719px) 100vw, 719px\" />Investing in presale tokens has become increasingly popular, offering the potential for substantial returns and the opportunity to participate in the growth of emerging cryptocurrencies. As tokens fight to become the next crypto to explode in 2023, adoption challenges pose a real issue that has to be overcome first. With their meme-based origins, Dogecoin (DOGE) [...]"
  }
]