[
  {
    "source": "CryptoSlate",
    "date": "2023-08-06T13:00:24.000Z",
    "title": "Growing supply diminishes stablecoin Bitcoin buying power",
    "url": "https://cryptoslate.com/growing-supply-diminishes-stablecoin-bitcoin-buying-power/",
    "description": "<p>The Stablecoin Supply Ratio (SSR) is a vital market indicator that has been steadily climbing since the start of the year, signifying a decrease in the purchasing power of stablecoins. The SSR is a metric that provides insight into the supply and demand dynamics between Bitcoin (BTC) and the U.S. dollar. The calculation of SSR [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/growing-supply-diminishes-stablecoin-bitcoin-buying-power/\">Growing supply diminishes stablecoin Bitcoin buying power</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-06T12:47:54.000Z",
    "title": "Shiba Inu: More Bite Than Bark Over The Weekend With Over 15% Jump",
    "url": "https://www.newsbtc.com/all/shiba-inu-more-bite-than-bark-2/",
    "description": "This weekend, Shiba Inu is experiencing an extended upward traction, with the dog-themed meme coin sharply rising since late Friday. Shiba Inu made a sharp rally after exiting a phase of consolidation on Friday afternoon. At the time of writing, the meme coin was trading at $0.0000097, up 9.2% in the last 24 hours, data from crypto market tracker Coingecko shows. The highlight of SHIB&#8217;s solid upward trajectory was in the seven-day timeframe, registering an impressive 15.1% rally. At last check, the coin&#8217;s 24-hour volume climbed 236% to $683 million. Its market cap also increased by 12.3% to $5.81 billion. Related Reading: Bone ShibaSwap Among Weekend 100 Biggest Hitters With 25% Rally Source: Coingecko Price Boost From Binance &#8216;Loans&#8217; SHIB reached the milestone of $0.000095 for the first time since May of this year. After Binance disclosed that the meme currency was a recognized collateral asset for loans on the exchange, the price increased. Holders will be able to deposit SHIB as collateral to get &#8220;Flexible Loans&#8221; on Binance as a result of this development. Additionally, the action is thought to give the coin more credibility than its meme roots and cause a jump in its value, reviving investor interest. This development highlights the dynamic nature of the cryptocurrency market, where the intersection of social media trends, technological advancement, and institutional acceptance can drive meme coins like SHIB to achieve notable objectives and draw interest from both crypto supporters and the mainstream financial community. SHIB market cap currently at $5.8 billion on the weekly chart: TradingView.com Ahead of the debut of Shiba Inu&#8217;s blockchain initiative Shibarium, enthusiasm toward cryptocurrencies has also strengthened in recent days. Shibarium is expected to offer an alternative to the Ethereum blockchain, according to developers. It is anticipated to be more rapid more energy-efficient, and reduce total supply through burns. Shiba Inu: Strong Social Engagement Shiba Inu just made a significant achievement, which social analytics platform LunarCrush highlighted. Shiba Inu has the highest total social and market activity when compared to the whole crypto market, according to a tweet from the social analytics site LunarCrush. 👀🚀With leading combined social + market activity vs. the entire crypto market, Shiba Inu has hit the #1 LunarCrush AltRank™! 24-hour activity Price +12.22% to $0.000009853 Social engagements 200,365,743https://t.co/94gyL5ebDg$shib #shibainu pic.twitter.com/H0FGLSx8Um — LunarCrush (@LunarCrush) August 5, 2023 This accomplishment stands out because of Shiba Inu&#8217;s improving market influence. In addition to dominating the market, it also stands out significantly in terms of its social engagement. Related Reading: XRP Performance Woes: How Might Its Price Respond To Current Market Realities? In particular, SHIB has surpassed 4,481 other coins to claim the top rank on AltRank. The crypto has experienced a flurry of activity during the past 24 hours, logging a staggering 200,365,743 social interactions. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from K9 of Mine"
  }
]