[
  {
    "source": "CoinDesk",
    "date": "2024-03-20T14:01:50.000Z",
    "title": "Tornado Cash Dev Pertsev's $1.2B Money Laundering Allegations Detailed Ahead of Dutch Trial",
    "url": "https://www.coindesk.com/policy/2024/03/20/tornado-cash-dev-pertsevs-12b-money-laundering-allegations-detailed-ahead-of-dutch-trial/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Pertsev's trial is set to take place on March 26 and 27 in a 'S-Hertegonbosch court."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-20T14:02:51.000Z",
    "title": " Uzbekistan increases fees for crypto operations ",
    "url": "https://cointelegraph.com/news/uzbekistan-increases-fees-crypto-operations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMGY3ZmMxYjktODg5YS00ODg3LWFmYWMtYTliMTY2MGUzZDZiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The National Agency for Prospective Projects (NAPP) anticipates the revenue generated from this sector to double once the new structure is in place.</p>\n                    <p><p data-ct-non-breakable=\"true\">Uzbekistan’s National Agency for Prospective Projects (NAPP) has issued a new directive that increases the monthly fees for crypto market participants in the country. The mandate was given on Tuesday, March 19, 2024.</p><p>As per the official <a href=\"https://lex.uz/ru/pdfs/6844128\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, the revised fee framework is an amendment to a directive initiated by the Ministry of Justice in September 2022. </p><p>This change follows the NAPP’s assessment of the “adequate profitability” within the cryptocurrency retail and exchange sectors, prompting the introduction of a new fee structure impacting both entities</p><p><a href=\"https://cointelegraph.com/news/uzbekistan-increases-fees-crypto-operations\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-20T13:44:37.000Z",
    "title": "Massive Bitcoin Dip Reveals Ideal Altcoin Investment Opportunities",
    "url": "https://cryptodaily.co.uk/2024/03/massive-bitcoin-dip-reveals-ideal-altcoin-investment-opportunities",
    "description": "Discover how the latest Bitcoin downturn uncovers excellent investment opportunities in diverse altcoins. Learn how to leverage market volatility to your advantage and maximize profits in the dynamic crypto world."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-20T13:57:19.000Z",
    "title": "Meme Coin Fever: Koala Coin (KLC) Sparks Investor Frenzy, from Ripple (XRP) to Litecoin (LTC)",
    "url": "https://cryptodaily.co.uk/2024/03/meme-coin-fever-koala-coin-klc-sparks-investor-frenzy-from-ripple-xrp-to-litecoin-ltc",
    "description": "As the crypto sector welcomes Koala Coin (KLC) enthusiasts and investors alike are abuzz with the prospects it brings."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-20T13:47:20.000Z",
    "title": "Top 3 Crypto: Turning $100 into $1M with These 3 Cryptos",
    "url": "https://cryptodaily.co.uk/2024/03/top-3-crypto-turning-100-into-1m-with-these-3-cryptos",
    "description": "Are you constantly scouring crypto news websites, looking for the next big altcoin opportunity that could turn your $100 investment into $1M? Don’t worry, as we've scoured various news sources to identify the most promising cryptocurrencies that can simply turn your $100 investment into a whooping $1 Million."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-20T14:03:24.000Z",
    "title": "Major AI-related Tokens Rally Amid Volatile Crypto Market",
    "url": "https://www.cryptopolitan.com/major-ai-tokens-rally-amid-crypto-market/",
    "description": "In a period of turbulence within the broader cryptocurrency market, major AI-related tokens have surged significantly over the past 24 hours, showcasing resilience amidst market fluctuations. Despite a downturn in the wider cryptocurrency market, major AI-related tokens have surged in the past 24 hours, with notable gains observed in the native cryptocurrencies associated with SingularityNET [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-20T13:58:00.000Z",
    "title": "What’s the Fake News and AI Battle in the 2024 Election?",
    "url": "https://www.cryptopolitan.com/fake-news-and-ai-battle-election/",
    "description": "Explore how Springfield and leading technology firms are joining forces to combat the spread of AI-generated fake news ahead of the 2024 election."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-20T13:43:13.000Z",
    "title": "Saudi Arabia Announces $40 Billion Investment in Artificial Intelligence",
    "url": "https://www.cryptopolitan.com/saudi-arabia-announces-billion-investment/",
    "description": "Saudi Arabia is poised to embark on a significant venture into the realm of artificial intelligence (AI), with plans to establish a substantial fund amounting to approximately $40 billion. The endeavor aims to bolster the country&#8217;s presence in the global AI landscape, according to sources familiar with the matter as reported by The New York [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-20T14:03:58.000Z",
    "title": "New VR crypto attracts $1.5m in funding, eyeing significant growth",
    "url": "https://crypto.news/new-vr-crypto-attracts-1-5m-in-funding-eyeing-significant-growth/",
    "description": "5th Scape, a virtual reality-focused cryptocurrency, has successfully raised $1.6 million during its presale phase, showing a potential for growth and innovation in the digital space. #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-20T13:57:43.000Z",
    "title": "QCP Capital predicts a larger bull run post-Bitcoin halving",
    "url": "https://crypto.news/qcp-capital-predicts-a-larger-bull-run-post-bitcoin-halving/",
    "description": "Crypto asset trading firm QCP Capital predicts Bitcoin to reach a new all-time high post-halving, driven by the wider liquidity rotation.   According to the firm’s latest market update, Bitcoin ETF inflows hit a peak on March 12, with over $1&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-20T13:52:23.000Z",
    "title": "TON to launch Open League, giving $115m to community",
    "url": "https://crypto.news/ton-open-league-launch-telegram/",
    "description": "The TON project team announced The Open League season one, during which the TON Foundation will distribute 30 million Toncoin."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-20T14:00:48.000Z",
    "title": "Analyst Bullish On Polkadot (DOT), Predicts $17 Price Target Before April",
    "url": "https://www.newsbtc.com/altcoin/analyst-bullish-on-polkadot-dot-predicts-17-price-target-for-march/",
    "description": "Polkadot (DOT) is gaining positive momentum and could be poised for a significant price surge, according to crypto analysts. Michaël van de Poppe, an expert in the field, has identified encouraging market dynamics for Polkadot, suggesting a potential upward trajectory in the next few days or weeks. Related Reading: DeFi Turmoil: Over $5 Million Wiped Out In Liquidations Amid Ethereum Price Drop Polkadot Analyst Insights: Promising Momentum Polkadot on the USDT pair showed a regular pattern of higher highs and lower lows, according to Van de Poppe, suggesting an increase in bullish momentum. He also pointed out that Polkadot&#8217;s Bitcoin pair is still around a cycle low, indicating a possible trend reversal. Van de Poppe theorised that Polkadot might be returning to its peak in the upcoming months based on these facts. #Polkadot is starting to gain positive momentum, as it&#8217;s making higher highs and lower lows on the USDT pair. The BTC pair is still at the cycle low, indicating a likely upward run on the horizon. Perhaps $DOT can run towards an all-time high in the coming months. pic.twitter.com/dewBRJO9dO — Michaël van de Poppe (@CryptoMichNL) March 17, 2024 At the time of writing, Polkadot&#8217;s price stands at $9.26, with a 24-hour trading volume of $1.24 billion and a market capitalization of a little over $9 billion. DOT price up in the last 24 hours. Source: Coingecko Cryptocurrency experts have been closely monitoring Polkadot&#8217;s price fluctuations since the beginning of 2023. Drawing insights from historical data and market trends, these analysts anticipate an average DOT rate of $13.70 by March 2024. Total crypto market cap. Chart: TradingView However, they acknowledge a range of potential outcomes, with minimum and maximum price estimates standing at $10 and $17, respectively. Starting today @Polkadot @kusamanetwork and 6 top #parachains are now live on Dune! Our mission is to make crypto data accessible, and we&#8217;re thrilled to help the #Polkadot ecosystem in partnership with @colorfulnotion ⚡ Start your data journey👇 https://t.co/mMs4iO9w96 — Dune (@DuneAnalytics) March 19, 2024 Blockchain Data Accessibility Revolutionized Meanwhile, in a move that promises to revolutionize crypto data analysis for Polkadot and Kusama, Dune Analytics has announced a groundbreaking partnership with Colorful Notion. This collaboration marks a significant leap forward in accessibility, bringing a wealth of on-chain data from these blockchains to the fingertips of Dune users for the very first time. Related Reading: Market Turmoil? Not For XRP: 130% Volume Spike Stuns Investors Previously, analyzing on-chain activity within the Polkadot and Kusama ecosystems presented a challenge. However, this partnership empowers users with the ability to examine a rich pool of data, including decoded Substrate block data tables, extrinsics, calls, events, and transfers. This integration signifies a crucial step towards demystifying the complexities of blockchain data within the Polkadot ecosystem. By making this information readily accessible and fostering user-friendly analysis tools, the partnership between Dune Analytics and Colorful Notion holds immense potential for developers, researchers, and anyone with a vested interest in understanding the health and activity of the Polkadot network. Featured image from Pexels, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-20T14:00:43.000Z",
    "title": "Price Predictions for PEPE and BNB: Get In Early or Risk Missing Out on the Milei Moneda Price Surge Ahead, Expert Says",
    "url": "https://www.crypto-news-flash.com/price-predictions-for-pepe-and-bnb-get-in-early-or-risk-missing-out-on-the-milei-moneda-price-surge-ahead-expert-says/?utm_source=rss&utm_medium=rss&utm_campaign=price-predictions-for-pepe-and-bnb-get-in-early-or-risk-missing-out-on-the-milei-moneda-price-surge-ahead-expert-says",
    "description": "<img width=\"1200\" height=\"794\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-20T090826.730.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-20T090826.730.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-20T090826.730-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-20T090826.730-768x508.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-20T090826.730-150x99.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-20T090826.730-450x298.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />PEPE surges 70% with Binance&#8217;s support, drawing renewed investor interest. Binance Coin (BNB) soared 26%, coinciding with Binance&#8217;s resurgence, solidifying its status. Milei Moneda ($MEDA) storms the presale scene with 100% ROI potential.  With the crypto market buzzing with excitement and anticipation, investors are closely eyeing the price predictions for PEPE and BNB, two altcoins [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-20T13:54:16.000Z",
    "title": "BlackRock Launches Tokenized Equity Fund",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/blackrock-launches-tokenized-equity-fund/",
    "description": "<p>This venture is made in partnership with Securitize, a financial services firm known for its focus on digital securities. This move from BlackRock marks a deep venture into digital assets, signaling a major milestone in institutional cryptocurrency investment. BlackRock Deepens Footprint in Digital Asset Space The announcement came following BlackRock&#8217;s submission of a Form D [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/blackrock-launches-tokenized-equity-fund/\">BlackRock Launches Tokenized Equity Fund</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]