[
  {
    "source": "CoinDesk",
    "date": "2023-10-16T10:00:00.000Z",
    "title": "SBF Trial: What Did FTX’s Terms of Service Say About Customer Funds?",
    "url": "https://www.coindesk.com/policy/2023/10/16/sbf-trial-what-did-ftxs-terms-of-service-say-about-customer-funds/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A filing last week suggests Sam Bankman-Fried's defense wants to get back to the argument that Bankman-Fried did not technically commit wire fraud because FTX’s terms of service were worded in such a way that there's no case to argue funds were misappropriated."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-16T09:46:09.000Z",
    "title": "Crypto payment option for Honda cars only works via third-party platform",
    "url": "https://cointelegraph.com/news/honda-denies-accepting-crypto-payment",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/3df866d7-2ee8-42bc-9f1a-67e11fe32639.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>FCF Pay’s X account has been suspended amid circulating misreporting about its “partnership” with Honda, which has never happened.</p>\n                    <p><p>Major automobile manufacturer Honda does not accept cryptocurrency payments directly but one can use cryptocurrencies like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) to buy a Honda car through a third party.</p><p>In early October, several publications mistakenly reported that Honda started accepting cryptocurrency as payment. But Honda doesn’t allow one to purchase its cars in exchange for crypto, a spokesperson for the firm told Cointelegraph, stating:</p><blockquote>“American Honda does not accept cryptocurrency as payment. The recent reports regarding a change to this policy are incorrect.”</blockquote><p>Honda didn’t respond to additional questions on its stance on crypto or whether the company is planning to integrate cryptocurrency payments in the future.</p><p>While direct crypto payments for Honda automobiles aren’t available, one can still use cryptocurrency payment platforms like FCF Pay to buy a Honda car.</p><p>According to FCF Pay chief operating officer Joseph Parkin, Honda isn’t the only car brand that can be bought using crypto on the platform. “There are more car manufacturers on the list, including Mercedes, BMW, Ford, Nissan and Mitsubishi,” Parkin told Cointelegraph in early October.</p><p>According to the COO, payments on FCF Pay are settled by a payment aggregator through the same payment rails that allow one to pay in cash in bank branches. “In the case of this payment flow, crypto really is acting as digital cash or the cash of the internet,” Parkin said. He added that only those companies that are part of FCF Pay-deployed bill payment aggregation system are currently available.</p><p>The service is currently only available in the United States. Still, FCF Pay is working with additional partners to carry out crypto-to-fiat bill settlement in Mexico, several Latin American countries, multiple African nations, and Asia, according to the exec. The bill payments system went live in September 2023, enabling one to buy products using coins like Bitcoin, Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>), Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>), USDC (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) and others for a $3 plus 2% fee.</p><p>“Our aim is to onboard companies and corporations of every size and in every sector for direct crypto payments and we hope that governments around the world open their eyes soon to the benefits of making it easier for companies to accept crypto payments,” Parkin stated.</p><p>The COO also emphasized that FCF Pay hasn’t entered into a partnership with firms like Honda to enable crypto payments for Honda cars. “Our system allows customers to pay with cryptocurrency, but the nearly 21,000 companies that feature on the system receive fiat via our payment aggregator partner,” Parkin noted.</p><p>The news comes amid FCF Pay's struggle to restore its page on X (formerly Twitter) after its account got <a href=\"https://t.me/FCF_announcement/1071\" target=\"_blank\" rel=\"noopener nofollow\">suspended</a> on Oct. 5. Parkin has linked the suspension to accusations based on the fake news that has been circulating.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/shopify-to-accept-usdc-payments-with-solana-report\"><strong><em>Shopify to accept USDC payments with Solana: Report</em></strong></a></p><p>“We were being accused of claiming partnerships with the companies on our bill payments system, whereas we were actually trying our absolute best to dispel these misrepresentations from other news sources,” the exec said. He added that FCF Pay’s X account encountered a lot of “bot-like interactions” days before the suspension. FCF Pay suggested that the activity might have been an attempt to get the account suspended by competitors or the supporting communities.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/57988f8d-5143-44db-aa06-1428bf2aa3bc.png\"  /><figcaption style=\"text-align: center;\"><em>FCF Pay’s suspended account on X (formerly Twitter). Source: <a href=\"https://twitter.com/fcfpay\" target=\"_blank\" rel=\"noopener nofollow\">X</a></em></figcaption></figure><p>“The good news is that we are actually in the process of rebranding anyway as we lead up to our mobile app release at the end of the year. We may simply accelerate the process to switch over to the new branding if the FCF Pay account doesn't get unblocked soon,” the COO stated.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/cuba-bitcoin-revolution-adoption-embargo/\"><strong><em>The Truth Behind Cuba’s Bitcoin Revolution: An on-the-ground report</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-16T10:00:27.000Z",
    "title": "Bitcoin wrestles with key technical indicators as $28k proves a formidable resistance",
    "url": "https://cryptoslate.com/insights/bitcoin-wrestles-with-key-technical-indicators-as-28k-proves-a-formidable-resistance/",
    "description": "<p>Quick Take Bitcoin is currently grappling with a pivotal price point. With a value just shy of $28,000, it is up against several short-term technical indicators. The 200-week moving average now stands at $28,130, while the 200-day moving average is slightly lower, at $28,008. The 111-day moving average is also positioned at $28,099, further complicating [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-wrestles-with-key-technical-indicators-as-28k-proves-a-formidable-resistance/\">Bitcoin wrestles with key technical indicators as $28k proves a formidable resistance</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-16T10:05:10.000Z",
    "title": "Top Companies Transforming the Globe with Blockchain Technology",
    "url": "https://cryptodaily.co.uk/2023/10/top-companies-transforming-the-globe-with-blockchain-technology",
    "description": "The emergence of blockchain technology has been a transformative phenomenon, significantly impacting several industries and driving worldwide change"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-16T10:01:42.000Z",
    "title": "Singapore and US Forge AI Governance Alliance for Responsible Innovation",
    "url": "https://www.cryptopolitan.com/singapore-us-forge-ai-governance-alliance/",
    "description": "In a significant stride towards fostering responsible innovation, Singapore and the United States have collaboratively aligned their artificial intelligence (AI) governance frameworks. The Infocomm Media Development Authority (IMDA) of Singapore and the US National Institute of Standards and Technology (NIST) successfully completed a joint mapping exercise, aligning IMDA&#8217;s AI Verify and NIST&#8217;s AI RMF. The ... <a title=\"Singapore and US Forge AI Governance Alliance for Responsible Innovation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/singapore-us-forge-ai-governance-alliance/\" aria-label=\"More on Singapore and US Forge AI Governance Alliance for Responsible Innovation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-16T09:45:53.000Z",
    "title": "OpenAI Shifts Core Values, Emphasizing AGI Focus and Intensity",
    "url": "https://www.cryptopolitan.com/openai-shifts-core-values-emphasizing-agi-focus-and-intensity/",
    "description": "In a notable and seemingly understated move, OpenAI, the renowned artificial intelligence research organization, has quietly revamped its core values. The company&#8217;s original set of values, including attributes like &#8220;audacious,&#8221; &#8220;thoughtful,&#8221; &#8220;unpretentious,&#8221; &#8220;impact-driven,&#8221; &#8220;collaborative,&#8221; and &#8220;growth-oriented,&#8221; had been prominently featured on its website. However, a snapshot from the Internet Archive on September 25 reveals that ... <a title=\"OpenAI Shifts Core Values, Emphasizing AGI Focus and Intensity\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openai-shifts-core-values-emphasizing-agi-focus-and-intensity/\" aria-label=\"More on OpenAI Shifts Core Values, Emphasizing AGI Focus and Intensity\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-16T09:45:32.000Z",
    "title": "Saudi’s SAMA chief raises concerns over cryptocurrencies at G20 meeting",
    "url": "https://www.cryptopolitan.com/saudis-sama-concerns-over-crypto-g20-meeting/",
    "description": "Marrakech, Morocco &#8211; Amidst a global backdrop of economic slowdown and rising inflation rates, Ayman Alsayari, the Governor of the Saudi Central Bank (SAMA), voiced his concerns about the potential threats posed by cryptocurrencies and their brokers to the world&#8217;s financial stability. These statements were made during the G20 Finance Ministers and Central Bank Governors ... <a title=\"Saudi&#8217;s SAMA chief raises concerns over cryptocurrencies at G20 meeting\" class=\"read-more\" href=\"https://www.cryptopolitan.com/saudis-sama-concerns-over-crypto-g20-meeting/\" aria-label=\"More on Saudi&#8217;s SAMA chief raises concerns over cryptocurrencies at G20 meeting\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-16T10:00:13.000Z",
    "title": "By The Numbers: Bitcoin Hashrate Poised To Complete 100% Growth In 2023",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-hashrate-100-growth/",
    "description": "As analysts continue to debate the future of the flagship cryptocurrency, Bitcoin, the network’s hashrate has seen exponential growth, with this key indicator poised to experience an 100% increase (from the beginning of the year) before the year runs out.  How Bitcoin’s Hashrate Has Grown The hashrate, which is used to measure the computational power used to mine and process transactions on the network, currently (at the time of writing) stands at 445 exahashes per second (EH/s). This figure represents a significant increase, considering that the network hashrate stood at 255 EH/s on January 1, 2023.  Related Reading: On-Chain Tracker Notices Major Difference Between Bitcoin And Ethereum Whales Hashrate almost 100% up &#124; Source: CoinWarz These figures mean that the network hashrate has grown by 190 EH/s since the year began, and at this rate, it could well hit 510 EH/s by the end of the year, signaling a 100% increase from when the year began. These figures also suggest that more miners have jumped on the Bitcoin blockchain, with it being faster and more secure as a result of this.  At this rate, the hashrate could also well be on the way to fulfilling some of the predictions made by analysts. In March, A research analyst at River Financial, Sam Wouters, noted the impressive growth rate and predicted that Bitcoin’s hashrate could reach a “Zettahash by the end of 2025.” A Zettahash is equivalent to 1,000 EH/s. Going by this current rate, some have noted that Wouters’ prediction could become a reality by December 23, 2025, or the beginning of 2026. Despite this significant growth rate, it is worth mentioning that Bitcoin’s hash price has remained rather tepid during this same period. Hash Price refers to the revenue generated by miners on a per tera-hash basis.  Related Reading: How Ripple’s Rumored Token Burn Could Affect The XRP Price The hash price currently stands at close to $60, almost the same figure as at the beginning of the beginning of the year. Notably, Miners’ biggest payday came on May 8, 2023, when the hash price was $125.  Where The Bitcoin Hashrate Is Coming From In his tweet back in March, Wouters also tried to analyze where the growth in Bitcoin’s hashrate could be coming from. He shared his belief that it was unlikely that the added hashrate was coming from nation-states, as some people may suggest. According to him, the odds of nation-states providing computing power to the network and remaining a secret is low as “there are far too many people involved in running massive operations.” He concluded by stating that the source of the added hashrate was “nuanced” as it could simply be a result of factors like new models being put on the market, unused inventory going online, more facilities going live, and also entrepreneurs who are finding cheap sources before regulators step in.  BTC recovers as mining interest grows &#124; Source: BTCUSD on Tradingview.com Featured image from Coinmama, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-16T09:45:48.000Z",
    "title": "FTX Founder Seeks Medication Access Amid Fraud Trial",
    "url": "https://www.crypto-news-flash.com/ftx-founder-seeks-medication-access-amid-fraud-trial/?utm_source=rss&utm_medium=rss&utm_campaign=ftx-founder-seeks-medication-access-amid-fraud-trial",
    "description": "<img width=\"1200\" height=\"601\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ftx.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ftx\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ftx.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ftx-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ftx-1024x513.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/ftx-768x385.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Sam Bankman-Fried&#8217;s defense asserts the necessity of his ADHD medication, Adderall, during trial hours. The defense has proposed options to ensure the FTX founder gets his medication, including adjourning the trial temporarily. Medication Dilemma in the Spotlight of Bankman-Fried&#8217;s Fraud Trial Legal representatives of FTX founder, Sam Bankman-Fried, have formally petitioned Judge Lewis Kaplan. The [...]"
  }
]