[
  {
    "source": "Crypto Daily",
    "date": "2023-05-25T16:00:33.000Z",
    "title": "EU seeks to limit leverage bets in crypto",
    "url": "https://cryptodaily.co.uk/2023/05/eu-seeks-to-limit-leverage-bets-in-crypto",
    "description": "<p>In a recent announcement, an EU watchdog emphasised the need for measures to prevent excessive leveraged bets on crypto assets.</p>\n<p>The European Systemic Risk Board (ESRB) has made a range of recommendations with which to address the challenges faced by the crypto sector. Among the proposed actions, the ESRB suggested implementing stringent regulations such as mandatory regular reports from all companies involved in crypto assets. Additionally, it highlighted the necessity of specific rules tailored to the largest firms operating within this space.</p>\n<p>The cryptocurrency industry has experienced a rollercoaster ride over the past 18 months, marked by significant fluctuations in the price of Bitcoin and with the collapse of various crypto institutions.</p>\n<p>Highlighting the potential rapid emergence of systemic risks, the ESRB stressed the urgency of addressing these issues. As highlighted in a Reuters article earlier today, the report cautioned that if the industry's exponential growth trajectory persists, crypto-assets could pose a threat to financial stability.</p>\n<p>Proposing an amendment to existing EU regulations, the ESRB recommended the introduction of leverage limits for investment funds exposed to crypto-assets. By curbing the extent of leverage employed, the aim is to mitigate the potential risks associated with highly leveraged bets.</p>\n<p>Furthermore, the ESRB called for higher collateral requirements for distributed finance products and stablecoins, further bolstering risk management within the crypto space.</p>\n<p>While these recommendations are not legally binding, they hold significant weight and are expected to influence the EU's future endeavours in refining its regulatory framework for crypto assets. As the EU revisits its markets in cryptoassets regulation (MiCA), it is likely to take these suggestions into serious consideration.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-25T15:46:52.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "BTCManager",
    "date": "2023-05-25T15:56:23.000Z",
    "title": "South Korea implements crypto disclosure mandate for officials for 2024",
    "url": "https://crypto.news/south-korea-implements-crypto-disclosure-mandate-for-officials-for-2024/",
    "description": "In a unanimous decision, South Korean lawmakers have passed a new bill mandating public officials and candidates to disclose their cryptocurrency holdings starting in 2024."
  },
  {
    "source": "BTCManager",
    "date": "2023-05-25T15:32:40.000Z",
    "title": "CFTC charges 5 in fraudulent digital asset trading scheme",
    "url": "https://crypto.news/cftc-charges-5-in-fraudulent-digital-asset-trading-scheme/",
    "description": "The U.S. Commodity Futures Trading Commission (CFTC) has filed a civil enforcement action against five individuals, accusing them of running a fraudulent digital asset trading scheme. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-25T16:00:57.000Z",
    "title": "XRP Bears Prevail As Asset Retreats From Recent Highs",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-bears-prevail-as-asset-retreats-from-recent-highs/",
    "description": "XRP is in the red today, losing grip of its recent gains as the bears act on its price. The bulls had sustained the price momentum driving XRP to $0.4688 on May 19. The asset traded within this range till May 24, when the bears dropped it to a closing price of $0.454. But today, XRP&#8217;s price has gradually declined to the $0.451 level as the bears continue to exert pressure on its price. More Bearish Trend For XRP XRP is in a downtrend today, forming a second consecutive red candle on the daily price chart with lower lows. The asset trades below its 50-day Simple Moving Average (SMA), a short-term-bearish sentiment. The 50-day SMA indicates XRP&#8217;s average price over a specific period. Related Reading: Shiba Inu All Green Today – What’s The Energy Behind The Glow? Also, the Relative Strength Index (RSI) is 46.71 in the neutral zone and descending, further confirming a bearish sentiment for XRP. The RSI has two critical regions the overbought region and the oversold region. RSI values between 70 and 30 are neutral.  Given the descending line of XRP&#8217;s RSI, the asset is entering the oversold region from which a trend reversal is imminent.  XRP&#8217;s Moving Average Convergence/Divergence (MACD) is above its signal line, suggesting a bullish sentiment. However, the MACD displays negative values, and its histogram bars hint at a bearish reversal. The MACD identifies the trend direction of an asset and is often used to place trades. Currently, it displays a tentative sell signal in the market today. But XRP is trading above the 200-day SMA, suggesting a bullish trend in the long run.  The altcoin is trading at the $0.4504 support level as the bears seek to push it down. Bearish pressure at the $0.46591 resistance level pushed XRP into a downtrend.  A further decline will see XRP return to the $0.44446 support level and push it to the oversold region. XRP will likely record more price drops in the short term.  However, since it is still trading above its 200-day SMA, a long-term bullish sentiment, the bulls will rally again once they regain control of its price. XRP Updates Might Influence Price Action In Long term Ripple Labs&#8217; ongoing legal case with the US Securities and Exchange Commission is likely one of the reasons behind XRP&#8217;s price downturn. However, as the Ripple CEO said, the case may likely conclude soon. Related Reading: AiDoge Coin Goes Viral, Rakes In $13 Million In Funding Amid Meme Coin Craze Ripple Labs Attorney Kylie Chiseul Kim filed a letter to withdraw as legal counsel for their ongoing case. The Attorney is leaving her former employers, Kellogg, Hansen, Todd, Figel &#38; Fredrick P.L.L.C, and Devbevoise &#38; Plimpton LLP. Nevertheless, the court filings stated that the law firm would remain counsel for Ripple Labs. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-25T15:48:19.000Z",
    "title": "ZCash and Dash Competitor Monero Partners with Industry Giant to Protect Users from Financial Surveillance and Fight CBDCs",
    "url": "https://www.crypto-news-flash.com/zcash-and-dash-competitor-monero-partners-with-industry-giant-to-protect-users-from-financial-surveillance-and-fight-cbdcs/?utm_source=rss&utm_medium=rss&utm_campaign=zcash-and-dash-competitor-monero-partners-with-industry-giant-to-protect-users-from-financial-surveillance-and-fight-cbdcs",
    "description": "<p>Monero has announced its partnership with Nym, a platform that operates on open-source principles and utilizes incentives to ensure decentralization. Monero(XMR) is currently trading at $150.41 as of the time of writing. The coin has had a 0.04% increase in the past 24 hours. Monero has been making strides in the cryptocurrency market in recent [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/zcash-and-dash-competitor-monero-partners-with-industry-giant-to-protect-users-from-financial-surveillance-and-fight-cbdcs/\">ZCash and Dash Competitor Monero Partners with Industry Giant to Protect Users from Financial Surveillance and Fight CBDCs</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]