[
  {
    "source": "Cointelegraph",
    "date": "2024-02-09T21:30:00.000Z",
    "title": " Crypto Biz: Bitcoin ETFs make headway, Genesis’ overpaid bankruptcy plan, and more ",
    "url": "https://cointelegraph.com/news/crypto-biz-bitcoin-etfs-genesis-overpaid-bankruptcy-plan",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNWY0MmZiMWQtY2VhMC00YWIwLTgzMzktOGYxZDdlOGM3NTA0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Whether Bitcoin’s era has begun is hard to say, but the challenges to broader adoption may be the last breath of a prolonged crypto winter.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is becoming a substitution for gold, <a href=\"https://cointelegraph.com/news/substitution-gold-for-bitcoin-now-underway-cathie-wood\">according to ARK Invest CEO Cathie Wood</a>.</p><p>In an interview on Feb. 4, Wood said she believes that, like gold, the cryptocurrency will soon prove itself as a “risk off asset” — a term used to describe investments generally considered safe during periods of uncertainty or financial market turmoil.</p><p>ARK’s new spot Bitcoin exchange-traded fund (ETF) saw inflows of around $650 million in January, leading some ETF experts to classify the fund as a “strong middle class,” indicating that it is emerging as a strong performer with growth potential in a market currently dominated by financial giants BlackRock and Fidelity. </p><p><a href=\"https://cointelegraph.com/news/crypto-biz-bitcoin-etfs-genesis-overpaid-bankruptcy-plan\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-09T21:13:31.000Z",
    "title": "Solana outage was caused by infinite loop bug previously seen on devnet",
    "url": "https://cryptoslate.com/solana-outage-was-caused-by-infinite-loop-bug-previously-seen-on-devnet/",
    "description": "<p>Solana Labs said that the recent outage that halted blockchain transactions for five hours on Feb. 6 was caused by a bug developers caught a week earlier. Solana Labs published a detailed report on Feb. 9 outlining its investigation of the outage, which revealed that the known bug had multiple triggers, and developers had only [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/solana-outage-was-caused-by-infinite-loop-bug-previously-seen-on-devnet/\">Solana outage was caused by infinite loop bug previously seen on devnet</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NullTX",
    "date": "2024-02-09T21:28:10.000Z",
    "title": " AVALANCHE PRICE ANALYSIS & PREDICTION (February 9) – Avax Shows Signs of Strength Amid Latest Market Recovery, Faces Monthly Resistance",
    "url": "https://nulltx.com/avalanche-price-analysis-prediction-february-9-avax-shows-signs-of-strength-amid-latest-market-recovery-faces-monthly-resistance/",
    "description": "Avax appeared to stall under a key resistance for two weeks but has managed to post 10% gains despite facing hurdles. Having seen a slight bounce this week, it is still finding it difficult to break higher.  Last weekend, Avax rejected the $38 level after failing to sustain recovery. It [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-09T21:23:28.000Z",
    "title": "MANTRA PRICE ANALYSIS & PREDICTION (February 9) – OM Returns Over 1000% Profits In Three Months, Shows No Sign Of Slowing Down ",
    "url": "https://nulltx.com/mantra-price-analysis-prediction-february-9-om-returns-over-1000-profits-in-three-months-shows-no-sign-of-slowing-down/",
    "description": "Mantra OM continued to gain traction weekly, sparking a staggering 100% gain overnight as it reached a new milestone. The price looks strong on the daily chart with no signs of slowing down. More positive actions lie ahead. After taking a small break last weekend, OM pulled back into the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-09T21:17:58.000Z",
    "title": "POLKADOT PRICE ANALYSIS & PREDICTION (February 9) – DOT Slowly Picks Up As Explosion Underways, Where Next?",
    "url": "https://nulltx.com/polkadot-price-analysis-prediction-february-9-dot-slowly-picks-up-as-explosion-underways-where-next/",
    "description": "Following recent price recovery across the crypto space, Polkadot DOT increased by 8% in three weeks but appeared to be struggling with volatility. However, it remains strong on a weekly scale and looks set to claim more highs.  Most altcoins have stayed in the shadow of Bitcoin&#8217;s bounce lately as [&#8230;]"
  }
]