[
  {
    "source": "Cointelegraph",
    "date": "2023-10-25T21:50:00.000Z",
    "title": "Hashdex sits down with SEC over spot Bitcoin ETF application ",
    "url": "http://cointelegraph.com/news/hashdex-meets-sec-spot-bitcoin-etf-application",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/07824fbb-21be-462b-a98a-59625379247a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Asset manager Hashdex recently met with the U.S. SEC to address the regulator's concerns over its application for a spot Bitcoin ETF.</p>\n                    <p><p>Asset manager Hashdex recently held a meeting with the U.S. Securities and Exchange Commission to address the regulator's concerns about its application to allow the Hashdex Bitcoin Futures exchange-traded fund (ETF) to hold spot Bitcoin, a source familiar with the matter told Cointelegraph. </p><p>As per a memorandum <a href=\"https://www.sec.gov/comments/sr-nysearca-2023-58/srnysearca202358.htm\" target=\"_blank\" rel=\"noopener nofollow\">released</a> by the Division of Trading Markets, the meeting took place on Oct. 13, with six SEC officials and representatives of Hashdex, NYSE Arca, Tidal Financial Group, and law firm K&L Gates in attendance.</p><p>In the meeting, Hashdex presented its mechanism allowing spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) to be traded and held in the ETF on the Chicago Mercantile Exchange (CME), which the Commodity Futures Trading Commission regulates.</p><p>Hashdex’s filing <a href=\"https://cointelegraph.com/news/hashdex-joins-race-for-spot-bitcoin-etf-with-unique-strategyhttps://cointelegraph.com/news/hashdex-joins-race-for-spot-bitcoin-etf-with-unique-strategy\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/hashdex-joins-race-for-spot-bitcoin-etf-with-unique-strategyhttps://cointelegraph.com/news/hashdex-joins-race-for-spot-bitcoin-etf-with-unique-strategy/amp\">differs from other spot Bitcoin applications</a> because it doesn't have a surveillance-sharing agreement with crypto exchange Coinbase. Instead, Hashdex proposes to acquire spot BTC from physical exchanges within the CME market, thus making it entirely reliant on CME pricing for transactions, <a href=\"https://www.nyse.com/publicdocs/nyse/markets/nyse-arca/rule-filings/filings/2023/SR-NYSEArca-2023-58.pdf\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to an SEC filing by NYSE Arca in late August. </p><p>A presentation shared with SEC officials during this month’s meeting shows that the strategy is also built on the commission's Teucrium Order, which states that the Bitcoin futures market is sufficiently developed to support financial products seeking exposure to BTC. </p><p>As a next step, the SEC may ask for more information before the application's first deadline on Nov. 17, according to the person with knowledge of the matter. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/f76a1160-6dd6-4c64-9938-ef82c60b2c3e.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Screenshot of Hashdex's presentation to the U.S. Securities and Exchange Commission. Source: SEC</em></figcaption></figure><p>Hashdex claims to have over $380 million in assets under management and 14 exchange-traded products (ETPs) across seven countries. An ETP is a type of investment vehicle backed by a crypto token. </p><p>The SEC approved Hashdex's Bitcoin Futures ETF in April 2022. The product has been listed on NYSE Arca since September last year. If the rule change is approved, the ETF will be able to hold spot Bitcoin as well.</p><p>Several major asset managers are racing to list the first spot Bitcoin ETF in the United States. BlackRock's ETF proposal was <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-nasdaq-clearing-firm\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/blackrock-spot-bitcoin-etf-nasdaq-clearing-firm/amp\">recently listed</a> on the Depository Trust & Clearing Corporation (DTCC), suggesting approval could be on the way, according to Bloomberg ETF analyst Eric Balchunas. </p><p>\"The current consensus view is that the SEC will approve all spot ETFs within three months,\" said the source.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-25T21:45:25.000Z",
    "title": "Bitmain Unveils New T21 Bitcoin Miner; Offers BTC Fluctuation Protection Plan",
    "url": "https://news.bitcoin.com/bitmain-unveils-new-t21-bitcoin-miner-offers-btc-fluctuation-protection-plan/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/ants-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitmain Unveils New T21 Bitcoin Miner; Offers BTC Fluctuation Protection Plan\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/ants-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ants-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ants-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ants-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ants-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ants-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ants.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Wednesday, the bitcoin mining rig manufacturer Bitmain announced the introduction of a new air-cooled BTC miner, the T21 Antminer. The new device boasts a production capacity of up to 190 terahash per second (TH/s) and maintains an efficiency ratio of approximately 19 joules per terahash (J/T). Bitmain Debuts T21 Antminer After the recent unveiling [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-25T22:00:33.000Z",
    "title": "A Chance At Redemption: Analyst Puts MATIC Price At $1.5",
    "url": "https://www.newsbtc.com/analysis/matic-analysis/analyst-matic-price-1-5/",
    "description": "The MATIC price has disappointed investors over the course of this year after falling from $1.5 to $0.5. This extended bear trend has significantly impacted investor morale but one analyst sees a redemption in the future of the altcoin, in the form of a 220% surge to $1.5. MATIC Price To Make A 220% Break The analysis of the MATIC price came from crypto analyst FieryTrading. Taking to TradingView, the analyst paints a bullish future for MATIC which they believe could rise as high as $1.5. From this current level, this would be a 220% rally and likely make MATIC a top gainer. Related Reading: Bitcoin Bounce Above $35,000 Puts Holder Profitability At Yearly Highs FieryTrading pointed to the fact that the altcoin has been caught in a sell-off trend throughout the year. However, this sustained selling has been broken through after Bitcoin showed strength, and altcoins like MATIC followed. To the point, FieryTrading believes that MATIC has finally broken out of the bearish resistance that has held back the token all year. Chart shows recovery to $1.5 &#124; Source: Tradingview.com However, not everyone agrees with the crypto analyst’s prediction for the Polygon native token. One user took to the comment section to share their own expectation, explaining that the MATIC price is going to fall further and $1 would not be reached. When FieryTrading inquired why the user believed MATIC would fall, they explained that they had insider information from working on a major project in the last year. According to the user, it’s not just MATIC but also Ethereum that could fall. “You are free to go long with polygon. Be careful,” the user cautioned. MATIC’s Struggles Continue Although the MATIC price has been able to follow the recovery trajectory of Bitcoin as well, it has not held on as well as others. After touching $0.661 on Tuesday, MATIC went into a sustained downtrend, and at a time when large altcoins are still seeing gains, MATIC is nursing 2.88% losses in the last day. Related Reading: Pro-XRP Legal Expert Shares Expectations If SEC Wins Appeal Against Ripple Additionally, the altcoin’s daily trading volume fell approximately 29% to $426 million on Thursday, which suggests traders and investors are going into a cooling-off period. So it is likely the MATIC price will continue to fall before it picks up steam again. However, if FieryTrading’s analysis is correct, then this downtrend would not last long. As for MATIC investors, the price recovery has done little to amend the low profitability. As IntoTheBlock data shows, only 11% of all MATIC holders are seeing profit. The vast majority of 87% are deep in losses, with only 2% holding bags at the same price at which they purchased them. MATIC trading tightly above $0.633 &#124; Source: MATICUSD on Tradingview.com Featured image from Bytrade, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-25T22:01:29.000Z",
    "title": "$144,000,000 Worth of Bitcoin Linked to Defunct Darknet Marketplace Suddenly Moves to Crypto Mixer: On-Chain Data",
    "url": "https://dailyhodl.com/2023/10/25/144000000-worth-of-bitcoin-linked-to-defunct-darknet-marketplace-suddenly-moves-to-crypto-mixer-on-chain-data/",
    "description": "<img width=\"810\" height=\"475\" src=\"https://dailyhodl.com/wp-content/uploads/2020/04/dark-web-hand.jpg?w=810\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2020/04/dark-web-hand.jpg 810w, https://dailyhodl.com/wp-content/uploads/2020/04/dark-web-hand.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2020/04/dark-web-hand.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2020/04/dark-web-hand.jpg?resize=750,440 750w\" sizes=\"(max-width: 810px) 100vw, 810px\" /><p>On-chain data reveals that hundreds of millions of dollars worth of Bitcoin (BTC) linked to a discontinued dark web marketplace has abruptly been moved to a crypto mixer. According to blockchain detective ZachXBT, an entity has moved about 4800 BTC, worth $144 million, originating from the defunct Abaraxas darknet marketplace to a Bitcoin mixer. “An [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/25/144000000-worth-of-bitcoin-linked-to-defunct-darknet-marketplace-suddenly-moves-to-crypto-mixer-on-chain-data/\">$144,000,000 Worth of Bitcoin Linked to Defunct Darknet Marketplace Suddenly Moves to Crypto Mixer: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]