[
  {
    "source": "Decrypt",
    "date": "2023-11-10T22:04:30.000Z",
    "title": "This Week in Coins: Bitcoin Hits 18-Month High, Solana’s Market Cap Closes in on USDC",
    "url": "https://decrypt.co/205554/this-week-in-coins-bitcoin-hits-18-month-high-solana-market-cap-near-usdc",
    "description": "Bitcoin’s rally continued and a number of other alts experienced powerful gains this week—for a number of reasons. "
  },
  {
    "source": "Decrypt",
    "date": "2023-11-10T21:53:21.000Z",
    "title": "Is Crypto Winter Over? Depends Who You Ask",
    "url": "https://decrypt.co/205542/is-crypto-winter-over",
    "description": "Some are saying \"We're so back,\" but crypto has no Punxsutawney Phil."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-10T21:45:13.000Z",
    "title": "Microsoft briefly blocks ChatGPT for its employees, attributing error to systems test",
    "url": "https://cryptoslate.com/microsoft-briefly-blocks-chatgpt-for-its-employees-attributing-error-to-systems-test/",
    "description": "<p>Microsoft briefly prevented its employees from using ChatGPT and other artificial intelligence (AI) tools on Nov. 9, CNBC reported on the same day. CNBC claimed to have seen a screenshot indicating that the AI-powered chatbot, ChatGPT, was inaccessible on Microsoft&#8217;s corporate devices at the time. Microsoft also updated its internal site, stating that due to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/microsoft-briefly-blocks-chatgpt-for-its-employees-attributing-error-to-systems-test/\">Microsoft briefly blocks ChatGPT for its employees, attributing error to systems test</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-10T22:00:41.000Z",
    "title": "NEAR Foundation And Eigen Labs Team Up To Improve Web3 Transactions On Ethereum Rollups",
    "url": "https://www.newsbtc.com/analysis/near/near-foundation-and-eigen-labs-team-up-to-improve-web3-transactions-on-ethereum-rollups/",
    "description": "The NEAR Foundation has announced a strategic partnership with Eigen Labs, a startup focused on building the Ethereum restaking protocol Eigen Layer.  While addressing the challenges of liquidity fragmentation between Layer 2 (L2) solutions, the collaboration aims to reinvent Ethereum (ETH) roll-up transactions, making them “more cost-effective and efficient.” Rapid And Affordable Ethereum Transactions?  In a joint statement released on November 10, the NEAR Foundation and Eigen Labs unveiled their plans to develop a &#8220;fast finality layer&#8221; to power rapid and inexpensive transactions for Ethereum rollups, including cross-rollup transactions.  Per the announcement, the collaboration seeks to significantly reduce transaction processing times to a mere 3-4 seconds, a notable improvement compared to the minutes, hours, or even days it currently takes. Moreover, it aims to make transactions 4000 times cheaper than existing options, providing a cost advantage for users. Related Reading: What Is Shiba Inu: An Explainer And SHIB Price Prediction Furthermore, one of the partnership&#8217;s key objectives is to establish “secure and low-latency” cross-rollup communication, resolving the challenges faced by developers and founders working with rollups.  As announced, the Fast Finality Layer will maintain the &#8220;security guarantees&#8221; of Ethereum while introducing additional guarantees from the NEAR and EigenLayer technologies. Both protocols believe this solution promises to enhance liquidity by reducing fragmentation between Layer-2 solutions, empowering developers to make informed decisions regarding the sequencers they prefer for transaction processing. NEAR And Eigen Labs Partnership For ‘Seamless Web3 Integration’ Illia Polosukhin, co-founder of NEAR Protocol, expressed pride in partnering with Eigen Labs, emphasizing that the fast finality layer showcases the technological strengths of NEAR while making the Open Web more user-friendly. Polosukhin further stated: NEAR Foundation is proud to partner with such an excellent team as Eigen Labs to offer a fast finality layer for ETH rollups. The fast finality layer showcases the strengths of NEAR&#8217;s technology while making the Open Web more usable, which has always been the core goal for NEAR. It will also help defragment liquidity for Ethereum rollups and make all of Web3 more interoperable as a result. For his part, Sreeram Kannan, founder of Eigen Labs, shared his enthusiasm for the partnership and highlighted the mutual benefits it brings. In his words, the collaboration will leverage the innovative technologies of both NEAR and EigenLayer, enabling faster, cheaper, and easier development on the Ethereum network. Related Reading: Is A Bearish Reversal Coming For Bitcoin? This Metric May Warn So The collaboration between NEAR and Eigen Labs marks a significant milestone for EigenLayer, as it enables fast settlement for cross-rollup transactions and demonstrates wider adoption of restaking across the Ethereum ecosystem and beyond.  For NEAR, the partnership extends to enhancing the NEAR-Ethereum Rainbow Bridge by transitioning it to an actively validated service (AVS). This transition is expected to enhance bridging capabilities between NEAR and Ethereum, enabling faster transaction finality, increased security guarantees, and improved decentralization. The collaboration is expected to launch a testnet in Q1 2024, and further details will be shared then. This partnership between the NEAR Foundation and Eigen Labs holds great promise for advancing Ethereum rollup transactions, improving liquidity, and driving the broader adoption of Web3 technologies. Featured image from Shutterstock, chart from TradingView.com "
  }
]