[
  {
    "source": "Decrypt",
    "date": "2024-01-04T21:42:44.000Z",
    "title": "Blame Human Lawyers, Not Tech, for Courtroom Blunders: Robin AI Cofounder",
    "url": "https://decrypt.co/211764/uk-startup-raises-26-million-to-build-law-ai",
    "description": "Robin AI is taking on hallucinations and other thorny issues to ensure tech is an effective courtroom partner."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-04T21:45:23.000Z",
    "title": " Only 39% of financial advisers believe a 2024 Bitcoin ETF will be approved: Bitwise ",
    "url": "https://cointelegraph.com/news/only-39-percent-financial-advisers-believe-2024-bitcoin-etf-approved-bitwise",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNzg4ZDExMzYtZDAzZS00N2M5LWFhYjMtNWI4OWZmZTAxNGUxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A survey of U.S. financial advisers concluded that most believe approval will not come until at least 2025.</p>\n                    <p><p>While many crypto holders anxiously await the approval of a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) in the United States, one group of financial experts appears to be pessimistic about this prospect. According to a survey from ETF issuer Bitwise published on Jan. 4, only 39% of U.S.-based financial advisers <a href=\"https://bitwiseinvestments.com/crypto-market-insights/the-bitwise-vettafi-2024-benchmark-survey\" target=\"_blank\" rel=\"noopener nofollow\">believe</a> a Bitcoin ETF will be approved this year.</p><p>The survey asked financial advisers across the country several questions, with participants ranging from registered investment advisers (RIAs), financial planners, institutional investors, and wirehouse representatives. When participants were asked to select a time period for when they expect a spot Bitcoin ETF to be approved, only 39% answered “2024.” This contrasts with some experts who expect the ETFs to <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-january-10-analysts\">be approved by the Jan. 10 deadline</a>.</p><p>Despite this pessimism, most advisers do expect a Bitcoin ETF to be approved eventually, the survey claimed. Twenty-two percent stated that an approval will come in 2025 and 24% answered “after 2025.” Another 2% stated that the approval would come in 2023, although this prediction didn't materialize. When added together, this implies that a full 87% believe that an ETF will be approved eventually. Twelve percent answered “never” when asked this question.</p><p><a href=\"https://cointelegraph.com/news/only-39-percent-financial-advisers-believe-2024-bitcoin-etf-approved-bitwise\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-04T21:44:40.000Z",
    "title": " Surge in ‘buy the dip’ mentions highlights traders’ bullish crypto outlook  ",
    "url": "https://cointelegraph.com/news/surge-in-buy-the-dip-mentions-highlights-traders-bullish-crypto-outlook",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYjQyYjVjMWMtNTAyMy00NWIxLTkxZDAtZGNhNGNjNWIyZWYyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>“Buy the dip” mentions on social media soared as Bitcoin price dropped to $40,000 on Jan. 4. Today’s BTC price action suggests traders took their own advice.</p>\n                    <p><p>The amount of \"Buy The Dip\" mentions on social media rose to the highest levels in 22 months, according to data from Santiment. The blockchain analytics firm said the number of social media mentions for the phrase rose to 323, the highest since March 25, 2022.</p><p>A significant rise in “buy the dip” mentions across social platforms is an indication of initial high trader optimism for a quick market recovery. </p><p>This optimism soared considerably after the crypto market flash crash on Jan. 4, signalling growing awareness among traders about the opportunities lower levels present.</p><p><a href=\"https://cointelegraph.com/news/surge-in-buy-the-dip-mentions-highlights-traders-bullish-crypto-outlook\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-04T22:00:43.000Z",
    "title": "Dogecoin Volume Explodes 190% But DOGE Price Remains Low, What’s Going On?",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-volume-190-doge-price/",
    "description": "Dogecoin has had a hard time recovering from the flash crash that rocked the crypto market on Wednesday. After losing its hold on $0.09, the DOGE price has since been relegated back to the low $0.08 level where it continues to trade at the time of writing. Interestingly, this is happening at a time when the meme coin’s volume is seeing a significant rise, so what’s going on? Dogecoin Volume Rises Over 190% The Dogecoin daily trading volume has seen one of the most significant spikes in the last day after its price fell. As interest in the coin grew, so did the trading volume and in the end, there has been a more than 190% increase in the daily DOGE trading volume. Related Reading: Crypto Pundit Says Cardano Rivals XRP Community, But Why Is ADA Price Struggling? According to CoinMarketCap, this rise in the trading volume has brought the figure to more than $1.12 billion in a single day. This works out to around 9% of a trading volume to market cap ratio, something that is very good for the asset. Source: CoinMarketCap However, even with this rise in interest, DOGE is not enjoying any recoveries. Instead, its price is still trailing $0.082 at the time of this writing. It has also recorded a more than 10% decrease in price in the same time frame, while also completely eliminating its weekly gains. Why Is DOGE Price Struggling? It would seem the reason that the DOGE price is not moving is more sell pressure being mounted on the asset, especially by the large investors. These whales who hold significant amounts of Dogecoin seem to be selling off their holdings. An example of this is a transaction that was reported by the on-chain whale tracker Whale Alert. The transaction which was carrying 300 million DOGE worth a little over $29.6 million at the time was being sent to the Binance exchange. 🚨 300,000,000 #DOGE (24,629,096 USD) transferred from unknown wallet to #Binancehttps://t.co/M3WBb9bPOW — Whale Alert (@whale_alert) January 4, 2024 Now, transactions like these can be bearish for a crypto’s price because sending coins to exchanges can often mean that the holder is deciding to sell their coins. Given this, it can put a lot of sell pressure on the price, keeping it down like in the case of Dogecoin. Related Reading: Crypto Analyst Blasts $20,000 XRP Price Target, Reveals Why It’s Impossible There have also been multiple large Dogecoin transactions that have been headed for exchanges over the last day. An initial transaction of 82 million DOGE worth $6.74 million was flagged headed for the Robinhood trading platform. An hour later, another large transaction was flagged by Whale Alert, this time around, carrying 102.27 million DOGE worth $8.4 million to Robinhood as well. If all of these transactions were made with the intention to sell, it would explain why the DOGE price continues to struggle even amid market recovery. However, not all transitions have been bearish, especially from these large investors. One transaction reported by the whale tracker saw over 151.68 million DOGE worth $12.49 million moved from Robinhood to an unknown wallet. Such a transaction is more bullish because it suggests the owner could be moving the coins to a private wallet with the intention of holding them for better prices. DOGE bulls fail to hold price &#124; Source: DOGEUSD On Tradingview.com Featured image from Inside Bitcoins, chart from Tradingview.com"
  }
]