[
  {
    "source": "Cointelegraph",
    "date": "2024-01-03T03:40:00.000Z",
    "title": " Michael Saylor begins selling $216M in MicroStrategy stocks for more Bitcoin ",
    "url": "https://cointelegraph.com/news/michael-saylor-sells-microstrategy-shares-purchase-bitcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNzBlYjllNWMtNGQ4Mi00NTRiLWFmMjQtOTEwMjc3MzA3NDgxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Saylor previously said the move would allow him to address his “personal obligations” and, of course, buy more Bitcoin.</p>\n                    <p><p>MicroStrategy executive chairman Michael Saylor has begun a four-month process of selling $216 million worth of his shares in his firm MicroStrategy, previously stating part of it would be used to buy more Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>).</p><p>In a Jan. 2 <a href=\"https://www.sec.gov/Archives/edgar/data/1050446/000197185724000008/xsl144X01/primary_doc.xml\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> with the United States Securities and Exchange Commission, Saylor disclosed that he had already started selling his 315,000 stock options awards, first granted to him in April 2014. The awarded stock options expire on April 30, 2024.</p><p>According to the filing, Saylor began the process on Jan. 2, selling his first tranche of 5,000 shares. </p><p><a href=\"https://cointelegraph.com/news/michael-saylor-sells-microstrategy-shares-purchase-bitcoin\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T03:49:11.000Z",
    "title": "The New York Times Unleashes Legal Fury – Suing OpenAI and Microsoft for Copyright Infringement",
    "url": "https://www.cryptopolitan.com/new-york-times-openai-microsoft-infringement/",
    "description": "In a legal clash that could reshape the landscape of artificial intelligence and its integration with news dissemination, the New York Times Company has taken legal action against OpenAI&#8217;s ChatGPT and Microsoft&#8217;s Bing Chat. The Times alleges not only widespread copyright infringement but also the propagation of inaccurate information attributed to the esteemed news organization. [&#8230;]"
  }
]