[
  {
    "source": "CoinDesk",
    "date": "2023-11-06T19:48:16.000Z",
    "title": "Sam Bankman-Fried Will Not Be Crypto’s Albatross",
    "url": "https://www.coindesk.com/consensus-magazine/2023/11/06/sam-bankman-fried-will-not-be-cryptos-albatross/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "FTX was old-fashioned criminal fraud. SBF never believed in decentralization. And now the industry can move on."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-06T19:50:01.000Z",
    "title": "OpenAI Unleashes GPT-4 Turbo, Expands Chatbot Customizability",
    "url": "https://decrypt.co/204515/openai-unleashes-gpt-4-turbo-expands-chatbot-customizability",
    "description": "The industry leader in generative AI chatbots, OpenAI's next update promises more nuanced, human-like conversations for more precise applications."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-06T19:59:49.000Z",
    "title": "Price analysis 11/6: SPX, DXY, BTC, ETH, BNB, XRP, SOL, ADA, DOGE, TON",
    "url": "http://cointelegraph.com/news/price-analysis-11-6-spx-dxy-btc-eth-bnb-xrp-sol-ada-doge-ton",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/eb7f9fcb-a39b-4e04-8fca-4767549315cd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price is consolidating near $35,000. Will altcoins capitalize on the sideways price action and move higher? </p>\n                    <p><p>Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) marginal rise of about 1.5% last week suggests that traders are cautious at higher levels but they are not rushing to the exit. The bears have been in hibernation for the past few days but if the rally fails to resume, sellers may try to make a comeback.</p><p>However, in an uptrend, dips are usually viewed as an opportunity for long-term investors to accumulate. The positive sentiment among traders can be gauged by the <a href=\"https://cointelegraph.com/news/exchange-flow-gap-10k-btc-5-things-bitcoin-this-week\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/exchange-flow-gap-10k-btc-5-things-bitcoin-this-week/amp\">increase in Bitcoin withdrawals from exchanges</a> which reached 61,000 Bitcoin, a strong improvement over the year-to-date low of nearly 43,000 Bitcoin, according to CryptoSlate analyst Van Straten. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/956a5f14-6d3e-4b02-8ef2-3fbcc0b9d1b7.png\"><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>A large part of the accumulation is taking place in Bitcoin in the hopes that the United States Securities and Exchange Commission will eventually approve a spot Bitcoin exchange-traded fund. The enthusiasm of the traders increased further on the news that the Hong Kong government <a href=\"https://cointelegraph.com/news/hong-kong-spot-bitcoin-etf\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/hong-kong-spot-bitcoin-etf/amp\">may consider proposals for a spot Bitcoin ETF</a>. BitMEX co-founder Arthur Hayes said on X (formerly Twitter) that the competition between the United States and China is good for Bitcoin.</p><p>Are Bitcoin and altcoins ready to extend their up-move or is it time for a short-term correction? Let’s analyze the charts to find out.</p><h2>S&P 500 Index price analysis</h2><p>The S&P 500 Index (SPX) has been on a tear for the past few days. The bulls pushed the price above the 20-day exponential moving average (4,275) on Nov. 2 and followed it up a break above the 50-day simple moving average (4,346) on Nov. 3.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/43b0813f-2121-48e7-a273-00395a8dae3a.png\"><figcaption style=\"text-align: center;\"><em>SPX daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=TVC%3ASPX\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The relative strength index (RSI) has risen into the positive territory and the 20-day EMA has started to turn up. This indicates that the downtrend may be over but it does not guarantee the start of a new uptrend. The bears are expected to fiercely defend the downtrend line.</p><p>In the same way, the buyers are unlikely to give up their advantage without a fight. They are likely to buy the dips to the 20-day EMA. A strong rebound off this level will increase the possibility of a break above the downtrend line. If bears want to gain the upper hand, they will have to yank the price back below the 20-day EMA.</p><h2>U.S. dollar index price analysis</h2><p>The U.S. dollar index (DXY) plunged below the moving averages on Nov. 3, indicating the start of a deeper correction.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/fb1864a5-e14f-434c-905b-05bac43ed83f.png\"><figcaption style=\"text-align: center;\"><em>DXY daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=TVC%3ADXY\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The first support on the downside is the 38.2% Fibonacci retracement level of 104.38. If the price rebounds off this level, the index could reach the 20-day EMA. Buyers will have to pierce this resistance to set up a retest of 107.35.</p><p>Contrary to this assumption, if the price continues lower and breaks below 104.38, it will signal that the bulls are rushing to the exit. That could open the gates for a further decline to the 50% retracement level of 103.46.</p><h2>Bitcoin price analysis</h2><p>Bitcoin has been gradually rising inside the ascending channel pattern. This suggests that the bulls have the edge but the momentum is slowing down.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/a98e2b89-2374-45f8-a820-d6814cbc7328.png\"><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The RSI remains inside the overbought territory, indicating that the BTC/USDT pair may extend its consolidation or enter a corrective phase in the next few days. If the price skids below the channel, it may tempt short-term traders to book profits. There is strong support at the 20-day EMA ($33,238) but if this level gives way, the pair may plummet to $31,000.</p><p>Contrarily, if the price turns up and breaks above the channel, it will suggest the start of the next leg of the uptrend. The pair may then soar to the next major obstacle at $40,000.</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) broke above the nearby resistance of $1,885 on Nov. 5, indicating the start of the next leg of the upward journey toward $2,000.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/d9d06057-01f8-4248-a288-6af96b69e644.png\"><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AETHUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears are expected to defend the zone between $2,000 to $2,200 with all their might because if this resistance gives way, it will clear the path for a possible rally to $3,500 as there are no major resistances in between.</p><p>This bullish view will invalidate in the near term if the price turns down from the current level and breaks below the 20-day EMA ($1,780). The ETH/USDT pair may then tumble toward the 50-day SMA ($1,671).</p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/binance-coin-price-index\">BNB</a>) broke and closed above the resistance of the range at $235 on Nov. 4, indicating that demand exceeds supply. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/93c9e00a-9ebd-4519-a62b-ceac9f1c66ee.png\"><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABNBUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>There is a minor resistance at $250 but if buyers bulldoze their way through, the BNB/USDT pair may reach the major hurdle at $265. This level may prove to be a formidable resistance for the bulls to cross.</p><p>On the downside, the first important support to keep an eye on is $235. If the price dips below this level, it will signal that bears remain active at higher levels. The pair may then slide to the 20-day EMA ($227).</p><h2>XRP price analysis</h2><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/xrp-price-index\">XRP</a>) broke above the stiff overhead resistance of $0.67 on Nov. 6, indicating that the bulls are in the driver’s seat.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/2370a85b-4c0f-4917-8727-f346ea928840.png\"><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AXRPUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>There is a minor resistance at $0.74 but if bulls clear this hurdle, the XRP/USDT pair could rally to $0.85 and subsequently to $1.</p><p>A risk to the current up-move is that the RSI has entered overbought territory. This suggests that the rally is overheated in the short term. That could result in a correction or a consolidation for a few days. The important level to watch on the downside is $0.67. If this level gives way, it could start a deeper correction to the 20-day EMA ($0.58). </p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) bounced off the crucial support of $38.79 on Nov. 3 but the bulls are struggling to sustain the higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/4bcc09ac-b930-4a09-8852-eff61df32e4c.png\"><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ASOLUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears will try to build upon their advantage and sink the price below $38.79. If they manage to do that, the SOL/USDT pair could slump to the 20-day EMA ($34.67). This level is likely to witness a tough battle between the bulls and the bears.</p><p>If the price rebounds off the 20-day EMA, the bulls will again try to drive the price above $42.50 and challenge the stiff resistance at $48. Conversely, if the 20-day EMA cracks, the pair may tumble to $31 and later to $27.12.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/why-is-xrp-price-up-today\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/why-is-xrp-price-up-today/amp\"><strong><em>Why is XRP price up today?</em></strong></a></p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) has been in a strong recovery for the past few days. The momentum picked up further after buyers pushed the price above $0.30.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/fa463da0-81b9-456e-9674-6ed1f0535bba.png\"><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AADAUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The strong rally has pushed the RSI into the overbought zone, suggesting that a minor consolidation or correction may be around the corner. If the price stays above $0.32, it will increase the likelihood of a rally to $0.38.</p><p>On the contrary, if the price turns down from the current level and breaks below $0.32, it will suggest that traders may be booking profits. That could pull the price down to the 20-day EMA ($0.30). This remains the key level for the bulls to defend to keep the up-move intact.</p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) bounced off the strong support at the 20-day EMA ($0.07) on Feb. 3, indicating a change in sentiment from selling on rallies to buying on dips.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/6145b6f7-9ac0-4ab3-a984-e703b2db1f71.png\"><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOGEUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls are trying to maintain the price above $0.07 and if they succeed, the DOGE/USDT pair could pick up momentum and surge to $0.08. This level may pose a strong challenge but if cleared, the pair may sprint toward the psychological level of $0.10.</p><p>Meanwhile, the bears are likely to have other plans. They will try to stall the up-move and pull the price back below the 20-day EMA. This could clear the path for a potential fall to the $0.06 support.</p><h2>Toncoin price analysis</h2><p>Toncoin (TON) has been trading above the moving averages for the past few days, indicating demand at higher levels. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/70494957-8008-4894-bedf-9b51fa931ff3.png\"><figcaption style=\"text-align: center;\"><em>TON/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=OKX%3ATONUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls pushed the price above $2.31 on Nov. 6 but the long wick shows selling at higher levels. If buyers maintain the price above $2.31, it will open the doors for a rise to $2.59. The bears are expected to mount a strong defense at this level.</p><p>Alternatively, if the price turns down from the current level, the moving averages are likely to act as the first line of support. If these give way, the TON/USDT pair could drop to the strong support at $1.89. Such a move will suggest that the pair may oscillate between $1.89 and $2.31 for some time.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-06T19:51:43.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "http://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Binance’s spot trading market share falls to 40% in 2023. Also, news that Hong Kong is mulling the introduction of spot cryptocurrency ETFs sparked lively reactions from the crypto community in the context of the United States dragging its feet over the issue. Meanwhile, the spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) frenzy is driving a resurgence in blockchain games, says Yat Siu.</p><h2>Binance’s spot trading market share falls to 40% in 2023</h2><p>Binance’s spot trading market share has fallen to 40%. A year ago it stood at 63%, indicating that one of the world’s most popular cryptocurrency exchange platforms has <a href=\"https://cointelegraph.com/news/binance-spot-trading-market-share-falls-40-percent-2023\">lost about a third of the market</a> in just 12 months. This, according to a Nov. 6 report by blockchain analytics firm 0xScope. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Binance used to be the go-to for crypto trading, but it’s now sharing more of the market. A sign of healthy competition or a change in trader preferences? <a href=\"https://t.co/4nvrIzZGtL\">https://t.co/4nvrIzZGtL</a></p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1721594070504497570?ref_src=twsrc%5Etfw\">November 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to the report:</p><blockquote>“Binance’s spot trading volume has seen a significant decline in the past year, perhaps due to its listing strategy. Most popular coins experienced a downturn immediately after being listed on Binance.”</blockquote><h3>China ‘does not want to miss out’: Community reacts to HK spot Bitcoin ETF news</h3><p>The cryptocurrency community is excited about the Hong Kong government reportedly weighing the launch of a spot cryptocurrency ETF amid the ongoing regulatory pushback against th products in the United States.</p><p>Hong Kong’s potential entrance into spot crypto ETFs could be a significant development in the context of the economic confrontation between the U.S. and China, BitMEX co-founder Arthur Hayes believes.</p><p>Hayes took to X (formerly Twitter) on Nov. 6 to express excitement over competition between the two economies, emphasizing that this competition will eventually be good for Bitcoin.</p><p>“Competition is amazing. If the U.S. has its proxy asset manager, BlackRock, launching an ETF, China needs its proxy asset manager to launch one, too,” he wrote.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Competition is amazing. If the US has its proxy asset mngr, BlackRock, launching an ETF, China needs its proxy asset mngr to launch one too. <br><br>The US v China economic war is great for <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a>. <a href=\"https://t.co/ok7xipN4M5\">pic.twitter.com/ok7xipN4M5</a></p>&mdash; Arthur Hayes (@CryptoHayes) <a href=\"https://twitter.com/CryptoHayes/status/1721319347543847182?ref_src=twsrc%5Etfw\">November 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Cryptocurrency brand Coin Bureau was also quick to react to the potential spot crypto ETF launch in Hong Kong. According to the Coin Bureau, the U.S. Securities and Exchange Commission (SEC) might be getting some pressure amid other jurisdictions like Hong Kong jumping on the bandwagon of a spot Bitcoin ETF.</p><p>“It’s a cursory tale to the SEC that if they continue to stifle capital market innovation in the United States, other countries are going to fill the void,” Coin Bureau wrote on X.</p><p>Crypto influencer Lark Davis also stressed that the latest spot crypto ETF news from Hong Kong shows that the Chinese government doesn’t want to miss out on crypto opportunities.</p><p>“Hong Kong going to get spot Bitcoin ETFs now! Chinese money does not want miss out,” Davis stated.</p><h3>Spot Bitcoin ETF hype is driving gamers back on-chain: Yat Siu</h3><p>The market’s enthusiasm for a possible spot Bitcoin ETF isn’t just driving up the price of Bitcoin, it’s also <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-hype-blockchain-games-yat-siu\">sparked a resurgence</a> of enthusiasm for blockchain games, says Animoca Brands founder and CEO Yat Siu.</p><p>Siu said the increase of cryptocurrency prices across the board reignited investor confidence in Web3 gaming, as well as sparking a fresh wave of on-chain activity.</p><p>Over the last month, the most played blockchain-based game in the Animoca Brands roster, Axie Infinity, witnessed a 50% increase in transaction activity and a 14% jump in trading volume, <a href=\"https://dappradar.com/dapp/axie-infinity\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to DappRadar data.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/a956685b-1a55-4e1d-8191-af30f2f2741c.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Axie Infinity transaction activity has increased steadily since its yearly low on July 2. Source: DappRadar</em></figcaption></figure><p>Siu is confident that the approval of a spot Bitcoin ETF product will be an <a href=\"https://cointelegraph.com/news/galaxy-digital-soaring-bitcoin-price-increase-after-etf-launch\">incredible boon for the industry as a whole</a>, adding legitimacy to the industry while inviting a slew of new investments from traditional financial institutions.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-11-06T20:06:19.000Z",
    "title": "SEC faces hiring challenges due to experts not wanting to sell their crypto",
    "url": "https://crypto.news/sec-faces-hiring-challenges-due-to-experts-not-wanting-to-sell-their-crypto/",
    "description": "The U.S. SEC faces recruitment challenges and legal uncertainties as it struggles to hire Bitcoin and crypto experts that are willing to sell their crypto assets."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-06T20:02:00.000Z",
    "title": "Ready for lift-off: The second leg of 5th crypto bull market begins",
    "url": "https://crypto.news/ready-for-lift-off-the-second-leg-of-5th-crypto-bull-market-begins/",
    "description": "Crypto traders have seen the highs and lows of four crypto bull markets in the past. With Bitcoin (BTC) doubling from its recent lows, we have concluded the first part of this 5th bull market and have reached a critical juncture."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-06T19:55:58.000Z",
    "title": "Defi sector rallies as interest rates to borrow stablecoins surge",
    "url": "https://crypto.news/defi-sector-rallies-as-interest-rates-to-borrow-stablecoins-surge/",
    "description": "DeFi lending platforms see a spike in stablecoin borrowing rates, signaling a market rebound with rising demand and potential arbitrage opportunities."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-06T19:51:27.000Z",
    "title": "DZ Bank partners with Ripple to launch blockchain custody service",
    "url": "https://crypto.news/dz-bank-partners-with-ripple-to-launch-blockchain-custody-service/",
    "description": "DZ Bank launches a blockchain-based digital asset custody platform, advancing Germany's crypto services for institutional and private clients."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-06T20:00:17.000Z",
    "title": "Shiba Inu-Based BONE Eyes $1 As This On-Chain Metric Explodes",
    "url": "https://www.newsbtc.com/bone/shiba-inu-bone-explodes/",
    "description": "BONE, a token based on the Shiba Inu ecosystem, has had quite a dull month in terms of bullish price movement. However, the Shiba Inu ecosystem is currently experiencing an increase in on-chain transactions, and BONE hasn&#8217;t been left out.  Some SHIB whales have increased their holdings in anticipation of a new milestone for Shibarium. At the same time, BONE also had an increase in large transactions, and this key on-chain metric suggests the token could be ready for a major price appreciation. BONE Large Transaction Volume Increases The daily large transaction volume for BONE, ShibaSwap&#8217;s governance token, has exploded in the past week. According to recent data from IntoTheBlock&#8217;s metric of large transactions, each valued at $100,000 or more, spiked from no activity at the end of October to more than 5.17 million BONE tokens over the weekend. This type of large transaction activity can either mean that big money is flowing into or leaving an asset. But more often than not, the former is the case. Related Reading: Bitcoin And Ethereum Rally Not Over: Crypto Capital Inflows Reach One-Year High At the same time, BONE&#8217;s biggest whales have been loading up their bags. On-chain data shows whale wallets (more than 1% of the total supply) now hold 44.03%, up from 43.41% reported last month. Investors&#8217; wallets holding between 0.1% and 1% of the circulating supply also went up, now holding 16.85%. Inflows into these two sets of addresses increased by +295% in a 7-day timeframe, indicating interest from whales. Source: IntoTheBlock Bearish Sentiment Reversal? Road to $1? With the large transaction increase, it&#8217;s clear BONE is gaining major traction and interest from whales. But some on-chain and BONE&#8217;s price points to a double-edged sword. Despite the inflow into large wallets and increase in large transactions, broader on-chain signals point to bearish sentiment from retail traders.  Related Reading: Shiba Inu Whales Bet Big As Shibarium Grows – Road To $0.1? This is particularly evident as interest from small investors has dropped in the past month. At the time of writing, BONE is trading at $0.71 and is down by 64% from its yearly high of $2.20 in February. Bulls push token price toward $1 &#124; Source: BONEUSDT on Tradingview.com On the other hand, BONE has spiked by 3.6% in the past three hours after recently bouncing off major support at $0.69. A continued surge in on-chain transactions among bulls and whale investors could push the crypto back up to $1. BONE is used as gas fees on the Shibarium layer-2 blockchain, which has had a steady increase in cumulative gas usage since its launch. Shibarium is now approaching the four million total transactions milestone, which could also push BONE towards $1. Source: IntoTheBlock Featured image from CoinMarketCap, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-06T19:45:44.000Z",
    "title": "OpenSea CEO Announces Job Cuts, Says NFT Marketplace Building New Foundation for Faster Innovation",
    "url": "https://dailyhodl.com/2023/11/06/opensea-ceo-announces-job-cuts-says-nft-marketplace-building-new-foundation-for-faster-innovation/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/Leading-NFT-Marketplace-OpenSea.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" /><p>The chief executive of non-fungible token (NFT) marketplace OpenSea is announcing job cuts as the firm says that it&#8217;s rebuilding from the ground up. In a thread on the social media platform X, OpenSea CEO Devin Finzer says that the prominent NFT marketplace will be building a new foundation for faster innovation and upgrading its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/06/opensea-ceo-announces-job-cuts-says-nft-marketplace-building-new-foundation-for-faster-innovation/\">OpenSea CEO Announces Job Cuts, Says NFT Marketplace Building New Foundation for Faster Innovation</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-06T19:41:18.000Z",
    "title": "Institutions Pile Into Bitcoin, Ethereum and Solana With $262,000,000 in Capital Flows: CoinShares",
    "url": "https://dailyhodl.com/2023/11/06/institutions-pile-into-bitcoin-ethereum-and-solana-with-262000000-in-capital-flows-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/01/altcoins-big-moves-2022.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/01/altcoins-big-moves-2022.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/01/altcoins-big-moves-2022.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/01/altcoins-big-moves-2022.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/01/altcoins-big-moves-2022.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/01/altcoins-big-moves-2022.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/01/altcoins-big-moves-2022.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says Bitcoin (BTC), Ethereum (ETH), Solana (SOL) saw heavy inflows from institutional investors last week. In its latest Digital Asset Fund Flows report, CoinShares finds that institutional investors are continuing to allocate to crypto as the asset class enjoys its sixth consecutive week of institutional inflows. &#8220;Digital asset investment products saw inflows [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/06/institutions-pile-into-bitcoin-ethereum-and-solana-with-262000000-in-capital-flows-coinshares/\">Institutions Pile Into Bitcoin, Ethereum and Solana With $262,000,000 in Capital Flows: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]