[
  {
    "source": "CoinDesk",
    "date": "2023-08-09T12:18:56.000Z",
    "title": "First Mover Americas: Bitcoin Flirts With $30K as Traders Await CPI",
    "url": "https://www.coindesk.com/markets/2023/08/09/first-mover-americas-bitcoin-flirts-with-30k-as-traders-await-cpi/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for August 2, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-09T12:30:00.000Z",
    "title": "Universal Music and Google in talks over deal to combat AI deep fakes: Report",
    "url": "https://cointelegraph.com/news/universal-music-google-negotiate-ai-deep-fakes",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/b6583885-d87d-43c0-8e47-960b1bfb647e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Universal Music and Google are reportedly in negotiations over a tool that would allow for the creation of AI tracks using artists’ likenesses in a legal way. </p>\n                    <p><p>Universal Music Group — one of the world’s leading music companies — and Google are in negotiations to license melodies and vocal tracks of artists to be used in songs generated by artificial intelligence (AI), <a href=\"https://www.ft.com/content/6f022306-2f83-4da7-8066-51386e8fe63b\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to a report from the Financial Times. </p><p>The talks have been confirmed by what the FT reports are “four people familiar with the matter.” The companies are reportedly aiming to create a partnership between the music industry and Big Tech in order to manage the rampant emergence of AI-generated deep fakes. </p><p>Mainstream AI usage has sparked concern among major music industry leaders due to the amount of “deep fakes” using musicians’ likenesses. Clips of AI-generated Drake and Kanye West began to go viral around April. Many have since been taken <a href=\"https://twitter.com/heyaliou/status/1647618068292546563\" target=\"_blank\" rel=\"noopener nofollow\">down</a>. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The fact that this AI generated audio of Kanye West doing a cover of Drake&#39;s &quot;Hold On, We&#39;re Going Home&quot; sounds just like the real Kanye is scary and exciting.<br><br>The scary part: AI will never be this worst again.<br><br>Exciting part: this could unlock new doors of creativity. <a href=\"https://t.co/u5RfmpKTcT\">pic.twitter.com/u5RfmpKTcT</a></p>&mdash; Aliou Sidibe (@heyaliou) <a href=\"https://twitter.com/heyaliou/status/1641815196350947330?ref_src=twsrc%5Etfw\">March 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Reportedly, the discussions between the two industry giants are still in the early stages, with no impending product launch or guidelines. However, the FT sources say the goal is to develop a tool for creating tracks legally with copyrights rightly attributed. </p><p>The sources said that artists would have the right to opt in, for their voices and music to be used. Another source claimed that Warner Music Group (WMG) has also been in conversation with Google regarding a similar product. </p><p>Cointelegraph reached out to WMG for further information on the situation and has yet to receive a response. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ai-generated-music-can-win-a-grammy\"><strong><em>Music with AI elements can win a Grammy, Recording Academy CEO says</em></strong></a></p><p>Back in April, Universal Music Group was <a href=\"https://cointelegraph.com/news/universal-music-group-tells-streaming-services-to-block-ai-generated-music\">asking streaming services</a> like Spotify to take down all AI-generated content due to copyright infringement.</p><p>A few weeks later Spotify said it is <a href=\"https://cointelegraph.com/news/spotify-reportedly-deletes-thousands-of-ai-generated-songs\">ramping up policing of the platform</a> due to such instances and began actively taking down content in violation. </p><p>However, some artists are fully on board with their voices being used in AI-generated music. Grimes said<a href=\"https://cointelegraph.com/news/musician-grimes-willing-to-split-50-royalties-with-ai-generated-music\"> she’s eager to be a “guinea pig”</a> for this type of content and will split royalties 50/50 with the creators. </p><p>She also created her own voice simulation program alongside a team of developers which is available for public use called Elf Tech. </p><p>Google and<a href=\"https://cointelegraph.com/news/meta-launches-suite-of-generative-ai-music-tools-rivaling-google-s-musiclm\"> Meta have both recently launched</a> their own set of tools called Music LM and AudioCraft for the purpose of creating music and audio using generative AI. </p><p>Many in creative industries are worried about the implications of AI being used to create artistic and creative products. However, in an interview between Cointelegraph and <a href=\"https://cointelegraph.com/news/ai-grammys-recording-academy-ceo-harvey-mason-jr\">the CEO of the Recording Academy</a>, he said AI can be used as a “creative amplifier.” </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/biticulture-fine-art-on-solana-ai-music-podcast-book-reviews/\"><strong><em>BitCulture: Fine art on Solana, AI music, podcast + book reviews</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-09T12:20:00.000Z",
    "title": "How to become a ‘Blockchain Radical,’ according to podcaster Joshua Dávila",
    "url": "https://cointelegraph.com/news/how-to-become-a-blockchain-radical-according-to-podcaster-joshua-davila",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/6170df28-b692-4cf0-ba83-e521caebea0b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Despite its libertarian reputation, author and podcaster Joshua Dávila, aka The Blockchain Socialist, believes crypto is for everyone — including the Left.</p>\n                    <p><p>Crypto has been the subject of much criticism from those on the political Left, many of whom see cryptocurrencies like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) as being <a href=\"https://cointelegraph.com/magazine/is-ethereum-left-and-bitcoin-right/\">associated with libertarian or right-wing ideas</a>. One common perception is that cryptocurrencies and other blockchain-based technologies, such as <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a>, exist for the primary purpose of concentrating wealth, scamming investors and otherwise replicating existing financial and power structures — just in a more unregulated manner.</p><p>On Episode 16 of <em>The Agenda</em> podcast, hosts Ray Salmond and Jonathan DeYoung chat with author and podcaster Joshua Dávila, host of <em>The Blockchain Socialist</em> podcast and author of the new book <em>Blockchain Radicals: How Capitalism Ruined Crypto and How to Fix It. </em>Dávila is critical of the capitalistic tendencies of much of the crypto space and offers up an alternative informed by his perspective as a self-described “socialism maxi.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/5e769127-27fa-44e4-bd61-9c57f9ccc9e0.jpg\"  /></figure><h2>“Capitalism ruined crypto”</h2><p>Dávila acknowledged that there is a fundamental capitalistic mentality within most of crypto, saying the space has been “heavily influenced by kind of, I would say, more right-leaning libertarian thought, which includes a lot of, let’s say, support for capitalistic structures, for free markets and for all these things.” </p><p>This is reflected at a core level within the consensus mechanisms of most blockchains, which tend to rely on profit-seeking and asset accumulation to incentivize validators, he argued. “If there was no reason to accumulate profits or wealth in our society, then blockchains would crumble because that’s the way that they’re designed.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/mutual-aid-daos-and-activism-the-agenda-podcast-chats-with-pactdao-co-founder-marisa-rando\"><strong><em>Mutual aid, DAOs and activism: The Agenda podcast chats with PactDAO co-founder Marisa Rando</em></strong></a></p><p>Dávila pointed to venture capitalists, in particular, as a negative influence on crypto. He believes that while there were a lot of interesting experiments in the early days of crypto, the influx of venture capital has brought with it the expectation of massive returns for investors, which just ends up replicating the traditional economic order.</p><blockquote>“If there is no protection or some reason stopping them from coming in, of course they’re going to come in, and they’re going to ruin things because that’s like the modus operandi of what they do.”</blockquote><h2>What’s the alternative?</h2><p>There are many applications for cryptocurrency and blockchain that don’t fall within the existing socio-economic order, argued Dávila, who pointed to alternative chains such as Cosmos as examples of the way that blockchain’s design can influence its social implications. </p><template data-ct-widget=\"buzzsprout\" data-buzzsprout-podcast-id=\"2096305\"></template><p>He gave the example of a 2022 incident on Juno, a part of the Cosmos network, in which the community voted to “expropriate” $35 million worth of airdropped JUNO tokens from a wallet that had allegedly managed to receive more tokens than it was supposed to. “They have very clear on-chain governance directly for the chain itself that had obvious sociopolitical consequences,” he said. “They would not have been able to do that if this was Bitcoin.”</p><p>For Dávila, that is a good thing: “Ultimately, we are the creators of our destiny, so we should embrace that fact and implement that in technological code the best we can.”</p><p>As for his broader dreams for the crypto and tech landscape, Dávila said he would love to see “the creation of applications that allow for collective ownership of digital infrastructure.”</p><blockquote>“They [Web3 founders] need to create something that is different, that specifically gets at the root of the problem, which I think is how we own things and how we govern those things, and recognizing that our resources should be shared in common rather than completely privatized by whatever next billionaire comes up with another Big Tech company.”</blockquote><p>To hear more from Dávila’s conversation with <em>The Agenda,</em> listen to the full episode on <a href=\"https://cointelegraph.com/podcasts/the-agenda\">Cointelegraph’s Podcasts page</a>, <a href=\"https://podcasts.apple.com/us/podcast/the-agenda/id1659393166\" target=\"_blank\" rel=\"noopener nofollow\">Apple Podcasts</a> or <a href=\"https://open.spotify.com/show/6azmkkIXj5LQbxTRAbAqXS\" target=\"_blank\" rel=\"noopener nofollow\">Spotify</a>. And don’t forget to check out <a href=\"https://cointelegraph.com/podcasts\">Cointelegraph’s full lineup</a><a href=\"https://cointelegraph.com/podcasts\"></a> of other shows! </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tokenizing-music-royalties-nfts-taylor-swift-3lau-nas-the-weeknd/\"><strong><em>Tokenizing music royalties as NFTs could help the next Taylor Swift</em></strong></a></p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-09T12:30:09.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Surges Above $30,000, as Moody’s Downgrades 10 US Banks",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-surges-above-30000-as-moodys-downgrades-10-us-banks/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2132332221-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC Surges Above $30,000, as Moody’s Downgrades 10 US Banks\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2132332221-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2132332221-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2132332221-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2132332221-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2132332221-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2132332221-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2132332221-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin moved above $30,000 late on Tuesday, as markets reacted to the news that rating agency Moody&#x2019;s had downgraded several U.S. banks. The list includes State Street, Northern Trust, and Bank of New York Mellon. Ethereum was marginally higher. Bitcoin Bitcoin (BTC) briefly rose back above the $30,000 level late last night, as markets reacted [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T12:19:49.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.1206, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 0.74% decrease. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-09T12:34:39.000Z",
    "title": "Former FTX exec discusses plea deal with US prosecutors ",
    "url": "https://crypto.news/former-ftx-exec-discusses-plea-deal-with-us-prosecutors/",
    "description": "Former co-CEO of FTX Digital Markets, Ryan Salame, is reportedly holding talks with US federal prosecutors about a guilty plea deal. Ryan Salame, who was one of Sam Bankman-Fried&#8217;s close associates, is negotiating a guilty plea with US prosecutors, according&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-09T12:29:27.000Z",
    "title": "Bitcoin’s path to $30,000 challenged despite active old supply",
    "url": "https://crypto.news/bitcoins-path-to-30000-challenged-despite-active-old-supply/",
    "description": "Bitcoin supply dormant for 7-10 years springs to life, hitting a one-month high, as BTC grapples with the $30,000 mark. Bitcoin (BTC) supply, last active between seven and ten years, has continued to increase since the start of the month,&#8230;"
  }
]