[
  {
    "source": "CryptoSlate",
    "date": "2024-02-19T15:45:42.000Z",
    "title": "Record global inflows into digital asset funds push AuM to $59 billion peak",
    "url": "https://cryptoslate.com/record-global-inflows-into-digital-asset-funds-push-aum-to-59-billion-peak/",
    "description": "<p>Global digital asset investment products saw significant inflows last week, totaling $1.1 billion, propelling the year-to-date figure to $2.7 billion. The latest weekly report from CoinShares confirmed the surge in the inflow of funds into digital asset investment products, which pushed the assets under management to a peak not seen since early 2022, now standing [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/record-global-inflows-into-digital-asset-funds-push-aum-to-59-billion-peak/\">Record global inflows into digital asset funds push AuM to $59 billion peak</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-19T16:07:26.000Z",
    "title": "Binance Welcomes PIXEL: Expanding Trading and Investment Opportunities",
    "url": "https://www.cryptopolitan.com/binance-pixel-trading-investment-opportunity/",
    "description": "Binance, the leading global cryptocurrency exchange, is thrilled to announce the inclusion of Pixels (PIXEL) into its diverse range of services. The strategic expansion incorporates PIXEL into Binance Simple Earn, and Binance Convert, as well as upcoming integrations with Binance Margin, Binance Futures, and Binance Auto-Invest.  These enhancements are designed to provide Binance users with [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-19T16:06:33.000Z",
    "title": "Binance Phases Out Leveraged Tokens: Key Dates and Transition Plan",
    "url": "https://www.cryptopolitan.com/binance-phase-out-leveraged-token-transition/",
    "description": "Binance, the global leader in cryptocurrency trading, has made a pivotal announcement that will reshape its product offerings and impact its vast user base. By April 2024, Binance will officially cease support for Binance Leveraged Tokens (BLT), a decision driven by its commitment to prioritizing services that offer the highest value and meet the competitive [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-19T16:05:33.000Z",
    "title": "Bounce Launchpad Hosts XRGB ID0 Auction for Enhanced Bitcoin L2 Network",
    "url": "https://www.cryptopolitan.com/bounce-xrgb-id0-auction-bitcoin-l2-network/",
    "description": "Bounce Brand, a leading decentralized auction platform, has announced an exciting update regarding the XRGB ID0 auction, a significant event for the Bitcoin L2 network.&#160; Scheduled to commence on February 20th and conclude at the same time on February 21st, this auction is poised to capture the attention of cryptocurrency enthusiasts and investors alike. Exclusive [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-19T16:00:12.000Z",
    "title": "AltLayer Secures $14.4M for Rollup Tech Expansion, Boosting Blockchain Scalability",
    "url": "https://www.cryptopolitan.com/altlayer-rollup-boost-blockchain-scalability/",
    "description": "AltLayer, an innovative player in the realm of decentralized protocols, has completed a strategic funding round, amassing $14.4 million to bolster its rollup infrastructure. This financial milestone was achieved through the collective efforts of leading investment firms, with Polychain Capital and Hack VC at the helm as co-leaders of the round.&#160; The involvement of other [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-19T15:58:17.000Z",
    "title": "Trust Wallet introduces Swift, revolutionizing crypto smart contract accessibility",
    "url": "https://www.cryptopolitan.com/trust-wallet-introduces-swift-crypto-smart-contract/",
    "description": "Trust Wallet, a leading name in mobile self-custody Web3 wallets, has taken a significant step forward by introducing the public beta phase of SWIFT, its latest smart contract wallet innovation. This introduction marks a pivotal moment in the company’s efforts to demystify and bolster Web3 accessibility, aiming to onboard the next billion users into the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-19T15:51:49.000Z",
    "title": "Stellar Price Prediction 2024-2033: How High can XLM Go?",
    "url": "https://www.cryptopolitan.com/stellar-price-prediction/",
    "description": "Stellar Price Predictions 2024-2033 Stellar Lumens (XLM) is one of the oldest cryptocurrencies around. Many technological developments have been on the Stellar Lumens platform. One thing that draws believers to the coin is that it’s so cheap to send because that is the objective of XLM. Instant international transfer to challenge modernized banking systems should [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-19T16:00:00.000Z",
    "title": "Uniswap V4 launches while whales eye Ripple and NuggetRush",
    "url": "https://crypto.news/uniswap-v4-launches-while-whales-eye-ripple-and-nuggetrush/",
    "description": "Uniswap&#8217;s V4 launch is eyed for Q3, Ripple sees 218 million XRP bought by whales, and NuggetRush ICO sells 184 million tokens. The Uniswap Foundation has announced that the highly-anticipated version 4 of the decentralized exchange (DEX) will likely launch&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-19T16:00:49.000Z",
    "title": "NEAR Skyrockets Nearly 30% – Investors Intrigued By These Metrics",
    "url": "https://www.newsbtc.com/news/near-skyrockets-nearly-30-investors-intrigued-by-these-metrics/",
    "description": "NEAR has consistently followed the market trend since the start of the year. The latest market data shows the token is up nearly 30% bi-weekly. This is evidence that investors are still hyped by the recent growth featured within the broader market and the recent developments on the NEAR Protocol.  Related Reading: Bitcoin On Steroids: Key Technical Factors Fueling The Rally To $70,000 Account Aggregation: What’s The Gist?  NEAR is continuing its mission to be the one-all-be-all for entry-level and professional entities within Web 3. Account aggregation, or the consolidation of Web 3 and crypto accounts into one NEAR account, is their current focus.  Account aggregation is, according to their most recent blog post, a “critical pillar of advancing Chain Abstraction.”  It essentially groups every single account you have across the crypto world into a single access point: your NEAR Protocol account. The technology is still in development, but it seems to incite excitement in investors. If NEAR can implement this innovation seamlessly within its ecosystem and beyond, it will cement itself to be a true innovator within the DeFi and Web 3 space.  NEARUSD currently trading at $3.529 on the daily chart: TradingView.com According to a recent development overview done by Reflexivity Research, NEAR’s position allows it to be the bridge of all bridges within the crypto space. Overview of @NEARProtocol&#8216;s Q4 developments: NEAR Protocol stands as a Layer-1 (L1) smart contract blockchain that couples a state-of-the-art sharded architecture with an emphasis on offering a user experience reminiscent of Web 2 platforms. While maintaining the security and… pic.twitter.com/LzKcMldJy7 — Reflexivity Research (@reflexivityres) February 16, 2024 By distilling various blockchains to create a seamlessly integrated Web3 encounter, the advantages extend beyond mere enhancements in user experience. This approach has the potential to not only enhance UX but also diminish liquidity fragmentation and tribalism inherent in a decentralized crypto ecosystem constructed around disconnected, isolated blockchains, as underscored in a response by NEAR to a Reflexivity post on X. &#8220;abstracting away different blockchains for a seamless Web3 experience has benefits beyond simply improving UX. It can potentially also reduce the liquidity fragmentation and tribalism associated with a fragmented crypto economy built around disparate, siloed blockchains.&#8221; https://t.co/nxXMBKdMeJ — NEAR Protocol (@NEARProtocol) February 16, 2024 In simple terms, NEAR’s recent development can unite the fragmented Web 3 space, onboarding new users and bringing new growth to the crypto world.  NEAR Approaching A Possible Ceiling In its current situation, NEAR is following Bitcoin very closely in its price changes. Investors should then be careful of possible pitfalls within Bitcoin’s bullish market that may affect NEAR’s ability to climb.  Related Reading: Cardano Solid Stats: ADA Soars 14% On Rising TVL and Market Cap – Details If bearishness does take over the market, investors can rely on the $2.8 price level to slow down any bearish attempt in the short to medium term. However, investors and traders should try and consolidate on this line if NEAR follows any downward pressure from the broader market.  Featured image from Adobe Stock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-19T16:00:46.000Z",
    "title": "Experts Report Massive On-Chain Activity For Shiba Inu As Rebel Satoshi Picks Up Pace On Recusants Round 5 of its Presale",
    "url": "https://www.crypto-news-flash.com/experts-report-massive-on-chain-activity-for-shiba-inu-as-rebel-satoshi-picks-up-pace-on-recusants-round-5-of-its-presale/?utm_source=rss&utm_medium=rss&utm_campaign=experts-report-massive-on-chain-activity-for-shiba-inu-as-rebel-satoshi-picks-up-pace-on-recusants-round-5-of-its-presale",
    "description": "<img width=\"1200\" height=\"750\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-19T091138.832.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-19T091138.832.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-19T091138.832-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-19T091138.832-768x480.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-19T091138.832-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-19T091138.832-450x281.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Crypto market experts have expressed optimism for the future of Shiba Inu (SHIB), predicting a 52% price surge in 2024. Rebel Satoshi (RBLZ) has picked up pace in Recusants Round 5, the last stage of its presale, as the best ICO. Early investors look for a stunning 150% ROI as $RBLZ launches on DEX in [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-19T15:53:29.000Z",
    "title": "Binance to Pull Back Support for Leveraged Tokens in April",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/binance-to-pull-back-support-for-leveraged-tokens-in-april/",
    "description": "<p>Binance, in a blog post shared on Feb. 19, said that it would no longer support Binance Leveraged Tokens (BLT). The decision is reportedly part of its product review and the exchange&#8217;s decision to focus on products and services that yield the most value to its users. Binance Ends Leveraged Token Support in April Binance [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/binance-to-pull-back-support-for-leveraged-tokens-in-april/\">Binance to Pull Back Support for Leveraged Tokens in April</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-19T15:52:00.000Z",
    "title": "Shiba Inu’s Shibarium Surges 40% Closing in on $0.00001",
    "url": "https://coinedition.com/shiba-inus-shibarium-surges-40-closing-in-on-0-00001/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shibarium Heat: SHIB Rally Roars, Price Reaches $0.00001\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a significant update for the Shiba Inu community, Shibarium&#8217;s activity surged by 40% on February 16, sending the price of the most popular meme coin, Shiba Inu, to $0.00001.  According to Shibariumscan, new BONE transfers on Shibarium increased from 415 on February 13 to over 47,714 on February 15. As a result, the meme [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/shiba-inus-shibarium-surges-40-closing-in-on-0-00001/\">Shiba Inu&#8217;s Shibarium Surges 40% Closing in on $0.00001</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2024-02-19T15:45:55.000Z",
    "title": "Bitcoin Stamps, What Are They?",
    "url": "https://blog.bitfinex.com/education/bitcoin-stamps-what-are-they/",
    "description": "<p>Bitcoin Stamps introduce a novel method for embedding art within the Bitcoin blockchain, leveraging the Counterparty protocol to integrate base64-encoded image data directly into Bitcoin&#8217;s blockchain. This method contrasts sharply with traditional NFTs that often link to external images, which may be altered or lost....</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/education/bitcoin-stamps-what-are-they/\">Bitcoin Stamps, What Are They?</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]