[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-19T04:30:53.000Z",
    "title": "Crypto Conglomerates Should Be Regulated, MiCA 2 Needed, Bank of France Governor Says",
    "url": "https://news.bitcoin.com/crypto-conglomerates-should-be-regulated-mica-2-needed-bank-of-france-governor-says/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_320134382-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto Conglomerates Should Be Regulated, MiCA 2 Needed, Bank of France Governor Says\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_320134382-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_320134382-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_320134382-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_320134382-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_320134382-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_320134382-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_320134382.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />International cooperation is necessary to regulate crypto conglomerates, according to the head of the central bank of France. Speaking at a tech forum in Paris, Governor Villeroy de Galhau also suggested that a new version of the EU’s recently adopted crypto law may be needed to deal with the issue. Regulation in Single Jurisdiction Insufficient [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-19T04:12:08.000Z",
    "title": "Ethereum Price Prints Bullish Technical Pattern, Why Close Above $1,780 Is Critical",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-bullish-above-1780/",
    "description": "Ethereum price is recovering above $1,700 against the US Dollar. ETH could continue to move up if it clears the $1,780 resistance zone. Ethereum was able to climb above the $1,700 and $1,720 resistance levels. The price is trading above $1,700 and the 100-hourly Simple Moving Average. There was a break above a major bearish trend line with resistance near $1,720 on the hourly chart of ETH/USD (data feed via Kraken). The pair could rise further above the $1,750 and $1,780 resistance levels. Ethereum Price Attempts Recovery Ethereum’s price was able to form a support base above the $1,620 level. ETH started a decent recovery wave above the $1,680 and $1,700 resistance levels, similar to Bitcoin. Besides, there was a break above a major bearish trend line with resistance near $1,720 on the hourly chart of ETH/USD. The bulls even pushed the price above the $1,750 resistance and the 100-hourly Simple Moving Average. It tested the $1,770 level. A high is formed near $1,768 and the price is now correcting gains. There was a move below the $1,750 level. Ether dipped below the 23.6% Fib retracement level of the upward move from the $1,620 swing low to the $1,768 high. It is now trading above $1,700 and the 100-hourly Simple Moving Average. Immediate resistance is near the $1,740 level. The next major resistance is near the $1,770 level. Source: ETHUSD on TradingView.com The main resistance is near $1,780. A proper move above the $1,770 and $1,780 resistance levels might start a steady recovery wave. The next resistance sits near $1,820, above which Ethereum could rise toward the $1,850 level. Any more gains above the $1,850 resistance zone might send the price toward the $1,920 resistance. Fresh Decline in ETH? If Ethereum fails to clear the $1,780 resistance, it could start another decline. Initial support on the downside is near the $1,710 level. The next major support is near the $1,675 level or the 61.8% Fib retracement level of the upward move from the $1,620 swing low to the $1,768 high. If there is a break and close below the $1,675 support, the price could dive toward the $1,620 support. Any more losses may perhaps send the price toward the $1,550 zone. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,675 Major Resistance Level – $1,780"
  }
]