[
  {
    "source": "CoinDesk",
    "date": "2023-07-19T08:59:54.000Z",
    "title": "1Inch Token Balance on Centralized Exchanges Surges to $65M",
    "url": "https://www.coindesk.com/markets/2023/07/19/1inch-token-balance-on-centralized-exchanges-surges-to-65m/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The balance held in wallets tied to centralized exchange has surged by 50% in three days, per Glassnode data."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-19T09:00:00.000Z",
    "title": "ATPBot Launches the Easiest Automated Crypto Trading Bot for Investors",
    "url": "https://www.cryptoglobe.com/latest/2023/07/atpbot-launches-the-easiest-automated-crypto-trading-bot-for-investors/",
    "description": "Disclaimer: This article is sponsored content and should not be considered as financial or investment advice. Always do your own research before making any financial decisions. The opinions expressed in this article are those of the author and do not necessarily reflect the views of CryptoGlobe. ATPBot has launched an easy-to-use auto trading bot. With […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T08:49:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. BNB prices have dropped by 23.95% since April 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-19T08:49:04.000Z",
    "title": "Binance burns $484m worth of BNB as market turns green",
    "url": "https://crypto.news/binance-burns-484m-worth-of-bnb-as-market-turns-green/",
    "description": "Binance announced its 24th binance coin (BNB) burn while the asset consolidated in the red zone.  More than 1.99 million tokens were burned, with a total value of over $484 million at the time of the transaction. The burnt assets&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-19T08:41:16.000Z",
    "title": "Kennedy Jr. to back dollar with bitcoin, if elected",
    "url": "https://crypto.news/kennedy-jr-to-back-dollar-with-bitcoin-if-elected/",
    "description": "Robert F. Kennedy Jr. (RFK Jr.) has been making bold claims about the COVID-19 vaccines and now says he would back the US dollar with bitcoin (BTC). The Democratic presidential candidate shared his pro-crypto, especially bitcoin, policies in a video&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T08:55:50.000Z",
    "title": "Signal With Perfect Track Record Predicts Bitcoin Bull Market Parabola: Analyst",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-bull-market-parabola-signal-perfect-record/",
    "description": "In a recent newsletter by renowned analyst CryptoCon, a groundbreaking indicator known as the &#8220;Bitcoin DXY correlation coefficient&#8221; has captured the attention of the community. This indicator, which measures the correlation between Bitcoin and the U.S. Dollar Index (DXY), has shown remarkable accuracy in predicting Bitcoin&#8217;s price movements and signaling the beginning of bull market parabolas. According to CryptoCon, the Bitcoin DXY correlation coefficient is &#8220;one of the most interesting finds&#8221; he has come across in quite some time. In his newsletter, he explains the significance of this indicator and its implications for the future of Bitcoin&#8217;s price trajectory. Bitcoin At Onset Of A Bull Market Parabola? The analyst highlights the three distinct phases that the correlation coefficient enters during a market cycle. He states, &#8220;During a given market cycle, the correlation coefficient enters this zone in 3 phases.&#8221; These phases are represented by different colors: PURPLE: The first move into the low correlation zone, which occurs slightly before the bear market bottom. RED: The second move into the low correlation zone, marking the end of the bear market or the bottom of the cycle. GREEN: After some time, the metric returns to the low correlation zone, signaling the start of the true bull market parabola. CryptoCon emphasizes the significance of these findings, stating, &#8220;And&#8230;there are no false signals when viewed in this way, extremely interesting! I have reviewed some other observations that allude to this, but not to this level of preciseness and caliber.&#8221; Related Reading: Bitcoin’s Worst Performance Period Ever: Is the Bottom In Sight? Furthermore, the analyst brings attention to the influence of the U.S. dollar on Bitcoin&#8217;s parabola. He explains, &#8220;And this is from an outside factor, the Dollar. Meaning that the strength of the US dollar has great influence on when Bitcoin parabola takes place.&#8221; This correlation adds an additional layer of complexity and highlights the interplay between these two market forces. Drawing comparisons to the 2013 cycle, the analyst speculates on the potential future trajectory of Bitcoin. He suggests that the upcoming market cycle could resemble a two-curve pattern. CryptoCon states: I believe this could look something like a 2013 cycle. If we are indeed expecting an early powerful bull move, this could come in the form of two curves. He further elaborates on the timeframes for these curves, stating, &#8220;The first comes early and would probably end sometime in 2024. The second comes later and ends late 2025 according to my Nov 28th Cycles Theory.&#8221; Related Reading: This Bitcoin Continuation Pattern Points To 3-6 Months Of Uptrend Ahead The analyst also shared his price projections for the upcoming bull market parabola. He states, &#8220;As for the price target of this parabola, I will speak to the first one. Personally, I would expect it to come just over or short of ATHs. The secondary later top at 90-130k which is my personal range and projection for the cycle.&#8221; Concluding the newsletter, he emphasizes the potential opportunity that lies ahead for Bitcoin investors. He states, &#8220;So regardless of the short term, big things are on the horizon for Bitcoin according to data. And maybe&#8230; just maybe&#8230; you might not have to be as patient as you expect for it.&#8221; At press time, Bitcoin traded at $30,016. Featured image from Forbes, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-19T08:44:40.000Z",
    "title": "Binance Users Commit $2.43 Billion Worth of BNB in ARKM Public Sale – Don’t Miss Your Investment Opportunity",
    "url": "https://www.crypto-news-flash.com/binance-users-commit-2-43-billion-worth-of-bnb-in-arkm-public-sale-dont-miss-your-investment-opportunity/?utm_source=rss&utm_medium=rss&utm_campaign=binance-users-commit-2-43-billion-worth-of-bnb-in-arkm-public-sale-dont-miss-your-investment-opportunity",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-89.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BNB CHAIN\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-89.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-89-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Binance successfully concluded the ARKM token public sale, surpassing its $2.5 million hard cap and achieving a remarkable oversubscription rate of 990x. ARKM tokens are now available for trading on Binance, with an impressive 13-fold increase in value from its initial sale price. Binance Wraps Up ARKM Public Sale with $2.43 Billion Committed by Users [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-19T08:46:56.000Z",
    "title": "Two Cardano Tokens that Could Do 20x",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/two-cardano-tokens-that-could-do-20x/",
    "description": "<p>Bitcoin is showing impressive price movements, and leading altcoins are starting to rally. Everything around the crypto market points to the fact that a bull market is near. We don&#8217;t know if it&#8217;s going to happen in a month, six months, or maybe a year. But what we do know is that top traders are [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/two-cardano-tokens-that-could-do-20x/\">Two Cardano Tokens that Could Do 20x</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]