[
  {
    "source": "Cryptopolitan",
    "date": "2024-04-07T12:36:04.000Z",
    "title": "Grand Forks UAS Startup Secures $1.1 Million Investment for AI and Technology Development",
    "url": "https://www.cryptopolitan.com/grand-forks-investment-for-ai-and-technology/",
    "description": "Aethero, a Grand Forks-based startup mainly dealing with AI and UAS, has raised more than $1.1 million. This funding will help the company pursue its mission of promoting the growth of new unattended aerial systems and artificial intelligence technologies. When Aethero goes public, we expect venture capital to drive our company&#8217;s innovation further. Venture capital [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-07T12:24:00.000Z",
    "title": "Costa Rica debates legal use of Bitcoin for daily transactions",
    "url": "https://www.cryptopolitan.com/costa-rica-debates-legal-use-of-bitcoin-for-daily-transactions/",
    "description": "Costa Rica is already involved in debates on the legality of Bitcoin and other cryptocurrencies and their daily usage. This evolution of the payment system is an indicator of the wider world&#8217;s growing openness to cryptocurrencies as a valid payment method. JAN3, a company in the Bitcoin technology industry, recently mentioned that Costa Rica has [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-04-07T12:36:42.000Z",
    "title": "Casino capitalism at NFT.NYC, plus, are NFTs really dead? #hearsay | Opinion",
    "url": "https://crypto.news/casino-capitalism-at-nft-nyc-plus-are-nfts-really-dead-hearsay-opinion/",
    "description": "From Magic Eden's degen yacht party to Forbes' multichain mixer, NFT.NYC offered a spectacle of excess and elitism, and then some more in another episode of #hearsay."
  },
  {
    "source": "BTCManager",
    "date": "2024-04-07T12:28:04.000Z",
    "title": "Jury convicts Do Kwon, meme coins enjoy Q1 gains, Ripple to launch stablecoin | Weekly Recap",
    "url": "https://crypto.news/jury-do-kwon-ripple-stablecoin-meme-coin-weekly-recap/",
    "description": "Last week, a jury in New York declared Terraform Labs and its founder Do Kwon guilty of fraud charges. The meme coin narrative garnered attention, and Ripple looked to launch a USD-backed stablecoin. Here's our weekly recap. "
  }
]