[
  {
    "source": "Decrypt",
    "date": "2024-02-07T03:02:02.000Z",
    "title": "With Caps Removed, Buzzy Eigenlayer Blows Past $3 Billion Total Value Locked",
    "url": "https://decrypt.co/216203/eigenlayer-total-value-locked-doubles-to-3-billion-in-one-day",
    "description": "With limits removed until Friday, Feb. 9, the security-focused staking protocol is trying to balance being neutral and being decentralized."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T03:03:04.000Z",
    "title": "UK Postpones Stablecoin Feedback Deadline, Pushing for Thorough Crypto Regulation",
    "url": "https://www.cryptopolitan.com/uk-stablecoin-feedback-deadline-regulation/",
    "description": "In a strategic move, the United Kingdom has extended the deadline for feedback on the Bank of England&#8217;s (BOE) discussion paper regarding stablecoin regulation. The extension, shifting the deadline from February 6 to February 12, is part of a broader initiative to construct a comprehensive regulatory framework for crypto-assets. Although the deadline for the Financial [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T02:55:39.000Z",
    "title": "Clayton’s hint at SEC appeal adds fuel to Ripple’s legal battle",
    "url": "https://www.cryptopolitan.com/claytons-hint-at-sec-appe-ripples-legal-case/",
    "description": "Former Securities and Exchange Commission (SEC) Chair Jay Clayton has weighed in on the ongoing legal battle between the SEC and Ripple, indicating that the case may not see a resolution anytime soon. Clayton&#8217;s remarks and potential appeal In a recent interview with Henri Arslanian on the Future of Money Podcast, Clayton hinted at the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-07T03:01:11.000Z",
    "title": "Bitcoin Price Reclaims 100 SMA But Can Bulls Clear This Hurdle",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-reclaims-42500/",
    "description": "Bitcoin price is consolidating above the $42,500 support zone. BTC could gain bullish momentum if it clears the $43,500 resistance zone. Bitcoin price is still struggling to clear the $43,400 and $43,500 resistance levels. The price is trading above $42,500 and the 100 hourly Simple moving average. There is a key rising channel forming with support at $42,450 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a strong increase if it clears the $43,500 resistance zone. Bitcoin Price Aims Higher Bitcoin price formed a base above the $41,800 level and started a steady increase. BTC was able to clear the $42,200 and $42,500 resistance levels. It also reclaimed the 100 hourly Simple moving average. The price climbed above the 50% Fib retracement level of the downward move from the $43,488 swing high to the $42,320 low. The bulls even pushed the price above the $43,000 level. However, the bears seem to be active near the $43,200 level. It is near the 76.4% Fib retracement level of the downward move from the $43,488 swing high to the $42,320 low. Bitcoin is now trading above $42,650 and the 100 hourly Simple moving average. Immediate resistance is near the $43,200 level. The next key resistance could be $43,500, above which the price could start a decent increase. The next stop for the bulls may perhaps be $44,200. Source: BTCUSD on TradingView.com A clear move above the $44,200 resistance could send the price toward the $45,000 resistance. The next resistance is now forming near the $45,500 level. A close above the $45,500 level could push the price further higher. The next major resistance sits at $46,500. Another Decline In BTC? If Bitcoin fails to rise above the $43,500 resistance zone, it could start another decline. Immediate support on the downside is near the $42,900 level and the 100 hourly SMA. The first major support is $42,450 and the channel trend line. If there is a close below $42,450, the price could gain bearish momentum. In the stated case, the price could dive toward the $41,800 support. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $42,900, followed by $42,450. Major Resistance Levels – $43,200, $43,400, and $43,500."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-07T03:00:14.000Z",
    "title": "Monero Plummets Following Major Crypto Exchange Delisting, Are More Losses Imminent?",
    "url": "https://www.newsbtc.com/news/monero/monero-plummets-following-major-crypto-exchange-delisting-are-more-losses-imminent/",
    "description": "On February 6, Monero (XMR), a privacy and security-focused token, saw its price drop after Binance, one of the largest crypto exchanges, announced its delisting in the following weeks alongside another three tokens. Related Reading: Bitcoin SV (BSV) Price Dips Following Coinbase Delisting Monero (XMR) To Be Delisted This Month Binance recently announced the delisting and cease of all trading activity of Aragon (ANT), Multichain (MULTI), Vai (VAI), and Monero (XMR) starting on February 20, 2024, at 03:00 (UTC). The decision came after Binance’s most recent review, which determined that the platform could no longer support the tokens. Following the review of digital assets in the exchange, Binance revealed its resolution to delist these tokens, affirming that they no longer met the exchange’s standards. Some of the factors the decision was based on include “evidence of unethical or fraudulent conduct or negligence” and “contribution to a healthy and sustainable crypto ecosystem.” Binance has announced the removal of Monero&#8217;s trading pairs, including XMR/BNB, XMR/BTC, XMR/ETH, and XMR/USDT, from the platform. All trade orders will be automatically removed once the trading ceases. Additionally, any XMR deposit done after February 21, 2024, at 03:00 (UTC), won’t be credited to the user’s accounts, and withdrawals of XMR will be supported until May 20, 2024. Binance also informed that XMR tokens may be converted into stablecoins on behalf of users after the withdrawal deadline, although it “is not guaranteed.” Binance Faces Criticism Upon Delisting News A plunge in Monero&#8217;s price immediately followed the announcement. According to data from CoinGecko, XMR went from trading at $165 before the announcement to $148 in the following 30 minutes. Since then, the token has continued to dive lower, trading at $111,85 at writing time, accounting for a 32.7% drop in the last 24 hours. The crypto community received the news with concerns. Several users questioned the reasons for Monero’s delisting and expressed disappointment in the exchange’s decision. The team behind Monero shared on its X account (formerly known as Twitter) that the delisting comes after Binance&#8217;s new requirement. The crypto exchange stated that deposits must come from a &#8220;publicly transparent address, which Monero doesn’t allow.&#8221; Crypto Trader John Brown shared his thoughts on XMR’s delisting from the exchange on his X account, saying that, although it’s a negative situation for Monero, this is mostly a &#8220;negative sign for Binance&#8221; due to his belief that the exchange is “so compliant” that they no longer can choose the assets to support. Monero dropped strongly on the delisting news from Binance. While bad for Monero, I mainly see this delisting as a sign of the slow demise of Binance. They are now &#34;so compliant&#34; that they cannot choose anymore which assets to support. &#8212; John Brown (@john_j_brown) February 6, 2024 Last year, Binance and its former CEO Changpeng Zhao, known as CZ, faced regulatory scrutiny after pleading guilty in the United States to the charges of Anti-Money Laundering, Unlicensed Money Transmitting, and Sanctions Violations. Related Reading: Binance Sets New Record: Spot Trading Volume Reaches $427 Billion Monero (XRM) is trading at $114,9 on the hourly chart. Source: XMRUSDT on TradingView.com Feature image from Unsplash.com, Chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-07T02:54:35.000Z",
    "title": "Has the Bullish Trend for Ethereum Already Passed?",
    "url": "https://www.crypto-news-flash.com/has-the-bullish-trend-for-ethereum-already-passed/?utm_source=rss&utm_medium=rss&utm_campaign=has-the-bullish-trend-for-ethereum-already-passed",
    "description": "<img width=\"1800\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-silver-coin-next-to-bear-with-trading-chart-in-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethereum-ETH-silver-coin-next-to-bear-with-trading-chart-in-background\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-silver-coin-next-to-bear-with-trading-chart-in-background.jpg 1800w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-silver-coin-next-to-bear-with-trading-chart-in-background-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-silver-coin-next-to-bear-with-trading-chart-in-background-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-silver-coin-next-to-bear-with-trading-chart-in-background-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-silver-coin-next-to-bear-with-trading-chart-in-background-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-silver-coin-next-to-bear-with-trading-chart-in-background-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-silver-coin-next-to-bear-with-trading-chart-in-background-450x300.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-silver-coin-next-to-bear-with-trading-chart-in-background-1200x800.jpg 1200w\" sizes=\"(max-width: 1800px) 100vw, 1800px\" />Ethereum&#8217;s 2023 saw challenges amid consistent gains, with prices showing growth but failing to consolidate, raising doubts about sustained bullish momentum. Market volatility in January 2024, including a significant price correction and denial of a spot BTC ETF, prompts speculation about the future trajectory of Ethereum and cryptocurrencies, with analysts divided on the potential outcomes. [...]"
  }
]