[
  {
    "source": "CoinDesk",
    "date": "2023-11-27T19:45:28.000Z",
    "title": "Coinbase Is Dominating a Key Bitcoin ETF Service. Can Anyone Else Join the Race?",
    "url": "https://www.coindesk.com/business/2023/11/27/coinbase-is-dominating-a-key-bitcoin-etf-service-can-anyone-else-join-the-race/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The race to provide a key bit of infrastructure for bitcoin [BTC] ETFs – custody services – hasn't actually been much of a race so far. Crypto exchange Coinbase has dominated so far, winning the job from the majority of applications from the likes of BlackRock, WisdomTree and Valkyrie."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-27T19:40:57.000Z",
    "title": "Bitcoin Hovers Near Yearly High as Halving and ETF Loom",
    "url": "https://decrypt.co/207593/bitcoin-hovers-near-yearly-high-halving-etf",
    "description": "Bitcoin appears to be holding onto gains in an anticipation of big events next year."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-27T20:00:00.000Z",
    "title": "The end of an era for Binance, troubles for Kraken: Law Decoded ",
    "url": "http://cointelegraph.com/news/the-end-of-an-era-for-binance-troubles-for-kraken-law-decoded-nov-20-27",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/04f6b089-012d-4110-bd1a-cdbeb9281b0e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance and CZ’s ongoing legal drama with United States law enforcement ended with a plea deal.</p>\n                    <p><p>Last week, the legal drama featuring the world’s largest crypto exchange and United States law enforcement <a href=\"https://cointelegraph.com/news/binance-timeline-settlement-us-government\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-timeline-settlement-us-government/amp\">ended with a plea deal</a>. Binance and Changpeng “CZ” Zhao <a href=\"https://cointelegraph.com/news/breaking-binance-changpeng-zhao-pleads-guilty-violating-anti-money-laundering-requirements-wsj\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/breaking-binance-changpeng-zhao-pleads-guilty-violating-anti-money-laundering-requirements-wsj/amp\">have admitted violating</a> U.S. Anti-Money Laundering laws, agreeing to pay $4.3 billion in fines. CZ resigned as CEO of Binance as part of the deal. Binance’s former head of regional markets outside the U.S., Richard Teng, <a href=\"https://cointelegraph.com/news/binance-richard-teng-ceo-amid-changpeng-zhao-s-forced-departure\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-richard-teng-ceo-amid-changpeng-zhao-s-forced-departure/amp\">is the new CEO</a>.</p><p>Cardano founder Charles Hoskinson <a href=\"https://cointelegraph.com/news/binance-ceo-downfall-end-era-charles-hoskinson\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-ceo-downfall-end-era-charles-hoskinson/amp\">reflected on the plea deal</a> news, calling it “the end of an era.” In Hoskinson’s opinion, entrepreneurs must comply with regulations or develop permissionless protocols that can’t be regulated. Hoskinson warned that the world is changing and that entrepreneurs will no longer be able to get by using centralized systems while simultaneously not complying with regulations. This is because “the United States has a financial regime that basically has been weaponized,” and this regime will not allow entrepreneurs to open up markets that let “the enemies of America to basically trade and do things.”</p><p>Meanwhile, Kraken, another major crypto exchange, has been dragged into <a href=\"https://cointelegraph.com/news/sec-sues-kraken-for-securities-laws-violations\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-sues-kraken-for-securities-laws-violations/amp\">another legal fight</a> with the U.S. Securities Exchange Commission (SEC). In a complaint filed in a San Francisco federal court, the SEC claimed that Kraken has been operating a platform that unlawfully facilitated the buying and selling of cryptocurrencies since 2018. Additionally, the SEC alleged Kraken’s business practices and “deficient” internal controls saw the exchange commingle up to $33 billion worth of customer assets with its own. The SEC said this resulted in a “significant risk of loss” for its clients. Kraken founder <a href=\"https://cointelegraph.com/news/kraken-jesse-powell-slams-sec-warns-us-crypto-firms\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/kraken-jesse-powell-slams-sec-warns-us-crypto-firms/amp\">Jesse Powell called the action</a> an “assault on America” and called the SEC the U.S.’s “top decel.” Powell even warned other companies to depart the country. </p><h3>No bail for Sam Bankman-Fried</h3><p>FTX founder and convicted fraudster Sam Bankman-Fried will remain behind bars after failing to convince a U.S. appellate court that he should be freed while his legal team appeals his conviction. The U.S. Court of Appeals for the Second Circuit said Bankman-Fried’s previous attempts to tamper with two witnesses while on pretrial release were a major reason behind rejecting his request. “We have reviewed the Defendant-Appellant’s additional arguments and find them unpersuasive,” the court said. Bankman-Fried’s legal team also argued that the district court failed to consider a less restrictive alternative to detention.</p><p><a href=\"https://cointelegraph.com/news/court-rejects-sam-bankman-fried-release-bid\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/court-rejects-sam-bankman-fried-release-bid/amp\"><strong>Continue reading</strong></a><strong> </strong></p><h3>BlackRock discusses spot Bitcoin ETFs with the SEC</h3><p>Representatives from BlackRock and the Nasdaq met with the SEC to discuss the proposed rule allowing the listing of a spot Bitcoin exchange-traded fund, or ETF. BlackRock presented how the firm could use an in-kind or in-cash redemption model for its iShares Bitcoin Trust. It’s unclear how SEC officials responded to the two proposed models or if they intend to approve a spot BTC ETF after numerous delays and rejections. Many reports have suggested the SEC could be nearing a decision on a spot BTC ETF for listing on U.S. markets. If approved, it would be a significant move toward mainstream crypto adoption. SEC officials also <a href=\"https://cointelegraph.com/news/grayscale-meets-sec-to-discuss-bitcoin-trust\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/grayscale-meets-sec-to-discuss-bitcoin-trust/amp\">met with Grayscale representatives</a> on Nov. 20 in the firm’s bid to list a Bitcoin ETF.</p><p><a href=\"https://cointelegraph.com/news/blackrock-sec-spot-bitcoin-etf-discussion\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/blackrock-sec-spot-bitcoin-etf-discussion/amp\"><strong>Continue reading</strong></a></p><h3>Tether and Bitfinex won’t resist a Freedom of Information Law request from U.S. media</h3><p>Tether and Bitfinex have jointly agreed to drop initial opposition to a Freedom of Information Law (FOIL) request lodged in New York by some high-profile news publications. A statement from the Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) stablecoin issuer and cryptocurrency exchange shared with Cointelegraph notes that it is committed to transparently sharing information following a FOIL request from CoinDesk earlier in 2023. Tether and Bitfinex will not appeal against the FOIL request put forward by journalists, including Zeke Faux, Shane Shifflett and Ada Hui, whom they accuse of exhibiting “certain behaviors.” </p><p>The ongoing FOIL request relates to Tether and Bitfinex reaching an agreement with the New York Attorney General in February 2021. As initially reported by CNBC, the agreement involved paying an $18.5 million fine to settle a two-year-long legal dispute regarding the alleged commingling of $850 million of client and corporate funds. </p><p><a href=\"https://cointelegraph.com/news/tether-bitfinex-agree-drop-opposition-foil-request\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/tether-bitfinex-agree-drop-opposition-foil-request/amp\"><strong>Continue reading</strong></a><strong> </strong></p>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-27T19:55:50.000Z",
    "title": "BMW Group Plant Regensburg Implements Innovative Predictive Maintenance System",
    "url": "https://www.cryptopolitan.com/bmw-group-plant-regensburg-implements-innovative-predictive-maintenance-system/",
    "description": "BMW Group Plant Regensburg is setting new standards in assembly line efficiency with its groundbreaking smart analysis system, aimed at preventing unplanned stoppages and optimizing vehicle production flow.&#160; The cutting-edge predictive maintenance solution employs artificial intelligence (AI) to proactively identify and address potential equipment faults, resulting in significant improvements in production uptime and cost savings. ... <a title=\"BMW Group Plant Regensburg Implements Innovative Predictive Maintenance System\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bmw-group-plant-regensburg-implements-innovative-predictive-maintenance-system/\" aria-label=\"More on BMW Group Plant Regensburg Implements Innovative Predictive Maintenance System\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-27T19:53:23.000Z",
    "title": "Japanese crypto investment firm CGV invests $5 Million in Blast’s Layer 2 ecosystem",
    "url": "https://www.cryptopolitan.com/cgv-invests-5-million-in-blasts-layer-2/",
    "description": "On November 27, CGV, a Japanese crypto investment firm, announced a significant investment in the fast-rising Blast ecosystem. This $5 million investment is part of a collaborative effort to foster the growth and development of the Blast network, a Layer 2 solution leveraging Optimistic Rollup technology and boasting Ethereum compatibility. The Blast network has quickly ... <a title=\"Japanese crypto investment firm CGV invests $5 Million in Blast&#8217;s Layer 2 ecosystem\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cgv-invests-5-million-in-blasts-layer-2/\" aria-label=\"More on Japanese crypto investment firm CGV invests $5 Million in Blast&#8217;s Layer 2 ecosystem\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-27T19:51:45.000Z",
    "title": "The Power of Chatbots for Small Businesses",
    "url": "https://www.cryptopolitan.com/the-power-of-chatbots-for-small-businesses/",
    "description": "In today&#8217;s fast-paced business landscape, small business owners are constantly seeking innovative ways to enhance customer engagement and streamline operations. One technology that has gained significant traction in recent years is the use of chatbots. These intelligent computer programs, powered by natural language processing (NLP) and artificial intelligence (AI), are reshaping the way small businesses ... <a title=\"The Power of Chatbots for Small Businesses\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-power-of-chatbots-for-small-businesses/\" aria-label=\"More on The Power of Chatbots for Small Businesses\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-27T19:45:53.000Z",
    "title": "Breakthrough machine model predicts cardiac arrest in ICU patients with high accuracy",
    "url": "https://www.cryptopolitan.com/machine-model-predicts-cardiac-arrest/",
    "description": "In a groundbreaking study published in Npj Digital Medicine, researchers have unveiled a new machine learning (ML) model that demonstrates exceptional accuracy in predicting cardiac arrest in intensive care unit (ICU) patients using electrocardiogram (ECG) data. Unraveling the need for improved predictive models Despite advancements in critical care medicine, the incidence of unexpected and sudden ... <a title=\"Breakthrough machine model predicts cardiac arrest in ICU patients with high accuracy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/machine-model-predicts-cardiac-arrest/\" aria-label=\"More on Breakthrough machine model predicts cardiac arrest in ICU patients with high accuracy\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-27T19:50:30.000Z",
    "title": "Changpeng Zhao’s UAE return halted by federal court before sentencing",
    "url": "https://crypto.news/changpeng-zhaos-uae-return-halted-by-federal-court-before-sentencing/",
    "description": "U.S. District Judge halts Binance CEO Changpeng Zhao's return to UAE, citing risk of non-return before his February sentencing for financial violations. "
  },
  {
    "source": "BTCManager",
    "date": "2023-11-27T19:41:21.000Z",
    "title": "Magic Eden releases cross-chain NFT and crypto wallet",
    "url": "https://crypto.news/magic-eden-releases-cross-chain-nft-and-crypto-wallet/",
    "description": "Magic Eden has announced the launch of a multi-chain compatible crypto wallet browser extension, aiming to simplify user interaction across different blockchains."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-27T20:00:47.000Z",
    "title": "Ripple IPO May Be Delayed, Crypto Pundit Gives Reasons Why",
    "url": "https://www.newsbtc.com/ripple-2/ripple-ipo-may-be-delayed-why/",
    "description": "Crypto Pundit, Dushyant Shahrawat has suggested that the decline in the global financial technology companies may result in a delay in the highly anticipated Ripple IPO.  FinTech Challenges May Push Back Ripple IPO Timeline An XRP community member, Crypto Eri has shared details about Ripple IPO’s timeline in a post on X (formerly Twitter). The X post briefly shed light on a recent interview on NASDAQ Trade Talks, between global markets Reporter, Jill Malandrino and investment banker at Rosenblatt Securities, Dushyant Shahrawat. Related Reading: Road To $1: Why Did Terra Classic (USTC) Rise 300% In One Day? When asked about his views on the current state of the financial technology industry, Shahrawat emphasized the declining performance of some major fintech companies. He mentioned companies like Block which had experienced major declines this year and saw its shares dropping more than 80% from its all-time high. Shahrawat has stated that the underperformance of these fintech companies could result in a delay for cryptocurrencies scheduled to go public. He mentioned prominent names like Circle and Ripple, which had declared its intentions to initiate an IPO by 2024.  “You can walk the hallways here, you&#8217;ve got Circle, Ripple, all the private fintech companies, unicorns, that were waiting in the wings to go public. That time frame (to IPO) got pushed back a little bit, quite a bit,” Shahrawat stated in the interview.  Despite financial specialists predicting an early 2024 launch for the Ripple IPO, Shahrawat has hinted that a minor delay might be in store, at least until the bearish trend in the fintech sector shows signs of recovery.  IPO Delay Amidst Regulatory Actions A blockchain researcher and XRP community member, Collin Brown has also highlighted reasons contributing to Ripple’s IPO delay. Brown has disclosed that the present market conditions and the intensified regulatory scrutiny on Binance are the driving forces behind the postponement of Ripple’s IPO.  “The Ripple IPO is being delayed due to market circumstances, as well as the need for the SEC and BlackRock to crack down on Binance. Now that the path is clear, they will likely prepare for another correction. This will allow Wall Street giants to buy Bitcoin and XRP at lower prices,” Brown said.  Related Reading: Whales Move $30 Million Worth Of XRP To Exchanges – Time To Sell? The researcher has also stated that the price of XRP could be pushed toward $50 soon. This prediction is based on the potential approval of Bitcoin ETFs by the United States Securities and Exchange Commission (SEC).  “Former NYSE President believes a Bitcoin ETF will attract a flood of money into the industry. Easier access to BTC will likely drive adoption and investment. Once the bitcoin ETF is approved, the XRP ETF will follow suit, pushing the price to $50 per XRP,” Brown said. XRP price drops to $0.6 &#124; Source: XRPUSD on Tradingview.com Featured image from Inside Bitcoins, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-27T19:45:00.000Z",
    "title": "New Artificial Intelligence (AI)-Powered Chatbot Girolamo Launches Beta Phase on Cardano Blockchain",
    "url": "https://dailyhodl.com/2023/11/27/new-artificial-intelligence-ai-powered-chatbot-girolamo-launches-beta-phase-on-cardano-blockchain/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/as-ADA-Opens-2023.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/as-ADA-Opens-2023.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/as-ADA-Opens-2023.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/as-ADA-Opens-2023.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/as-ADA-Opens-2023.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/as-ADA-Opens-2023.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/as-ADA-Opens-2023.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A new alternative to the popular artificial intelligence (AI) chatbot ChatGPT has just been deployed on the Cardano (ADA) blockchain. The team behind the Cardano GPT project, which builds blockchain-focused AI products, says the first internet-enabled generative chatbot called Girolamo is now in the beta phase.  The AI is named after Italian polymath Girolamo Cardano, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/27/new-artificial-intelligence-ai-powered-chatbot-girolamo-launches-beta-phase-on-cardano-blockchain/\">New Artificial Intelligence (AI)-Powered Chatbot Girolamo Launches Beta Phase on Cardano Blockchain</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-27T19:41:16.000Z",
    "title": "Binance CEO Details Prediction, Says Crypto Exchange About To Reinvent Itself With New Corporate Structure: Report",
    "url": "https://dailyhodl.com/2023/11/27/binance-ceo-details-prediction-says-crypto-exchange-about-to-reinvent-itself-with-new-corporate-structure-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/binance-new-storage-bnb.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/binance-new-storage-bnb.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/binance-new-storage-bnb.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/binance-new-storage-bnb.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/binance-new-storage-bnb.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/binance-new-storage-bnb.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/binance-new-storage-bnb.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The new CEO of the world&#8217;s largest crypto exchange by trading volume foresees strength ahead for crypto and his company. Fortune reports that Changpeng Zhao&#8217;s successor at Binace, Richard Teng, says that Binance&#8217;s move towards compliance will pay off in the long term, positioning the company to claim a bigger share of the growing crypto market. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/27/binance-ceo-details-prediction-says-crypto-exchange-about-to-reinvent-itself-with-new-corporate-structure-report/\">Binance CEO Details Prediction, Says Crypto Exchange About To Reinvent Itself With New Corporate Structure: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]