[
  {
    "source": "CoinDesk",
    "date": "2023-10-11T01:52:25.000Z",
    "title": "Protocol Village: Spark Protocol Expands Beyond Ethereum to Gnosis",
    "url": "https://www.coindesk.com/tech/2023/10/09/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the week of Oct. 9-15, with live updates throughout."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-11T02:00:38.000Z",
    "title": "Bitfinex parent company looking to buyback 15M shares at $1.7B valuation",
    "url": "https://cryptoslate.com/bitfinex-parent-company-looking-to-buyback-15m-shares-at-1-7b-valuation/",
    "description": "<p>Hong Kong&#8217;s iFinex Inc., the parent company of cryptocurrency exchange Bitfinex, has proposed a $150 million share buyback, Bloomberg News reported Oct. 10. The move is seen as an effort to consolidate its private operations amidst increasing regulatory oversight in the cryptocurrency industry. Share buyback iFinex, which has shared board members with the well-known stablecoin [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitfinex-parent-company-looking-to-buyback-15m-shares-at-1-7b-valuation/\">Bitfinex parent company looking to buyback 15M shares at $1.7B valuation</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-11T02:00:08.000Z",
    "title": "Billionaire Paul Tudor Jones Sees ‘Most Threatening’ Geopolitical Environment — Warns of China, Russia, Iran",
    "url": "https://news.bitcoin.com/billionaire-paul-tudor-jones-sees-most-threatening-geopolitical-environment-warns-of-china-russia-iran/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/paul-tudor-jones-russia-china-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Billionaire Paul Tudor Jones Sees &#039;Most Threatening&#039; Geopolitical Environment — Warns of China, Russia, Iran\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/paul-tudor-jones-russia-china-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/paul-tudor-jones-russia-china-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/paul-tudor-jones-russia-china-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/paul-tudor-jones-russia-china-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/paul-tudor-jones-russia-china-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/paul-tudor-jones-russia-china-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/paul-tudor-jones-russia-china.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Billionaire investor Paul Tudor Jones has warned of the effects of the geopolitical uncertainty around four nuclear powers, including China, Russia, and Iran. &#8220;It might be the most threatening and challenging geopolitical environment that I&#8217;ve ever seen,&#8221; Jones stressed. &#8220;It is also happening at the same time the United States is in its weakest fiscal [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-11T02:00:11.000Z",
    "title": "Bitcoin Dominates 2023: Surges Past Stocks And Bonds With 63% YTD Growth",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-dominates-2023-surges-past-stocks-and-bonds-with-63-ytd-growth/",
    "description": "Bitcoin (BTC), the world&#8217;s leading cryptocurrency, continues to face challenges in reclaiming the $28,000 level amid rising US treasury yields, a stronger dollar, and geopolitical uncertainties.  However, according to a report by the digital asset research firm Reflexivity, despite these obstacles, Bitcoin remains the standout performer among asset classes in 2023, with an impressive year-to-date (YTD) return of 63.3%.  This exceptional performance has surpassed returns from US large-cap growth stocks (28%), US large-cap stocks (13%), bonds, commodities, and REITs, according to a report from New York-based Bitcoin investment firm NYDIG. ETH/BTC Ratio Reflects Risk Appetite And BTC’s Strength According to the firm&#8217;s latest analysis of the current state of the Bitcoin market, there is a notable importance in monitoring Bitcoin&#8217;s market cap dominance, which measures Bitcoin&#8217;s market capitalization as a percentage of the total crypto market capitalization. Market participants often view this metric as a risk gauge for the broader crypto market. Just as traditional markets experience cycles, with early stages marked by capital concentration in a select few high-quality assets that gradually disperse into riskier assets, the crypto market follows a similar pattern.  Related Reading: Dogecoin Price Faces Crucial Test: Will $0.055 Withstand The Pressure? The cycle commences with capital concentrated in Bitcoin, then dispersion into Ethereum (ETH) and eventually other altcoins. The cycle concludes with capital flooding into high-risk assets, as witnessed in the memecoin frenzy of 2021. The report&#8217;s chart illustrates the rising dominance of Bitcoin, indicating a healthy concentration of capital into the leading asset. Bitcoin&#8217;s sustained dominance suggests that the crypto market is stable, with significant capital still flowing into Bitcoin.  Alongside monitoring Bitcoin dominance, another key indicator of risk-taking behavior in the crypto market is the ETH/BTC ratio, which compares Bitcoin&#8217;s performance to Ethereum, the second-largest cryptocurrency by market capitalization.  The chart demonstrates a downward trend in the ETH/BTC ratio since the Merge in September 2022, which, according to the report, both Bitcoin dominance and the ETH/BTC ratio will be crucial to watch for any potential shift from a Bitcoin-dominated market regime into higher-risk assets.  Bitcoin Eyes Bullish Momentum After a two-month consolidation period between the $26,000 and $27,000 range, BTC finally experienced a surge of bullish momentum, breaking the pattern and climbing to the upside.  However, the cryptocurrency&#8217;s upward trajectory was halted as it encountered a formidable resistance wall in the mid-term, reaching $28,600 on October 2nd and facing a significant hurdle at $28,700.  This resistance level poses one of the final challenges preventing BTC from revisiting the $30,000 mark, last seen in August. Related Reading: Cardano (ADA) Struggles To Stay Above $0.26: What This Means For Traders Despite the setback, Bitcoin currently trades above its crucial 50-day and 200-day moving averages (MAs), indicating the potential for another attempt to breach previously lost levels.  Market analysts and enthusiasts are closely watching the $27,700 mark, as a successful break could signal the formation of a perfect &#8216;W&#8217; pattern, with a target set at $28,100.  On this matter, renowned crypto YouTuber and founder of Crypto Sea, known as &#8216;Crypto Rover,&#8217; highlights the significance of the $27,700 level as a potential catalyst for Bitcoin&#8217;s next move.  According to the analyst’s latest post on X (formerly Twitter), a successful breakthrough could reignite bullish sentiment and pave the way for a push toward the $28,100 target. BTC is trading at $27,300, experiencing a modest decline of 0.6% over the past 24 hours. However, the cryptocurrency has recorded notable gains of 4.4% and 6% over fourteen and thirty days, respectively. Featured image from Shutterstock, chart from TradingView.com "
  }
]