[
  {
    "source": "Decrypt",
    "date": "2023-06-12T12:01:20.000Z",
    "title": "Bitcoin ‘Antifragile’ to Regulatory Pressures: Blockstream CEO Adam Back",
    "url": "https://decrypt.co/144193/bitcoin-antifragile-to-regulatory-pressures-blockstream-ceo-adam-back",
    "description": "The Blockstream co-founder told Decrypt that the U.S. crypto crackdown won’t have far-reaching consequences for Bitcoin traders."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-12T11:41:03.000Z",
    "title": "Bitcoin to fight against European challenges — Northern Lightning founder",
    "url": "https://cointelegraph.com/news/bitcoin-prague-interview-northern-lightning",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/dff7f352-7751-4115-983d-e391d812469e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Bitcoin community continues to develop tools and services that could be helpful as Europe grapples with conflict, migration and government overreach.</p>\n                    <p><p>The Bitcoin (<a href=\"https://cointelegraph.com/tags/bitcoin\">BTC</a>) community in Europe continues to be a voice to combat vexing social problems affecting the continent, according to podcast host Eric Dale.</p><p>The CEO of Northern Lightning conferences, which hosts a number of Bitcoin events across Europe, believes the continent’s Bitcoin community is fostering ideals that will be crucial to address ongoing conflict situations and social issues.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/dc36d35d-e357-44ff-b44c-f77b46778851.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Cointelegraph’s Joe Hall alongside Northern Lightning founder Eric Dale at BTC Prague.</em></figcaption></figure><p>Speaking to Cointelegraph journalist Joe Hall during BTC Prague in Czech Republic, Dale highlighted Bitcoin’s unique position to combat social and economic injustice in Europe given the plethora of startups and companies building various tools for the preeminent cryptocurrency:</p><blockquote>“Europe is a continent that faces challenges of war, of migration, of government overreach and a lot of people see Bitcoin as a way to get out of Europe, as a form of exit and I'm here to say that Bitcoin is also a voice.”</blockquote><p>Dale believes that the wider Bitcoin community across Europe is building an ‘ecosystem of ideas’ that could influence the continent’s development into the future. </p><p><a href=\"https://cointelegraph.com/news/how-bitcoin-can-help-secure-proof-of-stake-blockchain-protocols\"><strong><em>Related: How Bitcoin can help secure proof-of-stake blockchain protocols</em></strong></a></p><p>War remains a concern for the host of the ‘Bitcoin for Breakfast’ as the Ukrainian-Russian conflict wages on. While nation states battle against each other, Bitcoin proponents also face an uphill battle in their campaign for adoption of decentralized financial tools:</p><blockquote>“I don’t think the battle for decentralization with Bitcoin will be any different. I think there will be parallels to it, we can probably look at the reformation and the very shaky compromises which led to religious wars and civil strife.”</blockquote><p>Dale hopes to see Bitcoin become part of a new-age, peaceful monetary revolution, taking inspiration from the Czech Republic’s fight against Nazism and communism in the past.</p><blockquote>“It was a velvet revolution here in Prague that showed us just how peacefully we can throw off a seemingly entrenched and corrupt system like fiat or communism.”</blockquote><p>Regulation of the cryptocurrency space has been a <a href=\"https://cointelegraph.com/news/3-takeaways-from-the-european-union-s-mica-regulations\">major talking point across Europe</a> over the past two years as the European Union took steps to develop a comprehensive framework for the industry.</p><p>The Markets in Crypto-Assets (<a href=\"https://cointelegraph.com/tags/mica\">MiCA</a>) bill is <a href=\"https://cointelegraph.com/news/eu-mica-crypto-legislation-added-to-official-journal\">set to come into effect in 2024</a>, introducing a host of requirements for cryptocurrency exchanges and ecosystem participants to operate, trade and make use of cryptocurrencies on the continent. </p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-12T11:49:26.000Z",
    "title": "Polygon leads top 10 following weekend crash: CryptoSlate wMarket update",
    "url": "https://cryptoslate.com/polygon-leads-top-10-following-weekend-crash-cryptoslate-wmarket-update/",
    "description": "<p>Since last Friday&#8217;s wMarket report, the cryptocurrency market saw outflows of $49.5 billion and currently stands at $1.06 trillion — down 4.5% from $1.11 trillion. Over the weekend, the market caps of Bitcoin (BTC) and Ethereum (ETH) fell 2.3% and 5.1% to $503.59 billion and $210.04 billion, respectively. Over the last 24 hours, the top [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/polygon-leads-top-10-following-weekend-crash-cryptoslate-wmarket-update/\">Polygon leads top 10 following weekend crash: CryptoSlate wMarket update</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T12:07:10.000Z",
    "title": "Gensyn AI raises $43 million in Series A funding led by a16z to revolutionize decentralized machine learning",
    "url": "https://www.cryptopolitan.com/gensyn-ai-raises-43-million-in-series-a-funding-led-by-a16z/",
    "description": "Gensyn AI, a UK-based company, has secured $43 million in a Series A funding round led by venture capital giant a16z. The company aims to democratize artificial intelligence (AI) by leveraging decentralized technology and providing developers with a pay-as-you-go model for creating AI tools. Gensyn AI&#8217;s decentralized machine learning compute protocol Founded in 2020 by ... <a title=\"Gensyn AI raises $43 million in Series A funding led by a16z to revolutionize decentralized machine learning\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gensyn-ai-raises-43-million-in-series-a-funding-led-by-a16z/\" aria-label=\"More on Gensyn AI raises $43 million in Series A funding led by a16z to revolutionize decentralized machine learning\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T11:43:08.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 BREAKING: Twitter to enable #crypto trading in partnership with eToro. Users searching using a $Cashtag symbol currently see live charts for a select few financial assets, like $LTC. Users will soon be able to click through to eToro &#38; have the option to invest in #Litecoin. Is Litecoin silver to Bitcoin&#8217;s ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T12:00:00.000Z",
    "title": "DigiToads gains traction as leading meme coin, following in dogecoin’s footsteps",
    "url": "https://crypto.news/digitoads-gains-traction-as-leading-meme-coin-following-in-dogecoins-footsteps/",
    "description": "DigiToads is following the footsteps of Dogecoin and can take over as the leader of meme coins. TOADS presale is ongoing"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-12T11:42:22.000Z",
    "title": "Bitcoin Bearish Signal: Miners Sell At 3rd Largest Scale Ever",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bearish-signal-miners-sell-3rd-largest-scale-ever/",
    "description": "On-chain data shows that Bitcoin miners may have been selling at a historical rate recently, something that could be bearish for the asset&#8217;s price. Bitcoin Miner Inflow To Exchanges Has Registered A Spike Recently According to data from the on-chain analytics firm Glassnode, miner exchange inflows hit a peak value of $70 million recently. The &#8220;miner inflow to exchanges&#8221; is an indicator that measures the total amount of Bitcoin that miners are transferring to the wallets of all centralized exchanges. When the value of this metric is high, it means the miners are sending a large number of coins to these platforms currently. Generally, these chain validators deposit their BTC to exchanges for selling-related purposes, so this kind of trend can have a bearish effect on the value of the cryptocurrency. On the other hand, low values suggest the selling pressure coming from the miners may be low right now, as this cohort isn&#8217;t depositing any significant amounts to exchanges at the moment. Related Reading: Tether (USDT) Sharks &#38; Whales Rapidly Accumulate, Why This Is Bullish For Bitcoin Now, here is a chart that shows the trend in the Bitcoin miner inflow to exchanges over the last few years: The value of the metric seems to have been quite high in recent days &#124; Source: Glassnode on Twitter As displayed in the above graph, the Bitcoin miner inflow to exchanges has observed a spike in its value recently. This suggests that miners have been sending rather large amounts to these platforms during the past couple of weeks. Related Reading: Here’s How Current Bitcoin Capitulation Compares With Past Crashes These high values of the indicator have come as the cryptocurrency has been gradually heading downwards. This may imply that the recent market environment has made some of the miners panic sell their holdings. Since these inflows have become elevated, the asset&#8217;s value has only extended its decline further, as it has now dropped below the $26,000 level. This recent decline in the price may be fueled in part by the dumping being done by this cohort. From the chart, it&#8217;s visible that the peak of these inflows observed on 3rd June saw the indicator reach a value of around $70.8 million. This is a historically extraordinary level for the metric as only two trading days in the entire lifetime of the coin have seen the miners depositing at a larger scale. Both of the instances where miners sent larger amounts to these platforms took place way back during early 2021, when the bull market was in full flow. The peak inflow spike back then (that is, the largest value the metric has ever recorded) measured to about $101 million, implying that the current surge is about $30.2 million away from it. Naturally, Bitcoin miners selling at such a high rate recently can be bad news for the market. It now remains to be seen whether these chain validators continue to sell more in the near future, or if they are done with their dumping spree for now. BTC Price At the time of writing, Bitcoin is trading around $25,900, down 3% in the last week. BTC looks to have declined in the past few days &#124; Source: BTCUSD on TradingView Featured image from Brian Wangenheim on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T11:40:28.000Z",
    "title": "Shiba Inu Price Analysis, Tradecurve Price Action Indicates This Coin Is A Better Bet",
    "url": "https://www.crypto-news-flash.com/shiba-inu-price-analysis-tradecurve-price-action-indicates-this-coin-is-a-better-bet/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-price-analysis-tradecurve-price-action-indicates-this-coin-is-a-better-bet",
    "description": "Shiba Inu has been one of the biggest meme-inspired digital currencies, challenging Dogecoin since its inception. However, the emergence of new meme coins like PEPE has posed a threat to the progress of Shiba Inu. Meanwhile, market analysis shows that Shiba Inu is under short-term selling pressure, but could that change in the long run? [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-12T11:59:17.000Z",
    "title": "Justin Sun’s $20M Transfer To Binance Turns Heads Amid BNB Crash",
    "url": "https://coinedition.com/justin-suns-20m-transfer-to-binance-turns-heads-amid-bnb-crash/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Justin_Sun_withdrew_20M_USDT_from_Aave_and_deposited_20M_USDT-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Justin_Sun_withdrew_20M_USDT_from_Aave_and_deposited_20M_USDT-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Justin_Sun_withdrew_20M_USDT_from_Aave_and_deposited_20M_USDT-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Justin_Sun_withdrew_20M_USDT_from_Aave_and_deposited_20M_USDT.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The crypto market experienced a sudden surge of activity as Justin Sun, the well-known founder of TRON (TRX), made a significant USDT transfer to Binance against the backdrop of a 22% decline in Binance Coin (BNB) over the past week. Sun’s move to withdraw 20 million USDT from Aave and deposit the exact amount into [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/justin-suns-20m-transfer-to-binance-turns-heads-amid-bnb-crash/\">Justin Sun’s $20M Transfer To Binance Turns Heads Amid BNB Crash</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-12T11:45:10.000Z",
    "title": "Billionaire Chamath Palihapitiya Says SEC Covering Its Faults in Regulator’s Current Assault on Crypto Firms",
    "url": "https://dailyhodl.com/2023/06/12/billionaire-chamath-palihapitiya-says-sec-covering-its-faults-in-regulators-current-assault-on-crypto-firms/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/sec-double-cyber.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/sec-double-cyber.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/sec-double-cyber.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/sec-double-cyber.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/sec-double-cyber.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/sec-double-cyber.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/sec-double-cyber.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Billionaire Chamath Palihapitiya says that the U.S. Securities and Exchange Commission’s (SEC) recent enforcement actions against the crypto industry are an attempt to cover its previous mistakes. In a new episode of the All-In Podcast, the business magnate says that the SEC&#8217;s latest assault on the crypto industry is partly because the regulator failed to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/12/billionaire-chamath-palihapitiya-says-sec-covering-its-faults-in-regulators-current-assault-on-crypto-firms/\">Billionaire Chamath Palihapitiya Says SEC Covering Its Faults in Regulator’s Current Assault on Crypto Firms</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]