[
  {
    "source": "CryptoSlate",
    "date": "2023-08-30T04:00:18.000Z",
    "title": "Surges in market volatility pinned to autumn months",
    "url": "https://cryptoslate.com/insights/surges-in-market-volatility-pinned-to-autumn-months/",
    "description": "<p>Quick Take An analysis of the CBOE Volatility Index (VIX), a critical market indicator often used to measure the market&#8217;s expectation of future volatility, reveals intriguing patterns. The evaluation of average daily change in the VIX from 1990 to 2023 indicates a propensity for the index to dip markedly on Fridays, with Tuesdays trailing. This [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/surges-in-market-volatility-pinned-to-autumn-months/\">Surges in market volatility pinned to autumn months</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-30T04:02:26.000Z",
    "title": "Dogecoin Price (DOGE) Holds Strong – Why Bulls Could Aim Rally To $0.078",
    "url": "https://www.newsbtc.com/analysis/doge/dogecoin-price-doge-strong-0-078/",
    "description": "Dogecoin is showing positive signs above the $0.0642 level against the US Dollar. DOGE could continue to rise if it stays above the $0.0606 support. DOGE started a decent increase above the $0.0642 resistance against the US dollar. The price is trading above the $0.065 level and the 100 simple moving average (4 hours). There was a break above a key bearish trend line with resistance near $0.0630 on the 4-hour chart of the DOGE/USD pair (data source from Kraken). The price could correct lower, but dips might be attractive near the $0.062 zone. Dogecoin Price Starts Recovery After a major decline, Dogecoin price found support near the $0.055 zone. DOGE traded as low as $0.0557 and started a fresh increase. There was a decent move above $0.0600 and the price settled above $0.0606. Recently, there was a strong increase in Dogecoin like Bitcoin and Ethereum, and it was able to clear the $0.0620 resistance. The price climbed above the 50% Fib retracement level of the main decline from the $0.0772 swing high to the $0.0557 low. Besides, there was a break above a key bearish trend line with resistance near $0.0630 on the 4-hour chart of the DOGE/USD pair. It is now trading above the $0.065 level and the 100 simple moving average (4 hours). On the upside, the price is facing resistance near the $0.0665 level. The first major resistance is near the $0.0690 level or the 61.8% Fib retracement level of the main decline from the $0.0772 swing high to the $0.0557 low. &#160; Source: DOGEUSD on TradingView.com A close above the $0.0690 resistance might send the price toward the $0.0725 resistance. The next major resistance is near $0.0780. Any more gains might send the price toward the $0.080 level. Are Dips Supported in DOGE? If DOGE fails to gain pace above the $0.0690 level, it could start a downside correction. Initial support on the downside is near the $0.0642 level. The next major support is near the $0.0606 level. If there is a downside break below the $0.0606 support, the price could decline further. In the stated case, the price might decline toward the $0.055 level. Technical Indicators 4 Hours MACD – The MACD for DOGE/USD is now gaining momentum in the bullish zone. 4 Hours RSI (Relative Strength Index) – The RSI for DOGE/USD is now above the 50 level. Major Support Levels – $0.0642, $0.0625, and $0.0606. Major Resistance Levels – $0.0665, $0.0690, and $0.075."
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-30T03:40:58.000Z",
    "title": "Crypto VC Activity Drops in Q2 2023 – What Does This Mean for the Industry",
    "url": "https://dailyhodl.com/2023/08/29/crypto-vc-activity-drops-in-q2-2023-what-does-this-mean-for-the-industry/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Demonstrate-Awareness-of-Crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Demonstrate-Awareness-of-Crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Demonstrate-Awareness-of-Crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Demonstrate-Awareness-of-Crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Demonstrate-Awareness-of-Crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Demonstrate-Awareness-of-Crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Demonstrate-Awareness-of-Crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>In the second quarter of 2023, crypto investment activity decreased to its lowest level since the fourth quarter of 2020. According to PitchBook&#8217;s latest report, global venture capital investments in crypto companies have dropped by 14.7% in terms of deal value and 16.3% in terms of the number of deals completed. This marks the fifth [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/29/crypto-vc-activity-drops-in-q2-2023-what-does-this-mean-for-the-industry/\">Crypto VC Activity Drops in Q2 2023 – What Does This Mean for the Industry</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]