[
  {
    "source": "Bitcoin.com",
    "date": "2023-07-08T05:30:40.000Z",
    "title": "New York Federal Reserve and US Banks Complete Programmable Dollar CBDC Test",
    "url": "https://news.bitcoin.com/new-york-federal-reserve-and-us-banks-complete-programmable-dollar-cbdc-test/",
    "description": "<img width=\"768\" height=\"576\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1670957740-768x576.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"New York Federal Reserve and US Banks Complete Programmable Dollar CBDC Test\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1670957740-300x225.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1670957740-1024x768.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1670957740-768x576.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1670957740-1536x1152.jpg 1536w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1670957740-2048x1536.jpg 2048w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The New York Federal Reserve and a group of financial institutions announced the successful conclusion of a proof-of-concept of the Regulated Liability Network (RLN), which contemplates the introduction of a dollar-based interbank central bank digital currency (CBDC). The test concluded that, using the RLN, the proposed CBDC might allow for near real-time dollar payments and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-08T05:24:07.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-08T05:10:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-08T05:34:03.000Z",
    "title": "XRP Next Step: Here’s Why An Upward Move Could Be Likely",
    "url": "https://www.newsbtc.com/news/xrp-next-step-heres-why-an-upward-move-could-be-likely/",
    "description": "XRP&#8217;s price performance has been underwhelming recently, with a notable decline from its previous highs. Regulatory uncertainties surrounding Ripple Labs, the company behind XRP, have played a significant role in dampening investor sentiment.  The ongoing legal battle between Ripple and the US Securities and Exchange Commission (SEC) regarding the classification of XRP as a security has raised concerns about the asset&#8217;s long-term viability. However, despite these challenges, there are reasons to remain cautiously optimistic about XRP&#8217;s future. Related Reading: Recent 800 Billion Shiba Inu Dump Has Short Traders Worried – Here’s Why XRP Shows Potential For A Reversal Despite Recent Declines XRP, currently priced at $0.467053 according to CoinGecko, has experienced a marginal decline of 0.5% over the past 24 hours and a slight drop of 0.3% over the past seven days. However, despite dropping toward the $0.46 level, which serves as the lower border of a descending price channel, there are indications that a likely upward shift may be on the horizon. Up until a breakout to the upper border, which denotes a potential trend reversal, descending price channels are often bearish patterns. In line with this downward trend, XRP has been trading at regularly lower highs and lows. The currency is currently experiencing a significant decline in its value, and it is approaching the lower limit of a trading channel. This decline has created an environment that holds the potential for a potential recovery to take place. When a currency approaches the bottom border of a trading channel, it suggests that it has reached a support level, a point at which there is increased demand for the currency, which could lead to a reversal in its downward trend. XRP market cap currently at $24.3 billion. Chart: TradingView.com According to an XRP price report, when a cryptocurrency reaches the lower border of a descending channel, it often signifies a critical juncture where buying pressure may overcome selling pressure, leading to a reversal in the price direction. While past performance is not indicative of future results, this development suggests that XRP may be poised for an upward movement in the foreseeable future. Ripple Labs&#8217; UBRI Thrives With Global Expansion Meanwhile, Ripple has achieved significant milestones in its University Blockchain Research Initiative (UBRI), a key operational initiative. With a philanthropic commitment of $50 million, the program has successfully onboarded 50 partners from various sectors, Ripple announced on Twitter. 1/ In 2018, Ripple’s UBRI program launched with a $50M philanthropic commitment to leading universities around the world to support academic research, technical development, and innovation in blockchain and crypto. https://t.co/B1DBYNiSdV — Ripple (@Ripple) July 7, 2023 The UBRI program, focused on academic research related to blockchain technology, has made remarkable progress. It has awarded 590 fellowships and scholarships, providing support to aspiring researchers and students. Additionally, the initiative has played a vital role in facilitating the publication of over 1,000 research articles and presentations, contributing to the advancement of knowledge in the field. Related Reading: Compound (COMP) Token Rallies Over 100% After CEO Quits – Details The success of the UBRI program is further highlighted by its global reach, as it is now active on six continents across the world.  (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  }
]