[
  {
    "source": "CryptoSlate",
    "date": "2023-06-08T23:48:58.000Z",
    "title": "Exodus sees Q1 revenue drop to $13M but reports high customer loyalty",
    "url": "https://cryptoslate.com/exodus-sees-q1-revenue-drop-to-13m-but-reports-high-customer-loyalty/",
    "description": "<p>Crypto wallet company Exodus published its Q1 report on June 8, reporting over $13 million in revenue and its active users remained largely consistent and only saw a small decline. Exodus Movement Inc. said it saw $13.3 million in revenue in Q1 2023. That amount represents a 13% decrease from Q1 2022 when it saw [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/exodus-sees-q1-revenue-drop-to-13m-but-reports-high-customer-loyalty/\">Exodus sees Q1 revenue drop to $13M but reports high customer loyalty</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-09T00:00:14.000Z",
    "title": "Coinbase CEO Faces Allegations Of Insider Trading In $1.7 Million Stock Sale",
    "url": "https://www.newsbtc.com/coinbase/coinbase-ceo-faces-allegations-of-insider-trading-in-1-7-million-stock-sale/",
    "description": "The recent allegations of insider trading against Coinbase CEO Brian Armstrong have raised concerns among investors and industry experts. Armstrong sold nearly 30,000 shares of his company worth over $1.7 million just two days before the Securities and Exchange Commission (SEC) initiated enforcement action against Coinbase. Related Reading: Stablecoin Market Cap Decreases, But Whales Remain Unfazed: Santiment Coinbase Investors Question CEO&#8217;s Stock Sale Prior SEC Complaint Coinbase CEO Brian Armstrong has come under scrutiny after selling a massive 29,730 shares of his company&#8217;s Class A Common Stock on June 5, 2023, according to a Form 4 filed with the Securities and Exchange Commission. Armstrong made the sale in eight separate transactions, all on the same date, at an average price of $60.3 per share. This netted him over $1.7 million in total. There is speculation that Armstrong&#8217;s stock sale was a pre-planned transaction, made before Coinbase&#8217;s stock plummeted from $63 per share to $44, a considerable decline of 30%. This has raised concerns among investors about the possibility of insider trading or a planned stock sale by the company&#8217;s executives. However, executives at publicly traded companies like Coinbase since 2021, are often required to follow strict rules about when and how they can trade their company&#8217;s stocks.  They are typically required to set up a trading plan, which allows them to schedule sales of their stocks well in advance, at times when they do not possess insider information. The plan&#8217;s details, including how many shares to sell and when must be pre-determined and followed exactly. If Armstrong&#8217;s sale was made according to his plan, the timing of the sale just a day before the SEC lawsuit was made public would be a coincidence. However, some investors are still concerned about the optics of the sale and the possibility of insider trading. Nevertheless, companies are typically bound by disclosure rules that require them to inform the public of significant events as soon as possible. The announcement of the SEC lawsuit likely followed these rules, and it&#8217;s possible that the news coincided with Armstrong&#8217;s pre-scheduled stock sale. Ripple&#8217;s SEC Case Could Have Far-Reaching Implications For The Exchanges The ongoing SEC v. Ripple case has significant implications for the cryptocurrency industry, particularly for companies like Coinbase and Binance. According to crypto-friendly lawyer James Murphy, a ruling in favor of Ripple by Judge Torres could undermine the SEC&#8217;s case against Coinbase and Binance. Murphy believes that if Judge Torres rules that XRP tokens traded on secondary markets are not securities, it would weaken the SEC&#8217;s argument that Coinbase is operating an unregistered securities exchange, broker-dealer, and clearing broker. The SEC claims that 13 tokens traded on Coinbase are securities, but if those tokens are ruled not to be securities, the SEC&#8217;s case would fall apart. While a ruling by Judge Torres would not be binding precedent in other cases, Judge Rearden, who is presiding over the Coinbase case, is a new judge and works in the same court in lower Manhattan with Judge Torres.  Murphy believes that Judge Rearden will pay close attention to Judge Torres&#8217; legal reasoning in ruling whether $XRP is a security, and could follow that reasoning when analyzing whether the 13 tokens cited in the Coinbase complaint are securities. Related Reading: Bitcoin Bearish Signal: Dormant 1,433 BTC Moves After 10+ Years However, if Judge Torres rules that $XRP tokens are securities, the SEC could use that decision to argue that the judges presiding over the Coinbase and Binance cases should follow Judge Torres&#8217; reasoning. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-09T00:04:53.000Z",
    "title": "Collapse of US Dollar Dominance Will Be Accelerated by ‘Irresponsible’ Debt Ceiling Deal: Ron Paul",
    "url": "https://dailyhodl.com/2023/06/08/collapse-of-us-dollar-dominance-will-be-accelerated-by-irresponsible-debt-ceiling-deal-ron-paul/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Global-Reserve-Currency-Status.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Global-Reserve-Currency-Status.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Global-Reserve-Currency-Status.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Global-Reserve-Currency-Status.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Global-Reserve-Currency-Status.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Global-Reserve-Currency-Status.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Global-Reserve-Currency-Status.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>America&#8217;s &#8220;Fiscal Responsibility Act&#8221; will hasten a collapse of the US dollar and force Americans to take the brunt of its fallout, according to former Congressman Ron Paul. In a new statement, Paul says that the deal, which suspends the US government&#8217;s debt ceiling for two years, will be felt by regular citizens in the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/08/collapse-of-us-dollar-dominance-will-be-accelerated-by-irresponsible-debt-ceiling-deal-ron-paul/\">Collapse of US Dollar Dominance Will Be Accelerated by ‘Irresponsible’ Debt Ceiling Deal: Ron Paul</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]