[
  {
    "source": "CoinDesk",
    "date": "2024-02-15T20:20:48.000Z",
    "title": "U.S. Federal Reserve Gov. Waller Says DeFi Could Boost Dollar's Global Strength",
    "url": "https://www.coindesk.com/policy/2024/02/15/us-federal-reserve-gov-waller-says-defi-could-boost-dollars-global-strength/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto critics often warn of digital currencies' potential to destabilize the U.S. dollar, but Federal Reserve Gov. Christopher Waller argued that stablecoins' dependence on the dollar could actually strengthen the U.S. fiat currency as decentralized finance (DeFi) catches on."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-15T20:25:42.000Z",
    "title": "Judge Dismisses Most Authors' Claims in AI Copyright Suit",
    "url": "https://decrypt.co/217728/judge-dismisses-most-authors-claims-in-ai-copyright-suit",
    "description": "While the case will still move forward, the federal court ruling is a setback for authors like Sarah Silverman, who were dinged for failing to provide sufficient evidence."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-15T20:32:21.000Z",
    "title": "Satoshi Nakamoto honored with US flag ceremony by anti-crypto Senator Warren",
    "url": "https://cryptobriefing.com/satoshi-nakamoto-honored-us-capitol-flag-ceremony-anti-crypto-senator-warren/?utm_source=feed&utm_medium=rss",
    "description": "Anti-crypto Senator Warren surprises industry by signing certificate honoring Bitcoin creator Satoshi Nakamoto with US Capitol flag ceremony."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-15T20:15:33.000Z",
    "title": "AI-Powered Gaming Platform Ultiverse raised $4 Million at $150 Million Valuation",
    "url": "https://cryptodaily.co.uk/2024/02/ai-powered-gaming-platform-ultiverse-raised-4-million-at-150-million-valuation",
    "description": "AI-Powered Gaming Platform Ultiverse raised $4 Million at $150 Million Valuation"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-15T20:30:28.000Z",
    "title": "First Lunar New Year Verse Scratcher Jackpots Hits for 8,888,888 VERSE",
    "url": "https://news.bitcoin.com/first-lunar-new-year-verse-scratcher-jackpots-hits-for-8888888-verse/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/lny_scratcher_1-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin.com Verse Team Celebrates First Jackpot Winner in Lunar New Year Scratcher Event\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/lny_scratcher_1-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/lny_scratcher_1-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/lny_scratcher_1-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/lny_scratcher_1-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/lny_scratcher_1-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/lny_scratcher_1-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/lny_scratcher_1.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Fortune smiled upon a lucky winner this Lunar New Year as the Bitcoin.com Verse Team announced a major jackpot hit on their decentralized app, the Lunar New Year Scratcher. With every ticket offering an equal shot at the jackpot, participants are encouraged to continue playing until Mar. 1 for their chance at fortune and glory [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-15T20:30:08.000Z",
    "title": "Developer Explains Why Meme Coins Are Shifting Base From Ethereum",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-meme-coins-are-shifting-base/",
    "description": "Foobar, a code builder, criticizes Ethereum, accusing its developers of neglecting crucial improvements. Because of this shift, projects, including meme coin issuers, are adopting alternative protocols, including layer-2s and modern blockchains like Solana, which boast more features, mostly higher scalability.  Ethereum Developers Are Blocking Mainnet Updates Taking to X, the developer claims that there have been no major mainnet improvements chiefly because such upgrades are being blocked by core and client developers. Specifically, Foobar cites the long-standing delays for features like Trie State Storage Optimizations (TSTORE) and Externally Owned Account (EOA) batch transactions. The developer also noted the lack of block gas limit increase since 2021.  Related Reading: Bitcoin ETF Surges: Last 4 Days Inflows Outpace Initial Weeks The developer adds that the absence of main net updates and opcode improvements leading to the implementation of these proposals could be why decentralized apps (apps) launching on Ethereum are &#8220;bleeding tremendous value&#8221; due to high fees and limitations. TSTORE and EOA batch transactions are proposals that, if they see the light of day, could see Ethereum scale better. Specifically, proposers of TSTORE forwarded a solution to address storage bloat to improve performance. On the other hand, EOA will enable the bundling of transactions from the same sender, reducing gas fees.  Meanwhile, Etherscan data shows that the block gas limit has been capped at around 30 million since August 9, 2021. Subsequently, Ethereum throughput remains low, and gas fees are higher, considering the high on-chain activity. The failure of clients to integrate these proposals, the developer continues, makes Ethereum unusable for &#8220;any interesting app requiring moderate complexity.&#8221; Subsequently, many projects are migrating to layer-2s like Base, Arbitrum, Optimism, or entirely different blockchains like Solana and Avalanche due to limitations on the Ethereum mainnet. Meme Coins Find Home In Solana And Others As of mid-February 2024, more meme coin developers, reading from the popularity of emerging projects, are deploying from high throughput and low-fee platforms like Solana, Avalanche, and even Base. Meme coins like Bonk, Honk, and even the successful Bald on Base are examples. Meanwhile, meme coin projects on Ethereum, like Pepe Coin (PEPE), appear to be losing market share as Shiba Inu, for example, launched Shibarium to offer its users lower transaction fees. Related Reading: Stacks (STX) Stuns: Price Soars Over 60% In Epic Recovery As TVL Explodes Foobar thinks the lack of improvements on the Ethereum mainnet is why Uniswap v4 has yet to launch. The new iteration of Uniswap, a popular decentralized exchange (DEX) powering Ethereum token swapping, is yet to release its latest version. Based on existing documentation, v4 will include new features and functionalities, including Hooks. Supporters claim this tool will make the DEX more flexible, drawing more users once it goes live.  Feature image from Shutterstock, chart from TradingView"
  }
]