[
  {
    "source": "Decrypt",
    "date": "2023-09-21T00:55:02.000Z",
    "title": "Brain Implant Testing: Neuralink Begins Recruiting for Human Thought-Reading Trials",
    "url": "https://decrypt.co/198110/neuralink-brain-implant-chip-human-testing-fda",
    "description": "Neuralink is ready to take things to the inevitable next level, testing its brain-reading chip in humans."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-21T01:00:00.000Z",
    "title": "Crypto Investment Products See $54 Million Outflows, but $SOL, $XRP, and $ADA Shine",
    "url": "https://www.cryptoglobe.com/latest/2023/09/crypto-investment-products-see-54-million-outflows-but-sol-xrp-and-ada-shine/",
    "description": "Cryptocurrency investment products focusing on three major altcoins, Solana ($SOL), $XRP, and Cardano ($ADA) bucked a bearish trend last week amid outflows of over $54 million for digital asset investment products, with $BTC investment products seeing $45.3 million of outflows. According to CoinShares’ Digital Asset Fund Flows Weekly report, over the last nine weeks eighth […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T01:00:11.000Z",
    "title": "GMO Media to Launch a Verse on Oasys with three initial titles announced for December",
    "url": "https://www.cryptopolitan.com/gmo-media-to-launch-a-verse-on-oasys-with-three-initial-titles-announced-for-december/",
    "description": "Singapore, Singapore, September 21st, 2023, Chainwire Oasys, a game-focused blockchain, is pleased to announce a collaboration with GMO Media, a subsidiary of Japanese internet giant GMO Internet Group, to introduce &#8220;GESOTEN Verse&#8221; (tentative name) on Oasys. As part of the collaboration, three titles have been confirmed for release in December 2023, in conjunction with the ... <a title=\"GMO Media to Launch a Verse on Oasys with three initial titles announced for December\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gmo-media-to-launch-a-verse-on-oasys-with-three-initial-titles-announced-for-december/\" aria-label=\"More on GMO Media to Launch a Verse on Oasys with three initial titles announced for December\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T00:58:17.000Z",
    "title": "U.S. politics clash: Dems push for CBDC reign, GOP fears risks",
    "url": "https://www.cryptopolitan.com/us-dems-push-for-cbdc-reign-gop-fears-risks/",
    "description": "The showdown on Capitol Hill over the future of digital currency in the U.S. has taken an intense turn. On one side, the Democrats argue that Central Bank Digital Currencies (CBDCs) could bolster the nation&#8217;s financial leadership. The GOP, however, fears potential infringements on the rights and privacy of Americans. From Star Wars to Financial ... <a title=\"U.S. politics clash: Dems push for CBDC reign, GOP fears risks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-dems-push-for-cbdc-reign-gop-fears-risks/\" aria-label=\"More on U.S. politics clash: Dems push for CBDC reign, GOP fears risks\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T00:48:58.000Z",
    "title": "Goldman Sachs and Apple pull the plug on trading app",
    "url": "https://www.cryptopolitan.com/goldman-sachs-apple-cancel-trading-app/",
    "description": "An anticipated collaborative effort between tech behemoth Apple and financial powerhouse Goldman Sachs on a futures trading application has fizzled out. The venture, initially pegged for a 2022 debut, faced suspension amidst a challenging economic landscape characterized by rising interest rates and burgeoning inflationary pressures, making riskier assets less appealing. A Partnership Marred by Economic ... <a title=\"Goldman Sachs and Apple pull the plug on trading app\" class=\"read-more\" href=\"https://www.cryptopolitan.com/goldman-sachs-apple-cancel-trading-app/\" aria-label=\"More on Goldman Sachs and Apple pull the plug on trading app\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T00:41:10.000Z",
    "title": "Digital euro stumbles? Financial giants spot legislative flaws",
    "url": "https://www.cryptopolitan.com/financial-giants-find-flaws-in-digital-euro/",
    "description": "In the world of financial innovations, the anticipation of a digital euro was met with much fanfare. Yet, as the glitter begins to settle, it seems that the grand European project might be riddled with legislative potholes. The Institute of International Finance (IIF), a prominent financial advocacy group with a global presence, has critically assessed ... <a title=\"Digital euro stumbles? Financial giants spot legislative flaws\" class=\"read-more\" href=\"https://www.cryptopolitan.com/financial-giants-find-flaws-in-digital-euro/\" aria-label=\"More on Digital euro stumbles? Financial giants spot legislative flaws\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-21T01:00:57.000Z",
    "title": "Whales, Fresh Wallets Accumulating, Maker (MKR) Spikes 120% In 3 Months",
    "url": "https://www.newsbtc.com/maker-mkr/whales-fresh-wallets-accumulating-maker-spikes/",
    "description": "On-chain data reveals that whales and new wallets are scooping more Maker (MKR), which seems to be propping the token, fanning demand. As of September, MKR is one of the top-performing tokens, adding roughly 120% in three months from June 2023 lows. When writing, MKR is changing hands above $1,300 and inching closer to July 2023 highs. Notably, MKR is up 14% in the past week of trading, driving market cap above $1.27 billion and trading volume by 36% on the last day. Whales And Fresh Wallets Buying Maker (MKR) Trackers note that in the last week of trading, a whale, “0xad0”, bought 1261 MKR worth $1.62 million at an average price of $1,290. Moreover, looking at the trends, whale and fresh wallet activities have been heightened over the previous week. With more accumulation, the token has been tracking higher in tandem. Parallel data from Lookonchain confirms this development, especially from early September. Earlier this month, a whale sold $1.13 million of Ethereum and bought an equal amount in MKR on Binance. This transaction comes a day after another entity moved $12.3 million of MKR from Binance. However, while whales appear to be loading up more MKR, Vitalik Buterin, the co-founder of Ethereum, sold his stash of MKR for ETH on September 2.  Related Reading: Ethereum Path To $1,700 – Predictions For The Week Ahead Maker Finance is a decentralized lending and borrowing platform on Ethereum. As of September 20, the protocol had a total value locked (TVL) of over $4.8 billion, according to DeFiLlama. More data shows that the platform held $109.56 million of MKR, its native token, and different stablecoins worth $49.58 million.  DAI Yield Rising, New Burning Structure Implemented Fueling Bulls MakerDAO, a decentralized autonomous organization (DAO), manages DAI, an algorithmic stablecoin that passes yield to the holder. Holders of MKR, the native token of Maker, can also vote on proposals. Following the brief USDC depegging in March 2023, the DAO reduced its reliance on the USDC, a centralized fiat-backed stablecoin. In early August, the community also voted to temporarily increase the DAI Savings Rate (DSR) from 3.19% to 8%, incentivizing users to mint DAI via the Spark Protocol.  Related Reading: Bearish Signal? Bitcoin Whale Wakes Up From 6-Year Slumber And Transfers $56 Million Besides changes to the DSR, MakerDAO also introduced an improved smart burn mechanism where collateralized debt positions (CDPs) to back circulating DAI can be closed freely without causing stablecoin shortages in the market. In this new arrangement, circulating MKR would be bought and burned independent of CDP closure, allowing the protocol to be more flexible in light of market changes. However, with this, every burning reduced circulating supply, which has supported prices as price action revealed. Feature image from Canva, chart from TradingView"
  }
]