[
  {
    "source": "CoinDesk",
    "date": "2023-06-23T15:05:41.000Z",
    "title": "Coinbase Wins Supreme Court Ruling in Arbitration Lawsuit",
    "url": "https://www.coindesk.com/policy/2023/06/23/coinbase-wins-supreme-court-ruling-in-arbitration-lawsuit/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto exchange Coinbase won a reprieve from the U.S. Supreme Court on Friday, after the high court ruled that a lawsuit filed by one of the exchange's users couldn't proceed until Coinbase defends an appeal of a lower court ruling."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-23T15:02:22.000Z",
    "title": "Three Quarters of Jurisdictions Not Complying With Global Crypto Laundering Norms, FATF Says",
    "url": "https://www.coindesk.com/policy/2023/06/23/three-quarters-of-jurisdictions-not-complying-with-global-crypto-laundering-norms-fatf-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The global anti-money laundering watchdog FATF said North Korea is using digital assets to fund weapons of mass destruction"
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-23T14:53:11.000Z",
    "title": "Will BlackRock's Bitcoin ETF Take the Spirit Out of the Honey Badger?",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/23/will-blackrocks-bitcoin-etf-take-the-spirit-out-of-the-honey-badger/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Financial advisors will want a simple story to tell."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-23T15:02:59.000Z",
    "title": "Coinbase Wins Supreme Court's Favor in Arbitration Dispute",
    "url": "https://decrypt.co/145924/coinbase-wins-supreme-courts-favor-in-arbitration-dispute",
    "description": "Justices voted 5-4 in the ruling. "
  },
  {
    "source": "Decrypt",
    "date": "2023-06-23T14:51:27.000Z",
    "title": "Spain Gives Crypto.com Green Light to Set Up Shop",
    "url": "https://decrypt.co/145919/spain-gives-crypto-com-green-light-to-operate-with-vasp-registration",
    "description": "The Singapore-based platform will now be able to offer its services in Spain. "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-23T15:00:20.000Z",
    "title": "Crypto.com expands global reach with VASP registration in Spain",
    "url": "https://cryptoslate.com/crypto-com-expands-global-reach-with-vasp-registration-in-spain/",
    "description": "<p>Cryptocurrency exchange Crypto.com said in a June 23 announcement that it received a Virtual Asset Service Provider (VASP) registration from the Bank of Spain, allowing it to offer its products and services to users in the country. The Singapore-based crypto platform stated that it underwent a &#8220;comprehensive review of its compliance with Anti-Money Laundering Directive [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/crypto-com-expands-global-reach-with-vasp-registration-in-spain/\">Crypto.com expands global reach with VASP registration in Spain</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-23T14:45:17.000Z",
    "title": "VeChain pumps 11% on being added to Coinbase’s listing roadmap",
    "url": "https://cryptoslate.com/vechain-pumps-11-on-being-added-to-coinbases-listing-roadmap/",
    "description": "<p>On June 23, the price of VeChain (VET) spiked to a high of $0.01899, marking a 16-day high. Coinbase tweeted on June 22 that it had added VeChain, and its gas token, VeThor, to its new asset listing roadmap.  However, the platform has not yet provided details on when they will be available for trading. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/vechain-pumps-11-on-being-added-to-coinbases-listing-roadmap/\">VeChain pumps 11% on being added to Coinbase&#8217;s listing roadmap</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-23T15:02:33.000Z",
    "title": "Bitcoin Cash (BCH/USD) Price Analysis Report – 23 June 2023",
    "url": "https://www.cryptoglobe.com/latest/2023/06/bitcoin-cash-bch-usd-price-analysis-report-23-june-2023/",
    "description": "Introduction This report provides a comprehensive analysis of Bitcoin Cash (BCH) for 23 June 2023. The data includes real-time price, volume, bid/ask, day’s range, technical indicators, and moving averages. Price and Volume Overview As of 2:32 p.m. UTC on 23 June 2023, on Binance, Bitcoin Cash is trading at $143.10, up by $8.20 (+6.08%) from […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T14:58:20.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 The automatic release of new APT tokens into the open market is valued at over $50 million based on current prices. Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for a decoupling of on-chain and off-chain trading activity. So, it&#8217;s interesting ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T15:00:22.000Z",
    "title": "Bitcoin Cash (BCH) Continues To Rise While Market Sees Correction",
    "url": "https://www.newsbtc.com/news/bitcoin-cash/bitcoin-cash-bch-continues-to-rise-while-market-sees-correction/",
    "description": "Bitcoin Cash (BC) has maintained a positive outlook over the past few days as bulls and bears struggle for control over the broader crypto market. Its growth suggests the bulls currently have the upper hand in the altcoin even while the broader crypto market shows a 0.7% decline. At the time of writing, BCH has added 9.06% to its past-day value changing hands at $143.22. It has also seen a 37.84% gain in seven days and 27.10% in the last 30 days. This bullish momentum allowed the token to secure the top position among the highest-gaining coins in the past 24 hours.  Events Surrounding BCH Price Performance Whether Bitcoin Cash will sustain the upward trajectory remains uncertain since the crypto market is gradually turning bearish. However, the sentiment remains relatively bullish even though the trading volume has declined significantly. Related Reading: Breaking Through This Ceiling Will Propel XRP By Another 12% Right now, institutional interest is still high following the launch of the Wall Street-backed crypto exchange EDX Market. Notably, the exchange listed four tokens, Bitcoin, Ether, Litecoin, and Bitcoin Cash, garnering the attention of crypto investors.  Also, the crypto trading platform derives support from Charles Schwab, a top US-based investment advisor and brokerage firm, Fidelity Investments, and Ken Griffin’s Citadel Securities. The exchange also announced new investors, including DV Crypto, GTS, Miami International Holdings, GSR Markets LTD, and HRT Technology. And participants in the space believe the launch of EDX would facilitate institutional investments in crypto. Bitcoin Cash&#8217;s price rally stems from EDX&#8217;s launch as one of the cryptocurrencies listed on the exchange. The Securities and Exchange Commission&#8217;s view that most Proof-of-Stake network tokens are securities also drew attention to BCH. As such, the token has been rising in the last seven days. As of Thursday, June 22, Bitcoin Cash closed with a 26.54% price gain after opening the day at $136.31. With the continued momentum, the token now trades at $143.22. Also, the hype around BlackRock, WisdomTree, and Invesco’s spot BTC ETF application has influenced Bitcoin Cash’s price action.  It bears mentioning that the approval of these spot ETF applications could facilitate Bitcoin’s legitimacy and boost institutional interest. Bitcoin Cash Analysis Using Technical Oscillators As of the time of analysis, Bitcoin Cash is trading above the Bollinger Bands indicator, which signifies that the asset&#8217;s price has surpassed its usual volatility range. This metric could imply strong upward momentum or a potential breakout.  Traders may view this as a bullish signal, indicating a potential continuation of the upward trend and possibly considering new buying opportunities. Also, the asset&#8217;s Moving Average Convergence Divergence (MACD) is trading above its signal line, with the histogram bars displaying long green candles. Related Reading: Conflux Claims Its Place Among Top Altcoins As CFX Price Skyrockets 46% The position confirms the bullish momentum presented in Bitcoin Cash’s price, indicating a potential uptrend and long positions. The asset currently trades between its primary support and resistance levels of $104.72 and $148.55, respectively. According to the chart, the bulls are strongly pushing the price toward the significant resistance level of $148.55. A potential bullish movement might follow if the price successfully breaks this resistance level. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T14:58:49.000Z",
    "title": "Cardano-Linked SingularityNET Surges 11% Amidst Mixed Buyer Sentiment",
    "url": "https://www.crypto-news-flash.com/cardano-linked-singularitynet-surges-11-amidst-mixed-buyer-sentiment/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-linked-singularitynet-surges-11-amidst-mixed-buyer-sentiment",
    "description": "SingularityNET is leveraging the overall growth in the crypto market, driven by factors such as the increasing market cap and the positive sentiment around AI tokens, as well as the recent upward movement in the Cardano.  At the time of writing, AGIX is worth $0.2566, after an 11% increase in price, in one of its [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-23T14:48:00.000Z",
    "title": "Asian Markets to Benefit From America’s Crypto Shenanigans",
    "url": "https://coinedition.com/asian-markets-to-benefit-from-americas-crypto-shenanigans/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Asian Markets Benefit From America Shenanigans\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Asian-Markets-Benefit-From-America-Shenanigans-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A report from the Straits Times on June 23 mentioned that Asian countries like Hong Kong and Singapore are expected to benefit most from the U.S. scrutiny of the crypto realm. Recent months have shown that the U.S. government isn&#8217;t keen on fostering a thriving digital asset industry and the innovation that comes with it. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/asian-markets-to-benefit-from-americas-crypto-shenanigans/\">Asian Markets to Benefit From America’s Crypto Shenanigans</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]