[
  {
    "source": "CryptoSlate",
    "date": "2023-06-02T15:28:14.000Z",
    "title": "Kakarot zkEVM secures backing from StarkWare, Vitalik Buterin in pre-seed round",
    "url": "https://cryptoslate.com/kakarot-zkevm-secures-backing-from-starkware-vitalik-buterin-in-pre-seed-round/",
    "description": "<p>Kakarot zkEVM, an Ethereum Virtual Machine (EVM) implemented in Cairo, announced on June 2 that it has closed its pre-seed funding round. The investors include Ethereum co-founder Vitalik Buterin, Ledger co-founder and VP of innovation Nicolas Bacca, and blockchain scaling firm Starkware, among others. Cairo is a Turing-complete language associated with the CairoVM — Kakarot [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/kakarot-zkevm-secures-backing-from-starkware-vitalik-buterin-in-pre-seed-round/\">Kakarot zkEVM secures backing from StarkWare, Vitalik Buterin in pre-seed round</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-02T15:30:04.000Z",
    "title": "Biggest Movers: ADA Snaps Losing Streak as Nonfarm Payrolls Beat Expectations",
    "url": "https://news.bitcoin.com/biggest-movers-ada-snaps-losing-streak-as-nonfarm-payrolls-beat-expectations/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2136275843-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2136275843-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2136275843-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2136275843-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2136275843-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2136275843-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2136275843-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2136275843.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Cardano ended a four-day losing streak on Friday, as markets responded to the latest U.S. nonfarm payrolls (NFP) report. Payrolls in May rose to 339,000, which was significantly higher than the expected sum of 190,000. Solana collided with a key resistance level in today&#x2019;s session. Cardano (ADA) Cardano (ADA) was one of Friday&#x2019;s notable gainers, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T15:35:33.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 BREAKING: Twitter to enable #crypto trading in partnership with eToro. Users searching using a $Cashtag symbol currently see live charts for a select few financial assets, like $LTC. Users will soon be able to click through to eToro &#38; have the option to invest in #Litecoin. Is Litecoin silver to Bitcoin&#8217;s ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-02T15:30:51.000Z",
    "title": "No More Crab: Bitcoin Poised For Explosive Move Above $30,000",
    "url": "https://www.newsbtc.com/bitcoin-news/no-more-crab-bitcoin-poised-for-explosive-move-above-30000/",
    "description": "Bitcoin is recording minor profits on higher timeframes but has been unable to display significant price action. In this context, volatility is reaching a record low, but the status quo could suddenly shift in the short term. Related Reading: Galaxy Digital CEO Mike Novogratz Says This Will Kickstart The Bitcoin Bull Market As of this writing, Bitcoin trades at $27,100 with sideways movement in the last 24 hours. In the previous week, BTC recorded a 3% increase, while other assets in the top 10 by market capitalization show similar performance, with XRP and MATIC leading the small uptick. The New And Old Status Quo, Bitcoin’s Path Towards New Highs Per a recent report from the trading desk of QCP Capital, the macroeconomic landscape has become clear as political actors in the U.S. reached a compromise on the Debt ceiling. The narrative around this event was triggering uncertainty in the financial sector. Increased uncertainty contributed to the decline in volatility and the sideways movement across risk-on assets, including Bitcoin. In that sense, QCP Capital claims that BTC is following a trajectory similar to 2020 when uncertainty in the macro scene and the crypto market emerged from a long winter. At that time, the cryptocurrency declined to a critical level and displayed sideways movement throughout the year. As seen in the chart below, Bitcoin has not only behaved as it did in 2020 but trended upwards later that year. QCP Capital expects BTC to perform following this fractal, with a break in the sideways price action coming soon. The trading desk noted: This consolidation has played out perfectly so far, but we expect that we are soon coming close to the end sometime this month. As a result, we recommend positioning for an upcoming big move through long 3m and 6m strangles here, with a bias to the long call side. BTC To Vibe With The Season The decline in volatility has led to a decrease in the price of BTC options. Therefore, QCP Capital believes building a BTC position with a long bias using these financial products could be fruitful. As seen in the chart below, volatility for the 3 months at the money (ATM) options are moving with historical data. Before the summer and until late June, volatility trends lower before recording an explosive move. Related Reading: Litecoin Breaks $95 As Whale Transactions Spike This year, the move is to the upside, according to QCP: Seasonality on the implied vol market over the past 4 years also argue for a sharp June rally before the summer lull (Chart 4). This is in line with macro market seasonalities as traders rush to adjust positions in June before their summer breaks. Cover image from Unsplash, Chart from Tradingview"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-02T15:20:40.000Z",
    "title": "How to Invest in Cryptocurrency for Beginners",
    "url": "https://www.newsbtc.com/learn/how-to-invest-in-cryptocurrency/",
    "description": "What is cryptocurrency investment? Cryptocurrency investment in its most basic form is the process of buying digital currencies and holding them in the hope that the market falls in your favour while your portfolio increases in value. The value of a cryptocurrency is determined by the principle of supply and demand. As demand for a cryptocurrency, coin or token rises, there becomes fewer of them in circulation — resulting in a boom in price action. If the supply of coins outpaces demand for them, their value typically falls. There are several indicators that might draw an investor towards a particular cryptocurrency. Some investors and traders choose which cryptocurrencies to invest in by conducting a technical analysis of a range of coins. An investor might have certain criteria that need to be met to invest. For example, cryptocurrencies that are in an overall uptrend, are showing positive signs of adoption and have a durable, scalable blockchain interface are more desirable than those that don’t. Common types of crypto investing There are many ways to invest in cryptocurrency, besides directly purchasing coins or tokens through an exchange. Some of the common types of crypto investing include: Investing in crypto-oriented or pro-crypto companies ­— As the prices of cryptocurrencies soar, so does the stock price in companies that form their business around them. Companies that are able to integrate cryptocurrency blockchain networks into their service offering can prove profitable as cryptocurrency use becomes more widespread. Investing in crypto-heavy funds — Crypto funds typically carry less risks than committing capital to one specific cryptocurrency. As some cryptocurrencies bull and others bear (decrease or increase), fund holders can still benefit from having their losses hedged by their gains — making them attractive to more risk-averse investors. Buy crypto EFTs on a brokerage platform — Similar to crypto funds, EFTs can also be a great way diversify a portfolio without committing large amounts of capital. The price of an EFT is determined by the price action of a group of coins or tokens rather than just one — making it a safer option for novice investors. Incorporate cryptocurrency into your Roth IRA or 401K — More and more brokerages and investing platforms are allowing cryptocurrency allocations to be held in an IRA or 401K account. For example, Fidelity is unveiling plans to allow users to dedicate 20% of their 401k holding to cryptocurrencies — allowing investors to diversify their 401k. What do I need to know before investing in cryptocurrency? Before plunging into the world of cryptocurrencies, there are a few things to consider: Cryptocurrencies are unregulated and decentralized — Despite being one of the allures that draw investors towards cryptocurrencies, their decentralization can make them potentially dangerous. The threat of scams and fraud can make it a risky asset to hold. They’re known for huge fluctuations in price action — Bitcoin, Ethereum and many other altcoins are extremely volatile. Because their price is determined largely by hype and speculation from coin makers and blockchain developers, it’s difficult for investors to gauge the long-term profitability of cryptocurrency investments. Exercise caution when dealing with ICOs — Similarly to how companies have an initial public offering (IPO) for their stock price when they first go public, emerging cryptocurrencies start out the same way — offering what’s known as an initial coin offering (ICO). Investors must be wary of these as they’re known for their limited transparency when it comes to development progress, user adoption and potential issues, so investors may risk buying into pump and dump schemes. Only invest amounts you’re comfortable losing — Because of their inherent volatility — and lack of data to support consistent long-term growth potential — it’s important investors only invest small portions of their portfolio into cryptocurrency when starting out. Protect your private key — If you’re using a cold or hot wallet to store your cryptocurrency, you’ll need a private key – an alphanumeric code that acts as a password. Protecting this key is paramount to guarding your investments as criminals can steal it and walk away with your assets. Choose the best coin exchange, broker or wallet to suit you — Whether you’re a long-term or short-term investor — or even a day-trader – selecting a broker or exchange that works best for your needs is essential. Investors must consider the features of the site — like what currencies are available, what you can buy and sell and leverage options — as well as transactional costs that are more suited to their investment style. What do I need to invest in cryptocurrency? Investing in crypto is simple and easy to do. All you need is some liquid capital — in the form of a fiat currency like dollars or pound sterling — and an account with a broker or crypto exchange. To get started, you need to: Choose a broker or exchange that best suits you — this might mean selecting one with an easy-to-use interface if you’re just starting out. Create your account, verify your details and link it to your bank account. Deposit the amount of fiat currency you’re willing to invest/risk. After having assessed the market for a cryptocurrency that has taken your interest, place an order to purchases some, select the amount you’d like to invest and confirm the order. Store your cryptocurrency — you can do so in: Hot wallets — Usually on portable devices like laptops and phones, hot wallets are constantly connected to the internet. Although they boast the convenience of always being connected, they’re an easier target for hackers. Cold wallets — These wallets are disconnected storage units that hold your cryptocurrency once it’s been procured. Because they’re disconnected, they’re only at risk when they connect, giving hackers a limited window of opportunity. The brokerage account — If you don’t mind keeping portfolios separate, you can just store your entire cryptocurrency holding within your brokerage account. However, before committing funds to cryptocurrency investments. It’s important to study the fundamentals of investing to limit the risks. Pros &#38; cons of investing in cryptocurrency There are many advantages and disadvantages to investing in and trading cryptocurrency — all of which need to be considered by new investors when opening up an account. Pros of investing in crypto Potential for high gains — Because of the volatile nature of cryptocurrencies — and the uncertainty surrounding their implementation — they have incredibly high growth potential, meaning a possibly stellar return potential for investors. Cryptocurrencies have been the highest performing assets of the last five years — with Bitcoin and Ethereum growing 1000% and 500% respectively in that time. Government-resistant store of value — Unlike the Federal Reserve — which has the ability to inflate currencies in response to crisis — cryptocurrencies are governed by their own supply and demand markets, meaning they resist fluctuations in fiat currencies. Cryptocurrencies typically have a limited number of coins in circulation, whereas the Federal Reserve can simply print more money. It’s a great way to diversify your portfolio — In addition to commodities like gold and silver that are a natural hedge against inflation, cryptocurrencies have shown extremely good profit potential that weathers the storm of financial crisis — helping you reduce risk in your long-term investment portfolio. Accessible 24/7 — Unlike stock markets — that have investing and trading windows to make deals — cryptocurrency markets are open 24/7. This lets investors place orders, take profits and monitor trends at any time. Cons of investing in crypto Market is incredibly volatile — Cryptocurrencies are extremely unregulated — much of the price fluctuations in the crypto market are governed by speculation based on cryptocurrency owners’ perceptions of their own coins and future projections. With volatility comes the potential for extremely high gains but also substantial losses if they make up too much of your portfolio. Their long-term success is yet to be proved — Despite notable coins like Bitcoin and Ethereum booming in value, many alt coins have seen a peak and have struggled to return to their five-year highs. It’s still unknown if they’re a strong investment or a bubble waiting to burst, leading to recurring economist questioning as to whether the market will survive. It’s confusing for new investors — Navigating the world of cryptocurrency investments, CFDs, leveraged trading and misinformation can lead to substantial losses for those starting out. It’s critical for those investing to understand the markets and not throw their capital in straight away. Targets for security breaches — It’s no secret that the high-value cryptocurrencies locked away in digital wallets are targets for criminals. Phishing attacks on wallet holders and misplaced security keys can give malicious actors instant access to your crypto portfolio, letting them transfer funds from unsuspecting users. Investors must contend with online misinformation — “Get rich quick” schemes and inflated predictions of the success of a cryptocurrency can cloud the judgement of novice investors. With stocks, there is more information to work with including revenue, EPS ratings, price-to-earnings ratios and compound annual growth rate (CAGR) that let users make informed decisions — where cryptocurrency is more speculative due to its infancy. Understanding crypto market volatility and risk management Because there is little in the way of regulation and oversight in the crypto market, prices are governed solely by speculation. While significant movements — like technical advancements in a cryptocurrency’s blockchain infrastructure — can cause buzz and rallies of a particular cryptocurrency, its popularity is largely dictated by cryptocurrency owners inflating the strength of their own coins. To hedge against volatility, investors and traders can make use of certain features on coin exchanges and brokerage sites to limit risk. For example, experienced investors will look to: Use crypto as a diversifier — Rather than betting their entire portfolio on cryptocurrencies booming in price, they’ll only allocate a small portion of their assets to cryptocurrency. With their money in many types of investments — like stocks, commodities and indices as well as cryptocurrency — they’re able to benefit from micro gains in each sector and limit losses. Limit the use of CFDs and leverage — CFDs and Leverage lets investors take up much larger positions on the stock market than their capital might allow. This can mean higher gains but also substantial losses should they crash. A controlled, cautious approach to leveraged investing can help limit those losses. Manage emotion — If you’re new to crypto investing, it can be easy to get swept up in the emotional side of investing — especially if a bear market hits your portfolio particularly hard. Experienced investors understand that the market moves only in response to supply and demand, making It easier for them to cash out and change tactics in response to market changes with a cool head. Work to a timeline — Experienced investors stick to a long-term plan — they don’t just throw money at cryptocurrencies in response to trends. Their investments are based on data-driven predictions, price graphs and technical and fundamental analysis. This lets them buy, hold or sell at more optimal times than people that panic buy. Tips for investing in cryptocurrency Investing in cryptocurrencies can be daunting — especially for those with limited understanding of market fundamentals. Here’s a few tips to bear in mind as a novice investor. Make use of “stop losses” and “take profit” levels “Stop loss” and “take profit” are price ranges determined by the investor. Once these levels are set in place, the broker or exchange will automatically sell their investments to help an investor limit their losses and cash out on profits when they aren’t able to manage their assets themselves — say when they’re at work. If you’re starting out, or have limited disposable capital to play with, these limits are an integral part of preserving it — especially in volatile markets. Use an exchange rather than a broker Cryptocurrency exchanges typically have lower transaction and holding fees than brokers. This makes them better options for long-term investors. Remember that the markets are constant Cryptocurrency markets never sleep — they operate 24 hours a day, seven days a week. As well as your stop losses and take profit levels, it may be worth using tools to automate [DS1] your investments, so you don’t lose money on a sudden downturn. Consider using a paper account If you’re new to investing and want to get to grips with the market and understand how to navigate an exchange’s interface, you can open a paper account. This lets prospective users trade and invest in cryptocurrencies and stocks with fake money and safely test out strategies and monitor markets risk-free. You can make money when the market bears As the old adage goes — buy low and sell high. However, with modern exchanges and brokers, you can make money as a cryptocurrency depreciates. Often known as “shorting”, you can take up positions on the market that bet against a cryptocurrency. However, this is typically used by more experienced investors. Frequently Asked Questions (FAQs) Is crypto a good investment? There is much debate about the long-term growth potential of established cryptocurrencies, tokens and altcoins. While there is potential for high gains, investors also risk substantial losses, so they’re better suited to less risk-averse individuals. However, they have proven to be a great hedge against inflation, making them a viable addition to a diverse investment portfolio. How much should I invest in crypto? As a general rule, no more than 20% of your portfolio should be invested in any one market sector. For beginners, it’s advised to invest slightly less of your portfolio in cryptocurrency given the volatile nature of the markets. How much should I put into cryptocurrency to make money? You don’t need a lot of starting capital to invest in cryptocurrencies and make money. Although established coins — like Bitcoin and Ethereum — are priced in the thousands, brokers and exchanges let users invest in coins to the value of their capital. This means if you only have $100 to invest, you can still invest in Bitcoin and you’ll receive the equivalent value for your portfolio. Click here to discover the most recent cryptocurrency news"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-02T15:20:00.000Z",
    "title": "Hong Kong Fuels Chinese Crypto Drive: Ethereum, Arbitrum, BNB Lead",
    "url": "https://coinedition.com/hong-kong-fuels-chinese-crypto-drive-ethereum-arbitrum-bnb-lead/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Hong_Kong_Fuels_Chinese_Crypto_Drive_Ethereum_Arbitrum_BNB_Lead-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Hong_Kong_Fuels_Chinese_Crypto_Drive_Ethereum_Arbitrum_BNB_Lead-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Hong_Kong_Fuels_Chinese_Crypto_Drive_Ethereum_Arbitrum_BNB_Lead-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Hong_Kong_Fuels_Chinese_Crypto_Drive_Ethereum_Arbitrum_BNB_Lead-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Hong_Kong_Fuels_Chinese_Crypto_Drive_Ethereum_Arbitrum_BNB_Lead-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Hong_Kong_Fuels_Chinese_Crypto_Drive_Ethereum_Arbitrum_BNB_Lead-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Hong_Kong_Fuels_Chinese_Crypto_Drive_Ethereum_Arbitrum_BNB_Lead.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Hong Kong&#8217;s landmark decision to fling open the doors to retail crypto trading on June 1 has triggered a seismic shift in the narrative of Chinese cryptocurrency. As the dawn of this new era unfolds, the triumvirate of Ethereum, Arbitrum, and BNB Chain protocols are rapidly climbing the popularity ranks within the Chinese crypto community, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/hong-kong-fuels-chinese-crypto-drive-ethereum-arbitrum-bnb-lead/\">Hong Kong Fuels Chinese Crypto Drive: Ethereum, Arbitrum, BNB Lead</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]