[
  {
    "source": "Cointelegraph",
    "date": "2023-06-14T07:43:00.000Z",
    "title": "AI startup by ex-Meta and Google researchers raises $113M in seed funding",
    "url": "https://cointelegraph.com/news/ai-startup-by-ex-meta-and-google-researchers-raises-113m-in-seed-funding",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/fd1be72b-f6c8-4d53-97a6-d2228976568a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The company is on a hiring spree and on the lookout for researchers, software engineers and product developers in AI.</p>\n                    <p><p>A brand new artificial intelligence (AI) startup dedicated to rival ChatGPT creator, OpenAI, raised $113 million in seed funding, bringing up its valuation to $260 million within two months of inception.</p><p>Former AI researchers — previously working for Google DeepMind and Meta — co-founded Mistral AI, in May 2023 to develop open-source generative AI models. Arthur Mensch, the co-founder and CEO of the company <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7074514730349944832/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> that the first round of funding “will give us the resources and network we need to start rolling out a new model of generative artificial intelligence.”</p><p>Prior to co-founding Mistral AI, Mensch was a research scientist at Google Deep Mind. The other two co-founders — Timothee Lacroix and Guillaume Lample — worked at Facebook AI as a research engineer and research scientist respectively.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/cc7e6bd4-0170-45e7-9753-49313a236a2c.png\"  /><figcaption style=\"text-align: center;\"><em>Mistral AI co-founders Guillaume Lample, Arthur Mensch, Timothée Lacroix (left to right). Source: Medium</em></figcaption></figure><p>The funding <a href=\"https://medium.com/lightspeed-venture-partners/meet-europes-next-great-generative-ai-startup-mistral-ai-25ee537b1f9e\" target=\"_blank\" rel=\"noopener nofollow\">round</a> was led by Lightspeed Venture Partners and saw participation from JCDecaux Holding, Rodolphe Saadé and Motier Ventures among others. The trio will run the company from Paris and plan to release its first models for text-based generative AI in 2024.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/b9884cf5-b854-4b9d-b1d9-bb2098388d6e.png\"  /><figcaption style=\"text-align: center;\"><em>Mistral AI unfinished official website. Source: Mistra.AI </em></figcaption></figure><p>The company is on a hiring spree and on the lookout for researchers, software engineers and product developers in AI. At the time of writing, the newly formed Mistral AI did not have any social media presence either.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/uk-to-get-early-or-priority-access-to-ai-models-from-google-and-openai\"><strong><em>UK to get ‘early or priority access’ to AI models from Google and OpenAI</em></strong></a></p><p>Recently, Sam Altman, the CEO of OpenAI, met South Korean South Korean President Yoon Suk Yeol and urged the country to lead the manufacturing of chips dedicated to AI technology.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/a191ec48-32a8-461d-9f34-682822ecac98.jpeg\"  /><figcaption style=\"text-align: center;\"><em>OpenAI CEO Sam Altman and Korean President Yoon Suk Yeol shake hands at the Yongsan District, central Seoul presidential office on June 9.</em></figcaption></figure><p>OpenAI currently utilizes chips from Taiwan, but Altman revealed the incoming need for a supply of chips from Korea in the future.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/real-bedford-soccer-team-puts-bitcoin-on-the-map/\">Peter McCormack’s Real Bedford Football Club puts Bitcoin on the map</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-14T08:00:01.000Z",
    "title": "Bahamian court orders review of US charges filed after SBF’s extradition",
    "url": "https://cryptoslate.com/bahamian-court-orders-review-of-us-charges-filed-after-sbfs-extradition/",
    "description": "<p>Sam Bankman-Fried (SBF) won a small victory in a Bahamian court on June 13. The court temporarily blocked the Bahamas attorney general from consenting to charges added to SBF&#8217;s U.S. indictment after his extradition in December 2022, Bloomberg reported. The U.S. prosecutors added four new charges to the previous eight counts of fraud charges in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bahamian-court-orders-review-of-us-charges-filed-after-sbfs-extradition/\">Bahamian court orders review of US charges filed after SBF’s extradition</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-14T07:59:07.000Z",
    "title": "TRON Builds on Its Blockchain Origins with New Metaverse-Focused Mission, Vision, and Values",
    "url": "https://cryptodaily.co.uk/2023/06/tron-builds-on-its-blockchain-origins-with-new-metaverse-focused-mission-vision-and-values",
    "description": "<p>Geneva, Switzerland, June 14th, 2023, Chainwire</p><p>TRON unveiled its new mission, vision, and values at its annual internal conference last week. Founder Justin Sun delivered a speech outlining TRON's ongoing commitment to honoring its original goals, to innovating with real-world solutions, and to empowering decentralized commerce and community for every person on the planet. The surprise was how.&nbsp;</p><p>Sun said TRON&rsquo;s new mission is to build a Metaverse free port, coupled with TRON&rsquo;s vision to enable global economic inclusion for all 8 billion people on Earth.&nbsp;</p>&ldquo;The future of TRON will be a vibrant blue ocean full of opportunities where finance can be accessible to everyone in the world, and the network will eventually become a free port for financial services in the metaverse,&rdquo; Sun explained. &ldquo;As always, all of our services will be compliant and abide by requirements of local jurisdictions,\" said Sun.&nbsp;<p>TRON will focus on earning trust from users while growing in trustworthiness with regulators in every context where services are offered.&nbsp;</p><p>Now with the second most total value locked (TVL) among all blockchains, the network has the most daily active users and the most daily active transactions, with more than 166.58 million total accounts and more than 5.85 billion transactions since inception.&nbsp;</p><p>Values and Principles</p><p>TRON&rsquo;s values were also updated and clarified at the annual event. The team intends to hold to and honor the following values:&nbsp;</p><ul><li>Champion&rsquo;s Mindset &ndash; being a team with exceptional individuals who have high ambitions, endure hardship, and rise to win together</li><li>Community Obsession &ndash; putting users and togetherness front and center</li><li>Embrace Change &ndash; filtering through emerging trends to pivot appropriately for innovation while not chasing fads</li><li>Long Termism &ndash; building in the now with a clear view for the future in order to have a robust ecosystem that creates enormous public value</li></ul><p>In order to clarify its values and help team members embody those values together, the following guiding principles were put forth:&nbsp;</p><ul><li>Simplicity Achiever &ndash; earning trust in order to make our organization simpler, more cohesive, and able to maintain certainty in the face of doubt (FUD)</li><li>Do good things&ndash; doing what one was originally intended to do while sticking to basic values and brand building&nbsp;</li><li>7*24 Standby Professional &ndash; leaving an honorable and lasting impression for users in every encounter, every day of the week, every hour of the day</li><li>Ordinary People Doing Extraordinary Jobs &ndash; growing excellence through competence and global-mindedness while remembering origins and trajectory together</li></ul><p>Public Chain + Exchange + Stablecoin</p><p>Under the newly established business model of \"public chain + exchange + stablecoin,\" TRON aims to build a comprehensive ecosystem that caters to the needs of its users and contributes to the growth of the industry. With a focus on creating a metaverse free port and ensuring the inclusion of the eight billion people worldwide into the digital age, TRON is determined to make a significant impact on the global digital economy.</p><p>TRON's vision now extends beyond its current achievements, as it aims to create a Metaverse marketplace and community center built on blockchain tech and decentralized finance. With the second largest DeFi ecosystem in the world, TRON has proven its position as a leader in the industry, facilitating global commerce and community across the world. Their stablecoin strength alone makes them stand out from all other blockchains, circulating the second most stablecoins among all chains, moving more USDT than Tether&rsquo;s native blockchain.&nbsp;</p>\"TRON's biggest competitive edge does not stem from technology but from the trust of users and the community. In other words, trust is its trump card. Amid the complicated environment, an organization that has big-picture thinking, commitment, and public trust all at once is one in a million. This is what TRON strives to be and why we're revealing our new mission, vision, and values today,\" said Justin Sun.<p>Wholehearted adoption of its new mission, vision, and values, providing a Metaverse free port as a gateway to financial freedom for the 8 billion+ inhabitants of Earth, is yet another way TRON aims to empower decentralized commerce and community for every person on the planet.&nbsp;</p><p>Learn more at TRONDAO.org, and stay up with the latest from TRON&rsquo;s ecosystem by subscribing to TRON&rsquo;s email newsletter.&nbsp;</p><p></p>ContactHayward Wongpress@tron.network"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-14T07:59:00.000Z",
    "title": "Uniswap Unveils Plans For V4, Invites Community Feedback",
    "url": "https://cryptodaily.co.uk/2023/06/uniswap-unveils-plans-for-v4-invites-community-feedback",
    "description": "<p>The largest decentralized cryptocurrency exchange Uniswap has unveiled plans for Uniswap v4, the next iteration of the hugely popular crypto platform.&nbsp;</p>\n<p>The exchange has also open-sourced the draft code, enabling the community to build on it.&nbsp;</p>\nUniswap v4\n<p>Uniswap v4 brings with it several customizable features. Furthermore, for the first time ever, Uniswap Labs, the entity behind the DeFi platform, is inviting community feedback on Uniswap v4 before its eventual public launch. Speaking about the upgrade, lead smart contract engineer at Uniswap Labs, Sara Reynolds, stated that the possibilities are endless and open-sourcing the source code could allow the community to &ldquo;take it anywhere.&rdquo; Uniswap noted in a blog post,&nbsp;</p>\n\n<p>&ldquo;We&rsquo;re thrilled to introduce our vision for Uniswap v4, which we believe will open up a world of possibilities for how liquidity is created and how tokens are traded on-chain. We are releasing the draft code now so that v4 can be built in public, with open feedback and meaningful community contribution.&rdquo;</p>\n\n<p>According to Uniswap, the idea behind incorporating community feedback before the public launch of its latest iteration is to underscore the protocol&rsquo;s dedication to decentralization. Decentralization is a key difference that separates traditional centralized exchanges (CEX), such as Coinbase and Binance, from decentralized exchanges, such as Uniswap. Both Coinbase and Binance are facing lawsuits filed by the United States Securities and Exchange Commission (SEC).&nbsp;</p>\nExpanding Its Capabilities&nbsp;\n<p>Uniswap is widely known for popularizing AMMs (Automated Market Makers), which is a type of smart contract. Automated Market Makers facilitate trades between different cryptocurrencies without requiring any intermediaries. The protocol&rsquo;s current v3 version debuted in 2021 on the Ethereum blockchain and made waves with the introduction of the above-mentioned Automated Market Makers, along with multiple fee tiers and on-chain price oracles. Currently, Uniswap v3 is the largest decentralized exchange in terms of trading volume and has processed over $1 trillion in transactions since its introduction, according to data from DeFiLlama.&nbsp;</p>\n<p>The v4 upgrade looks to expand the protocol&rsquo;s coin-swapping capabilities, introducing a new type of smart contract called &ldquo;hooks&rdquo; and custom liquidity pools. Hayden Adams, Uniswap Labs CEO, described hooks as plugins that allow the customization of how pools, swaps, fees, and liquidity provider positions interact. This allows developers to expand on already existing liquidity pools.&nbsp;</p>\nNew Features And Performance Improvements&nbsp;\n<p>Adams also stated that the new functionalities in v4 could pave the way for added features such as dynamic fees and on-chain limit orders. These features are typically available on traditional platforms but are more difficult to implement on blockchains that do not feature intermediaries or centralized order books. Adams also added that v4 would introduce several performance improvements and fee reductions. Anyone will be able to create pools thanks to Uniswap&rsquo;s permissionless nature and facilitate the purchase and sale of crypto. Furthermore, the Uniswap Labs CEO added that network gas fees which are required to list new pools, will be reduced by 99% in v4.&nbsp;</p>\n<p>The protocol is also releasing its plans for Uniswap v4 to the public to gauge their feedback, although Adams stated that it could take several months for v4 to go public.&nbsp;</p>\n\n<p>&ldquo;It&rsquo;s really here as an initial implementation of this protocol and a vision for what it will be, but it&rsquo;s not finished. There&rsquo;s time for people to give feedback, time for people to find improvements and optimizations, time for people to also start preparing to build on top of it.&rdquo;</p>\n\nMoving Towards Increased Decentralization&nbsp;\n<p>With community feedback, Uniswap is adopting an even more decentralized approach. This comes against the backdrop of stringent regulatory action by US regulators against centralized exchanges such as Binance and Coinbase, both of whom are facing lawsuits. Currently, it remains to be seen how the Securities and Exchange Commission could initiate action against decentralized exchanges such as Uniswap. However, it has clarified that it intends to increase its oversight of the decentralized finance ecosystem.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T07:42:48.000Z",
    "title": "US Treasury Secretary Janet Yellen anticipates slow decline in Dollar’s reserve currency status",
    "url": "https://www.cryptopolitan.com/us-treasury-secretary-janet-yellen-anticipates-slow-decline-in-dollars-reserve/",
    "description": "US Treasury Secretary Janet Yellen, during a House Financial Services Committee hearing, stated that while the US should expect a gradual decline in the dollar&#8217;s share of global reserves, there are no viable alternatives that can completely replace the greenback. Yellen highlighted the fundamental reasons behind the dollar&#8217;s prominent role in the global financial system, ... <a title=\"US Treasury Secretary Janet Yellen anticipates slow decline in Dollar&#8217;s reserve currency status\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-treasury-secretary-janet-yellen-anticipates-slow-decline-in-dollars-reserve/\" aria-label=\"More on US Treasury Secretary Janet Yellen anticipates slow decline in Dollar&#8217;s reserve currency status\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T08:00:57.000Z",
    "title": "TRON Builds on Its Blockchain Origins with New Metaverse-Focused Mission, Vision, and Values",
    "url": "https://www.crypto-news-flash.com/tron-builds-on-its-blockchain-origins-with-new-metaverse-focused-mission-vision-and-values/?utm_source=rss&utm_medium=rss&utm_campaign=tron-builds-on-its-blockchain-origins-with-new-metaverse-focused-mission-vision-and-values",
    "description": "Geneva, Switzerland, June 14th, 2023, Chainwire TRON unveiled its new mission, vision, and values at its annual internal conference last week. Founder Justin Sun delivered a speech outlining TRON&#8217;s ongoing commitment to honoring its original goals, to innovating with real-world solutions, and to empowering decentralized commerce and community for every person on the planet. The [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-14T08:05:00.000Z",
    "title": "Binance CEO Denies Selling Bitcoin to Defend BNB Liquidation",
    "url": "https://coinedition.com/binance-ceo-denies-selling-bitcoin-to-defend-bnb-liquidation/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Binance_have_not_sold_BTC_or_BNB_We_even_still_have_a_bag_of_FTT-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Binance_have_not_sold_BTC_or_BNB_We_even_still_have_a_bag_of_FTT-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Binance_have_not_sold_BTC_or_BNB_We_even_still_have_a_bag_of_FTT-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Binance_have_not_sold_BTC_or_BNB_We_even_still_have_a_bag_of_FTT.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Changpeng Zhao (CZ), CEO of the leading crypto exchange, Binance, has vehemently denied recent accusations of market manipulation against his business. Responding to the critic’s claims, CZ tweeted, “Binance have not sold BTC or BNB. We even still have a bag of FTT.” The allegations, brought forward by a Binance critic on social media, claimed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-ceo-denies-selling-bitcoin-to-defend-bnb-liquidation/\">Binance CEO Denies Selling Bitcoin to Defend BNB Liquidation</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-14T07:45:19.000Z",
    "title": "BTC’s Supply on Exchanges Drops to 2018 Lows: On-Chain Data",
    "url": "https://coinedition.com/btcs-supply-on-exchanges-drops-to-2018-lows-on-chain-data/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/📉_Bitcoins_exchange_supply_has_now_fallen_to_its_lowest_level-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/📉_Bitcoins_exchange_supply_has_now_fallen_to_its_lowest_level-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/📉_Bitcoins_exchange_supply_has_now_fallen_to_its_lowest_level-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/📉_Bitcoins_exchange_supply_has_now_fallen_to_its_lowest_level.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Recent data from the blockchain intelligence firm Santiment shows that traders and investors prefer to keep their Bitcoin (BTC) off of exchange platforms. According to a tweet published this morning, the supply of BTC on exchanges has fallen to its lowest level since February 2018. Santiment attributed the drop in BTC’s supply on exchange platforms [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/btcs-supply-on-exchanges-drops-to-2018-lows-on-chain-data/\">BTC’s Supply on Exchanges Drops to 2018 Lows: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]