[
  {
    "source": "CoinDesk",
    "date": "2023-06-05T09:24:43.000Z",
    "title": "New York’s Met Museum Agrees to Return $550K in FTX Donations",
    "url": "https://www.coindesk.com/policy/2023/06/05/new-yorks-met-museum-agrees-to-return-550k-in-ftx-donations/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The bankrupt crypto company is seeking the return of funds sent by Sam Bankman-Fried’s empire before its November collapse."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-05T09:15:08.000Z",
    "title": "Atomic Wallet claims hack affected less than 1% of monthly active users",
    "url": "https://cryptoslate.com/atomic-wallet-claims-hack-affected-less-than-1-of-monthly-active-users/",
    "description": "<p>On June 3, Atomic Wallet acknowledged users&#8217; wallets were compromised after reports of stolen funds. In an update on June 5, the firm said that less than 1% of its monthly active users were affected or reported being affected by the hack. The firm added that it was still investigating the security breach and its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/atomic-wallet-claims-hack-affected-less-than-1-of-monthly-active-users/\">Atomic Wallet claims hack affected less than 1% of monthly active users</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-05T09:24:48.000Z",
    "title": "Spheroid Universe Coin to be Listed on MEXC Exchange",
    "url": "https://cryptodaily.co.uk/2023/06/spheroid-universe-coin-to-be-listed-on-mexc-exchange",
    "description": "<p>Dubai, United Arab Emirates, June 5th, 2023, Chainwire</p><p class=\"ql-align-justify\">Spheroid Universe, a futuristic Metaverse that augments the real world in every part of the Earth, is announcing that their token, SPH, will officially be listed on MEXC today, on June 5th.</p><p class=\"ql-align-justify\">Founded in 2018, MEXC (also known as MEXC Global) is a rapidly-growing cryptocurrency exchange with more than 6 million users in over 200 countries, including the USA, UAE, Canada and Australia. MEXC is regularly featured as one the top exchanges globally for trading volume. The exchange offers one of the widest ranges of cryptocurrencies with over 1,500+ coins listed on the platform. It brings a wealth of experience listing top-performing tokens, with a reach that only a handful of exchanges in Crypto have, helping Spheroid Universe go global.</p><p class=\"ql-align-justify\">The move follows the company&rsquo;s recent launch of ChatGPT-powered artificial intelligence (AI) Avatars that will inhabit the world around us via augmented reality (AR). This ground-breaking development will deliver breakthrough opportunities across numerous business platforms - from e-commerce and retail to advertising, sales, general customer, and consumer interactions and more.</p>Commenting on the announcement, Andrey Almiashev, CEO, of Spheroid Universe said: &ldquo;Launching our token on MEXC will place SPH firmly on its trajectory towards growth as well as will bring the bandwidth that aligns with our aspirations for Spheroid Universe - putting Spheroid Universe as a leader in the metaverse projects, and the entire Extended and Augmented Reality industry.&rdquo;<p class=\"ql-align-justify\">Spheroid Universe aims to be the battle-tested AR/XR platform across the entire landscape of web3, XR/VR and metaverse industries, ultimately helping to define the internet experience of the future.</p><p class=\"ql-align-justify\">Brands and organizations that are looking to create an immersive digital experience will make Spheroid Universe the place where they can truly demonstrate innovative experiences.</p><p>&nbsp;About Spheroid</p><p>Spheroid Universe (Spheroid), an Extended Reality Metaverse company. It&rsquo;s a platform for developing Extended Reality projects. The technological basis of the platform is the Spheroid XR Cloud and the Spheroid Script programming language designed for AR/XR creation.</p><p>SPH is the native token of the Spheroid ecosystem that fuels the activities of the platform. It can be exchanged for Spaces (virtual lands of the Spheroid Universe), used for advertising in AR/XR, placing content, and for various platform services. Among the products powered by SPH there is Spheroid Earth &ndash; an open global project for creating Earth 3D Digital Twin.</p><p>For further details, please visit Spheroid Universe's Official website or follow them on Twitter and Instagram</p>ContactHead of PRYousef BatterWhite Label Strategyyousef.batter@whitelabelstrategy.io+971559356531"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-05T09:30:39.000Z",
    "title": "Latam Insights —Tether to Start Bitcoin Mining Operations in Uruguay; Lula Proposes Abandoning US Dollar",
    "url": "https://news.bitcoin.com/latam-insights-tether-to-start-bitcoin-mining-operations-in-uruguay-lula-proposes-abandoning-us-dollar/",
    "description": "<img width=\"696\" height=\"392\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1827932012-1.webp\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Latam Insights —Tether to Start Bitcoin Operations in Uruguay; Lula Vows to Abandon US Dollar\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" />Welcome to Latam Insights, a compendium of Latin America&#8217;s most relevant crypto and economic news during the last week. In this issue, Tether announces a sustainable Bitcoin mining project in Uruguay, Brazil&#8217;s President Lula proposes a shift away from the U.S. dollar, and Argentina advances its de-dollarization push. Tether Announces Sustainable Bitcoin Mining Project in [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-05T09:33:26.000Z",
    "title": "Spheroid Universe Coin to be Listed on MEXC Exchange",
    "url": "https://www.crypto-news-flash.com/spheroid-universe-coin-to-be-listed-on-mexc-exchange/?utm_source=rss&utm_medium=rss&utm_campaign=spheroid-universe-coin-to-be-listed-on-mexc-exchange",
    "description": "<p>Dubai, United Arab Emirates, June 5th, 2023, Chainwire Spheroid Universe, a futuristic Metaverse that augments the real world in every part of the Earth, is announcing that their token, SPH, will officially be listed on MEXC today, on June 5th. Founded in 2018, MEXC (also known as MEXC Global) is a rapidly-growing cryptocurrency exchange with [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/spheroid-universe-coin-to-be-listed-on-mexc-exchange/\">Spheroid Universe Coin to be Listed on MEXC Exchange</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-05T09:15:44.000Z",
    "title": "JPMorgan CEO Jamie Dimon Says Fed Rate Hike Pause Incoming – But There’s a Big Catch",
    "url": "https://dailyhodl.com/2023/06/05/jpmorgan-ceo-jamie-dimon-says-fed-rate-hike-pause-incoming-but-theres-a-big-catch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/in-Crypto-Stolen-From.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/in-Crypto-Stolen-From.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/in-Crypto-Stolen-From.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/in-Crypto-Stolen-From.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/in-Crypto-Stolen-From.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/in-Crypto-Stolen-From.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/in-Crypto-Stolen-From.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>JPMorgan CEO Jamie Dimon is forecasting a pause from the Federal Reserve&#8217;s rate hikes, but with a caveat for risk-asset bulls. In a new interview on Bloomberg, Dimon, a crypto critic, says that pausing rate hikes is probably the right thing to do at this point. However, the CEO says that after a pause, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/05/jpmorgan-ceo-jamie-dimon-says-fed-rate-hike-pause-incoming-but-theres-a-big-catch/\">JPMorgan CEO Jamie Dimon Says Fed Rate Hike Pause Incoming – But There’s a Big Catch</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]