[
  {
    "source": "Bitcoin.com",
    "date": "2024-01-09T02:00:15.000Z",
    "title": "SEC Expected to Approve ‘a Handful’ of Spot Bitcoin ETFs on Wednesday, Report",
    "url": "https://news.bitcoin.com/sec-expected-to-approve-a-handful-of-spot-bitcoin-etfs-on-wednesday-report/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-expected-wednesday-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC Expected to Approve &#039;a Handful&#039; of Spot Bitcoin ETFs on Wednesday, Report\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-expected-wednesday-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-expected-wednesday-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-expected-wednesday-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-expected-wednesday-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-expected-wednesday-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-expected-wednesday-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-expected-wednesday.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Securities and Exchange Commission (SEC) is expected to green-light &#x201C;a handful&#x201D; of spot bitcoin exchange-traded funds (ETFs) on Wednesday, potentially unleashing a wave of trading this week. On Monday, 10 applicants submitted their final amendments, including Blackrock, which also filed to register its Ishares Bitcoin Trust as a security. SEC Expected to Green-Light [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-09T02:00:36.000Z",
    "title": "Former SEC Chair Affirms: ‘Nothing Left To Decide,’ Bitcoin ETF Approval Imminent",
    "url": "https://www.newsbtc.com/bitcoin-news/former-sec-chair-affirms-nothing-left-to-decide-bitcoin-etf-approval-imminent/",
    "description": "As anticipation builds around major asset managers&#8217; potential approval of Bitcoin ETF applications, former US Securities and Exchange Commission (SEC) chair Jay Clayton has added his voice to the discussion.  Clayton, who served as SEC chair from 2017 to 2020 during the Trump administration, expressed his belief in the inevitable approval of Bitcoin ETFs in a recent interview with CNBC. Clayton Highlights Key Factors In Bitcoin ETF Approval According to Clayton, approving Bitcoin ETFs is not a matter of if but when. He emphasized the robustness and efficacy of the Bitcoin trading market, stating that it has significantly improved over the past five years.  Clayton also highlighted the importance of the technology supporting these ETFs, particularly the custody, creation, and redemption processes.  Clayton views the ability to tokenize and digitize underlying assets as a major step forward, with implications beyond the crypto space. Clayton believes that this development has the potential to bring about significant changes in the broader financial industry. Related Reading: Shiba Inu Breakout To $0.001? Rumored 9.25 Trillion SHIB Token Burn Could Be The Catalyst Clayton&#8217;s recent comments align with his previous statements, demonstrating a consistent stance favoring Bitcoin ETF approval.  During his tenure as SEC chair, Clayton expressed skepticism about the BTC market but acknowledged the emergence of reputable institutions in the crypto industry as a game-changing development.  Clayton emphasized the efficiency of a spot Bitcoin ETF for investors. He noted that approving a Bitcoin Spot ETF would become difficult to resist if institutions can demonstrate their effectiveness compared to the futures market.  Clayton also recognized the significance of institutional players entering the crypto industry, as their involvement lends credibility and addresses some of the SEC&#8217;s concerns regarding market manipulation. Moreover, Clayton highlighted the increasing demand from retail investors to gain regulated exposure to Bitcoin through investment products. He also noted that reputable financial industry providers are eager to offer Bitcoin ETFs to the public.  These factors underscore the market&#8217;s readiness for regulated investment vehicles that can provide broader access to cryptocurrencies while maintaining investor protections. Trading Expected To Commence This Week CNBC has reported that trading of Bitcoin ETFs could commence within days. The news aligns with former SEC Chair Jay Clayton&#8217;s optimistic outlook on Bitcoin ETF approval, adding to the growing anticipation surrounding these investment products.  According to CNBC correspondent Kate Rooney, two sources close to the process have indicated that Wednesday will likely be the day of the ultimate approval.  According to CNBC&#8217;s sources, this coincides with the application deadline for Ark Invest and 21 Shares, raising the possibility of a trading launch between Thursday and Friday.  As the SEC receives updates on the filings, Rooney concluded that several applications are expected to be given the green light.  Related Reading: A Bullish Beginning? $151 Million Poured Into Crypto Funds In 2024’s First Week Overall, the imminent approval would indicate a shift in acceptance of cryptocurrencies within the regulatory landscape and present an opportunity for investors to access Bitcoin through regulated investment vehicles.  As of this writing, the excitement surrounding the approval has sent Bitcoin to the $46,900 mark, up more than 6.8% in the past 24 hours. Featured image from Shutterstock, chart from TradingView.com "
  }
]