[
  {
    "source": "Cointelegraph",
    "date": "2024-01-04T09:51:13.000Z",
    "title": " EU regulators will investigate banks’ exposure to crypto ",
    "url": "https://cointelegraph.com/news/eu-regulators-will-investigate-banks-exposure-to-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNWI0NzZkNDUtYmZkNi00NzkyLTk1ZGQtMWQ3ODQxNWUzNjE0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The European Banking Authority will conduct a joint investigation with the European Systemic Risk Board and the Financial Stability Board. </p>\n                    <p><p>The European Union’s banking regulator, the European Banking Authority (EBA), will conduct a joint investigation with the European Systemic Risk Board (ESRB) and Financial Stability Board (FSB) to assess the interconnectedness of legacy banks with non-bank financial institutions (NBFIs), including hedge funds, private equity and crypto platforms. </p><p>The intention was announced by the chair of EBA, José Manuel Campa, in a Dec. 3 <a href=\"https://www.ft.com/content/c7239712-fc92-48ec-8438-dafd108bbb44\" target=\"_blank\" rel=\"noopener nofollow\">interview</a> with the Financial Times. Campa believes that the whole “underlying chain in NBFIs” should be traced to understand the scale of the potential for contagion between banking and non-banking financial institutions in a stress situation:</p><p>The executive revealed that the EBA had already assessed the banks’ balance sheet exposures to non-banks, including loans. He believes the NBFIs to be an “obscure sector” with a “not-homogenous” quality of available data. </p><p><a href=\"https://cointelegraph.com/news/eu-regulators-will-investigate-banks-exposure-to-crypto\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-04T09:44:08.000Z",
    "title": " Bitcoin bull market metrics &#039;almost reset&#039; as BTC price hovers at $43K ",
    "url": "https://cointelegraph.com/news/bitcoin-bull-market-metrics-almost-reset-btc-price-hovers-at-43-k",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOTUxNTQ2MmUtZDAyZC00YmQ0LWI4ZTUtMTQxMmY0MjNmMmYxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin shedding nearly 10% allows precursors of BTC price upside to regroup, while ETF excitement focuses on a decision next week.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) stayed lower into Jan. 4 as markets emerged from a 9% BTC price crash.</p><p>Data from <a href=\"https://subscription.cointelegraph.com/\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed BTC/USD circling the area around $43,000 before the Wall Street open.</p><p>Still down $3,000 from the week’s top, the largest cryptocurrency opted to tread water as mysteries continued over the fate and timing of the United States’ first spot Bitcoin exchange-traded fund (ETF).</p><p><a href=\"https://cointelegraph.com/news/bitcoin-bull-market-metrics-almost-reset-btc-price-hovers-at-43-k\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-04T09:47:57.000Z",
    "title": "20% Chance We Are in the Middle of a ‘Gigantic Bubble Cycle’ in the Crypto Market, Says Ex-Goldman Sachs Exec",
    "url": "https://www.cryptoglobe.com/latest/2024/01/20-chance-we-are-in-the-middle-of-a-gigantic-bubble-cycle-in-the-crypto-market-says-ex-goldman-sachs-exec/",
    "description": "In a recent discussion with cryptocurrency influencer Scott Melker, macro investor Raoul Pal shared his thoughts on the potential future of the cryptocurrency market. Raoul Pal is a renowned financial expert and former Goldman Sachs executive known for his deep understanding of global macroeconomics. He co-founded and managed the Global Macro Investor, a respected investment […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T10:08:03.000Z",
    "title": "Crypto market experiences $100 billion washout, analysts consider it normal",
    "url": "https://www.cryptopolitan.com/crypto-market-experiences-100-billion/",
    "description": "In a recent turn of events, the cryptocurrency market has seen a significant downturn, with a staggering $100 billion being wiped out in less than 24 hours.&#160; Despite the alarming figures, industry analysts are asserting that such flash crashes and market washouts are becoming increasingly common and, in some cases, necessary for the health of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T10:00:35.000Z",
    "title": "JPMorgan and Goldman Sachs eyed for key roles in upcoming Grayscale Bitcoin ETF",
    "url": "https://www.cryptopolitan.com/jpmorgan-and-goldman-sachs-eyed-for-key/",
    "description": "Grayscale Investments, a prominent crypto asset manager, is reportedly in discussions with major financial institutions, including JPMorgan and Goldman Sachs, regarding their potential involvement as authorized participants in its proposed spot Bitcoin Exchange-Traded Fund (ETF).&#160; This development follows Grayscale&#8217;s recent filing of an amended S-3 application with the U.S. Securities and Exchange Commission (SEC), which [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T09:58:11.000Z",
    "title": "Controversial tax law requires reporting of crypto transactions over $10,000",
    "url": "https://www.cryptopolitan.com/reporting-of-crypto-transactions-over-10000/",
    "description": "The United States has ushered in the new year by implementing a contentious tax law, demanding that its citizens report cryptocurrency transactions exceeding $10,000.&#160; This law, included in the Infrastructure Investment and Jobs Act, took effect on January 1, 2024, providing the Internal Revenue Service (IRS) with a substantial influx of data on crypto users. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T09:49:04.000Z",
    "title": "Climate Tech Industry Predictions for 2024",
    "url": "https://www.cryptopolitan.com/climate-tech-industry-predictions-for-2024/",
    "description": "As the world grapples with the urgent need to combat climate change, the role of technology, especially artificial intelligence (AI), in addressing environmental challenges is gaining prominence. 2023 saw a mixed bag of developments in the climate tech industry, with funding levels fluctuating. Still, the sector taking up a larger portion of the tech funding [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T09:47:14.000Z",
    "title": "XRP advocate John Deaton takes center stage in Congressional crypto discussion",
    "url": "https://www.cryptopolitan.com/xrp-advocate-john-deaton-takes-center-stage/",
    "description": "In an upcoming congressional hearing on digital assets scheduled for January 10, John Deaton, a prominent lawyer known for his representation of XRP holders, has publicly volunteered to testify.&#160; Deaton, recognized for his advocacy on behalf of cryptocurrency holders, brings a unique perspective to the discussion due to his extensive involvement in legal battles involving [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-04T09:45:55.000Z",
    "title": "Ethereum Name Service (ENS) governance token surges 72% following Vitalik Buterin’s praise",
    "url": "https://www.cryptopolitan.com/ens-governance-token-surges-72/",
    "description": "The governance token of the Ethereum Name Service (ENS) experienced a remarkable surge of 72% in value on January 3rd, following an endorsement from Ethereum co-founder Vitalik Buterin.&#160; In a social media post, Buterin praised ENS as &#8220;super important&#8221; and emphasized the importance of maintaining accessibility and affordability for all users of the Ethereum network, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-04T09:46:49.000Z",
    "title": "Binance broadens ‘monitoring’ tag to cover 10 more tokens, including Monero and Zcash",
    "url": "https://crypto.news/binance-broadens-monitoring-tag-to-cover-10-more-tokens-including-monero-and-zcash/",
    "description": "Today, Binance revealed its plan to expand the Monitoring Tag coverage to encompass 10 additional tokens starting from Jan. 4. Notably, Monero (XMR) and Zcash (ZEC) are now included in this extension. According to a press release, the newly incorporated&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-04T10:00:38.000Z",
    "title": "Bitcoin Price Reclaims $43,000 On Rumor Of ETF Approval Tomorrow",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-43000-rumor-etf-approval-tomorrow/",
    "description": "In a strong turnaround from yesterday&#8217;s flash crash, the Bitcoin (BTC) price has staged a recovery, breaching the $43,000 mark. This surge comes after yesterday’s intense volatility, where the cryptocurrency giant witnessed an over 11% flash crash following a controversial report from Matrixport. The report suggested a potential rejection by the US Securities and Exchange Commission (SEC) of the much-anticipated spot Exchange Traded Funds (ETFs), triggering the second-largest liquidation of long positions in the past year. Bitcoin&#8217;s price plummeted to as low as $41,500. However, Bitcoin is today stabilizing above $43,000, influenced by a combination of factors. Notably, several experts have disputed the Matrixport report&#8217;s validity. Adding to the positive sentiment, a significant SEC related update has caught the market&#8217;s attention. Bitcoin ETF Tomorrow? According to a report by Fox Business, SEC staff attorneys from the Division of Trading and Markets were engaging in crucial discussions with representatives from major exchanges such as the New York Stock Exchange, Nasdaq, and the Chicago Board Options Exchange on Wednesday. This engagement is significant as it pertains to the approval of several Bitcoin ETF applications. Related Reading: Bitcoin Crashes To $41,500 As ETF Approval Hangs In Balance: Experts The meetings are seen as a positive sign that the SEC is nearing approval of some or all of the dozen applications by major money managers and crypto firms for the product. An anonymous source familiar with these developments stated, “While the final decision has not been made, sources close to the proceedings say the SEC could begin notifying issuers of approval on Friday with trading beginning as early as next week.” Bloomberg ETF analyst James Seyffart commented on Eleanor Terrett&#8217;s report from Fox Business via X, stating: “My view is in line with Eleanor Terrett&#8217;s reporting. I think the SEC could begin signaling to issuers to expect approvals tho I&#8217;m still expecting official approvals Jan 8 &#8211; 10. I also think the gap between approval orders and actual trading will be measured in days &#8212; not weeks.” Related Reading: Forget The SEC And Bitcoin ETF Approval Drama, Here’s Why Bitcoin Flash Crashed Echoing Seyffart&#8217;s views, Eric Balchunas, his colleague at Bloomberg, commented, “Things you prob don&#8217;t do if you going to deny or delay. Hearing similar btw, and why why when we see updated (final) 19b-4s roll in that is sign approval imminent as SEC has been doing back and forth w issuers offline to perfect their 19b-4s vs doing numerous refilings a la S-1s.” Scott Johnsson, a finance lawyer at Davis Polk, weighed in on Balchunas&#8217; statement: “In every past ETF wave, the SEC did not do this. Why? Because (1) this takes up a ton of SEC resources and (2) makes it MUCH harder to successfully survive judicial scrutiny (and after Grayscale, this is like drawing blood from a stone). If you intend to deny, you just deny.” BTC Price Remains Ultra Bullish In light of these developments, the cryptocurrency market remains cautiously optimistic, with indicators strongly pointing towards an ETF approval by January 10, potentially even as early as January 5. Notably, the Bitcoin price has closed its daily candle within the uptrend channel, established in mid-October. At press time, BTC traded at $43,102. Featured image from Shutterstock chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-04T09:47:06.000Z",
    "title": "Klaytn Foundation and CREDER Launch Game-Changing $GPC Gold DeFi Platform on Klaytn Blockchain",
    "url": "https://www.crypto-news-flash.com/klaytn-foundation-and-creder-launch-game-changing-gpc-gold-defi-platform-on-klaytn-blockchain/?utm_source=rss&utm_medium=rss&utm_campaign=klaytn-foundation-and-creder-launch-game-changing-gpc-gold-defi-platform-on-klaytn-blockchain",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-34.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-34.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-34-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-34-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-34-450x301.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />According to a press release, a collaboration between the Klaytn Foundation and Creder has introduced GPC, the first tokenized gold found on a DeFi outside Ethereum.  Users are reported to mint GPC by using their gold NFT as collateral.  Klaytn Foundation has announced that Creder, a member of the Klaytn Governance Council (GC) has launched [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-04T10:00:00.000Z",
    "title": "DeMR—KuCoin Labs’ First Strategic Investment in the DePIN Track",
    "url": "https://coinedition.com/demr-kucoin-labs-first-strategic-investment-in-the-depin-track/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"DeMR—KuCoin Labs&#039; First Strategic Investment in the DePIN Track\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN.png 730w, https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN-300x169.png 300w, https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN-380x214.png 380w, https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN-696x392.png 696w, https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN-159x89.png 159w, https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN-255x143.png 255w, https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN-313x175.png 313w, https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN-440x247.png 440w, https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN-414x233.png 414w, https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN-293x165.png 293w, https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN-375x211.png 375w, https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN-328x185.png 328w, https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN-144x81.png 144w, https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN-123x70.png 123w, https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN-129x73.png 129w, https://coinedition.com/wp-content/uploads/2024/01/DeMR—KuCoin_Labs_First_Strategic_Investment_in_the_DePIN-355x200.png 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>KuCoin Labs, the incubator and investment arm of the KuCoin ecosystem,&#160; has announced a strategic investment in DeMR, marking the beginning of a comprehensive collaboration in community operations and subsequent product development. This move reflects the recognition of the DePIN track by KuCoin Labs and highlights its profound understanding of the future development of the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/demr-kucoin-labs-first-strategic-investment-in-the-depin-track/\">DeMR—KuCoin Labs&#8217; First Strategic Investment in the DePIN Track</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]