[
  {
    "source": "CryptoSlate",
    "date": "2024-01-02T22:51:42.000Z",
    "title": "Crypto tax rules now require reporting of transactions over $10K",
    "url": "https://cryptoslate.com/crypto-tax-rules-now-require-reporting-of-transactions-over-10k/",
    "description": "<p>New cryptocurrency tax reporting obligations came into effect on New Year&#8217;s Day, crypto advocacy group CoinCenter said on Jan. 2. According to CoinCenter, those new rules require anyone who receives at least $10,000 in cryptocurrency to report transaction information to the IRS. Required data includes the name, address, and Social Security number (SSN) of the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/crypto-tax-rules-now-require-reporting-of-transactions-over-10k/\">Crypto tax rules now require reporting of transactions over $10K</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-02T23:00:56.000Z",
    "title": "Spot ETF Approvals Will See BTC Value Rising to $50,000 in January — Matrixport",
    "url": "https://news.bitcoin.com/spot-etf-approvals-will-see-btc-value-rising-to-50000-in-january-matrixport/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/etfers-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Spot ETF Approvals Will See BTC Value Rising to $50,000 in January — Matrixport\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/etfers-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/etfers-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/etfers-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/etfers-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/etfers-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/etfers-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/etfers.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The expected approval of spot bitcoin exchange-traded funds (ETFs) applications by the U.S. Securities and Exchange Commission will see the top crypto asset&#x2019;s price jumping to $50,000 in January, the latest market preview by Matrixport has predicted. The crypto financial services platform said the approval of ETFs, combined with bitcoin halving, will likely see the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-02T23:00:55.000Z",
    "title": "3 Under The Radar Altcoins Expected To Hit $100 Before The Bitcoin Halving",
    "url": "https://www.newsbtc.com/altcoin/3-under-the-radar-altcoins-100/",
    "description": "With the Bitcoin halving expected to happen today, crypto enthusiasts are already starting to take positions in various altcoins. Among these, there are a number of coins that have shown a lot of promise when it comes to reaching the $100 price mark and this report takes a look at three. MoonRiver (MOVR) Tops Lists Of Altcoins To Reach $100 The MoonRiver (MOVR) token has been one that has flown under the radar for quite a while now. This has to do with the fact that the price of the altcoin fell from its all-time high of $485 to as low as $5 earlier in 2023. However, this has not eradicated the bullish narrative for the asset. Related Reading: Dogecoin, Cardano, And Chainlink Get Special Listing From Binance So far, as the crypto market has recovered, the MOVR token has seen one of the most significant rallies. In the days leading up to Christmas, the price would go from around $6 to as high as $44 in a couple of days, notching 700% gains during this time. Since then, the price has since retraced and fallen around 50%. But with the price still holding above $20, it shows a lot of promise for the coin. Given its low supply of around 11 million coins and a tendency to rise quickly in a short time, MoonRiver is one of the coins poised to break the $100 mark. MOVR price at $24 &#124; Source: MOVRUSDT on Tradingview.com Litecoin (LTC) Slow Movement Coming To An End The Litecoin price rallied tremendously in 2023 leading up to its halving and was among some of the best-performing altcoins. However, once the halving was completed, the LTC price would crumble and fall into a slow and steady decline. However, this has changed as the coin’s price has begun to pick up steam once again. With the Bitcoin reversal, the Litecoin price is on the up once again, briefly crossing $75 in the early house of Tuesday. The altcoin, which is often referred to as the digital silver, could be poised to see firmer rallies, especially as the Bitcoin halving draws closer, which is often a catalyst for the bull market. If this continues, then LTC could easily cross $100. Related Reading: Machine Learning Algorithm Predicts When Cardano Price Will Hit New $6.5 ATH Avalanche (AVAX) Sees An Awakening Just like Solana (SOL), the Avalanche network has undergone an awakening that has brought investors back to the chain. As a result, the AVAX price has rallied, going from its 2023 low of around $9 to as high as $47 in December 2023. As the new year rolled around, the Avalanche network has continued to enjoy attention from crypto investors and this has helped it maintain its bullish momentum. Just like MoonRiver (MOVR) and Litceoin (LTC), Avalanche (AVAX) is another token expected to cross the $100 mark. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Changelly, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-02T23:01:27.000Z",
    "title": "Crypto Betting Site Polymarket Sees 88% Chance That Bitcoin Spot ETF Approved by January 15th",
    "url": "https://dailyhodl.com/2024/01/02/crypto-betting-site-polymarket-sees-88-chance-that-bitcoin-spot-etf-approved-by-january-15th/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/grayscale-replies-argues-spot.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/grayscale-replies-argues-spot.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/grayscale-replies-argues-spot.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/grayscale-replies-argues-spot.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/grayscale-replies-argues-spot.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/grayscale-replies-argues-spot.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/grayscale-replies-argues-spot.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto gambling website foresees a high probability that a spot Bitcoin (BTC) exchange-traded fund (ETF) will be approved by mid-January. According to the crypto betting site Polymarket, there are 88% odds that the U.S. Securities and Exchange Commission (SEC) will approve a BTC spot ETF by January 15, 2024. According to a recent report by Reuters, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/02/crypto-betting-site-polymarket-sees-88-chance-that-bitcoin-spot-etf-approved-by-january-15th/\">Crypto Betting Site Polymarket Sees 88% Chance That Bitcoin Spot ETF Approved by January 15th</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]