[
  {
    "source": "Decrypt",
    "date": "2023-09-26T21:46:12.000Z",
    "title": "Paris Fashion Week AR Kiosks Turn Visitors Into Runway Models",
    "url": "https://decrypt.co/198850/paris-fashion-week-ar-kiosks-turn-visitors-runway-models",
    "description": "Augmented reality stations from Fabrix and DressX let Paris Fashion Week attendees try out designer styles, adding an interactive element."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-26T21:43:06.000Z",
    "title": "Nomura’s Laser Digital receives in-principal approval for operations in Abu Dhabi",
    "url": "https://cointelegraph.com/news/nomura-laser-digital-receives-in-principal-approval-abu-dhabi",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/9be343e0-ae77-4916-addb-09f72ca2a548.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Japanese bank joins a rapidly growing number of digital asset firms operating in Abu Dhabi and the rest of the United Arab Emirates. </p>\n                    <p><p>The Abu Dhabi Global Market (ADGM) has granted Laser Digital, the digital assets arm of Japan’s Nomura Bank, in-principal approval to provide broker-dealer services and asset/fund management services with both digital and traditional assets, according to an ADGM communication on Sept. 26. </p><p>Laser Digital can receive full Financial Services Permission to operate after fulfilling conditions specified in the current approval. Those conditions were not specified in the communication. Laser Digital CEO Jez Mohideen said of the ADGM in the communication:</p><blockquote>“Their comprehensive and clear regulatory framework is creating a global hub for digital assets that we are delighted to be joining.”</blockquote><p>The ADGM is an international financial free zone within Abu Dhabi, capital of the United Arab Emirates (UAE). The ADGM occupies nearly 15 square kilometers across two islands and consists of a registration authority, regulatory authority and a court that applies common law. </p><p>Binance <a href=\"https://cointelegraph.com/news/binance-receives-in-principle-approval-to-operate-in-abu-dhabi\">received in-principal approval</a> to operate in the ADGM in April 2022 and <a href=\"https://cointelegraph.com/news/abu-dhabi-grants-binance-financial-services-permission-economist-hits-out\">received Financial Services Permission</a> in November. Kraken also <a href=\"https://cointelegraph.com/news/kraken-awarded-crypto-trading-license-in-the-united-arab-emirates\">received permission to operate</a> in the ADGM in 2022. This year, the ADGM licensed two smaller virtual asset firms – <a href=\"https://cointelegraph.com/news/abu-dhabi-gives-virtual-asset-firm-m2-permission-to-offer-crypto-services\">UAE-based M2</a> and <a href=\"https://cointelegraph.com/news/abu-dhabi-regulator-grants-rain-permission-offer-crypto-services\">Bahrain-based Rain</a>.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/abu-dhabi-to-back-the-growth-of-web3-startups-with-2b\">Abu Dhabi to back the growth of Web3 startups with $2B</a></em></strong></p><p>Another emirate, Ras Al Khaimah, <a href=\"https://cointelegraph.com/news/uae-emirate-to-launch-free-zone-for-digital-and-virtual-asset-firms\">created a free zone for digital</a> and virtual asset companies called RAK Digital Assets Oasis (RAK DAO) earlier this year.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/ADGM?src=hash&amp;ref_src=twsrc%5Etfw\">#ADGM</a> is proud to announce that <a href=\"https://twitter.com/LaserDigital_?ref_src=twsrc%5Etfw\">@LaserDigital_</a> has received an In-Principle Approval (IPA) from the ADGM Financial Services Regulatory Authority (FSRA) for its virtual asset management services, further establishing it as a leading global hub for digital assets.… <a href=\"https://t.co/CmvkP4wumO\">pic.twitter.com/CmvkP4wumO</a></p>&mdash; Abu Dhabi Global Market (@ADGlobalMarket) <a href=\"https://twitter.com/ADGlobalMarket/status/1706644794804478150?ref_src=twsrc%5Etfw\">September 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The preliminary approval in Abu Dhabi comes just over a month after Laser Digital <a href=\"https://cointelegraph.com/news/nomura-crypto-arm-bags-dubai-vara-license\">received an operating license</a> from Dubai’s Virtual Asset Regulatory Authority (VARA). It <a href=\"https://cointelegraph.com/news/bitcoin-coin-adoption-fund-launched-japan-nomura-bank\">also launched a Bitcoin</a> (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) Adoption Fund in August. Laser Digital was created in September 2022. </p><p>Nomura is also part of the Komainu joint venture, along with cryptocurrency exchanges CoinShares and Ledger. Koimanu <a href=\"https://cointelegraph.com/news/dubai-crypto-license-komainu-nomura-coinshares-ledger-joint-venture\">received an operating license</a> from Dubai’s VARA in August, joining several other crypto exchanges. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-city-guide-to-dubai/\">Crypto City: Guide to Dubai</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-09-26T21:58:35.000Z",
    "title": "SEC Told to Approve Bitcoin Spot ETF ‘Immediately’ by Congress",
    "url": "https://cryptobriefing.com/sec-told-approve-bitcoin-spot-etf-immediately-congress/?utm_source=feed&utm_medium=rss",
    "description": "Congress accuses SEC of unfair bitcoin ETF policies, demanding equal treatment of spot and futures funds after court ruling against agency."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-26T22:00:22.000Z",
    "title": "Huobi (HTX) Troubles Mount: Justin Sun Accused Of $2.4B Shortfall In User Funds",
    "url": "https://www.newsbtc.com/huobi-ht/huobi-htx-troubles-mount-justin-sun-accused-of-2-4b-shortfall-in-user-funds/",
    "description": "HTX (formerly known as Huobi), one of the leading cryptocurrency exchanges, has been embroiled in a new controversy as Justin Sun, Tron&#8217;s founder and BitTorrent&#8217;s CEO, faces allegations of a staggering $2.4 billion shortfall in user funds.  Adam Cochran, Managing Partner at Cinneamhain Ventures, has shed light on the intricate details of the alleged malpractice, revealing a web of “financial manipulations.” Related Reading: Maker (MKR) Price Continues to Climb Higher Level, Will It Surpass $1500? Huobi Crisis Unveiled? Cochran&#8217;s analysis raises concerns over Huobi&#8217;s financial stability, questioning the integrity of the exchange&#8217;s claims regarding its holdings of Ethereum (ETH) and USDT, a stablecoin pegged to the US dollar.  As seen in the chart above, while Huobi asserts assets worth $200 million in ETH, Cochran&#8217;s investigation, corroborated by defillama data, reveals a discrepancy, with the actual value amounting to under $113 million, even when considering wrapped ETH (WETH) and staked ETH (stETH). The situation further unravels when examining Huobi&#8217;s purported $624 million USDT holdings. However, Cochran&#8217;s findings indicate that only $119 million of USDT resides within the exchange, while the remaining balance is in staked USDT (stUSDT).  What raises suspicion is that Justin Sun has enabled staked USDT (stUSDT) a staking feature, which allows users to stake either USDT or TUSD (TrueUSD) to earn stUSDT, as reported by NewsBTC.  Allegations Mount Against Justin Sun  Instead of following the expected protocol of burning staked assets to claim the cash and take it offline, these funds are redirected to Justin Sun&#8217;s addresses or utilized to support JustLend, a lending platform associated with the Huobi ecosystem. Contrary to Huobi&#8217;s claim that it burns the stUSDT with Tether, Cochran&#8217;s investigation reveals that the counterparties for USDT on Huobi are the exchange&#8217;s deposit wallets or Binance.  This suggests that Justin Sun may utilize USDT from user balances on Huobi to generate stUSDT, subsequently leveraging the underlying USDT to support JustLend or repurchase TUSD on Binance. Cochran concludes that this complex financial arrangement, including TUSD deposits into stUSDT, effectively mints &#8220;fake assets&#8221; against an unknown equity.  As a result, Cochran estimates that Justin Sun&#8217;s alleged debt to users across the Huobi and Tron ecosystems amounts to approximately $2.4 billion, all while users remain unaware of the situation. Related Reading: BULLISH: Bloomberg Analyst Points Out Two Key Bitcoin Metrics Demonstrating Historic Strength Huobi has not yet formally responded to these allegations, leaving the situation&#8217;s outcome uncertain. However, the possibility of Huobi&#8217;s insolvency raises significant concerns regarding the security of user funds and the overall trustworthiness of the exchange. It remains to be seen how this situation will develop and what actions will be taken to address these concerns effectively. Related Reading: Bitcoin Mega Whales Return To Selling Mode, More Downside Soon? Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-26T22:01:08.000Z",
    "title": "Crypto Exchange Kraken Pushes Ahead With Expansion, Obtaining Key Authorization in Ireland and Spain",
    "url": "https://dailyhodl.com/2023/09/26/crypto-exchange-kraken-pushes-ahead-with-expansion-obtaining-key-authorization-in-ireland-and-spain/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/kraken-settles-over-violation.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/kraken-settles-over-violation.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/kraken-settles-over-violation.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/kraken-settles-over-violation.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/kraken-settles-over-violation.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/kraken-settles-over-violation.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/kraken-settles-over-violation.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>One of the top US-based crypto exchanges is expanding globally into major European financial hubs. According to a new press release, Kraken Exchange has secured an E-Money Institution (EMI) registration with the Central Bank of Ireland, as well as a Virtual Asset Service Provider (VASP) registration with the Bank of Spain.  Ireland&#8217;s EMI license will allow [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/26/crypto-exchange-kraken-pushes-ahead-with-expansion-obtaining-key-authorization-in-ireland-and-spain/\">Crypto Exchange Kraken Pushes Ahead With Expansion, Obtaining Key Authorization in Ireland and Spain</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]