[
  {
    "source": "Bitcoin.com",
    "date": "2023-12-19T04:00:05.000Z",
    "title": "Survey: 4 in 5 Institutional Investors Agree Crypto Has Important Role in Global Financial Industry",
    "url": "https://news.bitcoin.com/survey-4-in-5-institutional-investors-agree-crypto-has-important-role-in-global-financial-industry/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/institutional-investors-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Institutional Investor Survey: 80% Agree Crypto Has Important Role in Global Financial Industry\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/institutional-investors-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/institutional-investors-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/institutional-investors-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/institutional-investors-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/institutional-investors-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/institutional-investors-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/institutional-investors.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />An institutional investor survey conducted by digital asset bank Sygnum indicates a shift from skepticism to advocacy, &#8220;with over 80% now agreeing that crypto has an important role to play in the global financial industry,” said the bank’s digital asset research manager. “It’s now truly becoming a trusted gateway that is rapidly transforming the economic [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T04:08:37.000Z",
    "title": "Worldcoin Price Prediction 2024 – 2030: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T03:58:26.000Z",
    "title": "Tapbit Exchange In-Depth Evaluation: Best Crypto exchange in 2023?",
    "url": "https://www.cryptopolitan.com/tapbit-exchange-in-depth-evaluation-best-crypto-exchange-in-2023/",
    "description": "In the rapidly evolving cryptocurrency trading landscape, Tapbit has emerged as a standout platform, boasting a comprehensive range of features and high-quality services that have garnered a loyal user base. In this article, we present a deep evaluation of Tapbit, synthesizing user feedback and highlighting its significant advantages. We aim to provide you with a [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-19T04:00:35.000Z",
    "title": "Spanish Police Crack Down On Crypto-Based ISIS Funding Operation",
    "url": "https://www.newsbtc.com/crypto/spanish-police-crack-down-on-crypto-based-isis-funding-operation/",
    "description": "Spanish police successfully dismantled a network involved in financing ISIS through crypto transactions, resulting in the arrest of five individuals over the weekend. The operation, part of a two-and-a-half-year investigation, targeted individuals allegedly connected to the terrorist organization known as DAESH or ISIS.  The arrests were made in Valencia (2), Cáceres, Alicante, and Guipúzcoa. Four of the suspects have been remanded in custody by court order. Global Network Financing ISIS Via Crypto? According to the official statement of the Spanish national police, the operation marks the second phase of &#8220;MIYA,&#8221; an initiative launched in 2021 by Spain&#8217;s National Police General Information Commissariat (CGI).  The investigation received collaboration from intelligence and security services in twelve countries, including the Moroccan Surveillance du Territoire (DGST), the Algerian Direction Générale de la Sécurité Intérieure (DGSI), the Mauritanian Direction Générale de la Sûreté Nationale (DGSN), the US Federal Bureau of Investigation (FBI), Swiss FEDPOL, and EUROPOL.  Within Spain, the CGI worked closely with its Provincial Information Brigades in Valencia, Alicante, Cáceres, and San Sebastián and the National Intelligence Center (CNI). The Central Court of Instruction number 6 and the Prosecutor&#8217;s Office of the National Court coordinated the investigation. Related Reading: Bitcoin Bull Run In Jeopardy? Analyst Finds Market Top Signals With BTC At $40,000 The initial phase of the operation, conducted after a year and a half of investigation, uncovered a person of Maghreb origin residing in Spain who was in contact with a jihadist seeking to carry out an attack in France on behalf of DAESH. The Spanish individual offered their collaboration to the radical extremists.  The CGI&#8217;s counterterrorism experts located the intended attacker in Switzerland and promptly shared the information with the Swiss FEDPOL. A joint operation was swiftly organized, resulting in the simultaneous arrest of the two individuals in March 2022, along with six others across Europe and the Maghreb.  The detainee in Spain was subsequently sentenced to two years in prison for terrorism-related charges and released in mid-2023. Following the initial phase, CGI analysts discovered that the two detainees were part of an international network supporting DAESH, spanning multiple continents, including Afghanistan, the Middle East, Sahel, Maghreb, and Europe.  The network allegedly obtained funds through criminal activities in Europe to finance their terrorist operations with crypto. Large sums of money were moved through international transfers and crypto, with authorities seizing nearly 200,000 euros worth of digital assets. Five Suspects Arrested According to the official statement, members of the network also engaged in indoctrination, attempting to recruit new followers to the jihadist cause and providing support to individuals expressing a desire to carry out terrorist attacks.  The investigation uncovered evidence suggesting the network&#8217;s involvement in planning at least two attacks, ultimately foiled by security services. Related Reading: Dogecoin On-Chain Metrics Explode, Can DOGE Price Reach $0.2? The recent arrests in Spain mark the conclusion of the investigation, with five individuals taken into custody. One of the suspects exhibited signs of radicalization in recent months and had expressed a desire to carry out an attack.  During a search of the individual&#8217;s residence, authorities discovered handgun ammunition, an ax, manuals for making explosives, manuals for indoctrinating minors, and jihadist propaganda. As of the current update, the total market capitalization of the cryptocurrency market is $1.525 trillion, reflecting a decline of over 2% within the past 24 hours.  Featured image from Shutterstock, chart from TradingView.com"
  }
]