[
  {
    "source": "CryptoSlate",
    "date": "2023-06-13T07:42:15.000Z",
    "title": "Binance lawyers say SEC’s restraining order will do the damage it aims to prevent",
    "url": "https://cryptoslate.com/binance-lawyers-say-secs-restraining-order-will-do-the-damage-it-aims-to-prevent/",
    "description": "<p>Lawyers for Binance and related firms submitted a court filing on June 12 expressing opposition to a restraining order currently sought by the U.S. Securities Exchange Commission (SEC). Binance objects to the restraining order The SEC filed charges against Binance and related companies on June 5. It then sought a restraining order against Binance.US to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-lawyers-say-secs-restraining-order-will-do-the-damage-it-aims-to-prevent/\">Binance lawyers say SEC&#8217;s restraining order will do the damage it aims to prevent</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-13T07:59:09.000Z",
    "title": "Bitcoin bounce is coming … Just a matter of time",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-bounce-is-coming-just-a-matter-of-time",
    "description": "<p>As the SEC piles on the misery for the crypto sector most would expect Bitcoin to continue its descent. However, two indicators say otherwise.</p>\nSEC pulls crypto market down\n<p>Gary Gensler&rsquo;s Securities and Exchange Commission (SEC) is doing everything in its power to crush the crypto sector. A sector that is potentially seen as a rival to the hegemony of the US dollar is having the life sucked out of it as the SEC attacks on/off ramps and major exchanges.</p>\n<p>The retail investors who are just there for the money are leaving in droves and it is likely that many cryptocurrencies will die because of being labelled by the SEC as securities, while others will have their growth stunted as the threat of a potential SEC action hangs over them.</p>\nBitcoin still in upward trend\n<p>Meanwhile, as the crypto industry continues its suffering, Bitcoin is still technically in its upward trend; one that it has been following since the beginning of the year. Granted it has seen an 18% correction since topping at around $31,000 in early April, but this is entirely normal.</p>\nWeekly Stochastic RSI\n<p>One huge indicator for Bitcoin, which is potentially only 2 or 3 weeks away from triggering, is a cross up on the high time frame weekly Stochastic RSI. This indicator is very near bottoming out, and in fact, it is showing bullish divergence, which on the weekly time frame can be very powerful.</p>\nGaussian Channel\n<p>Another indicator, which not so many look at, is the Gaussian Channel. This indicator is incredibly powerful in interpreting price movements and is able to predict price trends. When looking at the Gaussian Channel on the higher time frame of 5 days, the data has no false signals, at least for Bitcoin&rsquo;s short history.</p>\n<p>The Gaussian Channel flipped from red to green on the 5 day in early May and is now trending upward. Importantly, the bitcoin price has come back to test the top of the channel and a bounce could be seen from this area.</p>\nBitcoin will outstrip the dollar\n<p>This still does not mean that Bitcoin is automatically confirmed as having entered its bull market, but it is certainly a positive sign. To boot, given the decentralised nature of the Bitcoin network, and its scarcity and predictability of supply, it is highly likely to outstrip the dollar as that fiat currency continues to suffer extreme debasement.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-13T08:04:59.000Z",
    "title": "Crypto market recovers as SEC lawsuits’ heat falls",
    "url": "https://crypto.news/crypto-market-recovers-as-sec-lawsuits-heat-falls/",
    "description": "The US Securities and Exchange Commission (SEC) took legal action against the crypto industry over the past week. However, data shows that the heat around the SEC lawsuits has fallen while the prices gain corrections. The regulator sued Binance and&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T08:03:21.000Z",
    "title": "Top Analyst Benjamin Cowen: Prepare for the Real Carnage and Uncover Huge Investment Opportunities Ahead",
    "url": "https://www.crypto-news-flash.com/top-analyst-benjamin-cowen-prepare-for-the-real-carnage-and-uncover-huge-investment-opportunities-ahead/?utm_source=rss&utm_medium=rss&utm_campaign=top-analyst-benjamin-cowen-prepare-for-the-real-carnage-and-uncover-huge-investment-opportunities-ahead",
    "description": "Crypto analyst Benjamin Cowen takes to YouTube to inform his 783,000 subscribers about the altcoin market and what to expect in the long term.  Despite market players being convinced that altcoins cannot decline any further, Cowen warns that the dip can go much deeper.  Following the recent development with the SEC, sentiments around altcoins at [...]"
  }
]