[
  {
    "source": "Bitcoin.com",
    "date": "2023-08-21T04:30:35.000Z",
    "title": "Nobel Laureate Paul Krugman States Argentina Should Adopt the Euro Instead of the US Dollar",
    "url": "https://news.bitcoin.com/nobel-laureate-paul-krugman-states-argentina-should-adopt-the-euro-instead-of-the-us-dollar/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1937905573-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Nobel Laureate Paul Krugmam States Argentina Should Adopt the Euro Instead of the US Dollar\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1937905573-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1937905573-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1937905573-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1937905573-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1937905573-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1937905573-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1937905573.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Economics Nobel laureate Paul Krugman recently stated that Argentina might be better off adopting the euro instead of the U.S. dollar amidst the devaluation of the Argentine peso. Krugman argued that Argentina has almost twice as much trade with the European Union as it does with the U.S., stating that the euro would suit them [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T04:34:38.000Z",
    "title": "Dogecoin’s Leading Developer, Mishaboar, Expresses Reservations About Proof-of-Stake",
    "url": "https://www.cryptopolitan.com/dogecoins-developer-about-proof-of-stake/",
    "description": "In the ever-evolving world of cryptocurrencies, the debate between Proof-of-Work (PoW) and Proof-of-Stake (PoS) consensus mechanisms continues to heat up. The latest to weigh in on this contentious issue is Mishaboar, a top-tier developer and influential figure within the Dogecoin community. His recent statements have shed light on his stance and sparked discussions about the ... <a title=\"Dogecoin&#8217;s Leading Developer, Mishaboar, Expresses Reservations About Proof-of-Stake\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dogecoins-developer-about-proof-of-stake/\" aria-label=\"More on Dogecoin&#8217;s Leading Developer, Mishaboar, Expresses Reservations About Proof-of-Stake\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-21T04:29:58.000Z",
    "title": "Ethereum Price Saw Key Technical Correction, But 100 SMA Is Still Strong",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-correction-1600/",
    "description": "Ethereum price is attempting a recovery wave above the $1,620 level against the US Dollar. ETH could start a fresh decline if it stays below the 100 hourly SMA. Ethereum is struggling to recover above the $1,690 and $1,700 levels. The price is trading below $1,700 and the 100-hourly Simple Moving Average. There was a break above a connecting bearish trend line with resistance near $1,670 on the hourly chart of ETH/USD (data feed via Kraken). The pair could resume its decline if it stays below the $1,700 level in the near term. Ethereum Price Faces Hurdles Ethereum’s price declined heavily below the $1,700 level. ETH tested the $1,520 zone and recently started a decent recovery wave, similar to Bitcoin. There was a move above the $1,550 and $1,600 levels. The price climbed above the 50% Fib retracement level of the downward move from the $1,825 swing high to the $1,518 low. Besides, there was a break above a connecting bearish trend line with resistance near $1,670 on the hourly chart of ETH/USD. However, the bears are still active below the $1,680 level. Ether is also trading below $1,700 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $1,690 level. The next resistance is near $1,700 or the 100-hourly Simple Moving Average. Source: ETHUSD on TradingView.com The 61.8% Fib retracement level of the downward move from the $1,825 swing high to the $1,518 low is also near the $1,700 zone. A close above the $1,700 level could start a decent increase in the near term. The next major resistance is near the $1,750 level. Any more gains might send the price toward the $1,820 resistance, above which the price could rise toward the $1,880 zone. Fresh Decline in ETH? If Ethereum fails to clear the $1,700 resistance, it could continue to move down. Initial support on the downside is near the $1,640 level. The first major support is near the $1,600 zone. If the bulls fail to protect the $1,600 support, there could be more losses. The next major support is near the $1,550 support level. Any more losses might send the price toward the $1,520 level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now near the 50 level. Major Support Level – $1,600 Major Resistance Level – $1,700"
  }
]