[
  {
    "source": "CoinDesk",
    "date": "2023-11-15T13:00:00.000Z",
    "title": "National Hockey League Comes Around to Digital Collectibles, Using Sweet Platform",
    "url": "https://www.coindesk.com/tech/2023/11/15/national-hockey-league-comes-around-to-digital-collectibles-using-sweet-platform/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "NHL Breakaway launches with Sweet, a platform for brands to create NFT collectibles under the Ethereum ERC-721 standard on Polygon and the Ethereum mainnet, as well as the Tezos NFT standard."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-15T12:58:19.000Z",
    "title": "Kazakhstan Central Bank Marks Digital Tenge Pilot With First Retail Payment",
    "url": "https://www.coindesk.com/policy/2023/11/15/kazakhstan-central-bank-marks-digital-tenge-pilot-with-first-retail-payment/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The National Bank of Kazakhstan plans to implement a digital tenge by the end of 2025."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-15T12:53:08.000Z",
    "title": "Robinhood meme stock punters denied class suit certification",
    "url": "http://cointelegraph.com/news/robinhood-meme-stock-punters-denied-class-suit-certification",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/183751bb-cdc5-4b09-96ee-639745fd78f3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A court has rejected a motion requesting class action certification from investors pursuing legal action against Robinhood</p>\n                    <p><p>Investors pursuing legal action against Robinhood over trading restrictions imposed in early 2021 have faced another setback in court after the Florida Southern District Court <a href=\"https://www.courtlistener.com/docket/59783498/in-re-january-2021-short-squeeze-trading-litigation/?filed_after=&amp;filed_before=&amp;entry_gte=&amp;entry_lte=&amp;order_by=desc#entry-623\" target=\"_blank\" rel=\"noopener nofollow\">rejected</a> the request for class certification by the plaintiffs on Nov. 13, 2023. </p><p>Chief Judge Cecilia M. Altonaga said that after thoroughly considering the written submissions, record, and relevant law, the plaintiffs’ motion was rejected because they could not persuade the court that issues of individualized reliance would not be prevalent.</p><p>Robinhood is a platform that provides commission-free trading for stocks, ETFs, options, and cryptocurrencies. Users can trade these financial instruments via its app or website without incurring traditional fees.</p><p>The plaintiffs aimed to <a href=\"https://cointelegraph.com/news/robinhood-ordeal-shows-broken-system-and-importance-of-regulation-crypto-industry-execs-say\">certify a class asserting market manipulation</a> claims under federal securities laws against Robinhood Markets, Inc., Robinhood Financial LLC, and Robinhood Securities, LLC.</p><p>The lawsuit centers on accusations of market manipulation by Robinhood, stemming from its trading limitations in <a href=\"https://cointelegraph.com/news/rob-from-the-poor-and-give-to-the-rich-robinhood-prompts-furious-backlash-after-restricting-trades\">early 2021 during the “meme stock” short squeeze</a>. Notably, heightened market volatility in January 2021 led regulators to increase deposit requirements for clearing brokers, including Robinhood, to mitigate the risks associated with unexecuted trades.</p><p>Robinhood could not meet the increased deposit requirements and pursued an alternative solution to satisfy regulators. The company succeeded when regulators granted a waiver for the deposit requirements, contingent on Robinhood implementing restrictions on its customers’ ability to trade specific stocks.</p><p>The platform attributed its restrictions to market volatility, vehemently denying any liquidity issues. Plaintiffs claim the platform manipulated the market by imposing restrictions, presenting “half-truths” about volatility while conveniently omitting any acknowledgment of liquidity challenges.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cathie-wood-ark-buys-9-5-million-robinhood\"><strong><em>Cathie Wood’s ARK bags 1.1M Robinhood shares in one day</em></strong></a></p><p>Robinhood urged the court to reject class certification, citing deficiencies in the class representatives and asserting that individualized issues of reliance and damages will overshadow common concerns. The plaintiffs contended that their representatives are sufficient, and the case is suitable for class certification.</p><p>The court acknowledged that, for the most part, the plaintiffs have shown that the case and their representatives are suitable for class treatment. However, they could not persuade the Court that issues of individualized reliance would not be prevalent.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-games-decentralized-lattice-starknet-cartridge/\"><strong><em>Blockchain games aren’t really decentralized… but that’s about to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-15T12:52:20.000Z",
    "title": "Binance Labs invests in ARKM, the native token of Arkham platform",
    "url": "http://cointelegraph.com/news/binance-labs-arkm-arkham-investment",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/1dd94165-b8ae-4e41-8eed-493a57abefcd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance Labs, the venture capital arm of Binance Exchange, has invested in ARKM, the native token of the crypto intelligence platform Arkham.</p>\n                    <p><p>Binance Labs, the venture capital arm and incubator arm of Binance, said on Nov. 15 that it has invested in Arkham (ARKM), the native token of the “deanonymizing” blockchain platform Arkham.</p><p>The company <a href=\"https://www.binance.com/en/blog/ecosystem/binance-labs-invests-in-$arkm-token-to-support-onchain-insights-at-scale-across-the-blockchain-ecosystem-9067963769774448005\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a blog post on the website that the investment aims to support “on-chain insights at scale across the blockchain ecosystem.”</p><p>Arkham’s mission is to deanonymize blockchain transactions and strengthen self-regulation by enabling users to see anyone’s blockchain transactions using Arkham’s intelligence platform, Binance Labs said in the post. Based on the proprietary artificial intelligence (AI) engine known as ULTRA — which “algorithmically matches addresses with real-world entities” — the Arkham platform enables users to track entity relationships and flow funds, the announcement noted.</p><p>The VC platform also mentioned that Arkham introduced one of the world’s first on-chain intelligence exchanges, the Arkham Intel Exchange. The tool is a “decentralized intelligence economy” that matches buyers and sellers of blockchain intelligence and allows users to generate intelligence to capture value for their work in exchange for the ARKM token.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/uk-bill-seize-bitcoin-passed\"><strong><em>UK passes bill to enable authorities to seize Bitcoin used for crime</em></strong></a></p><p>Binance Labs didn’t disclose the terms of the ARKM deal in the announcement. Amid the news, the ARKM token has jumped more than 30% over the past 24 hours, with its market value reaching an all-time high of $100 million on Nov. 15, <a href=\"https://www.coingecko.com/en/coins/arkham\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to data from CoinGecko.</p><p>At the time of writing, ARKM is trading $0.58, up more than 70% over the past 30 days.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/1156838a-ea84-4179-b739-e02be3a1887b.png\"  /><figcaption style=\"text-align: center;\"><em>Arkham (ARKM) 24-hour chart. Source: CoinGecko</em></figcaption></figure><p>Binance Labs did not immediately respond to Cointelegraph’s request for comment.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-zero-knowledge-voting-finance/\"><strong><em>Beyond crypto: Zero-knowledge proofs show potential from voting to finance</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-15T12:45:27.000Z",
    "title": "Despite 80% AI adoption, APAC banks grapple with confidence in scam prevention",
    "url": "https://cryptoslate.com/despite-80-ai-adoption-apac-banks-grapple-with-confidence-in-scam-prevention/",
    "description": "<p>The Asia-Pacific (APAC) region, a dynamic hub of banking and payment services, is facing a dual challenge: making notable advancements in fraud prevention while grappling with the evolving sophistication of financial scams. A recent report by Feedzai and Chartis Research, &#8220;Scam Prevention in Asia-Pacific: A Survey of Banking and Payment Provider Professionals,&#8221; offers an insightful [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/despite-80-ai-adoption-apac-banks-grapple-with-confidence-in-scam-prevention/\">Despite 80% AI adoption, APAC banks grapple with confidence in scam prevention</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-15T13:05:51.000Z",
    "title": "BinaryX launches city building game Pancake Mayor on PancakeSwap’s new marketplace",
    "url": "https://cryptodaily.co.uk/2023/11/binaryx-launches-city-building-game-pancake-mayor-on-pancakeswaps-new-marketplace",
    "description": "BinaryX launches city building game Pancake Mayor on PancakeSwap’s new marketplace"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-15T13:08:21.000Z",
    "title": "Biden to Sign AI Limitation Deal with China Amidst Rising Concerns",
    "url": "https://www.cryptopolitan.com/biden-to-sign-ai-limitation-deal-with-china/",
    "description": "In a move that has ignited heated debates among experts and commentators, President Biden is set to meet with Chinese President Xi Jinping at the Asia-Pacific Economic Cooperation (APEC) summit in San Francisco to sign an agreement that would restrict the use of artificial intelligence (AI) in military applications. The deal specifically targets AI&#8217;s role ... <a title=\"Biden to Sign AI Limitation Deal with China Amidst Rising Concerns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/biden-to-sign-ai-limitation-deal-with-china/\" aria-label=\"More on Biden to Sign AI Limitation Deal with China Amidst Rising Concerns\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-15T13:06:41.000Z",
    "title": "BinaryX launches city building game Pancake Mayor on PancakeSwap’s new marketplace",
    "url": "https://www.cryptopolitan.com/binaryx-launches-city-building-game-pancake-mayor-on-pancakeswaps-new-marketplace/",
    "description": "Singapore, Singapore, November 15th, 2023, Chainwire BinaryX, a GameFi and Initial Game Offering (IGO) platform, today announced the launch of Pancake Mayor, a new city-building simulator on the newly launched PancakeSwap Gaming Marketplace.  Pancake Mayor: City Building Simulator Pancake Mayor is a free-to-play casual city-building game where players can obtain in-game currency, Mayor Cash, to ... <a title=\"BinaryX launches city building game Pancake Mayor on PancakeSwap’s new marketplace\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binaryx-launches-city-building-game-pancake-mayor-on-pancakeswaps-new-marketplace/\" aria-label=\"More on BinaryX launches city building game Pancake Mayor on PancakeSwap’s new marketplace\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-15T13:03:35.000Z",
    "title": "XRP enthusiast denounces false BlackRock XRP ETF listing",
    "url": "https://www.cryptopolitan.com/xrp-enthusiast-on-blackrock-xrp-etf-listing/",
    "description": "In a recent turn of events within the cryptocurrency community, a prominent XRP supporter known as &#8220;Dark Defender&#8221; has expressed strong disapproval towards the individuals responsible for propagating a fake listing of a BlackRock XRP ETF. This misinformation, which surfaced online, prompted a surge in the price of XRP. Dark Defender, a well-known crypto strategist, ... <a title=\"XRP enthusiast denounces false BlackRock XRP ETF listing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-enthusiast-on-blackrock-xrp-etf-listing/\" aria-label=\"More on XRP enthusiast denounces false BlackRock XRP ETF listing\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-15T12:56:33.000Z",
    "title": "BlackRock reaches police after fake XRP ETF application",
    "url": "https://crypto.news/blackrock-reaches-police-after-fake-xrp-etf-application/",
    "description": "The Delaware State Department has referred the case regarding BlackRock&#8217;s bogus application to launch an XRP-based ETF to the state DoJ. As Bloomberg analyst Eric Balchunas reported, on Nov. 13, an application from BlackRock appeared on the official website of&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-15T13:00:32.000Z",
    "title": "Red Hot Ethereum: Breach Of $2,000 Draws Major Players Into the Fray",
    "url": "https://www.newsbtc.com/news/ethereums-breach-of-2000-draws-major-players/",
    "description": "The price of Ethereum (ETH) exhibited superior performance compared to Bitcoin (BTC) in the previous week, mostly because of the registration of Blackrock&#8217;s Spot ETF, which instilled optimism that ETH will surpass its previous peak in 2023 and exceed $2,500. Related Reading: Celestia Strikes: How This Lesser-Known Coin Went Berserk With 126% Price Explosion In a groundbreaking twist since the Ethereum (ETH) Shanghai upgrade earlier this year, the value of Ether has triumphantly surpassed the $2,000 milestone, propelled by the recent surge in Bitcoin (BTC) towards the $38,000 mark. Ethereum Breaks Past $2K At the time of writing, ETH was trading at $2,054, up 7% in the last seven days, data from CoinMarketCap shows. Source: CoinMarketCap Despite the lingering uncertainty, cryptocurrency aficionados exude optimism, envisioning forthcoming profits as certain investors, driven by impatience, eagerly await the unfolding market dynamics. Cryptocurrency on-chain data analysis firm Lookonchain unveils a spectacle of whale activity amidst the surge in Ethereum prices. The report highlights notable transactions, with one whale raking in a staggering $154 million profit, while another faces a substantial loss of $183 million. Bullish or Bearish on $ETH? Did SmartMoneys and Whales buy or sell $ETH over the past week? 1/🧵 Here is a thread. pic.twitter.com/8yvCO0UI9H — Lookonchain (@lookonchain) November 14, 2023 Within the thread, Lookonchain zoomed its lens on the whale using the &#8220;0xee47&#8221; address, showcasing a remarkable uptick in their Ethereum holdings by 3,200 ETH, equivalent to an impressive $6.7 million. The buildup signifies a significant advancement subsequent to the whale&#8217;s debut venture into ETH buys on July 5, 2022. Currently, their portfolio consists of a significant amount of 183,740 ETH, which is estimated to be worth nearly $388 million. This indicates an unrealized profit of approximately $155 million. ETHUSD trading at $2,010 today. Chart: TradingView.com ETH Price Gets Boost From Spot ETF Filing Last week, the price of Ethereum experienced a significant increase, surpassing the $2,000 mark. This spike was attributed to the confirmation by BlackRock, a prominent investment management company, regarding their intentions to introduce an Ethereum Spot Exchange-Traded Fund (ETF). This confirmation was made through a filing with the NASDAQ. According to on-chain data, a group of financially astute institutional investors engaged in significant purchases of Ether over the weekend, amounting to millions of dollars. This activity is likely a response to a positive news event that has generated optimism in the market. Source: Santiment Related Reading: Immutable X Cements Position With 32% Rally – How Far Is IMX Heading? The latest on-chain data supported the positive outlook for ETH. In particular whale transactions valued over a million dollars surged to their highest levels in seven months, as shown in the chart above. Also, it was clear that the number of exchange names had grown. This supported earlier claims that whales were moving their hoards to make money. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Rhys A. via Flickr"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-15T12:54:44.000Z",
    "title": "Bitcoin’s Options Frenzy: Open Interest Hits Record-Breaking $17 Billion  ",
    "url": "https://www.crypto-news-flash.com/bitcoins-options-frenzy-open-interest-hits-record-breaking-17-billion/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoins-options-frenzy-open-interest-hits-record-breaking-17-billion",
    "description": "<img width=\"512\" height=\"307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-35.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-35.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-35-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-35-336x200.jpg 336w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Bitcoin Options sees increasing demand as the market goes past its previous all-time high of $16 billion.  Bitcoin has also been predicted to go as high as $150,000 by 2025, thanks to a possible spot Bitcoin ETF approval.  Bitcoin (BTC) is leading the general crypto market to another bull run as altcoins break yearly highs [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-15T12:59:00.000Z",
    "title": "The Biggest Crypto FUD of 2023",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/the-biggest-crypto-fud-of-2023/",
    "description": "<p>Fear, Uncertainty, and Doubt (FUD) are not new to crypto. Often, it is used to manipulate the market and control the user sentiment. Let&#8217;s analyze the biggest FUD of 2023. What&#8217;s Behind Crypto FUD in 2023? In recent news, more than 100 U.S. Senators, led by Sen. Elizabeth Warren, penned a letter to the Biden [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/the-biggest-crypto-fud-of-2023/\">The Biggest Crypto FUD of 2023</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-15T12:53:00.000Z",
    "title": "KOL Predicts OP, UNI, RUNE, and PLS to Surge in Next Bull Cycle",
    "url": "https://coinedition.com/kol-predicts-op-uni-rune-and-pls-to-surge-in-next-bull-cycle/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Altcoins Not Make States Youtuber\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>An Altcoin Daily YouTube channel host has identified a number of altcoins he expects to rally significantly during the next bull run. He categorized the crypto tokens as alternatives to more popular ones that have performed well in the past. In a recently uploaded video, the host argued that the identified crypto tokens would soar [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/kol-predicts-op-uni-rune-and-pls-to-surge-in-next-bull-cycle/\">KOL Predicts OP, UNI, RUNE, and PLS to Surge in Next Bull Cycle</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-15T12:45:42.000Z",
    "title": "Top Trader Predicts Bullish Continuation for Solana After Corrective Move, Says SOL Remains in Monster Uptrend",
    "url": "https://dailyhodl.com/2023/11/15/top-trader-predicts-bullish-continuation-for-solana-after-corrective-move-says-sol-remains-in-monster-uptrend/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Solana-After-Corrective-Move.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Solana-After-Corrective-Move.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Solana-After-Corrective-Move.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Solana-After-Corrective-Move.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Solana-After-Corrective-Move.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Solana-After-Corrective-Move.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Solana-After-Corrective-Move.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader is predicting that Solana (SOL) will resume moving to the upside after a sudden retracement. Pseudonymous analyst Bluntz tells his 228,600 followers on the social media platform X that Solana could soar by more than 22% from its current value. Bluntz utilizes the Elliott Wave theory in his technical analysis. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/15/top-trader-predicts-bullish-continuation-for-solana-after-corrective-move-says-sol-remains-in-monster-uptrend/\">Top Trader Predicts Bullish Continuation for Solana After Corrective Move, Says SOL Remains in Monster Uptrend</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]