[
  {
    "source": "Cointelegraph",
    "date": "2023-10-09T08:01:58.000Z",
    "title": "Huobi, KuCoin, over 140 crypto exchanges 'non-authorized' — UK regulator",
    "url": "https://cointelegraph.com/news/huobi-ku-coin-140-crypto-exchanges-non-authorized-uk-regulator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/b3fda6af-f707-4917-8687-e233e29b7620.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The FCA’s list of registered crypto asset providers includes 42 entities and hasn't changed since August. </p>\n                    <p><p>The United Kingdom’s financial markets regulator, The Financial Conduct Authority (FCA), had a busy Sunday on Oct. 8, adding several crypto exchanges to its <a href=\"https://www.fca.org.uk/consumers/warning-list-unauthorised-firms\" target=\"_blank\" rel=\"noopener nofollow\">warning</a> list of non-authorized firms that customers “should avoid.”</p><p>143 new entities were added to the warning list, including major exchanges such as Huobi/HTX and KuCoin, founded in China and Singapore respectively. The warning list doesn’t tell much apart from the “You should avoid dealing with this firm” imperative. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/crypto-firm-komainu-gets-registration-from-fca\"><strong><em>CoinShares-backed Komainu secures crypto custodian registration in UK</em></strong></a></p><p>However, in the U.K., firms permitted to “carry out crypto asset activities” must either be registered with the FCA or have been granted temporary status to operate. In July, Jayson Probin, crypto financial promotions lead at the FCA, <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7081969508847869952/\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> that failure to comply could result in criminal charges: </p><blockquote>“We will take robust action against persons illegally promoting to U.K. consumers. This may include, but it is not limited to, placing firms on our warning list requesting take downs of websites, social media accounts, apps and all other promotions that are in breach, and enforcement action.”</blockquote><p>In August, the FCA revealed that since 2020, it has received 291 applications for registration and approved only 38 of them, which <a href=\"https://cointelegraph.com/news/crypto-13-per-cent-of-applications-approved-british-regulator-discloses-crypto-registration-stats\">is roughly 13%</a>. At the time of publication, the FCA’s list of registered crypto asset providers <a href=\"https://register.fca.org.uk/s/search?predefined=CA\" target=\"_blank\" rel=\"noopener nofollow\">includes</a> 42 entities, such as Bitstamp, Revolut and Gemini. </p><p>PayPal has <a href=\"https://cointelegraph.com/news/paypal-uk-to-halt-crypto-purchases-until-2024\">recently halted crypto transactions</a> for its U.K. customers until it figures out how to comply with all the FCA’s requirements. Dubai-headquartered cryptocurrency exchange Bybit <a href=\"https://cointelegraph.com/news/bybit-suspend-uk-services-following-regulator-warning\">suspended all its services</a> in the United Kingdom in late September due to “regulatory changes.”</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-09T08:11:53.000Z",
    "title": "Modern Warfare 3 Beta Plagued by Cheating Issues, Alarming Players",
    "url": "https://www.cryptopolitan.com/modern-warfare-3-beta-plagued/",
    "description": "In a surprising turn of events, cheating has already reared its ugly head in this year&#8217;s Call of Duty offering, the Modern Warfare 3 beta. What&#8217;s even more surprising is that it&#8217;s not the PC market but PlayStation players who are responsible for introducing malicious activity into the beta. For years, the Call of Duty ... <a title=\"Modern Warfare 3 Beta Plagued by Cheating Issues, Alarming Players\" class=\"read-more\" href=\"https://www.cryptopolitan.com/modern-warfare-3-beta-plagued/\" aria-label=\"More on Modern Warfare 3 Beta Plagued by Cheating Issues, Alarming Players\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-09T07:49:34.000Z",
    "title": "Gitcoin’s costly mistake: $460K in GTC tokens lost in transfer error",
    "url": "https://www.cryptopolitan.com/gitcoins-460k-in-gtc-tokens-lost-in-error/",
    "description": "In a surprising turn of events, Gitcoin, a prominent crypto developer platform, has revealed that it lost approximately $460,000 worth of Gitcoin (GTC) tokens due to a critical transfer error. The incident occurred on October 6, and it has left a significant portion of the project&#8217;s funds irretrievable. Gitcoin&#8217;s project lead, CoachJonathan, made the unfortunate ... <a title=\"Gitcoin&#8217;s costly mistake: $460K in GTC tokens lost in transfer error\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gitcoins-460k-in-gtc-tokens-lost-in-error/\" aria-label=\"More on Gitcoin&#8217;s costly mistake: $460K in GTC tokens lost in transfer error\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-09T07:42:49.000Z",
    "title": "Coinbase vs SEC: The debate over crypto’s inherent value intensifies",
    "url": "https://www.cryptopolitan.com/coinbase-vs-sec-the-debate-over-cryptos-inherent-value-intensifies/",
    "description": "The U.S. Securities and Exchange Commission (SEC) has once again found itself at the center of a heated debate. During its ongoing lawsuit against Coinbase, the SEC argued that cryptocurrencies have &#8220;no innate or inherent value.&#8221;&#160; In response to Coinbase’s request for pre-trial judgment, the agency asked the court to dismiss Coinbase&#8217;s claim that crypto ... <a title=\"Coinbase vs SEC: The debate over crypto&#8217;s inherent value intensifies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-vs-sec-the-debate-over-cryptos-inherent-value-intensifies/\" aria-label=\"More on Coinbase vs SEC: The debate over crypto&#8217;s inherent value intensifies\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-09T07:51:40.000Z",
    "title": "Crypto browser Brave quietly lays off 9% of workforce",
    "url": "https://crypto.news/crypto-browser-brave-quietly-lays-off-9-of-workforce/",
    "description": "A spokesperson for the firm behind the browser said the layoffs were made due to a challenging economic environment. Brave Software, Inc., a company behind the Brave crypto web browser, reduced its workforce by 9% to optimize cost management amid&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-09T08:00:06.000Z",
    "title": "Binance CEO Foresees Monumental Bitcoin Price Shift Following Halving",
    "url": "https://www.newsbtc.com/news/binance-ceo-bitcoin-price-shift-post-halving/",
    "description": "As the crypto community&#8217;s anticipation heightens for the upcoming Bitcoin halving, Changpeng Zhao (CZ), CEO of Binance, recently elucidated his observations around the historical patterns tied to this quadrennial event. Highlighting the evolving sentiments and speculations, CZ spotlighted the dominant themes before and after the halving events. CZ observed that the preceding months to the halving are generally characterized by heightened discourse, diverse sentiments, and amplified expectations within the cryptocurrency sphere. &#8220;The few months leading up to the Bitcoin halving, there will be more and more chatter, news, anxiety, expectations, hype, hope, etc.,&#8221; he stated. Addressing the commonly held belief that Bitcoin’s price will witness an immediate uptick post-halving, CZ dispelled such notions based on historical patterns. &#8220;The day after the halving, the Bitcoin price won’t double overnight. And people will be asking why it didn’t,&#8221; he remarked, addressing the immediate aftermath expectations. Related Reading: Bitcoin Price At Risk? Whale Transfers $137 Million In BTC After 3-Year Dormancy While the short-term reactions post-halving may be tempered, CZ shed light on a longer-term trend where Bitcoin often reaches new all-time highs (ATHs) within the year that follows. In reference to the market&#8217;s ability to quickly transition from skepticism to marvel, he quipped, &#8220;People have short memories.&#8221; However, CZ urged caution, emphasizing that historical patterns should not be construed as definitive indicators for future behaviors, noting, &#8220;Not saying there is proven causation. And history does NOT predict the future.&#8221; A More In-Depth Analysis Of Bitcoin Halving As Bitcoinist reported, renowned crypto analyst Rekt Capital recently published an in-depth analysis of the Bitcoin halving, offering a more granular view of the potential phases surrounding the event which is only 197 days and a few hours away according to Binance&#8217;s estimates. Related Reading: Arthur Hayes Predicts Bitcoin Price To Hit $750,000, Here’s When Reflecting on historical patterns, the analyst suggested a possible deeper retrace for Bitcoin in the 140 days leading up to the halving. Drawing historical parallels, Rekt Capital emphasized, “You can debate whether 2023 is more like 2015 or more like 2019&#8230; Doesn’t change the fact that BTC retraced -24% in 2015 and -38% in 2019 at this same point in the cycle (i.e. ~200 days before the halving).” Anticipating market dynamics as the halving nears, Rekt Capital postulated that roughly 60 days before the event, historically a pre-halving rally will likely emerge. This phase, marked by investor enthusiasm and elevated expectations as CZ puts it, is often characterized by buying into the halving anticipation. But this enthusiastic phase doesn&#8217;t last. Around the halving event, the market often shows pullback behavior under the motto &#8220;buy the rumor, sell the news&#8221;. Highlighting this trend, the analyst cited the -38% dip witnessed in 2016 and the -20% decline in 2020, moments when the market re-evaluated the halving&#8217;s short-term implications. Subsequent to this, Rekt Capital predicts a multi-month re-accumulation phase, often marked by investor fatigue due to stagnation. However, breaking out of this phase typically heralds Bitcoin&#8217;s entry into a parabolic uptrend, potentially culminating in new all-time highs. At press time, BTC traded at $27,904. Featured image from Moneyweek, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-09T08:00:18.000Z",
    "title": "Can Dogecoin and Tradecurve Markets Reach $1? Can Axie Infinity Reach $10?",
    "url": "https://www.crypto-news-flash.com/can-dogecoin-and-tradecurve-markets-reach-1-can-axie-infinity-reach-10/?utm_source=rss&utm_medium=rss&utm_campaign=can-dogecoin-and-tradecurve-markets-reach-1-can-axie-infinity-reach-10",
    "description": "<img width=\"512\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-30.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-30.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-30-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Dogecoin, Axie Infinity, and Tradecurve Markets are popular names in the crypto space. Currently, analysts have been evaluating their price movements in the past months. Investors are currently wondering if Dogecoin and Tradecurve Markets can reach $1 before the end of 2023. Also, investors are evaluating whether Axie Infinity can reach $10 before the end [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-09T07:51:56.000Z",
    "title": "XRP Lawyer Flags SEC’s Precarious Position in the Ripple Case",
    "url": "https://coinedition.com/xrp-lawyer-flags-secs-precarious-position-in-the-ripple-case/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Arch_rivals_XRP_and_the_SEC_are_set_for_an_epic_showdown.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SEC vs XRP: Judge Torres Rejects Comparison to Terraform and LBRY\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Arch_rivals_XRP_and_the_SEC_are_set_for_an_epic_showdown.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Arch_rivals_XRP_and_the_SEC_are_set_for_an_epic_showdown-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Arch_rivals_XRP_and_the_SEC_are_set_for_an_epic_showdown-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Arch_rivals_XRP_and_the_SEC_are_set_for_an_epic_showdown-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Arch_rivals_XRP_and_the_SEC_are_set_for_an_epic_showdown-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>XRP attorney Jeremy Hogan, in a recent set of sarcastic comments, unveiled his perspectives on the precarious plight of the Securities and Exchange Commission (SEC) following the court’s denial of the regulator’s interlocutory appeal. Eliminating the prevailing confusion regarding the possible outcome of the SEC-Ripple lawsuit, the lawyer asserted that the best possible option for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-lawyer-flags-secs-precarious-position-in-the-ripple-case/\">XRP Lawyer Flags SEC’s Precarious Position in the Ripple Case</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]