[
  {
    "source": "Cointelegraph",
    "date": "2023-05-30T06:50:00.000Z",
    "title": "Popular NFT collections take massive hit in price in 2023",
    "url": "https://cointelegraph.com/news/popular-nft-investments-take-a-massive-hit-in-2023",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/96bf511d-f19a-494b-b146-6abceafe5b6b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Investments in top NFT projects, such as Doodles, Invisible Friends, Moonbirds and Goblintown, have lost up to 95% of their value in ETH.</p>\n                    <p><p>Some of the most sought-after <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a> of 2022 have taken a massive hit in terms of value over the past year. The trend mirrors the <a href=\"https://cointelegraph.com/news/top-metaverse-property-investments-suffer-massive-losses-report\">depreciating value of metaverse properties in 2023</a>, which were considered top virtual lands for investment in 2022.</p><p>Investments in top NFT projects, such as Doodles, Invisible Friends, Moonbirds and Goblintown, have lost up to 95% of their value in Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). The value of blue chip NFT collections alone has fallen down by over 40% on average.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The biggest NFTs of 2022 have had a TOUGH 2023. <br><br>Doodles...<br>23 ETH  2.3 ETH <br><br>Invisible Friends... <br>8 ETH  1.15 ETH<br><br>Moonbirds...<br>32 ETH  2 ETH<br><br>Goblintown...<br>6 ETH  .26 ETH <a href=\"https://t.co/5Fr9BMhmkg\">pic.twitter.com/5Fr9BMhmkg</a></p>&mdash; HashBastards NFTs  (@HashBastardsNFT) <a href=\"https://twitter.com/HashBastardsNFT/status/1660377607462846467?ref_src=twsrc%5Etfw\">May 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Data from NFTGo shows that the Blue Chip Index went down to 7,446 ETH from its yearly high of 12,394 ETH back in July 2022.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/9993930a-83d4-4405-80ae-3616c3018e5c.png\"  /><figcaption style=\"text-align: center;\"><em>Blue Chip Index calculated by weighting the market cap (ETH/USD) of blue chip collections. Source: NFTGo</em></figcaption></figure><p>Surprisingly, NFT investors remain unfazed by the ongoing decline in value. While some expect further and prolonged depreciation of NFT prices, a handful of investors believe it's the right time to invest as they anticipate a comeback.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/7b4b98ec-ac02-49a1-8791-1c8fe74d1329.png\"  /><figcaption style=\"text-align: center;\"><em>Holders and traders of blue chip NFTs. Source: NFTGo</em></figcaption></figure><p>On the contrary, the total number of blue chip NFT holders over the past year have increased by more than 90%. During this timeline, the number of sellers increased by 32% while buyers decreased by 30%.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-price-hits-27-2k-but-new-analysis-warns-more-losses-likely\"><strong><em>Bitcoin price hits $27.2K, but new analysis warns more losses ‘likely’</em></strong></a></p><p>Despite the financial setbacks, the NFT ecosystem continues to draw attention of new investors. On May 27, crypto skeptic Peter Schiff launched an NFT project on the Bitcoin blockchain via Ordinals.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BREAKING: ORDINALS ENJOYERS MANAGE TO ON-BOARD PETER SCHIFF TO BITCOIN IN 3 MONTHS; LASER-EYES SEETHING AFTER FAILING TO GET HIM TO JOIN FOR 10 YEARS <a href=\"https://t.co/rbWPhXJYD2\">pic.twitter.com/rbWPhXJYD2</a></p>&mdash; Udi Wertheimer ‍♂️ (@udiWertheimer) <a href=\"https://twitter.com/udiWertheimer/status/1662228275211501568?ref_src=twsrc%5Etfw\">May 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Schiff unveiled the “Golden Triumph” NFT collection depicts a human hand holding a bar of gold to be sold via a two-part auction starting on June 2 and ending on June 9.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-30T06:49:41.000Z",
    "title": "Gulf Binance Secures Regulatory Approval in Thailand",
    "url": "https://cryptodaily.co.uk/2023/05/gulf-binance-secures-regulatory-approval-in-thailand",
    "description": "<p>Gulf Binance, a partnership between crypto exchange Binance and Gulf Energy&rsquo;s innovation division, Gulf Innova, received approval in Thailand for a digital asset operator license. </p>\n<p>Thailand&rsquo;s Ministry of Finance recently approved Gulf Binance Co., Ltd, a joint venture between cryptocurrency exchange Binance and Gulf Innova, for a digital asset operator license. The approval from Thai regulators gives the firm the green light to advance plans to open a regulated digital asset exchange and broker in the country.</p>\n<p>A blog post announcing the news said the platform aims to launch by Q4 2023 and is to be regulated by the Thai Securities and Exchange Commission (SEC).</p>\nCreating Value for Thailand\n<p>Binance and Gulf reached an agreement to create a joint venture in 2022 and have since been working closely with Thai regulators to establish a fully-compliant exchange that strictly adheres to the SEC&rsquo;s guidelines.</p>\n<p>The collaboration brings Binance&rsquo;s expertise in the digital asset and crypto space together with Gulf&rsquo;s local industry knowledge and established Thai presence. The joint venture aims to &ldquo;drive innovation, foster growth, and deliver the best value possible to Thai users.&rdquo;</p>\n<p>Binance&rsquo;s Head of Asia, Europe, and MENA, Richard Teng, commented on the regulatory approval saying:</p>\n\n<p>We are grateful and honored to be granted digital asset operator licenses for Gulf Binance in Thailand &mdash; a country with a thriving crypto space that has demonstrated strong commitment in embracing blockchain technology.</p>\n\n<p>Adding,</p>\n\n<p>By harnessing Binance&rsquo;s expertise together with Gulf&rsquo;s established local presence and network, Gulf Binance aims to showcase the full potential of blockchain technology to meet the needs of Thai users. Local users can expect access to a trusted and regulated service that prioritizes user security alongside compliance with local regulations.</p>\n\nThailand Warms to Digital Assets\n<p>The Southeast Asian nation has been warming up to the digital asset space and has committed to promoting security and regulatory compliance while fostering and encouraging innovation in the digital space as it recognizes blockchain&rsquo;s transformative potential in the country.</p>\n<p>The Thai cabinet recently agreed to waive income and value-added tax for companies that issue digital investment tokens. Although the government would lose out on a significant amount of tax revenue, the move signifies the government&rsquo;s willingness to foster growth within the industry.</p>\n<p>Cryptocurrencies and digital assets have gained massively in popularity after the Thai SEC started regulating the sector. In March 2022, the regulatory body eased crypto regulations to promote industry growth. The relaxed rules meant that the tax burden on crypto investors in Thailand was lowered from April 2022 until the end of 2023.</p>\n<p>However, following the turmoil witnessed in the industry in 2022, Thai regulators and the central banks were forced to implement stricter policies to deal with the difficulties. The SEC announced a total ban on using crypto for payments, arguing it could impact the country&rsquo;s financial stability and the overall economy.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-30T07:04:45.000Z",
    "title": "It Really Is Time for Bitcoin (BTC) To Rise, Says Veteran Trader Tone Vays – Here’s His Target",
    "url": "https://dailyhodl.com/2023/05/30/it-really-is-time-for-bitcoin-btc-to-rise-says-veteran-trader-tone-vays-heres-his-target/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/tim-for-btc-rise.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/tim-for-btc-rise.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/tim-for-btc-rise.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/tim-for-btc-rise.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/tim-for-btc-rise.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/tim-for-btc-rise.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/tim-for-btc-rise.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Veteran crypto trader Tone Vays believes that Bitcoin (BTC) is now in a position to resume its uptrend following weeks of consolidation. In a new strategist session, Vays tells his 122,00 YouTube subscribers that while Bitcoin is in a &#8220;buy-the-dip situation,&#8221; he prefers it if BTC started flashing signs of strength. According to the crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/30/it-really-is-time-for-bitcoin-btc-to-rise-says-veteran-trader-tone-vays-heres-his-target/\">It Really Is Time for Bitcoin (BTC) To Rise, Says Veteran Trader Tone Vays – Here’s His Target</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]