[
  {
    "source": "NewsBTC",
    "date": "2023-08-18T04:04:45.000Z",
    "title": "Ethereum Price Trend Overwhelmingly Negative As Bears Aim $1,500",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-negative-1500/",
    "description": "Ethereum price declined heavily below $1,800 and $1,700 against the US Dollar. ETH could resume its decline and test the $1,500 support zone. Ethereum is gaining bearish momentum below the $1,750 and $1,800 resistance levels. The price is trading below $1,750 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance near $1,750 on the hourly chart of ETH/USD (data feed via Kraken). The pair could resume its decline and visit the $1,500 support in the near term. Ethereum Price Nosedives Ethereum’s price started a major decline after it broke the $1,800 support zone. ETH gained bearish momentum after it traded below the $1,720 support, similar to Bitcoin. The bears even pushed the price below the $1,600 level. Finally, it tested the $1,520 zone. A low is formed near $1,517 and the price is now attempting a recovery wave. There was a move above the $1,600 level. The price is now trading above the 50% Fib retracement level of the downward move from the $1,826 swing high to the $1,517 low. Ether is now trading below $1,750 and the 100-hourly Simple Moving Average. There is also a key bearish trend line forming with resistance near $1,750 on the hourly chart of ETH/USD. On the upside, the price might face resistance near the $1,700 level. It is close to the 61.8% Fib retracement level of the downward move from the $1,826 swing high to the $1,517 low. The next resistance is near $1,750 or the trend line. Source: ETHUSD on TradingView.com A close above the $1,750 level could start a decent increase in the near term. The next major resistance is near the $1,800 level and the 100-hourly Simple Moving Average. Any more gains might send the price toward the $1,820 resistance, above which the price could rise toward the $1.880 zone. Fresh Decline in ETH? If Ethereum fails to clear the $1,750 resistance, it could continue to move down. Initial support on the downside is near the $1,620 level. The first major support is near the $1,550 zone. If the bulls fail to protect the $1,550 support, there could be more losses. The next major support is near the $1,520 support level. Any more losses might send the price toward the $1,500 level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,620 Major Resistance Level – $1,750"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-18T03:40:22.000Z",
    "title": "10 Marketing Tips That Can Increase Exposure in Web 3.0",
    "url": "https://dailyhodl.com/2023/08/17/10-marketing-tips-that-can-increase-exposure-in-web-3-0/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/best-Marketing-Campaign-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/best-Marketing-Campaign-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/best-Marketing-Campaign-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/best-Marketing-Campaign-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/best-Marketing-Campaign-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/best-Marketing-Campaign-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/best-Marketing-Campaign-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The rapid rise of Web 3.0 technology has revolutionized the way we interact with digital platforms, creating new avenues for innovation and engagement. Amid this transformative landscape, the pursuit of increased exposure has become paramount for Web 3.0 projects seeking to stand out. To secure that, an approach that blends established marketing methods with fluency [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/17/10-marketing-tips-that-can-increase-exposure-in-web-3-0/\">10 Marketing Tips That Can Increase Exposure in Web 3.0</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]