[
  {
    "source": "NewsBTC",
    "date": "2023-08-26T22:00:38.000Z",
    "title": "PEPE Price Spikes 10% Following Community Address On Rumored Rug Pull",
    "url": "https://www.newsbtc.com/news/pepe-price-spikes-10-following-community-address-on-rumored-rug-pull/",
    "description": "The value of PEPE, one of the most promising assets in the second quarter of 2023, has been faltering in recent weeks. According to CoinGecko data, the meme coin has been in a 33.6% price decline in the last 14 days. The PEPE price took a significant hit in the past week, tumbling by more than 20% in a matter of hours. This negative price action was triggered by the rumors of a rug pull orchestrated by the project deployers.  On Thursday, August 24, about $16 million worth of Pepe tokens were moved from the developers’ multi-sig wallet to various crypto exchanges, spreading FUD (fear, uncertainty, and doubt) across the community. The team behind the meme coin has now published an announcement, addressing the community on what happened in the past few days. &#8216;Three Rouge Ex-Team Members Responsible For $16 Million Withdrawal&#8217; On Saturday, August 26, one of the anonymous developers behind the Pepe project shed more light on the mysterious $16 million withdrawal from the project’s multi-sig wallet via a post on the official X (formerly Twitter) account. Related Reading: XRP Epic Price Setup: Accumulation Surge Paves The Way For Imminent Price Blast According to the team member, three ex-team members initiated a series of unexpected withdrawal transactions and transferred the “stolen” Pepe tokens to various crypto exchanges. A part of the community address explained: The multi-sig (wallet) was set up to require 3/4 signers present for an approval. Yesterday these 3 ex-team members came back behind my back, logged onto the multi-sig, stole 16 Trillion/ 60% of the 26 trillion multi-sig tokens, and sent them to exchanges to sale. They then removed themselves from the multi sig in an attempt to absolve any association to $PEPE, deleting all of their social accounts and leaving me behind nothing but a message stating “the multi-sig (wallet) has been updated, you are now in full control.” The anonymous developer established that these former members have been difficult to work with since the inception of the Pepe project. “There has often been conflict, and the majority of the team involved in $PEPE creation started to distance themselves after the first week of project inception”, they said. While apologizing for the inconvenience and losses caused by the “bad actors,” the project member claims that the remaining 10 trillion Pepe tokens in the multi-sig are “safe” and out of the reach of “nefarious” ex-team members. Unsurprisingly, the online crypto community had mixed reactions to the project developer&#8217;s address. While some individuals seemed convinced by the team member’s account, others raised questions about the sincerity of the claims. PEPE Jumps By Nearly 10% &#8211; Is A Recovery On? The value of PEPE reacted positively to this address, surging by about 9.6% to reach $0.000000956641. Although it has experienced some correction, the meme coin&#8217;s price is still well (roughly 9%) above its seven-day low of $0.000000824545 reached in the early hours of Friday, August 25. As inferred earlier, panic-induced selling was primarily responsible for the recent PEPE price crash. With confidence seemingly restored, investors will likely be banking on a price recovery. Related Reading: Economic Reset Alert: Bloomberg Analyst Predicts Bitcoin Crash Below $10,000 Fortunately, the daily Relative Strength Index (RSI), an indicator that tracks the balance between the buying and selling pressure of a token, is in the oversold zone for the first time ever. When in the oversold region, the RSI often signals that a trend reversal is on the horizon. According to CoinGecko data, PEPE currently trades at $0.000000898317, registering a 1.4% price jump in the last 24 hours. With a market cap of roughly $375.9, the meme coin is the 97th-largest cryptocurrency on the market. PEPEUSDT at $0.00000088951 &#124; Source: daily PEPEUSDT chart on TradingView &#160; Featured image from Unsplash, chart from TradingView"
  }
]