[
  {
    "source": "CryptoSlate",
    "date": "2023-12-11T07:00:09.000Z",
    "title": "Liquidium secures $1.25M pre-seed funding for Bitcoin Ordinal lending",
    "url": "https://cryptoslate.com/liquidium-secures-1-25m-pre-seed-funding-for-bitcoin-ordinal-lending/",
    "description": "<p>In a significant leap for Bitcoin&#8217;s lending sector, Liquidium, a burgeoning startup, has successfully raised $1.25 million in a pre-seed funding round. This capital injection marks a pivotal moment for the company as it sets its sights on pioneering a novel lending framework utilizing Bitcoin&#8217;s ordinal technology. The successful funding round was bolstered by the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/liquidium-secures-1-25m-pre-seed-funding-for-bitcoin-ordinal-lending/\">Liquidium secures $1.25M pre-seed funding for Bitcoin Ordinal lending</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-11T07:08:12.000Z",
    "title": "BitTorrent emerges as top gainer with cooldown is expected",
    "url": "https://crypto.news/bittorrent-emerges-as-top-gainer-with-cooldown-is-expected/",
    "description": "BitTorrent (BTT) has been constantly rising over the past few days, registering a 168% rise over the past month. A key indicator may however suggest a price cooldown is imminent. BTT is up by 17% in the past 24 hours&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-11T07:04:45.000Z",
    "title": "Hold Your Horses: Bitcoin Could Fall Back To Under $38,000, These Analysts Say",
    "url": "https://www.newsbtc.com/news/hold-your-horses-bitcoin-could-fall-back-to-under-38000-these-analysts-say/",
    "description": "Over the past 24 hours, the cryptocurrency market has witnessed Bitcoin consolidating its position in the digital financial space. Amidst a wider cryptocurrency selloff, Bitcoin offered yet another example of its infamous volatility, plunging sharply toward the $40,000 region. The leading cryptocurrency saw an 8% decline to $41,900 before reversing part of the losses and opening Monday&#8217;s trading 5% down at $42,090. Related Reading: Ethereum Rises: ETH Remains Steady At Over $2,300 Amid Bull Market Expectations Bitcoin Momentum Could Lose Steam CoinGecko&#8217;s price updates show that Bitcoin has only shown slight variations over this period, indicating that it is in an equilibrium phase after its recent price spikes. The subtle fluctuations in the price of Bitcoin indicate not just a break but also a chance for market players to evaluate the situation as it stands. The well-known cryptocurrency trader Josh Olszewicz, who goes by the handle CarpeNoctom on X, completed an empirical study that suggests there is a considerable chance that Bitcoin (BTC) could collapse and possibly drop below the $38,000 mark. $BTC bear case = 35.7k (daily Kijun) SL on longs prob prudent around 42.8k pic.twitter.com/NqyLsJS9Nq — Josh Olszewicz (@CarpeNoctom) December 10, 2023 Based on his analysis of the daily Kijun line—a pivotal technical signal in the world of cryptocurrency trading—Olszewicz maintains a gloomy outlook. A crucial medium-term trend indication in cryptocurrency trading is the Kijun Line, which is a component of the Ichimoku Cloud indicator. Averaging the highest high and lowest low across 26 periods, it helps traders determine levels of support and resistance as well as the general direction of the trend. Bitcoin slightly below the $42K level today. Chart: TradingView.com Prices may suggest a bullish or bearish trend depending on whether they are above or below the Kijun Line. When Goichi Hosoda created the Ichimoku Cloud in the late 1930s, the Kijun Line was one of the main components. Share this chart with your financial advisors (and the disclosures below). Based on your risk tolerance and investment objectives, the addition of #Bitcoin, even in small increments like 0.5%, 1.5%, 2.5%, and 3%, has the potential to alter the dynamics of the traditional 60/40… pic.twitter.com/mfLFsmD4LK — VanEck (@vaneck_us) December 10, 2023 Meanwhile, prominent asset management company VanEck has emphasized that Bitcoin&#8217;s (BTC) historical performance does not guarantee future outcomes. Dark Road Ahead? This word of caution is important because VanEck is investigating the possible effects of adding Bitcoin to conventional portfolios, which puts the typical 60/40 investment approach to the test. Related Reading: Cardano Rises $56% To Dominate Weekend’s Top 10 Roster – Details Justin Bennett, another cryptocurrency trader and analyst, is issuing an alert that Bitcoin (BTC) might revers its upward trajectory following another surge. Share this chart with your financial advisors (and the disclosures below). Based on your risk tolerance and investment objectives, the addition of #Bitcoin, even in small increments like 0.5%, 1.5%, 2.5%, and 3%, has the potential to alter the dynamics of the traditional 60/40… pic.twitter.com/mfLFsmD4LK — VanEck (@vaneck_us) December 10, 2023 Bennett informs his 110,600 X social media followers that Bitcoin may rise one more time before making a correction. The analyst provides a chart demonstrating how, on the daily chart, Bitcoin is presently trading inside a sizable ascending channel, with the pattern&#8217;s horizontal resistance located at roughly $48,000. Based on the trader&#8217;s chart, it appears that he believes that after reaching his upside target, Bitcoin will drop below $38,000. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-11T07:04:31.000Z",
    "title": "LINK, ADA, Nosedive, as Market Liquidation Runs Into Millions",
    "url": "https://coinedition.com/link-ada-nosedive-as-market-liquidation-runs-into-millions/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Ada-Link-and-Qnt-Fall-as-Fear-Reigns-Over-Crypto-Market.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Ada-Link-and-Qnt-Fall-as-Fear-Reigns-Over-Crypto-Market.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Ada-Link-and-Qnt-Fall-as-Fear-Reigns-Over-Crypto-Market-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Ada-Link-and-Qnt-Fall-as-Fear-Reigns-Over-Crypto-Market-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Ada-Link-and-Qnt-Fall-as-Fear-Reigns-Over-Crypto-Market-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Ada-Link-and-Qnt-Fall-as-Fear-Reigns-Over-Crypto-Market-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>After enjoying an extended uptrend period, major altcoins, including Cardano (ADA) and Chainlink (LINK), are falling apart. Although other major altcoins are not left out, ADA and LINK are two of the most affected out of the top 20 cryptocurrencies. At press time, LINK was down 8.13% in the last 24 hours while trading at [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/link-ada-nosedive-as-market-liquidation-runs-into-millions/\">LINK, ADA, Nosedive, as Market Liquidation Runs Into Millions</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]