[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-29T04:30:01.000Z",
    "title": "Binance Abandons Planned Delisting of Some Privacy Coins in EU Markets",
    "url": "https://news.bitcoin.com/binance-abandons-planned-delisting-of-some-privacy-coins-in-eu-markets/",
    "description": "<img width=\"768\" height=\"433\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2068716308-768x433.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance Abandons Planned Delisting of Some Privacy Coins in EU Markets\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2068716308-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2068716308-1024x578.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2068716308-768x433.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2068716308-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2068716308-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2068716308-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2068716308.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Cryptocurrency exchange Binance has reconsidered a decision to delist some privacy tokens in several European markets. The leading coin trading platform will continue to offer trading in these digital assets after revising their classification to comply with EU regulations. Binance to Continue Support for Certain Privacy Coins Despite Earlier Intentions to Remove Them The world&#x2019;s [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-29T04:26:27.000Z",
    "title": "Ethereum Price Grinds Lower As The Bulls Take Back Seat",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-grinds-lower-1790/",
    "description": "Ethereum price is slowly moving lower below the $1,880 level against the US Dollar. ETH is still at risk of a move toward the $1,790 support. Ethereum is moving lower from the $1,920 resistance. The price is trading below $1,880 and the 100-hourly Simple Moving Average. There is a short-term bearish trend line forming with resistance near $1,840 on the hourly chart of ETH/USD (data feed via Kraken). The pair could decline further toward the $1,790 support in the near term. Ethereum Price Moves Toward $1,790 Ethereum’s price remained well below the key $1,920 resistance zone. ETH slowly moved lower below the $1,880 and $1,865 levels. It even traded to a new weekly low below $1,840, unlike Bitcoin. A low is formed near $1,817 and the price is now consolidating losses. The price is trading below the 23.6% Fib retracement level of the recent drop from the $1,912 swing high to the $1,817 low. There is also a short-term bearish trend line forming with resistance near $1,840 on the hourly chart of ETH/USD. Ether is showing bearish signs below $1,880 and the 100-hourly Simple Moving Average. If Ethereum manages to stay above $1,820, it could rise again. Immediate resistance is near the $1,845 level or the trend line. The next major resistance is near the $1,865 level and the 100-hourly Simple Moving Average. It is close to the 50% Fib retracement level of the recent drop from the $1,912 swing high to the $1,817 low. Source: ETHUSD on TradingView.com The first key resistance is near the $1,880 level. The key breakout zone is still near the $1,920 and $1,930 levels. A close above the $1,930 zone could start a fresh rally. The next resistance sits near $2,000, above which the price could rise toward the $2,050 level. Any more gains could send Ether toward the $2,120 resistance. More Losses in ETH? If Ethereum fails to clear the $1,865 resistance, it could continue to move down. Initial support on the downside is near the $1,820 level. The next major support is near the $1,790 level. If there is a move below $1,790, the price could drop toward $1,740. Any more losses may perhaps send the price toward the $1,720 support. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,790 Major Resistance Level – $1,865"
  }
]