[
  {
    "source": "NewsBTC",
    "date": "2024-01-24T01:00:53.000Z",
    "title": "Ethereum Whale Transfers Across Exchanges And DeFi, What Is Going On?",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-whale-transfers-across-exchanges-and-defi-what-is-going-on/",
    "description": "An Ethereum (ETH) whale has recently executed a series of transactions, carrying out a considerable movement of funds across various platforms. The blockchain analytics platform Spot On Chain initially brought to light this activity, involving roughly $46.02 million in ETH tokens. Deciphering The Whale&#8217;s $46M ETH Transfer Across Major Platforms The whale, operating through a network of eight wallets, initiated the withdrawal of these funds from major exchanges, Binance and Bitfinex. The complexity of these transactions did not end there. Following the withdrawals at an average price of around $2,419 per ETH, the whale engaged with Lido, a prominent liquid staking solution. Related Reading: Ethereum’s Tipping Point: Analyst Warns Of Steep Drop To $2,000 This move involved withdrawing 50.15 million USDT from Aave, a well-known decentralized finance (DeFi) protocol, and exchanging the stablecoin for 19,021 ETH, amounting to $46.02 million. Spot On Chain also revealed that three wallets still hold about 30 million USDT in Aave. Over the past 2 days, an entity with 8 wallets withdrew $46.02M in $ETH from #Binance and #Bitfinex at ~$2,419, then staked with #Lido: &#8211; 5 wallets withdrew 50.15M $USDT from #Aave to CEX for 19,021 $ETH ($46.02M). &#8211; 3 wallets still hold ~30M $USDT in #Aave and may deposit it… pic.twitter.com/vqPYTTaWjT — Spot On Chain (@spotonchain) January 23, 2024 This lingering balance has sparked curiosity as it might indicate that these funds might soon be deployed into a centralized exchange (CEX) for further acquisition of Ethereum. The context of these whale movements is particularly crucial, considering the current market conditions Ethereum is experiencing. Over the last 24 hours, Ethereum&#8217;s price has dropped by 7.7% to trade at $2,211. This bearish trend is not isolated, as the entire crypto market, led by Bitcoin, appears to be in a downturn. Based on the key support zone between $2,380 and $2,461 highlighted by crypto analyst Ali, Ethereum appears to have breached a critical demand zone. This break could lead to a further plunge towards the $2,000 mark, escalating concerns about a bigger correction. Ethereum Plunge: Liquidations Amid Sell-offs The Ethereum market has seen a dip in value and a noticeable impact on traders. Data from Coinglass highlights that the recent market conditions have led to significant liquidations. In just 24 hours, over 137,000 traders were liquidated, amounting to $357 million. Ethereum traders bear a significant portion of these total liquidations, with long and short traders suffering $72.82 million and 6.30 million in liquidations, respectively, in the past 24 hours. Interestingly, these market conditions have coincided with notable actions by Celsius, a crypto lending firm currently navigating financial challenges. Recent on-chain analysis indicated that Celsius has been actively moving large sums of Ethereum, including a 13,000 ETH deposit on Coinbase. The #Celsius wallet deposited 13K $ETH($30.34M) to #Coinbase and 2,200 $ETH($5.13M) to #FalconX again in the past 10 hours. Currently, 2 staking wallets of #Celsius still hold 557,081 $ETH($1.3B). Address:https://t.co/3gGOucC9gYhttps://t.co/zodN4gzVHKhttps://t.co/Jjt9fCN2Ej pic.twitter.com/E9DIZ9KDAH — Lookonchain (@lookonchain) January 23, 2024 This aligns with reports from Arkham Intelligence, which noted that Celsius liquidated over $125 million in Ethereum to address its financial obligations. This auction was primarily geared towards paying off creditors, aligning with the firm&#8217;s bankruptcy proceedings. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-24T01:00:31.000Z",
    "title": "Analyst Predicts Over 100% Rally for ETH-Based Altcoin, Updates Forecast on Sui, Arbitrum and One Other Crypto",
    "url": "https://dailyhodl.com/2024/01/23/analyst-predicts-over-100-rally-for-eth-based-altcoin-updates-forecast-on-sui-arbitrum-and-one-other-crypto/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/rally-updates-sui-one.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/rally-updates-sui-one.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/rally-updates-sui-one.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/rally-updates-sui-one.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/rally-updates-sui-one.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/rally-updates-sui-one.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/rally-updates-sui-one.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst thinks that an altcoin running on the Ethereum (ETH) network is gearing up for a big surge in price. Trader Michaël van de Poppe tells his 685,500 followers on the social media platform X that the decentralized oracle network Chainlink (LINK) looks poised for a 2x rally. According to Van [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/23/analyst-predicts-over-100-rally-for-eth-based-altcoin-updates-forecast-on-sui-arbitrum-and-one-other-crypto/\">Analyst Predicts Over 100% Rally for ETH-Based Altcoin, Updates Forecast on Sui, Arbitrum and One Other Crypto</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]