[
  {
    "source": "CryptoGlobe",
    "date": "2024-01-29T23:41:07.000Z",
    "title": "Crypto Trader Nets $1.6 Million in Just 14 Hours From Trading Solana-Based Memecoin",
    "url": "https://www.cryptoglobe.com/latest/2024/01/crypto-trader-nets-1-6-million-in-just-14-hours-from-trading-solana-based-memecoin/",
    "description": "A cryptocurrency trader has recently managed to make over $1.6 million by trading the Solana-based meme-inspired cryptocurrency Wen ($WEN) by buying it just after it opened for trading and selling it right after to realize their gains. According to on-chain analysis service Lookonchain, the trader spent $125,500 worth of the USDC stablecoin to buy 20 […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-30T00:00:33.000Z",
    "title": "This Banking Giant Files For Bitcoin ETF Application In Hong Kong",
    "url": "https://www.newsbtc.com/bitcoin-news/this-banking-giant-files-for-bitcoin-etf-application-in-hong-kong/",
    "description": "Following the recent approval of spot Bitcoin ETF (Exchange-Traded Funds) in the US and guidelines from Hong Kong’s Securities and Futures Commission (SFC) published in December of 2023, there has been increasing speculation about the launch of a spot Bitcoin ETF in Hong Kong this year. In a recent development, the first spot Bitcoin ETF application has been filed to the SFC for approval. Related Reading: BlackRock’s IBIT Maintains Lead In Bitcoin ETF Market, Crosses $2 Billion In Inflows Chinese Financial Giant Takes The Lead Earlier this month, Venture Smart Financial Holdings Ltd. (VSFG) expressed its plans to apply for a spot Bitcoin ETF with the SFC to be launched this quarter. Similarly, asset management firms like Samsung Asset Management have shown their interest in exploring the possibility in the future.  A report from Tencent News revealed that Harvest Fund Management sent the first-ever spot Bitcoin ETF application in Hong Kong to the SFC on January 26, with the possibility of approval coming after the Lunar New Year at the earliest. According to the news site, Hong Kong’s SFC wants to accelerate the approval of the first ETF after the US Securities and Exchange Commission (SEC) authorized the listing of the spot crypto products this month. The regulator’s plan includes listing the first ETF on the Hong Kong Stock Exchange after the Spring Festival. Additionally, the report highlights the possibility of the SFC taking the same route as the US SEC and approving all applications simultaneously. How Will Hong Kong’s Spot ETFs Compare To The US? Regarding the performance of the investment products after the approval, a Hong Kong fund professional told Tencent News that “judging from the performance of the U.S. Bitcoin spot ETF, even if the Hong Kong Securities and Futures Commission approves multiple institutions at once, it may end up performing about the same as the U.S. market.” However, some family office investor managers in Hong Kong suggested to the news site that “there may be some gap between the scale of Hong Kong spot ETF subscriptions and the United States.” The investor managers added that there’s real interest in subscribing to spot ETFs in Hong Kong, opposite to the “complexity of investment categories and operations” that stopped them from investing in the Bitcoin market before. Moreover, the news sites reported that “compared with spot ETFs in the United States, in addition to accepting legal currency subscriptions, Hong Kong&#8217;s spot ETFs may also increase the possibility of direct Bitcoin subscriptions.” Despite the interest and plans previously suggested by other investment and asset management firms, no organization has applied for a Spot Bitcoin ETF yet. Harvest Fund Management and the SFC haven’t issued further comment. Related Reading: XRP ETF Key Requirements For Spot XRP ETF Approval Revealed Amidst 4500% Price Surge Target Bitcoin is trading at $43,006.2 in the hourly chart. Source: BTCUSDT on TradingView.com Featured image from Unsplash.com, Chart from Tradingview.com"
  }
]