[
  {
    "source": "CryptoGlobe",
    "date": "2023-06-21T00:30:00.000Z",
    "title": "FTX’s Bankruptcy Costs Pile Up as Legal and Advisory Fees Hit $121.8 Million",
    "url": "https://www.cryptoglobe.com/latest/2023/06/ftxs-bankruptcy-costs-pile-up-as-legal-and-advisory-fees-hit-121-8-million/",
    "description": "The legal and advisory bills for the defunct cryptocurrency exchange FTX are rapidly accumulating, with data showing that between February 1 and April 30, advisory fees and costs totaled a staggering $121.8 million. According to data from The Block, legal representation from Sullivan &amp; Cromwell was a significant contributor to the expenses, with the firm […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-21T00:30:51.000Z",
    "title": "Polygon Labs Unveils Major Upgrade To Sidechain With ‘zkEVM Validium’ Layer 2",
    "url": "https://www.newsbtc.com/matic/polygon-labs-unveils-major-upgrade-to-sidechain-with-zkevm-validium-layer-2/",
    "description": "Polygon Labs, the engineering team behind the popular Polygon PoS (Proof of Stake) chain, has proposed a major upgrade to the network.  The upgrade would introduce a “first-of-its-kind” decentralized L2 (Layer 2) secured by zero-knowledge (ZK) proofs, making the Polygon ecosystem more secure, performant, and a core part of the upcoming Polygon 2.0 ecosystem. This upgrade marks a significant milestone in the blockchain industry, as it would be the first time an existing chain, especially of this size and importance, adds ZK proofs to become an L2.  Related Reading: Stacks (STX) Registers 11% Gains As Broader Market Suffers Volatility Polygon Labs Sets The Bar High Per the announcement, the upgrade proposes using a zkEVM validium, a lower-cost, higher-throughput sibling of a rollup. Rollups, such as Polygon zkEVM, leverage Ethereum to publish transaction data and verify proofs, inheriting its security and decentralization.  Moreover, the upgrade will involve the migration of Polygon&#8217;s existing PoS to a new PoS network that utilizes the zkEVM technology. The upgraded PoS network, or validium, will operate alongside Polygon&#8217;s existing zkEVM rollup network, offering users the benefits of both technologies depending on their specific needs. Existing Polygon PoS validators will play two critical roles in the upgraded ecosystem, guaranteeing data availability and sequencing transactions. By attesting to data availability, Polygon PoS will become the first validium with decentralized and secure data availability guarantees.  Validators will also operate the chain by deciding which transactions to include in a block and in which order, preserving decentralization and ensuring that transaction fees flow to MATIC-staked validators. This would make Polygon PoS the first L2 with a decentralized sequencer set. Furthermore, the upgraded PoS network will offer high scalability and low fees, making it an ideal fit for applications with high transaction volume and requiring low transaction fees, such as Web3 gaming and social and micro Decentralized Finance (DeFi). Meanwhile, the existing zkEVM rollup network will continue to offer a high level of security, making it a good solution for applications that process high-value transactions and prioritize security, such as high-value DeFi applications. Polygon’s 2.0 vision for scalability and unified liquidity, powered by ZK technology, aims to make every Polygon chain a ZK L2. However, Polygon PoS, in its current state, is secured by its validators, not by ZK proofs.  Related Reading: Cardano Poised For Consolidation In This Price Zone Prior To Attempting Reversal According to the announcement, the upgrade is currently in the Pre-Polygon Improvement Proposal (PIP) stage, with the proposal already live on the governance forum. Assuming it gathers significant support from the community, a formal PIP will be put forward, initiating the prescribed processes.  The proposal will then be discussed on PPG (Polygon Protocol Governance) Calls, governance forums, and other public venues to gather consensus from all relevant ecosystem participants. The implementation could go live on Mainnet by the end of Q1 2024 if a consensus is reached. Featured image from Unsplash, chart from TradingView.com "
  }
]