[
  {
    "source": "Cointelegraph",
    "date": "2023-06-30T14:45:21.000Z",
    "title": "US SEC deems spot Bitcoin ETFs filings as inadequate: Report ",
    "url": "https://cointelegraph.com/news/us-sec-deems-spot-bitcoin-etfs-filings-as-inadequate-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/7bcb5ced-1ab8-4507-9967-465455df1d71.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In the eyes of the SEC, the recent filings from BlackRock, ARK Invest, Fidelity and other asset managers are not \"sufficiently clear and comprehensive.\"</p>\n                    <p><p>There may be a longer wait for a spot Bitcoin exchange-traded fund (ETF) in the United States as the Securities and Exchange Commission (SEC) labeled investment managers' recent applications inadequate.</p><p><a href=\"https://www.wsj.com/articles/sec-says-spot-bitcoin-etf-filings-are-inadequate-390336e8\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to the Wall Street Journal, the securities regulator told the Nasdaq and the Chicago Board Options Exchange (Cboe) that their filings are not \"sufficiently clear and comprehensive.\" These exchanges represent asset managers in the filing of the financial product.</p><p>In the eyes of the SEC, the exchanges should have named the spot Bitcoin exchange with which they would have a \"surveillance-sharing agreement\" or provided sufficient information about the details of those surveillance arrangements. However, asset managers can resubmit the filings after clarifying the information.</p><p><strong><em><a href=\"https://cointelegraph.com/learn/bitcoin-etfs-a-beginners-guide-to-exchange-traded-funds\">Bitcoin ETFs: A beginner's guide to exchange-traded funds</a></em></strong></p><p>A flurry of applications <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco\">have been filed over the past few weeks</a> since BlackRock joined the list of companies seeking to debut the first spot Bitcoin ETF of Wall Street. BlackRock's application introduced a \"surveillance sharing agreement\", under which information about market trading and clearing activities are shared between entities to avoid the possibility of market manipulation. </p><p>BlackRock's application led to ARK Invest and 21Shares <a href=\"https://cointelegraph.com/news/bitcoin-etf-race-gets-hotter-as-ark-invest-adds-surveillance-agreement-to-application\">to amend their third application</a> for a spot BTC ETF to include a similar surveillance agreement. Other asset managers that refiled or amended their applications in the past days include Invesco, WisdomTree, Valkyrie, and Fidelity. ARK Invest, however, is reportedly a front-runner in this race. </p><p>ETFs track a specific index and are generally traded on exchanges. In the cryptocurrency market, a fund that tracks the price of one or the multiple digital tokens and consists of various cryptocurrencies is called a cryptocurrency ETF. </p><p>Spot Bitcoin ETFs have been denied since 2017 by the SEC. In Canada, however, the financial product are already available. Three significant funds — Purpose Bitcoin, 3iQ Coinshares and CI Galaxy Bitcoin — are all directly invested in spot Bitcoin.</p><p><a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\"><strong><em>Magazine: Bitcoin is on a collision course with ‘Net Zero’ promises</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-30T14:55:19.000Z",
    "title": "Bitcoin’s sudden plunge below $30k triggers $176 million in liquidations",
    "url": "https://cryptoslate.com/bitcoins-sudden-plunge-below-30k-triggers-176-million-in-liquidations/",
    "description": "<p>Bitcoin’s (BTC) price briefly reclaimed $31,000 earlier today before suddenly plunging below $30,000 in a sell-off that led to losses for traders who held positions in the market. According to Coinglass data, the sudden price movement wiped off over $176 million who held positions in different digital assets in the last 24 hours. Over $170 million [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoins-sudden-plunge-below-30k-triggers-176-million-in-liquidations/\">Bitcoin&#8217;s sudden plunge below $30k triggers $176 million in liquidations</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-30T14:50:35.000Z",
    "title": "SEC steps in to spoil the crypto party with ETF rejections",
    "url": "https://cryptodaily.co.uk/2023/06/sec-steps-in-to-spoil-the-crypto-party-with-etf-rejections",
    "description": "<p>Just as bitcoin was looking as though it was going to break the critical $31,000 price level, the SEC threw a wrench into the works with its rejection of all the latest ETF filings.</p>\nOh no! Another rejection\n<p>The crypto market was alive and buzzing once again, looking as though it had finally emerged from a harsh crypto winter on the back of institutional ETF filings that looked as though this time might be approved.</p>\n<p>Gary Gensler at the SEC was having none of it. Blackrock, Fidelity et al could be damned. The Biden administration is absolutely determined to try and break the crypto industry, and even if the biggest institutional money in the country wants in, it&rsquo;s not going to happen on Gensler&rsquo;s watch.</p>\n<p>The news dropped like a bomb onto the crypto market. The Wall Street Journal was first to report it with the headline:&nbsp;</p>\n\n<p>&ldquo;SEC Says Spot Bitcoin ETF Filings Are Inadequate&rdquo;</p>\n\n<p>Assuming that Blackrock and the rest had done their homework on the Bitcoin Spot ETF, it was hard to imagine what on earth else might be required by the SEC.</p>\nCrypto market plummets\n<p>In a matter of seconds bitcoin and the rest of the crypto market plummeted lower. Bitcoin immediately dropped to the exact bottom of its bull flag, made a beautiful touch, and then bounced back. It is currently sitting at the $30,200 price mark, which also happens to be the 0.618 Fibonacci level.</p>\n<p>The altcoins fell even more drastically. The Total 3 chart (all cryptocurrencies except BTC and ETH) fell like a stone, losing over 4%, equivalent to around $13 billion in value.</p>\n<p>Bitcoin Cash (BCH), probably the coin riding the highest up until the SEC announcement, rapidly fell over 13%, dropping from $314 to $272, before bouncing back around half way to $293.</p>\nWas the news as bad as all that?\n<p>Senior Bloomberg Analyst Eric Balchunas tweeted out soon after the announcement saying that in his view the news was not as bad as the headline suggested. He said that the SEC was really after the name of the crypto exchange for the &ldquo;surveillance-sharing agreement&rdquo; and required more details on SSA.</p>\n\n<p dir=\"ltr\" lang=\"en\">Hold up a second, this isn't as bad as headline. The key paragraph is deep in story. Basically SEC wants them to name the \"crypto exchange\" and give more details on SSA. That's understandable, arguably good news. I was under impression they'd have to update that as well. pic.twitter.com/bh9qn65Xh2</p>\n&mdash; Eric Balchunas (@EricBalchunas) June 30, 2023\n<p>\n\n</p>\n<p>It does look as though the market is starting to digest this, and if the ETFs aren&rsquo;t being outright rejected then a surge in the opposite direction might be expected to take place. Hold on to your hats!</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T15:09:08.000Z",
    "title": "European Union takes action to de-risk from China",
    "url": "https://www.cryptopolitan.com/european-union-to-de-risk-from-china/",
    "description": "The European Union is making resolute strides towards attenuating its dependence on China, a decision taken on Friday during an EU summit. Aiming for a delicate equilibrium between cooperation and caution, Europe&#8217;s leaders are calling this step a &#8220;de-risking&#8221; strategy that envisages a steady move towards self-sustainability and resilience. Reducing dependencies: The million euro question ... <a title=\"European Union takes action to de-risk from China\" class=\"read-more\" href=\"https://www.cryptopolitan.com/european-union-to-de-risk-from-china/\" aria-label=\"More on European Union takes action to de-risk from China\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T15:05:23.000Z",
    "title": "South Korea Passes Inaugural Standalone Crypto Bill to Strengthen Investor Protection",
    "url": "https://www.cryptopolitan.com/south-korea-passes-standalone-crypto-bill/",
    "description": "In a significant move to bolster investor protection in the wake of several crypto scandals, South Korea has approved its first standalone digital-asset bill. The legislation comes just over a year after the collapse of tokens created by South Korean entrepreneur Do Kwon, which contributed to a $2 trillion crypto-market rout. The new law grants ... <a title=\"South Korea Passes Inaugural Standalone Crypto Bill to Strengthen Investor Protection\" class=\"read-more\" href=\"https://www.cryptopolitan.com/south-korea-passes-standalone-crypto-bill/\" aria-label=\"More on South Korea Passes Inaugural Standalone Crypto Bill to Strengthen Investor Protection\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T15:02:34.000Z",
    "title": "Ethiopia makes bold bid to join BRICS alliance",
    "url": "https://www.cryptopolitan.com/ethiopia-makes-bid-to-join-brics-alliance/",
    "description": "Ethiopia, celebrated as one of Africa&#8217;s rapidly advancing economies, has cast its ambitions toward the BRICS alliance of emerging markets. In a bold strategic move, the African nation has officially requested to become part of this potent bloc that is making its mark on the global economic stage. Ethiopia&#8217;s appeal to BRICS: A strategic move ... <a title=\"Ethiopia makes bold bid to join BRICS alliance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethiopia-makes-bid-to-join-brics-alliance/\" aria-label=\"More on Ethiopia makes bold bid to join BRICS alliance\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T15:00:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T14:53:19.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T14:49:57.000Z",
    "title": "Major European firms in panic mode over AI legislation",
    "url": "https://www.cryptopolitan.com/europe-firms-panic-mode-over-ai-legislation/",
    "description": "Turbulent times loom on the horizon for Europe&#8217;s leading business giants as new AI regulation proposals sow the seeds of discord. In an unprecedented move, over 150 industry top brass from Europe&#8217;s most successful companies, including the likes of German powerhouse Siemens and French aviation behemoth Airbus, have made their qualms known about the proposed ... <a title=\"Major European firms in panic mode over AI legislation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/europe-firms-panic-mode-over-ai-legislation/\" aria-label=\"More on Major European firms in panic mode over AI legislation\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-30T15:00:26.000Z",
    "title": "Ethereum Classic (ETC) Resumes Uptrend, Notches 13% In The Last Day",
    "url": "https://www.newsbtc.com/analysis/etc/ethereum-classic-etc-resumes-uptrend-notches-13-in-the-last-day/",
    "description": "Ethereum Classic (ETC) is currently experiencing a rise in its market price, gaining 13.99% in the last 24 hours, according to data from CoinMarketCap.  Following the ETC’s dip in the last two days, it appears the bulls have retaken control of the market, pushing the coin to trade above the $20 mark for the first time since April. ETC&#8217;s Price Action In June Ethereum Classic has found a place among the headlines in the last two weeks following its initial bearish form at the start of June.  ETC began the month trading around $18.01 before experiencing a nosedive which saw the token trade as low as $13.99 on June 10. Related Reading: Litecoin Up 18% In Past 24 Hours, Is Halving Rally Here? Thereafter, ETC would rise to $15.03 and hover around this price region for the next few days before embarking on a bullish run that to gain by 28.60% between June 20 and June 24, hitting the price resistance level at $19.33.  The following days would then present a mixed price action before ETC finally retraced to its key support level at $17.64 on June 29. After retesting at this price zone, ETC’s price has resumed its uptrend, climbing higher since then. Ethereum Classic (ETC) remains one of the major projects in the cryptocurrency space. Launched in July 2016, Ethereum Classic is a hard fork of Ethereum created to preserve the purpose and integrity of the original Ethereum network.  At the time of writing, ETC is exchanging hands at  $20.90, with a 1.51% gain in the last hour. The token’s 24-hour trading volume is currently valued at $482 million, having also gone up by 208.92%. ETC Trading At $21.03 On The 1-Hour Chart &#124; Source: ETCUSD Chart On Tradingview.com ETC Price Analysis And Prediction Looking at the ETC’s hourly chart, its Moving Average Convergence Divergence (MACD) remains well above the signal line indicating the token’s bullish run may still be on.  However, its Relative Strength Index (RSI) is currently in the overbought zone at 89.71, meaning a selling pressure may soon occur, which may drive down the token’s price. Related Reading: Ethereum Continues Uptrend As Staked ETH Soars To New High According to the prediction site, WalletInvestor, if the bulls manage to sustain buying pressure, ETC’s price would experience only a small rise reaching the market value of $21.42 in 14 days. However, if the reverse is the case, and ETC falls under bearish pressure, the team predicts the token to fall to a market price of $18.00.  That said, most of the crypto markets are also on an uptrend alongside Ethereum Classic (ETC). Market leader Bitcoin (BTC) is up by 0.87% in the last day, while other notable coins such as Cardano (ADA) and Solana (SOL) are also gaining by 7.41% and 6.72%, respectively. Featured Image: The Guardian Nigeria, chart from Tradingview."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T15:00:05.000Z",
    "title": "Bitcoin (BTC) or Alex The Doge (ALEX) Who Will Bring The Fun To The Party",
    "url": "https://www.crypto-news-flash.com/bitcoin-btc-or-alex-the-doge-alex-who-will-bring-the-fun-to-the-party/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-btc-or-alex-the-doge-alex-who-will-bring-the-fun-to-the-party",
    "description": "In the vast and ever-growing world of cryptocurrencies, different coins bring different things to the table. Bitcoin (BTC), the pioneer of the cryptocurrency universe, and the emerging meme-cum-gaming token Alex The Doge (ALEX), each have their unique characteristics. But, when it comes to bringing fun to the party, who takes the crown? &#62;&#62;&#62;&#62;BUY $ALEX PRESALE [...]"
  }
]