[
  {
    "source": "Cointelegraph",
    "date": "2023-10-27T00:49:02.000Z",
    "title": "Ryder Ripps ordered to pay Yuga Labs $1.6M in copyright lawsuit",
    "url": "http://cointelegraph.com/news/ryder-ripps-pay-yuga-labs-million-damages-copyright-infringment-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/56fb153e-3545-455e-897d-c22d70e21f69.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The NFT artists were also ordered to cover Yuga Labs’ legal fees after determining the trademark infringement constituted an “exceptional case.”</p>\n                    <p><p>A United States district court judge has ordered nonfungible token (NFT) artists Ryder Ripps and Jeremy Cahen to pay Bored Ape Yacht Club creator Yuga Labs a total of $1.57 million in disgorgement and damages, along with legal fees, bringing an end to the long-running “copycat” NFT lawsuit.</p><p>The Oct. 25 <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cacd.855658/gov.uscourts.cacd.855658.431.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">order</a> follows an April 21 partial summary judgement granted in favor of Yuga Labs after the firm claimed that Ripps and Cahen, the defendants, violated copyright laws by <a href=\"https://cointelegraph.com/news/ai-has-a-role-to-play-in-detecting-fake-nfts\">making copycat versions</a> of its Bored Ape Yacht Club (BAYC) collectibles.</p><p>District court Judge John Walter awarded Yuga Labs $1.37 million after concluding the NFT firm was entitled to a disgorgement of the defendants’ profits. An additional $200,000 was awarded in statutory damages relating to cybersquatting violations.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Yuga Labs v. Ryder Ripps et al - Notes from the Court&#39;s Findings of Fact and Conclusions of Law<br><br>Yuga is awarded $1,375,362.92 in Ds profits, $200,000 in statutory damages, and attorneys&#39; fees and costs (amount TBD). A permanent injunction is also issued against Ds.<br><br> 1/ <a href=\"https://t.co/2dTiuWpZSA\">pic.twitter.com/2dTiuWpZSA</a></p>&mdash; NeerMcD.eth  (@NeerMcD) <a href=\"https://twitter.com/NeerMcD/status/1717634980002582902?ref_src=twsrc%5Etfw\">October 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Yuga Labs has also been entitled to recover attorney fees and costs from the NFT artists after the judge determined the trademark infringement constituted an “exceptional case.” </p><p>“A trademark case is generally considered exceptional for purposes of awarding of attorneys’ fees when a party has taken positions that can be characterized as “malicious, fraudulent, deliberate or willful,” the judge noted.</p><p>Judge Walter also knocked back <a href=\"https://cointelegraph.com/news/bayc-copycat-files-opposition-to-10-yuga-labs-trademark-applications\">the defendants’ argument</a> that the copycat BAYC versions were “satire” and “parody” — ruling that the defendants intentionally infringed Yuga’s BAYC trademarks with a bad faith intent to profit from them. </p><p>He also noted the defendants continued to market and promote their copycat BAYC versions after the partial summary judgement was delivered against them in April.</p><p>Yuga Labs filed the lawsuit against the two artists in June 2022.</p><p>In an Oct. 16 hearing in a United States appeals court, Ripps and Cahen’s lawyers tried to argue the <a href=\"https://cointelegraph.com/news/appeals-court-judges-skeptical-ryder-ripps-bored-ape-appeal\">lawsuit should be thrown out</a> on the grounds of free speech under California’s anti-SLAPP statute. However, the three-judge panel didn’t appear persuaded by the lawyer’s arguments.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/nfts-arent-dead-just-resting\"><strong><em>NFTs aren’t dead — they’re just resting </em></strong></a></p><p>BAYC is one of the most valuable NFT collectibles on NFT marketplace OpenSea. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/53dc0e54-4e21-4de7-a945-bde497d9c65e.png\"  /><figcaption style=\"text-align: center;\"><em>BAYC collectibles currently listed on OpenSea. Source: OpenSea</em></figcaption></figure><p>Since April 2021, it has amassed 1.32 million Ether <a href=\"https://cointelegraph.com/\">(ETH)</a> or $2.38 billion in trading volume with an average floor price of 27.4 ETH ($49,200), <a href=\"https://opensea.io/collection/boredapeyachtclub\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to OpenSea.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/digital-artist-osf-nft-creator/\"><strong><em>Digital artist OSF gives fans a pledge of ‘art until I die’: NFT Creator</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-27T00:59:24.000Z",
    "title": "SBF Trial – SBF claims he acted in good faith as lawyers blessed his decisions at FTX",
    "url": "https://cryptoslate.com/sbf-trial-sbf-claims-he-acted-in-good-faith-as-lawyers-blessed-his-decisions-at-ftx/",
    "description": "<p>SBF&#8217;s trial resumed on Oct. 27, with the former billionaire taking the stand in the latter half of the day after the prosecution&#8217;s final witness in the case was excused. The hearing began with the prosecution bringing their witness — FBI agent Mark Troiano — to the stand to primarily provide insights into the existence, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sbf-trial-sbf-claims-he-acted-in-good-faith-as-lawyers-blessed-his-decisions-at-ftx/\">SBF Trial – SBF claims he acted in good faith as lawyers blessed his decisions at FTX</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-27T01:00:00.000Z",
    "title": "Bitcoin Could Reach $45,000 Next Month, Predicts Crypto Analyst Using BTC’s Previous Cycles",
    "url": "https://www.cryptoglobe.com/latest/2023/10/bitcoin-could-reach-45000-next-month-predicts-crypto-analyst-using-btcs-previous-cycles/",
    "description": "The price of the flagship cryptocurrency Bitcoin ($BTC) could hit $45,000 next month as it continues steadily rising, according to a popular cryptocurrency analyst who used Fibonacci retracement levels to determine the potential rise of the cryptocurrency. In a thread posted on the popular microblogging platform X (formerly known as Twitter). Analyst CryptoCon told their […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-27T01:00:25.000Z",
    "title": "Ahead Of V4, dYdX Open-Source Code: Bull Run Incoming?",
    "url": "https://www.newsbtc.com/news/defi/ahead-of-v4-dydx-open-source-code-bull-run-incoming/",
    "description": "In what is seen to be a monumental move, dYdX, a layer-2 decentralized exchange (DEX), is open-sourcing its code as the platform prepares to implement v4. The exchange has a total value locked (TVL) of over $353 million, according to DeFiLlama. dYdX Open-Sourcing Code Ahead Of V4 According to an X post on October 24, dYdX plans to eventually operate on its standalone blockchain on Cosmos, migrating from being a layer-2 exchange reliant on Ethereum for security. The standalone blockchain, dYdX Chain, will be built using the Cosmos software developer kit (SDK) and powered by the Tendermint proof-of-stake consensus algorithm. In blockchain, projects often open source their code, allowing the public to scrutinize how smart contracts operate. By going public, the protocol is helping to build trust with users and community members, boosting security and increasing decentralization. This is especially important because the DEX handles sensitive financial data to facilitate trustless trading for all users.  Related Reading: SHIB Will Lose Place To PEPE In New Bull Cycle, Analyst Makes The Case Antonio Juliano, the founder of dYdX, has already said the exchange developer, dYdX Trading Inc., is updating its charter to become a Public Benefit Corporation. The exchange developers will work on an open project without benefiting. Though the platform will remain a for-profit company as a Public Benefit Corporation (PBC), the founder and the board will &#8220;not solely act to maximize shareholder value but act in the public benefit.&#8221; Still, the layer-2 protocol has to receive approval from the community through a vote before the project transitions to v4 on Cosmos. Afterward, as stated by Juliano, dYdX will become fully open-source and decentralized, meaning the community will take over how the protocol evolves through a governance vote effected by the dYdX Foundation.  Will New Features Propel The Token To 2023 Highs? With v4, dYdX will build an off-chain order book and release an equally scalable matching engine that can process more transactions. This way, the development team believes this will &#8220;dramatically&#8221; enhance the protocol, all without charging trading fees, since it will run on Cosmos, a scalable layer-1 and interoperable blockchain. Related Reading: This Brand New Meme Coin Just Raised $11 Million In A Firesale With No Roadmap Part of these enhancements include making dYdX more efficient in trading. Subsequently, several features, such as batch execution and limit orders, will go live. At the same time, dYdX v4 will support trading new asset classes, such as equities, commodities, and real estate, making the protocol more versatile. Ahead of this transition, the native token of the exchange is trading at H2 2023 highs, looking at price action. Notably, the token has broken above July to October 2023 resistance levels with increasing volumes. At the same time, looking at the development in the daily chart, bull bars are banding along the upper BB, pointing to strong upward momentum. The region around $3.25 and $3.5, marking Q1 2023 highs, could be immediate targets for optimistic bulls. Feature image from Canva, chart from TradingView"
  }
]