[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-23T06:00:06.000Z",
    "title": "Crypto Firms Face Turmoil as Prime Trust Fallout Causes Service Disruptions and Concerns",
    "url": "https://news.bitcoin.com/crypto-firms-face-turmoil-as-prime-trust-fallout-causes-service-disruptions-and-concerns/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/turmoils-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto Firms Face Turmoil as Prime Trust Fallout Causes Service Disruptions and Concerns\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/turmoils-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/turmoils-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/turmoils-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/turmoils-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/turmoils-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/turmoils-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/turmoils.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />After the Bitgo acquisition deal to purchase Prime Trust fell through, it seems that crypto firms that have worked with the custodian are experiencing problems. On Thursday, Seattle-based fintech startup Stably announced the need to &#8220;temporarily pause&#8221; certain services and operations. According to reports, the bitcoin payments platform, Strike, is also encountering difficulties and has [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T05:51:46.000Z",
    "title": "Cryptopay EU Card Provider Faces License Revocation, Urges Users to Safeguard Funds",
    "url": "https://www.cryptopolitan.com/cryptopay-eu-card-faces-license-revocation/",
    "description": "Cryptopay, a popular European Union (EU) debit card provider for cryptocurrency users, has recently faced a setback as its app&#8217;s provider, UAB PayrNet, had its Electronic Money Institution (EMI) license revoked by the Bank of Lithuania. The revocation of the license raises concerns that EU cardholders may experience disruptions in their card services.&#160; However, Cryptopay ... <a title=\"Cryptopay EU Card Provider Faces License Revocation, Urges Users to Safeguard Funds\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cryptopay-eu-card-faces-license-revocation/\" aria-label=\"More on Cryptopay EU Card Provider Faces License Revocation, Urges Users to Safeguard Funds\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T06:00:13.000Z",
    "title": "Cardano Price Surges Amidst A Thriving Bull Run, How Long Will This Last?",
    "url": "https://www.newsbtc.com/news/cardano/cardano-price-surges-amidst-a-thriving-bull-run-how-long-will-this-last/",
    "description": "This week, the cryptocurrency market has experienced a remarkable resurgence, resulting in unexpected price surges across numerous coins and tokens. Cardano (ADA) is a notable beneficiary, showcasing a significant price increase over the past three days. ADA&#8217;s resurgence exemplifies the reversal of sentiment witnessed in the cryptocurrency market, evoking a sense of optimism reminiscent of the levels seen in March 2023. ADA&#8217;s value has surged by over 20% since reaching a low point on Monday, propelling its trading price just above $0.30. Furthermore, Cardano has surpassed a key indicator, the 20-day exponential moving average (EMA), widely used to assess a token&#8217;s short-term trend. This breakthrough is a milestone for Cardano, indicating the potential for a substantial shift in investor sentiment and paving the way for potential robust upward momentum. Related Reading: Cardano Poised For Consolidation In This Price Zone Prior To Attempting Reversal Cardano Price Surge Amidst Market Dynamics The recent upward trajectory of Cardano (ADA) can be attributed to external factors rather than token-specific developments or fundamentals. For example, the rising number of ADA wallets, as indicated by data from Cardano Blockchain Insights since late May, has not yet had an immediate impact on the token&#8217;s price. Interestingly, the current market dynamics are intertwined with a notable surge in institutional interest in Bitcoin (BTC). Last week, this heightened interest was exemplified by BlackRock&#8217;s application to launch the first United States spot BTC exchange-traded fund (ETF). As a result, Cardano&#8217;s recent rise can be seen as part of a broader market trend driven by institutional attention focused on Bitcoin. Monitoring how these external market events influence Cardano&#8217;s price and whether further developments within the crypto ecosystem will contribute to its future growth and performance is crucial. Related Reading: Investors Rush to Buy InQubeta as Price Jumps 25%, While Major Cryptos BNB and Cardano (ADA) Slump A Closer Look At Future Potential At 5:03 p.m., Cardano (ADA) is trading at $0.29, representing a 2.67% price change within the last 24 hours. This recent movement has propelled Cardano&#8217;s market capitalization to approximately $10 billion. Noteworthy is the 18.19% profit Cardano has experienced since the beginning of this year. Traders may learn much about Cardano&#8217;s potential long-term price dynamics by comparing its trajectory to other technology developments and trends. Featured image from iStock, charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T06:05:32.000Z",
    "title": "Ethereum Eyes $2000 Rally, Shiba Inu Holds Crucial Support, as QUBE’s Presale Sparks Interest",
    "url": "https://www.crypto-news-flash.com/ethereum-eyes-2000-rally-shiba-inu-holds-crucial-support-as-qubes-presale-sparks-interest/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-eyes-2000-rally-shiba-inu-holds-crucial-support-as-qubes-presale-sparks-interest",
    "description": "The cryptocurrency market continues to offer intriguing opportunities for investors, with Ethereum hinting at a possible surge to $2000 and Shiba Inu&#8217;s $SHIB striving to maintain its critical $0.00000572 support level. Amid a market-wide sell-off, both currencies display indicators that suggest an upcoming relief rally may be in the cards.  Meanwhile, InQubeta&#8217;s QUBE token is [...]"
  }
]