[
  {
    "source": "Crypto Daily",
    "date": "2023-11-09T20:58:00.000Z",
    "title": "Zircuit, New ZK Rollup Backed by Pioneering L2 Research Launches Public Testnet",
    "url": "https://cryptodaily.co.uk/2023/11/zircuit-new-zk-rollup-backed-by-pioneering-l2-research-launches-public-testnet",
    "description": "Zircuit, a new zero-knowledge rollup backed by pioneering L2 research, today announced the launch of its public testnet. Zircuit is fully EVM compatible,"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-09T21:00:13.000Z",
    "title": "Kaspa (KAS) Price Shatters Records, Outshining Bitcoin With A Massive 105% Surge",
    "url": "https://www.newsbtc.com/news/kaspa-kas-price-shatters-records-outshining-bitcoin-with-a-massive-105-surge/",
    "description": "Kaspa (KAS), a proof-of-work cryptocurrency employing the GHOSTDAG protocol, has experienced a notable surge in market activity and investor interest over the past few months.  The token&#8217;s recent listing on Coinone, one of South Korea&#8217;s leading cryptocurrency exchanges, has significantly propelled Kaspa into the top 33 cryptocurrencies based on market capitalization. Since its listing on October 25 in the Korean market, Kaspa has outperformed well-known cryptocurrencies like Bitcoin (BTC), and Ethereum (ETH) and popular meme coins such as Dogecoin (DOGE) and Pepecoin (PEPE) during market breakouts. KAS Token Skyrockets Reaching New All-Time High Over the past 24 hours, the price of KAS has increased by a remarkable 28.78%, reaching a high of $0.092917. Despite a slight dip in the current price, 0.72% below the all-time high, the token continues to exhibit strong upward momentum. The recent surge in trading volume for Kaspa, amounting to $114,934,098.78 within the last 24 hours, represents a substantial increase of 121.50% compared to the previous day. This surge signifies heightened market activity, indicating growing confidence and interest in the project. Related Reading: Prepare For Take-Off: Dogecoin Whales Have Injected $2 Billion Into DOGE Notably, Kaspa&#8217;s consensus mechanism, implemented through the GHOSTDAG protocol, sets it apart from conventional blockchains. Using parallel blocks that can coexist and be ordered through consensus eliminates block orphans, providing enhanced security and scalability.  The blockDAG structure enables a high block rate of one block per second, with aspirations to reach even higher rates of 10 blocks per second and eventually 100 blocks per second. The Kaspa implementation encompasses several notable features and subprotocols, including Reachability for querying the DAG&#8217;s topology, block data pruning, SPV proofs, and upcoming subnetwork support that will facilitate the implementation of layer 2 solutions.  Kaspa Coinone Listing Sparks Price Surge The listing of Kaspa on Coinone has been a significant catalyst for its recent price surge. Coinone has a substantial user base and provides a platform for investors to trade Kaspa against the Korean won (KRW).  This listing has opened up fresh avenues for Korean investors to participate in the Kaspa ecosystem, bolstering its market presence and contributing to its rapid ascent in the market rankings. Related Reading: Polygon (MATIC) Jumps Another 6% As Whales Show High Activity Kaspa&#8217;s entry into this market has increased visibility and exposure to a wide range of traders and potential investors. The positive response to its listing on Coinone reflects the growing demand for Kaspa in the Korean crypto community. Looking ahead, the successful listing on Coinone and the surge in market rankings indicate further gains for the token. The project&#8217;s consensus mechanism, coupled with its development of features like subnetwork support and layer 2 solutions, positions it as a blockchain solution with growth potential. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-09T21:00:59.000Z",
    "title": "Top Analyst Predicts Pullbacks for Solana and Altcoins, Updates Outlook on One Ethereum-Based Crypto Asset",
    "url": "https://dailyhodl.com/2023/11/09/top-analyst-predicts-pullbacks-for-solana-and-altcoins-updates-outlook-on-one-ethereum-based-crypto-asset/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/top-predicts-pullbacks-solana.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/top-predicts-pullbacks-solana.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/top-predicts-pullbacks-solana.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/top-predicts-pullbacks-solana.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/top-predicts-pullbacks-solana.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/top-predicts-pullbacks-solana.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/top-predicts-pullbacks-solana.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto analyst who nailed the top of the 2021 Bitcoin (BTC) bull market says Solana (SOL) will likely pull back after a big rally. Pseudonymous analyst Pentoshi tells his 706,400 followers on the social media platform X that Solana could dip by more than 25% from its current value. “Whether it goes higher, or [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/09/top-analyst-predicts-pullbacks-for-solana-and-altcoins-updates-outlook-on-one-ethereum-based-crypto-asset/\">Top Analyst Predicts Pullbacks for Solana and Altcoins, Updates Outlook on One Ethereum-Based Crypto Asset</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-09T20:55:42.000Z",
    "title": "Crypto Analyst Expects Bitcoin To Reach $50,000 Before the Halving As BTC Approaches ‘Pivotal Resistance’",
    "url": "https://dailyhodl.com/2023/11/09/crypto-analyst-expects-bitcoin-to-reach-50000-before-the-halving-as-btc-approaches-pivotal-resistance/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/btc-traders-prepared.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/btc-traders-prepared.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/btc-traders-prepared.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/btc-traders-prepared.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/btc-traders-prepared.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/btc-traders-prepared.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/btc-traders-prepared.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst thinks Bitcoin (BTC) could reach $50,000 sometime before April 2024. Crypto trader Michaël van de Poppe tells his 671,300 followers on the social media platform X that he expects the king crypto to make a major move up pre-halving before correcting back to current levels. &#8220;It&#8217;s expected to see Bitcoin reach $45,000-$50,000 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/09/crypto-analyst-expects-bitcoin-to-reach-50000-before-the-halving-as-btc-approaches-pivotal-resistance/\">Crypto Analyst Expects Bitcoin To Reach $50,000 Before the Halving As BTC Approaches ‘Pivotal Resistance’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]