[
  {
    "source": "Decrypt",
    "date": "2023-07-18T20:50:30.000Z",
    "title": "Microsoft Broadens AI Bets Beyond OpenAI With Meta Alliance",
    "url": "https://decrypt.co/149076/microsoft-meta-llama-azure-partnership",
    "description": "Integrating LLama 2 into the Azure cloud-computing platform brings together two tech titans."
  },
  {
    "source": "NullTX",
    "date": "2023-07-18T21:00:20.000Z",
    "title": "After raising over $6.1 Million, Will DigiToads (TOADS) Follow the Footsteps of Shiba Inu (SHIB)?",
    "url": "https://nulltx.com/after-raising-over-6-1-million-will-digitoads-toads-follow-the-footsteps-of-shiba-inu-shib/",
    "description": "Shiba Inu is one of the most popular meme coins that have been rolled over the past few years. What has propelled it to become one of the top cryptos to invest in is its strive to evolve. Be it the Shibarium upgrade or the NFT series, the meme coin has always been eager to [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-18T21:00:07.000Z",
    "title": "Ripple Dives Deeper Into Metaverse With $54 Million Investment In Futureverse",
    "url": "https://www.newsbtc.com/analysis/xrp/ripple-dives-deeper-into-metaverse-with-54-million-investment-in-futureverse/",
    "description": "Futureverse, a metaverse infrastructure and content company, has received a $54 million investment round from Ripple and other investors to create an open, scalable, and interoperable infrastructure within the metaverse industry.  The company plans to roll up 11 metaverse infrastructure and content companies into a collaborative ecosystem, providing essential components for constructing any metaverse application. It also aims to become a leader in an entirely new frontier of Artificial Intelligence (AI) gaming. Ripple Invests Big In Futureverse&#8217;s Vision The firm&#8217;s comprehensive technology includes its Futureverse Platform featuring &#8220;Powered By Futureverse&#8221; tools and products, which it will develop further using the proceeds from the funding round.  Futureverse is using The Root Network, a blockchain, and suite of protocols with ready-made runtimes for building next-generation metaverse apps, games, and experiences. The Root Network is integrated with Ripple&#8217;s XRP Ledger (XRPL) and supports the use of XRP as a gas token, as well as the XLS-20 NFT standard. Futureverse has been making strides in the metaverse industry, with strategic partnerships with renowned organizations such as FIFA, Authentic Brands Group, Mastercard, Wimbledon, and more.  Related Reading: Litecoin Whales Deposit Big To Exchanges, Bearish Sign? The company is run by metaverse pioneer Aaron McDonald, tech and entertainment investor/operator Shara Senderoff, technology and information security expert Marco Brondani, and Futureverse business operator Dan Gillespie. Ripple&#8217;s investment in Futureverse is a significant step towards realizing the potential of the metaverse and creating a seamless, interconnected experience for users. Ripple&#8217;s president, Monica Long, stated that the company is thrilled to contribute to the foundational infrastructure layer and provide real utility to the end users of the open metaverse. The Futureverse founders believe that the metaverse is the next evolution of the internet, defined by immersive convergence and data, wherein users are empowered to own and control their identity, social graph, content, and value online.  With the new Ripple investment, they are confident that the Futureverse Platform will make the content layer interoperable, providing a seamless, interconnected experience for users. In conclusion, Futureverse&#8217;s series A funding round is a significant milestone for the company, with the investment from Ripple and other investors contributing to the company&#8217;s momentum.  Futureverse&#8217;s vision of creating an open, scalable, and interoperable infrastructure within the metaverse industry is becoming a reality, and the company&#8217;s comprehensive technology and strategic partnerships position it as a major player in the metaverse industry. Crypto Giant Adds XRP To Its Roster According to a recent announcement, XRP has been listed on the prestigious Liechtenstein-based LCX Exchange, as of July 18th. The exchange will support three trading pairs for the token, namely XRP/USDC, XRP/EUR, and XRP/LCX. Deposits have been available since the same date and trading will start in Post-Only Mode, with full Trading Mode activated when pairs reach minimum liquidity. LCX Exchange is one of the world&#8217;s most prestigious crypto exchanges, with a reputation for offering top-quality trading services and innovative technology. The exchange&#8217;s support for XRP is a testament to the token&#8217;s credibility and market appeal, as well as its potential to drive growth in the cryptocurrency industry. Related Reading: ARK Invest CEO Says Firm Is Still Bullish On Coinbase Despite Selling COIN Stocks According to the LCX Exchange, the addition of XRP to its platform will provide users with access to one of the most widely used cryptocurrencies in the world, with a market capitalization of over $60 billion. The exchange also noted that XRP&#8217;s low transaction fees, fast settlement times, and broad adoption make it an attractive option for traders and investors. As of the time of writing, XRP continues to maintain its position among the top four cryptocurrencies in the market in terms of market capitalization and trading volume. Over the past 24 hours, the token has experienced a significant surge, increasing by over 5% and trading at $0.7669. Featured image from Unsplash, chart from TradingView.com "
  }
]