[
  {
    "source": "Decrypt",
    "date": "2023-12-04T19:47:00.000Z",
    "title": "BONK Won't Stop: Solana Meme Coin Sets Another All-Time High",
    "url": "https://decrypt.co/208522/bonk-wont-stop-solana-meme-coin-sets-another-all-time-high",
    "description": "As Solana continues to climb in recent weeks, its top meme coin BONK is reaping the rewards, now up 762% in the past 30 days."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-04T20:00:00.000Z",
    "title": " Tax services are getting pushy to have crypto declared: Law Decoded, Nov. 27–Dec. 4 ",
    "url": "https://cointelegraph.com/news/tax-services-are-getting-pushy-to-have-crypto-declared-law-decoded-nov-27-dec-4",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMDJlNTQ4MjgtNzVjYS00MzE5LWFjNjQtOWU4M2I4ZDhiN2ZmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Spain and Brazil are chasing cryptocurrency stored abroad, while the U.K. wants taxes paid for crypto assets that weren’t previously declared.  </p>\n                    <p><p>Last week, His Majesty’s Revenue and Customs (HMRC) presented an <a href=\"https://cointelegraph.com/news/uk-crypto-hodlers-get-a-call-from-the-tax-grinch\" >unpleasant Christmas surprise</a> to hodlers in the United Kingdom, demanding they declare any crypto holdings they failed to report in the last four, six or even 20 years. The disclosure must include “exchange tokens,” such as Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), as well as any nonfungible tokens (NFTs) and “utility tokens.”</p><p>Less harsh in its demands, the Spanish Tax Administration Agency has also reminded its citizens about their obligations to declare crypto, <a href=\"https://cointelegraph.com/news/spanish-citizens-declare-foreign-crypto-holdings-end-march\" >even if they store it abroad</a>. </p><p>Brazil will also proceed to tax its citizens’ foreign crypto holdings via a bill already passed in the Chamber of Deputies and expected to be approved by President Luiz Inácio Lula da Silva. The change <a href=\"https://cointelegraph.com/news/brazil-moves-levy-higher-taxes-cryptocurrencies\" >makes those funds taxable</a> at the same rate as domestic funds. </p><h3>The SEC is still digging into Binance.US</h3><p>The United States Securities and Exchange Commission is still looking for evidence that Binance.US had a backdoor to potentially control customer assets similarly to FTX. Anti-Money Laundering laws as part of a <a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\" >$4.3 billion settlement</a> with the U.S. </p><p><a href=\"https://cointelegraph.com/news/tax-services-are-getting-pushy-to-have-crypto-declared-law-decoded-nov-27-dec-4\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-04T19:48:16.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p >Cosmos-based networks Umee and Osmosis have announced plans to merge and create a so-called \"DeFi Hub.\" Meanwhile, Brazilian bank Itau Unibanco has reportedly launched a cryptocurrency trading service for its clients as part of its investment platform, and Bitcoin has reached the $40,000 milestone, its highest price level in 19 months.</p><h3 >Cosmos-based networks announce merger plans</h3><p >Umee and Osmosis, two networks that operate on the Cosmos chain, have announced <a href=\"https://cointelegraph.com/news/cosmos-based-networks-umee-osmosis-merge-creating-defi-hub\">plans to merge</a> through a software upgrade and create a \"DeFi Hub\" for the entire Cosmos ecosystem. </p><p >According to the Dec. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Osmosis x Umee<br><br>This is much needed for <a href=\"https://twitter.com/search?q=%24OSMO&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$OSMO</a> and also great for <a href=\"https://twitter.com/search?q=%24UMEE&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$UMEE</a>. With Mars planning to migrate to Neutron, Osmosis needs to gather the DeFi legos required to offer a complete exchange experience<br><br>Cosmos ecosystem making moves. <a href=\"https://t.co/vjiDXMfA0T\">https://t.co/vjiDXMfA0T</a> <a href=\"https://t.co/P0cZG6reLP\">https://t.co/P0cZG6reLP</a></p>&mdash; Liam Connor (@L1am_Crypto) <a href=\"https://twitter.com/L1am_Crypto/status/1731640163774726628?ref_src=twsrc%5Etfw\">December 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p >“The combined architecture of both chain functionality will open up the door for flash loans and new forms of MEV on the same DeFi Hub,” said Sunny Agarwal, Osmosis' co-founder.</p><p >Osmosis made news in October by allowing <a href=\"https://cointelegraph.com/news/ecosystem-developers-bring-bitcoin-cosmos-network\">a bridged version of Bitcoin</a> to be traded on the exchange.</p><h3 >Brazil’s largest bank Itau Unibanco launches Bitcoin trading</h3><p >Brazilian bank Itau Unibanco has launched a cryptocurrency trading service for its clients as part of its investment platform, Reuters reported on Dec. </p><p >Itau, the largest bank by assets in Brazil and one of the leading lenders in Latin America, is debuting crypto trading with Bitcoin and Ether, digital asset head Guto Antunes reportedly said. </p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-04T20:03:36.000Z",
    "title": "El Salvador’s Bitcoin Adoption Starts To Pay Off, Profits Exceed $3.6 Million",
    "url": "https://cryptobriefing.com/el-salvadors-bitcoin-adoption-starts-to-pay-off-profits-exceed-3-6-million/?utm_source=feed&utm_medium=rss",
    "description": "Bukele's announcement of $3.6 million in Bitcoin profits cements El Salvador's position as a crypto pioneer."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-12-04T19:56:31.000Z",
    "title": "Digital Asset Custodian Zodia Custody Partners With Ripple-Owned Metaco To ‘Create a Global Network for Institutions’",
    "url": "https://www.cryptoglobe.com/latest/2023/12/digital-asset-custodian-zodia-custody-partners-with-ripple-owned-metaco-to-create-a-global-network-for-institutions/",
    "description": "Introduction to the Strategic Integration Zodia Custody, primarily owned by the global banking giant Standard Chartered and supported by shareholders like SBI Holdings and Northern Trust, stands at the forefront of institutional digital asset custody. This positioning underscores its importance in the institutional embrace of digital assets. Having extended its operations to Singapore in September, […]\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-04T19:49:45.000Z",
    "title": "Riot acquires 18 EH/s hash rate and establishes extended agreement with MicroBT for future supplies",
    "url": "https://crypto.news/riot-acquires-18-eh-s-in-hash-rate-and-establishes-extended-agreement-with-microbt-for-future-supplies/",
    "description": "Riot Platforms, Inc. has significantly expanded its Bitcoin mining operations by executing a large-scale purchase agreement with MicroBT Electronics Technology Co., Ltd."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-04T19:43:58.000Z",
    "title": "28 cryptocurrency firms in India register with national anti-money laundering agency",
    "url": "https://crypto.news/28-cryptocurrency-firms-in-india-register-with-national-anti-money-laundering-agency/",
    "description": "India's Financial Intelligence Unit has officially registered 28 Virtual Digital Assets and crypto service providers."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-04T20:00:41.000Z",
    "title": "Shiba Inu Open Interest Falls Behind General Crypto Market, What This Means For Price",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-open-interest-price/",
    "description": "The entire crypto market has seen a steady increase in open interest (OI) over the last few months. But the Shiba Inu open interest seems to not have followed this trend as much as others. While there has been a huge jump in the open interest of the largest cryptocurrencies in the industry, Shiba Inu’s rise has remained relatively muted, with implications for the altcoin’s price. Shiba Inu Open Interest Trajectory The Shiba Inu open interest initially started pumping back in August when the current bull run began. However, in the following months, the open interest has been considerably lower, happening at a time when open interest across other top cryptocurrencies is seeing large spikes. Related Reading: Crypto Analyst Predicts Bitcoin 400% Surge To $200,000, Here’s When Shiba Inu’s open interest crossed $43 million back in August but has had a hard time returning to this level, data from Coinglass shows. The open interest has since dropped and continues to range just below the $20 million level. Now, while this is not out of character for the altcoin, it is a deviation when it comes to following Bitcoin’s trends. Dogecoin, SHIB’s foremost competitor, has followed the trajectory of Bitcoin, with the open interest staying low through the months of October and then exploding in the month of November. To put this in perspective, the Dogecoin open interest dropped as low as $226 million in October before exploding as high as $520 million in November. However, the Shiba Inu open interest has struggled, maintaining a low peak of $17 million in November with a small rise to $18 million in December. This is in stark contrast to the open interest of Bitcoin and Dogecoin which have seen a flurry of activities as prices have recovered. SHIB price shows more volatility &#124; Source: SHIBUSD on Tradingview.com SHIB OI Deviates From Price Another way that Shiba Inu has deviated from the rest of the crypto market is the fact that the price does not move directly proportional to the open interest. While the likes of Bitcoin and Dogecoin have shown prices moving upward as open interest has soared, SHIB’s price has remained fairly high while the open interest has remained fairly low. Related Reading: The Big Move: Crypto Pundit Predicts When Bitcoin Will Reach A New ATH This suggests that a rise in open interest is not actually one of the major factors pushing the SHIB price. So unlike others, a crash in open interest will likely not translate into a crash in price. However, Shiba Inu continues to trail the Bitcoin recovery closely, so a decline in the BTC price could sorely affect the SHIB price. Featured image from Fast Company, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-04T19:45:49.000Z",
    "title": "$3,000,000,000 Worth of Crypto Stolen by North Korean Hackers in Six Years, Says Cybersecurity Firm",
    "url": "https://dailyhodl.com/2023/12/04/3000000000-worth-of-crypto-stolen-by-north-korean-hackers-in-six-years-says-cybersecurity-firm/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/crypto-hackers-strike-project.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/crypto-hackers-strike-project.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/crypto-hackers-strike-project.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/crypto-hackers-strike-project.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/crypto-hackers-strike-project.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/crypto-hackers-strike-project.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/crypto-hackers-strike-project.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>North Korea has greatly increased its focus on the crypto industry since 2017, stealing over $3 billion in digital assets, according to cybersecurity firm Recorded Future. The firm says that the North Korean regime has a &#8220;highly trained cadre of computer science professionals&#8221; with privileged access to new technology and information. State-backing allows the country&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/04/3000000000-worth-of-crypto-stolen-by-north-korean-hackers-in-six-years-says-cybersecurity-firm/\">$3,000,000,000 Worth of Crypto Stolen by North Korean Hackers in Six Years, Says Cybersecurity Firm</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-04T19:41:24.000Z",
    "title": "Crypto.com Gets Regulatory Approval for Electronic Money Institution in UK With Financial Conduct Authority",
    "url": "https://dailyhodl.com/2023/12/04/crypto-com-gets-regulatory-approval-for-electronic-money-institution-in-uk-with-financial-conduct-authority/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/Issues-Crypto.Com-Warning.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/Issues-Crypto.Com-Warning.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/Issues-Crypto.Com-Warning.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/Issues-Crypto.Com-Warning.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/Issues-Crypto.Com-Warning.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/Issues-Crypto.Com-Warning.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/Issues-Crypto.Com-Warning.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto.com is announcing that it has been authorized as an Electronic Money Institution (EMI) by the UK’s Financial Conduct Authority (FCA). In a new announcement, the crypto exchange says that the new EMI authorization will allow it to offer a series of UK-based e-money products &#8220;as part of the robust FCA regime that aligns with Crypto.com’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/04/crypto-com-gets-regulatory-approval-for-electronic-money-institution-in-uk-with-financial-conduct-authority/\">Crypto.com Gets Regulatory Approval for Electronic Money Institution in UK With Financial Conduct Authority</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]