[
  {
    "source": "CoinDesk",
    "date": "2024-03-28T12:27:45.000Z",
    "title": "Protocol Village: Zircuit Launches 'Build to Earn' Program With Rewards for Devs",
    "url": "https://www.coindesk.com/tech/2024/03/27/protocol-village/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of March 28-April 3."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-28T12:26:49.000Z",
    "title": " Prisma Finance exploited for $10 million  ",
    "url": "https://cointelegraph.com/news/prisma-finance-exploited-10-million",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOTNjN2FiNTktNTY3Mi00NDgwLTg4MzMtMzYzM2E0YzI1MDM4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Prisma finance engineers have already halted the protocol to investigate the attack.</p>\n                    <p><p>Prisma Finance has been exploited for around $10 million worth of cryptocurrencies on March 28.</p><p>On-chain security alert provider Cyvers was the first to detect the anomaly, according to a March 28 <a href=\"https://twitter.com/CyversAlerts/status/1773312535338340598\" target=\"_blank\" rel=\"noopener nofollow\">X</a> <a href=\"https://twitter.com/CyversAlerts/status/1773312535338340598\" target=\"_blank\" rel=\"noopener nofollow\">post</a>:</p><p>“Our system has detected multiple suspicious transactions with @PrismaFi and still ongoing! Total loss so far is around $9M. The attacker has been funded by @FixedFloat! Our system has detected the malicious contract 2 min earlier than hack transactions!”</p><p><a href=\"https://cointelegraph.com/news/prisma-finance-exploited-10-million\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-28T12:24:10.000Z",
    "title": " Why is Dogecoin price up today? ",
    "url": "https://cointelegraph.com/news/why-is-dogecoin-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDQvMzAyMDU4OWUtMmQ1My00ZDEzLWJjNGEtZTQ0N2I2MmYyNmEyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>DOGE's price surge is driven by increased whale accumulation, X payment platform's license approvals, and heightened interest in the derivatives market.</p>\n                    <p><p>On March 28, Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) price soared 13.35% to reach $0.21, its highest level since January 2022. In doing so, the memecoin has outperformed most of its top-ranking rivals, including Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), on a 24-hour performance metric.</p><p>Let's discuss the main factors driving the Dogecoin price upward today.</p><p>Dogecoin's gains are part of an overall recovery trend that has seen its price rebound 79.5% from its local low of $0.122 established on March 20. And it appears Elon Musk has been one of the main factors behind the sharp rise.</p><p><a href=\"https://cointelegraph.com/news/why-is-dogecoin-price-up-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-28T12:23:56.000Z",
    "title": " Marc Andreessen, Galaxy Digital, Accolade, back new $75 million crypto fund: Report  ",
    "url": "https://cointelegraph.com/news/marc-andreessen-galaxy-digital-75-million-crypto-fund",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYzI0ZmExNTAtMGQyMC00NWY0LTlmNjctZmM1NGUyZDBjNGMyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The fund was announced during an uptick of institutional interest in crypto investments.</p>\n                    <p><p data-ct-non-breakable=\"true\">Prominent venture capitalists Marc Andreessen, Galaxy Digital, and Accolade Partners are among the top contributors to crypto venture capital (VC) firm 1kx’s latest fund.</p><p>1kx raised $75 million, with Chris Dixon, a partner at Andreessen Horowitz, as one of the limited partners, Lasse Clausen, the founding partner of 1kx, <a href=\"https://www.bloomberg.com/news/articles/2024-03-28/marc-andreessen-galaxy-invest-in-1kx-s-75-million-crypto-vc-fund?embedded-checkout=true&amp;sref=IIP4JEyu\" target=\"_blank\" rel=\"noopener nofollow\">told</a> Bloomberg on March 28.</p><p>Private equity firm Accolade is the anchor investor in the new fund, according to Clausen.</p><p><a href=\"https://cointelegraph.com/news/marc-andreessen-galaxy-digital-75-million-crypto-fund\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-28T12:12:01.000Z",
    "title": " Biden administration takes action to safeguard public from AI risks ",
    "url": "https://cointelegraph.com/news/biden-administration-safeguard-public-ai-risks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYjhkMTE4YzQtNjcxOC00MmExLTk2MTEtMTIyZGM2NWNkMzA4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>By Dec. 1, agencies must establish specific safeguards for AI applications that could affect the rights or safety of Americans, as outlined in a White House fact sheet.</p>\n                    <p><p data-ct-non-breakable=\"true\">The White House has unveiled its inaugural comprehensive policy for managing the risks associated with artificial intelligence (AI), mandating that agencies intensify reporting on AI utilization and tackle potential risks posed by the technology.</p><p><a href=\"https://www.whitehouse.gov/briefing-room/speeches-remarks/2024/03/28/press-call-by-vice-president-harris-on-artificial-intelligence/\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a March 28 White House memorandum, federal agencies must, within 60 days, appoint a chief AI officer, disclose AI usage and integrate protective measures. </p><p>This directive aligns with United States President Joe Biden’s <a href=\"https://cointelegraph.com/news/biden-administration-executive-order-ai-safety-standards#:~:text=United%20States%20President%20Joe%20Biden,leading%20companies%20in%20the%20industry.\">executive order on AI from October 2023</a>. On a teleconference with reporters, Vice President Kamala Harris said: </p><p><a href=\"https://cointelegraph.com/news/biden-administration-safeguard-public-ai-risks\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-28T12:30:05.000Z",
    "title": "Bitcoin Cash Rallies Ahead of Upcoming Halving and Upgrade",
    "url": "https://news.bitcoin.com/bitcoin-cash-rallies-ahead-of-upcoming-halving-and-upgrade/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/bch90-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Cash Rallies Ahead of Upcoming Halving and May Upgrade\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/bch90-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bch90-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bch90-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bch90-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bch90-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bch90-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/bch90.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Bitcoin Cash network stands on the brink of its forthcoming halving event, set to take place a week from now. This milestone will see mining rewards on the network notably reduced from their current levels. Currently, Bitcoin Cash ranks as the 15th largest by market capitalization among over 10,000 cryptocurrencies, having risen 91% against [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-28T12:37:15.000Z",
    "title": "Let’s Break Down Vitalik Buterin’s Latest Essay",
    "url": "https://www.cryptopolitan.com/break-down-vitalik-buterins-latest-essay/",
    "description": "Vitalik Buterin, the brain behind Ethereum, dropped a thought bomb on the crypto community, challenging us to rethink what we know about decentralization. He&#8217;s not one to shy away from the tough topics, and this time, it&#8217;s no different. Buterin is throwing down the gauntlet, suggesting we might be doing decentralization all wrong. He&#8217;s proposing [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-28T12:31:06.000Z",
    "title": "On-Chain AI: The Next Big Thing in Web3?",
    "url": "https://www.cryptopolitan.com/on-chain-ai-the-next-big-thing-in-web3/",
    "description": "Blockchain and AI are two powerful technologies that seem entirely separate. Over the past year, however, the blurry line between the two worlds has become clearer as Web3 projects continue to push and explore what is possible.&#160; The launch of ChatGPT over a year ago was a significant moment that sparked widespread interest in AI [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-28T12:25:27.000Z",
    "title": "Let’s talk Sam Bankman-Fried: What to expect from his sentencing",
    "url": "https://www.cryptopolitan.com/lets-talk-sam-bankman-fried/",
    "description": "Sam Bankman-Fried, the ex-FTX CEO, is on the edge of his seat as March 28 approaches. That&#8217;s the day he finds out if he&#8217;s walking free or starting a long stint in prison after being found guilty of seven serious crimes. Judge Lewis Kaplan of the New York Southern District is the man of the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-28T12:17:02.000Z",
    "title": "A16z co-founder, Galaxy Digital back 1kx’s new $75m crypto fund",
    "url": "https://crypto.news/a16z-co-founder-galaxy-digital-back-1kxs-new-75m-crypto-fund/",
    "description": "Venture capital veterans as well as crypto management firms have lined up to back 1kx&#8217;s new fund focused on crypto consumer apps. Crypto investment firm that specializes in ecosystem growth 1kx has oversubscribed its early-stage venture fund to back crypto&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-28T12:30:06.000Z",
    "title": "Fantom: Market Slowdown Chops Off 10% From Gains – Here’s Why",
    "url": "https://www.newsbtc.com/news/fantom-market-slowdown-chops-off-10-from-gains-heres-why/",
    "description": "Leading the downturn today, Fantom (FTM) contributes to the 2% drop in the crypto market after weeks of growth. Related Reading: From $90 To $400 Litecoin: Analysts Bullish On LTC Soaring Trajectory Fantom is one of those altcoins that followed the broader momentum of the market. The latest market data shows that the token is down 10% in the past 24 hours, but is still on the green in the bi-weekly timeframe at 14%. However, Fantom has a trick up its sleeve to curb this brewing bearishness potentially.  Fantom CEO Michael Kong Unveils Sonic Launch  Sonic is the brand-new technology that the Fantom has been developing in the past 2 years. According to their latest blog post, Sonic was able to surpass the network’s 200 transactions per second metric. Although 200 TPS was already impressive compared to Ethereum’s 12 TPS, the network was quickly congested, and user experience deteriorated.  Kong said in the blog post:  “​​Sonic will be used to create a new best-in-class shared sequencer for L1 and L2 chains, capable of processing over 180 million daily transactions with real, sub-second confirmation times, and serve as the foundation to relaunch Fantom as an entirely new community-centric brand.”  This brand-new tech will cover all parts of the Fantom network, from bridging to a stablecoin launch, Sonic has it all.  Sonic Labs will also gain a slice of the pie as the foundation ultimately adds grant programs alongside the network upgrades.  Bitcoin is now trading at $70.396. Chart: TradingView “We will continue to significantly scale and accelerate our Sonic Labs grant program for developers who build unique and valuable applications and public goods in categories including gaming, DeFi, social media, streaming, and now distributed AI,” Kong added.  This will significantly increase the size of Fantom’s user base, boosting investor confidence, and giving more room for developers to innovate.  Furthermore, the advancements brought forth by Sonic Labs in covering all aspects of the Fantom network, from bridging to the launch of a stablecoin, are poised to have a notable impact on Fantom&#8217;s market dynamics. By streamlining processes, enhancing interoperability, and introducing new functionalities, these developments are likely to enhance the network&#8217;s attractiveness to investors and users alike. Related Reading: Hold Onto Your Seats: XRP Primed For 90% Rally, According To Top Analyst We are thrilled to announce the first of many angel investors that have joined our round! Sam Kazemian (@samkazemian ) is the founder of @FraxFinance ✦, one of the largest DeFi protocols with over $1.6bn in assets such as sfrxETH and the FRAX stablecoin. 🌐 Frax is committed… pic.twitter.com/zSL1XFNHYR — Fantom Foundation (@FantomFDN) March 27, 2024 The Fantom Foundation X account announced today that Frax Finance Founder Sam Kazemain is the first angel investor for Sonic, stating that Frax will deploy natively issued assets on Sonic on its eventual launch. Short-Term Gains Slashed In Favor Of The Long-Term Meanwhile, the bears have completely taken over the FTM market in the short to medium term. Investors in FTM could only hope that the broader market downturn will reverse in the coming weeks.  Featured image from Pexels, chart from TradingView"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-28T12:21:20.000Z",
    "title": "Common Wealth Announced Results of Their Free Fund Campaign",
    "url": "https://www.altcoinbuzz.io/product-release/common-wealth-announced-results-of-their-free-fund-campaign/",
    "description": "<p>Common Wealth closed its first round of its Free Fund Campaign. This week, they announced the results. This means that the first, 1060 people on the leaderboard receive a slice of that fund. Everybody else who made it onto the leaderboard receives their $WLTH token airdrop.  So, how did this Free Fund Campaign by Common [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/product-release/common-wealth-announced-results-of-their-free-fund-campaign/\">Common Wealth Announced Results of Their Free Fund Campaign</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-28T12:11:49.000Z",
    "title": "Cosmos Hub Expands with Bitcoin L2 Staking via Babylon Chain",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/cosmos-hub-expands-with-bitcoin-l2-staking-via-babylon-chain/",
    "description": "<p>This expansion, fueled by the Babylon chain&#8217;s integration, brings Bitcoin staking to the Cosmos ecosystem. Recently, Babylon&#8217;s integration into Cosmos Hub was announced, marking a key evolution milestone. Babylon Integration Marks Cosmos Evolution Facilitated by informing, this integration has paved the way for the arrival of the Lorenzo Protocol. The Lorenzo Protocol introduces advanced Bitcoin [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/cosmos-hub-expands-with-bitcoin-l2-staking-via-babylon-chain/\">Cosmos Hub Expands with Bitcoin L2 Staking via Babylon Chain</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]