[
  {
    "source": "Decrypt",
    "date": "2023-11-17T20:51:46.000Z",
    "title": "Wen Bitcoin ETF? SEC Delays Roll In as Approval Window Closes",
    "url": "https://decrypt.co/206500/bitcoin-etf-sec-delays-approval-window",
    "description": "An eight-day window to approve a Bitcoin ETF opened last week for the SEC. But the regulator appears posed to again punt on applications."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-17T20:47:49.000Z",
    "title": "Sam Altman Out as CEO of OpenAI, Was ‘Not Consistently Candid’ with Company Board",
    "url": "https://decrypt.co/206531/sam-altman-out-as-ceo-of-openai-was-not-consistently-candid-with-company-board",
    "description": "”The board no longer has confidence in his ability to continue leading OpenAI,” a company statement read."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-17T21:00:00.000Z",
    "title": "Crypto Biz: Uniswap’s Android wallet app, Cboe to launch BTC, ETH margin futures, and more",
    "url": "http://cointelegraph.com/news/crypto-biz-uniswap-android-wallet-app-cboe-btc-eth-margin-futures",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/9ab17763-1d59-4b9b-a12f-9973af685853.jpeg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Getting regulatory approval has been crucial for companies, particularly in a tight regulatory environment during the crypto winter. </p>\n                    <p><p>As the final weeks of 2023 approach, it’s fair to say that one of the most dominant trends and drivers of crypto companies’ strategies over the past months can be summed up in a single word: licenses. </p><p>In a tight regulatory environment, getting the green light from regulators has been crucial for companies, particularly during the crypto winter. </p><p>Some countries have taken a stand by developing a crypto-friendly environment. For example, the United Arab Emirates continues to attract major crypto companies to its shores, with digital assets exchange Crypto.com recently <a href=\"https://cointelegraph.com/news/cryptocom-granted-dubai-crypto-licence\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cryptocom-granted-dubai-crypto-licence/amp\">receiving a Virtual Assets Service Provider (VASP) license</a> in Dubai. The license allows Crypto.com’s local business to offer retail and institutional trading, as well as broker-dealer and credit-related services. </p><p>Dubai also <a href=\"https://cointelegraph.com/news/crypto-custodian-hex-trust-receives-dubai-vasp-license\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-custodian-hex-trust-receives-dubai-vasp-license/amp\">granted a similar license</a> for institutional crypto custodian Hex Trust. The crypto firm has offices in Hong Kong, Singapore, Vietnam, Dubai, Italy and France.</p><p>Traditional players are also seeking crypto licenses. In Germany, Commerzbank <a href=\"https://cointelegraph.com/news/commerzbank-granted-crypto-custody-license-in-germany\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/commerzbank-granted-crypto-custody-license-in-germany/amp\">has been granted a crypto custody license</a>, according to a Nov. 15 announcement, allegedly becoming the first “full-service” bank in the country to receive the license. </p><p>Also, in this week’s regulatory headlines, <a href=\"https://cointelegraph.com/news/bitget-drops-crypto-license-hong-kong\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitget-drops-crypto-license-hong-kong/amp\">Bitget dropped plans</a> to obtain a Virtual Asset Trading Platform (VATP) license in Hong Kong, citing business and market-related considerations. As a result, the exchange is winding down its local operations in the coming weeks. </p><p>Although licenses are essential for crypto firms to operate, they also represent a new step in the growing connection between crypto and governments worldwide.</p><p>This week’s Crypto Biz also explores Uniswap’s Android app, Cboe’s move into crypto margin futures trading and Disney’s upcoming nonfungible token (NFT) platform. </p><h3>Uniswap launches Android wallet app with built-in swap function</h3><p>Uniswap Labs has publicly <a href=\"https://cointelegraph.com/news/uniswap-android-app-launch-swap-function\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/uniswap-android-app-launch-swap-function/amp\">released an Android mobile wallet app</a> on the Google Play Store. The new app allows users to make swaps through the decentralized exchange from within the app, eliminating the need for a separate web browser extension, Uniswap Labs vice president of design Callil Capuozzo told Cointelegraph. Uniswap added support for new languages and now supports English, Spanish, Japanese, Portuguese, French and Chinese — both traditional and simplified — and added a setting that allows users to view the value of their crypto in their local currency. The app’s iOS version was released in April.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/7ab77731-edb1-4816-80b5-0e80acb5a5f8.png\"><figcaption style=\"text-align: center;\"><em>Uniswap mobile app demo. Source: Uniswap Labs.</em></figcaption></figure><h3>Disney launches NFT platform with Dapper Labs</h3><p>Disney and blockchain firm Dapper Labs have teamed up to <a href=\"https://cointelegraph.com/news/disney-metaverse-launches-nft-web3-platform-dapper-labs\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/disney-metaverse-launches-nft-web3-platform-dapper-labs/amp\">create a nonfungible token (NFT) platform</a>. According to an announcement, Disney will tokenize its iconic cartoon characters from the past century onto its upcoming NFT marketplace, Disney Pinnacle. The platform will also include icons from Pixar and heroes and villains from the Star Wars galaxy, uniquely styled as collectible and tradable digital pins. The NFT platform will launch later in 2023 for iOS, Android and on the web.</p><h3>Cboe to launch BTC, ETH margin futures trading in January with 11 firms supporting</h3><p>Cboe Digital <a href=\"https://cointelegraph.com/news/cboe-launch-btc-bitcoin-ethereum-eth-margin-futures-trading-january-11-firms-supporting\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cboe-launch-btc-bitcoin-ethereum-eth-margin-futures-trading-january-11-firms-supporting/amp\">has announced the launch</a> of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) margin futures trading on Jan. 11, 2024. The regulated crypto-native exchange and clearinghouse will become the first in the United States to offer both spot and leveraged derivatives trading on a single platform, it said in a statement. Eleven firms, including crypto and traditional financial firms, will support the new capability from its launch. They include B2C2, BlockFills, Cumberland DRW and Talos, among others. Cboe Digital provides trading for individuals and institutions. It received approval for margin futures trading from the U.S. Commodity Futures Trading Commission in June.</p><h3>Goldman Sachs leads $95 million funding round for blockchain payment firm Fnality</h3><p>Global investment bank Goldman Sachs and French bank BNP Paribas have reportedly <a href=\"https://cointelegraph.com/news/goldman-sachs-funding-fnality\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/goldman-sachs-funding-fnality/amp\">led a new funding round for Fnality</a>, a blockchain-based wholesale payments firm backed by Nomura Group. Fnality has reportedly raised 77.7 million British pounds ($95.09 million) in a second round of funding. Other investors included the global exchange-traded fund firm WisdomTree and Fnality’s existing investor Nomura. The new capital will be used for setting up a round-the-clock global liquidity management network for new digital payment models in wholesale financial markets and emerging tokenized asset markets, Fnality said. Fnality was founded in 2019 as a UBS-led blockchain project aiming to build digital versions of major currencies for wholesale payments and transactions involving digital securities.</p><p><em>Crypto Biz is your weekly pulse on the business behind blockchain and crypto, delivered directly to your inbox every Thursday.</em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-17T20:44:15.000Z",
    "title": "Membrane Announces First Derivatives Trade Settled on Network",
    "url": "https://cryptodaily.co.uk/2023/11/membrane-announces-first-derivatives-trade-settled-on-network",
    "description": "Membrane Announces First Derivatives Trade Settled on Network"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-17T20:58:12.000Z",
    "title": "Playnance Partners with Coinstore, Integrating Crypto Trading with P2P Gaming",
    "url": "https://cryptodaily.co.uk/2023/11/playnance-partners-with-coinstore-integrating-crypto-trading-with-p2p-gaming",
    "description": "The Polygon-powered game and B2B Web3 platform Playnance has announced a major partnership with Coinstore, a popular crypto exchange and wallet provider. Under this partnership, Coinstore will channel its extensive user base to Playnance's engaging P2P trading game, where players bet on the price movements of Bitcoin. Coinstore will earn a percentage of the revenue generated from the game."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-17T21:05:10.000Z",
    "title": "XRP drops 5% as prices slump; analysts focus on new altcoin",
    "url": "https://crypto.news/xrp-drops-5-as-prices-slump-analysts-focus-on-new-altcoin/",
    "description": "Bitcoin Minetrix is resilient in the ongoing presale even as the crypto market, including coins like XRP, retrace from recent highs"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-17T21:00:23.000Z",
    "title": "History Repeats? Cardano (ADA) Set To Skyrocket In December, Predicts Analyst",
    "url": "https://www.newsbtc.com/news/cardano/history-repeats-cardano-ada-skyrocket-in-december-analyst/",
    "description": "A recent surge in Cardano (ADA)’s market value has caught the attention of both investors and analysts alike. Over the past 24 hours, ADA has seen a 7% increase, trading at approximately $0.39 at the time of writing. This uptick in value is not just a momentary blip on the radar but a part of a broader trend that mirrors the 2018-2020 consolidation phase of ADA, according to a well-known crypto trader and analyst, Ali. Interestingly, the analyst noted this current consolidation phase comes without the dramatic influence of an event like the Covid-19 crash. Related Reading: Cardano Price Poised To Rally 650% By July 2024: Crypto Analyst Cardano (ADA) To Skyrocket In December Ali has expressed insights on X (formerly known as Twitter), drawing parallels between ADA’s current market behavior and its historical trajectory. If these patterns hold, Ali suggests that ADA might soon break through the $0.45 resistance level, potentially as early as the first week of December. #Cardano&#8216;s current consolidation trend eerily mirrors the 2018-2020 phase without the COVID-19 crash! If so, $ADA could break through the $0.45 resistance around the first week of December. The upswing could send #ADA to $0.75 by late December. Looking to trade this setup? Head… pic.twitter.com/u3KzOsZj2F — Ali (@ali_charts) November 16, 2023 Currently, ADA is trading at around $0.39. Despite a recent uptick in its weekly performance, the asset has experienced a minor pullback from its 24-hour high of $0.40. Although this peak approaches the resistance level highlighted by analyst Ali, ADA appears poised for a potential rally. This is indicated by a significant increase in its daily trading volume, which has risen by over $200 million in the past day, suggesting heightened trading activity for the crypto. Furthermore, as the year approaches, Ali’s prediction for ADA’s price to reach as high as $0.75 during the festive season seems to gain credibility with the recent surge. If ADA continues on this trajectory, it could signify a notable milestone in its journey and potentially reshape investor perspectives on Cardano’s role in the competitive crypto landscape. Media Spotlight And Ethereum’s Alleged Imitation It is worth noting that the recent spotlight on ADA can be partly attributed to the statements made by Steven Nerayoff, a prominent figure in the crypto sphere known for his critical views on Ethereum. Nerayoff’s declaration of ADA as his “top pick in crypto” has fueled media discussions and increased interest in Cardano. His recent public criticism of Ethereum, accusing the platform of imitating Cardano’s innovations, has added a layer of intrigue to the ongoing narrative. This controversy particularly concerns Ethereum revisiting its Plasma scaling solution, first introduced in 2017. What timing! This is why I just said @Cardano_CF is my top pick in crypto. You will hear on the recording me telling @VitalikButerin he made a major mistake in getting rid of @IOHK_Charles &#38; should bring him back. Are the clueless smug @ethereum cultists who got rid of Charles… https://t.co/x5w6yDRB4M — Steven Nerayoff (@StevenNerayoff) November 15, 2023 Members of the Cardano community have not hesitated to point out the similarities between Ethereum’s Plasma and Cardano’s Hydra, a Layer-2 scaling solution. They argue that Plasma’s recent developments closely resemble Hydra’s functionalities. Related Reading: Cardano October Whale Frenzy – What Lies Ahead For November? Whether substantiated or not, such claims contribute to the broader conversation about innovation and originality in the blockchain space. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-17T21:00:36.000Z",
    "title": "Majority of US Institutional Investors Believe Crypto Prices Will Go Up in the Next Year: Coinbase Survey",
    "url": "https://dailyhodl.com/2023/11/17/majority-of-us-institutional-investors-believe-crypto-prices-will-go-up-in-the-next-year-coinbase-survey/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/majority-crypto-will-go.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/majority-crypto-will-go.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/majority-crypto-will-go.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/majority-crypto-will-go.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/majority-crypto-will-go.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/majority-crypto-will-go.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/majority-crypto-will-go.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The majority of institutional investors believe crypto prices will go up in the next year, according to a new survey commissioned by Coinbase. The top US crypto exchange commissioned the business-to-business firm Institutional Investor to conduct the survey, which polled a &#8220;representative sample&#8221; of 250 institutional investors. Of the investors surveyed, 57% of them believe [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/17/majority-of-us-institutional-investors-believe-crypto-prices-will-go-up-in-the-next-year-coinbase-survey/\">Majority of US Institutional Investors Believe Crypto Prices Will Go Up in the Next Year: Coinbase Survey</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-17T20:55:13.000Z",
    "title": "Crypto Analyst Updates Outlook on Bitcoin (BTC), Dogecoin (DOGE) and One Top AI Altcoin",
    "url": "https://dailyhodl.com/2023/11/17/crypto-analyst-updates-outlook-on-bitcoin-btc-dogecoin-doge-and-one-top-ai-altcoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/09/altcoin-bump-bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/09/altcoin-bump-bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/09/altcoin-bump-bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/09/altcoin-bump-bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/09/altcoin-bump-bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/09/altcoin-bump-bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/09/altcoin-bump-bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader is taking a look at king crypto Bitcoin (BTC) while diving into two top altcoin projects. Crypto analyst Rekt Capital tells their 368,900 followers on the social media platform X that history repeating itself could have two very different outcomes for BTC over the coming months. &#8220;If 2016 history repeats &#8211; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/17/crypto-analyst-updates-outlook-on-bitcoin-btc-dogecoin-doge-and-one-top-ai-altcoin/\">Crypto Analyst Updates Outlook on Bitcoin (BTC), Dogecoin (DOGE) and One Top AI Altcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]