[
  {
    "source": "Decrypt",
    "date": "2023-08-07T13:57:47.000Z",
    "title": "Investors Have Stopped Shorting Bitcoin for First Time in 3 Months, Says CoinShares",
    "url": "https://decrypt.co/151595/investors-have-stopped-shorting-bitcoin-for-first-time-in-3-months-says-coinshares",
    "description": "Crypto funds are still taking profits, with the latest CoinShares report revealing the biggest weekly sell-off since March this year."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-07T13:55:22.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting the Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>PayPal launched a new US dollar-backed stablecoin called PayPal USD (PYUSD) — issued by Paxos Trust Co. MakerDAO's new crypto lending platform Spark Protocol has garnered the ire of crypto privacy adv after blocking VPN users from accessing its website. Meanwhile, Coinbase's chief legal officer says the United States Securities and Exchange Commission has overstepped its boundaries in suing the exchange.</p><h2>Breaking: Paypal launches PYUSD stablecoin for payment</h2><p>American financial technology company PayPal launched a new crypto stablecoin called PayPal USD (PYUSD) — issued by Paxos Trust Co. and fully backed by United States dollar deposits, short-term Treasuries and similar cash equivalents.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/3431d815-6f90-4c9a-88f0-ad66c1a21698.png\"  /><figcaption style=\"text-align: center;\"><em>PayPal USD compatibility with crypto exchanges, WEb3 apps and crypto wallets. Source: PayPal</em></figcaption></figure><p>The payment processor claimed that the new stablecoin will soon be availble as a mode of payment for avrious purchases and will be transferable between PayPal and Venmo.</p><p>The firm claimed that the regulatory environment around stablecoin in the U.S. is gradually “progressing toward more clarity” and thus there is a demand for an alternate stablecoin from what is currently available in the market.</p><h3>Controversy as MakerDAO’s Spark Protocol blocks users with VPNs</h3><p>MakerDAO’s recently launched lending platform, Spark Protocol, has <a href=\"https://cointelegraph.com/news/makerdao-spark-protocol-block-vpn-users-controversy\">sparked criticism after blocking users</a> from using VPNs to access the website. </p><p>Cointelegraph found that attempts to access the Spark Protocol website while a VPN is in use will be met with an error: “Accessing this website via VPN is not allowed.”</p><p>In an Aug. 6 tweet, DeFi analyst Chris Blec was among those <a href=\"https://twitter.com/ChrisBlec/status/1688244725512310785\" target=\"_blank\" rel=\"noopener nofollow\">saying</a> he was “disgusted” with the decision, highlighting it effectively acts as a blanket ban on VPNs across the globe, not just in the U.S.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I rarely get as disgusted as I am right now with MakerDAO&#39;s Spark Protocol.<br><br>It&#39;s one thing to block US residents. <br><br>It&#39;s a whole other thing to block anyone in the entire world who is using a VPN for privacy.<br><br>This isn&#39;t just govt cuckery.<br><br>This is an actual war on privacy. <a href=\"https://t.co/dUbsMeVzbZ\">pic.twitter.com/dUbsMeVzbZ</a></p>&mdash; Chris Blec (@ChrisBlec) <a href=\"https://twitter.com/ChrisBlec/status/1688244517525139456?ref_src=twsrc%5Etfw\">August 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The measure appears to be linked to Maker’s attempt to restrict United States users from accessing the crypto lending platform, <a href=\"https://www.sparkprotocol.io/terms-of-use.html\" target=\"_blank\" rel=\"noopener nofollow\">discussed</a> in a May 9 update to Spark Protocol’s terms of service that warns against the use of VPNs to circumvent the block. </p><h2>Coinbase lawyers allege SEC \"violated due process\"</h2><p>The Securities and Exchange Commision has <a href=\"https://cointelegraph.com/news/sec-violated-due-process-coinbase-chief-legal-officer-motion-dismiss-lawsuit\">“violated due process”</a> in suing Coinbase, according to the exchange’s legal counsel. </p><p>In an Aug. 4 filing with a New York District Court, Coinbase said the SEC “abused its discretion, and abandoned its own earlier interpretations of securities laws” in going after the exchange. The legal team said the <a href=\"https://cointelegraph.com/learn/the-sec-vs-ripple-lawsuit-everything-you-need-to-know\">SEC v. Ripple</a> case demonstrates that the securities regulator overstepped its boundaries after a judge ruled that XRP largely doesn’t qualify as a security. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, <a href=\"https://twitter.com/coinbase?ref_src=twsrc%5Etfw\">@coinbase</a> filed our brief asking the Court to dismiss the SEC’s case against us. Our core argument is simple — we do not offer &quot;investment contracts&quot; as that term has been construed by decades of Supreme Court and other binding precedent. 1/3 <a href=\"https://t.co/r2EkDgkEuc\">https://t.co/r2EkDgkEuc</a></p>&mdash; paulgrewal.eth (@iampaulgrewal) <a href=\"https://twitter.com/iampaulgrewal/status/1687435194247303168?ref_src=twsrc%5Etfw\">August 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The SEC sued Coinbase on June 6, roughly three months after the crypto exchange received a Wells notice from the securities regulator. The SEC is also pursuing legal actions against Binance and Hex founder Richard Heart. </p><p>Crypto winter has been rough on Coinbase, but there are signs that the exchange is returning to stability. On Aug. 3, <a href=\"https://cointelegraph.com/news/coinbase-q2-profits-blackrock-custody-institution\">Coinbase reported</a> better-than-expected second-quarter revenues and a much smaller loss than previous quarters. </p><h3>Canadian crypto ownership declines amid tight regulations, falling prices</h3><p>The Bank of Canada (BoC) reported a decline in the ownership of Bitcoin and cryptocurrencies in the country in 2022, as neither market conditions nor regulations acted in favor of Canadian crypto investors, according to a BoC study published on July 26.</p><p>The study includes data from the annual Bitcoin Omnibus Survey conducted by the Canadian central bank, which showed a relapse from the massive crypto adoption witnessed in 2021.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/6f82d695-8541-4039-9db0-d0ed23207cae.png\"  /></figure><p>The above graph shows that Bitcoin ownership in Canada declined to 9% by August 2022. However, BTC adoption saw a slight uptick to 10% by the end of the year, and the drop in Bitcoin ownership does not imply that investors were spreading out their investments into other cryptocurrencies. The report read:</p><blockquote>“Investors did not appear to shift out of Bitcoin and into other cryptoassets, as we observe decreased ownership of altcoins.”</blockquote><p>The biggest motivation for Canadians interested in Bitcoin is as an investment, according to over one-third of the 4,996 respondents in the Bank of Canada’s 2022 survey.</p><p>Most Canadians acquired their crypto holdings through mobile and web apps. Bitcoin and crypto mining became the third-most-popular method of accumulating tokens for the second consecutive year.</p><h3>Coinbase to file order seeking dismissal of SEC lawsuit</h3><p>Coinbase is planning file an order <a href=\"https://cointelegraph.com/news/coinbase-to-file-order-seeking-dismissal-of-sec-lawsuit\">seeking dismissal of the lawsuit</a> by the Securities and Exchange Commission on Aug. 4.</p><p>On its Aug. 3 <a href=\"https://cointelegraph.com/news/coinbase-q2-profits-blackrock-custody-institution\">second-quarter 2023 earnings</a> call, Coinbase chief legal officer Paul Grewal expressed confidence the exchange would win the court case brought by the regulator.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">“For most people, Friday’s just the day before the weekend. But after this Friday, the neighborhood’ll never be the same.” <a href=\"https://t.co/0z0q8kZ9Tl\">https://t.co/0z0q8kZ9Tl</a></p>&mdash; paulgrewal.eth (@iampaulgrewal) <a href=\"https://twitter.com/iampaulgrewal/status/1687266550267670528?ref_src=twsrc%5Etfw\">August 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<blockquote>“Tomorrow [...] We will be moving the court for an order dismissing the case in its entirety.”</blockquote><p>The revelation comes as the exchnage posted $663 million in net revenue for the second quarter of 2023.</p><p>Interestingly, the exchange’s non-trading revenue surpassed its trading revenue in the quarter, with $335.4 million of net revenue coming from subscriptions and services compared to $327 million in transaction revenue.</p><p>Coinbase CEO Brian Armstrong said on an Aug. 3 earnings call that it was focused on the non-trading parts of the business over the next three to five years, naming scalability, regulatory clarity and driving crypto utility as focus areas.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-07T14:07:25.000Z",
    "title": "PayPal launches ERC20 stablecoin ‘PYUSD’ with Paxos",
    "url": "https://cryptoslate.com/paypal-launches-erc20-stablecoin-pyusd-with-paxos/",
    "description": "<p>In a move signaling the significant shift towards digital currencies, PayPal has announced the launch of its U.S. dollar-backed stablecoin – PayPal USD (PYUSD). This development, announced by PayPal directly, adds a new dimension to the emerging potential of regulated, fully-backed stablecoins in transforming payments in digitally native environments like web3. The news comes after [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/paypal-launches-erc20-stablecoin-pyusd-with-paxos/\">PayPal launches ERC20 stablecoin &#8216;PYUSD&#8217; with Paxos</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-08-07T14:05:33.000Z",
    "title": "India House passes bill to ease BigTech data compliance ",
    "url": "https://cointelegraph.com/news/india-house-passes-bill-to-ease-bigtech-data-compliance",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/9453924d-3f83-4a20-b707-c2777ad763e4.jpg\"></p><p>The lower house in the parliament of India approved updates to a bill that would ease data storage, processing and transfer standards for BigTech companies.  </p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-07T13:57:16.000Z",
    "title": "Alphabet Dumps Almost 90% Stake in Robinhood",
    "url": "https://cryptodaily.co.uk/2023/08/alphabet-dumps-almost-90-stake-in-robinhood",
    "description": "<p>Alphabet, the parent company of Google, said it had reduced its stake in trading app operator Robinhood Markets by nearly 90%. </p>\n<p>According to an SEC filing, Alphabet reduced its exposure to Robinhood Market by 90%.</p>\nGoogle-Parent Company Dumps Robinhood Stock\n<p>Alphabet cut its exposure to Robinhood Markets by nearly 90% as Robinhood experiences difficulties with a slowdown in its business. According to reports by Reuters, Alphabet invested in the trading app operators when it was still an unlisted startup. The company reportedly held over 4.9 million Robinhood shares by the end of 2021.</p>\n<p>Robinhood shares peaked in August 2021, and soon after its IPO, Alphabet&rsquo;s stake was worth approximately $419 million.</p>\n<p>Since reaching their high in 2021, Robinhood&rsquo;s shares have dropped 86%. The company has struggled since its IPO after seeing a massive user surge during the pandemic.</p>\n<p>Robinhood has, however, been very involved in the memecoin frenzy and retail trading outrage at payment for order flow, CNBC reports.</p>\n<p>Robinhood recorded a profit last week for the first time since becoming a public company.</p>\nRobinhood Undertakes Third Round of Layoffs in a Year\n<p>The famous online brokerage firm announced in June that it would lay off around 150 full-time employees, around 7% of its workforce.</p>\n<p>The most recent wave of job cuts marks Robinhood&rsquo;s third round in just over a year, reflecting the company&rsquo;s struggles with ongoing market fluctuations.</p>\n<p>The company further recorded a 30% loss in Q1 2023. The trading app said its crypto business brought in $38 million in Q1, down 30% from $54 million in Q2 2022.</p>\n<p>Robinhood struggles have been exacerbated after the SEC sued Binance and Coinbase and alleged specific crypto tokens were securities. In the days following the lawsuits, Robinhood removed Solana, Cardano, and Polygon from its platform.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-07T14:00:38.000Z",
    "title": "Stablecoin Turmoil: $1.53 Billion Redeemed in a Month Amid Declining Trade Volume",
    "url": "https://news.bitcoin.com/stablecoin-turmoil-1-53-billion-redeemed-in-a-month-amid-declining-trade-volume/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/digital-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Stablecoin Turmoil: $1.53 Billion Redeemed in a Month Amid Declining Trade Volume\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/digital-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/digital-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/digital-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/digital-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/digital-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/digital-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/digital.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In the brief span from July 12, 2023 to August 6, 2023, the stablecoin economy witnessed a staggering loss exceeding $1.53 billion in value. Among the premier ten stablecoins, Pax&#x2019;s pax dollar (USDP) experienced a redemption of 39% of its supply over the preceding 30 days. Unstable Times for Stablecoins: Major Players Hit with Sweeping [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T13:47:57.000Z",
    "title": "Digital Yuan adoption soars as Minsheng bank and JD.com join forces",
    "url": "https://www.cryptopolitan.com/digital-yuan-adoption-soars-as-minsheng-bank-and-jd-com-join-forces/",
    "description": "Minsheng Bank of China, a pioneer in digital yuan adoption, has partnered with e-commerce giant JD.com to launch an innovative digital CNY-powered payment solution. The collaboration aims to bring the benefits of China&#8217;s Central Bank Digital Currency (CBDC) to Minsheng Bank clients in the CBDC trial zone, offering them seamless CBDC payments on JD.com by ... <a title=\"Digital Yuan adoption soars as Minsheng bank and JD.com join forces\" class=\"read-more\" href=\"https://www.cryptopolitan.com/digital-yuan-adoption-soars-as-minsheng-bank-and-jd-com-join-forces/\" aria-label=\"More on Digital Yuan adoption soars as Minsheng bank and JD.com join forces\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-07T13:45:44.000Z",
    "title": "Borroe stands out amid ApeCoin and Compound collapse",
    "url": "https://crypto.news/borroe-stands-out-amid-apecoin-and-compound-collapse/",
    "description": "This article explores why analysts and experts are bullish on Borroe and its potential to possibly transform web3"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-07T14:00:32.000Z",
    "title": "XRP Journey To $10: Unveiling The Forces That Could Trigger An Upward Momentum",
    "url": "https://www.newsbtc.com/all/xrp-journey-to-10-unveiling-the-forces-that-could-trigger-an-upward-momentum/",
    "description": "XRP is currently undergoing a notable price correction, with a 24-hour decline of 2.2% and a seven-day slump of 12.1%, bringing its price to $0.61 according to CoinGecko.  However, amidst this downturn, prominent crypto YouTuber and XRP analyst, Alex Cobb, has set an ambitious price target of $10 for the digital asset, employing the Elliott Wave Theory to analyze its monthly price chart. Related Reading: PEPE’s Future: Will Prices Of Meme Coins Continue To Drop? Source: Coingecko Understanding Elliott Wave Theory Elliott Wave Theory is a technical analysis approach that seeks to predict price movements in financial markets by identifying recurring patterns in market sentiment. It is named after its creator, Ralph Nelson Elliott, who proposed that market prices unfold in repetitive patterns of five upward waves, called impulse waves, and three downward corrective waves. These waves are believed to reflect the psychology of market participants, alternating between optimism and pessimism. XRP/USD 30-day price chart. Source: FXstreet/TradingView Amidst the bearish sentiment surrounding XRP, Cobb&#8217;s prediction of a $10 price target showcases his optimism and faith in the potential of the cryptocurrency. Cobb&#8217;s application of Elliott Wave Theory to the monthly price chart of XRP has led him to believe that a significant upward movement is on the horizon, potentially taking the price to unprecedented levels. Ripple&#8217;s Expanding Ecosystem Despite the current market challenges, Ripple, the company behind XRP, has been making notable strides in expanding its ecosystem. A major boost came in the form of Ripple&#8217;s membership acquisition in the International Swaps and Derivatives Association (ISDA), granting access to a massive derivatives market.  This move has positioned Ripple among over a thousand member institutions from 79 countries, potentially opening new avenues for XRP&#8217;s adoption. XRP market cap at $32.6 billion on the daily chart: TradingView.com Bullish Sentiment And Recent Developments Meanwhile, Ripple&#8217;s partial victory against the US Securities and Exchange Commission (SEC) has acted as a catalyst for bullish sentiment within the XRP community. With more clarity on XRP&#8217;s legal status as &#8220;not an investment contract,&#8221; Ripple has been able to focus on its developmental efforts and forge new partnerships. These developments, coupled with the company&#8217;s strides in technology and collaborations, drive the adoption of XRP tokens across various use cases. Related Reading: Shiba Inu: More Bite Than Bark Over The Weekend With Over 15% Jump A recent analysis reveals that XRP finds itself at a crucial juncture as it clings to the 50 Exponential Moving Average (EMA) support level. This level has historically provided strong support during market downturns, often acting as a springboard for price rebounds. While the current market conditions are challenging, the reliance on this support level gives hope to XRP enthusiasts that a potential price recovery might be on the horizon. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Crypto News Flash"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-07T14:00:25.000Z",
    "title": "Exchange Tokens, OKB and BNB, Slip After SEC Comments, Investors Fast Turning to $ROE – Here’s Why",
    "url": "https://www.crypto-news-flash.com/exchange-tokens-okb-and-bnb-slip-after-sec-comments-investors-fast-turning-to-roe-heres-why/?utm_source=rss&utm_medium=rss&utm_campaign=exchange-tokens-okb-and-bnb-slip-after-sec-comments-investors-fast-turning-to-roe-heres-why",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T094230.000.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T094230.000.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T094230.000-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T094230.000-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T094230.000-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T094230.000-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the world of cryptocurrencies, reactions to regulatory shifts and scrutiny can bring about significant market shifts. Recently, comments from the U.S. Securities and Exchange Commission (SEC) have triggered a decline in the value of major exchange tokens OKB and BNB.  This has prompted investors to seek more secure and promising alternatives. One such alternative [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-07T13:50:00.000Z",
    "title": "SEC, Not Judge — Legal Expert Backs Torres’ Decision to Categorized Sales",
    "url": "https://coinedition.com/sec-not-judge-legal-expert-backs-torres-decision-to-categorized-sales/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/SEC-12.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/SEC-12.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/SEC-12-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/SEC-12-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/SEC-12-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/SEC-12-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/SEC-12-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/SEC-12-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/SEC-12-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/SEC-12-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/SEC-12-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/SEC-12-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/SEC-12-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/SEC-12-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/SEC-12-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/SEC-12-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/SEC-12-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent analysis of the ruling in the SEC v. Ripple case, legal expert Bill Morgan defends the Torres decision, stating that he sees no error in the judge’s approach. Morgan concludes that Judge Torres&#8217; ruling was not only fair to the SEC but also grounded in a thorough analysis of the facts presented. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sec-not-judge-legal-expert-backs-torres-decision-to-categorized-sales/\">SEC, Not Judge — Legal Expert Backs Torres’ Decision to Categorized Sales</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-07T13:40:14.000Z",
    "title": "Sweat Economy Price Prediction 2023-2030: Will SWEAT Price Hit $0.025 Soon?",
    "url": "https://coinedition.com/sweat-economy-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Sweat-Economy-SWEAT-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Sweat-Economy-SWEAT-Price-Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Sweat-Economy-SWEAT-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Sweat-Economy-SWEAT-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Sweat-Economy-SWEAT-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Sweat-Economy-SWEAT-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Sweat-Economy-SWEAT-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bullish Sweat Economy (SWEAT) price prediction ranges from $0.0100 to $0.100. Analysis suggests that the SWAET price might reach above $0.0165. The SWEAT bearish market price prediction for 2023 is $0.0042. Sweat Economy is an Ethereum-based fitness app that rewards its users for being healthy. Its native token is denoted as SWEAT. SWEAT investors are [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sweat-economy-price-prediction/\">Sweat Economy Price Prediction 2023-2030: Will SWEAT Price Hit $0.025 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]