[
  {
    "source": "Decrypt",
    "date": "2023-06-28T08:16:02.000Z",
    "title": "Not Your Keys, Not Your Crypto: What to Know Before the Next FTX-type Meltdown",
    "url": "https://decrypt.co/resources/coins-keys-wallet",
    "description": "The popular adage, Not your Keys, Not your Coins, is making the rounds in the wake of the latest exchange meltdown. But what does it actually mean?"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T08:21:11.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-28T08:35:13.000Z",
    "title": "FTX’s $500m stake sale in AI startup delayed, hampering $2b deficit recovery",
    "url": "https://crypto.news/ftxs-500m-stake-sale-in-ai-startup-delayed-hampering-2b-deficit-recovery/",
    "description": "FTX&#8217;s sale of its $500 million stake in Anthropic, an AI startup, has been halted, making it harder for the bankrupt crypto exchange to address its $2 billion deficit. According to insiders familiar with the matter cited by Bloomberg on&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-28T08:31:51.000Z",
    "title": "More institutions will soon embrace bitcoin, report says",
    "url": "https://crypto.news/more-institutions-will-soon-embrace-bitcoin-report-says/",
    "description": "The crypto industry has witnessed a massive bear storm over the past 18 months as high inflation threats finances. Despite the red market conditions, a recent report by CryptoQuant suggests that Bitcoin’s (BTC) institutional adoption is on the rise. For&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-28T08:26:45.000Z",
    "title": "Israel seized crypto worth millions of dollars from accounts linked to Iran and Hezbollah",
    "url": "https://crypto.news/israel-seized-crypto-worth-millions-of-dollars-from-accounts-linked-to-iran-and-hezbollah/",
    "description": "The Defense Minister of Israel, Yoav Gallant, said the government had seized millions of dollars worth of cryptocurrencies linked to Iran’s military arm, Quds Force, and the Lebanese militant group Hezbollah. According to a report by Associated Press (AP), the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T08:25:09.000Z",
    "title": "Ripple Vs. SEC: Deaton Predicts New Verdict Date, But XRP Price Loses Steam",
    "url": "https://www.newsbtc.com/news/ripple/ripple-vs-sec-deaton-verdict-date-xrp-loses-steam/",
    "description": "The XRP community continues to eagerly await a ruling in the legal battle between Ripple Labs and the US Securities and Exchange Commission (SEC). So far, all speculations about a supposed end date have been wrong. The judge in charge, Analisa Torres, is taking more time for her ruling than many legal experts predicted based on previous proceedings. However, this does not stop lawyer John E. Deaton, who is representing the XRP army in the legal case as amicus curiae, from making a new prediction. In the latest CryptoLaw broadcast, lawyer Deaton speculated that Judge Torres will issue the summary judgment on September 6, 2023. Ripple Vs. SEC: Why September 6 Might Be The End Date In the live stream, the lawyer explains that he has tried to give a prediction for a verdict date several times in the past. For this, he looked at Judge Torres&#8217; previous proceedings. The finding was that Torres ruled at different speeds once the Daubert/expert motions were decided: sometimes it was on the same day, in other cases it was after two, four and six months respectively. Related Reading: XRP Traders Show Capitulation, Why This Could Be Bullish Based on this, Deaton made the prediction that Judge Torres will rule on May 6, by early June at the latest (the average: three months). As a reminder, Torres ruled on the Daubert motions in the case between Ripple and the SEC on March 6 this year. Now that those deadlines have passed, Deaton came up with a new prediction: according to the lawyer, Judge Torres will issue a summary judgment after the full six months, on September 6 this year. As Deaton also pointed out, the length of the litigation between Ripple and the SEC is within the usual range so far and does not take longer than other cases. In another comment, Deaton noted that Judge Torres may delay the ruling because she understands the importance of the SEC v. Ripple case. She knows that thousands of people, including the appellate courts, will be reviewing her summary judgment decision in the Ripple case. She also has a staggering 500 open cases to decide, 44 of which are criminal cases. Ripple: Waiting on a Decision https://t.co/ty0LG3AASV — CryptoLaw (@CryptoLawUS) June 27, 2023 XRP Price Loses Steam The delay of the ruling in the legal battle between Ripple and the SEC seems to have upset XRP investors. A look at the 1-day chart of XRP shows that the price is in a descending trend channel after the price failed to break above the resistance at $0.50 in the higher time frames over the past two weeks. Related Reading: Ripple Emails Reveal: XRP Buybacks Were On The Table To Prop Up Price A breakout from the trend channel is crucial to make a new run towards resistance at $0.50. Currently, XRP is testing the middle line of the trend channel. A break below $0.4730 could mean a further drop towards the lower end of the trend channel at $0.46. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T08:30:59.000Z",
    "title": "Shiba Inu Coin  Rockets to New Heights, Surging 20% in Just 7 Days! Is This the Hottest Investment Opportunity of the Year?",
    "url": "https://www.crypto-news-flash.com/shiba-inu-coin-rockets-to-new-heights-surging-20-in-just-7-days-is-this-the-hottest-investment-opportunity-of-the-year/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-coin-rockets-to-new-heights-surging-20-in-just-7-days-is-this-the-hottest-investment-opportunity-of-the-year",
    "description": "The crypto market has always been marked by volatility and unpredictability, full of dramatic highs and lows. The recent surge of Shiba Inu, a popular meme-inspired token, has once again demonstrated this reality. In a remarkable turn of events, the price of Shiba Inu has skyrocketed by an astounding 20% in just seven days, leaving [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T08:27:52.000Z",
    "title": "Stellar-Powered International Payroll: Bitwage Partners with Vibrant Wallet for Seamless Digital Dollar Integration",
    "url": "https://www.crypto-news-flash.com/stellar-powered-international-payroll-bitwage-partners-with-vibrant-wallet-for-seamless-digital-dollar-integration/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-powered-international-payroll-bitwage-partners-with-vibrant-wallet-for-seamless-digital-dollar-integration",
    "description": "Bitwage collaborates with Vibrant Wallet to enhance global payroll and freelancer management. The partnership enables easy and cost-effective payments using stablecoins like Stellar USDC. Bitwage, the global payroll and freelancer management platform, has teamed up with Vibrant Wallet to revolutionize the way workers worldwide receive their wages, according to a recent announcement by Team Bitwage. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T08:20:00.000Z",
    "title": "Grayscale Bitcoin Trust Pumps to New Yearly High as Bloomberg Lawyer Expects Approval Soon, Ahead of BlackRock",
    "url": "https://www.crypto-news-flash.com/grayscale-bitcoin-trust-pumps-to-new-yearly-high-as-bloomberg-lawyer-expects-approval-soon-ahead-of-blackrock/?utm_source=rss&utm_medium=rss&utm_campaign=grayscale-bitcoin-trust-pumps-to-new-yearly-high-as-bloomberg-lawyer-expects-approval-soon-ahead-of-blackrock",
    "description": "Bloomberg analysts note that Grayscale has a 70% chance of winning the lawsuit against the SEC for the approval of its spot Bitcoin ETF. The BTC price shot to a one-year high of $31,000 on Tuesday, with institutionals inflows skyrocketing amid a flurry of Bitcoin ETF applications. Following the filings of multiple Bitcoin ETF applications [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-28T08:36:45.000Z",
    "title": "The Future of Bitcoin, Part 1",
    "url": "https://www.altcoinbuzz.io/top-article/the-future-of-bitcoin-part-1/",
    "description": "<p>Michael Saylor and MicroStrategy. If you hear this combination, you most likely associate this with Bitcoin. And no wonder. They are the largest private company that holds Bitcoin on its balance sheet. Michael Saylor is one of the biggest Bitcoin maxis. If you start doubting Bitcoin, listen to one of his speeches. That&#8217;s precisely what [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/top-article/the-future-of-bitcoin-part-1/\">The Future of Bitcoin, Part 1</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-28T08:16:30.000Z",
    "title": "HIDDEN CRYPTO GEM – Best Bitcoin Layer -2?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/hidden-crypto-gem-best-bitcoin-layer-2/",
    "description": "<p>When I say Lightning Network, what do you think of first? Probably it’s Bitcoin, micropayments or it can be difficult to use at times. And all 3 of these are true. But micropayments in general are important for crypto. And Bitcoin micropayments are particularly important if we think Bitcoin is the future of money. We [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/hidden-crypto-gem-best-bitcoin-layer-2/\">HIDDEN CRYPTO GEM &#8211; Best Bitcoin Layer -2?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-28T08:18:00.000Z",
    "title": "HKVAC’s Virtual Asset Index Excludes Top Cryptocurrencies",
    "url": "https://coinedition.com/hkvacs-virtual-asset-index-excludes-top-cryptocurrencies/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"HKVAC Excludes Top Cryptos\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/HKVAC-Excludes-Top-Cryptos-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The rating agency Hong Kong Virtual Asset Consortium’s (HKVAC) recent release of the virtual asset index has been a subject of controversy since the agency excluded the leading cryptocurrencies like SOL, AVAX, UNI, and ETC while it included FTM and EOS. Responding to the dissension, HKVAC assured that the agency would rebalance the index by [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/hkvacs-virtual-asset-index-excludes-top-cryptocurrencies/\">HKVAC’s Virtual Asset Index Excludes Top Cryptocurrencies</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]