[
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T09:28:41.000Z",
    "title": "Clarity needed on crypto lending regulations — UK Law Commission",
    "url": "https://cointelegraph.com/news/crypto-lending-uk-clarity-needed-on-crypto-lending-regulations-uk-law-commission",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/e41afcab-d1f2-4d54-b2b9-9a7fcb55d28c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Law Commission’s recommendations highlights the need to clarify whether cryptocurrency lending falls under existing financial collateral regulations.</p>\n                    <p><p>A lawyer leading the United Kingdom’s Law Commission’s review on the application of British laws towards digital assets has stressed the need for further clarity around cryptocurrency lending.</p><p>Laura Burgoyne unpacked the details of the organization's four major recommendations to the U.K. government in an interview with Cointelegraph. This comes after a<a href=\"https://cointelegraph.com/news/uk-law-commission-to-review-international-laws-on-crypto-to-consider-legal-reforms\"> lengthy review process of existing legal frameworks</a> in the country and how they’ve been applied to the digital asset sector to date.</p><p>As <a href=\"https://cointelegraph.com/news/crypto-law-united-kingdom-law-commission-recommends-crypto-law-reforms\">reported</a> by Cointelegraph on July 3, the Law Commission is calling for the creation of a distinct category of personal property for cryptocurrencies and digital assets. In addition, the body recommended the establishment of an industry-specific panel, the creation of a legal framework for crypto-related assets as well as legal reforms to clarify whether the asset class falls under the scope of the U.K.’s Financial Collateral Arrangements Regulations (FCAR).</p><p>Burgoyne highlighted the importance of FCAR in allowing traditional finance intermediaries to take security over assets ‘free from a number of restrictions and formalities’ which would traditionally apply.</p><p>In the context of finance, <a href=\"https://www.investopedia.com/terms/s/security-interest.asp\" target=\"_blank\" rel=\"noopener nofollow\">security interest</a> gives a legal claim over an asset that a borrower has supplied to a lender in the event that the loanee is unable to meet their repayment obligations. Burgoyne told Cointelegraph the purpose of these provisions is to streamline asset security in the event that an investor defaults on their obligations or becomes insolvent.</p><blockquote>“They are an important instrument in the use and regulation of collateral arrangements and it is necessary for smooth operation of the crypto market, and for market certainty, to know whether the FCARs apply in the context of collateral arrangements in respect of certain digital assets.”</blockquote><p>Whether cryptocurrencies, digital assets and other tokens can be used as collateral under a qualifying financial collateral arrangement is dependent on whether the assets in question can constitute “cash”, “financial instruments”, or “credit claims” in accordance with FCARs.</p><p>Burgoyne added that the scope of the ‘FCARs regime is largely a question of legal interpretation’ and whether the policy applies to new asset classes including crypto-tokens, CBDCs and stablecoins requires an evaluation of the existing law:</p><blockquote>“For this reason, we think there is a need to review the situation and make the matter clear.”</blockquote><h2>Personal property law works, but new category needed</h2><p>The Law Commission’s main recommendation was centered around existing personal property laws in the UK and how they’ve been applied to cryptocurrency and digital asset legal proceedings to date.</p><p>As Burgoyne explains, personal property law is traditionally a common law matter rather than a statutory law matter. Common law, which is developed by the court system and not parliament, has been considered ‘flexible’ enough to respond to an ‘infinite variety’ of circumstances and disputes:</p><blockquote>“In the past decade, the courts have had to grapple with disputes concerning digital assets and for the most part have been able to find appropriate solutions coming out of the common law.”</blockquote><p>The need for a ‘distinct’ third category of personal property law pertaining to digital assets is driven by the fact that digital assets do not easily fit into the existing personal property categories.</p><p><strong><em><a href=\"https://cointelegraph.com/news/uk-financial-watchdog-reminds-crypto-firms-october-deadline-marketing-compliance\">Related: UK financial watchdog reminds crypto firms of October deadline for marketing compliance</a></em></strong></p><p>The existing types of personal property law in the U.K. include ‘things in possession’ like a vehicle or personal computer and ‘things in action’ which could be legal rights or debts owed. </p><blockquote>“Digital assets do not fit easily into either category, and applying the legal rules of one or other category to digital assets does not always reach what appears to be an obvious, fair or even workable result.”</blockquote><p>Burgoyne added that the Law Commission’s recommendations were kept deliberately short and targeted. Setting up an expert working group and targeting statutory reform only where common law is unable to settle disputes is intended by government to institute the recommendations with limited delay.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\">Tornado Cash 2.0: The race to build safe and legal coin mixers</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-05T09:30:00.000Z",
    "title": "Azuki DAO To Sue Project Founder Over Allegations Of Misconduct",
    "url": "https://cryptodaily.co.uk/2023/07/azuki-dao-to-sue-project-founder-over-allegations-of-misconduct",
    "description": "<p>Members of the Azuki decentralized autonomous organization (DAO) have initiated a Snapshot proposal to hold the project&rsquo;s founder accountable over allegations of misconduct.&nbsp;</p>\n<p>The accusations arise from the release of Azuki&rsquo;s Elementals collection, which launched last month, with buyers complaining that the NFTs are extremely similar to the original set, sold in 2022.&nbsp;</p>\nA Frustrated Community&nbsp;\n<p>The latest collection, called Elementals, could only be minted by users who held the original Azuki collection and a side project called BEANZ. The new set of NFTs, which represented half a suite of a collection of 20,000 profile pictures (PFPs), sold out in less than 15 minutes. The sale was able to raise 20,000 ETH ($39.4 million) for Chiru Labs, the LA-based startup that is behind the NFT collection, having a mint price of 2 ETH ($3900). The original Azuki collection had a floor price of 6.3 ETH ($12,400).&nbsp;</p>\n<p>However, after the sale, some buyers began complaining that the new collection was too similar to the original Azuki PFPs sold in 2022. The Snapshot proposal states,&nbsp;</p>\n\n<p>&ldquo;We have provided support to Azuki during its highs and lows. We have contributed to building a sub-community and promoting the brand in various ways, mostly on social media such as Redbook, Twitter, and in our discord. Despite our efforts, we have only been given a similar profile picture to that of the original Azuki holders and nothing more. The team is blatantly scamming us with empathy checks and promises.&rdquo;</p>\n\n<p>If passed, the DAO proposal would look for a lawyer to initiate a suit against the pseudo-anonymous co-founder of Azuki, Zagabond. It would also seek a refund, with all funds directed towards the project&rsquo;s growth and supporting research required for the lawsuit. Zagabond is the pseudo-anonymous founder of Chiru Labs, Azuki&rsquo;s parent company.&nbsp;</p>\n<p>The DAO claims that the Azuki team has done nothing but issue the community members a profile picture similar to that of the original Azuki holders and nothing more and is convinced that the team is scamming them. The DAO members are overwhelmingly in favor of filing a lawsuit against Zagabond, retrieving a refund of 20,000 ETH, and redirecting it towards the project&rsquo;s growth.&nbsp;</p>\n\n<p>&ldquo;Azuki Dao hires a lawyer and files a lawsuit against Zagabond for rugging multiple projects. Azuki Dao retrieves a refund of 20,000E from the team and allocates it to the Dao to promote the growth of the entire Azuki community and provide rewards and incentives for artists, content creators, and builders.&rdquo;</p>\n\n<p>Zagabond had admitted in 2022 that he had abandoned three NFT projects, Tendies, CryptoPhunks, and CryptoZunks. He had claimed at the time that he was not happy with the development of the projects in question, an admission that had generated significant controversy at the time. So far, voting data has revealed that over 60% of the DAO members have voted in favor of the proposal.</p>\nNot An Official Organization&nbsp;\n<p>However, it must also be noted that the Azuki DAO is not an official organization associated with the project. The group claims that it was formed to support the project, with the token being utilized for voting minted just over the weekend and airdropped to Azuki holders. Twitter user @tytaninc highlighted the same, stating that the group could have malicious intent.&nbsp;</p>\n\n<p>&ldquo;Here&rsquo;s more info on where the original tweet about the AzukiDAO came from. Most Azuki holders have never heard of this group and assume it&rsquo;s either fake or a group with malicious intent. The token for voting was minted two days ago, sooo there&rsquo;s that.&rdquo;</p>\n\nAzuki Team Addresses Backlash&nbsp;\n<p>The Azuki team addressed the backlash on Twitter, stating that it had missed the mark with the collection and that the mint process was extremely hectic. The team tweeted on their official handle,&nbsp;</p>\n\n<p>&ldquo;This time, we missed the mark,&rdquo; and acknowledging that &ldquo;the [profile picture NFTs] feel similar and, even worse, dilutive to Azuki. Azuki&rsquo;s vision is to build a decentralized brand. Doing so requires great communication and execution, both of which were lacking with the Elementals sale. We know that we lost a piece of trust today, but nothing gets us more motivated to make things right.&rdquo;</p>\n\n<p>The CEO of NFT gaming studio MyMetaverse, Simon Kertonegoro also criticized the project, stating,&nbsp;</p>\n\n<p>&ldquo;It is absolutely the project&rsquo;s responsibility to create real products that can generate real revenue from outside markets. We need to normalize crypto and NFT projects as having real business models. They need to serve the wider market.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-05T09:30:50.000Z",
    "title": "Accept the ‘Best and Final Offer’ or Face Legal Action Gemini’s Cameron Winklevoss Tells DCG Founder",
    "url": "https://news.bitcoin.com/accept-the-best-and-final-offer-or-face-legal-action-geminis-cameron-winklevoss-tells-dcg-founder/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/wink-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Accept the &#039;Best and Final Offer&#039; or Face Legal Action Gemini&#039;s Cameron Winklevoss Tells DCG Founder\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/wink-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wink-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wink-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wink-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wink-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wink-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wink.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to Cameron Winklevoss, the co-founder of the crypto exchange Gemini, a lawsuit will be filed on July 7 against Barry Silbert and the Digital Currency Group if the latter two fail to accept creditors&#x2019; &#x201C;best and final offer.&#x201D; Winklevoss also vowed to work with the Genesis Special Committee &#x201C;to advance a non-consensual plan that [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-05T09:34:45.000Z",
    "title": "Crypto Whales are to meet at Blockchain Life 2023 in Dubai",
    "url": "https://www.crypto-news-flash.com/crypto-whales-are-to-meet-at-blockchain-life-2023-in-dubai/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-whales-are-to-meet-at-blockchain-life-2023-in-dubai",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/19201080_en_1688543756RnUY6qzxmQ.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/19201080_en_1688543756RnUY6qzxmQ.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/19201080_en_1688543756RnUY6qzxmQ-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/19201080_en_1688543756RnUY6qzxmQ-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/19201080_en_1688543756RnUY6qzxmQ-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Dubai, UAE, July 5th, 2023, Chainwire Influential figures such as heads of global funds, government officials, investors, business owners and promising startups come together in Dubai to shape the future of cryptocurrencies and Web3 at the 11th International Blockchain Life Forum on October 24-25 in Dubai, Festival Arena.  Buy your ticket now at the presale [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-05T09:30:43.000Z",
    "title": "Zilliqa Grwoth On Upward Trajectory, Tradecurve Dubbed The New Frontier of Trading",
    "url": "https://www.crypto-news-flash.com/zilliqa-grwoth-on-upward-trajectory-tradecurve-dubbed-the-new-frontier-of-trading/?utm_source=rss&utm_medium=rss&utm_campaign=zilliqa-grwoth-on-upward-trajectory-tradecurve-dubbed-the-new-frontier-of-trading",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T115101.264.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T115101.264.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T115101.264-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T115101.264-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cryptocurrency investors always search for tokens that may explode in an upcoming bull run. One project currently in its presale phase, Tradecurve, has captured their attention. Not only that, Zilliqa &#8211; a well-established player, has also seen a noticeable price increase. Today, we will examine these projects and discover what makes them unique.  Summary Zilliqa [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-05T09:15:22.000Z",
    "title": "Pepe 2.0, Floki 2.0, and Bobo 2.0: Turn $100 into a Fortune in 3 Days – Beware of Whale Sell-Offs and Scams",
    "url": "https://www.crypto-news-flash.com/pepe-2-0-floki-2-0-and-bobo-2-0-turn-100-into-a-fortune-in-3-days-beware-of-whale-sell-offs-and-scams/?utm_source=rss&utm_medium=rss&utm_campaign=pepe-2-0-floki-2-0-and-bobo-2-0-turn-100-into-a-fortune-in-3-days-beware-of-whale-sell-offs-and-scams",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/crypto-gfe826f1fa_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/crypto-gfe826f1fa_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/crypto-gfe826f1fa_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/crypto-gfe826f1fa_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/crypto-gfe826f1fa_1920-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Pepe 2.0 witnessed a trading volume of nearly $7 million in the last 24 hours. One wallet converted an initial purchase of Pepe 2.0 tokens worth $900 into an impressive sum of over $176,000 within less than 24 hours.  Recently, new meme tokens have been issued, for those who missed out when the meme coins [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-05T09:15:45.000Z",
    "title": "Privacy Coin Explodes Over 300% As Bullish Sentiment Brews in Altcoin Markets: Santiment",
    "url": "https://dailyhodl.com/2023/07/05/privacy-coin-explodes-over-300-as-bullish-sentiment-brews-in-altcoin-markets-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/privacy-traders-bot-confirms.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/privacy-traders-bot-confirms.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/privacy-traders-bot-confirms.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/privacy-traders-bot-confirms.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/privacy-traders-bot-confirms.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/privacy-traders-bot-confirms.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/privacy-traders-bot-confirms.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The market cap of one privacy-focused blockchain project is exploding in value, according to crypto analytics firm Santiment. Santiment says that the market cap for altcoin Verge (XVG) more than tripled in just two days as bullish sentiment soared. “The market cap of Verge has more than tripled (+209%) in just 48 hours, and it&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/05/privacy-coin-explodes-over-300-as-bullish-sentiment-brews-in-altcoin-markets-santiment/\">Privacy Coin Explodes Over 300% As Bullish Sentiment Brews in Altcoin Markets: Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]