[
  {
    "source": "Decrypt",
    "date": "2023-12-28T22:01:02.000Z",
    "title": "GG's 2023 Year in Review: Stories That Rocked the Gaming World",
    "url": "https://decrypt.co/211122/ggs-2023-year-review-stories-rocked-gaming-world",
    "description": "From layoffs to GTA 6 and Microsoft acquiring Activision, these are the stories that defined 2023 in gaming."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-28T22:05:18.000Z",
    "title": " 3 reasons why Ethereum (ETH) price nearly broke the $2.5K resistance this week ",
    "url": "https://cointelegraph.com/news/3-reasons-why-ethereum-price-nearly-broke-the-25k-resistance-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYjlhYTFiZmEtODVmNS00ZTM0LTk5MTQtY2I4NTgyODM3NWFhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ether’s surge to a 19-month high has been fueled by the anticipation of a network upgrade, a recent proposal from Vitalik Buterin and increased DApp use.</p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), the native token of the Ethereum network, has risen by 5.5% since Dec. 27, even though it failed to break above the $2,400 resistance. Traders are now questioning what has been driving the price of Ether up and whether these factors remain of importance.</p><p>The intraday high of $2,446 on Dec. 28 was last seen over 19 months ago. This increase occurred while the broader cryptocurrency market capitalization remained flat at $1.68 trillion. This suggests that Ether's price could continue its <a href=\"https://cointelegraph.com/news/3-reasons-why-ethereum-eth-price-could-rally-above-2500\">bullish momentum toward $2,500</a>, despite the average transaction fee exceeding $5. While this may not seem excessive, it can be burdensome for most decentralized application (Dapp) users.</p><p>One can easily fall for the narratives that competing chains are gaining relevance as critics claim that the Ethereum network has failed due to its limited capacity for scaling and privacy solutions at the base layer level. This negative conversations has been heightened by the recent outperformance of Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) and BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>), which have gained 78% and 44%, respectively, in the past 30 days. As an example, an experienced Solana ecosystem developer, Matty Taylor, posted about this issue on X social network.</p><p><a href=\"https://cointelegraph.com/news/3-reasons-why-ethereum-price-nearly-broke-the-25k-resistance-this-week\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-28T21:57:59.000Z",
    "title": " Breaking: US court rules in favor of SEC in Do Kwon, Terraform Labs case ",
    "url": "https://cointelegraph.com/news/breaking-us-court-rules-favor-sec-do-kwon-terraform-labs-case",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNjFkYTNlZmQtYTkzZS00NzVlLWJhYTUtNWFmMWQ3NjdjMGU0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The SEC claimed that Terraform Labs and Kwon \"orchestrated a multi-billion-dollar fraud involving the development, marketing, and sale of various cryptocurrencies,\" according to court documents.</p>\n                    <p><p>A United States court has ruled in favor of the Securities and Exchange Commission (SEC) regarding allegations that Terraform Labs and its former CEO, Do Kwon, offered and sold unregistered securities. </p><p><a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.594150/gov.uscourts.nysd.594150.149.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to court documents, the court granted summary judgment for the SEC on Count IV of the Amended Complaint, involving the defendants’ unregistered offers and sales of LUNA and MIR tokens in violation of Sections 5(a) and (5c) of the Securities Act. </p><p>It also grants summary judgment for defendants on \"Counts V and VI of the  Amended Complaint, involving the alleged unregistered offers of and transactions in security-based swaps.\"</p><p><a href=\"https://cointelegraph.com/news/breaking-us-court-rules-favor-sec-do-kwon-terraform-labs-case\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T22:05:48.000Z",
    "title": "Argentina’s eccentric President shakes up Congress",
    "url": "https://www.cryptopolitan.com/argentinas-president-shakes-up-congress/",
    "description": "The political landscape of Argentina is witnessing a seismic shift under the leadership of its unconventional President, Javier Milei. With a libertarian flair, Milei has catapulted a comprehensive state reform bill into the halls of Congress, targeting key areas such as tax, penal, electoral, and the party system. This move marks a significant escalation in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T22:00:48.000Z",
    "title": "U.S. economy takes the lead over Europe – Here’s why",
    "url": "https://www.cryptopolitan.com/us-economy-takes-the-lead-over-europe/",
    "description": "The economic tussle between the U.S. and Europe has always been more than just numbers on a spreadsheet. It&#8217;s like a high-stakes chess game where every move is scrutinized. But in recent times, the U.S. seems to have gained an upper hand. Diving into the nuances of this economic lead, it&#8217;s clear that there&#8217;s more [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T21:42:43.000Z",
    "title": "Why central banks are scrapping old inflation predictions",
    "url": "https://www.cryptopolitan.com/central-banks-scrape-inflation-predictions/",
    "description": "The era of straightforward economic forecasting by central banks seems to be taking a back seat. Gone are the days when a single projection could encapsulate the financial future. Central banks worldwide, including the Bank of England (BoE) and the European Central Bank (ECB), are now shifting gears, opting for a more dynamic approach to [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-28T21:42:16.000Z",
    "title": "Altcoin season incoming: analyst",
    "url": "https://crypto.news/altcoin-season-incoming-analyst/",
    "description": "A Crypto Banter YouTube channel analyst sees the crypto market cycle accelerating into an intense altcoin season soon."
  }
]