[
  {
    "source": "Decrypt",
    "date": "2024-03-08T23:49:18.000Z",
    "title": "Sam Altman Restored to OpenAI Board as Investigation Into His Ouster Concludes",
    "url": "https://decrypt.co/220928/sam-altman-restored-to-openai-board-as-investigation-into-his-ouster-concludes",
    "description": "The CEO is back on the company Board of Directors along with three new members as an investigation prompts corporate governance changes."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-08T23:45:13.000Z",
    "title": "Wyoming to recognize DAOs as legal entities under newly passed law",
    "url": "https://cryptoslate.com/wyoming-to-recognize-daos-as-legal-entities-under-newly-passed-law/",
    "description": "<p>Wyoming has passed a law recognizing blockchain-based decentralized autonomous organizations (DAOs) as legal entities. The bill — titled the Decentralized Unincorporated Nonprofit Association Act (DUNA) — was signed by the state&#8217;s Governor on March 7 and will be effective starting July 1. The full text of the bill does not explicitly name DAOs. Instead, it [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/wyoming-to-recognize-daos-as-legal-entities-under-newly-passed-law/\">Wyoming to recognize DAOs as legal entities under newly passed law</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-08T23:58:00.000Z",
    "title": "BNB Price Soars to 2-Year High as Binance Starts Recovering Lost Momentum",
    "url": "https://www.cryptoglobe.com/latest/2024/03/bnb-price-soars-to-2-year-high-as-binance-starts-recovering-lost-momentum/",
    "description": "The native token of the BNB Chain, $BNB, has seen its price surge to 2-year high amid a wider cryptocurrency market rally, with leading cryptocurrency exchange Binance losing momentum over the past few months and now seemingly starting to recover. BNB is up over 17.7% over the past week and more than 50% since the […]\n"
  }
]