[
  {
    "source": "CoinDesk",
    "date": "2023-07-14T13:00:00.000Z",
    "title": "Hip-Hop Collab Teams PUMA, Roc Nation and Legitimate for Sneaker Release",
    "url": "https://www.coindesk.com/web3/2023/07/14/hip-hop-collab-teams-puma-roc-nation-and-legitimate-for-sneaker-release/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The three models of sneakers celebrate the 50th anniversary of hip-hop and each one has an NFC chip owners can scan to claim an NFT and access exclusive music content."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-14T12:45:00.000Z",
    "title": "Starknet Quantum Leap Goes Live",
    "url": "https://cryptodaily.co.uk/2023/07/starknet-quantum-leap-goes-live",
    "description": "<p>The transactions per second on the Etheruem blockchain will receive a significant boost now that Starknet&rsquo;s Quantum Leap upgrade has been deployed on the Ethereum mainnet.&nbsp;</p>\nEthereum TPS To Scale Up&nbsp;\n<p>In a groundbreaking development for the Ethereum blockchain, the scaling barrier has been shattered, according to an announcement by Uri Kolodny, co-founder and CEO of StarkWare. Kolodny expressed his excitement, stating that the implementation of the new upgrade has finally made high transactions per second (TPS) a reality on the Ethereum mainnet.</p>\n<p>Starknet, which is a Layer-2 blockchain or &ldquo;rollup&rdquo; to the Ethereum blockchain, was created by the Starkware team to allow Ethereum to scale securely. Originally aiming for a potential TPS of hundreds within Q3, the StarkWare team was pleasantly surprised by the results of the stress test.&nbsp;</p>\nQuantum Leap Exceeds Expectations\n<p>Kolodny revealed that they had expected a few dozen TPS at this early stage, but the actual figure far surpassed their expectations, reaching a consistent 37 TPS. Moreover, during peak moments, the transfer transactions per second approached the impressive figure of 100.</p>\n<p>Kolodny said,</p>\n\n<p>&ldquo;We said this upgrade would deliver potential TPS of hundreds within Q3, and only hoped from the stress test to check we&rsquo;re on target. A few dozen TPS at this early point would have left us excited &ndash; but we got more than we bargained for.&rdquo;</p>\n\nLast Week&rsquo;s Testnet Run Big Success\n<p>The team had previously deployed the Quantum Leap on the Goerli testnet on July 5, followed by a community vote in which 97.91% of voters agreed to push forward to the mainnet as it demonstrated speeds higher than the team&rsquo;s expectations.&nbsp;</p>\n<p>Anticipating a \"time to inclusion\" of approximately 15 seconds, the team was amazed to discover that the vast majority of transactions were confirmed in under 10 seconds. This achievement meant that decentralized applications (dApps) could validate on-chain transactions within seconds, significantly enhancing the speed and efficiency of the Ethereum network.</p>\nShort-Term And Long-Term Benefits\n<p>Eli Ben-Sasson, co-founder and president of StarkWare, described the impact of this breakthrough as granting the community a \"supercharged power tool.\" This newfound capability empowers developers to create projects that were previously unattainable, opening doors to innovative and transformative applications.</p>\n<p>He also highlighted the more immediate and long-term benefits of this achievement, stating that in the short term, DeFi will benefit from increased speed and smoother user experiences. On-chain gaming will become more seamless, enhancing the overall gameplay and user engagement. Looking ahead, the long-term effects of this development are expected to reshape how we interact with technology and each other, giving rise to new and creative projects.</p>\n<p>The achievement of smashing the scaling ceiling represents a significant milestone for the Ethereum blockchain, signaling its readiness to handle increased transaction volumes and support a wide range of decentralized applications. As the network evolves, the potential for further innovation and growth becomes even more promising.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-14T13:01:22.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: Bitcoin Hits 14-Month High, Following Ripple Ruling",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-bitcoin-hits-14-month-high-following-ripple-ruling/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1913434339-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Hits 14-Month High, Following Ripple Ruling\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1913434339-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1913434339-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1913434339-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1913434339-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1913434339-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1913434339-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1913434339.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin rose towards the $32,000 mark late on Thursday, as markets reacted to the news that a U.S. judge ruled that XRP was &#x201C;not necessarily a security on its face.&#x201D; The ruling was well received by the crypto world, and raised optimism that other crypto companies who are currently in legal battles with the Securities [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T12:48:27.000Z",
    "title": "Major money laundering rings in Brazil exposed and dismantled, over $400 million seized",
    "url": "https://www.cryptopolitan.com/major-money-laundering-rings-in-brazil-exposed-and-dismantled-over-400-million-seized/",
    "description": "The Brazilian Federal Police have successfully dismantled two large-scale money laundering operations connected to international drug trafficking. The operations, uncovered during Operation Bahamut, led to the detention of numerous individuals across four states: Rio de Janeiro, São Paulo, Santa Catarina, and Rio Grande do Sul. With commendable efficiency, Federal Police agents executed searches in over ... <a title=\"Major money laundering rings in Brazil exposed and dismantled, over $400 million seized\" class=\"read-more\" href=\"https://www.cryptopolitan.com/major-money-laundering-rings-in-brazil-exposed-and-dismantled-over-400-million-seized/\" aria-label=\"More on Major money laundering rings in Brazil exposed and dismantled, over $400 million seized\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-14T13:02:39.000Z",
    "title": "Crypto exchanges relist XRP amid Ripple’s partial victory in US",
    "url": "https://crypto.news/crypto-exchanges-relist-xrp-amid-ripples-partial-victory-in-us/",
    "description": "Coinbase, Kraken, and other centralized exchanges in the United States are relisting XRP following Ripple’s &#8216;partial&#8217; victory over the SEC. In what has been described as a huge landmark and watershed moment for the crypto verse, Judge Analisa Torres of&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-14T12:50:37.000Z",
    "title": "Worldcoin’s World ID program surges past 2m signups",
    "url": "https://crypto.news/worldcoins-world-id-program-surges-past-2m-signups/",
    "description": "Worldcoin, an identity verification and cryptocurrency project, celebrated a major milestone on July 13 as it achieved 2 million signups for its World ID program."
  },
  {
    "source": "BTCManager",
    "date": "2023-07-14T12:44:24.000Z",
    "title": "Former FTX CEO wants to exempt friends from security checks",
    "url": "https://crypto.news/former-ftx-ceo-wants-to-exempt-friends-from-security-checks/",
    "description": "Former FTX CEO Sam Bankman-Fried wants his close friends to visit him at his parents' home without undergoing security checks. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-14T13:00:32.000Z",
    "title": "Polygon Reclaims 10th Position As MATIC Surges Nearly 30% In One Week",
    "url": "https://www.newsbtc.com/analysis/matic-analysis/polygon-reclaims-10th-position-as-matic-surges/",
    "description": "The crypto market continues to exhibit dynamic shifts as Polygon&#8217;s native token, MATIC, outpaces Litecoin (LTC) in the global rankings to secure the 10th spot. This move comes after MATIC experienced a surge of nearly 30% over the past week. Resurgence Amid Crypto Rally The general upswing in the crypto market in the past week has presented opportunities for numerous cryptocurrencies to make significant strides. Polygon (MATIC), for one, has capitalized on this trend, breaking through multiple resistance levels to claim the 10th position in the global crypto market, thereby leaving Litecoin (LTC) trailing behind. Related Reading: MATIC Price Prediction: Polygon Bulls Aim For $0.80 The asset&#8217;s surge, which saw MATIC price climbing from a low of $0.67 last Friday to a high of $0.88 yesterday before retracting to $0.84 at the time of writing, marks a nearly 30% increase in the past 7 days. The surge also signals MATIC&#8217;s resilience, given that it comes just a month after the United States Securities and Exchange Commission (SEC) classified it as a security, triggering a drastic dip in its value. This move by the SEC made MATIC dwell in a bloodbath for a week to trade below the $0.6 mark. MATIC Road To Recovery MATIC&#8217;s recovery, however, has been somewhat fascinating. Over the past 24 hours, MATIC has rallied by nearly 10%, exhibiting a strong upward trajectory. Interestingly, this rally mirrors the movements of several notable altcoins in the market, indicating a wider market recovery trend. Despite the initial setback following the SEC&#8217;s classification, MATIC has demonstrated a comeback. Its rebound not only highlights the resilience of the asset but also underscores its growing popularity among investors, which can be attributed to the increasing interest in the Polygon platform, known for its scalability solutions for Ethereum transactions. MATIC has witnessed a dramatic rise in its market capitalization over the past week, marking a nearly $2 billion increase. The digital asset, starting from a valuation of $6.2 billion last Friday, has seen its market cap surge to $7.89 billion as of today. Interestingly, it&#8217;s not just MATIC&#8217;s price and market cap that has experienced a notable upswing. Within the same week, the daily trading volume for Polygon has nearly doubled from its figures last Friday. This surge is evident in the jump from a trading volume of $357 million late last week to as high as $952 million in the past 24 hours. Related Reading: Polygon 2.0 Upgrade – Potential Bullish Implications For MATIC Price? The sudden increase in trading volume indicates a significant uptick in trading activity within just a week. The overall rise in both price and trading volume paints a picture of significant market interest and increased investor activity around Polygon. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-14T13:04:45.000Z",
    "title": "Bitcoin Surpasses $30K Mark, Igniting Traders’ Enthusiasm for InQubeta, Chainlink and Monero",
    "url": "https://www.crypto-news-flash.com/bitcoin-surpasses-30k-mark-igniting-traders-enthusiasm-for-inqubeta-chainlink-and-monero/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-surpasses-30k-mark-igniting-traders-enthusiasm-for-inqubeta-chainlink-and-monero",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T141850.259.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T141850.259.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T141850.259-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-14T141850.259-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In a remarkable turn of events, Bitcoin has this year soared past the $30,000 milestone, reaching a 13-month high and sparking excitement among traders and investors. The leading cryptocurrency&#8217;s trading rate surged to $31,500 on July 6th, demonstrating a rapid 2 percent increase within a single hour. This surge has ignited a wave of enthusiasm [...]"
  }
]