[
  {
    "source": "CoinDesk",
    "date": "2023-07-05T16:26:23.000Z",
    "title": "Elon, You Don’t Need Crypto to Do Twitter Payments",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/05/elon-you-dont-need-crypto-to-do-twitter-payments/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "If Musk wants to build an instant cross-border network, he'll find central bank real-time systems have moved on quite a bit since his days at PayPal, says J.P. Koning."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-05T16:27:05.000Z",
    "title": "Valkyrie’s spot-Bitcoin ETF application has been refiled with Coinbase named as surveillance partner",
    "url": "https://cryptoslate.com/valkyries-spot-bitcoin-etf-application-has-been-refiled-with-coinbase-named-as-surveillance-partner/",
    "description": "<p>Valkyrie Investments&#8217; spot-Bitcoin exchange-traded fund application has been refiled, with Coinbase declared as the exchange that would serve as its surveillance-sharing partner. With Valkyrie&#8217;s resubmission, all of the recent applications sent back by the SEC have been amended and refiled. Nasdaq and Cboe Global Markets are the two main stock exchanges where these funds are [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/valkyries-spot-bitcoin-etf-application-has-been-refiled-with-coinbase-named-as-surveillance-partner/\">Valkyrie&#8217;s spot-Bitcoin ETF application has been refiled with Coinbase named as surveillance partner</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-05T16:27:44.000Z",
    "title": "Spot Bitcoin ETF Race Continues as Valkyrie Files with Coinbase",
    "url": "https://cryptobriefing.com/spot-bitcoin-etf-race-continues-valkyrie/?utm_source=feed&utm_medium=rss",
    "description": "Valkyrie Funds, a venture capital fund, has joined the increasing ranks of companies striving to launch a spot Bitcoin ETF, marking a significant development in the crypto space. The firm..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-05T16:30:00.000Z",
    "title": "Exclusive: Choise.com CEO Vladimir Gorbunov Reveals More About Partnership With the Vienna Vikings",
    "url": "https://cryptodaily.co.uk/2023/07/exclusive-choisecom-ceo-vladimir-gorbunov-reveals-more-about-partnership-with-the-vienna-vikings",
    "description": "<p>As CryptoDaily&trade; covered earlier, Choise.com, a revolutional crypto platform connecting CeFi and DeFi, secured a sponsorship deal with the Vienna Vikings, the reigning champions of the European League of Football (ELF).&nbsp;</p>\n<p>In case you have missed it, the partnership aims at bridging the worlds of sport and crypto against the backdrop of the American football boom in Europe. Choise.com will support the Vikings throughout their second season in the ELF, inspired by the team&rsquo;s huge potential and gritty determination to augment their collection of trophies.&nbsp;</p>\n<p>The Viennese club has already added the Choise.com branding to its game helmets and social media content, while also providing the company with exposure in Hohe Warte Stadium. The next step in this evolving relationship will be the launch of a special fan-style collection of Crypterium VISA cards honoring the Vienna Vikings&rsquo; players and team officials.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>We sat down with the Choise.com CEO Vladimir Gorbunov to discover even more exciting details about the company&rsquo;s sensational initiative to support the favorites of Europe's most spectacular American football league.</p>\nSeems like the convergence of sports and crypto is a trend that&rsquo;s showing no sign of stopping. What made Choise.com ride this wave?&nbsp;\n<p>The phenomenon of the crypto brands scooping up big sports partnerships comes as no surprise; sport, just like cryptocurrency itself, has no boundaries or limits. Effectively, it boasts an extraordinary power to bring together people from all over the world, which can benefit crypto companies in terms of their coverage. By collaborating with the top sports rights holders, crypto advertisers reach out to a multi-million audience of fans who can further become their potential customers and loyal supporters.&nbsp;</p>\n<p>The overriding objective of creating such an alliance is to help as many people as possible to understand crypto banking through the use of products with seamless experience. This is exactly what we took into account when joining forces with the Vienna Vikings. By jumping into the sports sponsorship race, Choise.com got an excellent opportunity to make the crypto lifestyle accessible to all.</p>\nHow will collaboration with the Vienna Vikings help Choise.com stand out from the competition?\n<p>To start with, Choise.com takes precedence as the first crypto firm to team up with the American football club from Europe. Prior to that, we saw a tide of blockchain sponsorships reinforcing teams from the National Football League which is the premier tournament in the USA and Canada. The emergence of the ELF marked a crucial milestone in the history of American football in Europe and the sport itself deservedly gained popularity across the region. In Germany alone, American football experienced a real fan boom, becoming the number two sport behind only football.&nbsp;</p>\n<p>The Vienna Vikings are the ELF&rsquo;s defending champions. On the road the 2023 season, they are undefeated, which, we believe, is just the beginning of their grand journey to clinching the title once again. The Vikings&rsquo; accomplishments assure a strong presence for Choise.com, allowing us to make the most out of the team&rsquo;s growing influence in Europe and effectively communicate our mission and values.&nbsp;</p>\n<p>What&rsquo;s also important is that this partnership takes place following the &ldquo;crypto winter&rdquo; which made many sports rights holders abandon crypto sponsorships. After all the 2022 collapses, they feel like crypto firms can be unstable partners posing particular financial and reputational risks to the whole industry. In this context, the Vienna Vikings&rsquo; trust in Choise.com and our products serves as a sign of credibility that the whole crypto industry acutely needs.&nbsp;&nbsp;</p>\nAs a result of your joint efforts, Choise.com will give a unique appearance to one of its distinct products &ndash; Crypterium VISA card. Do you plan to expand your partnership with the Vikings into other sectors of your business?&nbsp;\n<p>All this is yet to be discussed with our colleagues from the Vienna Vikings. On the Choise.com side, we see enormous potential for our cooperation in many spheres. The NFT market is a fairly promising direction to consider, given that non-fungible tokens are the most common point of contract between crypto and sports. Not to mention that we have already built up high-flying experience in creating digital collectibles &ndash; our latest Chobies NTO Collection was a resounding success, with total sales exceeding $1.9 million.</p>\nAre you a fan of American football yourself?\n<p>Yes, I absolutely love it! That&rsquo;s why I&rsquo;m even more happier to see our partnership with the Vikings gaining momentum. Doing an honorary toss before the Vikings&rsquo; inaugural game in the 2023 ELF season was a very special moment for me and my son. The overwhelming feeling of unity with the team that I saw and experienced that day, I will never forget.</p>\n<p>American football is quite a tough sport bringing a lot of emotions and impressions to its lovers. At the same time, all fans and players seem pretty respectful to each other. For example, it&rsquo;s quite a common case to savor applause to those who were injured, even if they are members of the opposing team.&nbsp;</p>\n<p>There are some other subtleties which make American football an extremely appealing experience. We at Choise.com hope it will continue to make a whole lot of noise across the global sport industry, winning the hearts of new fans and onboarding them to a thriving world of crypto assets.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T16:35:23.000Z",
    "title": "Europe apparently confuses China – Here is why",
    "url": "https://www.cryptopolitan.com/europe-apparently-confuses-china-here-is-why/",
    "description": "The terrain of international diplomacy is rarely smooth, and the rough edges seem more pronounced when it comes to the rapport between China and Europe. Of late, an intellectual chasm has opened wide between these two global powerhouses, particularly concerning their contrasting perspectives on the Ukraine issue. The great misunderstanding At the crux of the ... <a title=\"Europe apparently confuses China &#8211; Here is why\" class=\"read-more\" href=\"https://www.cryptopolitan.com/europe-apparently-confuses-china-here-is-why/\" aria-label=\"More on Europe apparently confuses China &#8211; Here is why\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T16:22:29.000Z",
    "title": "Judge slams Biden officials’ censorship on social media as violation of first amendment",
    "url": "https://www.cryptopolitan.com/judge-on-biden-officials-censorship/",
    "description": "A federal judge in Louisiana, Terry Doughty, recently issued a ruling stating that the Biden administration likely violated the First Amendment by censoring unfavorable views on social media during the coronavirus pandemic. Judge Doughty referred to these efforts as &#8220;Orwellian&#8221; and issued a preliminary injunction that prohibits several federal officials and agencies from contacting social ... <a title=\"Judge slams Biden officials&#8217; censorship on social media as violation of first amendment\" class=\"read-more\" href=\"https://www.cryptopolitan.com/judge-on-biden-officials-censorship/\" aria-label=\"More on Judge slams Biden officials&#8217; censorship on social media as violation of first amendment\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-05T16:11:30.000Z",
    "title": "MetisDAO warns purchases made after poly exploit are not valid",
    "url": "https://crypto.news/metisdao-warns-purchases-made-after-poly-exploit-are-not-valid/",
    "description": "MetisDAO, the official entity overseeing the Metis ecosystem, has issued a warning regarding the validity of transactions involving METIS tokens following the recent Poly Network exploit. "
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-05T16:30:00.000Z",
    "title": "CoinGecko Study Shows Shift in Popularity from Crypto Jobs to AI Jobs",
    "url": "https://coinedition.com/coingecko-study-shows-shift-in-popularity-from-crypto-jobs-to-ai-jobs/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"CoinGecko Study Shows Shift in Popularity from Crypto Jobs to AI Jobs\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-4-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A recent study conducted by CoinGecko, a leading cryptocurrency data analytics platform, delved into the search interest for crypto jobs and AI jobs. The study indicates a significant shift in focus as search interest for “AI jobs” peaked four times higher than “crypto jobs.” This trend aligns with the increasing prominence of artificial intelligence in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coingecko-study-shows-shift-in-popularity-from-crypto-jobs-to-ai-jobs/\">CoinGecko Study Shows Shift in Popularity from Crypto Jobs to AI Jobs</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]