[
  {
    "source": "CoinDesk",
    "date": "2023-10-11T10:00:00.000Z",
    "title": "Ellison Was CEO But SBF Was Still Boss at Alameda, Her Testimony Suggests ",
    "url": "https://www.coindesk.com/policy/2023/10/11/ellison-was-ceo-but-sbf-was-still-boss-at-alameda-her-testimony-suggests/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The testimony of Caroline Ellison, the former business, romantic – and by her estimation, criminal – partner of Sam Bankman-Fried, whom she identified upon prosecutors’ request – began in the vaguest of ways."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-11T09:45:18.000Z",
    "title": "HODLers Stash BTC Worth $1.35B Each Month, Onchain Data Show",
    "url": "https://www.coindesk.com/markets/2023/10/11/hodlers-stash-btc-worth-135b-each-month-onchain-data-show/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The continued accumulation shows tightening supply and a widespread reluctance to transact, according to Glassnode."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-11T09:49:52.000Z",
    "title": "Bitstamp’s departure from Canada is ‘timing issue,’ says CEO",
    "url": "https://cointelegraph.com/news/bitstamp-canada-halt-timing-issue-ceo",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/26b11e03-b034-440c-8e26-109a63914271.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> Bitstamp’s decision to discontinue operations in Canada is “primarily a timing issue” related to the firm’s expansion priorities, Bitstamp U.S. CEO said.</p>\n                    <p><p>Cryptocurrency exchange Bitstamp hopes to return to Canada after halting operations early next year, according to Bitstamp U.S. CEO and global chief commercial officer Bobby Zagotta.</p><p>Bitstamp will officially discontinue its services to customers in Canada starting from Jan. 8, 2024, the exchange confirmed in a statement to Cointelegraph.</p><p>As a result of the service termination, all Canada accounts on Bitstamp will be closed and customers will no longer have access to their accounts. Bitstamp has strongly recommended its Canadian customers withdraw their funds by January 2024, also urging the clients to deactivate their Bitstamp accounts.</p><p>“We want to emphasize that your crypto assets always remain yours, and we are committed to reaching out to any customers who were unable to close their accounts themselves to ensure the return of their funds,” Bitstamp noted.</p><p>Bitstamp’s decision to discontinue operations in Canada is “primarily a timing issue” related to the company’s current expansion priorities, Bitstamp U.S. CEO told Cointelegraph. The exchange is exiting the Canadian market to refocus on regions where Bitstamp can align “more effectively” with local regulations, Zagotta said, adding:</p><blockquote>“We hope to serve this market in the future; however, at this time, we are unable to prioritize the work and allocate the necessary resources to meet new regulations.”</blockquote><p>Zagotta emphasized that Bitstamp remains committed to serving its global user base, and any decisions regarding its presence in specific countries would likely depend on evolving regulatory environments and market conditions.</p><p>Bitstamp’s exit from Canada comes amid the exchange reportedly raising funds to scale its global operations. The platform has reportedly been working to secure new capital since May 2023 to <a href=\"https://cointelegraph.com/news/bitstamp-raises-funds-for-global-expansion\">launch derivatives trading in Europe in 2024</a> and expand its services in the United Kingdom.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/canada-regulator-csa-clarifies-stablecoin-rules\"><strong><em>Canadian regulatory body clarifies stablecoin rules for exchanges and issuers</em></strong></a></p><p>Founded in 2011, Bitstamp is one of the world’s longest-running cryptocurrency exchanges. According to the Bitstamp website, the platform <a href=\"https://www.bitstamp.net/faq/which-countries-are-the-bitstamp-apps-available-in/\" target=\"_blank\" rel=\"noopener nofollow\">serves</a> a large number of countries at the time of writing, including the United States, Singapore, South Korea, Japan and others.</p><p>According to data from CoinGecko, Bistamp’s daily trading volumes <a href=\"https://www.coingecko.com/en/exchanges\" target=\"_blank\" rel=\"noopener nofollow\">amount</a> to roughly $114 million at publishing time. The volumes are significantly lower than volumes reported by major competitors like Binance, which trades nearly $4 billion per day, according to CoinGecko.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Magazine: Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-11T09:32:29.000Z",
    "title": "SBF’s lawyers ask court to allow introduction of Anthropic evidence",
    "url": "https://cointelegraph.com/news/sbf-sam-bankman-fried-lawyers-court-anthropic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/142989f0-4440-4739-9a2c-e2b706c359f1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sam Bankman-Fried’s lawyers asked Judge Kaplan in a letter to allow the defense to use evidence of its venture investment into Anthropic from April 2022.</p>\n                    <p><p>In a <a href=\"https://www.courtlistener.com/docket/66631291/317/united-states-v-bankman-fried/\" target=\"_blank\" rel=\"noopener nofollow\">motion</a> filed on Oct. 10, Sam “SBF” Bankman-Fried’s lawyers requested that the court allow for the introduction of evidence supporting positive investment outcomes, such as an investment in the artificial intelligence (AI) startup Anthropic. </p><p>This comes after <a href=\"https://cointelegraph.com/news/prosecutors-say-sam-bankman-fried-500m-anthropic-stake-irrelevant\">United States prosecutors filed a request</a> on Oct. 9 to bar SBF’s legal team from making any arguments related to FTX customer funds recovery through the Anthropic investment. </p><p>Bankman-Fried made a $500 million investment in the AI startup in April 2022 before the exchange’s collapse. The U.S. Department of Justice (DOJ) is set to give evidence that the investment was made using fraudulent funds from customer deposits. </p><p>However, lawyers attest that the government’s position “miscasts” the relevance of the evidence and “respectfully” asked the court to deny the government’s motion. </p><p>They continued to point out that the government had raised Alameda’s venture investments multiple times during the trial and argued they were “risky” and “losing money.”</p><blockquote>“In response, the defense should be permitted to introduce evidence of positive investment outcomes (i.e. Anthropic) of such venture investments…”</blockquote><p>Anthropic has recently <a href=\"https://cointelegraph.com/news/amazon-invests-4-billion-anthropic-ai-startup\">received major investments</a> from e-commerce giant Amazon totaling $4 billion and <a href=\"https://cointelegraph.com/news/anthropic-ai-raises-100m-from-south-korea\">$100 million from South Korean</a> telecommunications giant SK Telecom. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/alameda-account-ftx-special-privileges-gary-wang\"><strong><em>Sam Bankman-Fried ordered ‘special privileges’ for Alameda account on FTX — Gary Wang</em></strong></a></p><p>SBF’s lawyers said the defense has no objection to the court providing an “appropriate limiting instruction” regarding how Anthropic investment evidence could be used. </p><p>The <a href=\"https://cointelegraph.com/news/sbf-sam-bankman-fried-ftx-fraud-trial-second-week\">second week of the criminal trial</a> of the former FTX CEO continues on Oct. 11. SBF faces seven charges of conspiracy and fraud tied to the collapse of FTX, to which he has pleaded not guilty.</p><p>Cointelegraph reporters are on the ground in New York covering the trial. As the saga unfolds, <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\">check here for the latest updates</a>.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/sbf-trial-underway-mashinsky-trial-set-binances-market-share-shrinks-hodlers-digest-oct-1-7/\"><strong><em>SBF trial underway, Mashinsky trial set, Binance’s market share shrinks: Hodler’s Digest, Oct. 1–7</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-11T09:30:05.000Z",
    "title": "DeFi 2.0 launches with DeFiGPT, smart contract antivirus, social profiles and new L2 chain",
    "url": "https://cryptoslate.com/defi-2-0-launches-with-defigpt-smart-contract-antivirus-social-profiles-and-new-l2-chain/",
    "description": "<p>DeFi platform De.Fi has launched its highly anticipated De.Fi 2.0 suite of products and services aimed at enhancing security, usability, and interconnectivity in the decentralized finance (DeFi) ecosystem. De.Fi started in 2020 as a group of yield farmers and has grown to over 3 million users. The company says De.Fi 2.0 will help onboard the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/defi-2-0-launches-with-defigpt-smart-contract-antivirus-social-profiles-and-new-l2-chain/\">DeFi 2.0 launches with DeFiGPT, smart contract antivirus, social profiles and new L2 chain</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-11T09:27:42.000Z",
    "title": "UK Investment Manager Reportedly Loses £300,000 in Cryptocurrency Scam",
    "url": "https://www.cryptoglobe.com/latest/2023/10/uk-investment-manager-reportedly-loses-300000-in-cryptocurrency-scam/",
    "description": "A high-ranking executive at a British investment company, identified here as Matthew Thomas to protect his identity, has reportedly revealed that he was swindled out of £300,000, his life savings, due to a sophisticated cryptocurrency scam, according to The Guardian. Thomas, who is in his 40s, admitted that his judgment was likely clouded by a […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-11T09:57:58.000Z",
    "title": "Sam Bankman-Fried Harbored Hopes Of Becoming The US President",
    "url": "https://cryptodaily.co.uk/2023/10/sam-bankman-fried-harbored-hopes-of-becoming-the-us-president",
    "description": "Caroline Ellison, the former Alameda Research CEO’s testimony has revealed that Sam Bankman-Fried had aspirations to become the president of the United States."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-11T10:00:44.000Z",
    "title": "Bitmain Halts Employee Salaries Amid Financial Woes, Report",
    "url": "https://news.bitcoin.com/bitmain-halts-employee-salaries-amid-financial-woes-report/",
    "description": "<img width=\"768\" height=\"433\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1358587487-768x433.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitmain Halts Employee Salaries Amid Financial Woes, Report\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1358587487-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1358587487-1024x578.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1358587487-768x433.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1358587487-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1358587487-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1358587487-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1358587487.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Mining hardware manufacturer Bitmain has temporarily suspended salary payments to its employees, a media report has revealed. News of the move comes along with information suggesting that the crypto giant is experiencing financial difficulties with poor results from its operations. Antminer Maker Bitmain Reportedly Delays Salaries and Bonuses Bitmain, a major producer of bitcoin mining [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-11T09:43:31.000Z",
    "title": "China’s Advancements in Semiconductor Technology Challenge U.S. Strategy",
    "url": "https://www.cryptopolitan.com/chinas-advancements-in-semiconductor-technology-challenge-u-s-strategy/",
    "description": "China&#8217;s rapid advancements in semiconductor technology have posed significant challenges to the Biden administration&#8217;s efforts to maintain control over the future of computing. While the U.S. initially focused on denying China access to cutting-edge semiconductors, Beijing&#8217;s response has doubled down on developing its chip manufacturing and design capabilities. Rising Chinese competence in cutting-edge chips The ... <a title=\"China&#8217;s Advancements in Semiconductor Technology Challenge U.S. Strategy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chinas-advancements-in-semiconductor-technology-challenge-u-s-strategy/\" aria-label=\"More on China&#8217;s Advancements in Semiconductor Technology Challenge U.S. Strategy\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-11T09:39:00.000Z",
    "title": "Securities regulators slam Coinbase’s defense against SEC — ‘Crypto Isn’t Special’",
    "url": "https://www.cryptopolitan.com/securities-regulators-slam-coinbase-defense/",
    "description": "A body representing state securities regulators in North America has challenged arguments put forth by the crypto exchange Coinbase in its defense against the SEC. The North American Securities Administrators Association (NASAA) has made the argument that digital assets should not be considered &#8220;somehow special&#8221; and that actions taken against Coinbase should not be regarded ... <a title=\"Securities regulators slam Coinbase&#8217;s defense against SEC — &#8216;Crypto Isn&#8217;t Special&#8217;\" class=\"read-more\" href=\"https://www.cryptopolitan.com/securities-regulators-slam-coinbase-defense/\" aria-label=\"More on Securities regulators slam Coinbase&#8217;s defense against SEC — &#8216;Crypto Isn&#8217;t Special&#8217;\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-11T09:43:25.000Z",
    "title": "Bitstamp to leave Canada amid regulatory crackdown",
    "url": "https://crypto.news/bitstamp-to-leave-canada-amid-regulatory-crackdown/",
    "description": "European crypto exchange Bitstamp is leaving the Canadian market, saying it will discontinue its services in Canada starting January 2024. Cryptocurrency exchange Bitstamp is withdrawing from Canada starting January 2024 as the country imposed stricter rules on crypto companies. In&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-11T09:28:21.000Z",
    "title": "Immutable taps Amazon to boost web3 gaming adoption",
    "url": "https://crypto.news/immutable-taps-amazon-to-boost-web3-gaming-adoption/",
    "description": "Blockchain-based games platform says it has chosen Amazon Web Services to support for successful deal closures. Immutable, a web3 game development platform, is expanding its strategic partnerships list to accelerate mainstream adoption of video games built on the Ethereum blockchain.&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-11T09:20:31.000Z",
    "title": "Binance CEO and executives face possible indictment in Brazil",
    "url": "https://crypto.news/binance-ceo-and-executives-face-possible-indictment-in-brazil/",
    "description": "The CEO of Binance and three local executives are facing the risk of indictment in Brazil for alleged financial crimes. A congressional committee that investigated crypto-related pyramid schemes in the country has recommended that law enforcement authorities indict Changpeng Zhao,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-11T10:00:18.000Z",
    "title": "XRP Price Retest: A Prelude To A Stunning Surge To $2, Predicts Expert",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-retest-prelude-to-2-dollar/",
    "description": "Renowned crypto analyst Egrag delivered a fresh and in-depth XRP price analysis across multiple timeframes today. As of press time, the cryptocurrency stands at $0.4825, marking a decrease of about 12% since October 3, when it reached a high of $0.5478. Despite the bearish momentum fueled by the broader crypto market trend, Egrag projects bullishness on higher time frames. Monthly Chart XRP/USD On the monthly XRP/USD chart, Egrag took to Twitter to share his insights, stating: &#8220;XRP Monthly Bullish Pennant &#8211; Super Bullish Sign: Do you spot the pattern like I do? It&#8217;s incredibly bullish!&#8221; According to Egrag, trading on a monthly time frame reduces the chance of false signals. He believes that a strong flagpole hints at a rapid price increase, and the ongoing consolidation phase forms the pennant. The current pause in the uptrend could potentially lead to further upward movement, especially if there&#8217;s a surge in volume after a breakout. For this scenario to occur, XRP shouldn&#8217;t break out to the downside, but stay within the two approximating lines until the breakout north. Related Reading: XRP Price Gearing Up For Rebound As Whales Make Their Move By measuring the flagpole&#8217;s height, Egrag anticipates that XRP could potentially surge above $24 (on a longer time scale) if it manages to break out of the bullish pennant pattern. Weekly Chart For the weekly chart, Egrag commented, “It&#8217;s evident that XRP is currently undergoing a retest phase following its recent breakout.” This sentiment is anchored in the aftermath of the Ripple Labs case against the US Securities and Exchange Commission, where the price broke out of a longstanding trend channel. However, the continued bearish sentiment in the broader crypto market, along with macro-economic pressures halted XRP&#8217;s momentum. Egrag points out the importance of the price range between $0.48 to $0.43, suggesting that maintaining above this line is critical. A breach could lead the cryptocurrency to retest the foundational zone between $0.25939 and $0.32630, which has shown robust support since 2017. Related Reading: XRP Is A Better Buy Now Than H1 2023: What’s Keeping Prices Low? Nevertheless, if the altcoin successfully retests and stays above the trendline, Egrag envisions a potential retest of the key resistance at $0.58304. Surpassing this would pave the way for an impressive rally, potentially reaching $2. According to him, XRP would thus penetrate the next higher &#8220;steel foundation&#8221;, the area between $1.6188 and $2. 1-Day Chart For the daily XRP/USD chart, Egrag&#8217;s message was concise: “XRP Army: Don&#8217;t miss the forest for the trees.” His analysis for this timeframe focuses on the “wicking” range of $0.3875 to $0.4719, which he sees as the possible dip range if the broader market pressure persists. Only a drop below $0.3875 would negate the bullish pattern. If the cryptocurrency maintains between $0.4719 and $0.5119, Egrag sees no cause for alarm. But for a bullish narrative to play out, the token needs to push beyond $0.5119, aiming for the $0.5738 mark, which corresponds to the 50% Fibonacci retracement level. Egrag emphasizes that breaching this level is crucial for a broader rally, targeting the 1,618 Fibonacci extension at $1.4694. At press time, the XRP price fell below the 61.8% Fibonacci retracement level and was trading at $0.4856, representing a loss of 3.3% in the last 24 hours. Featured image from Top1 Markets, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-11T10:04:44.000Z",
    "title": "Cardano (ADA) Surpasses Ethereum and Takes the Lead in Massive Update Spree",
    "url": "https://www.crypto-news-flash.com/cardano-ada-surpasses-ethereum-and-takes-the-lead-in-massive-update-spree/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-ada-surpasses-ethereum-and-takes-the-lead-in-massive-update-spree",
    "description": "<img width=\"1000\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano ADA\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2-300x203.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2-768x518.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-2-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Cardano has taken the top spot for notable network development among crypto projects according to blockchain analytics firm. This not only demonstrates the confidence developers have in the network but suggests that new features are coming. Recent data shows that Cardano is making headways in the blockchain space. According to Blockchain analytics firm Santiment, Cardano [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-11T09:50:23.000Z",
    "title": "A Brief Overview of the Trial of Sam Bankman-Fried",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/a-brief-overview-of-the-trial-of-sam-bankman-fried/",
    "description": "<p>As the co-founder and CEO of FTX, Bankman-Fried has been at the forefront of the crypto industry. However, his journey took an unexpected turn when he found himself facing a trial that garnered significant attention. In this article, we will provide a brief overview of the trial of Sam Bankman-Fried. Shedding light on the circumstances [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/a-brief-overview-of-the-trial-of-sam-bankman-fried/\">A Brief Overview of the Trial of Sam Bankman-Fried</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-11T09:15:32.000Z",
    "title": "$8,500,000,000 Worth of Ethereum (ETH) Unloaded by Crypto Whales Since February 2023, According to Analyst",
    "url": "https://dailyhodl.com/2023/10/11/8500000000-worth-of-ethereum-eth-unloaded-by-crypto-whales-since-february-2023-according-to-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/Crypto-Whales-Since-February.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/Crypto-Whales-Since-February.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/Crypto-Whales-Since-February.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/Crypto-Whales-Since-February.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/Crypto-Whales-Since-February.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/Crypto-Whales-Since-February.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/Crypto-Whales-Since-February.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto whales have been distributing their massive Ethereum (ETH) stacks for the better part of the year, according to an analyst. Analyst Ali Martinez tells his 31,000 followers on the social media platform X that deep-pocketed Ethereum holders have been using price rallies throughout the year to unload millions of ETH. The crypto analyst highlights [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/11/8500000000-worth-of-ethereum-eth-unloaded-by-crypto-whales-since-february-2023-according-to-analyst/\">$8,500,000,000 Worth of Ethereum (ETH) Unloaded by Crypto Whales Since February 2023, According to Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]