[
  {
    "source": "NewsBTC",
    "date": "2023-06-28T01:30:04.000Z",
    "title": "Global Interest In Bitcoin Is Fast-Falling, What’s Happening?",
    "url": "https://www.newsbtc.com/bitcoin-news/global-interest-in-bitcoin-is-fast-falling-whats-happening/",
    "description": "According to Google Trends data, interest in Bitcoin is heading to historic lows as of June 27. In a screenshot shared by a Twitter user, organic searches related to “Bitcoin” have dropped in the last six months.  Google Trends is a free tool that tracks how people search for specific terms or phrases on Google, the world’s largest search engine. Interest in a particular topic or asset can be ascertained in real time depending on the number of search terms. Currently, few users are searching for the term “Bitcoin.” Interest In Bitcoin Fast Falling Notably, BTC and crypto prices have steadily recovered after bears wiped gains last year. As an illustration, BTC is up roughly 87% when writing and trending at around 2023 highs. On the other hand, organic searches related to the world’s most valuable cryptocurrency are at multi-year lows, sharply falling in the first half of 2023. Related Reading: PEPE Coin Shines Among Top Gainers, Tallies 78% In Last Week Data from Google Trends show that interest in searches around Bitcoin is below 2018 levels and could drop lower, considering how fast the reading has been free-falling in the first half of the year. This “disinterest” in Bitcoin seemed to have been spilled over from the second half of 2022.  In the first half of last year, searches temporarily expanded before dropping. Even so, at that time, Bitcoin search readings, according to Google Trends, were lower than that registered in 2021 when it was at record highs. Based on this development, there appears to be a direct correlation between sentiment and prices, as deduced from Google Trends data on Bitcoin. BTC prices peaked at over $69,000 in November 2021 after steadily rising from late 2019. Notably, prices more than doubled as they rallied below $10,000, breaking December 2017 highs of around $20,000 and soaring to new all-time highs of about $70,000 registered in Q4 2021. When prices roared, searches related to Bitcoin, Google Trends data shows, also rose. The inverse was observed in the past 19 months when prices contracted from all-time highs, dropping by over 70% to as lows as sub-$16,000 in November 2022.  What Could Be The Cause? From the current BTC price action, there is a divergence between Google Trends data on Bitcoin and prices. While prices are rising, shaking off bears of Q4 2022 and the first half of Q1 2023, interest in Bitcoin is shrinking.  This observation can be pinned on several factors, including increasing regulatory scrutiny of Bitcoin and cryptocurrencies in the United States and worldwide. Related Reading: BTC Continues Uptrend As Fidelity Plans To Submit Bitcoin Spot ETF Filing Although the United States Securities and Exchange Commission (SEC) has clarified that Bitcoin is a commodity, the regulator’s action against popular exchanges, including Coinbase and Binance, might have impacted sentiment, puncturing user interest. Feature Image From Canva, Chart From TradingView"
  }
]