[
  {
    "source": "CryptoGlobe",
    "date": "2023-07-04T20:42:16.000Z",
    "title": "Crypto Influencer Layah Heilpern on the Mystery of Andrew Tate’s Allegedly Seized Bitcoin Holdings",
    "url": "https://www.cryptoglobe.com/latest/2023/07/crypto-influencer-layah-heilpern-on-the-mystery-of-andrew-tates-allegedly-seized-bitcoin-holdings/",
    "description": "In a YouTube video released on 3 July 2023, prominent crypto influencer and educator Layah Heilpern sheds light on the intriguing case of the alleged seizure (by Romanian authorities) of former professional kickboxer Andrew Tate’s Bitcoin holdings. Heilpern begins by outlining the two primary ways individuals can hold their Bitcoin: leaving it on a centralized […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-04T21:00:19.000Z",
    "title": "LBank Labs Launches $10 Million MEME Special Fund, Aiming to Nurture High-Quality Early-Stage Innovation Projects",
    "url": "https://news.bitcoin.com/lbank-labs-launches-10-million-meme-special-fund-aiming-to-nurture-high-quality-early-stage-innovation-projects/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. LBank Labs, the venture capital arm of the global exchange LBank, has today announced the establishment of a $10 Million MEME Special Fund. The move is intended to encourage high-quality early-stage innovative MEME projects, foster industry growth, and give back to the wider community. LBank Labs will seek innovative and quality-driven MEME projects [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T20:49:22.000Z",
    "title": "Filecoin Price Prediction 2023-2032: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2023-2032 How much is Filecoin (FIL) worth? The live Filecoin price today is $4.53 USD with a 24-hour trading volume of $211,139,419. Filecoin is down 7.17% in the last 24 hours. The current CoinMarketCap ranking is #30, with a live market cap of $1,962,608,765. It has a circulating supply of 433,564,695 FIL ... <a title=\"Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/filecoin-price-prediction/\" aria-label=\"More on Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-04T20:52:38.000Z",
    "title": "Pepe coin vs. Alex The Doge: the battle to attract investors",
    "url": "https://crypto.news/pepe-coin-vs-alex-the-doge-the-battle-to-attract-investors/",
    "description": "This article will examine the reasons for this shift and analyze the potential of ALEX to surpass PEPE in returns and market performance"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-04T21:00:17.000Z",
    "title": "Bitcoin Bulls Stampede: Bitfinex Report Points To Early Signs Of Bull Market",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bulls-stampede-bitfinex-report-points-to-early-signs-of-bull-market/",
    "description": "Bitfinex, one of the world&#8217;s leading cryptocurrency exchanges, has released a report indicating that Bitcoin (BTC) has been sold in profit since its initial break above $30,000, suggesting early signs of a bull market.  The report highlights two key on-chain metrics, the Spent Output Profit Ratio (SOPR) and Net Unrealised Profit and Loss (NUPL), which suggest that Bitcoin has entered the early stages of a bull market. Bitcoin Sold In Profit The report notes that BTC’s price broke above the crucial $29,500 mark for the second time this year on June 21st and had been bracketing in the range between this level and the $31,000 level since then.  This range has always acted as a pivotal point in deciding the trend for the crypto market and, as such, is a major psychological level. The SOPR has been above one for about two weeks now since the BTC price broke above the crucial $29,500 level, indicating that people are, on average, selling their Bitcoin at a profit. Related Reading: Solana (SOL) Price Targets 40% Rally Amid Strong Fundamentals The report also breaks down the events following the break above the $29,500 level and the subsequent range of the market between that and the $31,000 level from an order flow perspective.  It notes that there is a high probability that the move away from the current range for Bitcoin is decisive since a retest of the range after a move up or down would mean it is likely to act as a crucial rebound zone when and if the price returns to it. However, the report warns that the next move out of the current range will be decisive and violent, which is unusual for the BTC price of late.  BTC Dominates Digital Asset Flows  According to the latest Coin Shares report, investors continue to pour money into digital asset investment products, with a second week of inflows totaling $125 million. The last two weeks have seen inflows of $334 million, representing almost 1% of total assets under management (AuM).  Bitcoin remains the primary focus of investors, accounting for $123 million of inflows, or 98% of all digital asset flows. Recent price appreciation has seen AuM rise to $37 billion, matching the average AuM for 2022 and reaching the highest point since early June. Despite recent bullishness for Bitcoin, short-Bitcoin investment products saw their 10th week of outflows, totaling $0.9 million and representing 59% of AuM. Nevertheless, short-Bitcoin remains the second-best performing asset in terms of inflows year-to-date, with $60 million. Related Reading: Maker (MKR) Outperforms Top Coins With 12% Increase A Day, Will It Test $1100? On the other hand, a selection of altcoins saw minor inflows, with Ethereum leading the way at $2.7 million, followed by Cardano, Polygon, and XRP. Multi-asset and Solana saw minor outflows of $1.8 million and $0.8 million, respectively. The report suggests that investors remain bullish on Bitcoin, with inflows representing a significant portion of total assets under management. However, the continued outflows of short-Bitcoin investment products indicate some investors are betting against the cryptocurrency&#8217;s short-term performance. BTC has failed to consolidate above the $31,000 mark for two consecutive days. At the time of writing, BTC is trading at $30,900, representing a decline of 0.3% in the last 24 hours.  The failure to consolidate above $31,000 could indicate a lack of buyer interest, potentially leading to further downside pressure on the cryptocurrency. It remains to be seen whether BTC can regain its footing and make another attempt at breaking through this crucial level. Featured image from Unsplash, chart from TradingView.com "
  }
]