[
  {
    "source": "Cryptopolitan",
    "date": "2023-09-12T05:01:48.000Z",
    "title": "Autonio NIOX Price Prediction 2023-2032: How soon to reach $0.1?",
    "url": "https://www.cryptopolitan.com/niox-price-prediction/",
    "description": "Autonio NIOX Price Prediction 2023-2032 Weeks into 2023, the Autonio team posted an encouraging message for the crypto industry: The Autonio team has been hard at work on the Cardano testnet to get everything working and ready for everyone to see and has successfully built a bridge so that users can bridge NIOX tokens between ... <a title=\"Autonio NIOX Price Prediction 2023-2032: How soon to reach $0.1?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/niox-price-prediction/\" aria-label=\"More on Autonio NIOX Price Prediction 2023-2032: How soon to reach $0.1?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-12T04:52:48.000Z",
    "title": "Alibaba’s New CEO, Eddie Wu, Prioritizes “User First” and AI-Driven Strategy",
    "url": "https://www.cryptopolitan.com/alibaba-ceo-prioritizes-user-first-and-ai/",
    "description": "In a resolute shift for Alibaba Group, the newly appointed CEO, Eddie Wu, has unveiled a distinct and robust strategic roadmap, emphasizing two primary pillars: a profound commitment to the &#8220;user-centric&#8221; approach and a resolute drive toward AI integration. Wu&#8217;s ascension to the helm marks a pivotal moment in Alibaba&#8217;s storied history as the conglomerate ... <a title=\"Alibaba&#8217;s New CEO, Eddie Wu, Prioritizes &#8220;User First&#8221; and AI-Driven Strategy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alibaba-ceo-prioritizes-user-first-and-ai/\" aria-label=\"More on Alibaba&#8217;s New CEO, Eddie Wu, Prioritizes &#8220;User First&#8221; and AI-Driven Strategy\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-12T04:41:29.000Z",
    "title": "Home Affairs Takes a Casual Stance on Staff’s ChatGPT Experimentation",
    "url": "https://www.cryptopolitan.com/home-affairs-stance-chatgpt-experimentation/",
    "description": "The Australian Department of Home Affairs has shed light on its staff&#8217;s seven-month-long experimentation with ChatGPT, categorizing it as a pursuit of &#8220;general curiosity&#8221; rather than a tool for writing production code or making significant decisions. This revelation comes following the suspension of internal access to ChatGPT in May and a subsequent questionnaire issued by ... <a title=\"Home Affairs Takes a Casual Stance on Staff&#8217;s ChatGPT Experimentation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/home-affairs-stance-chatgpt-experimentation/\" aria-label=\"More on Home Affairs Takes a Casual Stance on Staff&#8217;s ChatGPT Experimentation\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-12T05:08:05.000Z",
    "title": "Bitcoin Cash Price Signals Fresh Increase Despite Weakness in BTC and ETH",
    "url": "https://www.newsbtc.com/analysis/bch/bitcoin-cash-price-fresh-increase-btc-and-eth/",
    "description": "Bitcoin Cash price is holding the key $180 support against the US Dollar. BCH seems to be aiming for a fresh increase toward the $205 and $220 levels. Bitcoin cash price is showing positive signs above the $180 level against the US Dollar. The price is trading below $200 and the 100 simple moving average (4 hours). There was a break above a major bearish trend line with resistance near $189 on the 4-hour chart of the BCH/USD pair (data feed from Kraken). The pair is likely to accelerate higher if it clears $197 and $200. Bitcoin Cash Price Aims Higher In the past few days, Bitcoin Cash price saw a steady decline below $205. BCH even traded below the $195 level, but the downsides were limited compared to Bitcoin and Ethereum. The price remained well-bid near the key $180 support. A low has formed near $180 and the price is now attempting a fresh increase. It broke the $185 level. There was a break above a major bearish trend line with resistance near $189 on the 4-hour chart of the BCH/USD pair. The price is now testing the 23.6% Fib retracement level of the downward move from the $238 swing high to the $180 low. However, Bitcoin Cash is now trading below $200 and the 100 simple moving average (4 hours). Immediate resistance is near the $197 level and the 100 simple moving average (4 hours). The next major resistance is near $205 or the 50% Fib retracement level of the downward move from the $238 swing high to the $180 low. Source: BCH/USD on TradingView.com Any further gains could lead the price toward the $220 and $225 resistance levels in the near term. The next major hurdle is near the $240 level. Dips Supported in BCH? If Bitcoin Cash price fails to clear the $205 resistance, it could start a fresh decline. Initial support on the downside is near the $185 level. The next major support is near the $180 level, where the bulls are likely to appear. If the price fails to stay above the $180 support, the price could test the $168 support. Any further losses could lead the price toward the $150 zone in the near term. Technical indicators 4-hour MACD – The MACD for BCH/USD is gaining pace in the bullish zone. 4-hour RSI (Relative Strength Index) – The RSI is currently above the 50 level. Key Support Levels – $185 and $180. Key Resistance Levels – $197 and $205."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-12T04:43:43.000Z",
    "title": "Ethereum Price Just Saw Key Technical Correction But Upsides Remain Capped",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-capped-1620/",
    "description": "Ethereum price extended its decline below the $1,550 support against the US Dollar. ETH is recovering losses, but upsides might be capped near $1,620. Ethereum gained bearish momentum below $1,580 and $1,550. The price is trading below $1,600 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance near $1,605 on the hourly chart of ETH/USD (data feed via Kraken). The pair could correct higher but the bears might remain active near $1,600 and $1,620. Ethereum Price Breaks Down Ethereum’s price failed to settle above the $1,620 pivot level. ETH started a fresh decline and settled below the $1,600 level, like Bitcoin. There was a drop below the $1,580 and $1,550 levels. It retested the $1,530 zone. A low has formed near $1,530 and the price is now correcting losses. There was a minor increase above the $1,550 level. The price climbed above the 23.6% Fib retracement level of the downward move from the $1,670 swing high to the $1,530 low. Ether is now trading below $1,600 and the 100-hourly Simple Moving Average. Besides, there is a key bearish trend line forming with resistance near $1,605 on the hourly chart of ETH/USD. On the upside, the price might face resistance near the $1,600 level or the 50% Fib retracement level of the downward move from the $1,670 swing high to the $1,530 low. The next resistance is near the $1,605 level or the trend line. Source: ETHUSD on TradingView.com The first major resistance is near $1,620, above which the price could rise toward the $1,650 level. The next major hurdle is near the $1,670 level. A close above the $1,670 level might send Ethereum further higher toward $1,750. Another Drop in ETH? If Ethereum fails to clear the $1,600 resistance, it could start another decline. Initial support on the downside is near the $1,550 level. The first key support is close to $1,530. The next key support is $1,500. A downside break below $1,500 might spark more bearish moves. In the stated case, there could be a drop toward the $1,440 level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is slowly losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,530 Major Resistance Level – $1,620"
  }
]