[
  {
    "source": "Cointelegraph",
    "date": "2023-08-16T09:56:11.000Z",
    "title": "CertiK drops findings on alleged scammer who stole $1M in crypto",
    "url": "https://cointelegraph.com/news/certik-drops-findings-on-alleged-scammer-who-stole-1m-in-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/d863d96e-515d-4651-aa09-60603e7f9025.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The cybersecurity firm has still not been able to determine the actual names or identities of the hackers despite the findings.  </p>\n                    <p><p>Potential evidence linking an anonymous scammer to a Canadian group was highlighted by blockchain security firm CertiK in a report sent to Cointelegraph, however the company has so far failed to confirm the name or identity of the perpetrator/s. </p><p>On Aug. 16, CertiK released their findings from their investigation of a pseudonymous crypto scammer known as “Faint.” According to CertiK, the alleged scammer has been active since 2022, and the company has lost at least $1 million from their actions. </p><p>The security firm identified several Ethereum Name Service (ENS) domains linked to Faint. This includes faintxbt.eth, comefindme.eth, thanksfortheseed.eth, onchainkitten.eth and hzontop.eth. </p><p>CertiK also highlighted that there have been links that established Faint’s connection to another alleged scammer known as “Soup.” On July 17, on-chain researcher <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/zachxbt\">ZachXBT</a> published an investigation on Soup and said that the hacker is responsible for stealing millions in assets after attacking Discord servers by pretending to be employees of a media platform. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ An investigation into the Canadian phishing scammer known as Soup (Dan) who has helped steal millions in assets by attacking the Discord servers of projects like <a href=\"https://twitter.com/Orbiter_Finance?ref_src=twsrc%5Etfw\">@Orbiter_Finance</a> <a href=\"https://twitter.com/PikaProtocol?ref_src=twsrc%5Etfw\">@PikaProtocol</a> <a href=\"https://t.co/EtD5FMiG4R\">pic.twitter.com/EtD5FMiG4R</a></p>&mdash; ZachXBT (@zachxbt) <a href=\"https://twitter.com/zachxbt/status/1680918931442368515?ref_src=twsrc%5Etfw\">July 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to CertiK, the anonymous scammer often taunted projects after compromising their Discord servers. After a Discord hack in 2022, Faint posted a picture displaying a watch and showing the announcement of the <a href=\"https://cointelegraph.com/learn/nonfungible-tokens-how-to-get-started-using-nfts\">nonfungible token (NFT)</a> card game Cross The Ages that their Discord was compromised. </p><p>Certik believes that the watch shown by Faint in the post in 2022 is similar to a watch that <a href=\"https://twitter.com/zachxbt/status/1627653452112269317\" target=\"_blank\" rel=\"noopener nofollow\">surfaced</a> on ZachXBT’s investigation of a scammer known as Madman. CertiK believes that the watch is a possible match to the one shown by Faint in the previous post. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/zunami-protocol-confirms-stablecoin-pools-attacked-in-exploit\"><strong><em>Zunami Protocol confirms stablecoin pools attacked, $2.1M loss estimated</em></strong></a></p><p>Despite the findings, the blockchain security firm still was not able to determine the actual names or identities of the hackers. The company said that Faint still continues to be a threat to the community and encouraged community members to protect themselves against potential wallet drainer attempts. </p><p>Within the report, CertiK recommended applications like Wallet Guard and Pocket Universe which are able to alert users to connections with wallet drainers. The company noted that users can also take precautions by verifying addresses and making sure that any approvals they sign are not from recognized phishing addresses. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/3-4-billion-bitcoin-popcorn-tin-silk-road-hacker/\"><strong><em>$3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-16T10:00:39.000Z",
    "title": "Bitcoin price resilience hinged on short-term holder cost basis, on-chain analysis shows",
    "url": "https://cryptoslate.com/insights/bitcoin-price-resilience-hinged-on-short-term-holder-cost-basis-on-chain-analysis-shows/",
    "description": "<p>Quick Take Bitcoin&#8217;s price dynamics are exhibiting a pattern of consistent reliance on the short-term holder cost basis as a support level, currently standing at $29.1k. For the third time this year, Bitcoin has gravitated towards this price level, indicating its significance in the market&#8217;s perception of Bitcoin&#8217;s value. The Short-Term Holder Realized Price, representing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-price-resilience-hinged-on-short-term-holder-cost-basis-on-chain-analysis-shows/\">Bitcoin price resilience hinged on short-term holder cost basis, on-chain analysis shows</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-16T09:41:11.000Z",
    "title": "Shiba Inu’s $BONE Token Could Emulate $BNB’s Rise, Says Crypto Influencer",
    "url": "https://www.cryptoglobe.com/latest/2023/08/shiba-inus-bone-token-could-emulate-bnbs-rise-says-crypto-influencer/",
    "description": "The Shiba Inu cryptocurrency project, rooted in the popular Shiba Inu dog meme, presents itself as a rival to Dogecoin and runs on the Ethereum blockchain. The Shiba Inu (SHIB) ecosystem comprises three unique tokens, each serving a particular purpose within the project. SHIB, as the main token, acts as a decentralized, community-driven currency that […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-16T09:56:29.000Z",
    "title": "Banks are removing cash from society - Bitcoin anyone?",
    "url": "https://cryptodaily.co.uk/2023/08/banks-are-removing-cash-from-society-bitcoin-anyone",
    "description": "<p>The path to government control with central bank digital currencies is becoming clearer as cash is being stealthily removed by banks.</p>\nESG is the excuse\n<p>Despite government saying that cash will be around for a very long time yet, steps are being taken to broaden our &ldquo;cashless society&rdquo;, as bank branches close and ATMs are being taken away.</p>\n<p>So how are banks managing to get away with this?&nbsp;</p>\n<p>They are seizing on the Environmental, Social, and Governance narrative (ESG) which has become de rigueur in Western society, and which has become a rallying cry for governments and big business looking to shut down anyone and anything that doesn&rsquo;t fit with their ideals.</p>\n<p>For example, if someone goes to their local bank branch or ATM to withdraw cash it is being stated by banks that they are emitting carbon in their movement. The fact that if they weren&rsquo;t going to the bank they would be going somewhere else and still would be emitting carbon isn&rsquo;t discussed.</p>\n<p>In addition the banks say that ATMs use a lot of electricity, plus if someone is making a deposit or withdrawing cash someone in the branch has to deal with this, thereby adding to more electricity and carbon emissions.</p>\n<p>Is this all just nonsense, and is all this being used to justify the banks&rsquo; desire to eventually remove cash from society?</p>\nNatWest sets cash limits\n<p>NatWest, one of the biggest banks in the UK, coming under the umbrella of the Royal Bank of Scotland, which owns Coutts (Nigel Farage scandal), and other banks, has recently decided to give itself the right to set limits on customers&rsquo; deposits and withdrawals.</p>\n<p>The bank hasn&rsquo;t yet said how much these limits will be, but Neil McCoy Ward who has a YouTube channel with 413,000 subscribers is surmising that the daily limit could be &pound;250. The limit is set to be imposed on September 11.</p>\nBanks are closing all exits\n<p>Banks are currently under a lot of pressure, not just in the UK but around the world. Three major banks have collapsed in the US, and Credit Suisse was recently taken over by UBS in Europe. If it were not for the US Federal Reserve and the European Central Bank the contagion would very likely have brought down the entire global banking system.&nbsp;</p>\n<p>Governments must know how shaky the fiat monetary system has become and therefore it appears they are giving banks carte blanche to do everything they can to stop customers from moving their funds.</p>\n<p>Citizens are forced to own bank accounts if they want to be able to pay their bills etc. However, banks no longer provide any kind of service that would make up for customers&rsquo; depreciation of purchasing power, inflation, and the possibility that their bank might fail and decide to bail them in.</p>\n<p>Central planners are starting to close all the exits from the fiat monetary system at the same time as banks increase their power and control over customers. Bitcoin is completely outside of this dystopian nightmare. The world&rsquo;s citizens may want to investigate this option before it&rsquo;s too late.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T09:45:03.000Z",
    "title": "Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?",
    "url": "https://www.cryptopolitan.com/rollbit-price-prediction/",
    "description": "Rollbit coin price prediction 2023-2032 Rollbit has quickly become one of the most popular crypto casinos and trading platforms. Launched in 2019, Rollbit offers a wide range of gaming, sports betting, futures trading, and NFT options for users. With no KYC requirements and support for numerous cryptocurrencies, Rollbit provides an easy entry into the world ... <a title=\"Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rollbit-price-prediction/\" aria-label=\"More on Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T10:08:59.000Z",
    "title": "Huobi founder might own $128m property in Hong Kong",
    "url": "https://crypto.news/huobi-founder-might-own-128m-property-in-hong-kong/",
    "description": "Li Lin, the founder of the Huobi crypto exchange, is believed to own a $128 million mansion in Hong Kong. Li Lin, founder of the Huobi crypto exchange, reportedly purchased a $128 million mansion in Hong Kong. This acquisition comes&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T09:43:50.000Z",
    "title": "RocketSwap unveils response strategy after $865k hack",
    "url": "https://crypto.news/rocketswap-unveils-response-strategy-after-865-hack/",
    "description": "RocketSwap Labs has unveiled its strategy for recovering from a forceful hack that seized $865,000 (471 ETH) from the protocol on Aug. 14. The decentralized exchange on Base intends to reintroduce a fresh farming contract and publicly share it on&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-16T10:00:52.000Z",
    "title": "Forum Sneak Peek: Golden Inuverse Now Confirmed, New Play-To-Earn Crypto Game Previewed",
    "url": "https://www.crypto-news-flash.com/forum-sneak-peek-golden-inuverse-now-confirmed-new-play-to-earn-crypto-game-previewed/?utm_source=rss&utm_medium=rss&utm_campaign=forum-sneak-peek-golden-inuverse-now-confirmed-new-play-to-earn-crypto-game-previewed",
    "description": "<img width=\"512\" height=\"512\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-40.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-40.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-40-300x300.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-40-150x150.jpg 150w\" sizes=\"(max-width: 512px) 100vw, 512px\" />CryptoCoinOpps.com, a forum known for its early support of the Golden Inu token (View Here), and Reddit, the ever-active community-driven platform (View Here), are playing pivotal roles in unveiling something extraordinary for Golden Inu Ecosystem. Traders, gamers, and crypto enthusiasts take note. A video showcasing the BETA version of the much-anticipated Play-To-Earn game, $Golden Inuverse, [...]"
  }
]