[
  {
    "source": "CoinDesk",
    "date": "2023-09-20T15:45:00.000Z",
    "title": "A Bitcoin ETF Has Golden Parallels From History",
    "url": "https://www.coindesk.com/markets/2023/09/20/a-bitcoin-etf-has-golden-parallels-from-history/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Why all the excitement about spot bitcoin ETFs? Well, a gold ETF was a huge deal for markets, and people wonder if $BTC might be next."
  },
  {
    "source": "CoinDesk",
    "date": "2023-09-20T15:45:00.000Z",
    "title": "Understanding the Economics of Ethereum Layer 2s",
    "url": "https://www.coindesk.com/tech/2023/09/20/understanding-the-economics-of-ethereum-layer-2s/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Explosive Ethereum growth is on the way, with layer 2s like Arbitrum, Optimism and now Base paving the way, Michael Nadeau of The DeFi Report writes."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-20T16:00:46.000Z",
    "title": "Coinbase targets swing states in crypto lobbying blitz",
    "url": "https://www.cryptopolitan.com/coinbase-swing-states-crypto-lobbying-blitz/",
    "description": "Coinbase, the leading cryptocurrency exchange, is diving headfirst into political advocacy. With a determined focus on specific states, Coinbase&#8217;s “Stand with Crypto” campaign aims to influence crypto-friendly policies and regulations. Their objective? Focus on key territories, including four pivotal swing states that are essential cogs in the political machinery. Targeting Swing States with A Purpose ... <a title=\"Coinbase targets swing states in crypto lobbying blitz\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-swing-states-crypto-lobbying-blitz/\" aria-label=\"More on Coinbase targets swing states in crypto lobbying blitz\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-20T15:59:06.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 How much is LTC worth? Today, the price of Litecoin stands at $66.5, backed by a 24-hour trading volume amounting to $222 million. With a market capitalization of $4.72 billion, its market dominance is 0.45%. Over the past 24 hours, the LTC price has seen a 0.8% decrease. Currently, the circulating ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-20T16:07:05.000Z",
    "title": "Justin Sun’s crypto initiative raises concerns for Huobi Global",
    "url": "https://crypto.news/justin-suns-crypto-initiative-raises-concerns-for-huobi-global/",
    "description": "Justin Sun&#8217;s stUSDT has quickly become a high-yield darling for crypto investors, amassing $1.8 billion in investments, but the project&#8217;s success brings both operational and reputational challenges for the affiliated Huobi Global exchange. In June, Justin Sun unveiled a new&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-20T15:59:21.000Z",
    "title": "Binance CEO disputes media report of $250 million loan",
    "url": "https://crypto.news/binance-ceo-disputes-media-report-of-250-million-loan/",
    "description": "On Sept. 19, Decrypt, a media outlet, shared a report about Binance&#8217;s CEO Changpeng Zhao, mysterious money movements. According to the Decrypt report, unsealed documents revealed that Zhao extended a loan of $250 million to BAM Management U.S. Holdings. Subsequently,&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-20T15:51:27.000Z",
    "title": "INX Digital to list Unicoin security token on its trading platform",
    "url": "https://crypto.news/inx-digital-to-list-unicoin-security-token-on-its-trading-platform/",
    "description": "INX Digital Company Inc. announces the upcoming listing of asset-backed Unicoin security token on INX.One, expanding its regulated assets portfolio.&#160; A U.S.-regulated broker-dealer, INX Digital Company divulged its plans through an official press release. Unicoin is set to join INX&#8217;s&#8230;"
  },
  {
    "source": "Kraken Blog",
    "date": "2023-09-20T16:02:42.000Z",
    "title": "Kraken one of Newsweek’s 2023 Top 100 American Most Loved Workplaces",
    "url": "https://blog.kraken.com/news/kraken-one-of-newsweeks-2023-top-100-american-most-loved-workplaces",
    "description": "Kraken is proud to announce that we have made Newsweek’s Top 100 American Most Loved Workplaces list. This recognition reflects our ongoing commitment to providing a flexible workplace that prioritizes well-being and career development. Newsweek’s rankings, backed by the rigorous analysis of the Best Practice Institute, are based on survey results of more than two [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-20T16:06:18.000Z",
    "title": "Bitcoin Bulls Could Buck Downtrend With Move To $42,000",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bulls-could-buck-downtrend-with-move-to-42000/",
    "description": "Bitcoin price is back above $27,000 per coin after holding firm at $25,000 for a second time. If price fails to move below support and makes another run for resistance, bulls might finally buck the downtrend with a powerful, measured move to $42,000. Recapping 2023 Using Classical Technical Analysis Methods 2023 thus far has been the year that Bitcoin went mostly sideways. The year began with a strong surge from bear market lows, but failed to instill enough confidence for instant continuation. Even an inverse head and shoulders pattern has yet to produce the expected upside target. Related Reading: Bitcoin Weekly TD Sequential Buy Setup Appears, But Warns Of Potential Risk Instead, BTCUSD has spent months and months going sideways, unable to break above $31,000 or below $25,000 per coin. With the top cryptocurrency finding support at $25,000 a second time, bulls might finally be emboldened. Using classical charting methods such as a the inverse head and shoulders neckline support and a simple downtrend line, we can begin to understand the technical explanation for the pause around this zone. Bitcoin's target is $42,000 based on the measure rule &#124; BTCUSD on TradingView.com The Tale Of Two Retest And The $42,000 Target It is common of an inverse head and shoulders pattern for price to throw back to former neckline resistance and retest it as support. This allows buyers to get in at lower levels, while those who bought earlier take profit. After a retest, Bitcoin made a substantial move up breaking through a downtrend line drawn from all-time highs. However, the confidence was still not enough for proper follow through, so Bitcoin fell back to $25,000 to test the downtrend line it broke out from. Related Reading: Bitcoin Bullish Uptrend Remains Unbroken, Here’s Why With the level tested now twice and proving to be seemingly unbreakable, bulls might finally have the confidence to meet the target of the inverse head and shoulders pattern. This target is located at $42,000 per BTC. This chart originally appeared in Issue #21 of CoinChartist (VIP), where several other Bitcoin price charts demonstrate confluence with the target. Subscribe for free to view the rest of the Bitcoin charts. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-20T16:00:59.000Z",
    "title": "Bitcoin May Not See Lasting Bullish Momentum Until This Happens",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-lasting-bullish-momentum-until-happens/",
    "description": "Bitcoin might not be able to observe any extended runs of bullish momentum until this on-chain indicator reverses its trend. Stablecoin Whale Supply Has Dropped To Lowest In Six Months During the past few days, Bitcoin has registered some rise and has managed to breach the $27,000 level. The asset has, however, been unable to build up any sustained moves above this mark so far. The below chart shows how the cryptocurrency&#8217;s price has changed in recent days: Looks like the asset has gone through some net growth in the last few days &#124; Source: BTCUSD on TradingView While moves above the level have all failed, the asset is still more than 3% up during the past week, which is more than some of the other top coins like Ethereum (ETH), Cardano (ADA), and Dogecoin (DOGE). Now, as for whether Bitcoin can find a proper break toward higher levels, data from the on-chain analytics firm Santiment may provide some hints. The indicator of interest here is the combined percentage of the stablecoin circulating supply that&#8217;s being held by the whales. Here is a chart that shows the trend in this indicator over the past year: The value of the metric seems to have been sliding down recently &#124; Source: Santiment on X The &#8220;whales&#8221; here refer to entities that are carrying at least $5 million in their addresses. These investors are among the largest in the market, so they can hold some notable influence. Related Reading: Here’s Where Next Bitcoin Resistance Lies, From An On-Chain Perspective From the graph, it&#8217;s visible that the total stablecoin supply held by these humongous holders has been on a net decline during the past few months. Following the latest drawdown in the metric, its value has hit 51.14%, which is the lowest observed since March 18th, about six months ago. What Does This Mean For The Bitcoin Price? Now, the main question is: what&#8217;s the relevance of this metric to Bitcoin? The answer to this question lies in the reason why these holders generally choose to hold stablecoins. Investors may want to hold their capital in the form of these fiat-tied tokens whenever they intend to avoid the volatility associated with other assets in the sector like BTC. Such holders are probable to return back into the market as if they were looking to completely exit the sector, they may have done so through outflows into fiat. Once these stablecoin investors find that the prices are right to jump back into the volatile side of the market, they swap their tokens for them. This act of shifting naturally provides a buying pressure on the prices of the coins that they are moving into. Because of this reason, the stablecoin supply could serve as a measure of the potential dry powder available for Bitcoin and other cryptocurrencies. As the whales are clearly the most significant entities in the sector, the stablecoin supply held by them is of particular importance. Generally, uptrends in BTC follow periods where the whales significantly shed their stable supplies, as it means that they are buying into the asset with them. Examples of such a trend are visible in the chart, as this pattern formed both prior to the January rally and the rebound in June. These investors have been decreasing their supply recently as well, but as BTC has gone down in this period instead, it&#8217;s likely that this decline is coming from withdrawals into fiat. Related Reading: Bitcoin Rally Driven By Coinbase Users? Premium Would Say So A turnaround in this indicator may be the one to watch for, as it can be a sign of fresh capital injections into the sector. Perhaps only once the whales&#8217; buying power would return to the same levels as it was earlier in the year when Bitcoin breached $30,000, the asset would be able to find a sustained upward move. Featured image from iStock.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-20T16:01:07.000Z",
    "title": "Ripple and XRP Join Cisco, Adobe, and Nvidia in the Billion Dollar Market to Foster Adoption and Ecosystem Development ",
    "url": "https://www.crypto-news-flash.com/ripple-and-xrp-join-cisco-adobe-and-nvidia-in-the-billion-dollar-market-to-foster-adoption-and-ecosystem-development/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-and-xrp-join-cisco-adobe-and-nvidia-in-the-billion-dollar-market-to-foster-adoption-and-ecosystem-development",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP Lawyer John Deaton\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ripple Labs makes the list of Fortune&#8217;s Best Workplaces in Technology for 2023 with an incredible employee satisfaction review. The blockchain company also made the SFBusinessTimes Top 100 Bay Area Corporate Philanthropy list.  Ripple Labs has been listed as the 13th best company in the Fortune&#8217;s Best Workplaces in Technology for 2023. Its position is [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-20T16:00:27.000Z",
    "title": "Toncoin Price Prediction: $TON Soars; $QUBE Readies For A Spectacular Surge",
    "url": "https://www.crypto-news-flash.com/toncoin-price-prediction-ton-soars-qube-readies-for-a-spectacular-surge/?utm_source=rss&utm_medium=rss&utm_campaign=toncoin-price-prediction-ton-soars-qube-readies-for-a-spectacular-surge",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-97.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-97.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-97-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-97-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Toncoin ($TON) has emerged as a top performer over the past week, soaring by over 60% to a trading price of $2.42. This remarkable surge has placed Toncoin in the spotlight, setting it apart from its competitors in the crypto market. But what lies behind this meteoric rise, and can it be sustained? Toncoin currently [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-20T16:00:15.000Z",
    "title": "Learn Why This New Bitcoin Fork Is Gaining Popularity Amongst Retail Investors",
    "url": "https://www.crypto-news-flash.com/learn-why-this-new-bitcoin-fork-is-gaining-popularity-amongst-retail-investors/?utm_source=rss&utm_medium=rss&utm_campaign=learn-why-this-new-bitcoin-fork-is-gaining-popularity-amongst-retail-investors",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-101.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-101.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-101-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The realm of cryptocurrencies is complex and ever-changing, with new developments occurring at lightning speed. One of the latest trends that is garnering attention is a new Bitcoin fork, which is fast becoming popular among retail investors. This piece will explore the reasons behind this occurrence and its potential implications for Bitcoin&#8217;s future. The contrast [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-20T15:57:06.000Z",
    "title": "Shiba Inu’s Path to 10 Cents: Analyzing the Potential and Pitfalls",
    "url": "https://www.crypto-news-flash.com/shiba-inus-path-to-10-cents-analyzing-the-potential-and-pitfalls/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-path-to-10-cents-analyzing-the-potential-and-pitfalls",
    "description": "<img width=\"1280\" height=\"711\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/shiba-7513487_1280-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/shiba-7513487_1280-1.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/shiba-7513487_1280-1-300x167.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/shiba-7513487_1280-1-1024x569.jpg 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Top memecoin Shiba Inu (SHIB) remains primed for long-term growth. While key adoption obstacles abound, the Shibarium protocol can help make a difference. The industry-wide harsh condition that has been plaguing cryptocurrencies has found its way to Shiba Inu (SHIB) even though the altcoin has been resistant for a very long while. Historically, SHIB once [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-20T15:50:50.000Z",
    "title": "Bitcoin OG Proposes Spiderchain: A Game-Changing Sidechain for BTC and Ethereum",
    "url": "https://www.crypto-news-flash.com/bitcoin-og-proposes-spiderchain-a-game-changing-sidechain-for-btc-and-ethereum/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-og-proposes-spiderchain-a-game-changing-sidechain-for-btc-and-ethereum",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-51.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-51.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-51-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Spiderchain offers full Ethereum Virtual Machine (EVM) equivalence atop Bitcoin&#8217;s secure layer without altering its base protocol. This Layer 2 design is motivated by the rising demand for enhanced decentralized finance (DeFi) applications on Bitcoin. Unlocking Bitcoin&#8217;s Potential: Introducing Spiderchain While Bitcoin remains the benchmark for cryptocurrency, its ecosystem has yet to capitalize fully on [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-20T16:06:00.000Z",
    "title": "XRP Faces Extra Regulatory Burden Amid NYDFS Greenlist Removal",
    "url": "https://coinedition.com/xrp-faces-extra-regulatory-burden-amid-nydfs-greenlist-removal/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/xrp7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/xrp7.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/xrp7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/xrp7-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The New York Department of Financial Services (NYDFS) has removed XRP from its greenlist, and crypto analyst ‘WrathofKhaneman’ on X (formerly Twitter) believes it would lead to an extra regulatory burden for the crypto token. WrathofKhaneman explained what the NYDFS greenlist is all about and the possible implications of the XRP removal for the crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-faces-extra-regulatory-burden-amid-nydfs-greenlist-removal/\">XRP Faces Extra Regulatory Burden Amid NYDFS Greenlist Removal</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]