[
  {
    "source": "CoinDesk",
    "date": "2023-06-26T12:18:15.000Z",
    "title": "First Mover Americas: Bitcoin Retreats Slightly From 12-Month High ",
    "url": "https://www.coindesk.com/markets/2023/06/26/first-mover-americas-bitcoin-retreats-slightly-from-12-month-high/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for June 26, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-26T12:15:26.000Z",
    "title": "Swiss Authorities Freeze $26M Worth of Do Kwon, Terraform Labs Crypto Assets: Report",
    "url": "https://decrypt.co/146166/swiss-authorities-freeze-26m-worth-of-do-kwon-terraform-labs-crypto-assets-report",
    "description": "$26 million in crypto linked to Terraform Labs and held in digital asset bank Sygnum has reportedly been frozen by Swiss authorities."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-26T12:30:00.000Z",
    "title": "Best Cryptos Of 2023: Here Are Top Picks For This Summer",
    "url": "https://cryptodaily.co.uk/2023/06/best-cryptos-of-2023-here-are-top-picks-for-this-summer",
    "description": "<p>If you're a crypto enthusiast seeking the next big investment opportunity or simply looking for meme coins with utility, you're in the right place. In this article, we'll explore the top cryptos of 2023, including Cardano, Solana, Avalanche, Ripple, and the newcomer, Caged Beasts (BEASTS).</p>\n1. Caged Beasts: Instant 20% USDT On Referrals\n<p>Caged Beasts (BEASTS) is not your ordinary meme coin. With its vibrant art style and rewarding referral system, it sets itself apart from the other meme coins littering the market. It has just gone live with the first stage of its presale.</p>\n<p>The nascent meme coin rewards members of the community who actively participate in growing the community through its referral system. This system operates by allowing users to generate a shareable custom code that they can send to their friends to invite them to the community. When someone makes a purchase with this code, the referrer instantly receives 20% of the deposit made by the friend in BNB, USDT, or ETH, while the referred friend receives an extra 20% on top of their purchase as a welcome gift.</p>\n2. Avalanche: Riding the Wave of Potential\n<p>With a $0.18 increase in value over the past 24 hours and a 1.06% upward trend in the last 7 days, Avalanche (AVAX) is capturing the attention of investors. In the last month alone, AVAX's price has risen by 22.61%, demonstrating its ability to be a solid asset if the current trend persists. Looking ahead to the rest of the year, price predictions for Avalanche range from a minimum of $10.04 to a maximum of $9.98, with an average trading price projected around $9.92, and an estimated ROI of -11.7%.</p>\n<p></p>\n3. Cardano: Top Crypto Of 2023?\n<p>Cardano (ADA) is another crypto project that has been gaining momentum recently. With a $0.01 increase in value within the past 24 hours and a promising 6.37% upward trend over the last 7 days, Cardano presents a favorable investment opportunity. The growth of ADA, as evidenced by a 28.45% increase in the last month, positions it as a solid asset for those looking for long-term gains.</p>\n<p>In 2023, price predictions for Cardano range from a minimum of $0.173 to a maximum of $0.282, with an average trading price projected around $0.391, and an estimated ROI of 8.5%.</p>\n<p>4. Ripple: Recovering From Legal Trouble</p>\n<p>Ripple (XRP) seems to be recovering well from its case against the SEC. With a $0.0010 increase in value over the past 24 hours and a positive trend of 5.24% in the last 7 days, XRP continues to show promise. While the growth may be more modest compared to other projects, a 4.75% increase in the last month indicates the reliability of XRP as an asset.</p>\n<p>For 2023, Ripple's price predictions range from a minimum of $0.422 to a maximum of $0.489, with an average trading price projected around $0.555. Although the potential ROI is estimated at -0.2%.</p>\n<p></p>\n<p>5. Solana: Harnessing the Power of Innovation</p>\n<p>Solana (SOL) has been making waves with its recent positive trend, with a $0.02 increase in value within the past 24 hours and a 2.98% upward trend over the last 7 days, Solana presents a favorable investment opportunity. The growth of SOL, as evidenced by a 22.44% increase in the last month, indicates its potential as a reliable asset.</p>\n<p>Looking into 2023, price predictions for Solana suggest a minimum price of $11.42 and a maximum price of $16.52, with an average trading price projected around $21.61. With an estimated ROI of 6.5%, Solana showcases its potential to deliver strong returns and captivate its community.</p>\n<p></p>\n<p>To be a successful investor, you have to stay one step ahead of the competition, and so it pays to know what the top cryptos of 2023 are and which new project has the potential to be worth millions of dollars in the future. Caged Beasts offers enticing rewards and a strong community. Visit the project&rsquo;s website today to learn more about the story of the Caged Beasts and buy the presale to start referring your friends and earning 20% instant USDT.</p>\n<p>Caged Beasts: Join The Revolution!Website: https://cagedbeasts.com&nbsp;</p>\n<p>Twitter: https://twitter.com/CAGED_BEASTS&nbsp;</p>\n<p>Telegram: https://t.me/CAGEDBEASTS</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-26T12:14:04.000Z",
    "title": "NEAR price soars amid Alibaba Cloud partnership",
    "url": "https://crypto.news/near-price-soars-amid-alibaba-cloud-partnership/",
    "description": "NEAR Foundation and Alibaba Cloud have formed a partnership, boosting the advancement of web3 technology in Asia and the Middle East. The move has triggered an over 9% surge in the price of NEAR tokens. The NEAR Foundation, a non-profit&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-26T12:30:37.000Z",
    "title": "Lightning Network Hits Record Highs In Bitcoin And US Dollar Capacity",
    "url": "https://www.newsbtc.com/bitcoin-news/lightning-network-hits-record-highs-in-bitcoin-and-us-dollar-capacity/",
    "description": "The Lightning Network, Bitcoin&#8217;s Layer 2 payment protocol, has achieved a new landmark, reaching an all-time high in Bitcoin capacity, a pivotal move underscoring the network&#8217;s continued growth and increased adoption. The network, which works by locking Bitcoin in payment channels, witnessed a substantial boost, pushing its Bitcoin capacity to a record-high of more than 5,500 BTC for the first time since April, according to data from The Block. This monumental achievement signifies not just the robust growth of the network, but also the increasing confidence in the Lightning Network as a viable payment protocol. Surge In Bitcoin Network Capacity According to The Block, this past Saturday, the Lightning Network attained an apex in capacity, hitting 5,630 BTC. This figure surpasses the prior peak of 5,620 BTC recorded on April 18. Concurrently, the network’s US Dollar capacity also reached an all-time high, topping $172 million. Related Reading: Nansen Forecast For Bitcoin Bull Run: Regulatory Clarity And Lower Inflation The Block noted, as these numbers reveal, Lightning Network&#8217;s capacity has grown significantly, increasing 42% in Bitcoin and 105% in US Dollar terms over the last 12 months. This considerable advancement is a testament to the ongoing acceptance and utilization of the Lightning Network in the crypto world. The Future Of Lightning Network David Marcus, CEO of enterprise-grade Lightning Network firm Lightspark, emphasized the importance of expanding the network’s infrastructure and capacity. Marcus said the reason for this was &#8220;Particularly because we can actually guarantee that even larger payments succeed on Lightning, which in the past has been pretty hard to achieve.&#8221; Envisioning the future, Marcus explained that this development could &#8220;enable any enterprise out there to access a real-time, super low-cost settlement network for the internet that&#8217;s interoperable, that&#8217;s open, that any developer can build on.&#8221; Notably, Marcus underscored the need for the greater exchange involved in the network, arguing that this would not only bolster Bitcoin mobility but also enhance the Lightning Network on and off-ramps. Moreover, the Lightning Network&#8217;s success in Bitcoin and US Dollar capacity signifies a significant step forward in the ongoing evolution of Bitcoin as both a digital asset and a transaction protocol. It affirms the increasing demand for fast, cost-effective, and scalable Bitcoin transactions, a demand that is only likely to grow as more enterprises and developers tap into the potential of the network. Related Reading: Crypto Analyst Predicts: Bitcoin (BTC) To Reach $69,000 And Above In 2023 Meanwhile, over the past week, Bitcoin has seen a rebound from its previous loss amid the United States Securities and Exchange Commission (SEC) lawsuit on the world&#8217;s largest crypto exchanges Binance and Coinbase that brought the largest asset by market cap to trade below $25,000. However, over the past 24 hours, Bitcoin has plummeted by 1.1% with a trading price still above the recently reclaimed $30,000 mark. In the past 7 days, more than $70 billion has been added to the BTC market cap with the asset market capitalization moving from a low of $514 billion last Monday to above $580 billion as of today. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T12:16:46.000Z",
    "title": "Belgium Sets Roadblocks for Binance in Europe, Demands Halt to Operations",
    "url": "https://www.crypto-news-flash.com/belgium-sets-roadblocks-for-binance-in-europe-demands-halt-to-operations/?utm_source=rss&utm_medium=rss&utm_campaign=belgium-sets-roadblocks-for-binance-in-europe-demands-halt-to-operations",
    "description": "Binance has experienced significant headwinds in European markets in the recent past with the Dutch and UK market out of the picture. The exchange has the highest verifiable Bitcoin balance of about 511,290 coins from over 140 million global registered users. The Binance exchange&#8217;s global dominance in the cryptocurrency market is under huge threat following [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-26T12:39:08.000Z",
    "title": "Beginner’s Guide To Curve Finance – Part 1",
    "url": "https://www.altcoinbuzz.io/defi/beginners-guide-to-curve-finance-part-1/",
    "description": "<p>With the exponential growth of the crypto economy, DeFi has witnessed a surge in popularity and widespread adoption. Curve Finance stands out among the DeFi protocols operating on Ethereum. In this article, we will explore the unique characteristics that set Curve Finance apart from other DeFi platforms constantly emerging in the space. What is Curve [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/defi/beginners-guide-to-curve-finance-part-1/\">Beginner&#8217;s Guide To Curve Finance &#8211; Part 1</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-26T12:25:00.000Z",
    "title": "JASMY Faces Price Drop as Whale Deposits 700+ Million Tokens",
    "url": "https://coinedition.com/jasmy-faces-price-drop-as-whale-deposits-700-million-tokens/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/JasmyCoin-JASMY-Price-Analysis-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The on-chain analytics form, Lookonchain, revealed in a tweet earlier today that a whale has transferred millions of Jasmy Coin (JASMY) to an exchange. According to the post, a whale who calls himself “Jasmy Deployer” deposited more than 700 million JASMY, worth around $3.43 million, to Gate.io just a few hours ago. This particular whale [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/jasmy-faces-price-drop-as-whale-deposits-700-million-tokens/\">JASMY Faces Price Drop as Whale Deposits 700+ Million Tokens</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]