[
  {
    "source": "Cointelegraph",
    "date": "2023-07-17T17:22:42.000Z",
    "title": "Bitcoin and crypto brace for further upside as equities look to extend their recent gains  ",
    "url": "https://cointelegraph.com/news/bitcoin-and-crypto-chase-upside-as-equities-extend-their-gains",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/084fa6a3-1e57-486f-9707-319f345ce042.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A variety of macro factors propelled the recent rally across several asset classes, but analysts are at odds regarding the sustainability of the current bullish trend.  </p>\n                    <p><p>The long-awaited recession and resulting resumption of the 2022 bear market that many have been expecting has failed to materialize so far in 2023. In fact, most assets have caught a bid, with the NASDAQ hitting a 52-week high on July 12.</p><p>How can this be, and will the rally continue?</p><p>Michael Burry of Big Short fame declared in January that the US could be in recession by late 2023, with <a href=\"https://cointelegraph.com/news/cpi-btc-supply-5-things-bitcoin-this-week\">CPI lower</a> and the Fed cutting rates (note that today’s CPI print came in much lower than expected, further fueling the recent rally). This would lead to another inflation spike in his view.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/19caa2a0-5b95-49d1-830a-3b42e35b64eb.png\"  /></figure><p>Recently independent macro and crypto analyst Lyn Alden explored the topic in a newsletter published this month.</p><p>In the report, Alden examines today’s inflationary environment by contrasting it to two similar but different periods: the 1940s and the 1970s. From this, she concludes that the US economy will likely enter stall speed or experience a mild recession while experiencing some level of persistent inflation. This could mean that markets continue trending upward until an official recession hits.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">My July 2023 newsletter is out:<a href=\"https://t.co/gTH0nUyrU8\">https://t.co/gTH0nUyrU8</a><br><br>The topic focus on fiscal dominance, and how large debts and deficits can mute the impact of higher interest rates as a policy tool. <a href=\"https://t.co/qmuzInyYjK\">pic.twitter.com/qmuzInyYjK</a></p>&mdash; Lyn Alden (@LynAldenContact) <a href=\"https://twitter.com/LynAldenContact/status/1675622776974049283?ref_src=twsrc%5Etfw\">July 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>The Fed’s inflation fight continues</h2><p>The important difference between the two periods involves rapid bank lending and large monetized fiscal deficits, which Alden suggests are the underlying factors driving inflation. The former occurred in the 1970s as baby boomers began buying houses, while the latter occurred during World War II as a result of funding the war effort.</p><p>The 2020s are more like the 1940s than the 1970s, yet the Fed is running the 1970s monetary policy playbook. This could turn out to be quite counterproductive. As Alden explains:</p><blockquote>“So as the Federal Reserve raises rates, federal interest expense increases, and the federal deficit widens ironically at a time when deficits were the primary cause of inflation in the first place. It risks being akin to trying to put out a kitchen grease fire with water, which makes intuitive sense but doesn’t work as expected.”</blockquote><p>In other words, today’s inflation has been primarily driven by the creation of new federal debt, or what some may call government money printing.</p><p>Raising interest rates to calm inflation can work, but it’s meant for inflation that has its roots in an expansion of credit tied to banking loans. While higher rates tame such inflation by making borrowing more expensive and thus reducing loan creation in the private sector, they make fiscal deficits worse by increasing the amount of interest owed on those debts. The federal debt today is over 100% of GDP, compared to just 30% in the 1970s.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/6837e83b-ff4a-4827-bbab-c7e9981e4532.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Federal government interest payment expenditures vs. Federal Funds Effective Rate. Source: Lyn Alden</em></figcaption></figure><p>While the Federal Reserve has cooled some parts of the economy by raising rates by 500 basis points in little more than a year, the underlying cause of the current inflationary environment remains unaddressed. And with a much higher debt-to-GDP ratio than The U.S had 50 years ago, the situation only worsens at a faster pace. But markets have remained resilient, including tech equities and crypto, even though the correlation between the two has broken. </p><p>In this way, the Fed may be using a tool unfit for the situation, but this hasn’t stopped markets, at least for now. </p><h2>Big Tech defies recession estimates and propels equities </h2><p>Despite the Fed’s battle with inflation and market participants’ expectation of an unavoidable recession, the first half of 2023 has been quite bullish for equities, with the rally extending into July. While bonds have sold off again, raising yields to near-2022 highs, risk assets like tech stocks have been soaring. </p><p>It’s important to note that this rally has primarily been led by just 7 stocks, including names like Nvidia, Apple, Amazon, and Google. These equities make up a disproportionate weight of the NASDAQ:</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Just seven stocks make up 55% of the NASDAQ 100 and 27% of the S&amp;P 500 <br><br>The distribution has become so lopsided that the NASDAQ will be rebalancing to give these megacaps less weight.<br><br>Source: <a href=\"https://twitter.com/GoldmanSachs?ref_src=twsrc%5Etfw\">@GoldmanSachs</a> <a href=\"https://t.co/k1xM1wmL2S\">pic.twitter.com/k1xM1wmL2S</a></p>&mdash; Markets &amp; Mayhem (@Mayhem4Markets) <a href=\"https://twitter.com/Mayhem4Markets/status/1679287865182756864?ref_src=twsrc%5Etfw\">July 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-mining-stocks-outperform-btc-in-2023-but-on-chain-data-points-to-a-potential-stall\"><strong><em>Bitcoin mining stocks outperform BTC in 2023, but on-chain data points to a potential stall</em></strong></a></p><h2>Bonds down, crypto and tech up</h2><p>The rally in tech due in large part to AI-driven hype and a handful of mega cap stocks has also caught a tailwind from an easing in bond market liquidity.</p><p>Alden notes how this began late last year:</p><blockquote>“But then some things began to change at the start of Q4 2022. The U.S. Treasury began dumping liquidity back into the market and offsetting the Fed’s quantitative tightening, and the dollar index declined. The S&amp;P 500 found a bottom and began stabilizing. The liquidity in sovereign bond markets began easing. Various liquidity-driven assets like bitcoin turned back up.”</blockquote><p>A July 11 report from Pantera Capital makes similar observations, noting that real interest rates also have a very different story to tell when compared to the 1970s.</p><p>“The traditional markets may struggle – and blockchain might be a safe haven,” in part because “The Fed needs to continue to raise rates,” given that real rates remain at -0.35%, according to the report. They also conclude from this that “There’s still tons of risk in bonds.”</p><p>They go on to note that while most other asset classes are sensitive to interest rates, crypto is not. Bitcoin’s correlation to equities during 2022 was driven by the collapse of “over-leveraged centralized entities.” Today, that correlation has reached near-zero levels:</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5a48aba4-24d2-47d3-b8fe-184b415d2f61.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin correlation with S&amp;P 500. Source: Pantera Capital</em></figcaption></figure><p>Among the key takeaways here may be that risk assets appear to have a bid under them for the time being. However, this trend could easily reverse by year end.</p><p>Dan Morehead of Pantera Capital said it well when stating that:</p><blockquote>“Having traded 35 years of market cycles, I’ve learned there’s just so long markets can be down. Only so much pain investors can take…It’s been a full year since TerraLUNA/SBF/etc. It’s been enough time. <a href=\"https://cointelegraph.com/news/bitcoin-s-pre-halving-rally-may-start-soon-here-s-why\">We can rally</a> now.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/f1a18ee4-8f54-4bd6-91ec-0dab85a79081.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin price trend and Y-o-Y returns. Source: Pantera Capital</em></figcaption></figure><p>With the halving right around the corner and the prospect of a <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-could-unlock-30-trillion-worth-of-wealth-bloomberg-analyst-says\">spot bitcoin ETF</a> on the horizon, the catalysts for crypto seem poised for a breakout in almost any situation.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-17T17:32:36.000Z",
    "title": "Litecoin on the Brink of Third Halving: Record Hashrate and Profitable Mining Despite 17% Value Dip",
    "url": "https://news.bitcoin.com/litecoin-on-the-brink-of-third-halving-record-hashrate-and-profitable-mining-despite-17-value-dip/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/halvin-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Litecoin on the Brink of Third Halving: Record Hashrate and Profitable Mining Despite 17% Value Dip\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/halvin-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/halvin-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/halvin-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/halvin-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/halvin-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/halvin-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/halvin.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a mere fortnight, the Litecoin network is poised for its third reward halving event, a seismic shift that will slash the LTC miners&#x2019; block rewards from 12.5 LTC per block down to 6.25 LTC. Data illustrates an intensified dedication of hashrate to the Litecoin blockchain as the critical halving deadline draws near. Litecoin Reward [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T17:34:24.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for decoupling on-chain and off-chain trading activity. There was evidence that, unlike traditional financial markets, cryptocurrency volatility is not associated with market downturns. Observers also noted that, after gaining widespread attention and with ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T17:21:09.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T17:09:43.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-17T17:27:04.000Z",
    "title": "More Blockchain Gaming Companies Are Using AI, InQubeta Will Easily Connect Them with Investors",
    "url": "https://nulltx.com/more-blockchain-gaming-companies-are-using-ai-inqubeta-will-easily-connect-them-with-investors/",
    "description": "The success of the InQubeta (QUBE) presale is excellent news for developers of blockchain gaming firms and its platform will make it easier for investors to connect with them. InQubeta is the newest player in the artificial intelligence (AI) cryptocurrency space that’s already generating massive interest with crypto and mainstream investors.  The success of platforms [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-17T17:23:49.000Z",
    "title": "InQubeta Spearheads The AI “Gold Rush”, Here’s Why",
    "url": "https://nulltx.com/inqubeta-spearheads-the-ai-gold-rush-heres-why/",
    "description": "In today&#8217;s rapidly evolving digital landscape, artificial intelligence (AI) has emerged as a transformative technology with immense potential. As industries embrace AI-driven solutions, an exciting project called InQubeta has taken the lead, spearheading what can be described as the AI &#8220;gold rush”. With over $1,400,000 so far raised during its presale, InQubeta has captured the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-17T17:20:21.000Z",
    "title": "Bitcoin (BTC) Price Holds Strong Above $30K, DigiToads (TOADS) Presale Generates Buzz",
    "url": "https://nulltx.com/bitcoin-btc-price-holds-strong-above-30k-digitoads-toads-presale-generates-buzz/",
    "description": "Bitcoin (BTC) continues demonstrating its resilience in the volatile crypto market by holding strong amidst market fluctuations. As Bitcoin asserts its dominance as the leading cryptocurrency, it sets the tone for overall market sentiment. A strong Bitcoin price positively impacts the crypto space, as investors may view this as a sign of stability in the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-17T17:16:33.000Z",
    "title": "Amidst Dogecoin and Floki’s Price Volatility, DigiToads Emerges as the Preferred Meme Coin",
    "url": "https://nulltx.com/amidst-dogecoin-and-flokis-price-volatility-digitoads-emerges-as-the-preferred-meme-coin/",
    "description": "Meme-inspired cryptocurrencies or meme coins have been in the news in the cryptoverse for one reason or the other. Take the example of Dogecoin and Floki Inu. The two meme tokens started the year with a bang and impressive performances. However, the hype soon fizzled out and their token holders are now grappling with their [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-17T17:15:26.000Z",
    "title": "HectorDAO affected by Multichain, votes to liquidate $16m in treasury",
    "url": "https://crypto.news/hectordao-affected-by-multichain-votes-to-liquidate-16m-in-treasury/",
    "description": "Hector Network is the latest project to have been affected by the Multichain shutdown. The majority of votes move to liquidate assets&#160; The Hector Network, a team behind a decentralized finance (defi) project on the Fantom ecosystem, is taking steps&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-17T17:30:43.000Z",
    "title": "XRP Crosses 1 Million Trades Per Minute Following Court Ruling",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-crosses-1-million-trades/",
    "description": "In the wake of a favorable court ruling in the Ripple vs. SEC case, XRP has witnessed an extraordinary surge in demand and trading activity. With over 1 million trades per minute globally, XRP has become the center of attention for investors worldwide.  This unprecedented growth comes after a period of legal uncertainty and trading restrictions, positioning XRP for potential success in the cryptocurrency market. XRP&#8217;s Milestone: Over 1 Million Trades Per Minute Sparks Growth Visionary entrepreneur and self-proclaimed &#8220;Crypto Crusader,&#8221; known as Nick on Twitter,  swiftly recognized the unparalleled growth potential inherent in XRP. Related Reading: Why Ripple’s Victory Against The SEC May Be Short-Lived: Legal Expert Taking to social media, Nick expressed his awe at the surging demand for XRP, emphasizing its relentless upward trajectory in a tweet. With unwavering confidence, Nick firmly believes that this remarkable milestone is merely the inception of XRP&#8217;s extraordinary journey. Also, XRP experienced a significant surge in trading volume, reaching $10.4 billion on July 13. However, while this figure appears impressive, it is worth noting that it only ranks as the 76th largest volume in XRP&#8217;s history.  This observation highlights the immense potential that XRP possesses, suggesting that the recent surge in volume may be just the beginning. A tweet from Leonidas, the host of the popular crypto YouTube channel XRPArcade, underscores this point, stating, &#8220;On July 13th, XRP&#8217;s volume spiked to $10.4 billion. Even though this seems like a big number, historically, this was XRP&#8217;s 76th largest daily trading volume recorded on CoinMarketCap (CMC). The highest was almost $37 billion on April 6th, 2021.&#8221;  This historical context emphasizes that XRP has achieved even higher trading volumes in the past, indicating the potential for further growth.  XRP price sitting at $0.73 &#124; Source: XRPUSD on TradingView.com Daily Volume Surges 18-Fold Following Court Ruling And Exchange Relisting The court ruling that declared XRP as not a Security favored the altcoin as XRP witnessed a dramatic surge in trading volume, increasing from $613 million to $11.2 billion within a single day.  The ruling by the Southern District Court of New York has reignited investor interest in XRP, leading major exchange platforms such as Coinbase, Kraken, and Crypto.com to relist the asset.  The market responded with XRP&#8217;s value soaring by 85% from $0.47 to $0.87, with the token currently trading at $0.78 despite the market drawdown. Related Reading: Ark Invest Sells Over $50 Million Worth of Coinbase Shares Amidst Stock Rally Moreover, XRP&#8217;s market capitalization also experienced a substantial boost, reaching $40.8 billion within the past 24 hours. This surge propelled XRP to become the fourth largest cryptocurrency in terms of market capitalization, trailing only Bitcoin (BTC), Ether (ETH), and Tether USD (USDT).  The derivatives market also witnessed increased interest, with funding rates and open interest for XRP derivatives reaching the highest levels of the year, indicating growing confidence among traders. Featured image from Outlook India, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T17:23:01.000Z",
    "title": "BlackRock CEO Larry Fink: Bitcoin and Crypto Set to Overtake USD, EUR, GBP, JPY, RUB, and CNY in the Next 2 Years",
    "url": "https://www.crypto-news-flash.com/blackrock-ceo-larry-fink-bitcoin-and-crypto-set-to-overtake-usd-eur-gbp-jpy-rub-and-cny-in-the-next-2-years/?utm_source=rss&utm_medium=rss&utm_campaign=blackrock-ceo-larry-fink-bitcoin-and-crypto-set-to-overtake-usd-eur-gbp-jpy-rub-and-cny-in-the-next-2-years",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/bitcoin-g577320603_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/bitcoin-g577320603_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/bitcoin-g577320603_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/bitcoin-g577320603_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/bitcoin-g577320603_1920-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/bitcoin-g577320603_1920-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/bitcoin-g577320603_1920-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Larry Fink, the CEO of leading Asset Management Platform BlackRock, is bullish on Bitcoin and other digital assets.  Fink is certain that Bitcoin and other assets will overtake traditional fiat currencies like the USD and its peers.  Larry Fink, the CEO of Blackrock, has spoken on Bitcoin and the cryptocurrency market, highlighting what he thinks [...]"
  }
]