[
  {
    "source": "Cointelegraph",
    "date": "2023-10-02T05:30:50.000Z",
    "title": "What happened in crypto this weekend? ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-on-the-weekend",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/49ce4f13-5053-4197-842f-530122a6b860.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>FTX hacker has been busy moving funds, the United States government avoided a shutdown, the CFTC charged four people over a fraudulent crypto scheme and more.</p>\n                    <p><h3>FTX hacker moves total of $38M across several days</h3><p>The crypto hacker accused of stealing hundreds of millions worth of crypto from bankrupt crypto exchange FTX has moved 22,500 Ether <a href=\"https://cointelegraph.com/ethereum-price\">(ETH)</a> worth $38 million over the last two days. </p><p>The hacker’s wallet, identified as 0x3e957E, <a href=\"https://cointelegraph.com/news/ftx-hacker-wallet-stirs-as-ethereum-etf-prepare-for-us-debut\">moved around $8.6 million worth of Ether</a> to a new address across two transactions on Sept. 30 — the first significant movement of funds in 10 months. A day later, another $17 million <a href=\"https://cointelegraph.com/news/ftx-exploiter-moved-more-than-17m-in-eth-within-the-last-24-hours\">was moved</a> across to five addresses on Sept. 30, with a significant portion transferred through THORChain’s router and the Railgun contract, according to Spot On Chain.</p><p>However, on Oct. 1, the hacker made another movement, transferring 7,500 ETH, worth $12.6 million, and bringing the total ETH moved over the weekend to $38 million, according to a blockchain analytics platform Lookonchain.</p><p>Lookonchain noted the FTX hacker now has 163,000 ETH, worth $275 million left from the exploit.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">FTX Accounts Drainer transferred 7,500 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a>($12.62M) out again 1 hour ago.<br><br>The FTX Accounts Drainer has transferred 22,500 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a>($38M) out in the past 2 days and currently has 163,235 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a>($275M) left.<a href=\"https://t.co/YMSdqrSTxZ\">https://t.co/YMSdqrSTxZ</a> <a href=\"https://t.co/dL6K47zC3n\">pic.twitter.com/dL6K47zC3n</a></p>&mdash; Lookonchain (@lookonchain) <a href=\"https://twitter.com/lookonchain/status/1708518565463380171?ref_src=twsrc%5Etfw\">October 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><a href=\"https://cointelegraph.com/news/ftx-hacker-reportedly-transfers-a-portion-of-stolen-funds-to-okx-after-using-bitcoin-mixer\">The FTX hacker drained $477 million</a> worth of assets (according to crypto prices at the time) out of multiple FTX global and FTX US exchange wallets within hours of the cryptocurrency exchange filing for Chapter 11 bankruptcy on Nov. 11. </p><p>On Nov. 21, the hacker split 180,000 ETH, worth $200 million at the time across 12 separate wallets.</p><p>The FTX hack made the exploiter the 27th largest ETH whale at the time of the exploit.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> FTX Exploiter 0x3e9 has transferred out a total of 10,250 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> ($17.1M) via 5 addresses over the past 24 hours:<br><br>- sent 7,749 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> ($13M) to the Thorchain router and Railgun contract<br><br>- swapped 2,500 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> ($4.19M) to 153.4 <a href=\"https://twitter.com/search?q=%24tBTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$tBTC</a> at $27,281 on avg<br><br>Notably, the address has been… <a href=\"https://t.co/xzmDz8Vmma\">https://t.co/xzmDz8Vmma</a> <a href=\"https://t.co/4Ykp0zih6G\">pic.twitter.com/4Ykp0zih6G</a></p>&mdash; Spot On Chain (@spotonchain) <a href=\"https://twitter.com/spotonchain/status/1708303212208705776?ref_src=twsrc%5Etfw\">October 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The transfers come only a few days before former FTX CEO <a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-sbf-trial-date-jail-how-long\">Sam Bankman-Fried’s fraud trial</a> on Oct. 3, as well as the possible launch of the United States' first Ethereum futures ETFs.</p><h3>U.S. government avoids shutdown on the 11th hour</h3><p>The United States narrowly avoided a feared government shutdown on Oct. 1, at least for now, after the Senate and House of Representatives agreed on a short-term funding deal. </p><p>U.S. President Joe Biden signed a 45-day bill minutes before the deadline, which will give the two chambers more time to finalize the funding legislation, according to an Oct. 1 report by CNN.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">President Biden signs government funding bill into law <a href=\"https://t.co/jDYwPocdKJ\">pic.twitter.com/jDYwPocdKJ</a></p>&mdash; CNN (@CNN) <a href=\"https://twitter.com/CNN/status/1708536170672460195?ref_src=twsrc%5Etfw\">October 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The United States Securities and Exchange Commission was one of the agencies warning that a government shutdown would cause it to furlough over 90% of its staff and hinder its ability to perform market oversight. </p><p>Bloomberg analyst James Seyffart has previously premised that the then-looming government shutdown was accelerating Ethereum futures exchange-traded funds (ETFs) approval, adding they could launch as early as Oct. 2. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">OKAY:  This looks to be the full list of <a href=\"https://twitter.com/hashtag/Ethereum?src=hash&amp;ref_src=twsrc%5Etfw\">#Ethereum</a>  Futures ETFs that will be given SEC accelerated approval to launch on Monday. Assuming they are all operationally ready to go &amp; assuming no last minute entrants. A potential 9 ETFs with ETH futures trading on Monday <a href=\"https://t.co/eQF6MWL4kP\">pic.twitter.com/eQF6MWL4kP</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1707866932311957577?ref_src=twsrc%5Etfw\">September 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“Our understanding is that the SEC is accelerating approvals for these things,” Seyffart explained on Sept. 29.</p><h3>U.S. CFTC charges four people over Cryptobravos scheme</h3><p>The United States Commodity Futures Trading Commission (CFTC) has charged four individuals and a company for involvement in a fraudulent cryptocurrency platform Cryptobravos.</p><p>According to the CFTC, the crypto scheme operated between January 2017 and October 2021, enticing customers to deposit Bitcoin and other funds, promising to generate risk-free returns for them. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/CFTC?ref_src=twsrc%5Etfw\">@CFTC</a> charged four individuals and a Seychelles company with operating a fraudulent digital assets trading scheme and misappropriation. Learn more: <a href=\"https://t.co/tiOt4YVIzg\">https://t.co/tiOt4YVIzg</a></p>&mdash; CFTC (@CFTC) <a href=\"https://twitter.com/CFTC/status/1707848790412017959?ref_src=twsrc%5Etfw\">September 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, <a href=\"https://www.cftc.gov/PressRoom/PressReleases/8798-23\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to the Sept. 29 complaint, the defendants did not trade Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> or other digital asset commodities and did not earn customer returns through trading.</p><p>Instead, Cryptobravos accepted customer funds, refused to return them and encouraged customers to withdraw funds from retirement accounts or take out loans to make additional deposits, according to the complaint. </p><p>“The majority of customers who deposited money with Cryptobravos did not have their funds returned,” said the CFTC.</p><p>The complaint charges four defendants in Israel, Italy, Germany and Ukraine, along with a Seychelles-based company Expected Value Plus Ltd with fraudulently soliciting and misappropriating tens of millions of dollars from hundreds of individuals. </p><p>The commodities regulator is seeking restitution, disgorgement, civil monetary penalties, permanent trading and registration bans, and a permanent injunction against further violations of the Commodity Exchange Act (CEA) and CFTC regulations against the four defendants.</p><p>CFTC’s Director of Enforcement Ian McGinley said the charges came on the back of strong international cooperation:</p><blockquote>“The roster of agencies who assisted the Division of Enforcement’s investigation makes it clear to fraudsters in our markets that we will pursue them wherever they are located.”</blockquote><h3>Open Exchange token plummets following Su Zhu's arrest</h3><p>The Open Exchange token (OX) has fallen nearly 50% since the news broke that one of its creators, Su Zhu — the co-founder of Three Arrows Capital — was arrested by Singaporean authorities amid an attempt to flee the country.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/a42144e1-70a1-4007-a470-230cd3849570.png\"  /><figcaption style=\"text-align: center;\"><em>OX’s change in price over the last 7 days. Source: CoinGecko.</em></figcaption></figure><p>OX fell 58.5% from $0.024 to $0.01 in a three-hour window on Sept. 29, and has since rebounded to around $0.012 at the time of writing, <a href=\"https://www.coingecko.com/en/coins/open-exchange-token\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to CoinGecko.</p><p><a href=\"https://cointelegraph.com/news/3ac-su-zhu-arrested-in-singapore\">Zhu was arrested at Singapore Changi Airport</a> while attempting to leave the country after a court granted a committal order in late September.</p><p>The committal order granted in Singapore sentenced Zhu to four months imprisonment for failing to comply with a court order.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/three-arrows-liquidators-recoup-losses-from-founders\"><strong><em>3AC liquidators look to recoup $1.3B from founders </em></strong></a></p><p>Open Exchange was launched on April 4, 2023, a cryptocurrency exchange and marketplace for investors who lost funds from recent crypto project collapses.</p><p>Leslie Lamb currently serves as CEO of Open Exchange. Zhu and Kyle Davies played a key role in launching the platform in April.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Su Zhu&#39;s arrest led to a 50% drop in <a href=\"https://twitter.com/search?q=%24OX&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$OX</a>. After 3AC&#39;s $10B bankruptcy, founders Su Zhu &amp; Kyle Davies started the Open Exchange, evading creditors. The Tie Terminal reported this just before markets reacted, underscoring the need for swift info in the dynamic crypto world. <a href=\"https://t.co/EKaObOtJxb\">pic.twitter.com/EKaObOtJxb</a></p>&mdash; The Tie (@TheTieIO) <a href=\"https://twitter.com/TheTieIO/status/1707814512504582405?ref_src=twsrc%5Etfw\">September 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Since the collapse of Three Arrows capital, co-founders Zhu and Davies had avoided being taken in, despite remaining active on social media. Authorities have not yet reported capturing Davies. </p><p>OX is now down 84.4% from its all-time high price of $0.081 on Aug. 9, according to CoinGecko.</p><h3>Other news</h3><p>The U.S. Department of Justice has confirmed its intention to <a href=\"https://cointelegraph.com/news/doj-readies-witnesses-in-bankman-fried-trial-spotlight-on-ftx-assets\">summon former FTX clients, </a>investors and staff as witnesses in the upcoming trial involving former FTX CEO Sam Bankman-Fried after submitting a letter of motion in limine on Sept. 30.</p><p>Ethereum co-founder Vitalik Buterin expressed concerns over decentralized autonomous organizations exerting a monopoly over the selection of node operators in liquidity staking pools, suggesting that it can <a href=\"https://cointelegraph.com/news/vitalik-buterin-dao-staking-pool\">expose the pool’s funds to potential risks</a> from malicious actors.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/huobi-lawsuit-hodlnaut-opnx-3ac-asia-express/\"><strong><em>Huobi sues… Huobi? 3AC rises from ashes, Korea crypto contagion: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-02T05:14:39.000Z",
    "title": "Effective altruism fueled SBF’s ‘ridiculous’ actions at FTX: Ex-Alameda engineer ",
    "url": "https://cointelegraph.com/news/effective-altruism-fueled-ftx-founder-sam-bankman-fried-ridiculous-actions-former-alameda",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/7e63780e-f384-42fc-b1b1-8fb517069446.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>\"No sane person would make those decisions,” says a former engineer at Alameda Research about what ultimately led to the collapse of Sam Bankman-Fried's crypto empire.</p>\n                    <p><p>Effective altruism was used to justify “increasingly risky and ridiculous” actions at crypto exchange FTX prior to its ultimate collapse in November 2022, says a former software engineer at Alameda Research.</p><p>Speaking to Cointelegraph just days before FTX founder Sam Bankman-Fried’s Oct. 3 trial, Aditya Baradwaj shared how the ideology played a role in the company’s collapse while explaining what it was like to work under the former billionaire.</p><p>Baradwaj claimed that effective altruism — which advocates that people make as much money as possible to give it away later — tipped the scales from reason and moved many of the decision-making processes at the company toward insanity.</p><blockquote>“This ideology was used to justify increasingly risky and ridiculous actions that honestly, should have been looked at with a saner mind.”</blockquote><p>Prevalent throughout the tech circles of Silicon Valley and quantitative finance firms in New York, Baradwaj said effective altruism was an alluring and integral part of the cultural DNA at FTX and Alameda Research. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">As an engineer at Alameda Research, I had my entire life savings stolen from me by my former boss: Sam Bankman-Fried.<br><br>Now, after months of recuperation from the craziness of the FTX collapse, I’m ready to tell my story.<br><br>Let’s start at the beginning:<br><br>(1/25) <a href=\"https://twitter.com/hashtag/SBF?src=hash&amp;ref_src=twsrc%5Etfw\">#SBF</a> <a href=\"https://twitter.com/hashtag/FTX?src=hash&amp;ref_src=twsrc%5Etfw\">#FTX</a> <a href=\"https://t.co/x5wKvT0Dy2\">pic.twitter.com/x5wKvT0Dy2</a></p>&mdash; Adi (e/acc) (@aditya_baradwaj) <a href=\"https://twitter.com/aditya_baradwaj/status/1694355617576898838?ref_src=twsrc%5Etfw\">August 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“All of us at the company had this vision of ‘I think altruism is good and I think doing things effectively is good.’ So you put these things together and it’s like, ‘obviously this thing is good,’” he said. </p><blockquote>“But the problem is when it veers into an ends-justify-the-means style of thinking, especially when the ends you’re talking about are just so bizarre and ridiculous that no sane person would make those decisions.”</blockquote><p>Under the guise of effective altruism, Bankman-Fried donated millions of dollars to prevent future pandemics and cure malaria in developing countries. Additionally, Bankman-Fried <a href=\"https://cointelegraph.com/news/democrats-to-reportedly-return-over-1m-of-sbf-s-funding-to-ftx-victims\">was one of the top donors to the Democratic party</a> in the United States, however, he later <a href=\"https://cointelegraph.com/news/elon-musk-alleges-sbf-donated-over-1b-to-democrats-where-did-it-go\">admitted to donating to Republicans as well</a>. </p><p>As Big Short author Michael Lewis told 60 minutes in a recent <a href=\"https://www.cbsnews.com/video/sam-bankman-fried-michael-lewis-book-60-minutes-video-2023-10-01/\" target=\"_blank\" rel=\"noopener nofollow\">interview</a>, one of the ideas being floated by Bankman-Fried during the final days of FTX was paying Donald Trump $5 billion not to re-run as president in 2024, because the 31-year-old wished to “protect democracy.”</p><p>However, in Baradwaj’s eyes, Bankman-Fried and the altruistic philosophy wasn’t an act — he seemed to fundamentally believe what he was espousing. </p><p>Baradwaj explained that despite the many allegations which accused Bankman-Fried of <a href=\"https://cointelegraph.com/news/sam-bankman-fried-leaked-docs-revealed\">hiding behind a fabricated, altruistic persona</a>, in person, he came across exactly as he portrayed himself in the media. </p><p>“He struck everyone as highly motivated, someone who had a mission, who believed in the mission and who wanted to make that happen,” Baradwaj said. “He seemed like someone who knew what he was doing and there was certainly a lot of respect and trust that we had for him.”</p><blockquote>“That trust ended up being significantly misused.”</blockquote><p>Baradwaj said Bankman-Fried’s belief in his supposedly altruistic motives may be why the former FTX founder has staunchly maintained his innocence, <a href=\"https://cointelegraph.com/news/ftx-s-sam-bankman-fried-pleads-not-guilty-to-fraud-charges-report#:~:text=Sam%20%E2%80%9CSBF%E2%80%9D%20Bankman%2DFried,by%20Magistrate%20Judge%20Sarah%20Netburn.\">having pled “not guilty” to all of the charges</a> pressed against him despite <a href=\"https://cointelegraph.com/news/sbf-upset-by-late-evidence-in-trail-ftx-seeks-ai-stock-sale\">a mounting pile of evidence to the contrary</a>.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-sbf-trial-date-jail-how-long\"><strong><em>How long could Sam Bankman-Fried go to jail for? Crypto lawyers weigh in</em></strong></a></p><p>“I'm sure there's all kinds of crazy, psychological stuff going on in his head that are probably trying to cope with the facts,” Baradwaj said. “Maybe he does genuinely believe that what he did was fine or he actually believes that he did nothing wrong.” </p><blockquote>“The truth is important and I think the trial is hopefully going to clear up a lot of questions about everything that went down.”</blockquote><p><strong><em>Big Questions: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-crypto-deaths/\"><strong><em>What’s with all the crypto deaths? </em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]