[
  {
    "source": "Cointelegraph",
    "date": "2023-08-22T05:50:36.000Z",
    "title": "Mysterious Bitcoin wallet becomes 3rd largest BTC holder in 3 months",
    "url": "https://cointelegraph.com/news/bitcoin-whale-wallet-becomes-third-largest-holder-three-months",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/dd333ad6-749b-4522-9a86-d5c7866e06ca.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>An unknown wallet has accrued more than $3 billion worth of Bitcoin in the last three months, sparking a wave of theories about the potential owner. </p>\n                    <p><p>A mysterious Bitcoin wallet has surged up the ranks to become the third largest holder Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) in the world in just over three months, with the timing sparking some wild theories about its owner.</p><p>According to <a href=\"https://bitinfocharts.com/bitcoin/address/bc1ql49ydapnjafl5t2cp9zqpjwe6pdgmxy98859v2\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from crypto statistics platform BitInfoCharts, the wallet address first received Bitcoin on March 8. Over the course of the next three months and two weeks, the wallet had accrued a staggering 118,000 BTC — worth $3.08 billion at current prices. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/08a8ef59-5769-4d83-981f-0895b6146ef3.png\"  /><figcaption style=\"text-align: center;\"><em>The mysterious wallet has accrued 118,000 BTC in less than four months. Source: BitInfoCharts</em></figcaption></figure><p>The rapid and significant accrual of Bitcoin within a single wallet address has attracted its fair share of conjecture. </p><p>Some users suggest it’s most likely a crypto exchange moving funds, while some more radical members of Crypto Twitter have posted a more wild theory — suggesting BlackRock is the “prime suspect.\"</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This unknown address has accumulated over $3 Billion worth of <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> in the last 3 months.<br><br>The prime suspect? <br><br>The first major transaction of 3400 BTC occurred on May 16th 2023. Almost exactly 1 month later on June 15th 2023, BlackRock filed for it&#39;s spot <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ETF. <a href=\"https://t.co/TdFuUkELuH\">pic.twitter.com/TdFuUkELuH</a></p>&mdash; DivXMaN (@crypto_div) <a href=\"https://twitter.com/crypto_div/status/1693738671046885688?ref_src=twsrc%5Etfw\">August 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The theory is not based on any solid evidence, however, others have shared their support it by <a href=\"https://twitter.com/MAKS_Diogenes/status/1692957891538587898\" target=\"_blank\" rel=\"noopener nofollow\">posting</a> pictures of a large black rock. </p><p>The current largest Bitcoin wallets in the world, according to BitInfoCharts, are reportedly owned by Binance and Bitfinex — as Bitcoin cold wallets. </p><p>The unknown Bitcoin whale wallet comes in third place, and is then followed by another Binance cold wallet in fourth place. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/europe-first-bitcoin-etf-hits-euronext-amsterdam-exchange\"><strong><em>First EU spot Bitcoin ETF hits Euronext Amsterdam exchange</em></strong></a></p><p>BlackRock made waves in the crypto market on June 15 <a href=\"https://cointelegraph.com/news/sec-accepts-black-rock-bitcoin-etf-application-signaling-regulatory-review\">when it filed an application for a spot Bitcoin ETF product</a> which — if accepted by the Securities and Exchange Commission — will be the first of its kind in the United States. </p><p>BlackRock’s application sparked a wave of filings for similar spot products from a horde of other Wall Street heavyweights, including <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco\">Fidelity, Invesco, Wisdom Tree</a> and<a href=\"https://cointelegraph.com/news/valkyrie-submits-btc-spot-etf-application-to-go-with-its-futures-miners-etfs\"> Valkyrie</a>.</p><p>The prospect of a spot Bitcoin ETF whipped crypto analysts into a frenzy, sharing their bullish predictions for the price of Bitcoin — with Fundstrat’s head of research, Tom Lee suggesting that Bitcoin could reach a price of <a href=\"https://cointelegraph.com/news/bitcoin-btc-price-150k-after-halving-2024-prediction\">$150,000 per coin following the halving</a> event in April 2024. </p><p><strong><em>Big Questions: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-did-the-nsa-create-bitcoin/\"><strong><em>Did the NSA create Bitcoin?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-22T05:45:37.000Z",
    "title": "Gold-backed BRICS currency will be 'very hard' to deliver: Lyn Alden",
    "url": "https://cointelegraph.com/news/gold-backed-brics-currency-very-hard-to-deliver-lyn-alden",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/32763c8a-50f8-40a9-a2b1-2d1ad4e9a6da.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A BRICS common currency will be challenging to initiate and maintain, though efforts to dethrone the US dollar could have an impact on Bitcoin, says investment strategist Lyn Alden. </p>\n                    <p><p>Macroeconomist Lyn Alden has cast doubt on a proposal that would see five countries work together to develop a common BRICS currency — arguing it will likely struggle to get off the ground and fail to dethrone the United States dollar. </p><p>In an interview with Cointelegraph just days before the BRICS annual summit in South Africa, Alden explained that it will be “very hard” for <a href=\"https://cointelegraph.com/news/brics-history-objectives-and-an-overview-of-the-global-alliance\">BRICS members</a> — Brazil, Russia, India, China and South Africa — to form a gold-backed currency for widespread use.</p><p>Russian President Vladimir Putin first <a href=\"https://www.orfonline.org/expert-speak/brics-reserve-currency/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that BRICS proposal to create an international reserve currency at the BRICS summit in 2022 to rival the U.S. dollar as the global reserve standard. This proposal was later confirmed to come in the form of a gold-backed currency.</p><p>However, Alden argued the model is flawed. </p><p>“Backing a fractional-reserve banking system with gold only works temporarily, because the currency units multiply more quickly than the gold does,” she said.</p><p>Instead, Alden sees a more likely outcome would be that BRICS nations lessen its reliance on the USD for cross-border payments by increasingly using their own currencies for trade — particularly the Chinese yuan.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The BRICS hold G7 currencies as their reserves, and not the other way around. And yet, the BRICS just flipped the G7 in economic size.<br><br>Reserve practices don’t change overnight, but this is a very different environment than 10+ years ago. <a href=\"https://t.co/khoH1Cbvp8\">https://t.co/khoH1Cbvp8</a></p>&mdash; Lyn Alden (@LynAldenContact) <a href=\"https://twitter.com/LynAldenContact/status/1645825098937450496?ref_src=twsrc%5Etfw\">April 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Alden’s comments follow a similar sentiment by former Goldman Sachs economist Jim O’Neil, who dismissed the common currency notion as “ridiculous” in a Aug. 15 <a href=\"https://www.afr.com/markets/currencies/brics-creator-pans-ridiculous-common-currency-20230815-p5dwsv\" target=\"_blank\" rel=\"noopener nofollow\">interview</a> with the Australian Financial Review. </p><p>“They’re going to create a BRICS central bank? How would you do that? It’s embarrassing almost,” O’Neil said, explaining that it simply wouldn’t be feasible.</p><p>On Aug. 21, India’s foreign secretary Vinay Mohan Kwatra also <a href=\"https://www.youtube.com/watch?v=iRz8L32k9D0\" target=\"_blank\" rel=\"noopener nofollow\">downplayed</a> the possibility of BRICS forming a common currency, stating that they’ve become increasingly focused on boosting trade using their own national currencies.</p><p>Emissaries from the nations are due to appear at the 15th BRICS annual <a href=\"https://brics2023.gov.za/\" target=\"_blank\" rel=\"noopener nofollow\">summit</a> held in South Africa on Aug. 22-24, which will cover issues relating to the formation of a common currency, BRICS Development Bank, international trade and the Russia-Ukraine conflict.</p><h3>U.S. dollar dominance could impact Bitcoin</h3><p>Meanwhile, Alden added that potential moves to eat into US <a href=\"https://cointelegraph.com/news/de-dollarization-is-it-really-happening\">dollars’ dominance,</a> could, in a roundabout way, cause headwinds for Bitcoin. </p><blockquote>“This attempt at de-dollarization is likely to contribute to structurally less foreign demand for U.S. Treasuries, higher Treasury yields, and the requirement for the U.S. Federal Reserve to eventually finance a larger share of U.S. government deficits as a result.”</blockquote><p>If <a href=\"https://cointelegraph.com/news/buffett-and-ackman-take-opposing-sides-on-treasury-yields-what-does-it-mean-for-bitcoin\">U.S. treasury yields increase</a> — due to a mass de-dollarization event or not — this could cause <a href=\"https://cointelegraph.com/news/us-treasury-yields-are-rising-what-does-it-mean-for-bitcoin-price\">Bitcoin’s price to face headwinds</a> as risk assets tend to underperform under those conditions, she explained.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/zimbabwe-central-bank-close-introducing-gold-backed-digital-tokens-retail\"><strong><em>Zimbabwe central bank close to introducing gold-backed digital tokens into retail</em></strong></a></p><p>On the other hand, the Alden also believes the price of Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> may increase if the Federal Reserve needs to <a href=\"https://cointelegraph.com/news/federal-reserve-bank-bailout-fund-new-high\">bail out more banks</a> to keep them afloat:</p><blockquote>“In the longer-term, when the Fed has to provide a liquidity backstop for the Treasury market, that would likely be very good for bitcoin, similar to how bitcoin shot up when the Fed had to intervene in the U.S. banking system back in March 2023.”</blockquote><p>A liquidity backstop typically occurs when a bank’s own liquid assets are no longer sufficient to meet its financial obligations, which calls on the central bank to provide them with emergency liquidity.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/wolf-of-all-streets-world-bitcoin-hits-1m-1-million-hall-of-flame/\"><strong><em>Wolf Of All Streets worries about a world where Bitcoin hits $1M: Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-08-22T05:45:37.000Z",
    "title": "Gold-backed BRICS currency will be 'very hard' to deliver: Lyn Alden",
    "url": "https://cointelegraph.com/news/gold-backed-brics-currency-very-hard-to-deliver-lyn-alden",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/32763c8a-50f8-40a9-a2b1-2d1ad4e9a6da.jpg\"></p><p>A BRICS common currency will be challenging to initiate and maintain, though efforts to dethrone the US dollar could have an impact on Bitcoin, says investment strategist Lyn Alden. </p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-22T06:00:00.000Z",
    "title": "\n                        Thailand Warns Facebook Over Crypto Fraud and Scam Ads\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/thailand-warns-facebook-over-crypto-fraud-and-scam-ads",
    "description": "\n                        <p class=\"MsoNormal\" style=\"line-height: 150%;\">The Thai government is taking steps to obtain a court order to shut down Facebook unless the social media giant addresses the rising number of crypto and investment fraud scam ads on its platform.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The Ministry of Digital Economy and Society of Thailand said on August 21 that over 200,000 people have fallen victim to Facebook advertisements that promote cryptocurrency scams. The Ministry noted that some have invested in fake businesses and government agencies like the SEC.&nbsp;</p>\nThailand Acts Against Fraudulent Crypto Ads on Social Media\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">To address this growing concern, the Ministry has asked Facebook to block over 5,301 fake pages and fraudulent ads. The Ministry explained that fraudulent advertisements lure victims as they claim to offer up to 30% returns and illegally use the photographs of celebrities as endorsements. </p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The Ministry said (translated): </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;Today (August 21, 2023), Mr Chaiwut Thanakmanusorn, Minister of Digital Economy and Society (DES), together with Professor Wisit Wisitsorn-at Permanent Secretary of the Ministry of Digital Economy and Society, Mr Wetang Phuangsub Deputy Permanent Secretary of the Ministry of Digital Economy and Society Mr. Tawatchai Pittayasophon Acting Secretary-General Office of the Securities and Exchange Commission (SEC) Mr. Chaichana Mitphan, Director of the Electronic Transactions Development Agency and Pol. Maj. Gen. Thayut Chanthaworn, Deputy Commissioner of Police Investigating Technology Crimes. Along with the private sector, Join the meeting to discuss ways to solve the problem of buying ads via Facebook, deceiving people to invest. Including soliciting investment by pretending to use the name of a registered company and symbols of the SEC without permission, such as the SEC or the Stock Exchange of Thailand, allowing investors to trade gold starting 1 999 baht, along with specifying that there will be experts to take care of and earn 15-30 per cent profit per day or invest through the company Or a famous person who has a message inviting investors to have high profits that give returns on a weekly basis.&rdquo; &nbsp;</p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The government explained that the SEC had offered no such investment. The Ministry explained the various ways in which cybercriminals catch their victims:&nbsp;</p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;Nowadays, cyber crooks have different tactics to fool and transfer money from accounts. With new mechanisms to adjust continuously, such as trading digital coins Through applications or websites, investing in crypto coins, investing with high-yield lending companies, investing in gold stocks, participating in auctions for high returns, investing in foreign exchange trading, and investing in shares in a group of well-known companies.&rdquo; </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Mr Chaiwut Thanakmanusorn, the Minister of Digital Economy and Society (DES), said: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;DES is in the process of compiling evidence from offenders on the Facebook platform to send the court to close Facebook by the end of this month and request the court to order the closure of the Facebook region within 7 days by the offence of Facebook. Because of Facebook receives advertisements from fraudulent offenders in advertising and deceives people into believing in investing and buying products through Facebook. When the customer believes and pays for the product and receives a product that does not match the cover. In the past, there were more than 200,000 victims, or about 95 per cent of 300,000 cases, with damages worth more than 10,000 million baht if Facebook did not help Thailand. If he wants to do business in Thailand, he must show responsibility to Thai society. In the past, the Ministry has been talking to Facebook all the time. But instead did not screen advertisers, causing damage to Thai people of more than 100,000 million baht.&rdquo; </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The Ministry also warned citizens to be fooled by any solicitation through social media and to verify the information they obtain from the related agencies. Social media platform users should be on the lookout for investments offering high returns in a short period of time, guaranteed returns, using the names of celebrities and famous businesspeople; if they are unable to verify a business and the product they offer, and warn investors not to make a hasty decision without doing proper due diligence.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-22T06:00:29.000Z",
    "title": "Bitmain Dispatches Initial KS3 Antminers Amid Surge in Kaspa’s Hashrate",
    "url": "https://news.bitcoin.com/bitmain-dispatches-initial-ks3-antminers-amid-surge-in-kaspas-hashrate/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ddc-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitmain Dispatches Initial KS3 Antminers Amid Surge in Kaspa&#039;s Hashrate\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ddc-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ddc-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ddc-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ddc-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ddc-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ddc-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ddc-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to Bitmain, the well known crypto ASIC mining rig manufacturer, the company has shipped its first batch of KS3 Antminer machines. Despite each rig costing $49,800, Bitmain sold out of the first batch and announced another batch of KS3 Antminers would be available soon. As Kaspa&#8217;s Hashrate Climbs, Bitmain Ships KS3 Antminer Series Bitmain [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T06:05:09.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 How much is MATIC worth? The current price of Polygon is $0.546. Over the past 24 hours, it has seen a trading volume of $1.16 billion. With a market capitalization of $6.15 billion, Polygon holds a market dominance of 0.51%. However, the MATIC price has experienced a decrease of 1.82% in ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-22T06:01:00.000Z",
    "title": "Fintech advisor Titan to pay $1m over SEC crypto charges",
    "url": "https://crypto.news/fintech-advisor-titan-to-pay-1m-over-sec-crypto-charges/",
    "description": "The US SEC has charged a New York-based investment adviser Titan with misleading disclosures related to client crypto assets. The US Securities and Exchange Commission (SEC) has declared formal charges against Titan Global Capital Management. The basis for these allegations&#8230;"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-22T06:01:06.000Z",
    "title": "FTX Debtors to Seek Justice in Class-Action Suit Against Grayscale",
    "url": "https://coinedition.com/ftx-debtors-to-seek-justice-in-class-action-suit-against-grayscale/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/FTX-is-Excited-To-Be-Regulated-in-Dubai-By-VARA-Tweets-FTX-CEO.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Aussie Crypto Exchange Starts Recovery From Downfall After FTX Crash\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/FTX-is-Excited-To-Be-Regulated-in-Dubai-By-VARA-Tweets-FTX-CEO.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/FTX-is-Excited-To-Be-Regulated-in-Dubai-By-VARA-Tweets-FTX-CEO-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/FTX-is-Excited-To-Be-Regulated-in-Dubai-By-VARA-Tweets-FTX-CEO-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/FTX-is-Excited-To-Be-Regulated-in-Dubai-By-VARA-Tweets-FTX-CEO-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/FTX-is-Excited-To-Be-Regulated-in-Dubai-By-VARA-Tweets-FTX-CEO-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent announcement, Alameda Research, UTXO Management, and Balch &#38; Bingham LLP unveiled GrayscaleLitigation.com. According to the notification, the platform seeks to unite the Grayscale Bitcoin Trust and Grayscale Ethereum Trust shareholders for collective legal action against Grayscale Investments. Notably, this litigation effort was originally initiated by Alameda, a debtor of FTX Trading. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ftx-debtors-to-seek-justice-in-class-action-suit-against-grayscale/\">FTX Debtors to Seek Justice in Class-Action Suit Against Grayscale</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-22T05:45:51.000Z",
    "title": "Crypto Lawyer Demands SEC Audit After Binance Suspends EUR Withdrawals",
    "url": "https://coinedition.com/crypto-lawyer-demands-sec-audit-after-binance-suspends-eur-withdrawals/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/SEC-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/SEC-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/SEC-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/SEC-2-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/SEC-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/SEC-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/SEC-2-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/SEC-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/SEC-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/SEC-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/SEC-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/SEC-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/SEC-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/SEC-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/SEC-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/SEC-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/SEC-2-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto lawyer John Reed Stark has called on the Securities and Exchange Commission (SEC) and the Financial Industry Regulatory Authority (FINRA) to send auditors, inspectors, and examiners to investigate Binance. Stark’s latest comments were in response to the suspension of EU withdrawals from Binance. On August 20, 2023, Binance Customer Support on X (formerly Twitter) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-lawyer-demands-sec-audit-after-binance-suspends-eur-withdrawals/\">Crypto Lawyer Demands SEC Audit After Binance Suspends EUR Withdrawals</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]