[
  {
    "source": "CoinDesk",
    "date": "2023-09-06T16:00:00.000Z",
    "title": "Coinbase, Framework Venture Funds Invest $5M in Socket Protocol, in Bet on Blockchain Interoperability",
    "url": "https://www.coindesk.com/tech/2023/09/06/coinbase-framework-venture-funds-invest-5m-in-socket-protocol-in-bet-on-blockchain-interoperability/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The fundraise comes as interoperability protocols have attracted investors, despite the bear market."
  },
  {
    "source": "CoinDesk",
    "date": "2023-09-06T15:45:00.000Z",
    "title": "DeFi and Credit Risk",
    "url": "https://www.coindesk.com/coindesk-indices/2023/09/06/defi-and-credit-risk/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "As a potentially disruptive sector, DeFi must set aside some of its lofty ideals, for now, and focus on financial solutions with demonstrable global demand and adoption."
  },
  {
    "source": "CoinDesk",
    "date": "2023-09-06T15:45:00.000Z",
    "title": "Why Wealth Managers Are Choosing These Crypto Accounts",
    "url": "https://www.coindesk.com/coindesk-indices/2023/09/06/why-wealth-managers-are-choosing-these-crypto-accounts/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Separately managed accounts have seen explosive growth in TradFi, and there are benefits in crypto, too."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-06T15:51:02.000Z",
    "title": "Social Network Rep is Taking GalaChain Beyond Gaming",
    "url": "https://decrypt.co/152396/social-network-rep-is-taking-galachain-beyond-gaming",
    "description": "Rep’s novel location-based platform will integrate with Gala’s gaming, music and film platforms in innovative, social ways."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-06T16:07:17.000Z",
    "title": "Google will allow ads for NFT games starting September 15 ",
    "url": "https://cointelegraph.com/news/google-ads-nft-cryptocurrency-games-september",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/cb35e2fd-2c3b-43b5-a4cc-7b4ea7fbfc4c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The new updates to the cryptocurrency ads policy allows for NFT gaming ads provided the games and ads don’t promote gambling. </p>\n                    <p><p>Google has <a href=\"https://support.google.com/adspolicy/answer/13985443\" target=\"_blank\" rel=\"noopener nofollow\">updated</a> its cryptocurrency advertising policy to allow for blockchain-based NFT gaming advertisements as long as they don’t promote gambling or gambling services. </p><p>According to a blog post from Google, the new changes will go into effect starting Sep. 15 and will be restricted only to games that meet certain criteria:</p><blockquote>“NFT games that allow players to purchase in-game items, like virtual apparel for a player’s characters, weaponry, or armor with better stats, consumed or used in a game to enhance a user’s experience or aid users in advancing the game.”</blockquote><p>Advertisements for games allowing players to wager or stake NFTs against other players or for rewards including cryptocurrencies and other NFTS would continue to be banned under the new policy. NFT casino games and any other social betting paradigm that allows players to wager or play for real-world prizes such as NFTs, cash, or cryptocurrency would also continue to be banned.</p><p>To run ads that promote gambling-related content that integrate NFTs, developers and publishers will need to “comply with the Gambling and games policy and receive the proper Google Ads certification.”</p><p>As Cointelegraph reported in March of 2018, <a href=\"https://cointelegraph.com/news/google-to-ban-all-crypto-related-ads-starting-june-2018\">Google previously banned all cryptocurrency-related advertising across its platforms</a>. Google gave no indication whether the ban would be permanent or reviewable at a later date. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/google-service-policies-eu-regulations-compliance\"><strong><em>Google updates service policies to comply with EU regulations</em></strong></a></p><p>Scott Spencer, the Director of Sustainable Ads at Google at the time, <a href=\"https://www.cnbc.com/2018/03/13/google-bans-crypto-ads.html\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> that the company had “seen enough consumer harm or potential for consumer harm” that it would continue to approach cryptocurrency related ads with “extreme caution.”</p><p>In June of 2021 Google <a href=\"https://support.google.com/adspolicy/answer/10688110?hl=en\" target=\"_blank\" rel=\"noopener nofollow\">softened</a> the ban to allow some companies creating “cryptocurrency exchanges and wallets targeting the United States” to advertise on the platform provided the companies were registered with FinCEN as a Money Services Business or a federal or state-chartered bank entity.</p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2023-09-06T16:02:33.000Z",
    "title": "Maker (MKR) Surges Upon Its New Protocol Release, EOS and VC Spectra Gain Momentum",
    "url": "https://nulltx.com/maker-mkr-surges-upon-its-new-protocol-release-eos-and-vc-spectra-gain-momentum/",
    "description": "As the crypto winter takes hold, there are some tokens that have grabbed the attention of investors. With its new protocol SubDAO scheduled for launch on 3 September, the Maker (MKR) price has increased. While on the other hand, EOS (EOS) has also shown strength post-Japanese regulatory clearance. Moreover, VC Spectra (SPCT) continues to defy [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-06T16:03:16.000Z",
    "title": "Tornado Cash case: crypto anonymity vs regulation ",
    "url": "https://crypto.news/tornado-cash-case-crypto-anonymity-vs-regulation/",
    "description": "The recent indictment of Tornado Cash developers brings the tension between crypto privacy and national security into sharp focus. What are the implications for the crypto world?"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-06T16:00:13.000Z",
    "title": "Bitcoin MVRV At Critical Support Line, Will Retest Be Successful?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-mvrv-at-critical-support-line-will-retest-be-successful/",
    "description": "On-chain data shows the Bitcoin Market Value to Realized Value (MVRV) ratio is nearing a retest that could be crucial for the asset. Bitcoin MVRV Ratio Is Nearing In On The 1.2 Level As an analyst in a CryptoQuant Quicktake post explained, the 1.2 level of the MVRV ratio has historically been a support line for the cryptocurrency. The &#8220;MVRV ratio&#8221; is an indicator that measures the ratio between the Bitcoin market cap and the realized cap. The &#8220;realized cap&#8221; here refers to a capitalization model for BTC that assumes the real value of each coin in circulation isn&#8217;t the current spot price but rather the price at which the coin was last bought/transacted on the blockchain. As the realized cap considers the cost basis or acquisition price of each investor in the market, the model essentially represents the total capital that the holders have put into the asset. Thus, comparing the market cap against the realized cap in the MVRV ratio can provide hints about whether the investors are holding more or less value than they put in. Related Reading: Bitcoin HODLer Dominance Rises To Record Levels, Bullish Sign? When the ratio&#8217;s value is greater than 1, it means that the market as a whole is sitting on some profits right now. Generally, the higher the MVRV goes above this mark, the more probable corrections become for the asset as investors look to harvest their gains. On the contrary, the indicator below this mark can signal that BTC may be underpriced right now, as the average holder in the sector carries coins at a loss. Now, here is a chart that shows the trend in the Bitcoin MVRV ratio over the last few years: The value of the metric seems to have been going down in recent days &#124; Source: CryptoQuant As is visible in the above graph, the Bitcoin MVRV ratio has been above the 1 mark during the past few months. The metric broke above this line in January when the rally started. Besides a retest in March, the indicator has remained above this level since then, implying that the holders have enjoyed profits. Related Reading: Here’s What Will Happen If Bitcoin Can Break $33,700 The 1 level has been important historically for the asset. Still, the quant notes that another value is notable: 1.2. This line has supported the asset a few times in the past, as the analyst has highlighted in the chart (the yellow boxes). Most recently, Bitcoin found support at this level in June, where the cryptocurrency could propel itself back up with a sharp rally. The metric is heading down and again approaching a retest of this line, as its current value is 1.27. Naturally, a successful retest could be positive news for Bitcoin, but a failure might lead to an extended drawdown for the asset&#8217;s price. BTC Price As the chart below shows, Bitcoin has continued to consolidate recently, with the asset&#8217;s price still trading around the $25,700 level. BTC is still displaying stagnant price action &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-06T16:00:48.000Z",
    "title": "Bitcoin Spark Defies Market Conditions, Raising Nearly $1M in a Few Short Months",
    "url": "https://www.crypto-news-flash.com/bitcoin-spark-defies-market-conditions-raising-nearly-1m-in-a-few-short-months/",
    "description": "<img width=\"512\" height=\"248\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-06T145004.483.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-06T145004.483.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-06T145004.483-300x145.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In a period where the crypto market is highly volatile and unpredictable, Bitcoin Spark, an innovative technology, has defied challenging market conditions by raising nearly $1M in a few short months. We will delve into the incredible Journey of Bitcoin Spark and explore the concept of Initial Coin Offerings (ICOs) to understand this outstanding achievement [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-06T15:55:43.000Z",
    "title": "Coinbase Enters the Crypto Lending Arena for Institutional Investors",
    "url": "https://www.crypto-news-flash.com/coinbase-enters-the-crypto-lending-arena-for-institutional-investors/",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Coinbase-7-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Coinbase 7\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Coinbase-7-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Coinbase-7-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Coinbase-7-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Coinbase-7-104x69.jpg 104w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Coinbase Exchange has launched a lending product for institutional investors. The program seeks to fill the void created by bankrupt firms like BlockFi and Celsius Network. American cryptocurrency exchange Coinbase has launched a new lending offering dubbed Coinbase Credit for institutional investors in the United States. The publicly traded company is clearly taking advantage of [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-06T16:01:00.000Z",
    "title": "Paris Hilton-Backed Blockchain Firm Raises $54M to Protect Content Creators’ IP",
    "url": "https://coinedition.com/paris-hilton-backed-blockchain-firm-raises-54m-to-protect-content-creators-ip/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Tim_Draper_Dedicates_a_Bitcoin_Song_to_SVB_at_Paris_Blockchain_Week.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Paris Hilton-Backed Blockchain Firm Raises $54M to Protect Content Creators&#039; IP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Tim_Draper_Dedicates_a_Bitcoin_Song_to_SVB_at_Paris_Blockchain_Week.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Tim_Draper_Dedicates_a_Bitcoin_Song_to_SVB_at_Paris_Blockchain_Week-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Tim_Draper_Dedicates_a_Bitcoin_Song_to_SVB_at_Paris_Blockchain_Week-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Tim_Draper_Dedicates_a_Bitcoin_Song_to_SVB_at_Paris_Blockchain_Week-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Tim_Draper_Dedicates_a_Bitcoin_Song_to_SVB_at_Paris_Blockchain_Week-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Tim_Draper_Dedicates_a_Bitcoin_Song_to_SVB_at_Paris_Blockchain_Week-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Story Protocol secured $54 million in funding to launch a blockchain project. The project aims to help content creators navigate the challenges of AI technology. Story Protocol will build a blockchain repository to safeguard intellectual property across various content forms. US-based technology firm Story Protocol has secured $54 million in funding from a consortium of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/paris-hilton-backed-blockchain-firm-raises-54m-to-protect-content-creators-ip/\">Paris Hilton-Backed Blockchain Firm Raises $54M to Protect Content Creators&#8217; IP</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]