[
  {
    "source": "Cointelegraph",
    "date": "2023-08-29T05:34:23.000Z",
    "title": "DoorDash launches AI bot to take customers' takeout orders",
    "url": "https://cointelegraph.com/news/doordash-launches-ai-bot-to-answer-calls-food-app",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/b7feac12-fdcd-40bb-afe3-15b67e97bc54.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>During peak times, DoorDash’s AI system will take the load off restaurants by automatically answering incoming phone calls.</p>\n                    <p><p>Food delivery service platform DoorDash is integrating AI technology for their restaurant clients, which will see customers communicating their food orders to AI-powered bots instead of busy in-house staff.</p><p>According to an Aug. 28 <a href=\"https://about.doordash.com/en-us/news/introducing-ai-and-agent-powered-voice-ordering\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a> from DoorDash, the new AI-powered voice ordering system will answer customer phone calls, which will be available to \"select operators.\"</p><p>The company’s 2023 Restaurant Online Ordering Trends <a href=\"https://get.doordash.com/en-us/restaurant-online-ordering-trends/?utm_source=PR&amp;utm_medium=Direct&amp;utm_campaign=MX_US_DIR_PRA_PRA_OTR_RES_MOF_DOW_ENG_5_CUSXXX___Q323-PressAnnouncement-VoiceOrdering&amp;_gl=1*1bxjzqd*_gcl_au*NDkzODA2Nzg5LjE2OTMyNzc1MDU.&amp;_ga=2.171876583.676881755.1693277505-2102916359.1693277505\" target=\"_blank\" rel=\"noopener nofollow\">report</a> revealed that while 20% of customers prefer to order their food via phone, up to 50% of customer calls are left unanswered — leading to significant unrealized losses for restaurants. </p><p>“Customers expect more from restaurateurs, and in return, restaurateurs expect even more technology-forward solutions from us — including support for phone channels to meet customers where they’re ordering,” said DoorDash’s head of product and design Rajat Shroff. </p><p>According to the statement, DoorDash will combine a mix of AI and human operators to ensure that all customer calls are answered within a short time frame, allowing restaurants to keep up with increased demand during peak times. </p><p>Additionally, DoorDash says its AI system will be able to provide a personalized customer experience by answering calls in multiple languages.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/48d5a658-c526-471e-9624-51bfc6171ab6.png\"  /><figcaption style=\"text-align: center;\"><em>The growth in users looking at food delivery services for order creation. Source: DoorDash</em></figcaption></figure><p>Third-party food delivery apps have grown significantly in popularity over the last two years. The company’s report found that 34% of respondents begin their food ordering process by looking at a third-party app like DoorDash or UberEats, more than double that of 15% in 2021. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/open-ai-launches-chatgpt-enterprise-for-business\"><strong><em>OpenAI debuts ChatGPT Enterprise — 4 times the power of consumer version</em></strong></a></p><p>The AI-enhanced ordering system will also provide customers with potential recommendations to fill out their meal — a move DoorDash says will increase overall sales for restaurants. </p><p>In May, fast food chain Wendy’s made waves when it announced that it would be <a href=\"https://cointelegraph.com/news/ais-and-fries-wendy-s-to-trial-chatbot-drive-thru-operator\">introducing an AI-powered chatbot</a> dubbed “Wendy’s FreshAI\" to take orders from drive-thru customers.</p><p><strong><em>AI Eye: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-apple-devloping-pocket-ai-deep-fake-music-deal-hypnotize-gpt-4/\"><strong><em>Apple developing pocket AI, deep fake music deal, hypnotizing GPT-4</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  }
]