[
  {
    "source": "CoinDesk",
    "date": "2023-06-05T09:56:40.000Z",
    "title": "Bitcoin Retail Demand to Remain Strong Ahead of Halving Event: JPMorgan",
    "url": "https://www.coindesk.com/markets/2023/06/05/bitcoin-retail-demand-to-remain-strong-ahead-of-halving-event-jpmorgan/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The event will double the bitcoin production cost to around $40,000, creating a positive psychological effect, the report said."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-05T10:00:15.000Z",
    "title": "Binance gains ISO certifications amid global regulatory hurdles",
    "url": "https://cryptoslate.com/binance-awarded-iso-certifications-in-france-uae-and-bahrain/",
    "description": "<p>Binance has obtained the ISO 27001 and ISO 27701 certifications for information security and data privacy in France, United Arab Emirates, and Bahrain, CEO Changeng &#8216;CZ&#8217; Zhao tweeted on June 4. The certifications from the International Security of Organization (ISO) are evidence of high standards for user information security and data privacy across these countries. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-awarded-iso-certifications-in-france-uae-and-bahrain/\">Binance gains ISO certifications amid global regulatory hurdles</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-05T09:40:28.000Z",
    "title": "Are miners sending Bitcoin to exchanges, waiting for higher prices?",
    "url": "https://cryptoslate.com/insights/are-miners-sending-bitcoin-to-exchanges-waiting-for-higher-prices/",
    "description": "<p>Quick Take Miners are continuing to transfer Bitcoin to exchanges. As CryptoSlate identified last week, we saw the largest one-day Bitcoin transfer from miners to exchange in two years. However, 2,600 Bitcoin were sent to exchanges on Saturday, surpassing last week&#8217;s transfer. A potential hypothesis could be that miners are preparing for higher Bitcoin prices [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/are-miners-sending-bitcoin-to-exchanges-waiting-for-higher-prices/\">Are miners sending Bitcoin to exchanges, waiting for higher prices?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-05T10:00:00.000Z",
    "title": "Binance Market Share Drops, Crypto Daily TV 5/6/2023",
    "url": "https://cryptodaily.co.uk/2023/06/binance-market-share-drops-crypto-daily-tv-5-6-2023",
    "description": "In Todays Headline TV CryptoDaily News:\n<p></p>\n<p>Celsius&rsquo; Ether staking shake-up stretches Ethereum validator queue</p>\n<p>The embattled crypto lender Celsius has deposited $745 million of ETH to staking contracts in the past few days, significantly stressing the already-long waiting time to deploy new validators to the Ethereum network.</p>\n<p>Gemini driven offshore by regulators</p>\n<p>Gemini has begun the process of acquiring a license to operate in the United Arab Emirates, after announcing its new European headquarters in Dublin, Ireland. Gemini follows Coinbase, which has been on a global expansion drive recently as U.S. regulators continue to hit the industry with enforcement actions rather than guidance.&nbsp;</p>\n<p>Binance market share drops to lowest since October</p>\n<p>Binance&rsquo;s market share has dropped to its lowest level in eight months. Although the exchange is still the largest cryptocurrency platform by trading volume, it has seen its market share decline consecutively over the past three months after reaching a yearly high of 57% in February 2023.</p>\nBTC/USD gained 0.6% in the last session.\n<p>The Bitcoin-Dollar pair rose 0.6% in the last session. The Stochastic indicator is giving a negative signal. Support is at 267051 and Resistance is at 275171.</p>\n<p>The Stochastic indicator is giving a negative signal.</p>\n<p></p>\nETH/USD gained 0.7% in the last session.\n<p>The Ethereum-Dollar pair rose 0.7% in the last session after gaining as much as 1.1% during the session. The Stochastic-RSI indicates an overbought market. Support is at 1870.9967 and Resistance is at 1918.4367.</p>\n<p>The Stochastic-RSI points to an overbought market.</p>\n<p></p>\nXRP/USD exploded 4.3% in the last session.\n<p>The Ripple-Dollar pair exploded 4.3% in the last session. The MACD is giving a positive signal, which matches our overall technical analysis. Support is at 0.5046 and Resistance is at 0.5398.</p>\n<p>The MACD is currently in the positive zone.</p>\n<p></p>\nLTC/USD traded sideways in the last session.\n<p>Litecoin-Dollar price remained largely unchanged in the last session. The Williams indicator indicates an overbought market. Support is at 92.681 and Resistance is at 99.11.</p>\n<p>The Williams indicator is signalling an overbought market.</p>\n<p></p>\nDaily Economic Calendar:\n<p>US ISM Services PMI</p>\n<p>The ISM Services PMI shows the business conditions outside of the manufacturing sector, taking into account expectations for future production, new orders, inventories, employment, and deliveries. The US ISM Services PMI will be released at 14:00 GMT, Japan's Overall Household Spending at 23:30 GMT, and the UK's BRC Like-For-Like Retail Sales at 23:01 GMT.</p>\n<p>JP Overall Household Spending</p>\n<p>The Overall Household Spending is an indicator that measures the total expenditures of households. The level of spending can be used as an indicator of consumer optimism.</p>\n<p>UK BRC Like-For-Like Retail Sales</p>\n<p>The British Retail Consortium Like-For-Like Retail Sales measures changes in the actual value of retail sales from participating companies with invaluable management information on a regular and reliable basis.</p>\n<p>US Factory Orders</p>\n<p>The Factory Orders is a measure of the total orders of durable and non durable goods which can offer insight into inflation and growth in the manufacturing sector. The US Factory Orders will be released at 14:00 GMT, Japan's Jibun Bank Services PMI at 00:30 GMT, Germany's Exports at 06:00 GMT.</p>\n<p>JP Jibun Bank Services PMI</p>\n<p>The Jibun Bank Services Purchasing Managers Index (PMI) captures the business conditions in the services sector. The services PMI is an important indicator of the overall economic conditions.</p>\n<p>DE Exports</p>\n<p>The Exports measure of the total exports of goods and services by the local economy. A steady demand for exports helps to support growth in the trade surplus.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T09:39:46.000Z",
    "title": "Arbitrum price analysis: ARB value drops to $1.17 following bearish interference",
    "url": "https://www.cryptopolitan.com/arbitrum-price-analysis-2023-06-05/",
    "description": "Arbitrum price analysis is showing bearishness as the ARB market is suffering a major downturn. The price of ARB has dropped by 4.46 percent in the past 24 hours, and it is currently trading at around $1.17. The bears seem to be in control, as the token is struggling to find support at this level ... <a title=\"Arbitrum price analysis: ARB value drops to $1.17 following bearish interference\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-analysis-2023-06-05/\" aria-label=\"More on Arbitrum price analysis: ARB value drops to $1.17 following bearish interference\">Read more</a>"
  }
]