[
  {
    "source": "CryptoSlate",
    "date": "2023-07-28T10:00:26.000Z",
    "title": "Grayscale challenges SEC on Blackrock filing to ensure fair approval of Bitcoin ETPs",
    "url": "https://cryptoslate.com/grayscale-challenges-sec-on-blackrock-filing-to-ensure-fair-approval-of-bitcoin-etps/",
    "description": "<p>Cryptocurrency asset manager Grayscale Investments has sent a letter to the U.S. Securities and Exchange Commission (SEC) arguing that new spot Bitcoin ETF filings such as Blackrock&#8217;s, based on prior rulings, should not be approved according to precedent. The letter argues that the regulator must approve any spot bitcoin exchange-traded products (ETPs) in a consistent [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/grayscale-challenges-sec-on-blackrock-filing-to-ensure-fair-approval-of-bitcoin-etps/\">Grayscale challenges SEC on Blackrock filing to ensure fair approval of Bitcoin ETPs</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-28T09:58:58.000Z",
    "title": "Only US government can print money out of thin air - not crypto bros",
    "url": "https://cryptodaily.co.uk/2023/07/only-us-government-can-print-money-out-of-thin-air-not-crypto-bros",
    "description": "<p>Democrat Congressman Brad Sherman said on Wednesday during a key congressional committee that only the US government has the right to print money out of thin air.</p>\n\n<p>Yes it is true the United States also makes money by printing money. That benefit goes to the American people when we provide services, or when we tax them less, and the attempt of the billionaire bros in crypto is to appropriate for themselves that literal money-making machine.</p>\n\n<p>Congressman Sherman is talking here of the &ldquo;privilege&rdquo; that the US government has to print money out of thin air, and he is saying that this money out of thin air is for better services and lower taxes for the people. He was not asked what the better services were or when and by how much taxes were lowered for the American people.</p>\n<p>The congressman has accused &lsquo;crypto bros&rsquo; in the past of the same thing, saying that they have printed more than $1 trillion from thin air, adding:</p>\n\n<p>They&rsquo;ll accuse the US government of making money out of thin air - maybe we do - we&rsquo;re the US government.&rdquo;</p>\n\n<p>Sherman had a lot more to say about crypto in general, and he singled out Satoshi Nakamoto, the creator of Bitcoin, for special treatment.</p>\n\n<p>&ldquo;We are told that cryptocurrency is very innovative. Look at the incredible financial innovation of Enron and WorldCom, and reflect on the fact that I don&rsquo;t believe that Saratoshi Nagamoto was innovative.&rdquo;</p>\n\n<p>The fact that the congressman couldn&rsquo;t even get the Bitcoin creator&rsquo;s name right says much about him not doing any investigation at all into the history of this technology.&nbsp;</p>\n<p>Also, to pick on Bitcoin, the first technology to solve the double spend problem and possibly the most innovative technology of a generation, rather than a crypto scam coin, does not bode well for his chances of successfully arguing any proposed anti-crypto legislation.</p>\n<p>Brad Sherman is a relic of the past. He has a biassed view which does not take the other side into account. He has obviously carried out no investigation into a technology that has been described as extremely innovative, even by leaders of global financial bodies and heads of global financial companies.</p>\n<p>It is hoped that Sherman and others like him in Congress will be brought to their senses soon, not to pass laws for crypto scammers to be able to make hay at the expense of investors, but to put together thoughtful and constructive laws that will encourage innovation at the same time as protecting those who would use this technology or invest in it.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-28T10:00:10.000Z",
    "title": "Canadian Regulator Proposes Changes to Its ‘Capital and Liquidity Approach to Crypto-Assets’",
    "url": "https://news.bitcoin.com/canadian-regulator-proposes-changes-to-its-capital-and-liquidity-approach-to-crypto-assets/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1317562316-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Canadian Regulator Proposes Changes to Its &#039;Capital and Liquidity Approach to Crypto-Assets&#039;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1317562316-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1317562316-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1317562316-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1317562316-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1317562316-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1317562316-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1317562316.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The regulator of financial institutions in Canada said on July 26 that it had started the process of gathering the public’s view on proposals to change its &#8220;capital and liquidity approach to crypto-assets.&#8221; The draft guidelines are a response to the Basel Committee on Banking Supervision&#8217;s new banking standards for crypto-asset exposures. Staying Abreast With [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T09:50:48.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $24.70 with a 24-hour trading volume of $618,897,839. Solana is up 2.03% in the last 24 hours. The current CoinMarketCap ranking is #9, with a live market cap of $7,273,881,101. It has a circulating supply of 394,890,490 SOL coins and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T09:43:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. BNB prices have dropped by 23.95% since April 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-28T10:04:46.000Z",
    "title": "Peter Brandt: Bitcoin halving and ETF are much ado about nothing",
    "url": "https://crypto.news/peter-brandt-bitcoin-halving-and-etf-are-much-ado-about-nothing/",
    "description": "Trader Peter Brandt challenges common beliefs on Bitcoin (BTC) halving and the prospect of a US Bitcoin ETF. Noted trader and analyst Peter Brandt has challenged the hype over two pivotal Bitcoin events: the forthcoming halving and the potential approval&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-28T09:41:38.000Z",
    "title": "Exploring the early CBDC adoption results beyond the hype",
    "url": "https://crypto.news/exploring-the-early-cbdc-adoption-results-beyond-the-hype/",
    "description": "Preliminary outcomes from countries where central bank digital currencies (CBDCs) have been introduced show mixed results. Despite widespread exploration and a handful of launched projects, CBDCs are yet to achieve global adoption.&#160; According to an Atlantic Council report, 130 countries&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-28T09:45:56.000Z",
    "title": "Ethereum Price Will Skyrocket Due To AI-Driven DAO Revolution: Arthur Hayes",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-price-skyrocket-ai-dao-revolution/",
    "description": "In a thought-provoking blog post titled &#8220;Moai,&#8221; Arthur Hayes, co-founder of the renowned crypto exchange BitMEX, delves into the potential impact of Artificial Intelligence (AI) on the future of economic organization and the role of Ethereum. Hayes argues that the rise of AI-driven Decentralized Autonomous Organizations (DAOs) will revolutionize the global economy and propel Ethereum to new heights. The Critical Role Of DAOs In The AI Era Hayes contends that the current economic progress and per capita wealth of global civilization can be attributed to the efficient self-organization of human societies. He emphasizes that traditional company structures, empowered and regulated by the state, have been the primary vehicles for economic development. However, he highlights the limitations of these structures when it comes to AI-driven entities. He states, &#8220;An AI has no reason to follow any laws. It cannot be coerced by the state, and therefore, exchanges that trade tokens issued by AI-powered DAOs will likely become natural monopolies.&#8221; Related Reading: Lacoste Unveils Exclusive Ethereum-Based Virtual Store For NFT Holders Hayes lays out a compelling argument for why DAOs, relying on smart contracts executed on public blockchains like Ethereum, are the ideal organizational structure for AI-driven entities. These smart contracts provide transparency, immutability, and cryptographic verification of transactions and agreements. Consequently, DAOs can operate efficiently and securely without the need for third-party intermediaries or costly auditing processes. He envisions a future where AI-powered DAOs will raise capital and trade their tokens on decentralized exchanges (DEXs) on Ethereum rather than traditional centralized exchanges. This will create truly global capital markets accessible to anyone with an internet connection. Hayes predicts that DEXs will become natural monopolies due to the advantages they offer in terms of trust, security, and ease of use. The BitMEX founder presents a hypothetical example of &#8220;PoetAI,&#8221; an AI-powered DAO that aims to fundraise and produce original poetry for profit. He envisions how PoetAI could issue its tokens, called &#8220;POET,&#8221; through a smart contract with specific attributes, such as revenue sharing and voting mechanisms. Investors can confidently invest in PoetAI DAO knowing that its financial statements are continuously available on the public blockchain, eliminating the need for traditional auditors. Related Reading: Ethereum Price Could Avoid More Downsides If It Closes Above One Key Level Moreover, Hayes explains that DAOs can raise capital by issuing debt, enabling economic time travel by borrowing from the future to stimulate present economic activity. The enforceability of contracts in DAOs can be facilitated through smart contracts on public blockchains, ensuring that investors are protected. Hayes’ Bull Case For Ethereum Hayes concludes, &#8220;Ethereum transactions will grow exponentially as DAOs proliferate. As a result, the price of ETH should skyrocket in anticipation if this AI DAO hypothesis is widely believed.&#8221; He also suggests that identifying and investing in Ethereum based governance tokens of DEXs facilitating AI-driven DAO trading will lead to significant profits. Furthermore, Ethereum middleware layers that enable visualization of AI DAO accounts will become essential for the smooth functioning of these capital markets. While these ideas represent bold predictions about the future of AI and the role of Ethereum, Hayes presents a compelling case for the potential disruptive power of AI-driven DAOs. Hayes is one of the great thinkers of crypto space and his thesis a narrative to watch. At press time, the Ether (ETH) price was at $1,863, just below the mid-range resistance. Featured image from rc.xyz NFT gallery / Unsplash, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T10:00:07.000Z",
    "title": "DigiToads Aims to Dethrone Dogecoin and Shiba Inu in the Meme Arena",
    "url": "https://www.crypto-news-flash.com/digitoads-aims-to-dethrone-dogecoin-and-shiba-inu-in-the-meme-arena/?utm_source=rss&utm_medium=rss&utm_campaign=digitoads-aims-to-dethrone-dogecoin-and-shiba-inu-in-the-meme-arena",
    "description": "<img width=\"512\" height=\"384\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T124038.410.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T124038.410.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T124038.410-300x225.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Meme coins have captured the attention of investors in the dynamic decentralized finance (DeFi) space for their entertaining and comical nature. Inspired by internet memes and cultural references, these digital assets garner popularity by fostering vibrant online communities. The revolutionary DigiToads (TOADS) is standing out amidst other meme coins in the meme arena with a [...]"
  }
]