[
  {
    "source": "CoinDesk",
    "date": "2023-07-28T08:19:25.000Z",
    "title": "Shibarium Blockchain's Ethereum Bridge Goes Live for Testing as SHIB Tries to Shed Meme Coin Tag",
    "url": "https://www.coindesk.com/tech/2023/07/28/shibarium-blockchains-ethereum-bridge-goes-live-for-testing-as-shib-tries-to-shed-meme-coin-tag/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Shiba Inu-based layer 2 blockchain is expected to start operations next month."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-28T08:17:44.000Z",
    "title": "Early Unibot Investors Sit on 200x Gains as UNIBOT Bucks Bitcoin Lull",
    "url": "https://www.coindesk.com/tech/2023/07/28/early-unibot-investors-sit-on-200x-gains-as-unibot-bucks-bitcoin-lull/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "UNIBOT prices have soared to $200 with a market cap of $180 million."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T08:32:46.000Z",
    "title": "Crypto mining hardware retailer Phoenix Technology mulls IPO in UAE: Report",
    "url": "https://cointelegraph.com/news/crypto-mining-hardware-retailer-phoenix-technology-mulls-ipo-in-uae-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/3a88c956-1af4-4d06-a1f7-c3968e29c688.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A mainstream media report highlighted that the mining hardware firm Phoenix Technology is planning to go public in Abu Dhabi, UAE. </p>\n                    <p><p>Crypto mining hardware provider Phoenix Technology is reportedly starting discussions to conduct an initial public offering (IPO) in the United Arab Emirates, according to a report by Bloomber. </p><p>The Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2023-07-28/crypto-hardware-retailer-phoenix-said-in-early-talks-for-uae-ipo\" target=\"_blank\" rel=\"noopener nofollow\">report</a> cites anonymous sources who explained that discussions around the matter are still ongoing and the details are not yet finalized. </p><p>Phoenix Technology is a UAE-based mining operator which is developing one of the largest mining facilities within the Middle East. The company has distribution rights for various tech hardware manufacturers throughout the Middle East, Africa and Turkey. </p><p>Cointelegraph reached out to Phoenix Technology for comments but did not get an immediate response. </p><p>The UAE has been one of the most crypto-friendly jurisdictions in the world, constantly trying to provide regulatory clarity by <a href=\"https://cointelegraph.com/news/dubai-establishes-virtual-asset-regulator-and-announces-new-crypto-law\">establishing a crypto-dedicated regulator</a> called the Dubai Virtual Asset Regulatory Authority (VARA). Apart from this, an emirate within the UAE called Ras Al Khaimah (RAK) has <a href=\"https://cointelegraph.com/news/uae-emirate-to-launch-free-zone-for-digital-and-virtual-asset-firms\">created a crypto-focused free trade zone</a> called the RAK Digital Assets Oasis, more commonly known as RAK DAO. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, we approved the virtual assets law and established the Dubai Virtual Assets Regulatory Authority. A step that establishes the UAE’s position in this sector. The Authority will cooperate with all related entities to ensure maximum transparency and security for investors. <a href=\"https://t.co/LuNtuIW8FM\">pic.twitter.com/LuNtuIW8FM</a></p>&mdash; HH Sheikh Mohammed (@HHShkMohd) <a href=\"https://twitter.com/HHShkMohd/status/1501566703322513408?ref_src=twsrc%5Etfw\">March 9, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Crypto players operating locally also believe that the UAE’s infrastructure <a href=\"https://cointelegraph.com/news/uae-crypto-landscape-more-business-friendly-than-the-us-says-exec\">is more business-friendly</a> than the United States when it comes to crypto. In a previous Cointelegraph interview, Crypto Oasis executive Saqr Ereiqat, said that the UAE’s regulatory frameworks are more streamlined compared to the fragmented regulatory environment in the US. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/crypto-blockchain-ant-group-reportedly-plans-ipo-blockchain-firm-discloses-offer-price-on-nasdaq-and-more\">Ant Group reportedly plans IPO, blockchain firm discloses offer price on Nasdaq</a></em></strong></p><p>Despite its friendliness toward crypto businesses, the UAE’s crypto regulators are also strict when it comes to submitting requirements and penalizes businesses that aren’t able to comply with its deadlines. On July 11, VARA <a href=\"https://cointelegraph.com/news/dubai-vara-suspends-bitoasis-exchange-license\">suspended the license of BitOasis</a> — one of the largest local exchanges in the country and the first to secure an operating license in Dubai. According to VARA, the exchange was not able to meet the deadlines for submitting the mandated requirements by the regulator. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\"><strong><em>Best and worst countries for crypto taxes — plus crypto tax tips</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T08:30:00.000Z",
    "title": "Twitter Community Notes hits 44 countries as Elon Musk seeks 'truth' for X",
    "url": "https://cointelegraph.com/news/elon-musk-twitter-community-notes-expands-elon-musk-seeks-truth",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/ef30f361-4a9f-4489-8034-ee958b50f849.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Contributors from 44 countries are tasked with vetting the information being shared on posts that draw greater attention and are often subject to being picked up by mainstream media.</p>\n                    <p><p>Tech entrepreneur Elon Musk’s Twitter (rebranded to X) added contributors from 18 new countries to ensure the accuracy of the information being shared on the platform. As a result, Community Notes — the information watchdog on X — now has contributors from 44 countries in total.</p><p>Ever since <a href=\"https://cointelegraph.com/news/elon-musk-buys-twitter-for-44b-crypto-industry-reacts\">Elon Musk’s acquisition of Twitter</a>, the entrepreneur claims he has envisioned transforming the platform into an everything app, which involved eradicating misinformation and preventing scam accounts from operating openly. Following <a href=\"https://cointelegraph.com/news/twitter-rebrand-to-x-elon-musk-everything-app\">Twitter’s rebranding to X</a>, Musk expedited the transformational drive given the aggressive efforts made by Threads and TikTok clones to dominate the text-based social media realm.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Please contribute to improving the accuracy &amp; context of information on this platform! <a href=\"https://t.co/ffSdL0bQPw\">https://t.co/ffSdL0bQPw</a></p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1684669761404436480?ref_src=twsrc%5Etfw\">July 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Contributors from 44 countries are tasked with vetting the information being shared on posts that draw greater attention and are subject to being picked up by mainstream media. As part of the rebranding effort, the X app refrains from addressing itself as a social media platform and instead positions itself for “breaking news, entertainment, sports, politics and everything in between.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/b9f76f27-d843-41de-a3bd-588e2867285a.png\"  /><figcaption style=\"text-align: center;\"><em>X's (previously Twitter) app description on Google Play store. Source: Google Play</em></figcaption></figure><p>“This platform aspires to be the best (or least bad) source of truth on the Internet,” <a href=\"https://twitter.com/elonmusk/status/1682773897014398976\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Musk when discussing the fact-checking system — Community Notes — on July 22.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/tiktok-rival-twitter-threads-text-posts-feature-launch\"><strong><em>TikTok launches text posts feature to rival Twitter and Threads</em></strong></a></p><p>Moreover, the entrepreneur made a user-centric decision by backtracking on his decision to permanently change the X user interface to a dark theme. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">A lot of people have asked to keep light mode, so we will, but the default will be dark and dim will be deleted</p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1684726333157580800?ref_src=twsrc%5Etfw\">July 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While X continues its aggressive attempts to reinvent itself, its biggest competition — Threads — introduced a new feature to resemble the original Twitter.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/6541988b-6173-4e98-a8b3-b59867608f9e.png\"  /><figcaption style=\"text-align: center;\"><em>Adam Mosseri’s explanation for the introduction of rate limits on Threads. Source: Threads</em></figcaption></figure><p>Following its launch on July 5, Threads witnessed a record-breaking uptake of new users, surpassing 100 million users within five days. Unfortunately for Mark Zuckerberg, the engagement seems rather short-lived.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/elegant-and-ass-backward-jameson-lopps-first-impression-of-bitcoin/\"><strong><em>‘Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T08:13:08.000Z",
    "title": "NFT-styled debit cards the future of Web3 - Animoca founder on $30M hi investment",
    "url": "https://cointelegraph.com/news/nft-styled-debit-cards-the-future-of-web3-animoca-founder",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/bce86794-4f6a-455e-9c77-9c8d68fc9414.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Animoca Brands partners with hi, a Web3 app that features cryptocurrency exchange services, conventional digital banking and customized NFT-styled debit cards.</p>\n                    <p><p>Animoca Brands co-founder and executive chairman Yat Siu sees significant potential in the personalization of Web3-based services as his firm earmarks $30 million to neobank platform hi.</p><p>Siu's investment firm plans to invest into the Web3 app that combines a cryptocurrency exchange, digital banking services and a customizable NFT-styled crypto debit card offering as part of its growing ecosystem. </p><p>Speaking exclusively to Cointelegraph, Siu said that hi’s vision for their NFT debit card offering intersects with his own views on the interplays of culture and Web3. hi's flagship crypto-friendly Mastercard debit card allows users to personalize their physical cards with an NFT avatar which they verifiably own.</p><blockquote>“It is an example of the ongoing shift towards personalization, where Web3 finally allows users the opportunity to express themselves and their individuality in new and exciting ways.” </blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/ee616aa9-2c83-44d1-bff7-652b387c7a17.png\"  /><figcaption style=\"text-align: center;\">Source: hi.com</figcaption></figure><p>A central feature of the agreement is the potential to amplify the utility of various Web3 tokens and nonfungible tokens (NFTs). The hi ecosystem features Web3-integrated financial application as well as its own hi protocol, which is an EVM compatible sidechain for Ethereum.</p><p>The two companies will also look to drive the adoption of a “unique-human authentication mechanism”, in reference to the hi protocol’s proof of human identity solution. </p><p><a href=\"https://cointelegraph.com/news/animoca-still-bullish-on-blockchain-games-awaits-license-for-metaverse-fund\"><strong><em>Related: Animoca still bullish on blockchain games, awaits license for metaverse fund</em></strong></a></p><p>Sean Rac, hi co-founder, told Cointelegraph that the protocol’s proof of human identity solution looks to address shortcomings of the “Web2” era where a handful of companies gained control over user data and identity after establishing themselves as “dominant credential providers”.</p><p>According to Rac, hi’s solution addresses this by using a dual-bode structure where one set of nodes serve as identity validators that are responsible for verifying accounts are actually owned by humans. Meanwhile block producers secure the network.</p><p>Rac added that the approach could open up possibilities for “human-only” networks and decentralized applications.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Animoca Brands and <a href=\"https://twitter.com/hi_com_official?ref_src=twsrc%5Etfw\">@hi_com_official</a> <br>We entered into a MoU for partnership to support hi&#39;s dedicated work in bridging fiat &amp; cryptocurrency worlds to onboard <a href=\"https://twitter.com/hashtag/Web3?src=hash&amp;ref_src=twsrc%5Etfw\">#Web3</a> to mass, creating real-world use cases for utility tokens like <a href=\"https://twitter.com/search?q=%24SAND&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$SAND</a>, <a href=\"https://twitter.com/search?q=%24EDU&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$EDU</a>, <a href=\"https://twitter.com/search?q=%24APE&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$APE</a> &amp; more! <a href=\"https://t.co/i5qOjMluPv\">https://t.co/i5qOjMluPv</a></p>&mdash; Animoca Brands (@animocabrands) <a href=\"https://twitter.com/animocabrands/status/1684522687174172672?ref_src=twsrc%5Etfw\">July 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The partnership will also allow users to spend and receive Animoca Web3 ecosystem tokens, including the Sandbox’s SAND and Bored Ape Yacht Club ecosystem’s APE tokens. The Web3 app is touted to have over 3.5 million users.</p><p>The card service is set to allow users to pay with a fiat or crypto debit card around the world, tapping into some 90 million merchants that make use of the Mastercards services. </p><p>The platform looks to move into a space that has been shaped by neobanks like Revolut, while its focus on Web3 might attract proponents and enthusiasts to get onboard, even if its just to have a debit card to flaunt their prized BAYC, Meebit or Pudgy Penguin NFTs.</p><p>Siu added that the investment was driven by the belief that hi would bring a new set of users to Web3 as well as Animoca’s own properties like The Sandbox. </p><blockquote>“We believe that hi’s core application will facilitate on- and off-ramp rails and therefore further drive mass adoption.”</blockquote><p>There could also be significant value in the deal for Animoca, which has invested in a number of different NFT and Web3 projects, platforms and NFTs collections. Siu also noted investment would begin once definitive agreements have been signed off by both parties.</p><p>The neobank has secured the green light as a virtual asset service provider (VASP) in Lithuania, while it's also recognized as a virtual currency operator by Italy’s payments service regulator. hi's presence in Asia is in progress, with the platform undergoing pre-registration to secure a VASP license through the Hong Kong Securities and Futures Commission.</p><p>Earlier this month, Siu told Cointelegraph that Animoca was still awaiting a regulatory license in Hong Kong for its <a href=\"https://cointelegraph.com/news/animoca-creates-billion-dollar-metaverse-fund-for-developers\">proposed $1 billion Metaverse fund</a>. The company continues to invest heavily in blockchain gaming and Web3 projects. </p><p><em>Magazine: <a href=\"https://cointelegraph.com/magazine/web3-gamer-earn-bitcoin-minecraft-sega-blockchain-plans/\">Web3 Gamer: Earn Bitcoin in Minecraft, BGA’s 50/50 gender split, Oath of Peak hot take</a></em></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-28T08:12:24.000Z",
    "title": "Binance calls for dismissal of CFTC charges citing lack of jurisdiction",
    "url": "https://cryptoslate.com/binance-calls-for-dismissal-of-cftc-charges-citing-lack-of-jurisdiction/",
    "description": "<p>Binance has moved to dismiss the charges filed against it and CEO Changpeng &#8216;CZ&#8217; Zhao by the U.S. Commodity Futures Trading Commission (CFTC) because the financial regulator acted outside its powers. &#8220;The CFTC’s complaint should be dismissed because it has failed to plead that the Foreign Binance Entities and Mr. Zhao are subject to personal [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-calls-for-dismissal-of-cftc-charges-citing-lack-of-jurisdiction/\">Binance calls for dismissal of CFTC charges citing lack of jurisdiction</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-28T08:15:00.000Z",
    "title": "ARK Invest CEO Cathie Wood: Bitcoin’s Rally Amid Banking Woes Heralds Crypto’s Takeover of Finance",
    "url": "https://www.cryptoglobe.com/latest/2023/07/ark-invest-ceo-cathie-wood-bitcoins-rally-amid-banking-woes-heralds-cryptos-takeover-of-finance/",
    "description": "Catherine Wood, Founder, CIO, and CEO at ARK Investment Management, LLC (aka “ARK” or “ARK Invest”) recently pointed to Bitcoin’s robust performance during a crisis in the US banking sector as a strong sign that the premier cryptocurrency is leading a financial revolution. According to an article by The Daily Hodl, during an interview with Barron’s, Wood […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-28T08:15:00.000Z",
    "title": "Missing Crypto Influencer’s Dismembered Remains Found In Suitcase",
    "url": "https://cryptodaily.co.uk/2023/07/missing-crypto-influencers-dismembered-remains-found-in-suitcase",
    "description": "<p>Authorities in Argentina have launched a murder investigation after a group of children discovered the dismembered body parts of missing crypto influencer Fernando Perez Algaba.&nbsp;</p>\n<p>The influencer had been reported missing since the 18th of July.&nbsp;</p>\nMurder Investigation Launched&nbsp;\n<p>The remains of the influencer were discovered by children playing near a stream in the country of Argentina. According to the authorities, the children found a red suitcase while playing by a stream near the city of Ingeniero Budge in the Buenos Aires Province. The parents notified the relevant authorities, who, upon investigating the suitcase, discovered the missing influencer&rsquo;s legs and forearm inside. They also discovered another arm floating in the stream. Later, the police also found Algaba&rsquo;s head and torso.&nbsp;&nbsp;</p>\n<p>Authorities were able to establish the identity of Algaba thanks to his fingerprints and the numerous tattoos on his body. A subsequent autopsy suggested that the victim was shot at least three times before the body was cut into pieces. Furthermore, the body parts were cleanly cut, suggesting the murder was a professional hit job.&nbsp;</p>\nAn Extravagant Lifestyle&nbsp;\n<p>According to the authorities, Algaba had accumulated millions by renting luxury vehicles and selling cryptocurrency, making sure that he advertised his extravagant lifestyle to his over 900,000 followers on Instagram. Algaba was based in Barcelona but had been staying in Argentina since a week prior to his alleged murder. He had also rented an apartment for himself and was supposed to return the keys to the landlord on the 19th of July. However, the property owner stated that he failed to show up on the scheduled date or answer any phone calls.</p>\n<p>&nbsp;The murder marks a tragic end for the influencer, known as Lechuga (Lettuce), to his friends. According to friends, Algaba had started working from the age of 14, selling sandwiches on his bicycle and working his way to purchasing vehicles, repairing, and then reselling them. The influencer&rsquo;s hard work and dedication seemed to have paid off, as by the time he turned 24, he had a warehouse filled with high-end cars, motorcycles, and jet skis. He also founded a luxury car and jet ski rental firm in Miami before moving to Barcelona earlier in the year, and also opened a cryptocurrency trading office in Argentina, employing 25 people.</p>\nEverything Not As It Seems&nbsp;\n<p>However, the influencer&rsquo;s rise to riches was not all that it was made out to be. Authorities in Argentina have already made one arrest in connection with the murder. While the motive is yet to be established, police believe that Algaba was murdered thanks to his numerous debts. According to Argentina&rsquo;s tax agency, Algaba had racked up irrecoverable debts, and his company, Motors Lettuce SRL, was also in considerable debt and began bouncing cheques just a year after its 2018 opening. Algaba&rsquo;s phone also had notes that revealed he had lost significant money on his crypto investments.&nbsp;</p>\n<p>To make matters worse, the influencer had also reportedly upset the Barra Bravas, a violent Argentinean gang that is heavily involved in the country&rsquo;s burgeoning football scene. The gang had reportedly been demanding that Algaba pay them a $40,000 loan. He had already warned his friends in a message, stating that if anything happened to me, everyone is already warned.&nbsp;</p>\nNot Involved With Criminals&nbsp;\n<p>The deceased influencer&rsquo;s brother, Rodolfo Perez Algaba, denied that his sibling was involved with or had anything to do with criminal rings. He added that he was not a scammer as many claimed and was just a simple car salesman who did not do well with his Bitcoin investments. Rodolfo also stated that their father died when he was 17 and had left him an inheritance which Algaba used to start his business empire, suggesting that the influencer&rsquo;s rags-to-riches story was not as it seemed.&nbsp;</p>\n<p>The two brothers had not seen each other for months following an argument, with Rodolfo claiming that Algaba was under psychiatric treatment for an anxiety disorder. He also appealed to the authorities to apprehend the individuals involved in his brother&rsquo;s murder, stating in an interview with local media agencies,&nbsp;</p>\n\n<p>&ldquo;I&rsquo;ve been here for three days and hardly sleep, thinking, breaking my head, how could this happen. But I&rsquo;m not going to sit still. I&rsquo;m not going to do justice with my own hands, but I hope that justice will be done.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T08:24:24.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T08:30:59.000Z",
    "title": "As Dogecoin and Shiba Inu Flutter,  DigiToads Shows Unstoppable Signs Of Being A 100x Meme Coin",
    "url": "https://www.crypto-news-flash.com/as-dogecoin-and-shiba-inu-flutter-digitoads-shows-unstoppable-signs-of-being-a-100x-meme-coin/?utm_source=rss&utm_medium=rss&utm_campaign=as-dogecoin-and-shiba-inu-flutter-digitoads-shows-unstoppable-signs-of-being-a-100x-meme-coin",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T110514.458.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T110514.458.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T110514.458-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T110514.458-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In cryptocurrency, meme coins have gained immense popularity, often driven by hype and celebrity endorsement. Recently, two prominent meme coins, Dogecoin (DOGE) and Shiba Inu (SHIB), which once captured the imagination of investors, have experienced faltering in their value and popularity. Amidst this faltering, DigiToads (TOADS), an innovative project, has emerged, positioning itself as the [...]"
  }
]