[
  {
    "source": "Decrypt",
    "date": "2024-02-24T01:55:29.000Z",
    "title": "Binance Must Pay $4.3 Billion In Federal Case as CZ Awaits Sentencing",
    "url": "https://decrypt.co/218833/judge-approves-binances-plea-deal-with-4-3-billion-fine-as-cz-awaits-sentencing",
    "description": "Federal prosecutors called the criminal fine and financial penalty \"the largest enforcement action\" in the agency's history."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-24T02:00:22.000Z",
    "title": "Fidelity Director Analyzes Bitcoin Potential: Could It Hit $6 Trillion Market Cap?",
    "url": "https://www.newsbtc.com/bitcoin-news/fidelity-director-analyzes-bitcoin-potential-could-it-hit-6-trillion-market-cap/",
    "description": "In recent years, the debate surrounding Bitcoin&#8217;s (BTC) potential market share relative to gold has garnered significant attention, as recently approved Bitcoin Exchange-Traded Funds (ETFs) can bring Bitcoin significantly closer to gold in key metrics. Jurrien Timmer, Director of Global Macro at Fidelity Investments, has put forward an analysis that sheds light on this subject. By examining the value of &#8220;monetary gold&#8221; and Bitcoin&#8217;s market capitalization, as well as considering the impact of halvings on Bitcoin&#8217;s supply, Timmer presents insights into the future dynamics of these two assets.  Gold Vs Bitcoin Timmer&#8217;s analysis begins by estimating the share of gold held by central banks and private investors for monetary purposes, excluding jewelry and industrial usage. While this estimation is not exact, based on data from the World Gold Council, Timmer suggests that monetary gold accounts for approximately 40% of the total above-ground gold. Drawing upon his previous calculations, Timmer posits that Bitcoin has the potential to capture around a quarter of the monetary gold market, with monetary gold valued at around $6 trillion and Bitcoin&#8217;s market capitalization at $1 trillion. Related Reading: Avalanche C-Chain Experiences Block Production Halt, AVAX Price Responds Timmer further delves into the impact of Bitcoin halvings on its price. Historically, halvings have had a substantial effect on Bitcoin&#8217;s value. However, Timmer raises the hypothesis that diminishing returns may occur in the future as the incremental supply of new Bitcoin decreases. By comparing the outstanding supply and incremental supply of Bitcoin with those of gold, Timmer demonstrates that the diminishing impact of the halvings is likely to be more pronounced in the future.  As the number of coins available for mining dwindles, the influence of each subsequent halving event on Bitcoin&#8217;s price may diminish. This insight prompts Timmer to explore alternative ways to project Bitcoin&#8217;s price trajectory. BTC&#8217;s Price Projections To account for the diminishing impact of halvings, Timmer introduces the concept of a modified Stock To Flow (S2F) curve. This curve is derived by overlaying an asymptotic supply curve, representing the percentage of coins mined relative to the final supply cap, onto the original S2F curve. Timmer proposes using a regression formula incorporating PlanB&#8217;s original S2F curve and the asymptotic supply curve as independent variables. This modified S2F curve aligns more closely with the supply dynamics of gold, reflecting a scenario in which Bitcoin&#8217;s scarcity advantage continues, but its impact on price gradually diminishes over time. Using the modified S2F model and considering the supply characteristics of gold, Timmer generates hypothetical price projections for Bitcoin that place the cryptocurrency at approximately $100,000 by the end of 2024. Related Reading: Uniswap Foundation Unveils Major Upgrade Plan, UNI Price Skyrockets 52% According to Timmer, if Bitcoin were to capture a quarter of the monetary gold market, it would represent a remarkable shift in the global distribution of wealth, which would gradually drive up the cryptocurrency&#8217;s price over the coming years. Featured image from Shutterstock, chart from TradingView.com"
  }
]