[
  {
    "source": "CoinDesk",
    "date": "2023-10-30T13:05:48.000Z",
    "title": "Animoca Brands Courts $50M Investment From Saudi Arabia's NEOM",
    "url": "https://www.coindesk.com/business/2023/10/30/animoca-brands-courts-50m-investment-from-saudi-arabias-neom/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Animoca will build Web3 service capabilities with global commercial application alongside NEOM to support its aspirations as a futuristic tech hub."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-30T12:45:29.000Z",
    "title": "Bitcoin Shows No Signs of Overheating, Despite Doubling This Year",
    "url": "https://www.coindesk.com/markets/2023/10/30/bitcoin-shows-no-signs-of-overheating-despite-doubling-this-year/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin has doubled this year. The bullish trend may continue unabated as key indicator shows no signs of overheating, according to IntoTheBlock."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-30T13:01:38.000Z",
    "title": "Protocol Village: Bril Finance to Integrate Tool Into PancakeSwap",
    "url": "https://www.coindesk.com/tech/2023/10/26/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the week of Oct. 16-22, with live updates throughout."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-30T13:01:00.000Z",
    "title": "Terrorist fundraising: Is crypto really to blame?",
    "url": "http://cointelegraph.com/news/terrorist-fundraising-crypto-hamas-israel-us",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/637c0ba6-1ee6-4444-b258-94b3431a695e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> The industry is reeling as governments, legislators, and even investors ask if its networks are being exploited by terrorists. A sense of proportion may be needed.</p>\n                    <p><p>The ghastly events of this past month raise again some troubling questions: Does crypto have a terrorist fundraising problem? Are its networks <em>really</em> being exploited by terrorists to wreak global havoc? If so, what must it do better<em>?</em></p><p>On the other hand, maybe the problem is one of perception — more appearance than reality — because public blockchains, after all, are transparent and traceable. In that event, how does the industry turn around a less-than-sterling reputation?</p><p>Cryptocurrencies like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) have been associated with illicit activities almost from their inception. This image has been difficult to shake, even as analytical groups like Chainalysis <a href=\"https://www.chainalysis.com/blog/cryptocurrency-terrorism-financing-accuracy-check/\" target=\"_blank\" rel=\"noopener nofollow\">assert</a> that “terrorism financing is a very small portion of the already <a href=\"https://www.chainalysis.com/blog/2023-crypto-crime-report-introduction/\" target=\"_blank\" rel=\"noopener nofollow\">very small portion</a> of cryptocurrency transaction volume that is illicit.”</p><p>But in early October, the world awoke to Hamas’ incursion into southern Israel, and shortly after, Israeli police announced it had <a href=\"https://www.reuters.com/technology/israel-freezes-crypto-accounts-seeking-hamas-donations-police-say-2023-10-10/\" target=\"_blank\" rel=\"noopener nofollow\">frozen</a> cryptocurrency accounts used by Hamas as part of its ongoing efforts to locate the “financial infrastructure in cryptocurrencies used by terror entities to fund their activities.”</p><p>A week later, a group of 28 United States senators and 76 Congressional representatives — led by Senator Elizabeth Warren — <a href=\"https://www.warren.senate.gov/imo/media/doc/2023.10.17%20Letter%20to%20Treasury%20and%20White%20House%20re%20Hamas%20crypto%20security.pdf\" target=\"_blank\" rel=\"noopener nofollow\">sent a letter</a> to high-level Biden administration officials asking what steps are being taken “to address the use of cryptocurrency by terrorist organizations.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/80272657-b2ef-4002-bdda-f6126ccd263b.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>The Congressional letter to President Biden’s administration. Source: U.S. Senate</em></figcaption></figure><p>So once again, the industry finds itself on the defensive as governments, legislators and even asset managers are asking: Are crypto’s networks again being exploited by the worst of the worst?</p><h2>“Out of proportion to the facts”</h2><p>“If any terrorist organization is using crypto for fundraising, then I’d argue it’s a problem,”  Cody Carbone, vice president, policy at the Chamber of Digital Commerce, told Cointelegraph. But recent reports, including those <a href=\"https://www.wsj.com/world/middle-east/militants-behind-israel-attack-raised-millions-in-crypto-b9134b7a\" target=\"_blank\" rel=\"noopener nofollow\">appearing</a> in The Wall Street Journal and later cited in the Warren coalition’s letter, were inaccurate. Carbone said: </p><blockquote>“I believe the numbers being used by WSJ and Senator Warren’s coalition are skewed or downright incorrect. According to Chainalysis, of the roughly $82 million in cryptocurrency received by the WSJ posted address, about $450,000 worth of funds were transferred from the known terror-affiliated wallet.” </blockquote><p>Kristin Smith, CEO of the Blockchain Association, told Cointelegraph: “We view the hysteria around the links between crypto and Hamas as out of proportion to the facts.” Like Carbone, Smith said any funding of terrorist organizations “is too much,” but she also asked why the focus of some legislators and policymakers was so narrow. </p><blockquote>“Why not ask the [Biden] administration for details on ALL sources of Hamas funding? We want the entire picture, which would put the role of digital assets into proper perspective.”</blockquote><p>One often hears this argument from industry supporters. Crypto’s contribution to terrorist coffers — whether those groups are based in North Korea, Iran, Lebanon or Gaza — is trivial compared to the volumes raised via fiat currencies that use more traditional means of transfer. </p><p>“Terrorist organizations have historically used and will likely continue to use traditional, fiat-based methods such as financial institutions, <a href=\"https://www.investopedia.com/terms/h/hawala.asp#:~:text=Hawala%20(sometimes%20referred%20to%20as,developing%20countries%20sending%20remittances%20home.\" target=\"_blank\" rel=\"noopener nofollow\">hawalas</a>, and shell companies as their primary financing vehicles,” <a href=\"https://www.chainalysis.com/blog/cryptocurrency-terrorism-financing-accuracy-check/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Chainalysis in an Oct. 18 blog. </p><p>“The reality is that this [crypto] is just a tiny piece of the larger terror financing puzzle,” Ari Redbord, global head of policy and government affairs at TRM Labs, told Cointelegraph. What about nation-states like Iran? Or global mega-donors? Or Hamas raising millions through taxing Gaza residents? “Crypto plays a tiny part in all this.”</p><p>There’s an irony at play here, too. Raising illicit funds via public blockchains like Bitcoin or Ethereum is actually a boon for law enforcement agencies. Modern analytic techniques employed by specialty firms like Chainalysis, Elliptic and others often make it easier to identify and seize funds bound for designated terrorist groups.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-zero-knowledge-voting-finance/\">Beyond crypto: Zero-knowledge proofs show potential from voting to finance</a></em></strong></p><p>“What’s missing from the conversation is that our ability to track and trace on open blockchain has far better than anything we are able to do with fiat,” said Redbord. Tracing illicit funds through shell companies or stolen art is much more problematic. By comparison, “blockchain allows for tracking.” </p><p>“Previous efforts of law enforcement and private industry [...] have been successful in detecting Hamas’s terrorist financing activity on the blockchain — leveraging the transparency of crypto assets to freeze and confiscate related funds,” Elliptic’s David Carlisle <a href=\"https://www.elliptic.co/blog/how-hamas-has-utilized-crypto-and-what-may-be-coming\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in an October 11 blog. </p><p>In fact, Hamas said in April that it was giving up crypto-related fundraising and would no longer receive funds via Bitcoin, “citing an increase in ‘hostile’ activity against donors,” <a href=\"https://www.reuters.com/world/middle-east/hamas-armed-wing-announces-suspension-bitcoin-fundraising-2023-04-28/\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> Reuters.</p><h2>“The industry needs to be more vigilant”</h2><p>But even a relatively small amount of crypto usage by Hamas, Palestinian Islamic Jihad (PIJ), et al. appears to be enough to stir the waters. </p><p>“There is an opportunity to address this issue constructively,” Carbone told Cointelegraph, “but I fear that some anti-crypto policymakers in Washington are using the crisis to push their agenda and significantly restrict crypto use in the U.S. or eradicate it completely.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/48da8206-4b19-47ef-bbb0-b0fc374758ad.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Chainalysis’ analysis of a wallet suspected of terrorism financing found 20 suspected service providers. Source: Chainalysis</em></figcaption></figure><p>How does one set the record right then? More education and more data answered Carbone. “More education on how blockchain technology is a terrible tool for terrorists because of its public nature, but also identify the pain points.”</p><p>Some steps need to be taken. The industry still has to deal better with the dangerous use of mixers and tumblers that can hide wallet addresses from law enforcement agencies by developing better cybersecurity controls and operational risk procedures, said Carbone. “Everyone in the industry needs to be more vigilant. We also need more data to identify how serious the problem really is.” </p><p>There are signs that some of these things are already happening, added Redbord. Binance has recently been <a href=\"https://www.wsj.com/world/middle-east/militants-behind-israel-attack-raised-millions-in-crypto-b9134b7a\" target=\"_blank\" rel=\"noopener nofollow\">working</a> with Israeli authorities to freeze the crypto accounts of a number of terror-designated groups, including PIJ and Hamas, for instance. </p><p>It wouldn’t hurt to be more assertive in the court of public opinion, too. </p><p>“We believe crypto is here for good,” said Smith. “The technology is neutral, the protocols are open and can be used by anyone, just like the internet itself. As time goes on, given its ability to lower financial barriers, protect Constitutional rights to privacy, and finally provide an opportunity for users to claw back power from Big Tech and its monopoly over our digital lives, the value of crypto to humanity will become self-evident.”</p><h2>Is reform crypto legislation in the U.S. dead for now?</h2><p>But the conflagration in the Middle East may have already torpedoed prospects for comprehensive crypto reform legislation in the U.S. — at least for now.</p><p>Analyst Mark Palmer from Berenberg Capital Markets was one of the first to <a href=\"https://cointelegraph.com/news/coinbase-lobbying-setback-hamas-crypto-use-berenberg\">warn of the potential impact of political headwinds</a> from the Israel–Hamas conflict on the crypto reform efforts in the U.S. More recently, Palmer told Cointelegraph: </p><blockquote>“Coinbase is likely facing an uphill battle in its effort to lobby Congress in the hope that it would draft legislation that would bring regulatory clarity around the question of whether crypto tokens are securities or not, especially now that recent media reports have put a spotlight on how Hamas used crypto as a means of fundraising in recent years ahead of its attack on Israel.”</blockquote><p>Palmer wasn’t really surprised to find crypto opponents redoubling their efforts now to crack down on it in Washington, DC. What’s more alarming, though, is that “the reports appear to have encouraged more lawmakers to join in that effort.”</p><p>In other words, momentum could be building against the industry. “None of this is helpful to Coinbase’s cause as it seeks to better position itself in the U.S., and now the potential for new legislation that could undermine the company’s prospects appears to be growing,” Palmer said.</p><p>Is it too soon to say that reform legislation in the U.S. is dead on arrival? </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/germany-mercedes-lufthansa-nfts\">How major German firms like Mercedes and Lufthansa are using NFTs</a></em></strong></p><p>“Not dead,” said Carbone. “But we’re running out of time. Forget the chaos of the speakership; we’re nearing the end of the year, the government needs to be funded again next month, and there are other priorities. And then it’s an election year.” </p><p>Carbone says there’s still a chance for stablecoin legislation, but even that will likely need “to be traded for either a non-crypto bill — safer banking, credit card legislation — or paired with an illicit finance bill.[...] The issue is becoming more partisan.” </p><p>Ultimately, it is voters who will decide, Smith concluded. “Industry builders should continue to build applications that are of mainstream, tangible value to society. Policymakers ultimately serve their voters. The more voters want to use this technology, the better chance we have of protecting it.” </p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-30T13:00:39.000Z",
    "title": "President Biden’s Comprehensive Strategy for Safe and Trustworthy Artificial Intelligence",
    "url": "https://www.cryptoglobe.com/latest/2023/10/president-bidens-comprehensive-strategy-for-safe-and-trustworthy-artificial-intelligence/",
    "description": "On 30 October 2023, President Biden unveiled an Executive Order aimed at positioning the United States as a leader in the responsible development and application of artificial intelligence (AI). The directive sets forth a comprehensive approach that addresses AI safety and security, safeguards American privacy, promotes fairness and civil rights, advocates for consumers and workers, […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T13:01:48.000Z",
    "title": "UK Government Unveils Plans to Regulate Fiat-Backed Stablecoins",
    "url": "https://www.cryptopolitan.com/uk-plans-to-regulate-fiat-backed-stablecoins/",
    "description": "The United Kingdom government has released a comprehensive update on its intentions to regulate fiat-backed stablecoins within its borders. The document outlines a roadmap to facilitate and oversee the use of fiat-backed stablecoins in the UK&#8217;s payment infrastructure. Regulatory legislation scheduled for 2024 In a significant development, the document reveals that His Majesty&#8217;s Treasury intends ... <a title=\"UK Government Unveils Plans to Regulate Fiat-Backed Stablecoins\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-plans-to-regulate-fiat-backed-stablecoins/\" aria-label=\"More on UK Government Unveils Plans to Regulate Fiat-Backed Stablecoins\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T13:00:36.000Z",
    "title": "Spider-Man 2 Stealth Guide: Mastering the Art of Web-Zipping for Seamless Takedowns",
    "url": "https://www.cryptopolitan.com/spider-man-2-guide-the-art-of-web-zipping/",
    "description": "The highly anticipated release of Marvel&#8217;s Spider-Man 2 has brought an array of exhilarating features, including the game-changing web-zip function that allows players to seamlessly transition between surfaces for stealth takedowns and wall takedowns. Mastering this skill opens up a realm of possibilities for players to navigate the virtual world with unprecedented ease and efficiency. ... <a title=\"Spider-Man 2 Stealth Guide: Mastering the Art of Web-Zipping for Seamless Takedowns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/spider-man-2-guide-the-art-of-web-zipping/\" aria-label=\"More on Spider-Man 2 Stealth Guide: Mastering the Art of Web-Zipping for Seamless Takedowns\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T12:55:39.000Z",
    "title": "Monetary Authority of Singapore announces new international collaborations to propel digital asset pilots",
    "url": "https://www.cryptopolitan.com/monetary-authority-of-singapore-collaborations-digital-asset-pilots/",
    "description": "The Monetary Authority of Singapore (MAS) has formally declared its collaboration with international financial regulatory bodies. Specifically, MAS, which is the country’s central bank and financial regulator, has aligned with the Financial Services Agency of Japan (FSA), the Swiss Financial Market Supervisory Authority (FINMA), and the United Kingdom&#8217;s Financial Conduct Authority (FCA). The goal is ... <a title=\"Monetary Authority of Singapore announces new international collaborations to propel digital asset pilots\" class=\"read-more\" href=\"https://www.cryptopolitan.com/monetary-authority-of-singapore-collaborations-digital-asset-pilots/\" aria-label=\"More on Monetary Authority of Singapore announces new international collaborations to propel digital asset pilots\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T12:52:36.000Z",
    "title": "Blockchain Technology Gains Support for Ethical Sourcing in Botswana’s Diamond Industry",
    "url": "https://www.cryptopolitan.com/blockchain-technology-gains-support/",
    "description": "Botswana&#8217;s President, Mokgweetsi Masisi, has expressed strong support for the integration of blockchain technology in the diamond industry, emphasizing its potential to ensure ethical sourcing and empower consumers to make informed choices. Botswana backs blockchain for ethical diamonds Botswana, the world&#8217;s second-largest producer of diamonds, is making significant strides towards ensuring the ethical sourcing of ... <a title=\"Blockchain Technology Gains Support for Ethical Sourcing in Botswana&#8217;s Diamond Industry\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockchain-technology-gains-support/\" aria-label=\"More on Blockchain Technology Gains Support for Ethical Sourcing in Botswana&#8217;s Diamond Industry\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-30T13:04:15.000Z",
    "title": "Singapore to cooperate with other countries for digital asset promotion",
    "url": "https://crypto.news/singapore-to-cooperate-with-other-countries-for-digital-asset-promotion/",
    "description": "The Monetary Authority of Singapore (MAS) is set to push ahead with digital asset projects. MAS is working with Japan&#8217;s Financial Services Agency (FSA), the Swiss Financial Market Supervisory Authority (FINMA), and the UK Financial Conduct Authority (FCA) to promote&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-30T12:59:22.000Z",
    "title": "UK’s FCA to authorize overseas stablecoin providers",
    "url": "https://crypto.news/uks-fca-to-authorize-overseas-stablecoin-providers/",
    "description": "The UK government has rolled out proposals on how to regulate fiat-backed stablecoins. Crypto companies that want to offer services with overseas stablecoins like Tether (USDT) in the UK must get permission from the Financial Conduct Authority (FCA). According to&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-30T12:51:28.000Z",
    "title": "BitMEX announces changes to customer BTC addresses",
    "url": "https://crypto.news/bitmex-announces-changes-to-customer-btc-addresses/",
    "description": "BitMEX says the update will not bring a &#8216;big change&#8217; to its wallet security as the signature scheme is already used for hot withdrawal processing. Cryptocurrency exchange BitMEX is changing all of its customer Bitcoin (BTC) deposit addresses starting Nov.&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-30T13:00:50.000Z",
    "title": "19,197 BTC Makes Its Way Out Of Binance, Trigger For Bitcoin Recovery?",
    "url": "https://www.newsbtc.com/news/bitcoin/19197-btc-bitcoin-recovery/",
    "description": "A massive amount of 19,197 BTC worth $652 million recently made its way out of Binance all at once, triggering a curious reaction from Bitcoin investors. The timing of the transfer is interesting, as Bitcoin is currently trading in a range and is looking to break the $35,000 resistance level.  The big question is whether the whale behind the transfer plans to hold or sell, but recent price action points to the former. Massive Amount Of BTC Leaves Binance Recent data has shown Bitcoin trading volume on crypto exchanges recently hit its highest point since March, as trading activity increased in the overall crypto market. Whale activity, in particular, has grown exponentially.  Related Reading: Crypto Analyst Presents Uniswap’s UNI As The Next Coin Primed For Breakout Whale transaction tracker Whale Alerts has uncovered various large Bitcoin transactions coming into and going out of cryptocurrency exchanges. Most of these transactions have been BTC exodus into cold or unknown wallets. 🚨 🚨 🚨 1,517 #BTC (52,009,789 USD) transferred from #Bybit to unknown wallethttps://t.co/4klCQQj5O8 — Whale Alert (@whale_alert) October 30, 2023 🚨 🚨 1,105 #BTC (38,199,041 USD) transferred from #BinanceUS to unknown wallethttps://t.co/NKzMkqT3Ce — Whale Alert (@whale_alert) October 30, 2023 According to a post on social media platform X by @WhaleChart, there was a recent significant withdrawal of 19,197 BTC from Binance, the largest cryptocurrency exchange. This massive movement of digital currency has led analysts to speculate about the implications. JUST IN: 19,197 Bitcoin ($652M) has been withdrawn from Binance — Whale (@WhaleChart) October 29, 2023 Some believe transactions like these signal that whales see bullish things ahead for Bitcoin and want to hold their assets using their own private keys.  Now, while the whale tracker didn&#8217;t provide the transaction address for an in-depth analysis, the transfer was probably into a cold wallet. This is most likely the case as on-chain data points to an ongoing intense buying pressure from the bulls to drive up Bitcoin&#8217;s price. Trigger For Bitcoin Recovery? When large amounts of BTC are moved off exchanges, it shows that investors are holding their coins long-term. At the time of writing, Bitcoin is trading at $34,611, and its price action is forming a flag in a 4-hour chart timeframe.  Using the Fib indicator, a breakout above $35,000 puts the next target at $38,000. A more convincing breakout might bring the price of Bitcoin to $40,000. On the other hand, the creation of a lower low below $33,500 would render the flag invalid, and we&#8217;d most likely witness a retracement from that point to $31,000.  Related Reading: Bitcoin Bull Market: Crypto Spot Trading Volumes Climb To 8-Month Highs 4h $BTC trying for a high n&#8217; tight flag here, breakout target is yearly pivot at 38k inside the flag we&#8217;ve got evidence for A&#38;E and iH&#38;S aka market refuses to break down any new LL = flag is invalidated and we prob see retrace to 31k pic.twitter.com/QLUXBFSDFj — Josh Olszewicz (@CarpeNoctom) October 29, 2023 However, ongoing buying pressure points to a bullish breakout rather than a bearish breakout. According to Santiment data shared no X by crypto analyst Ali Martinez, Bitcoin whales have purchased over 30,000 bitcoins worth nearly $1 billion within the last five days. #Bitcoin whales have purchased over 30,000 $BTC within the last five days, worth nearly $1 billion! pic.twitter.com/oclJBY5j6a — Ali (@ali_charts) October 28, 2023 Also, historical data points to an average price jump of 43% in November for Bitcoin. A similar jump in the coming month would see Bitcoin increase to around $48,000. BTC price at $34,556 &#124; Source: BTCUSD on Tradingview.com Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-30T12:58:00.000Z",
    "title": "MATIC Could Soon Set a New ATH as Bullish Chart Pattern Emerges",
    "url": "https://coinedition.com/matic-could-soon-set-a-new-ath-as-bullish-chart-pattern-emerges/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/POLYGON-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"MATIC’s Total Value Locked (TVL) Is Higher Than SOL’and-AVAX’s\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/POLYGON-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/POLYGON-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/POLYGON-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/POLYGON-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/POLYGON-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/POLYGON-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The price of Polygon (MATIC) climbed more than 1.1% over the past 24 hours. Subsequently, the altcoin was changing hands at $0.6324 at press time. This positive movement over the past day of trading was also enough for MATIC to earn the top spot on CoinMarketCap’s trending list. Meanwhile, technical indicators suggest that MATIC may [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/matic-could-soon-set-a-new-ath-as-bullish-chart-pattern-emerges/\">MATIC Could Soon Set a New ATH as Bullish Chart Pattern Emerges</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]