[
  {
    "source": "Crypto Daily",
    "date": "2023-05-29T06:00:00.000Z",
    "title": "Binance to Launch New Crypto Trading Platform in Japan",
    "url": "https://cryptodaily.co.uk/2023/05/binance-to-launch-new-crypto-trading-platform-in-japan",
    "description": "<p>Binance announced it created a cryptocurrency trading platform for Japanese residents set to launch this summer. </p>\n<p>Cryptocurrency exchange Binance announced the launch of a crypto trading platform for Japanese residents. The world&rsquo;s largest crypto exchange said the platform would fully comply with Japanese crypto regulations.</p>\n<p>Binance said:</p>\n\n<p>We are pleased to announce that we have created a new platform for residents in Japan in order to fully comply with local regulations.</p>\n\n<p>Adding,</p>\n\n<p>The new platform will be available this summer. We will inform the launch date and provide further details in the coming months.</p>\n\nBinance Will Suspend Use of its Global Platform to Japanese Residents\n<p>As part of the transition to Binance Japan, the exchange announced it would discontinue its crypto services for Japanese residents through its global platform by November 30, 2023.</p>\n<p>The exchange further announced that users of its global platform would be able to move over to its new platform, which will be available after August 1, 2023:</p>\n\n<p>Users of the global platform will be able to migrate to the new local platform through a new identity verification process (KYC), which will be available after August 1, 2023.</p>\n\nJapan&rsquo;s Stance On Digital Assets and Blockchain Technology\n<p>The Japanese government published a white paper in September 2022, which has since been approved, discussing implementing blockchain technology and CBDCs into its existing governance and technological frameworks.</p>\n<p>The country has been embracing crypto rapidly, and as a result, several Japanese firms, including Toyota, Sony and NTT, have expressed a desire to embark on &ldquo;various decentralized offerings.&rdquo;</p>\n<p>Japan proved itself to be a significant player in the global crypto market and, as such, needs to address potential risks associated with the industry.</p>\n<p>Most recently, the government announced it would enforce strict new AML measures across the crypto industry, set to take force from June 1, 2023.</p>\n<p>Japan, as a member state of the G7, will further enforce the implementation of the &ldquo;Travel Rule&rsquo; established by the international financial watchdog, Financial Action Task Force (FATF). The &ldquo;Travel Rule,&rdquo; extensively discussed at the recent G7 summit hosted in Japan, requires financial institutions processing crypto transfers over $3,000 to disclose customer information with the recipient exchange or institution.</p>\n<p>Japan&rsquo;s new regulatory framework further requires crypto exchanges registered in the country to verify customer identity and maintain detailed transaction records in line with AML standards.</p>\n<p>The country&rsquo;s Financial Services Agency (FSA) will oversee compliance with the new framework.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-29T06:00:23.000Z",
    "title": "South African Rand Plunges to New Low After Benchmark Interest Rate Is Raised to 14-Year High",
    "url": "https://news.bitcoin.com/south-african-rand-plunges-to-new-low-after-benchmark-interest-rate-is-raised-to-14-year-high/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_420277831-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_420277831-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_420277831-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_420277831-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_420277831-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_420277831-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_420277831-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_420277831.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The South African fiat currency&#8217;s exchange rate versus the U.S. dollar plunged to a new all-time low of 19.7640 per dollar on May 25 just moments after the South African Reserve Bank raised the benchmark interest rate to its highest since 2009. Although the currency has since made some recovery, prediction models show that the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T05:58:42.000Z",
    "title": "Arthur Hayes Predicts Bitcoin’s Future, Expects Market Boom in 2024",
    "url": "https://www.cryptopolitan.com/arthur-hayes-predicts-bitcoins-boom-in-2024/",
    "description": "In a recent episode of the What Did Bitcoin podcast, Arthur Hayes, the CEO of BitMEX, shared his insights on the future of Bitcoin and the broader cryptocurrency market. While Hayes acknowledged that Bitcoin might not reach the highly anticipated $70,000 mark in 2023, he expressed optimism for a potential market boom in 2024. According ... <a title=\"Arthur Hayes Predicts Bitcoin&#8217;s Future, Expects Market Boom in 2024\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arthur-hayes-predicts-bitcoins-boom-in-2024/\" aria-label=\"More on Arthur Hayes Predicts Bitcoin&#8217;s Future, Expects Market Boom in 2024\">Read more</a>"
  }
]