[
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T01:56:59.000Z",
    "title": "Binance and CEO Changpeng Zhao seeks to dismiss CFTC complaint",
    "url": "https://cointelegraph.com/news/binance-ceo-plans-motion-dismiss-cftc-complaint-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/9a615500-49ec-438a-a2a0-61ed9f53a8cd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance, Changpeng Zhao and former compliance chief Samuel Lim intend to file two motions to dismiss a March lawsuit from the CFTC against them.</p>\n                    <p><p>Crypto exchange Binance and its CEO Changpeng \"CZ\" Zhao are planning to file a motion to dismiss a March-filed lawsuit from the United States commodities regulator.</p><p>In a July 24 <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.ilnd.431767/gov.uscourts.ilnd.431767.53.0_1.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> to an Illinois District Court, multiple Binance entities, Zhao and former chief compliance officer Samuel Lim said they plan to file two separate motions to dismiss the complaint before July 27. </p><p>\"The Foreign Binance Entities and Zhao intend to file a joint Motion to Dismiss the Complaint. Lim intends to file a separate Motion to Dismiss the Complaint, and join parts of the motion filed by the Foreign Binance Entities and Zhao,\" the filing read.</p><p>The filing also seeks permission to exceed a 15-page limit on the supporting brief used to support its motion, requesting for it to go up to 50 pages.</p><p>\"But given the complexity of the CFTC’s Complaint and the number of arguments Defendants anticipate making in support of their Motions to Dismiss, Defendants anticipate that their Memoranda of Law in support of the two motions will exceed the fifteen-page limits.\"</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/criminal-charges-celsius-mashinsky\">What criminal charges for Celsius ex-CEO mean for crypto industry</a></em></strong></p><p>The Commodity Futures Trading Commission (CFTC) <a href=\"https://cointelegraph.com/news/binance-and-cz-sued-by-cftc-over-us-regulatory-violations\">sued Binance and Zhao</a> in March alleging the crypto exchange did not properly register with the regulator.</p><p>The CFTC claimed despite Binance blocking U.S. residents from transacting on its platform, since at least 2019 it knowingly conducted transactions in multiple cryptocurrencies for people based in the U.S. and intentionally violated U.S. laws.</p><p>The regulator also called Binance's compliance process a \"sham\" and alleged it willingly conducted its activities outside of the U.S. and obscured the location of its headquarters with the aim of evading U.S. regulations.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/3-4-billion-bitcoin-popcorn-tin-silk-road-hacker/\">$3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T01:45:00.000Z",
    "title": "OpenAI shutters AI detector due to low accuracy",
    "url": "https://cointelegraph.com/news/open-ai-detector-quietly-shutters-citing-low-accuracy",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/1d04d285-a2a9-4983-b37f-d4fdd4e006f6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>OpenAI has quietly pulled the plug on its AI Classifier because of its low accuracy.</p>\n                    <p><p>Artificial intelligence powerhouse OpenAI has discreetly pulled the pin on its AI-detection software citing a low rate of accuracy.</p><p>The OpenAI-developed AI classifier was first launched on Jan. 31, and aimed to aid users, such as teachers and professors, in distinguishing human-written text from AI-generated text. </p><p>However, per the original <a href=\"https://openai.com/blog/new-ai-classifier-for-indicating-ai-written-text\" target=\"_blank\" rel=\"noopener nofollow\">blog post</a> which announced the launch of the tool, the AI classifier has been shut down as of July 20: </p><blockquote>“As of July 20, 2023, the AI classifier is no longer available due to its low rate of accuracy.”</blockquote><p>The link to the tool is no longer functional, while the note offered only simple reasoning as to why the tool was shut down. However, the company explained that it was looking at new, more effective ways of identifying AI-generated content. </p><p>\"We are working to incorporate feedback and are currently researching more effective provenance techniques for text, and have made a commitment to develop and deploy mechanisms that enable users to understand if audio or visual content is AI-generated,\" the note read. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/79933131-faba-4fc7-a6b8-6407b9bd83b3.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>OpenAI's former AI classifier in action. Source: OriginalityAI</em></figcaption></figure><p>From the get go, OpenAI made it clear the detection tool was prone to errors and could not be considered “fully reliable.” </p><p>The company said limitations of its AI detection tool included being “very inaccurate” at verifying text with less than 1,000 characters and could “confidently” label text written by humans as AI-generated. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/apple-has-gpt-ai-system-no-stated-plans-for-public-release-report\"><strong><em>Apple has its own GPT AI system but no stated plans for public release: Report</em></strong></a></p><p>The classifier is the latest of OpenAI’s products to come under scrutiny. </p><p>On July 18, researchers from Stanford and UC Berkeley <a href=\"https://cointelegraph.com/news/chatgpt-accurate-responses-worsened-over-time-claims-study\">published a study which revealed</a> that OpenAI’s flagship product ChatGPT was getting significantly worse with age. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We evaluated <a href=\"https://twitter.com/hashtag/ChatGPT?src=hash&amp;ref_src=twsrc%5Etfw\">#ChatGPT</a>&#39;s behavior over time and found substantial diffs in its responses to the *same questions* between the June version of GPT4 and GPT3.5 and the March versions. The newer versions got worse on some tasks. w/ Lingjiao Chen <a href=\"https://twitter.com/matei_zaharia?ref_src=twsrc%5Etfw\">@matei_zaharia</a> <a href=\"https://t.co/TGeN4T18Fd\">https://t.co/TGeN4T18Fd</a> <a href=\"https://t.co/36mjnejERy\">https://t.co/36mjnejERy</a> <a href=\"https://t.co/FEiqrUVbg6\">pic.twitter.com/FEiqrUVbg6</a></p>&mdash; James Zou (@james_y_zou) <a href=\"https://twitter.com/james_y_zou/status/1681519439613956099?ref_src=twsrc%5Etfw\">July 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Researchers found that over the course of the last few months, ChatGPT-4’s ability to accurately identify prime numbers had plummeted from 97.6% to just 2.4%. Additionally, both ChatGPT-3.5 and ChatGPT-4 witnessed a significant decline in being able to generate new lines of code.</p><p><strong><em>AI Eye: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-ai-content-cannibalization-problem-threads-a-loss-leader-for-ai-data/\"><strong><em>AI’s trained on AI content go MAD, is Threads a loss leader for AI data?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T02:00:20.000Z",
    "title": "Fidelity Backs Ethereum: Wall Street’s Biggest Players Bet On Crypto’s Number 2",
    "url": "https://www.newsbtc.com/analysis/eth/fidelity-backs-ethereum-wall-streets-biggest-players-bet-on-cryptos-number-2/",
    "description": "Fidelity, a leading financial services provider, has recently released a report on Ethereum (ETH) that sheds light on some key metrics to watch for the cryptocurrency in the coming months.  The report highlights several important indicators, including the 50-day and 200-day moving averages (MA), the realized price, the Net Unrealized Profit/Loss (NUPL) ratio, Market Value to Realized Value (MVRV) Z-Score, percent in profit, and the Pi Cycle indicators, all of which can provide valuable insights into market sentiment and potential price movements. Ethereum Holds Strong Above Key Support Levels Per the report, Ethereum has remained above key support levels, with the realized price serving as a strong support level since January 10th.  Additionally, the NUPL ratio suggests that Ethereum is currently in a neutral zone, while the MVRV Z-Score indicates that the cryptocurrency&#8217;s market value is estimated to be just over the &#8220;fair&#8221; zone, potentially setting the stage for a bull run or at least sideways price action, according to Fidelity.  Another interesting metric highlighted in the report is the percent of unique addresses in profit, which currently sits at nearly 66%. While this metric has not touched the green zone since January 2020, it suggests that Ethereum owners may be using the cryptocurrency for trading, DeFi, staking, or buying other digital assets. Related Reading: Bittrex To US Users: Withdraw Your Crypto Or Risk Running Into Issues Furthermore, the Pi Cycle indicators, which have historically been a good cycle top indicator, are showing that Ethereum is currently in a neutral zone. As the long-term moving average continues to follow the sunken price downward, it may be setting the stage for more volatility shortly. However, whether this volatility will be to the upside or downside remains to be seen and could depend on a variety of macro factors. ETH Adoption On The Rise On the other hand, Fidelity’s report highlights that while monthly active addresses and the monthly transaction count have fallen by 1%, the number of monthly new Ethereum addresses has slowly increased by 9% in Q2 2023. New addresses are defined as unique addresses that appeared for the first time in a transaction. This metric for momentum may not show direct network usage, but it does indicate a clearer picture of Ethereum adoption. The short-term moving average of new addresses is shown to be rising back above that of the longer-term moving average, indicating that the rate of new users joining the network is increasing. New and existing projects are likely incentivizing new users and helping to drive this increase. Another significant metric highlighted in the report is the net issuance of new supply issued by the network minus burned supply from transactions since The Merge.  Related Reading: Bitcoin Plunge To $29,200 Sends 5.9% Of Supply Into Loss This has driven a supply decrease for over five months now, with net issuance surpassing -700,000 Ether. The report notes that this is important because, in theory, as Ethereum&#8217;s supply is destroyed, it raises the relative ownership level of all remaining token holders. As of writing, ETH’s price is at $1,849, which has decreased by 2% within the last 24 hours. Similar to Bitcoin&#8217;s situation, Ethereum has also lost its 50-day MA, which is currently positioned at $1,869. If the market continues to decline, ETH can anticipate several key support levels that may help prevent a further bearish trend. The closest support level is situated at $1,840, followed by another support level of $1,792. However, the most crucial support floor is the 200-day MA, which is located at $1,780. This will be a significant factor in determining who will dominate in the upcoming months. Featured image from Unsplash, chart from TradingView.com"
  }
]