[
  {
    "source": "CoinDesk",
    "date": "2023-10-25T18:45:08.000Z",
    "title": "Mastercard Teams Up With MoonPay for Web3 Push",
    "url": "https://www.coindesk.com/business/2023/10/25/mastercard-teams-up-with-moonpay-for-web3-push/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "MoonPay will incorporate compliance-friendly Mastercard's Crypto Credential system and integrate payments tech like Mastercard Send and Click to Pay, according to a blog post."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-25T18:49:46.000Z",
    "title": "Stocks are Down, Bitcoin Is Way Up—Will This Time Be Different?",
    "url": "https://decrypt.co/203287/stocks-are-down-bitcoin-is-way-up-will-this-time-be-different",
    "description": "Bitcoin ETF hype can explain a lot about why BTC appears to have decoupled from stocks. But analysts say that's not the only reason."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-25T19:00:00.000Z",
    "title": "Court-ordered NFTs and the importance of Web3 randomness: Nifty Newsletter",
    "url": "http://cointelegraph.com/news/court-ordered-nfts-and-the-importance-of-web3-randomness-nifty-newsletter",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/26dcd87d-0097-497d-9959-fcbc7622c4c1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A Singapore court permitted the use of NFTs to attach legal court orders tokenized as an NFT to issue a freeze order.</p>\n                    <p><p>​​Welcome to the latest edition of Cointelegraph’s Nifty Newsletter. Keep reading to stay up-to-date with the latest stories on nonfungible tokens. Every Wednesday, the Nifty Newsletter informs and inspires you to dig deeper into the latest NFT trends and insights.</p><p>In this week’s newsletter, read about how a <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a> became a focus point in a Singapore court battle, learn about the importance of decentralized randomness in the Web3 gaming sector and find out why Universal Music Group is suing Anthropic over copyright infringement.</p><h2>Singapore court authorizes freeze order attached to wallets as soulbound NFT</h2><p>The Singapore High Court has allowed financial investigation firm Intelligent Sanctuary to attach NFTs containing a legal document to cold wallets associated with a hack, according to United Kingdom-based iSanctuary and local press accounts.</p><p>A court-issued worldwide freeze order was tokenized as soulbound NFTs and attached to the wallets in question. The NFTs will not prevent transactions with the wallets but will serve as a warning to counterparties and exchanges that the wallets were involved in a hack. In addition, iSanctuary claimed it had devised a means of tracking funds leaving the wallets, thanks to the NFTs. The NFTs will be permanently attached to the wallets.</p><p><a href=\"https://cointelegraph.com/news/singapore-court-authorizes-freeze-order-attached-wallets-soulbound-nft\"><strong>Continue reading</strong></a></p><h2>Web3 Games need decentralized randomness to be fair</h2><p>Random numbers are of great importance in a number of applications, including games, security systems, decentralized autonomous organization governance and NFT generation. If your game cannot access randomly generated numbers, your starts will become repetitive and stale. If your security system relies on easily guessed authentication codes, it isn’t providing much security. If any system that needs variety isn’t getting it, it won’t be very effective.</p><p>For many applications, this is effective. True randomness is not required in every application. In a video game with random encounters, for example, there may only be a limited number of actions the game can take at any given time. A pseudorandom number generator (PRNG) that provides values outside a given scope isn’t going to be of much use. When the stakes are low, technical requirements often match. However, the quality of a PRNG can vary dramatically. This can be an issue for applications with higher stakes, with many people depending on them or in various use cases.</p><p><a href=\"https://cointelegraph.com/news/games-need-decentralized-randomness\"><strong>Continue reading</strong></a></p><h2>Universal Music Group sues Anthropic over copyright infringement</h2><p>Universal Music Group, Concord Publishing and ABKCO Music &amp; Records have filed a lawsuit against the artificial intelligence startup Anthropic, accusing the latter of committing copyright infringement when training its artificial intelligence chatbot, Claude. </p><p>The lawsuit was filed on Oct. 18 and claims that Anthropic “unlawfully” copied and disseminated “vast amounts of copyrighted works - including the lyrics to myriad musical compositions” that are under the ownership or control of the publishers.</p><p><a href=\"https://cointelegraph.com/news/universal-music-group-sues-anthropic-ai-copyright-infringement\"><strong>Continue reading</strong></a></p><p><a href=\"https://cointelegraph.com/podcasts/nft-steez\"><strong>CHECK OUT COINTELEGRAPH’S </strong><strong><em>NFT STEEZ</em></strong><strong> PODCAST</strong></a></p><p><em>Thanks for reading this digest of the week’s most notable developments in the NFT space. Come again next Wednesday for more reports and insights into this actively evolving space.</em></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-25T18:59:47.000Z",
    "title": "Will Sam Bankman-Fried fix his case when he takes the stand?",
    "url": "http://cointelegraph.com/news/sam-bankman-fried-takes-stand",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/f294b996-9065-41a2-9d5a-7fe6ab5fde6f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The former FTX CEO will take the stand in his own defense. Will it be enough to counter the narrative introduced by former employees and expert witnesses?</p>\n                    <p><p>Sam Bankman-Fried (SBF) had a lot going against him well before the start of his criminal trial: the ire of many in the crypto space, suspicion from United States policymakers, and negative attention from some in the media looking for clickbait angles to associate with the former FTX CEO. </p><p>None of that may have had any impact on the case his attorneys planned to present at trial, which so far doesn’t seem to have given jurors much of anything to counter the bulk of the narrative put forth by prosecutors. With few exceptions, the testimonies from witnesses for the Justice Department have been straightforward even for those unfamiliar with the intricacies of crypto trading and investments. </p><p>Former Alameda Research CEO Caroline Ellison provided statements admitting to <a href=\"https://cointelegraph.com/news/caroline-ellison-alternative-balance-sheets-alameda-exposure-ftx\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/caroline-ellison-alternative-balance-sheets-alameda-exposure-ftx/amp\">providing fudged numbers</a> while former FTX Chief Technology Officer Gary Wang claimed SBF <a href=\"https://cointelegraph.com/news/alameda-research-withdraw-unlimited-funds-gary-wang\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/alameda-research-withdraw-unlimited-funds-gary-wang/amp\">directed efforts to allow Alameda</a> to “withdraw unlimited funds.” Former FTX engineering director Nishad Singh also testified regarding the “excessive” purchases Alameda <a href=\"https://cointelegraph.com/news/nishad-singh-testifies-excessive-alameda-investments\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/nishad-singh-testifies-excessive-alameda-investments/amp\">made in endorsements</a> from celebrities.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/michael-lewis-going-infinite-positive-spin-sam-bankman-fried\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/michael-lewis-going-infinite-positive-spin-sam-bankman-fried/amp\"><strong><em>Michael Lewis' new book puts a positive spin on Sam Bankman-Fried</em></strong></a></p><p>\"[Sam] said he was willing to take large coin flips,\" Ellison told jurors on Oct. 10, regarding investment risks. \"He talked about being willing to flip a coin and destroy the world, as long as a win would make it twice as good.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Subscribe to our ‘1 Minute Letter’ NOW for daily deep-dives straight to your inbox! ⚖️ Be the first to know every twist and turn in the Sam Bankman-Fried case! Subscribe now: <a href=\"https://t.co/jQOIYUv6IW\">https://t.co/jQOIYUv6IW</a>  <a href=\"https://twitter.com/hashtag/SBF?src=hash&ref_src=twsrc%5Etfw\">#SBF</a> <a href=\"https://t.co/gp7zJu5sgy\">pic.twitter.com/gp7zJu5sgy</a></p>— Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1709911708049772942?ref_src=twsrc%5Etfw\">October 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Through the court proceedings, defense lawyers Mark Cohen and Christian Everdell frequently called for objections and sidebars — a time when counsel can address the judge without the jury hearing — but rarely seemed to pose questions to witnesses that would significantly help SBF’s case or sway the jury. Jurors have already heard testimony painting SBF as the instigator behind efforts for Alameda to use FTX customer funds without users’ knowledge. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-moves-final-stages\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sam-bankman-fried-ftx-trial-moves-final-stages/amp\"><strong><em>Sam Bankman-Fried trial moves to final stages</em></strong></a></p><p>One of the few holes defense lawyers were able to poke in Singh’s testimony was him <a href=\"https://cointelegraph.com/news/nishad-singh-remembering-ftx-sbf-trial\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/nishad-singh-remembering-ftx-sbf-trial/amp\">admitting to being a little fuzzy</a> on details in 2022 ahead of FTX’s bankruptcy and taking his own loan to purchase a vacation home. After laying out their case in opening arguments on Oct. 4, Cohen and Everdell suggested they would present evidence pointing the finger at Ellison for much of the criminal acts. However, as Ellison, Wang, and Singh all accepted plea deals and told parallel versions of the same story, SBF lawyers’ cross-examination came across as milquetoast.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">SAM BANKMAN-FRIED MIGHT RISK TESTIFYING IN CRIMINAL TRIAL <br><br>Risk? Dude went on the shoeshine boy's podcast last year to explain that he was very \"sorry\"</p>— zerohedge (@zerohedge) <a href=\"https://twitter.com/zerohedge/status/1717166701861601361?ref_src=twsrc%5Etfw\">October 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Soon SBF’s legal team will be the one calling witnesses, which we learned on Oct. 25 will include the former FTX CEO himself. The only reason to call Bankman-Fried to the stand in his defense would be to bolster his case, and that means having jurors believe SBF, a socially awkward “math nerd” according to his own lawyers, over his colleagues. While potentially testifying that he “did what [he] thought was right” <a href=\"https://cointelegraph.com/news/sam-bankman-fried-leaked-docs-revealed\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sam-bankman-fried-leaked-docs-revealed/amp\">might be personally satisfying</a> to SBF, it doesn’t seem to help defend his actions, let alone inure jurors to his plight. </p><p>There's been an astonishing contrast between the pre-arrest and mid-trial personas of Bankman-Fried. The former CEO used to have regular interviews with major media outlets, wasn't shy about tweeting his thoughts on the crypto market, and was considered by many to one of the most popular figures in the space. </p><p>Now, following his path to jail, SBF has gone from freedom in The Bahamas to home confinement with limited internet, to the point where few people have actually heard his voice or seen a photo of him in months — cameras generally aren't allowed in the courtroom, and getting a snapshot of him from jail is unlikely. The former CEO has trimmed his hair and regularly wears a suit and tie to court, something many would have found unthinkable a year ago. </p><p>SBF’s attorneys and New York prosecutors are on hiatus until Oct. 26, when court proceedings will resume. The defense team has <a href=\"https://cointelegraph.com/news/sam-bankman-fried-testify-criminal-trial\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sam-bankman-fried-testify-criminal-trial/amp\">suggested it could call</a> up to three witnesses — four, including Bankman-Fried — compared to the roughly 20 people called by prosecutors. This strategy, according to Cohen, will only take a few days to present to the jury, after which time closing arguments will begin.</p><p>Defense attorneys have their work cut out for them. </p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Turner Wright </strong>is a policy reporter at Cointelegraph.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph. </em></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-25T18:42:16.000Z",
    "title": "Can Ethereum (ETH), Ripple (XRP) and Cardano (ADA) Reach New Yearly Highs After Exploding In The Last 5 days? Experts Are Optimistic",
    "url": "https://cryptodaily.co.uk/2023/10/can-ethereum-eth-ripple-xrp-and-cardano-ada-reach-new-yearly-highs-after-exploding-in-the-last-5-days-experts-are-optimistic",
    "description": "Dive into the cryptocurrency market's recent turbulence as Bitcoin's surge leads to fluctuations in US crypto stocks. While Bitcoin dips from its $35,000 peak to $33,800, mining companies remain resilient. Ethereum (ETH), Ripple (XRP), and Cardano (ADA) add complexity to market dynamics, where bullish tendencies coexist with potential volatility. Amidst this, ScapesMania (MANIA) emerges as a captivating player. Discover why ScapesMania has outpaced ETH, XRP, and ADA in 2023 and explore the current indicators"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-25T18:50:42.000Z",
    "title": "Meta Platforms Set to Report Third Quarter Earnings Amidst Industry Challenges",
    "url": "https://www.cryptopolitan.com/meta-platforms-set-to-report-third-quarter/",
    "description": "Meta Platforms, the parent company of Facebook and Instagram, is gearing up to announce its third-quarter earnings, with market expectations leaning towards a positive growth trajectory despite challenges within the digital advertising space. As the tech giant prepares to reveal its financial performance, analysts are closely watching for signals of potential surprises in either a ... <a title=\"Meta Platforms Set to Report Third Quarter Earnings Amidst Industry Challenges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/meta-platforms-set-to-report-third-quarter/\" aria-label=\"More on Meta Platforms Set to Report Third Quarter Earnings Amidst Industry Challenges\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-25T18:45:52.000Z",
    "title": "Fantom set to revolutionize blockchain with its Sonic upgrade",
    "url": "https://www.cryptopolitan.com/fantom-blockchain-sonic-upgrade/",
    "description": "Blockchain technology is transforming, and co-founder of Fantom, Andre Cronje, is leading the charge to bring it into the modern era. In his view, blockchain has been stuck in a time warp, akin to the technology landscape of the 1980s. He emphasizes that during that period, the internet and technology were predominantly used for financial ... <a title=\"Fantom set to revolutionize blockchain with its Sonic upgrade\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-blockchain-sonic-upgrade/\" aria-label=\"More on Fantom set to revolutionize blockchain with its Sonic upgrade\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-25T18:48:24.000Z",
    "title": "ECB details how the digital euro will future-proof the European market",
    "url": "https://crypto.news/ecb-details-how-the-digital-euro-will-future-proof-the-european-market/",
    "description": "The European Central Bank emphasizes that the digital euro will modernize and future-proof the pan-European financial ecosystem. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-25T19:00:20.000Z",
    "title": "Massive Ethereum Whale Transfer Threatens To End ETH Rally, Here’s Why",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-whale-to-end-eth-rally/",
    "description": "In a recent development, Ethereum’s latest resurgence (up over 12% in the last seven days) could be threatened by the actions of an Ethereum whale who could potentially end the token’s rally and further cause it to decline.  Ethereum Whale Moves 30,710 ETH In a post shared on the X (formerly Twitter) platform, a crypto-related account with the username ‘EmberCN’ noted that a particular Ethereum whale who had withdrawn a total of 42,311 ETH from the crypto exchange Binance since September 20 had just transferred 30,710 ETH (out of the withdrawn funds) back to Binance.  Related Reading: Pro-XRP Legal Expert Shares Expectations If SEC Wins Appeal Against Ripple The account further mentioned that the average ETH price at which this whale had accumulated these tokens is about $1,667, which instantly shows that the whale is currently in profit and could be looking to realize some of their gains by selling the transferred tokens on Binance.  However, the crypto community will be more concerned with how a potential sell-off could negatively impact the market. It would add to the selling pressure on the asset, which could cause a decline, especially if there is no buying pressure to match it.  Some might be more inclined to believe that this amount of ETH may not matter in the grand scheme of things, considering that it was recently reported that Ethereum’s ‘Billionaires’ control one-third of the token’s circulating supply. This category of persons is those who hold 1 million ETH and above.  It is also worth mentioning that on-chain data shows that the Ethereum whale has, since the transfer of the 30,710 ETH, gone on to transfer the tokens to another Binance wallet, which has spread the ETH across different wallets.  Another Busy ETH Whale In a post shared on its X platform, the analytics platform Scopescan revealed that the 1inch investment fund had sold 4,685 stETH (staked Ethereum on the Lido platform) for $8.54 million at an average price of $1,823. In the process, they realized an estimated profit of $1.28 million as these stETH were said to be bought on October 13 at the average price of $1,550. Related Reading: Bitcoin Spot ETF Approval: Why Price Could Be Set For 300% Surge The move may not come as a surprise to some as the investment fund, which has close ties to the DEX aggregator 1Inch, has been actively trading Ethereum since the beginning of the year. During that period, it bought a cumulative total of 17,000 ETH and then went on to take some profits by liquidating 11,000 ETH at $1,906 for $21 million, making a profit of about $3.7 million in the process. These whale movements may have had an impact on Ethereum’s price as the token is, at the time of writing, trading at around $1,770, down over 2% in the last 24 hours, according to data from CoinMarketCap.  ETH price picks up steam &#124; Source: ETHUSD on Tradingview.com Featured image from Nairametrics, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-25T19:08:00.000Z",
    "title": "Is Shiba Inu (SHIB) Ready for Another Double-Digit Hike?",
    "url": "https://coinedition.com/is-shiba-inu-shib-ready-for-another-double-digit-hike/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Shibburns-New-Radio-App-to-Supplement-Shiba-Inu-Burn.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Shibburns-New-Radio-App-to-Supplement-Shiba-Inu-Burn.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Shibburns-New-Radio-App-to-Supplement-Shiba-Inu-Burn-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Shibburns-New-Radio-App-to-Supplement-Shiba-Inu-Burn-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Shibburns-New-Radio-App-to-Supplement-Shiba-Inu-Burn-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Shibburns-New-Radio-App-to-Supplement-Shiba-Inu-Burn-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Unlike, many other cryptocurrencies in the market, Shiba Inu’s (SHIB) performance in the last 30 days, has been underwhelming. Compared to meme coins like Floki (FLOKI) and Dogecoin (DOGE), SHIB has had the most unimpressive show. At the time of writing, SHIB’s value was $0.0000073— a similar value it was 30 days back. However, according [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/is-shiba-inu-shib-ready-for-another-double-digit-hike/\">Is Shiba Inu (SHIB) Ready for Another Double-Digit Hike?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-25T18:45:51.000Z",
    "title": "This Is Where the United States Ranks in Terms of Global Crypto Adoption, According to Chainalysis",
    "url": "https://dailyhodl.com/2023/10/25/this-is-where-the-united-states-ranks-in-terms-of-global-crypto-adoption-according-to-chainalysis/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/this-is-where-states.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/this-is-where-states.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/this-is-where-states.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/this-is-where-states.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/this-is-where-states.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/this-is-where-states.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/this-is-where-states.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Blockchain analysis firm Chainalysis is unveiling the 2023 Global Crypto Adoption Index in a new report. According to Chainlysis, the United States ranks fourth globally with regard to crypto adoption, behind India, Nigeria and Vietnam. The United States and Canada are the only countries from North America in the top 20. Canada is ranked 19th [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/25/this-is-where-the-united-states-ranks-in-terms-of-global-crypto-adoption-according-to-chainalysis/\">This Is Where the United States Ranks in Terms of Global Crypto Adoption, According to Chainalysis</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-25T18:41:09.000Z",
    "title": "Former FTX CEO Sam Bankman-Fried Decides To Testify in Court After Damning Testimonies From Colleagues: Report",
    "url": "https://dailyhodl.com/2023/10/25/former-ftx-ceo-sam-bankman-fried-decides-to-testify-in-court-after-damning-testimonies-from-colleagues-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/ftx-alameda-aware-funds.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/ftx-alameda-aware-funds.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-alameda-aware-funds.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-alameda-aware-funds.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-alameda-aware-funds.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-alameda-aware-funds.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-alameda-aware-funds.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Former FTX chief executive Sam Bankman-Fried has reportedly decided to testify in court after his colleagues took the witness stand to provide evidence. In a lengthy thread on the social media platform X, Inner City Press reports that Bankman-Fried’s lawyer has stated that his client will testify after the defense’s three witnesses in order to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/25/former-ftx-ceo-sam-bankman-fried-decides-to-testify-in-court-after-damning-testimonies-from-colleagues-report/\">Former FTX CEO Sam Bankman-Fried Decides To Testify in Court After Damning Testimonies From Colleagues: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]