[
  {
    "source": "Cryptopolitan",
    "date": "2023-11-26T14:41:41.000Z",
    "title": "Bhutan’s Hidden Bitcoin Mining: A Report Uncovers Secret Sites",
    "url": "https://www.cryptopolitan.com/bhutans-bitcoin-mining-hidden-facilities/",
    "description": "In a groundbreaking revelation, the Kingdom of Bhutan, known for its seclusion and pristine environment, has been discovered to be operating a series of undercover Bitcoin mining facilities. The surprising development in the cryptocurrency world was brought to light by a detailed investigation conducted by Forbes. Forbes&#8217; investigation, which employed advanced techniques, including the analysis ... <a title=\"Bhutan&#8217;s Hidden Bitcoin Mining: A Report Uncovers Secret Sites\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bhutans-bitcoin-mining-hidden-facilities/\" aria-label=\"More on Bhutan&#8217;s Hidden Bitcoin Mining: A Report Uncovers Secret Sites\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-26T14:40:00.000Z",
    "title": "Ethereum Dominance Indicator: Key Barometer of Trends in the Crypto Sector",
    "url": "https://www.cryptopolitan.com/ethereum-dominance-key-barometer-of-trends/",
    "description": "From its early days, Ethereum has distinguished itself as a hub of groundbreaking developments in blockchain technology. As the originator of smart contracts, Ethereum has redefined the scope of blockchain applications, paving the way for a diverse range of DApps, innovative DeFi platforms, and the rapidly expanding universe of NFTs. These strides have solidified Ethereum ... <a title=\"Ethereum Dominance Indicator: Key Barometer of Trends in the Crypto Sector\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-dominance-key-barometer-of-trends/\" aria-label=\"More on Ethereum Dominance Indicator: Key Barometer of Trends in the Crypto Sector\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-26T15:00:13.000Z",
    "title": "Whales Move $30 Million Worth Of XRP To Exchanges – Time To Sell?",
    "url": "https://www.newsbtc.com/analysis/xrp/whales-move-30-million-worth-of-xrp-to-exchanges-time-to-sell/",
    "description": "XRP could witness a massive selloff in the coming days, as shown by on-chain transfer data. According to transaction alerts from crypto whale tracker Whale Alerts, two whale-sized transactions involving XRP have recently made their way onto cryptocurrency exchanges Bitso and Bitstamp, prompting investors to ponder the reasons behind the transactions and speculate on possible outcomes. Massive transfers by whales can often increase selling pressure if they sell and take profits, which could cascade into the price of the asset, even if only temporary. Whale Transfers 50 Million XRP To Exchanges XRP has gone through consolidation for the past two weeks in the midst of a market lull. According to Coinmarketcap, the altcoin&#8217;s trading volume is also down by 43.59% in the past 24 hours. Before this period however, a whale made a transfer of 50 million XRP worth approximately $31 million to exchanges, prompting investors to wonder if this is a part of the ongoing consolidation and if the transfers are a selloff. Related Reading: Bitcoin Price Rockets Past $38,000, Hits Highest Peak Since May 2022 – Details According to Whale Alerts, a transfer of 25.2 million XRP tokens worth $15.66 million was made to crypto exchange Bitstamp on November 23. Shortly after, 25 million XRP tokens worth $15.55 million were sent to crypto exchange Bitso. Looking into the details of the two transactions on blockchain explorers reveal they were made from the same address &#8220;r4wf7e&#8221;.  Total crypto market cap is currently at $1.4 trillion. Chart: TradingView.com A deeper look reveals address &#8220;r4wf7e&#8221; received 55.87 million tokens from address &#8220;rJgpQR&#8221; and then went on a spending spree in the hours after. The next few hours would be full of transactions ranging from 20,000 to 25 million XRP tokens to Bitstamp, Bitso, Independent Reserve, and some private addresses.  Speculation On Why The Whale Is Moving XRP Now The transfers into various exchanges have signaled that the whale intends to sell its holdings. However, there could be other reasons for the transfers, which could just be the whale wants to have their XRP readily available on the exchanges without even selling yet. Of course, this is all speculation. There’s no way to know the whale’s exact intentions or how much token they plan to buy or sell, if any. But when amounts this large move onto exchanges, it often signals volatility ahead.  On the other hand, data from on-chain analytics platform has shown whales purchased 11 million tokens worth $6.82 million in the just concluded week. The buying spree suggests there could still be a bullish sentiment among some whales. #Ripple &#124; On-chain data shows that #XRP whales have purchased around 11 million $XRP over the past week, worth roughly $6.82 million! pic.twitter.com/VnWpaMoOYR — Ali (@ali_charts) November 25, 2023 Related Reading: Is Apecoin On Your Radar? APE Soars By 30% In 48 Hours, Signaling A Potential Bull Run XRP is trading at $0.62 at the time of writing. The cryptocurrency crossed over $0.7 again earlier this month but has struggled to continue this momentum. However, according to crypto analyst CryptoInsightUK, the token has a good chance of replicating the 61,000% gain it enjoyed back in 2017 before the SEC lawsuit. Another analyst, Edward Farina, predicted Ripple has the potential to replace the current SWIFT system, at which point XRP could surge to $10,000. Featured image from Pixabay"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-26T15:08:34.000Z",
    "title": "Meme Moguls (MGLS) Surpasses Ethereum (ETH) and Ripple (XRP) in Impressive Market Performance",
    "url": "https://www.crypto-news-flash.com/meme-moguls-mgls-surpasses-ethereum-eth-and-ripple-xrp-in-impressive-market-performance/?utm_source=rss&utm_medium=rss&utm_campaign=meme-moguls-mgls-surpasses-ethereum-eth-and-ripple-xrp-in-impressive-market-performance",
    "description": "<img width=\"512\" height=\"268\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-65.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-65.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-65-300x157.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-65-351x185.png 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />A new player has entered the crypto scene with enticing features and good potential. That player is Meme Moguls (MGLS). The token which is just in the presale stage has surpassed the performance of great giants like Ethereum and Ripple. Ethereum (ETH) Shows Sell Signal, Says Ali Martinez Ethereum (ETH) started this week on a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-26T14:40:59.000Z",
    "title": "Is it Wise to Invest in PancakeSwap and Rebel Satoshi?",
    "url": "https://www.crypto-news-flash.com/is-it-wise-to-invest-in-pancakeswap-and-rebel-satoshi/?utm_source=rss&utm_medium=rss&utm_campaign=is-it-wise-to-invest-in-pancakeswap-and-rebel-satoshi",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-84.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-84.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-84-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-84-343x215.jpg 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-84-326x205.jpg 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-84-163x102.jpg 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Recent growth in the PancakeSwap (CAKE) ecosystem may see CAKE surge to $2.82 by the end of 2023. Rebel Satoshi ($RBLZ) is dominating experts’ list of top altcoins to watch.  The $RBLZ presale offers investors a chance to earn 150% ROI on their investments.  Looking for the best crypto to buy in the world of [...]"
  }
]