[
  {
    "source": "Decrypt",
    "date": "2023-06-12T04:01:02.000Z",
    "title": "Thirdweb Plots Web3 Gaming Push With Ex-Facebook Exec Hire",
    "url": "https://decrypt.co/144131/thirdweb-plots-web3-gaming-tools-push-ex-facebook-exec-hire",
    "description": "The infrastructure firm has added Atif Khan to lead its gaming charge, and recently created the game Web3 Warriors on Base."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-12T03:52:51.000Z",
    "title": "a16z opening London crypto office citing 'predictable' environment",
    "url": "https://cointelegraph.com/news/a16z-open-london-office-international-expansion",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/51339b90-63d8-4861-a7a3-541af92e8e1e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The expansion came following a “productive dialogue” with the U.K. Prime Minister and “months of constructive conversations” with UK policymakers, a16z’s general partner said.</p>\n                    <p><p>Venture capital firm Andreessen Horowitz (a16z) is set to open its first office outside of the United States this year, adding to the backdrop of U.S.-based firms seeking greener pastures outside of the country. </p><p>Chris Dixon, a16z’s crypto founder and managing partner <a href=\"https://www.businesswire.com/news/home/20230611005029/en/Andreessen-Horowitz-%E2%80%9Ca16z%E2%80%9D-Announces-its-First-International-Expansion-to-the-United-Kingdom\" target=\"_blank\" rel=\"noopener nofollow\">cited</a> a “predictable business environment” as one of the main factors behind its decision to expand, and comes amid a slew of regulatory actions against crypto firms in the United States in recent months. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Big news to share: <a href=\"https://twitter.com/a16z?ref_src=twsrc%5Etfw\">@a16z</a> is expanding to the UK <br><br>We plan to open our first international office in London later this year, and will host the next Crypto Startup School there in 2024.<br><br>Why the UK? <a href=\"https://t.co/PQ7GuNEn77\">https://t.co/PQ7GuNEn77</a></p>&mdash; cdixon.eth (@cdixon) <a href=\"https://twitter.com/cdixon/status/1668031647671885827?ref_src=twsrc%5Etfw\">June 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Dixon said the decision was finalized after a “productive dialogue” with the U.K. Prime Minister in addition to “months of constructive conversations” with HM Treasury, UK policymakers, and the Financial Conduct Authority.” He added:</p><blockquote>“We’re thrilled to open our first international office in a jurisdiction that welcomes blockchain technology and is committed to creating a predictable business environment by pursuing regulations that both embrace web3 and protect consumers.”</blockquote><p>However, Dixon said the firm remains “heavily invested” in the U.S., and will continue to work with policymakers and regulators to push for more regulatory clarity for crypto start ups. </p><p>Rishi Sunak — the U.K.’s new pro-crypto Prime Minister — attributed the news of a16z’s expansion to having the “right regulation and guardrails” set in place to “foster innovation” while still protecting consumers.</p><p>Sunak said he was “thrilled” with a16z’s decision:</p><blockquote>“That’s why I am thrilled world-leading investor, Andreessen Horowitz, has decided to open their first international office in the UK – which is testament to our world-class universities and talent and our strong competitive business environment.” </blockquote><p>In addition to the new office, a16z has also announced its plan to launch a new “Crypto Startup School” (CSS) program in London in the Spring (March to June) of 2024.</p><p>The CSS accelerator program will aim to attract <a href=\"https://cointelegraph.com/news/andreessen-horowitz-closes-4-5-billion-crypto-fund-amid-market-turmoil\">U.K. and international entrepreneurs</a> keen on forging a career in Web3.</p><p>The most recent CSS program received more than 8,000 applicants, with 26 companies receiving an investment from a16z. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Our next Crypto Startup School will be Spring 2024 in London, &amp; we hope to attract great teams from the region to build web3 projects. Our recent CSS in LA included teams from the UK, US, India, Germany, France, Argentina, Ecuador, &amp; Canada.<a href=\"https://t.co/vxBIPFuSPj\">https://t.co/vxBIPFuSPj</a></p>&mdash; cdixon.eth (@cdixon) <a href=\"https://twitter.com/cdixon/status/1668031656094052354?ref_src=twsrc%5Etfw\">June 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The U.K. office will also “work closely with universities” in the U.K. to “provide talent and support” for blockchain-based clubs and to encourage blockchain technology to be taught more in the classroom. </p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/a16z-releases-anonymous-voting-system-for-ethereum\"><strong>a16z releases anonymous voting system for Ethereum </strong></a></p><p>General Partner Sriram Krishnan will be in charge of the new office in London.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Really excited for <a href=\"https://twitter.com/a16z?ref_src=twsrc%5Etfw\">@a16z</a>’s expanding to the UK with our first international office in London. <br><br>And personally excited to be moving there later this year. <a href=\"https://t.co/fJZSfEmHnO\">https://t.co/fJZSfEmHnO</a></p>&mdash; Sriram Krishnan - sriramk.eth (@sriramk) <a href=\"https://twitter.com/sriramk/status/1668033353180762113?ref_src=twsrc%5Etfw\">June 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Andreessen Horowitz is the <a href=\"https://cointelegraph.com/news/andreessen-horowitz-loses-billions-of-dollars-but-remains-faithful-to-crypto\">largest venture capital firm</a> in the world with over $35.8 billion in assets under management (AUM), <a href=\"https://www.swfinstitute.org/fund-manager-rankings/venture-capital-firm\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to the Sovereign Wealth Fund Institute. </p><p>On June 11, a16z <a href=\"https://twitter.com/alive_eth/status/1668030741098233857\" target=\"_blank\" rel=\"noopener nofollow\">led</a> a $43 million Series A fundraise for London-based Gensyn — a blockchain-based marketplace connecting buyers and sellers of computing power.</p><p>Some of their most notable <a href=\"https://a16zcrypto.com/portfolio/\" target=\"_blank\" rel=\"noopener nofollow\">investments</a> in the cryptocurrency space include Coinbase, Avalanche, Compound, Dapper Labs, Matter Labs, OpenSea, <a href=\"https://cointelegraph.com/news/a16z-s-hyped-up-orange-balls-revealed-to-be-an-l2-rollup-client\">Optimism</a>, PROOF, Solana, Uniswap and Yuga Labs. </p><p>Cointelegraph reached out to a16z for comment but did not receive an immediate response.</p><p><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\"><strong>Best and worst countries for crypto taxes — Plus crypto tax tips</strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-12T03:50:17.000Z",
    "title": "Ethereum Price Could Avoid a Major Breakdown if it Closes Above One Key Level",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-downtrend-1800/",
    "description": "Ethereum price is moving lower from the $1,780 resistance against the US Dollar. ETH could decline heavily if there is a clear move below the $1,720 support. Ethereum is struggling to clear the $1,780 and $1,800 resistance levels. The price is trading below $1,800 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance near $1,760 on the hourly chart of ETH/USD (data feed via Kraken). The pair could decline heavily if there is a close below $1,720. Ethereum Price Remains At Risk Ethereum’s price attempted a fresh increase above the $1,775 and $1,780 resistance levels. ETH failed to gain bullish momentum above the $1,780 resistance, similar to Bitcoin. Earlier, the price climbed above the 23.6% Fib retracement level of the key decline from the $1,854 swing high to the $1,718 low. The price is now back below $1,750 and showing bearish signs. There is also a key bearish trend line forming with resistance near $1,760 on the hourly chart of ETH/USD. Ether is clearly struggling to clear $1,800 and the 100-hourly Simple Moving Average. Immediate resistance is near the $1,755 zone and the trend line. The next major resistance is near the $1,780 level. It is close to the 50% Fib retracement level of the key decline from the $1,854 swing high to the $1,718 low. Source: ETHUSD on TradingView.com A proper move above the $1,775 and $1,780 resistance levels might send Ether toward $1,850. The next resistance sits near $1,880, above which Ethereum could rise toward the key barrier at $1,920. Any more gains above the $1,920 resistance zone might send the price toward the $2,000 resistance. More Downsides in ETH? If Ethereum fails to clear the $1,755 resistance, it could continue to move down. Initial support on the downside is near the $1,720 level. The next major support is near the $1,700 level. If there is a break and close below the $1,700 support, the price could decline toward the $1,640 support. Any more losses may perhaps send the price toward the $1,600 level or even $1,550 in the coming sessions. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,720 Major Resistance Level – $1,780"
  }
]