[
  {
    "source": "Cointelegraph",
    "date": "2023-06-26T13:50:00.000Z",
    "title": "Venture capital financing in crypto, explained",
    "url": "https://cointelegraph.com/explained/venture-capital-financing-in-crypto-explained",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/cd8ed9869de34dc1e236f58065c79db7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>                        Venture capital firms invest in early-stage startups to fuel innovation, growth and technological advancements within the crypto ecosystem.                    </p>\n                    <p><h2>Future of venture capital financing in the crypto space</h2><p></p><p><em>The recent United States Securities and Exchange Commission charges brought against major crypto exchanges may significantly impact future VC financing for cryptocurrencies. </em></p><p>The allegations highlight the regulatory issues surrounding the cryptocurrency business and could result in heightened regulatory scrutiny. To adapt to the shifting regulatory landscape, VC companies may need to modify their investment strategy and improve their due diligence procedures.</p><p>VC firms will likely prioritize investments in projects demonstrating strong regulatory compliance and transparency measures. To ensure that their investments align with changing regulatory standards, they might also devote greater resources to legal and regulatory analysis.</p><p>Furthermore, the accusations might prompt VC firms to be more circumspect when assessing cryptocurrency investment options. To reduce regulatory risks, they might look for projects with solid governance frameworks, credible partners and transparent business models. This enhanced investigation could result from the lengthened investment review process and potential effects on the speed of capital deployment.</p><h2>Crypto venture capital financing vs. crypto hedge funds</h2><p></p><p><em>Crypto venture capital financing and crypto hedge funds are two distinct investment vehicles in the crypto industry. </em></p><p>While <a href=\"https://cointelegraph.com/news/the-emergence-of-cryptocurrency-hedge-funds\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/the-emergence-of-cryptocurrency-hedge-funds/amp\">crypto hedge funds</a> actively manage portfolios of cryptocurrencies and tokens, venture capital financing concentrates on early-stage enterprises and equity investments. They use long-term holdings, arbitrage, algorithmic trading and ICO participation to provide returns for their investors.</p><p><img alt=\"Crypto venture capital financing vs. Crypto hedge funds\" src=\"https://s3.cointelegraph.com/storage/uploads/view/8f9ddb6c0910319f7db50fcc247f20c8.jpg\" title=\"Crypto venture capital financing vs. Crypto hedge funds\"></p><h2>Key considerations for crypto venture capitalists</h2><p></p><p><em>Due to the continuously changing nature of the cryptocurrency sector, crypto venture capitalists must take some factors into account when <a href=\"https://cointelegraph.com/news/venture-capital-investments-into-blockchain-continue-to-free-fall-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/venture-capital-investments-into-blockchain-continue-to-free-fall-report/amp\">evaluating investment prospects</a>, such as market potential, team expertise, the regulatory environment and technical innovation.</em></p><p>First and foremost, technological advancement is essential to the crypto sector. Venture capitalists in the cryptocurrency space must evaluate a project’s underlying technology for innovation and potential effects. </p><p>They seek out initiatives that present novel solutions or enhance current blockchain technologies. For instance, Polychain Capital is a well-known cryptocurrency venture capital business that funds cutting-edge blockchain companies in their early stages.</p><p>The regulatory environment is also an important factor. Crypto VC firms must assess the project’s operating environment’s legal and regulatory landscape. Regulation adherence both guarantees the project’s long-term profitability and reduces potential risks. </p><p>A well-known cryptocurrency venture capital firm, Andreessen Horowitz (a16z), actively engages with legislators and regulators to establish legislation around cryptocurrencies, and invests in businesses exhibiting compliance and regulatory foresight.</p><p>Thirdly, while assessing cryptocurrency investment opportunities, team competence is crucial. Crypto VC firms assess the team’s track record, technological prowess and industry knowledge. </p><p>They look for well-versed teams in the cryptocurrency industry and have a track record of successfully carrying out their plans. For instance, Pantera Capital is a cryptocurrency venture capital firm that finances initiatives run by seasoned business people with a solid track record.</p><p>Market potential is also a key factor for crypto VC firms. They evaluate the target market’s size and development potential, the level of competition and the project’s capacity to gain market share. For instance, Paradigm, a cryptocurrency venture capital firm, invests in initiatives with a sizable addressable market and those that have the potential to upend traditional financial systems.</p><h2>Common venture capital financing rounds</h2><p></p><p><em>Each round of <a href=\"https://cointelegraph.com/news/crypto-venture-capital-investment-q1-2023-report-pitchbook\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-venture-capital-investment-q1-2023-report-pitchbook/amp\">venture capital financing</a> often corresponds to a particular stage of a startup’s growth and financial requirements. </em></p><p>The initial level of funding for a startup is known as the seed round. It usually happens when the business is still developing its product or service at the pre-revenue or early-revenue stage. Angel investors, private investors or early-stage venture capital firms frequently offer seed investments. The seed round aims to assist in product development, market validation and early expansion.</p><p>The startup’s operations are scaled during Series A financing, which comes after the seed investment. At this point, the business often has a working product or service, and some initial market momentum. </p><p>Series A funding can vary from a few million dollars to tens of millions, depending on the startup’s business, growth potential and market circumstances. Venture capital firms are frequently the source of this money. The money from this round is typically used on growing the staff, refining the product and accelerating client growth.</p><p>The firm receives funding in the Series B round once it has met important milestones, including building a sizable client base, making money and exhibiting market momentum. The company will use the Series B capital to grow more quickly and increase its market footprint. </p><p>Compared to prior rounds, venture capital firms participating in a Series B often offer more significant investments. The Series B capital raised may be put to use for business growth, market expansion and additional product development.</p><p>Later-stage firms with significant success and which are considering aggressive expansion are often only eligible for the Series C round and subsequent rounds. Higher fundraising levels, participation from illustrious venture capital firms or private equity investors, and occasionally, even involvement from institutional investors frequently set these rounds apart. </p><p>These rounds’ proceeds are typically invested in international growth, acquisitions, product <a href=\"https://cointelegraph.com/news/9-essential-finance-terms-you-must-know\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/9-essential-finance-terms-you-must-know/amp\">diversification</a> and other strategic projects to strengthen the firm’s market position.</p><h2>How does venture capital work in the crypto space?</h2><p></p><p><em>Venture capital financing in the crypto space is no different from typical VC, except the startups benefiting from financing operate in the <a href=\"https://cointelegraph.com/learn/what-is-a-cryptocurrency-a-beginners-guide-to-digital-money\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/what-is-a-cryptocurrency-a-beginners-guide-to-digital-money/amp\">cryptocurrency market</a>. </em></p><p>Venture capital businesses in the cryptocurrency sector concentrate their investments on startups and initiatives linked to cryptocurrencies, blockchain technology, <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance/amp\">decentralized finance (DeFi)</a> and other cutting-edge distributed ledger technology applications. Projects creating new cryptocurrencies, <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-everything-there-is-to-know\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/how-does-blockchain-work-everything-there-is-to-know/amp\">blockchain</a> platforms, smart contracts, decentralized applications (DApps) and other technologies can be included.</p><p>Contrary to traditional venture capital, where stock holdings are often obtained, venture capital in the cryptocurrency industry frequently entails investing in tokens issued by the project or firm. These tokens can stand in for several different value types, such as <a href=\"https://cointelegraph.com/explained/utility-tokens-vs-equity-tokens-key-differences-explained\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/utility-tokens-vs-equity-tokens-key-differences-explained/amp\">utility tokens</a>, which enable platform access, or security tokens, which grant ownership rights.</p><p>Many cryptocurrency firms use <a href=\"https://cointelegraph.com/learn/initial-coin-offering\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/initial-coin-offering/amp\">token sales</a> to raise money by trading tokens for cash from investors. To assist in the project’s growth, venture capital firms may take part in these token sales and buy tokens early on, frequently at a discount.</p><p>To evaluate a project’s viability, venture capitalists in the cryptocurrency sector carry out extensive due diligence. This includes assessing the project’s technical viability, market demand, competitive environment, token economics and regulatory issues.</p><p>Outside of funding, venture capital firms in the cryptocurrency sector frequently offer strategic advice, connections to the industry and expertise to support the project’s success. They also help handle regulatory obstacles, business development, marketing, community building and token listing.</p><p>Through successful exits, venture investors hope to recoup their investments. Exits in the cryptocurrency sector can occur in various ways, such as when a project sees rapid growth and adoption, if a larger company acquires it, or when it lists its token on exchanges for trading and liquidity.</p><h2>What is venture capital financing?</h2><p></p><p><em>Venture capital (VC) is a form of financing that institutional investors provide to entrepreneurs and startup businesses, usually at the expansion stage of their businesses.</em></p><p>By investing in businesses that might not yet have established revenues or positive cash flows, <a href=\"https://cointelegraph.com/learn/venture-capital-financing-a-beginners-guide-to-vc-funding-in-the-crypto-space\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/venture-capital-financing-a-beginners-guide-to-vc-funding-in-the-crypto-space/amp\">venture capitalists</a> often assume larger risks than traditional bank borrowers or providers of other types of finance. Venture capitalists often receive an equity stake in the business as compensation for their investment, frequently in preferred stock.</p><p>The main goal of venture capital financing is to give high-growth businesses and startups financial support and strategic direction. In addition to providing money, venture capitalists frequently offer their network, business knowledge and industry expertise to help grow the businesses they invest in.</p><p>For startups and early-stage businesses, venture capital investment can be extremely important since it provides the money needed for product development, market expansion, employing critical people and scaling operations. It is beneficial for businesses in sectors with significant room for innovation and expansion, such as clean energy, biotechnology and technology.</p><p>Early-stage financing (to develop a product and grow a client base), later-stage financing (to scale operations and enter new markets), and seed investment are typical stages of venture capital financing. Depending on the company’s growth stage, industry and potential, venture capitalists’ financial commitments can range widely.</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-26T13:47:00.000Z",
    "title": "Breaking down the ongoing token impersonation scams with DeFi execs",
    "url": "https://cointelegraph.com/news/breaking-down-the-ongoing-token-impersonation-scams-with-defi-execs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/d19a2d7d-b4bd-4a20-85ef-2d3d22bfeb66.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Tres Finance co-founder Tal Zackon warned businesses to not use explorers when tracking their finances. </p>\n                    <p><p>Decentralized Finance (DeFi) protocol Tres Finance warned the community about a scam that involves fake tokens designed to mimic legitimate transactions.</p><p>In an interview, Tres Finance co-founder Tal Zackon and the company’s technical lead Idan David shared the details of a scam using fraudulent transactions that imitate legitimate ones. According to the duo, the scammers attempt to lure unsuspecting users to copy the wrong wallet address and send their transactions there. </p><p>David further explained that scammers often identify and target wallets with large amounts of stablecoins like Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) or USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>). Once the scammers locked into their targets, they create similar-looking wallet addresses and create tokens that imitate the legitimate ones. David explained: </p><blockquote>“So, they're creating a new token that has the same symbol as the original token, and they can create fictitious transactions with tokens that are not marked as scam assets by Etherscan.”</blockquote><p>The scammers then create a transaction that mimics legitimate transactions from the wallet address prefix to the number of tokens sent to the address. This makes it look like their target has been the one constantly sending transactions to the wallet address they planted. Through this, people who are using their transaction history to get wallet addresses are at risk of sending it to the scammers. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/048fa97d-e24c-4b8d-91f9-ee080ecc2855.png\"  /><figcaption style=\"text-align: center;\"><em>Example of a scam transaction (above) designed to mimic a legitimate transaction (below). Source: Tres Finance</em></figcaption></figure><p>Zackon warned businesses to not use explorers to track their finances. “Do not use explorers to track your financial movements. You have to use a dedicated system that will help you verify the asset, and verify the third party that you're engaged with,” he said. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/certik-bounty-sui-blockchain-threat-discovery\"><strong><em>CertiK receives $500K bounty after Sui blockchain threat discovery</em></strong></a></p><p>The executive extended the warning to end users as well. According to Zackon, he would recommend keeping track of a spreadsheet of the addresses that they are working with. In addition, the Tres Finance co-founder said that it would be better to “double-check each and every transaction” as well as the addresses that users are engaging with. </p><p>On Jan. 12, wallet provider Metamask <a href=\"https://cointelegraph.com/news/metamask-warns-crypto-users-about-address-poisoning-scam\">issued a warning</a> about a somewhat similar scheme called address poisoning. With this, scammers send tokens worth $0 to wallets using vanity-generated wallet addresses with similar first and last characters to their targets. This populates their transaction history with fraudulent transactions, hoping that the user will make the mistake of copying and pasting the wallet address when sending a transaction. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethics-101-crypto-projects-negotiate-hackers/\"><strong><em>Should crypto projects ever negotiate with hackers? Probably</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-26T13:45:00.000Z",
    "title": "Game developers’ role in elevating Web3 gaming — Breaking the stigma",
    "url": "https://cointelegraph.com/innovation-circle/game-developers-role-in-elevating-web3-gaming-breaking-the-stigma",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/4fb02551-a9bd-4566-8f34-75275dc3afc2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>By focusing on these elements, game developers can elevate Web3 games and change the stigma surrounding them. It's all about striking that perfect balance.</p>\n                    <p><p>Since its inception in 2017, Web3 gaming (a.k.a. blockchain gaming) has faced significant hurdles, leaving the industry at a critical crossroads — adapt or perish (as some believe). But others, including myself, are confident that the world of Web3 games is merely undergoing a much-needed transformation, having only recently shed the hype-driven mentality that marked its infancy. </p> <p>To put this into context, one must remember that mobile games had similar challenges. The quality of the first games, created primarily by enthusiasts and indie studios, was noticeably poor. The infrastructure needed for developing and delivering high-quality games was absent. Fast forward to today, the global mobile gaming market has <a href=\"https://www.researchandmarkets.com/reports/5767600/mobile-gaming-global-market-report\">increased</a> from $118.34 billion in 2022 to $138.63 billion in 2023, with a compound annual growth rate (CAGR) of 17.1%. </p> <p>For Web3 games to reap the same rewards, game quality, sustainable economies, engagement and fun must be a top priority. Here’s a deeper look at each.</p> <h3><strong>Enhancing game quality</strong></h3> <p>In the gaming industry, quality is a multifaceted concept comprising tangible and intangible elements — all of which contribute to the player’s overall experience. And the seven areas game developers should focus on to improve game quality are as follows:</p> <ul><li><strong>Gameplay:</strong> Quality gameplay is characterized by well-designed game mechanics, logical rules and a balanced system that promotes fair play.</li><li><strong>Visual aesthetics:</strong> High-quality graphics, animations and design elements significantly contribute to a game’s appeal.</li><li><strong>Story and narrative:</strong> A compelling storyline and captivating characters can turn a good game into a great one. </li><li><strong>User interface and user experience (UI/UX):</strong> A high-quality game offers a smooth, intuitive and easily navigable interface. </li><li><strong>Performance and stability:</strong> A good game performs reliably across various devices and platforms and is free from glitches, bugs and crashes that can disrupt gameplay and frustrate players.</li><li><strong>Sound design:</strong> Quality sound effects, background music and voice acting enhance immersion and give depth to the gameplay. </li><li><strong>Replayability:</strong> This involves elements like varied gameplay, unlockable content, difficulty levels and multiplayer options.</li></ul> <p>Developers must create high-quality games with captivating gameplay, aesthetically pleasing visuals, compelling narratives, intuitive UI/UX and outstanding performance. </p> <h3><strong>Building sustainable economies</strong></h3> <p>A sustainable economy refers to a well-balanced and self-perpetuating in-game financial system that is driven by the players’ actions, remains viable over the long term and contributes to the overall health and longevity of the game. Unfortunately, many of the early Web3 games were missing this. But here’s how developers can avoid this.</p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://circle.cointelegraph.com/learn-more?utm_campaign=Coin&_ga=2.123197772.699257063.1649682515-719256619.1645538730\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <ul><li><strong>Focus on tokenomics:</strong> A sustainable Web3 game will have a well-thought-out tokenomics model that encourages balanced player participation, stimulates in-game trading and avoids inflation or deflation scenarios.</li><li><strong>Create a fair and balanced earning model:</strong> Play-to-earn was a fundamental aspect of early Web3 games and it’s still relevant. The only difference is that a sustainable economy will have a fair and balanced earning model that rewards players on their effort, skills and time spent in the game — not the money they spent.</li><li><strong>Enable true asset ownership:</strong> A sustainable economy will manage a player’s assets — including in-game items, characters, land, resources and weapons — in a manner that maintains their value over time, preventing oversupply or saturation that could devalue these assets. </li><li><strong>Incorporate decentralized governance:</strong> This allows for the incorporation of player feedback into economic decisions. Governance prerogatives should be gained by players based on the value they provide for the game’s overall ecosystem.</li><li><strong>Ensure scalability as security:</strong> As the game grows and attracts more players, the underlying blockchain infrastructure must be able to scale to handle increasing transaction volume while maintaining low fees and fast transaction times. The game’s economy must also be secure. </li></ul> <p>In summary, a sustainable economy balances supply and demand, incentivizes player participation and ensures the fair distribution of resources and rewards.</p> <h3><strong>Increasing engagement</strong></h3> <p>Engagement can be understood as the level of player’s involvement, interaction and commitment to the game. It’s an amalgamation of a player’s interest, enjoyment and overall satisfaction that influences the time and effort they’re willing to invest in the game. Here are some key elements that lead to a more engaging experience. </p> <ul><li><strong>Intriguing gameplay:</strong> The fundamental element of engagement is gameplay that captivates the player. This means well-structured mechanics, unique features and clear progression systems that provide a sense of achievement.</li><li><strong>Social interaction:</strong> Multiplayer options, in-game chats, community events and cooperative gameplay can significantly boost engagement, making the game not just a solitary experience but a social one.</li><li><strong>Narrative and world-building:</strong> A compelling storyline and a well-crafted game world can deeply engage players, making them invested in the outcomes and urging them to explore more.</li><li><strong>Challenge and skills development:</strong> Games that offer a balanced level of challenge, allowing players to improve their skills and tackle more difficult tasks steadily, tend to keep players hooked.</li><li><strong>Rewards and recognition:</strong> Reward systems that acknowledge players’ achievements, like leaderboards, achievement badges and unlockable content, further increase engagement.</li></ul> <p>In the context of Web3 games, engagement also includes economic incentives, asset ownership, decentralized governance and interoperability. Economic incentives and asset ownership allow players to earn real-world value from their in-game activities and digital assets. Interoperability, or the ability to use these in-game assets across different games or platforms — a feature unique to Web3 gaming — can also help increase engagement.</p> <h3><strong>Don’t forget about fun</strong></h3> <p>As you might anticipate, fun in gaming largely corresponds with all the elements listed above, but with an important distinction: It is inherently tied to the individuality of each player. Ultimately, the concept of fun in games is largely contingent upon individual player preferences and the interplay of these multifaceted elements. Crafting fun games fundamentally comes down to understanding the individual preferences of your players and combining these with common archetypes. This methodology facilitates the delivery and prioritization of each player’s personalized and consequential gaming experience.</p> <p>However, while understanding players’ individual preferences and designing experiences around them is important, overall, fun in games — especially in Web3 games — can be derived from an amalgamation of game quality, sustainable economies and engaging gameplay. By focusing on these elements, game developers can elevate Web3 games and change the stigma surrounding them. It’s all about striking that perfect balance.</p> <p><em>Maksym Illiashenko is co-founder and CEO of <a href=\"https://mynftwars.com/\">My NFT Wars: Riftwardens</a>.</em></p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\" /> </div> </div> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://circle.cointelegraph.com/\"><em><strong>Learn more about Cointelegraph Innovation Circle and see if you qualify to join</strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-26T13:59:15.000Z",
    "title": "Bitcoin trading volume skyrockets three days ahead of attempted coup in Russia",
    "url": "https://cryptoslate.com/insights/bitcoin-trading-volume-skyrockets-three-days-ahead-of-attempted-coup-in-russia/",
    "description": "<p>Quick Take Over the weekend, news broke of an attempted coup in Russia. Despite its resolution by the end of the weekend, this news drew widespread attention. This incident coincided with a spike in trading for the USDT/RUB currency pair. The trading volume for this pair climaxed at $8.53 million, marking the most considerable volume [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-trading-volume-skyrockets-three-days-ahead-of-attempted-coup-in-russia/\">Bitcoin trading volume skyrockets three days ahead of attempted coup in Russia</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-06-26T13:43:02.000Z",
    "title": "Singapore’s Central Bank Pushes for Interoperable Tokenized Assets",
    "url": "https://cryptobriefing.com/singapore-central-bank-pushes-tokenization-assets/?utm_source=feed&utm_medium=rss",
    "description": "The Monetary Authority of Singapore (MAS) has proposed an initiative to create an open and interoperable framework for tokenized digital assets in collaboration with the Bank for International Settlements (BIS),..."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-26T13:41:04.000Z",
    "title": "MetaBlaze Announces $4M Crypto Presale Sellout, Gaming Partnerships, and AI MetaChip NFT Drop",
    "url": "https://www.cryptoglobe.com/latest/2023/06/metablaze-announces-4m-crypto-presale-sellout-gaming-partnerships-and-ai-metachip-nft-drop/",
    "description": "Dover, USA, June 26th, 2023, Chainwire MetaBlaze, a pioneering Web 3 Gaming, and AI Company, is building momentum as they approach its upcoming Q3 launch. Between strategic partnerships with household Crypto Gaming brands, a sold-out presale, and a never-before-seen AI-Integrated NFT collection, the MetaBlaze ecosystem is primed for its next evolution stage. MetaBlaze Reaches $4M […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-26T13:57:10.000Z",
    "title": "Crypto.com Obtains VASP Registration in Spain",
    "url": "https://cryptodaily.co.uk/2023/06/cryptocom-obtains-vasp-registration-in-spain",
    "description": "<p>Singapore-based crypto exchange Crypto.com announced it secured registration as a Virtual Asset Service Provider (VASP) in Spain. </p>\n<p>Cryptocurrency exchange Crypto.com has received registration as a virtual Asset Service Provider (VASP) from the Bank of Spain. The Singapore-based exchange obtained this registration after its compliance with Anti-Money Laundering Directive (AMLD) and its ability to safeguard its users was reviewed.</p>\n<p>The VASP registration will allow the exchange to offer its products and services to customers in Spain.</p>\n\n<p dir=\"ltr\" lang=\"en\">We're excited to share our latest regulatory achievement in Europe!We have obtained our Virtual Asset Provider Registration in Spain 🇪🇸🙌Learn more:https://t.co/ZGmgE9n937 pic.twitter.com/fmkWt6npvK</p>\n&mdash; Crypto.com (@cryptocom) June 23, 2023\n<p>\n\n</p>\n<p>Kris Marszalek, CEO of Crypto.com commented:</p>\n\n<p>Receiving the VASP registration from the Bank of Spain is the latest testament to our commitment to compliance and eagerness to work with regulators and public officials in responsibly advancing crypto and blockchain technology.</p>\n\n<p>Adding,</p>\n\n<p>We look forward to continuing to work with the Bank of Spain as we launch our products and services in-market and providing users with the comprehensive, safe and secure crypto experience that they desire.</p>\n\n<p>The exchange has been gaining regulatory momentum in recent times. Most recently, Crypto.com was granted a Major Payment Institution License (MPI) for Digital Payment Token services in Singapore.</p>\n<p>Crypto.com also received the following:</p>\n<p>Registration as a Digital Asset Service Provider (DASP) by the Autorit&eacute; des march&eacute;s financiers (AMF) in France; registration approval as a crypto asset business from the UK Financial Conduct Authority (FCA); approval of its MVP Preparatory Licence from the Dubai Virtual Assets Regulatory Authority (VARA); Electronic Financial Transaction Act and Virtual Asset Service Provider registration in South Korea; registration approval as a Digital Currency Exchange Provider and Independent Remittance Dealer in Australia by AUSTRAC; an Australian Financial Services Licence and Australian Credit Licence from the Australian Securities and Investments Commission (ASIC); registration in Italy from the Organismo Agenti e Mediatori (OAM); registration in Greece from the Hellenic Capital Market Commission; registration in Cyprus from the Securities and Exchange Commission; regulatory approval from the Cayman Islands Monetary Authority; a US Commodity Futures Trading Commission (CFTC) regulated Derivatives Clearing Organization (DCO) and a Designated Contracts Market (DCM); and a pre-registration undertaking with the Ontario Securities Commission and Canada Securities Administrators, among others.</p>\nTrading Practices Called Into Question\n<p>Crypto.com received some negative attention recently after the Financial Times published a report calling the exchange&rsquo;s trading practices into question. According to the report, the exchange operates proprietary trading and market-making teams.</p>\n<p>Crypto.com denied the allegations made by the Financial Times.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T13:56:15.000Z",
    "title": "Hong Kong’s largest bank now offers crypto services",
    "url": "https://www.cryptopolitan.com/hong-kong-largest-bank-offer-crypto-services/",
    "description": "In a significant development, Hong Kong&#8217;s premier banking institution, HSBC, now provides services allowing customers to trade Bitcoin and Ethereum Exchange-Traded Funds (ETFs). This momentous occasion marks the first time a bank in Hong Kong has ventured into the ETF crypto market, pioneering a new era in financial services in this vibrant city. A game-changer ... <a title=\"Hong Kong&#8217;s largest bank now offers crypto services\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hong-kong-largest-bank-offer-crypto-services/\" aria-label=\"More on Hong Kong&#8217;s largest bank now offers crypto services\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T13:40:16.000Z",
    "title": "Rise of AI Chatbots and New TV Stations Could Significantly Impact Future Elections",
    "url": "https://www.cryptopolitan.com/ai-chatbots-and-tv-stations-impact-elections/",
    "description": "The rise of AI chatbots and the emergence of new TV stations have raised significant concerns regarding their potential impact on future elections. Activists and even rogue states can exploit generative AI technology to influence the outcome of UK elections. With the exponential growth of artificial intelligence chatbots, the number of votes cast based on ... <a title=\"Rise of AI Chatbots and New TV Stations Could Significantly Impact Future Elections\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-chatbots-and-tv-stations-impact-elections/\" aria-label=\"More on Rise of AI Chatbots and New TV Stations Could Significantly Impact Future Elections\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-26T14:00:59.000Z",
    "title": "Find Out Why Smart Money Is Accumulating Avorak AI and Dogecoin Right Now!",
    "url": "https://nulltx.com/find-out-why-smart-money-is-accumulating-avorak-ai-and-dogecoin-right-now/",
    "description": "Avorak AI (AVRK) and Dogecoin (DOGE) have recently garnered significant interest from smart money investors. The accumulation of these cryptocurrencies has raised questions about the reasons behind their actions. Is Dogecoin going up soon? For over a week, the Dogecoin (DOGE) price struggled to surpass the $0.063 resistance level, creating a sense of ambiguity regarding [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-26T14:00:00.000Z",
    "title": "Alex The Doge presale bullish, Polygon and Stacks prices slipping",
    "url": "https://crypto.news/alex-the-doge-presale-bullish-polygon-and-stacks-prices-slipping/",
    "description": "Alex The Doge (ALEX) is set to rally in future sessions as polygon (MATIC) and stacks (STX) slip, struggling in the current crypto trend"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T14:06:09.000Z",
    "title": "Exciting Updates in IOTAcore: Mana, Staking Rewards, and Congestion Control Take Center Stage on GitHub",
    "url": "https://www.crypto-news-flash.com/exciting-updates-in-iotacore-mana-staking-rewards-and-congestion-control-take-center-stage-on-github/?utm_source=rss&utm_medium=rss&utm_campaign=exciting-updates-in-iotacore-mana-staking-rewards-and-congestion-control-take-center-stage-on-github",
    "description": "The IOTA team has successfully led the groundwork for a new token economy, which will be feeless with almost no barrier to accessibility and keeping congestion under control. The IOTA team has also ensured the implementation of staking and delegation with Mana rewards. The team at the IOTA Foundation continues to push forward the progress [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T14:00:15.000Z",
    "title": "ChatGPT Price Predictions: Hedera (HBAR) vs. Avalanche (AVAX) vs. VC Spectra (SPCT)",
    "url": "https://www.crypto-news-flash.com/chatgpt-price-predictions-hedera-hbar-vs-avalanche-avax-vs-vc-spectra-spct/?utm_source=rss&utm_medium=rss&utm_campaign=chatgpt-price-predictions-hedera-hbar-vs-avalanche-avax-vs-vc-spectra-spct",
    "description": "Advanced AI chatbots like ChatGPT explore potential trends and price movements for digital assets like Hedera (HBAR) and Avalanche (AVAX). According to ChatGPT, Hedera (HBAR) prices should triple, while Avalanche (AVAX) should double its price.  In the meantime, VC Spectra (SPCT) is gaining significant attention with predictions of 10x gains on investments before closing the [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-26T13:46:29.000Z",
    "title": "HSBC & Bitcoin’s ETF, the Eastern Banking Is Winning the Race",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/hsbc-bitcoins-etf-the-eastern-banking-is-winning-the-race/",
    "description": "<p>This significant development highlights the rapid progress of Eastern countries in adopting financial tools related to cryptocurrencies. This places them at the forefront of the global digital revolution and paves the way for enhanced exposure and adoption of web3 innovations. HSBC Bank&#8217;s decision to embrace Bitcoin&#8217;s ETF marks a monumental shift in the traditional banking [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/hsbc-bitcoins-etf-the-eastern-banking-is-winning-the-race/\">HSBC &#038; Bitcoin’s ETF, the Eastern Banking Is Winning the Race</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-26T13:50:00.000Z",
    "title": "Financial Institutions Show High Interest In Sygnum’s For Crypto Transactions",
    "url": "https://coinedition.com/financial-institutions-show-high-interest-in-sygnums-for-crypto-transactions/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/027.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/027.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/027-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/027-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/027-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/027-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/027-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/027-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/027-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/027-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/027-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/027-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/027-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/027-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/027-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/027-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/027-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Sygnum, which operates a digital-asset bank in Switzerland and provides asset management services in Singapore is witnessing significant interest in cryptocurrency transactions from various financial entities such as fund houses, family offices, and institutions. According to Bloomberg, this surge in demand is anticipated to enhance the revenues generated by their newly established brokerage business in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/financial-institutions-show-high-interest-in-sygnums-for-crypto-transactions/\">Financial Institutions Show High Interest In Sygnum&#8217;s For Crypto Transactions</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]