[
  {
    "source": "CoinDesk",
    "date": "2023-05-25T21:52:29.000Z",
    "title": "Nike OF1 NFT Sale Surpasses $1M Despite Delays, Tech Issues",
    "url": "https://www.coindesk.com/web3/2023/05/25/nike-of1-nft-sale-surpasses-1m-despite-delays-tech-issues/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The highly-anticipated virtual sneaker sale on .SWOOSH faced persistent delays, leaving some users frustrated. Meanwhile, Nike has so far labeled the release as a success."
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-25T22:00:53.000Z",
    "title": "FUD Or Fact? Multichain Team Arrested, On-Chain Data Uncovers Fantom Exposure To Wrapped Tokens",
    "url": "https://www.newsbtc.com/fantom/fud-or-fact-multichain-team-arrested-on-chain-data-uncovers-fantom-exposure-to-wrapped-tokens/",
    "description": "Rumors of the arrest of the Multichain team have sent shockwaves throughout the Fantom ecosystem. Despite trading volumes of $129 million, the fear, uncertainty, and doubt (FUD) have resulted in a 5x increase in daily bridging volumes. However, upon closer examination of the on-chain data, the bridging volumes do not show a significant sign of panic. Related Reading: Chainlink (LINK) Under Bearish Strain As Selling Pressure Mounts Fantom&#8217;s Risky-Wrapped Token Exposure According to a Twitter thread by the crypto researcher DeFi Ignas, Fantom (FTM) is the most exposed to Multichain&#8217;s wrapped tokens. This suggests that Fantom is particularly vulnerable to any negative impact that may result from the rumored arrest of the Multichain team. This is because Fantom has significant exposure to Multichain&#8217;s wrapped tokens, with 35% of its total value locked (TVL) dependent on these wrappers. In addition, Multichain issues 40% of non-FTM assets, which is equivalent to a sizable $650 million. This means that if anything were to happen to Multichain, it could have a significant impact on the overall value of these assets. Furthermore, Multichain handles 81% of Fantom&#8217;s total stablecoin market capitalization. Stablecoins are digital assets that are pegged to the value of a real-world asset, such as the US dollar. They are often used as a way to hedge against market volatility. However, If anything were to happen to Multichain, it could have a significant impact on the value of these stablecoins and cause instability in the Fantom ecosystem. Fantom Investors Stay Calm Amid Multichain Arrest Rumors According to Ignas, there should have been a significant outflow of Total Value Locked from Fantom due to its reliance on Multichain. However, the data shows that the amount withdrawn was only 1% of its total TVL of $1.78 billion, which indicates that there is not much panic in the market. Furthermore, while the TVL has dropped by 9.55% in USD, adjusting for the price of FTM shows no significant outflow of capital. The clearest and only sign of panic is the Multichain Liquidity Providers (LPs) on Fantom, with a total of $33 million being withdrawn by LPs from Fantom, and only $1.7 million in deposits. However, what is most worrying is the lack of communication from the Multichain team. It has been reported that the current Multichain CEO Zhaojun hasn&#8217;t been online in a week. This has left many investors and traders in the cryptocurrency market feeling uncertain about the future of the project. Related Reading: Bitcoin Bearish Signal: NUPL Finds Rejection At Long-Term Resistance Additionally, Multichain has reported that some of the cross-chain routes are unavailable due to force majeure and that Kava, zkSync, and Polygon zkEVM routes were temporarily suspended. There were also 83 transactions pending for more than a day, which has raised further concerns among investors and traders. Featured image from Unsplash, chart from TradingView.com  &#160;"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-25T22:01:26.000Z",
    "title": "Binance Announces New Non-Fungible Token (NFT) Borrowing Program, Binance NFT Loan",
    "url": "https://dailyhodl.com/2023/05/25/binance-announces-new-non-fungible-token-nft-borrowing-program-binance-nft-loan/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/11/gaming-studio-binance.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/11/gaming-studio-binance.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/11/gaming-studio-binance.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/11/gaming-studio-binance.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/11/gaming-studio-binance.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/11/gaming-studio-binance.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/11/gaming-studio-binance.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The world&#8217;s largest crypto exchange by trading volume, Binance, has released a new non-fungible token (NFT) loan feature. According to a new Binance announcement, the platform will offer zero gas fees and the ability to borrow Ethereum (ETH) without the need to sell assets. The loan feature aims to cater to those who want quick [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/25/binance-announces-new-non-fungible-token-nft-borrowing-program-binance-nft-loan/\">Binance Announces New Non-Fungible Token (NFT) Borrowing Program, Binance NFT Loan</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]