[
  {
    "source": "Cointelegraph",
    "date": "2023-11-08T08:26:29.000Z",
    "title": "UAE central bank to penalize unlicensed virtual asset service providers",
    "url": "http://cointelegraph.com/news/uae-vasps-central-bank-rules-fatf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/3ce3b233-c9b7-461e-a38b-e0ee6adcc746.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>UAE lawyer Irina Heaver explained that the new guidance is part of the UAE’s efforts to be removed from the Financial Action Task Force’s (FATF) “grey list.”</p>\n                    <p><p>The Central Bank of the United Arab Emirates (CBUAE), along with other regulators in the country, has recently published new joint guidance for virtual asset service providers (VASPs) operating within the country. The new guidelines include penalties for VASPs operating without proper licenses within the jurisdiction. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The National Anti-Money Laundering and Combating Financing of Terrorism and Financing of Illegal Organisations Committee (NAMLCFTC), in collaboration with UAE supervisors, has issued guidance on combating the use of unlicensed virtual asset service providers, which is prepared by…</p>&mdash; Central Bank of the UAE (@centralbankuae) <a href=\"https://twitter.com/centralbankuae/status/1721415860202438880?ref_src=twsrc%5Etfw\">November 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On Nov. 6, the National Anti-Money Laundering and Combating Financing of Terrorism and Financing of Illegal Organisations Committee (NAMLCFTC) and the CBUAE <a href=\"https://www.centralbank.ae/media/g5bgxlz5/joint-guidance-on-combating-the-use-of-unlicensed-virtual-asset-providers-in-the-uae-en.pdf\" target=\"_blank\" rel=\"noopener nofollow\">published</a> a list that they described as “Red Flags” for VASPs. The list included the lack of regulatory license, unrealistic promises, poor communications, lack of regulatory disclosures and more indicators that could identify suspicious parties. </p><p>According to the new guidance, the supervisory authorities expect all licensed financial institutions (LFIs), designated non-financial businesses and professions (DNFBPs) and licensed VASPs to report transactions from suspicious parties. The guidance wrote: </p><blockquote>“Any information related to unlicensed virtual asset activities can be reported through whistleblowing mechanisms, to help regulatory authorities in their efforts to uphold the law and protect the UAE financial system.”</blockquote><p>Within the new document, the central bank also noted that VASPs operating in the UAE without a valid license will be subjected to \"civil and criminal penalties including, but not limited to, financial sanctions against the entity, owners and senior managers.” In addition, the document also highlighted that LFIs, DNFBPs and licensed VASPs that demonstrate willingness to deal with unlicensed VASPs will also be subject to actions from law enforcement. </p><p>In a press release, His Excellency Khaled Mohamed Balama, governor of the CBUAE and chairman of the NAMLCFTC, <a href=\"https://www.centralbank.ae/media/3dnhw4kq/namlcftc-issues-guidance-on-combating-the-use-of-unlicensed-virtual-asset-service-providers-en.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a> that the new guidance comes at a time when virtual assets have become more accessible. The CBUAE executive explained that as the digital economy matures, their work on “combating all kind of financial crimes intensifies.” This ensures the integrity of the financial system in the UAE, according to Balama. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/lawyer-explains-new-federal-virtual-asset-law-in-the-united-arab-emirates\"><strong><em>Lawyer explains new federal virtual asset law in the United Arab Emirates</em></strong></a></p><p>Commenting on the update, UAE lawyer Irina Heaver told Cointelegraph that the new guidance is part of a broader effort from the UAE to be removed from the Financial Action Task Force’s (FATF) “grey list.” This list indicates that a country has deficiencies in its Anti-Money Laundering (AML) and Counter-Terrorist Financing (CTF) regimes, but has committed to resolving these issues within agreed timeframes.</p><p>In March 2022, the UAE was <a href=\"https://cointelegraph.com/news/countries-ignoring-crypto-aml-rules-risk-placement-on-fatf-s-grey-list-report\">placed into the FATF’s grey list</a> and subjected to increased monitoring due to deficiencies in AML and CTF. However, the country made a high-level commitment to work with the global watchdog to strengthen its AML and CTF regimes. </p><p>According to Heaver, the UAE has enacted significant reforms since its placement on the grey list in 2022. With new updates to its AML and CTF regulatory frameworks, the country may exit the grey list soon. “The next FATF review, expected in April or May 2024, could lead to the UAE’s exit from the grey list if it continues to demonstrate consistent compliance,” she added. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/slumdog-billionaire-polygon-top-10-brings-no-satisfaction-sandeep-nailwal/\"><strong><em>Slumdog billionaire 2: ‘Top 10… brings no satisfaction’ says Polygon’s Sandeep Nailwal</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-11-08T08:35:06.000Z",
    "title": "Ethereum holders diversifying into dogecoin rival after 20% rally",
    "url": "https://crypto.news/ethereum-holders-diversifying-into-dogecoin-rival-after-20-rally/",
    "description": "As Ethereum rally, ETH holders have taken note of the upcoming Dogecoin rival, NuggetRush (NUGX)"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-08T08:18:51.000Z",
    "title": "Toncoin (TON) emerges as top gainer, strong buy signal surfaces",
    "url": "https://crypto.news/toncoin-ton-emerges-as-top-gainer-strong-buy-signal-surfaces/",
    "description": "Toncoin (TON) gained bullish momentum over the past week as positivity around the asset grows strong.&#160; TON registered 8.7% gains in the past 24 hours and is trading at $2.63 at the time of writing. The asset’s market cap surpassed&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-08T08:15:42.000Z",
    "title": "Market Makers Bet Big On Bitcoin Price Surge: Expert",
    "url": "https://www.newsbtc.com/news/bitcoin/market-makers-bet-big-bitcoin-price-surge/",
    "description": "In a series of insightful observations, Adam Cochran, a renowned expert in the field of cryptocurrency and founder of Cinneamhain Ventures, recently shared his analysis on the relationship between Bitcoin price movements and US Treasury auctions. Cochran&#8217;s comments, primarily disseminated viaX (formerly known as Twitter), offer a unique perspective on an emerging trend in the market, particularly in relation to traditional financial instruments. Bitcoin Price Rises After Each Treasury Auction Cochran notes a distinct pattern: &#8220;Some big market maker seems to really care about real rates vs Bitcoin (I guess in anticipation of ETF buyers?). Every time you get a good auction on US treasuries, you&#8217;ve got about 5 min before BTC takes a leg up.&#8221; This observation suggests a correlation between the outcomes of USTreasury auctions and subsequent movements in Bitcoin prices. The essence of Cochran&#8217;s theory revolves around the concept of real interest rates and their inverse relationship with Bitcoin. Real rates refer to the interest rates adjusted for inflation. In traditional finance, these rates significantly influence investment decisions across various asset classes. Related Reading: Bitcoin Price Targets $46,000 As DXY Receives Kiss Of Death Cochran posits that a successful US Treasury auction, which typically indicates lower yields (and hence lower real rates), is quickly followed by a spike in Bitcoin prices. This trend, according to Cochran, is indicative of a market maker betting on large funds allocating to Bitcoin as a hedge against real rates. This relationship becomes particularly significant in light of discussions around Bitcoin Exchange-Traded Funds (ETFs). According to Bloomberg experts, there is a 90% chance of a spot Bitcoin ETF receiving approval by the end of the year. One of the reasons for this is that the US Securities and Exchange Commission (SEC) has been actively communicating with applicants such as BlackRock and Fidelity in recent weeks, as a result of which amendments to the application have been submitted. The increasing seriousness of these conversations seems to have amplified the correlation, as noted by Cochran: &#8220;Someone is making the bet that large funds will allocate to Bitcoin as a counter to real rates which would be huge.&#8221; Related Reading: Altcoins Market Share Versus Bitcoin At A 4 Month High: What’s The Trigger? Furthermore, Cochran highlights the impact of Bitcoin&#8217;s price movements on the broader financial market: &#8220;The BTC momentum on any upswing is pretty clear, it&#8217;ll suck a lot of momentum out of other parts of the market, because its current catalysts are just on another scale.&#8221; Backtest For The Theory Still Pending In response to an inquiry about backtesting this theory, Cochran admitted the lack of long-term data but emphasized the recent nature of this trend: &#8220;Hrm, someone probably has that data? I&#8217;ve just been monitoring manually, and the correlation has only been the past few weeks to month, since the ETF convo got serious, so a long dated backtest wouldn&#8217;t hold.&#8221; This acknowledgment points to the nascent stage of this observed correlation. Nevertheless, Cochran&#8217;s insights offer a compelling narrative linking traditional financial markets with Bitcoin. As the conversation around Bitcoin ETFs gains momentum, these observations could become increasingly relevant, offering valuable insights for investors. At press time, Bitcoin traded at $35,278. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-08T08:31:26.000Z",
    "title": "Onafriq Uses Ripple Payments to Foster Cross-Border Payments",
    "url": "https://coinedition.com/onafriq-uses-ripple-payments-to-foster-cross-border-payments/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Ripple-CEO-Brad-Garlinghouse-in-Twitter-Spat-With-VC-Over-XRP.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple CEO Brad Garlinghouse in Twitter Spat With VC Over XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Ripple-CEO-Brad-Garlinghouse-in-Twitter-Spat-With-VC-Over-XRP.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CEO-Brad-Garlinghouse-in-Twitter-Spat-With-VC-Over-XRP-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CEO-Brad-Garlinghouse-in-Twitter-Spat-With-VC-Over-XRP-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CEO-Brad-Garlinghouse-in-Twitter-Spat-With-VC-Over-XRP-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CEO-Brad-Garlinghouse-in-Twitter-Spat-With-VC-Over-XRP-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CEO-Brad-Garlinghouse-in-Twitter-Spat-With-VC-Over-XRP-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Ripple announced its alliance with leading payments fintech Onafriq at Swell, Ripple’s annual conference in Dubai. Through the alliance, Ripple aims to extend digital asset-enabled cross-border payments in Africa and several other markets.  As per Ripple’s press release, the CEO of Onafriq, Dare Okoudjou, stated that the partnership focuses on eliminating the challenges of traditional [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/onafriq-uses-ripple-payments-to-foster-cross-border-payments/\">Onafriq Uses Ripple Payments to Foster Cross-Border Payments</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]