[
  {
    "source": "Cointelegraph",
    "date": "2024-03-08T01:25:40.000Z",
    "title": " Gemini mulled forming a ‘juggernaut’ with Genesis before it went to smoke ",
    "url": "https://cointelegraph.com/news/gemini-considered-gemini-merger-before-bankruptcy-barry-silbert",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMWYzNTk3M2QtYTM3OS00OTAyLTlmYjMtMzU3MTAyN2E1ZDczLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Barry Silbert, CEO of Digital Currency Group once pitched creating a combined company with Gemini that could compete with the likes of Coinbase and FTX.</p>\n                    <p><p>Gemini co-founder Cameron Winklevoss once considered a merger with Digital Currency Group (DCG) and its cryptocurrency lending firm Genesis Global Capital (GGC) that could’ve birthed a publicly-listed “juggernaut” to compete with the likes of Coinbase and FTX.</p><p>That was, at least, a claim by DCG’s CEO Barry Silbert in a newly surfaced email to colleagues from October 2022 after a luncheon with Winklevoss — three months before Genesis <a href=\"https://cointelegraph.com/news/crypto-lender-genesis-files-for-bankruptcy\">eventually went bankrupt.</a> </p><p>The email was shared by lawyers representing DCG and Barry Silbert as part of a March 6 motion to dismiss a $3 billion fraud lawsuit filed by the Attorney General of the State of New York. The email was used to argue against allegations that Silbert knew Genesis was insolvent and believed it should be hidden from counterparties.</p><p><a href=\"https://cointelegraph.com/news/gemini-considered-gemini-merger-before-bankruptcy-barry-silbert\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-08T01:30:00.000Z",
    "title": "Shiba Inu Layer-2 Scaling Solution Shibarium Surpasses Major Milestone as $SHIB Price Soars",
    "url": "https://www.cryptoglobe.com/latest/2024/03/shiba-inu-layer-2-scaling-solution-shibarium-surpasses-major-milestone-as-shib-price-soars/",
    "description": "Shiba Inu’s layer-2 scaling solution Shibarium, meant to improve the Shiba Inu ecosystem by providing faster transactions at a lower cost, among other improvements, has recently surpassed a major milestone, having processed over 400 million transactions since launch. According to data from Shibariumscan, the layer-2 scaling solution has processed a total of 400.7 million transactions […]\n"
  }
]