[
  {
    "source": "Cointelegraph",
    "date": "2023-09-19T16:31:06.000Z",
    "title": "Latvia central bank opens to fintech with ‘Innovation Hub’",
    "url": "https://cointelegraph.com/news/latvia-central-bank-fintech-hub",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/8b6e3871-2fae-4c89-aa7a-21f20855ba72.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Bank of Latvia has been quietly stepping up its game in providing assistance to fintech projects while employing the latest emerging technologies internally. </p>\n                    <p><p>Fintech innovations and emerging technologies have swept the world, causing <a href=\"https://cointelegraph.com/news/congressman-tom-emmer-seeks-amendment-to-limit-sec-crypto-oversight\">global lawmakers to rush</a> to understand and regulate them. </p><p>While some countries <a href=\"https://cointelegraph.com/news/ripple-ceo-dont-start-crypto-company-in-us\">like the United States</a> and El Salvador have had a public relationship with adopting new technologies, others have quietly joined the game. Among these is Latvia, a small country <a href=\"https://cointelegraph.com/news/the-state-of-crypto-in-northern-europe-hostile-scandinavia-and-vibrant-baltics\">located in the Baltics</a>, neighboring Estonia and Lithuania. </p><p>Cointelegraph spoke with Marine Krasovska, the head of financial technology at Latvijas Banka (Bank of Latvia) — Latvia’s central bank — to better understand how regulators in the country are dealing with new technologies like cryptocurrencies and artificial intelligence (AI). </p><p>Unlike its neighbor Estonia, which was the first European country to provide clear regulations and guidelines for digital currencies, these assets remain unregulated in the Latvian landscape. The Latvian Personal Income Tax Act defines crypto as a capital asset subject to the general capital gains tax of 20%.</p><p>Back in 2020, one of the country’s financial regulators, the Financial and Capital Market Commission (FCMC), <a href=\"https://cointelegraph.com/news/latvian-regulators-warn-public-about-cryptocurrency-fraud\">warned the public about crypto</a> fraud — particularly given that in Latvia, crypto companies “operate in an infrastructure that is currently characterized by lower regulation than in the financial and capital markets.” </p><h2>An upcoming hub of innovation </h2><p>Since early warnings from the FCMC, Latvia has not developed new cryptocurrency regulations. However, Krasovska explained that in the last five years, the central bank, which is the primary regulator in Latvia, has been operating its Innovation Hub.</p><p>Krasovska said participation by fintech companies is not mandatory; however, the bank advises it as a “first entry point” to the Latvian market. The central bank offers this service free of charge for international companies and those originating from Latvia. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/da578479-362e-4856-b51d-ec16b931baba.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Krasovka speaks at the<strong> </strong>Global Government Fintech Lab 2022 conference. Source: Global Government Fintech</em></figcaption></figure><p>“When businesses come to the Innovation Hub and begin to describe their business model, sometimes we start to understand what companies actually need and don’t need,” she said. </p><p>She added that it’s an opportunity for businesses to talk in person with regulators to understand the business licensing needed and get risks assessed. </p><blockquote>“We always suggest for companies to bring a lawyer to disclose interpretation risks. Interpretation of legislation is a very high-level responsibility.” </blockquote><p>Within the Innovation Hub, the bank has also created a pre-licensing process. According to Krasovska, this was created to help fintech companies — particularly those dealing with digital assets — create a “package of documents” that they can receive feedback on regarding the quality. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/germany-blockchain-funding-up-3-amid-market-downturn-report\"><strong><em>Germany’s blockchain funding increases 3% amid market downturn: Report</em></strong></a></p><p>“So when the official application goes in,” she said, “the license process will be focusing on the main ideas rather than the quality of the application. This new pre-licensing began last summer.”</p><blockquote>“We want to see more innovation on the market. But we also want to see that the risks are managed in a proper way.”</blockquote><p>Krasovska said that last year, the Innovation Hub had 72 consultations with around 40% of all participants from Latvia. She commented that the hub’s data reveals increased interest from companies in “crypto and electronic money institutions services.”</p><h2>Adoption from the inside</h2><p>Along with helping businesses thrive in the Latvian fintech landscape, Krasovska said that the Latvian central bank itself is adopting new technologies to streamline its processes from the inside. </p><p>This includes moving central bank data into the cloud and adopting AI technologies like OpenAI’s popular chatbot ChatGPT.</p><blockquote>“We, as a central bank, will also start this year to integrate artificial intelligence and ChatGPT in our work. Not just not just trying to do some kind of studies as everyone is using it, but we’re starting to adapt it in terms of we have identified our needs.” </blockquote><p>She said the central bank created an internal lab two years ago, which began experimenting with different kinds of technological solutions. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/european-banking-authority-calls-for-early-adoption-of-stablecoin-standards\"><strong><em>European Banking Authority calls for early adoption of stablecoin standards</em></strong></a></p><p>She highlighted ChatGPT feasibility studies the bank has conducted, which will help it summarize large quantities of documents, such as tax documents that she called “not structured information.”</p><p>Krasovska also said the bank employs AI to help with data direction projects and supervise code. </p><h2>Synthetic data creation</h2><p>When it comes to data, the fintech executive said the Bank of Latvia is spearheading a new project in relation to synthetic data. </p><p>She said that when newcomers or tech companies developing new solutions ask for a data set to train business models, it has nothing it can legally provide. </p><p>“This year and also next year, we will be working with the database ideas from which we can create this synthetic data that is like a synthetic lottery or something along those lines,” she said. </p><blockquote>“Then companies can come and use these different types of data to understand how their tools work or don’t work before they scale the business and offer their solution to real customers.” </blockquote><p>For example, businesses may need access to a large transaction database to understand how related monitoring tools work, “so what we’re doing right now is working on this integrated database,” she said.</p><h2>Latvia and the current state of crypto</h2><p>Over the summer, a report from the Latvian central bank said that <a href=\"https://cointelegraph.com/news/crypto-asset-investment-declines-50-percent-latvia-over-past-year-central-bank\">local investments in crypto assets</a> had declined by 50% over the past year.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">&quot;The number of the people purchasing crypto-assets as well as making payments with payment cards to invest in crypto-assets in Latvia declines. <br><br>This can be explained by global developments such as the negative sentiment of investors, detected cases of fraud and cases of… <a href=\"https://t.co/uOIbJvIlsi\">pic.twitter.com/uOIbJvIlsi</a></p>&mdash; Joshua Rosenberg (@_jrosenberg) <a href=\"https://twitter.com/_jrosenberg/status/1687415212071096320?ref_src=twsrc%5Etfw\">August 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The report was based on findings from payment card usage, revealing that 4% of the population bought crypto assets in February 2023, compared to 8% in the same month of 2022. </p><p>When asked about the sentiment toward cryptocurrencies in Latvia, Krasovska pointed to the crypto market conditions in combination with slumping market trends globally: “Globally, the financial markets are the way they are right now, and of course, this is [excluding] the crypto [market].” </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-lawyer-irina-hall-of-flame/\"><strong><em>Crypto lawyer Irina Heaver on death threats, lawsuit predictions: Hall of Flame</em></strong></a></p><p>Aside from the rocky conditions for the crypto community brought on by the lingering bear market, <a href=\"https://cointelegraph.com/news/crypto-bill-us-nine-senators-back-elisabeth-warren\">regulatory difficulties in major markets</a> have caused investor sentiment to become less optimistic. </p><p>However, Krasovska pointed toward the European Union’s adoption and implementation of the Markets in Crypto-Assets (MiCA) legislation as something the central bank can lean on. </p><blockquote>“With the adoption of MiCA, we can ensure very high standards for financial services.”</blockquote><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/latvia-central-bank-fintech-hub&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-19T16:30:48.000Z",
    "title": "Indian state governments spur blockchain adoption in public administration",
    "url": "https://cointelegraph.com/news/indian-state-governments-spur-blockchain-adoption-in-public-administration",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/57b22afe-2378-4c27-b7c5-7a5d8cf5dbc6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Numerous initiatives by local and state governments in India — from data management systems to verifiable certificate issuances — currently use blockchain technology. </p>\n                    <p><p>Ever since Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) popularized blockchain technology worldwide, the tech has found its way into myriad processes, from finance to public administration.</p><p>What started as a flex statement for early adopters has now become a way of revamping legacy systems and improving immutability, transparency and decentralization.</p><p>Despite its proven real-world use cases, most government agencies continue to take a cautious approach to adopting and infusing blockchain into their paper-based processes, given its predominant link to the cryptocurrency ecosystem. </p><p>However, a change of heart is underway as emerging economies see blockchain as a rare opportunity to establish a trust-based system for society.</p><p>While still reluctant to legitimize cryptocurrencies fully, India has generally accepted blockchain technology. </p><p>Numerous initiatives by local and state governments in India — ranging from data management systems to verifiable certificate issuances — currently use blockchain technology at their core.</p><p>India’s expedited blockchain adoption is supported by an active developer and startup community, which builds custom solutions to tackle specific use cases. </p><p>Cointelegraph’s pursuit to decipher India’s affinity for blockchain led to a conversation with Ankur Rakhi Sinha, the co-founder and CEO of Airchains, a Web3 startup focused on a middleware software-as-a-service (SaaS) platform. </p><p>Speaking to Cointelegraph, Ankur explained India’s massive appetite for blockchain and how elected leaders have been driving the change.</p><p><strong>Cointelegraph: What is the primary driver behind India’s blockchain adoption spree?</strong></p><p><strong>Ankur Rakhi Sinha:</strong> The driving force behind India’s blockchain adoption is the multitude of benefits it offers to enterprises and institutions. Within their ecosystems, organizations recognize the immense benefits of incorporating blockchain technology. It addresses various challenges at different levels, such as enhancing transparency, traceability and establishing trust.</p><p>These factors contribute to the growing interest and widespread adoption of blockchain within India.</p><p>India is one of the <a href=\"https://www.grandviewresearch.com/industry-analysis/blockchain-technology-market\" target=\"_blank\" rel=\"noopener nofollow\">fastest-growing</a> blockchain markets globally, with over<a href=\"https://economictimes.indiatimes.com/news/how-to/how-to-grow-business-through-blockchain-technology/articleshow/91906404.cms\" target=\"_blank\" rel=\"noopener nofollow\"> 56%</a> of Indian businesses reporting an inclination toward adopting blockchain technology. With a developer base of a whopping<a href=\"https://news.abplive.com/technology/github-crosses-100-million-developers-globally-over-10-million-in-india-alone-1578254#:~:text=%22In%20India%20alone%2C%20more%20than,GitHub%20developer%20population%20by%202025.\" target=\"_blank\" rel=\"noopener nofollow\"> 10 million</a>, the Indian talent pool has been recognized globally by leading Web3 firms with the aim of fostering Web3 innovation and growth. </p><p><strong>CT: In your discussions with the government agencies, are there any talks of crypto adoption?</strong></p><p><strong>ARS:</strong> No, currently, regulatory clearances surrounding cryptocurrency adoption are still uncertain. However, government agencies are actively exploring various avenues and seeking improved regulations. They are open to the idea and are diligently working toward creating a conducive environment for cryptocurrency adoption.</p><p><strong>CT: Can you share any data and/or use cases that show improvements from older systems?</strong></p><p><strong>ARS:</strong> Yes, our recent collaboration with the New Town Kolkata Development Authority (NKDA) showcases the real-life adoption of blockchain. With a vast expanse of 27,000 acres of land and a staggering 50,000 NFTs [nonfungible tokens] representing one million ownerships, the NKDA’s adoption of NFTs for land mutation [the transfer of property titles] has revolutionized the traditional approach, and these initiatives demonstrate the growing recognition and commitment to harnessing the potential of blockchain to drive innovation and efficiency across various sectors.</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/latvia-central-bank-fintech-hub\">Latvia central bank opens to fintech with ‘Innovation Hub’</a></em></strong></p><p><strong>CT: Is India betting big on blockchain? Are there any government initiatives that help drive this cause? </strong></p><p><strong>ARS:</strong> Yes, India is definitely betting big on blockchain. Various government agencies and bodies within India are actively seeking to collaborate with blockchain solutions. While there is yet to be a high-level blockchain initiative from the government of India thus far, there is a strong demand from government entities that Airchains is actively addressing. One of the profound use cases of blockchain adoption includes the remarkable first-ever NFT-based land mutation in India.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/8d2c67ef-fe7c-4fcd-96c4-5f9d966cb37f.jpg\"  /></figure><p>Additionally, in January 2020, NITI Aayog’s two-part report titled “Blockchain: The India Strategy” made it apparent that while regulations regarding cryptocurrencies and other digital assets are under consideration, the government is significantly aware of the promise of core blockchain technology to transform various systems. </p><p>Several Indian government bodies are supportive of blockchain technology adoption and have collaborated with Airchains to incorporate novel blockchain-based systems ensuring accountability and security. The Raigarh District Authority has collaborated with us to create a blockchain-based tree plantation monitoring system for the betterment of CSR [corporate social responsibility] initiatives, whereas the Firozabad Police Department worked with us to create a blockchain complaint management system to prevent tampering of reports.</p><p><strong>CT: What type of understanding do Indian officials have about blockchain and associated tech?</strong></p><p><strong>ARS:</strong> Indian government agencies, state governments and bureaucrats possess a profound understanding of blockchain and Web3 technologies. They are well-versed in the latest developments and trends within the blockchain space, including liquidity, private chains and zero-knowledge rollups. [...] Their comprehension of blockchain extends beyond surface-level knowledge, as many officials have in-depth insights into how the technology functions. While some officials contemplate how blockchain should ideally operate, others are actively exploring ways to leverage this technology to address their unique challenges.</p><p><strong>CT: What is the role of blockchain in India’s overall growth?</strong></p><p><strong>ARS:</strong> Blockchain technology is poised to play a huge role in India’s future growth, propelling the nation to a prominent position on the global stage. The increasing number of developers, enterprises and institutional use cases emerging in India underscores the significant growth potential of blockchain in the country. As blockchain adoption continues to expand, it is expected to drive innovation, foster economic development and create new opportunities across various sectors.</p><p>Another key push to India’s growth has been the entry of various global Web3 players into the Indian developer market. India is home to 450+ Web3 startups and has received over $1.5 billion in investments between 2021 and 2022, <a href=\"https://community.nasscom.in/communities/productstartups/india-web3-startup-landscape-emerging-technology-leadership-frontier\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to a 2022 NASSCOM Indian Web3 Landscape Analysis report. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/9c41da11-8433-4480-9386-a9251f907b53.jpg\"  /></figure><p>Additionally, the report also highlighted that 11% of global Web3 talent is in India, making it third worldwide. Blockchain in India has the potential to contribute significantly due to the vast developer talent and the active Web3 community present in the country.</p><p><strong>CT: We have seen numerous instances of state-wide blockchain implementations over the past three years. Are there any nationwide implementations of blockchain in India or any such plans for the future?</strong></p><p><strong>ARS: </strong>Yes, there have been significant discussions at various levels regarding nationwide blockchain implementations in India. For instance, organizations such as the National Payments Corporation of India and the Unified Payments Interface are exploring the potential of blockchain technology and conducting tests. Public sector banks are also actively experimenting with blockchain to determine how they can harness its capabilities. </p><p>These initiatives indicate a strong likelihood of nationwide blockchain use cases emerging in the near future. Airchains recently executed a state-wise use case with NKDA, and we are currently working on multiple state-level use cases that have the potential to impact the nation as a whole.</p><p><strong>CT: How do you convince a government body to accept a new system? </strong> </p><p><strong>ARS:</strong> Government [...] bodies are actively interested in adopting blockchain solutions to address their specific challenges. However, they emphasize the importance of operating within regulatory frameworks. Demonstrating transparency, efficiency and improved outcomes is key to gaining government support in the development journey. </p><p><strong>CT: Which countries are ahead of India when it comes to wide-scale blockchain adoption? What measures must a country take to expedite blockchain adoption?</strong></p><p><strong>ARS: </strong>There are several countries in Central America that are actively pursuing wide-scale blockchain adoption within their ecosystems. India, being a large nation, is actively striving to accelerate the adoption of blockchain technology through numerous use cases. The country has established itself as a center of excellence in blockchain, with multiple agencies exploring various applications. </p><p>To expedite progress, implementing clear regulations is crucial. This includes defining guidelines for blockchain implementation and determining permissible use cases, which will facilitate faster execution and broader adoption. </p><p><strong>CT: Can home-grown blockchain technology be used in off-shore use cases? </strong></p><p><strong>ARS: </strong>Many projects originating from India, such as Polygon and various layer-1 and layer-2 solutions, have gained global recognition. Airchains has also successfully collaborated with government agencies globally, including in Central America and Europe. Currently, there are several offshore projects in the pipeline for Airchains, scheduled to be completed within the next six to seven months. Utilizing home-grown blockchain technology for offshore use cases is indeed a goal being pursued. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/dao-hyped-voting-decentralization/\">Are DAOs overhyped and unworkable? Lessons from the front lines</a></em></strong></p><p><strong>CT: How does funding work? What are your investors looking for?</strong></p><p><strong>ARS:</strong> Investors primarily seek scalability and feasibility in blockchain adoption, among other key factors. Funding in the blockchain space typically involves investors who believe in the potential of the technology and its ability to bring about transformative changes.</p><p><strong>CT: What is your advice to fellow blockchain entrepreneurs in India?</strong></p><p><strong>ARS: </strong>My advice [...] is to focus on building a wide range of use cases and driving blockchain adoption to a higher scale. By creating innovative solutions and demonstrating the real-world benefits of blockchain technology, we can accelerate its adoption and drive positive change in various industries.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/indian-state-governments-spur-blockchain-adoption-in-public-administration&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-09-19T16:30:48.000Z",
    "title": "Indian state governments spur blockchain adoption in public administration",
    "url": "https://cointelegraph.com/news/indian-state-governments-spur-blockchain-adoption-in-public-administration",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/57b22afe-2378-4c27-b7c5-7a5d8cf5dbc6.jpg\"></p><p>Numerous initiatives by local and state governments in India — from data management systems to verifiable certificate issuances — currently use blockchain technology. </p>\n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-19T16:20:50.000Z",
    "title": "Polygon (MATIC) Introduced First Improvement Proposals, Uniswap (UNI) Avoids Suit, Tradecurve Markets (TCRV) To Surge by 20% Next Week",
    "url": "https://www.cryptopolitan.com/polygon-matic-introduced-first-improvement-proposals-uniswap-uni-avoids-suit-tradecurve-markets-tcrv-to-surge-by-20-next-week/",
    "description": "The cryptocurrency market is in a constant state of evolution, with developments happening rapidly. This article dives into the latest news surrounding Polygon (MATIC), Uniswap (UNI), and Tradecurve Markets (TCRV). From the introduction of improvement proposals to legal victories and potential surges, the crypto space is as dynamic as ever. &#62;&#62;Register For The Tradecurve Markets ... <a title=\"Polygon (MATIC) Introduced First Improvement Proposals, Uniswap (UNI) Avoids Suit, Tradecurve Markets (TCRV) To Surge by 20% Next Week\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-matic-introduced-first-improvement-proposals-uniswap-uni-avoids-suit-tradecurve-markets-tcrv-to-surge-by-20-next-week/\" aria-label=\"More on Polygon (MATIC) Introduced First Improvement Proposals, Uniswap (UNI) Avoids Suit, Tradecurve Markets (TCRV) To Surge by 20% Next Week\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-19T16:18:52.000Z",
    "title": "Bankrupt FTX crypto exchange sues founder’s parents for millions in alleged fraud",
    "url": "https://www.cryptopolitan.com/ftx-crypto-exchange-sues-founders-parents-for-millions-in-alleged-fraud/",
    "description": "Bankrupt cryptocurrency exchange FTX filed a lawsuit against Joseph Bankman and Barbara Fried, the parents of its founder and former CEO, Sam Bankman-Fried. The lawsuit, filed on Monday, accuses the Stanford Law School professors of fraudulently transferring and misappropriating millions of dollars from the company. The legal action seeks damages, the return of property, and ... <a title=\"Bankrupt FTX crypto exchange sues founder&#8217;s parents for millions in alleged fraud\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ftx-crypto-exchange-sues-founders-parents-for-millions-in-alleged-fraud/\" aria-label=\"More on Bankrupt FTX crypto exchange sues founder&#8217;s parents for millions in alleged fraud\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-19T16:17:05.000Z",
    "title": "Blockchain Economy Dubai Summit 2023: Just Two Weeks Away and Buzzing with Anticipation",
    "url": "https://www.cryptopolitan.com/blockchain-economy-dubai-summit-2023-just-two-weeks-away-and-buzzing-with-anticipation/",
    "description": "Dubai, UAE —The Blockchain Economy Dubai Summit is generating palpable excitement within the blockchain and crypto communities, with only two weeks remaining until the event. Scheduled for October 4-5, 2023, at the Le Meridien Dubai Hotel &#38; Conference Center, this prestigious event gathers over 3,000 blockchain entrepreneurs, crypto enthusiasts, and industry leaders from 85 countries. ... <a title=\"Blockchain Economy Dubai Summit 2023: Just Two Weeks Away and Buzzing with Anticipation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockchain-economy-dubai-summit-2023-just-two-weeks-away-and-buzzing-with-anticipation/\" aria-label=\"More on Blockchain Economy Dubai Summit 2023: Just Two Weeks Away and Buzzing with Anticipation\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-19T16:19:13.000Z",
    "title": "Investing in crypto: guide to smarter portfolio rebalancing",
    "url": "https://crypto.news/investing-in-crypto-guide-to-smarter-portfolio-rebalancing/",
    "description": "Discover the practice of crypto rebalancing to maintain your initial asset allocation even amidst market fluctuations."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-19T16:30:22.000Z",
    "title": "Ripple News: Use XRP to Book and Pay for Your Next Flight, Cover Your Power Bill, or Reserve Your Next Hotel – The Power of the Ecosystem Revealed",
    "url": "https://www.crypto-news-flash.com/ripple-news-use-xrp-to-book-and-pay-for-your-next-flight-cover-your-power-bill-or-reserve-your-next-hotel-the-power-of-the-ecosystem-revealed/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-news-use-xrp-to-book-and-pay-for-your-next-flight-cover-your-power-bill-or-reserve-your-next-hotel-the-power-of-the-ecosystem-revealed",
    "description": "<img width=\"1280\" height=\"960\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-768x576.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Ripple&#8217;s XRP is not just for cross-border payments; it&#8217;s being used to instantly book private jets. TapJets highlights the &#8220;Friday Night Problem&#8221; and offers a solution with XRP payments. XRP Takes Flight in the Luxury Travel Sector Ripple&#8217;s cryptocurrency, XRP, is primarily known for its role in facilitating rapid and cost-efficient cross-border payments on the [...]"
  }
]