[
  {
    "source": "Decrypt",
    "date": "2023-06-05T19:21:48.000Z",
    "title": "FBI Warns of AI Deepfake Extortion Scams",
    "url": "https://decrypt.co/143479/fbi-warning-ai-extortion-sextortion-deepfake-scams",
    "description": "The agency says criminals are turning photos and videos into explicit content to extort victims."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-05T19:31:35.000Z",
    "title": "Blue-chip collaterals help stabilize NFT lending: Paraspace",
    "url": "https://cointelegraph.com/news/blue-chip-collaterals-help-stabilize-nft-lending-paraspace",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/00e3b24e-e7f7-4e74-a393-50c10a651350.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>\"We only support blue chip NFT to reduce the risks,\" said Paraspace developers. </p>\n                    <p><p>According to a recent report published by nonfungible token money market protocol Paraspace and multichain wallet BitKeep, the current amount of NFT borrowing and lending, or NFTFi loans, has surpassed $430 million across 43,521 borrowers. The highest proportion of collaterals comprised the most popular NFT collections, such as Wrapped CryptoPunks, Bored Ape Yacht Club, and Mutant Ape Yacht Club.</p><p>Researchers at Paraspace and BitKeep said that NFTFi added $25 million in outstanding loans from January to March. Also contributing was the introduction of a <a href=\"https://cointelegraph.com/news/blur-nft-lending-surpasses-16m-in-loans-led-by-matchi-big-brother\">digital collectible lending protocol</a> by NFT marketplace Blur, which surpassed $16 million in loans one day after its launch, led by Taiwanese celebrity Machi Big Brother. Yet, the real impetus was the invention of Bitcoin Ordinals, which boosted total NFT market transaction volume to $1.5 billion in March but shrunk to $330 million in May. Despite the growth, however, Paraspace and BitKeep researchers warned that liquidity concerns remain a constant theme in the sector:</p><blockquote>\"The lack of liquidity in NFT trading is mainly caused by limited user numbers, difficulties in pricing, and high NFT prices. We thus observe two extreme scenarios where the TOP 10 NFTs maintain a certain level of liquidity with little fluctuation between projects, while other NFTs are sold at discounts.\"</blockquote><p>In a statement to Cointelegraph, Paraspace NFT developers explained that despite accumulating NFT loans of over $280 million, the protocol had just 16 NFT liquidations with no bad debt since its began operations last year. Developers say it owes its success to rules allowing only the most-established and highly liquid, or blue-chip NFTs, to be pledged as collateral. The entry threshold for blue-chip NFTs is often very high, with an average price range between $11,000 to $120,000.</p><blockquote>Typically, users can only borrow ETH against a single NFT. For us, users can use a basket of NFTs + ERC20 (3 BAYC + 1 AZUKI + 2 BTC) to borrow collection assets (say 10 ETH + 10 USDT + 100 APE). This gives our platform an opportunity to aggregate liquidity into one place and thus increase the capital efficiency for liquidity</blockquote><p>Nevertheless, both developers at Paraspace and BitKeep cautioned that the NFTs are a new market \"lacking historical data and universally recognized valuation analysis methods, resulting in pricing difficulties.\" As a result, different perception of rarity based on subjective views has led to large price variances even within the same NFT series. On the market's future outlook, developers commented:</p><blockquote>\"High-quality NFTs often have strong community consensus, team background, and distinctive artistic styles. However, the barriers for ordinary users to participate in blue-chip or popular NFTs are increasing. Nowadays, some solutions have emerged, such as NFT fractionalization, NFT staking, and the rise of NFT liquidity platforms.\"</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Over the past two days, <a href=\"https://twitter.com/ParaSpace_NFT?ref_src=twsrc%5Etfw\">@ParaSpace_NFT</a> welcomed back 90 supporters who rediscovered the magic.  Additionally, we witnessed an increase in TVL of $5.2M.<br><br>Thank you all for your continued support and trust. Together, we&#39;re building something incredible.<br><br>For more info:… <a href=\"https://t.co/bxlMuibuST\">pic.twitter.com/bxlMuibuST</a></p>&mdash; ParaSpace (@ParaSpace_NFT) <a href=\"https://twitter.com/ParaSpace_NFT/status/1661243868778762242?ref_src=twsrc%5Etfw\">May 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/web3-gamer-gta-6-crypto-doctor-who-in-the-sandbox-thai-tourist-nfts-review/\">Web3 Gamer: GTA 6 crypto rumors, Dr Who/Sandbox, Thai tourist NFTs review</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-05T19:19:37.000Z",
    "title": "Do Kwon out on bail under house arrest after successful appeal",
    "url": "https://cryptoslate.com/do-kwon-out-on-bail-under-house-arrest-after-successful-appeal/",
    "description": "<p>Terra LUNA co-founder Do Kwon successfully appealed against the prosecution&#8217;s request to keep him in custody, and is out on bail as of June 5. The Podriga Basic court overseeing the case granted the bail request and accepted the initial amount of $400,000. The high court had previously annulled the bail on May 18 after [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/do-kwon-out-on-bail-under-house-arrest-after-successful-appeal/\">Do Kwon out on bail under house arrest after successful appeal</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T19:17:16.000Z",
    "title": "Hedge funds shift focus to US stocks, dump European",
    "url": "https://www.cryptopolitan.com/hedge-funds-focus-on-us-stocks-dump-european/",
    "description": "Fueled by positive economic figures and promising investment opportunities, hedge funds are noticeably moving their attention away from European equities, turning instead to the alluring American and Japanese stock markets. Reports from major banking players including JP Morgan, Morgan Stanley, and Goldman Sachs have highlighted this trend, suggesting a potential shift in investment strategies and ... <a title=\"Hedge funds shift focus to US stocks, dump European\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hedge-funds-focus-on-us-stocks-dump-european/\" aria-label=\"More on Hedge funds shift focus to US stocks, dump European\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-05T19:16:30.000Z",
    "title": "Binance sees net outflows of $69 million in one hour",
    "url": "https://crypto.news/binance-sees-net-outflows-of-69-million-in-one-hour/",
    "description": "Amid the recent legal action taken by the SEC against Binance and its CEO Changpeng Zhao, cryptocurrency traders are swiftly withdrawing their funds from the crypto exchange."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-05T19:13:02.000Z",
    "title": "Ethereum gas fees rising amid meme coin hype ",
    "url": "https://crypto.news/ethereum-gas-fees-rising-amid-meme-coin-hype/",
    "description": "Ethereum gas fees are rising amid the meme coin hype led by pepe coin (PEPE). The token is available for trading on Binance"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-05T19:37:54.000Z",
    "title": "Cardano Flexes Muscles with Major Integration and Billion-Dollar Whale Movements",
    "url": "https://www.crypto-news-flash.com/cardano-flexes-muscles-with-major-integration-and-billion-dollar-whale-movements/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-flexes-muscles-with-major-integration-and-billion-dollar-whale-movements",
    "description": "<p>Cardano has witnessed a surge in DeFi following the integration of VyFinance DEX protocol into the MuesliSwap DEX Aggregator. ADA whales&#8217; participation is on the rise with on-chain metrics showing a rise in buying activity. Cardano continues to make strides in the market with the latest report showing a surge in DeFi activity as well [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/cardano-flexes-muscles-with-major-integration-and-billion-dollar-whale-movements/\">Cardano Flexes Muscles with Major Integration and Billion-Dollar Whale Movements</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]