[
  {
    "source": "Cointelegraph",
    "date": "2023-08-01T20:45:00.000Z",
    "title": "3AC co-founder rejects jurisdiction of bankruptcy court, claiming he renounced US citizenship",
    "url": "https://cointelegraph.com/news/3ac-cofounder-rejects-jurisdiction-bankruptcy-court-renounced-us-citizenship",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/84748272-7226-4e24-a2c6-72c07a33096c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>As Singapore does not allow dual nationality, 3AC co-founder Kyle Davies said he chose to renounce his U.S. citizenship after getting married and receiving permanent residency.</p>\n                    <p><p>Kyle Davies, the co-founder of bankrupt crypto hedge fund Three Arrows Capital (3AC), has submitted documentation to court claiming he is fully a citizen of Singapore and not the United States.</p><p>In an Aug. 1 filing with U.S. Bankruptcy Court for the Southern District of New York, Davies provided notarized and Apostilled copies of the form applying for the renunciation of his U.S. citizenship on Dec. 15, 2020. He claimed to have received citizenship to Singapore following the issuance of a passport in January 2021 and was not “subjecting [him]self to, or accepting the jurisdiction of, the Courts in the United States.”</p><p>Court filings showed Davies renounced his citizenship at the U.S. Embassy in Singapore, citing his decision to live in the country long-term. He said he got married in 2017 to a Singaporean national, gained permanent residency, and has two children in the country. As Singapore does not allow dual nationality, he chose to renounce his U.S. citizenship.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/8d7a7b6e-0015-4550-bedd-8f5096f46cc1.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Notarized and Apostilled documentation of Kyle Davies renouncing his U.S. citizenship in December 2020. Source: U.S. Bankruptcy Court for the Southern District of New York</em></figcaption></figure><p>The filing from Davies followed a subpoena issued at the request of 3AC liquidators aimed at gaining information on the collapse of the crypto hedge fund. Both Davies and 3AC co-founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/su-zhu-and-alex-mashinsky\">Su Zhu</a> were subpoenaed on Twitter — now X — in January due to their physical whereabouts being unknown, but parties have <a href=\"https://cointelegraph.com/news/3ac-liquidators-file-motion-hold-kyle-davies-in-contempt\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/3ac-liquidators-file-motion-hold-kyle-davies-in-contempt/amp\">argued Davies should be held</a> in contempt of court after he ignored the order. Zhu, a Singaporean national, would likely not be subject to the subpoena if residing outside the United States.</p><p>“Davies has not been, and cannot be, validly served with process as a non-party in this case because he has not been a United States citizen or resident since well before this case was commenced,” said an Aug. 1 filing. “Since Davies has not been validly served, the Court does not have personal jurisdiction over him. The Service Order and Compel Order were premised on the incorrect presumption that Davies is a U.S. citizen, and therefore they should be vacated.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/kyle-davies-donate-future-opnx-earnings-3ac-creditors\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/kyle-davies-donate-future-opnx-earnings-3ac-creditors/amp\"><strong><em>Kyle Davies to donate future OPNX earnings to 3AC creditors for ‘karma’</em></strong></a></p><p>The whereabouts of both Zhu and Davies following the bankruptcy filing for 3AC in July 2022 has been the subject of mass speculation and debate among crypto users affected by the market crash. Lawyers have appeared before the bankruptcy court on Davies’ behalf, but the revelation of his lack of U.S. citizenship could complicate legal proceedings. The bankruptcy court will hold a hearing on Aug. 8 to discuss the matter.</p><p>Liquidators behind 3AC are <a href=\"https://cointelegraph.com/news/three-arrows-liquidators-recoup-losses-from-founders\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/three-arrows-liquidators-recoup-losses-from-founders/amp\">seeking to recover</a> roughly $1.3 billion in funds from Zhu and Davies, with the firm reportedly owing creditors $3.5 billion. Amid online ire surrounding the events leading to the collapse of 3AC, Zhu and Davies <a href=\"https://cointelegraph.com/news/former-three-arrows-capital-founders-launch-new-vc-fund\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/former-three-arrows-capital-founders-launch-new-vc-fund/amp\">launched a platform</a> for trading claims against bankrupt crypto firms called Open Exchange. Sotheby’s has also <a href=\"https://cointelegraph.com/news/sotheby-s-will-auction-off-part-of-3ac-s-digital-art-collection\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sotheby-s-will-auction-off-part-of-3ac-s-digital-art-collection/amp\">auctioned off several pieces</a> from a nonfungible token collection formerly owned by the 3AC founders.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/3ac-cooks-up-a-storm-bitcoin-miner-surges-360-bruce-lee-nfts-dive-asia-express/\"><strong><em>3AC cooks up a storm, Bitcoin miner surges 360%, Bruce Lee NFTs dive: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-08-01T21:08:43.000Z",
    "title": "GameStop to withdraw crypto wallets amid ‘regulatory uncertainty’",
    "url": "https://crypto.news/gamestop-to-withdraw-crypto-wallets-amid-regulatory-uncertainty/",
    "description": "GameStop Corp. has announced the discontinuation of its cryptocurrency wallets due to &#8220;regulatory uncertainty.&#8221; On Nov. 1, the company will withdraw its support for iOS and Chrome Extension wallets, which have allowed users to manage cryptocurrencies and non-fungible tokens, and&#8230;"
  }
]