[
  {
    "source": "Decrypt",
    "date": "2023-10-16T15:59:16.000Z",
    "title": "Nintendo 64 to Get 4K Upgrade in 2024 With New Analogue Console",
    "url": "https://decrypt.co/201830/nintendo-64-gets-4k-upgrade-2024-new-analogue-console",
    "description": "The Analogue 3D is an aftermarket console that can play original Nintendo 64 cartridges in 4K with Bluetooth wireless controllers."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-16T15:49:03.000Z",
    "title": "Nishad Singh testifies on Sam Bankman-Fried's 'excessive' investments through Alameda",
    "url": "https://cointelegraph.com/news/nishad-singh-testifies-excessive-alameda-investments",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/cee97cc7-13f4-42b2-a779-8884081a0a75.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The former FTX engineering director reportedly testified that SBF would \"unilaterally spend Alameda's money” and was “ultimately” in charge of the firm rather than Caroline Ellison.</p>\n                    <p><p>Former FTX engineering director Nishad Singh reportedly told a New York courtroom that former CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam “SBF” Bankman-Fried</a> had a habit of deciding on purchases through Alameda Research by himself.</p><p>According to reports from SBF’s criminal trial on Oct. 16, Singh <a href=\"https://twitter.com/innercitypress/status/1713925764117139551\" target=\"_blank\" rel=\"noopener nofollow\">said</a> while Caroline Ellison and Sam Trabucco led Alameda, Bankman-Fried was “ultimately” in charge of the company. The former engineering director reportedly testified that “SBF would unilaterally spend Alameda's money” despite his supposedly separate role at FTX, also threatening to fire Ellison.</p><p>“I learned of spending [at Alameda] after the fact,” said Singh according to reports. ”I'd complain about the excess and flashiness which I found different than what we were building the company for. [SBF would] say I didn't understand, he was out there interacting with people. I thought we were fleeced for $20 million, he said I was sowing doubt.”</p><p>Singh added:</p><blockquote>“Sam is a formidable character. I came to distrust him.”</blockquote><p>The former engineering director reportedly <a href=\"https://cointelegraph.com/news/prosecutors-say-sam-bankman-fried-500m-anthropic-stake-irrelevant\">cited investments in artificial intelligence startup Anthropic</a> and K5 Global, the investment firm linked to high profile figures including former United States Secretary of State Hillary Clinton and Hollywood celebrities. According to Singh, SBF ordered him and former chief technology officer Gary Wang to go <a href=\"https://cointelegraph.com/news/ftx-claw-700-million-sam-bankman-fried-friend-investment-firm\">ahead with a $1-billion investment</a> in K5 Global co-owners Michael Kives and Bryan Baum’s venture capital firm.</p><p>“I asked that it be done with Sam's money and not FTX's money,” said Singh according to reports.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Subscribe to our ‘1 Minute Letter’ NOW for daily deep-dives straight to your inbox! ⚖️ Be the first to know every twist and turn in the Sam Bankman-Fried case! Subscribe now: <a href=\"https://t.co/jQOIYUv6IW\">https://t.co/jQOIYUv6IW</a>  <a href=\"https://twitter.com/hashtag/SBF?src=hash&amp;ref_src=twsrc%5Etfw\">#SBF</a> <a href=\"https://t.co/gp7zJu5sgy\">pic.twitter.com/gp7zJu5sgy</a></p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1709911708049772942?ref_src=twsrc%5Etfw\">October 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Singh’s testimony came on the ninth day of Bankman-Fried’s criminal trial, which kicked off in New York on Oct. 3. Members of the jury have <a href=\"https://cointelegraph.com/news/changpeng-zhao-tweet-ftx-collapse-caroline-ellison\">already heard from Caroline Ellison</a> and Gary Wang. Ellison, Wang, Singh, and former FTX Digital Markets co-CEO Ryan Salame pleaded guilty to fraud charges related to Alameda using FTX funds for investments without users’ consent. Salame is not expected to testify in the trial, and it was unclear if the defense team intended to put SBF on the stand.</p><p>Prior to Singh, prosecutors called on FTX user Tareq Morad on Oct. 16 to speak on his understanding of how the crypto exchange planned to use his deposits and his perception of Bankman-Fried influenced his decision to invest with the firm. Morad reportedly testified that amid reports of <a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-removes-assets-are-fine-flood-from-twitter\">withdrawal issues at FTX</a> in November 2022, he believed SBF’s “assets are fine” tweet.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-requests-adderall-ftx-founder-fraud-trial\"><strong><em>Sam Bankman-Fried needs more Adderall to focus during trial, say lawyers</em></strong></a></p><p>Bankman-Fried’s criminal trial is expected to run through November, following which he will likely enter another courtroom in March 2024 to face similar charges. The former FTX CEO has pleaded not guilty to all 12 counts of his indictment. </p><p>So far in court, Ellison, Wang, and Singh all admitted to committing crimes with Bankman-Fried. Ellison testified she provided fraudulent documents and made misleading statements concerning Alameda using FTX funds, and Wang <a href=\"https://cointelegraph.com/news/alameda-research-withdraw-unlimited-funds-gary-wang\">said those in charge</a> “allowed Alameda to withdraw unlimited funds”.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-16T16:02:32.000Z",
    "title": "Hottest DeFi Coins To Buy For Massive Gains in 2024 – Tron, Tradecurve Markets, VeChain",
    "url": "https://cryptodaily.co.uk/2023/10/hottest-defi-coins-to-buy-for-massive-gains-in-2024-tron-tradecurve-markets-vechain",
    "description": "The DeFi sector has seen intense growth and innovation over the past months. Three coins have caught the attention of investors and experts among the plethora of coins. The tokens are Tron, VeChain, and Tradecurve Markets. According to experts, these tokens will show bullish movements in Q1 2024."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-16T15:54:37.000Z",
    "title": "Three Crypto Giants To Watch Out for More Gains In 2023 – Dogecoin, Ethereum, and Everlodge",
    "url": "https://cryptodaily.co.uk/2023/10/three-crypto-giants-to-watch-out-for-more-gains-in-2023-dogecoin-ethereum-and-everlodge",
    "description": "While there are several digital currencies in the crypto sector, only a few of them have the potential to give huge gains. Meanwhile, analysts have picked three crypto giants to watch out for in 2023. They are Dogecoin, Ethereum, and Everlodge. According to analysts, these cryptos can give huge gains in 2023."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-16T16:07:43.000Z",
    "title": "Biggest Movers: BCH, SOL Big Gainers Following Cointelegraph’s ‘Inaccurate’ Tweet",
    "url": "https://news.bitcoin.com/biggest-movers-bch-sol-big-gainers-following-cointelegraphs-inaccurate-tweet/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2145497919-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BCH, SOL Big Gainers, Following Cointelegraph’s ‘Inaccurate’ Tweet\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2145497919-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2145497919-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2145497919-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2145497919-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2145497919-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2145497919-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2145497919.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin cash was a huge gainer on Monday, as the cryptocurrency rallied by as much as 14% in today&#x2019;s session. The surge comes after Cointelegraph falsely suggested that Blackrock&#x2019;s bitcoin ETF was approved by the SEC. An apology has since been issued, following the mistaken report. Solana also hit a multi-week high on the news. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-16T16:04:34.000Z",
    "title": "Unveiling the Unsettling World of AI Relationship Analysis: Texts From My Ex",
    "url": "https://www.cryptopolitan.com/unsettling-world-of-ai-relationship-analysis/",
    "description": "In the era of technological advancement, it seems as though nothing is beyond the reach of artificial intelligence. A new service named &#8220;Texts From My Ex&#8221; is making waves, offering a controversial way to analyze your past relationships through the lens of AI. While the concept may appear intriguing, it raises critical questions about consent, ... <a title=\"Unveiling the Unsettling World of AI Relationship Analysis: Texts From My Ex\" class=\"read-more\" href=\"https://www.cryptopolitan.com/unsettling-world-of-ai-relationship-analysis/\" aria-label=\"More on Unveiling the Unsettling World of AI Relationship Analysis: Texts From My Ex\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-16T15:55:36.000Z",
    "title": "Meta Admits Training AI with Users’ Posts Without Consent",
    "url": "https://www.cryptopolitan.com/meta-admits-training-ai-with-users-posts/",
    "description": "In a recent revelation, Meta, the parent company of Facebook and Instagram, has admitted to training its internal artificial intelligence (AI) system, Meta AI, using public posts from users on both platforms without their knowledge or consent. This revelation has raised concerns over privacy breaches and the potential for misuse of user-generated content. Meta AI&#8217;s ... <a title=\"Meta Admits Training AI with Users&#8217; Posts Without Consent\" class=\"read-more\" href=\"https://www.cryptopolitan.com/meta-admits-training-ai-with-users-posts/\" aria-label=\"More on Meta Admits Training AI with Users&#8217; Posts Without Consent\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-16T15:48:59.000Z",
    "title": "Grayscale GBTC discount falls to 16% as SEC misses ETF appeal window",
    "url": "https://www.cryptopolitan.com/grayscale-gbtc-discount-falls-to-16-percent/",
    "description": "The evolving world of crypto is realizing new investment opportunities. Grayscale&#160; Bitcoin Trust (GBTC) is among the favored firms for traditional investors seeking to invest in digital assets. Recent events in the digital market have shown that GBTC&#8217;s discount to its net asset value (NAV) has reduced by close to 16%.&#160; The discount fall comes ... <a title=\"Grayscale GBTC discount falls to 16% as SEC misses ETF appeal window\" class=\"read-more\" href=\"https://www.cryptopolitan.com/grayscale-gbtc-discount-falls-to-16-percent/\" aria-label=\"More on Grayscale GBTC discount falls to 16% as SEC misses ETF appeal window\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-16T15:48:54.000Z",
    "title": "Abu Dhabi Launches World’s Largest Autonomous Racing League",
    "url": "https://www.cryptopolitan.com/abu-dhabi-launches-autonomous-racing-league/",
    "description": "In a significant stride towards promoting autonomous driving technology, Abu Dhabi has officially unveiled the Abu Dhabi Autonomous Racing League (A2RL), heralded as the world&#8217;s largest racing league for self-driving cars powered by artificial intelligence (AI). The groundbreaking event is set to take place on April 28, 2024, at the renowned Yas Marina Circuit. With ... <a title=\"Abu Dhabi Launches World&#8217;s Largest Autonomous Racing League\" class=\"read-more\" href=\"https://www.cryptopolitan.com/abu-dhabi-launches-autonomous-racing-league/\" aria-label=\"More on Abu Dhabi Launches World&#8217;s Largest Autonomous Racing League\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-16T15:42:21.000Z",
    "title": "AI-Powered Cyber Threats on the Rise",
    "url": "https://www.cryptopolitan.com/ai-powered-cyber-threats-on-the-rise/",
    "description": "Artificial intelligence (AI) has become a double-edged sword in the realm of cybersecurity, with both attackers and defenders harnessing its power to gain an upper hand in the ever-evolving battle of wits. While AI-driven innovations hold promise for strengthening digital fortresses, malicious actors are increasingly leveraging generative AI models, like ChatGPT, and other tools to ... <a title=\"AI-Powered Cyber Threats on the Rise\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-powered-cyber-threats-on-the-rise/\" aria-label=\"More on AI-Powered Cyber Threats on the Rise\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-16T15:55:42.000Z",
    "title": "Lido announces phased shutdown of Solana operations",
    "url": "https://crypto.news/lido-announces-phased-shutdown-of-solana-operations/",
    "description": "In an Oct. 16 post on the Lido blog, the multi-platform staking solution announced that it had decided that Lido on Solana protocol will be gradually phased out in the months ahead.&#160; Starting on the same day as the post,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-16T16:00:20.000Z",
    "title": "Shiba Inu Starts Off Strong With An Explosive 233% In SHIB Burn Rate",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-explosive-211-shib-burn/",
    "description": "The Shiba Inu ecosystem has started out the new week on a particularly positive note. The burn rate, which is a community initiative to reduce the massive supply of the token, has seen a significant jump as the price of the meme coin has recovered. SHIB Burn Rises 233% A Monday report by Shiba Inu burn tracking website Shibburn showed that the SHIB burn rate has seen an impressive 233% climb. This puts a turn on the particularly slow weekend which saw burn rates decline rapidly. Related Reading: By The Numbers: Bitcoin Hashrate Poised To Complete 100% Growth In 2023 As the new trading week opens up, the total SHIB tokens burned during this time has crossed 56.98 million. This was the result of tokens being sent to the burn address across 29 addresses, with more than 3.7 million tokens sent to the burn address in the last hour as of the time of this writing. Burn rate spikes 233% &#124; Source: Shibburn The token burn also led to an increase in the burn rate for the last week as well. Monday’s burn figures saw the weekly burn total rise above 316.7 million. This is a 26% increase in the burn rate compared to the previous seven days. Some of the largest burns came from the ‘0x909a9’ and ‘0x4be2’ addresses. Both addresses burned a total of 7,119,784 million and 8,095,490 million tokens respectively. The total comes out to over 15 million tokens, accounting for around 27% of the total burns for the day. SHIB price holding $0.0000071 &#124; Source: SHIBUSD on Tradingview.com Shiba Inu Sees Price Recovery On Sunday, the price of Bitcoin surged toward the $28,000 level, and in response, the rest of the crypto market followed the flagship cryptocurrency. Shiba Inu was no different and finally saw a reversal in its bull stretch since the month began. Shiba Inu rose around 1.24% in the 24-hour period and although this is not as impressive as some of the recoveries mounted by other assets, it has helped the cryptocurrency to secure its support at $0.000007. This gives bulls some wiggle room as they regain their bearings in the market. Related Reading: How Ripple’s Rumored Token Burn Could Affect The XRP Price However, Shiba Inu is still seeing small losses of 0.59% on the weekly chart. This suggests that the bulls’ hold on the asset is weak and bears could regain control if momentum slips. This battle for control is mirrored by the daily trading volume of the crypto which is up 25.85% and sitting at $101.7 million, according to data from CoinMarketCap. So far, there doesn’t seem to be any special event pushing the price of SHIB besides the Bitcoin recovery. Given this, if the Bitcoin rally ends, then SHIB will most likely follow and fall into losses again. Featured image from U.Today, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-16T16:00:42.000Z",
    "title": "Bitcoin Whale Awakens After 6 Years; Cardano & InQubeta in High Demand",
    "url": "https://www.crypto-news-flash.com/bitcoin-whale-awakens-after-6-years-cardano-inqubeta-in-high-demand/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-whale-awakens-after-6-years-cardano-inqubeta-in-high-demand",
    "description": "In a recent development that caught many by surprise, a dormant Bitcoin ($BTC) whale has re-entered the crypto market after a 6-year hiatus. In other news, Cardano ($ADA) and InQubeta ($QUBE) remain in high demand following the massive influx of investors. This article will explore a Bitcoin whale awakening. It will also cover the two [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-16T15:40:52.000Z",
    "title": "Dogecoin’s Path to a New All-Time High: Breaking Down Resistance Levels",
    "url": "https://www.crypto-news-flash.com/dogecoins-path-to-a-new-all-time-high-breaking-down-resistance-levels/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoins-path-to-a-new-all-time-high-breaking-down-resistance-levels",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T112405.979.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Dogecoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T112405.979.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T112405.979-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T112405.979-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Dogecoin faces crucial resistance levels, with analyst Ali Martinez suggesting it could enter a bull market if it breaks above $0.0835. Bitcoin&#8217;s sustained close above $28,233 is a key factor for reigniting a bull run, but it&#8217;s currently trading at $27,839. A cryptocurrency analyst, Ali Martinez, has provided insights into the current status of Dogecoin [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-16T16:09:00.000Z",
    "title": "Binance’s BNB Token Burn Could Boost Its Price as High as $230",
    "url": "https://coinedition.com/binances-bnb-token-burn-could-boost-its-price-as-high-as-230/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/BNB-10.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/BNB-10.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/BNB-10-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/BNB-10-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/BNB-10-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/BNB-10-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/BNB-10-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The largest cryptocurrency exchange, Binance, announced in an X post today that it has completed the twenty-fifth quarterly Binance Coin (BNB) burn. According to the post, about 2.14 million BNB have been burned. The burned tokens are worth approximately $453,506,792 and account for about 1.38% of the total supply. Burning tokens can have a positive [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binances-bnb-token-burn-could-boost-its-price-as-high-as-230/\">Binance’s BNB Token Burn Could Boost Its Price as High as $230</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]