[
  {
    "source": "Cointelegraph",
    "date": "2023-05-31T21:15:00.000Z",
    "title": "SBF wants to subpoena documents from old FTX/Alameda law firm to use in his defense",
    "url": "https://cointelegraph.com/news/sbf-wants-to-subpoena-documents-from-old-ftx-alameda-law-firm-to-use-in-his-defense",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/148c28d7-5c96-44a4-b223-b88733895a29.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The prosecution and FTX debtors already have access to the documents, which concern 11 topics and may contain material favorable to SBF.</p>\n                    <p><p>Sam Bankman-Fried (SBF) is seeking to subpoena documents from Fenwick & West. That’s the law firm that served as the outside counsel to FTX, Alameda Research and SBF personally from “early in their development” until the FTX bankruptcy. Now SBF’s legal team wants to use the documents in his defense in the 13-count criminal case against him.</p><p>According to a memorandum filed in the United States District Court for the Southern District of New York, Fenwick has stated that it cannot turn over the documents without the permission of the FTX debtors. The documents represent advice and other content produced by the firm. </p><p>The documents are already in the hands of the FTX debtors and the government. FTX has waived any claims of attorney-client privilege protections of the documents in at least one case, the memorandum <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590940/gov.uscourts.nysd.590940.151.0_1.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a>. It added:</p><blockquote>“The FTX Debtors have given the Government full access to its documents, without the need to issue subpoenas, and are so enmeshed in the Government’s investigation that they must be considered part of the ‘prosecution team’ for purposes of the Government’s discovery obligations.” </blockquote><p>The documents are grouped into 11 requests that touch on “critical topics that are material to preparing the defense.” The subject matter includes FTX's, FTX US' and Alameda’s incorporation, financial and legal ties among those organizations, <a href=\"https://cointelegraph.com/news/here-s-how-sbf-s-fake-electronics-outlet-north-dimension-looks-like\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/here-s-how-sbf-s-fake-electronics-outlet-north-dimension-looks-like/amp\">the incorporation of North Dimension</a> and North Wireless Dimension, the organizations’ <a href=\"https://cointelegraph.com/news/silvergate-faces-doj-investigation-over-ftx-and-alameda-dealings-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/silvergate-faces-doj-investigation-over-ftx-and-alameda-dealings-report/amp\">relations to Silvergate Bank</a>, FTX <a href=\"https://cointelegraph.com/news/hours-before-his-arrest-sbf-denied-being-part-of-wirefraud-chat-group\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/hours-before-his-arrest-sbf-denied-being-part-of-wirefraud-chat-group/amp\">data retention policies</a>, liquidity and margin lending, registration as a money services business, and a variety of statements the organizations made. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/judge-approves-taps-on-sbf-s-parents-phones-to-meet-bail-conditions\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/judge-approves-taps-on-sbf-s-parents-phones-to-meet-bail-conditions/amp\">Judge approves taps on SBF’s parents’ phones to meet bail conditions</a></em></strong></p><p>The memorandum cites Rules 16 and 17 of the Federal Rules of Criminal Procedure, which concern the disclosure of information used by the government in a trial and subpoenas, respectively, as well as the U.S. Supreme Court’s Brady decision on evidence disclosure.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Ready for the AI revolution? Join us for this informative virtual panel exploring how generative AI will shake up consumer tech, gaming, digital media and entertainment.<br><br>Learn more: <a href=\"https://t.co/1b1apO5sSc\">https://t.co/1b1apO5sSc</a><a href=\"https://twitter.com/hashtag/AI?src=hash&ref_src=twsrc%5Etfw\">#AI</a> <a href=\"https://twitter.com/hashtag/Tech?src=hash&ref_src=twsrc%5Etfw\">#Tech</a> <a href=\"https://t.co/LlbkdmLuVH\">pic.twitter.com/LlbkdmLuVH</a></p>— Fenwick (@FenwickWest) <a href=\"https://twitter.com/FenwickWest/status/1663606890679484418?ref_src=twsrc%5Etfw\">May 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>SBF <a href=\"https://cointelegraph.com/news/sam-bankman-fried-enters-not-guilty-plea-for-all-counts-in-federal-court\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sam-bankman-fried-enters-not-guilty-plea-for-all-counts-in-federal-court/amp\">has pleaded not guilty</a> to eight charges that could land him in jail for 115 years. Five charges <a href=\"https://cointelegraph.com/news/sam-bankman-fried-charged-with-bribing-chinese-officials-court-docs\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sam-bankman-fried-charged-with-bribing-chinese-officials-court-docs/amp\">were added to the original eight</a> after his extradition from the Bahamas.  He later <a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-urges-court-to-dismiss-charges\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ftx-founder-sam-bankman-fried-urges-court-to-dismiss-charges/amp\">sought the dismissal</a> of most of the charges.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/sbf-pleads-not-guilty-crypto-layoffs-bank-run-silvergate-hodlers-digest-jan-1-7/\">SBF pleads not guilty, crypto layoffs, and bank run on Silvergate: Hodler’s Digest, Jan. 1-7</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-31T21:30:59.000Z",
    "title": "Bitcoin Mining Difficulty Surpasses 50 Trillion for the First Time, Reaching a Record 51.23 Trillion",
    "url": "https://news.bitcoin.com/bitcoin-mining-difficulty-surpasses-50-trillion-for-the-first-time-reaching-a-record-51-23-trillion/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/diff-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Mining Difficulty Surpasses 50 Trillion for the First Time, Reaching a Record 51.23 Trillion\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/diff-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/diff-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/diff-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/diff-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/diff-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/diff-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/diff-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Wednesday, Bitcoin reached a new milestone as its mining difficulty increased by 3.4% at block height 792,288, setting a fresh record. The difficulty level surpassed the 50 trillion mark for the first time in Bitcoin&#x2019;s history, hitting an unparalleled 51.23 trillion. Bitcoin Mining Difficulty Jumps 3.4% Higher Data reveals that around 373 exahash per [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T21:32:55.000Z",
    "title": "Multichain (MULTI) team locked out as CEO goes missing",
    "url": "https://www.cryptopolitan.com/multichain-team-locked-out-ceo-goes-missing/",
    "description": "The turbulence surrounding Multichain (MULTI), a popular cross-chain protocol, hit a new peak as the team recently reported their inability to contact CEO Zhaojun, the sole possessor of critical server access permissions. This sudden halt in operations coincides with unverified rumors of police arrests and substantial confiscation of funds. Server access crisis paralyzes operations Multichain&#8217;s ... <a title=\"Multichain (MULTI) team locked out as CEO goes missing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/multichain-team-locked-out-ceo-goes-missing/\" aria-label=\"More on Multichain (MULTI) team locked out as CEO goes missing\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T21:14:56.000Z",
    "title": "Three career alternatives suggested by AI for Michael Saylor",
    "url": "https://www.cryptopolitan.com/career-alternatives-by-ai-for-michael-saylor/",
    "description": "In an exclusive and thought-provoking exploration, OpenAI&#8217;s GPT-4 presents three imaginative alternatives for the career path of renowned entrepreneur and crypto advocate Michael Saylor. Renowned for his leadership at the helm of MicroStrategy and his vocal support for Bitcoin, Saylor has become a celebrated figure in the world of technology and finance. However, in this ... <a title=\"Three career alternatives suggested by AI for Michael Saylor\" class=\"read-more\" href=\"https://www.cryptopolitan.com/career-alternatives-by-ai-for-michael-saylor/\" aria-label=\"More on Three career alternatives suggested by AI for Michael Saylor\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T21:37:38.000Z",
    "title": "Binance responds to layoff rumors, denies 20% staff cut",
    "url": "https://crypto.news/binance-responds-to-layoff-rumors-denies-20-staff-cut/",
    "description": "Binance, the world's largest crypto exchange by market capitalization, responded to rumors about the company cutting its staff by 20%."
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-31T21:30:00.000Z",
    "title": "XRP Breaks 2-Year Trendline: Is A 500x Surge On The Horizon?",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-breaks-2-year-trendline-is-a-500x-surge-on-the-horizon/",
    "description": "XRP, one of the top cryptocurrencies by market capitalization, has been bullish since May 26th, outperforming most of the top 10 cryptocurrencies. This surge in price comes as investors have high expectations for the outcome of the ongoing SEC vs. Ripple Labs case. Related Reading: Trader Joe Goes All-In On Auto-Pools: Game-Changer For DeFi Investors? XRP Shatters 2-Year Trendline The recent uptrend in XRP is particularly significant as the cryptocurrency has just broken through a two-year trendline, a key technical indicator for traders and investors, according to the trader Jaydee. Per the analysis of Jaydee, In 2017, XRP experienced a significant breakout when it surpassed a two-year trendline. This breakout led to a massive increase in value for the cryptocurrency, with XRP seeing a surge of 504x over just one year. This means that if an investor had purchased XRP at the start of 2017, they would have seen a return on investment of more than 50,000% by the end of the year. If XRP were to experience a similar surge in value today, with the cryptocurrency currently trading at $0.5116, it could reach a value of $258 by 2024. However, it&#8217;s important to note that predicting future price movements in cryptocurrency markets is highly challenging, and many factors could impact the value of XRP. For example, the ongoing SEC vs. Ripple Labs case could significantly impact the token&#8217;s future price movements. If the case is resolved in Ripple Labs&#8217; favor, it could lead to increased adoption and investment in XRP. On the other hand, if the case is decided against Ripple Labs, it could lead to a decrease in demand for the cryptocurrency and a drop in its value. However, Jaydee believes that the cryptocurrency will not experience a surge of 504x shortly. According to the analyst, XRP&#8217;s market cap is too high to support such a significant increase in value. The token has a market cap of over $26 billion, making it the sixth-largest cryptocurrency by market capitalization.  Despite these uncertainties, many investors remain bullish on XRP&#8217;s prospects. The cryptocurrency has already seen significant adoption within the financial industry, with many major banks and payment processors using XRP for cross-border transactions.  Key Indicators Point To Significant Growth Potential According to the Average Sentiment Oscillator (ASO), the current set-up for XRP is highly bullish, with several key indicators pointing toward a strong upward trend in price. One key factor contributing to this bullish sentiment is the high volatility of XRP&#8217;s market depth, indicating significant interest and demand for the cryptocurrency.  Additionally, the current trend&#8217;s strength is strong, with a bullish cross indicating that XRP is likely to continue its upward trajectory, per a recent analysis by Egrag Crypto. While XRP has been ascending in the price for almost four months, there is still a major resistance level known by Egrag as the &#8216;Final Wake Up Line&#8217; that XRP has yet to break through. However, even if the token experiences a minor correction after a 20% pump, there are still possible support levels at $0.4810 and $0.4277 that could prevent a significant drop in value, according to Egrag Crypto’s latest analysis.  Related Reading: Coinbase CEO Drops Bombshell Prediction – Is China Set To Dominate Crypto? If XRP does dip below these support levels, it is considered normal and not necessarily a cause for concern as long as it respects its below lines as strong support in the near term. This support box could act as a key area of stability for XRP, allowing it to continue its upward trend in price. Featured image from iStock, chart from TradingView.com "
  }
]