[
  {
    "source": "CoinDesk",
    "date": "2024-02-28T17:55:58.000Z",
    "title": "El Salvador's Bukele Says Value of Country's Bitcoin Holdings Up Over 40%",
    "url": "https://www.coindesk.com/markets/2024/02/28/el-salvadors-bukele-says-value-of-countrys-bitcoin-holdings-up-over-40/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The country's bonds have also surged to over 80 cents on the dollar."
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-28T17:54:41.000Z",
    "title": "Coinbase Moves to Improve Ethereum's 'Client Diversity' by Adding Nethermind, Erigon",
    "url": "https://www.coindesk.com/tech/2024/02/28/coinbase-moves-to-improve-ethereums-client-diversity-by-adding-nethermind-erigon/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The publicly traded U.S. crypto exchange said it would add support for the additional Ethereum \"clients\" – computer programs used to access and run the distributed network – to help reduce dependence on the dominant Geth software."
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-28T17:54:21.000Z",
    "title": "Amid Ferocious Bitcoin Rally, a Coinbase Snafu Shows $0 Balances for Customers ",
    "url": "https://www.coindesk.com/business/2024/02/28/coinbase-account-balances-shows-0-for-users-post-bitcoin-60k-breakout/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Multiple users of Coinbase's U.S. platform said on Wednesday that their account balances were wiped out."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-28T18:05:56.000Z",
    "title": " Coinbase users report zero balance bug as Bitcoin price taps $64K ",
    "url": "https://cointelegraph.com/news/coinbase-users-report-zero-balance-bug-btc-bitcoin-price-64-k",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMjRlMTRhNDgtNDMxMi00ZWNjLTk0NWQtN2E1ZDU5MDZiZTY5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>While Bitcoin was flirting with a new ATH, an apparent bug caused Coinbase users to see their account balances hit all-time lows.</p>\n                    <p><p>A surging Bitcoin price between 9:00 and 10:00 AM PST on Feb. 28 may have caused a disruption in Coinbase services as widespread reports of accounts suddenly showing a zero balance began to populate social media.</p><p>As of the time of this article’s publication, the apparent bug appears ongoing, but Coinbase says funds are safe: </p><p>The price of Bitcoin surged above $64,000 in the minutes leading up to the incident, however as of the time of this article’s publication it has retreated to $61.4K.</p><p><a href=\"https://cointelegraph.com/news/coinbase-users-report-zero-balance-bug-btc-bitcoin-price-64-k\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-28T17:49:00.000Z",
    "title": " Bitcoin price hits $64K as traders anticipate new all-time high before halving ",
    "url": "https://cointelegraph.com/news/bitcoin-price-hits-64k-as-traders-anticipate-new-all-time-high-before-halving",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZjQ4MWIyMWYtYWRmNy00MTE1LWE2ZGItMGM1NmI5MGFkN2Y2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin price continues its parabolic rally with a swift move to $64,000. Is a new all-time high the next stop? </p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price rallied in excess of 10% to a new 2024 high at $64,000 on Feb. 28. The bulk of this month’s 50% price move is being attributed to investors’ anticipation of the upcoming supply halving event, which is typically followed by strong upside price action. </p><p>The steady inflows to the recently launched spot Bitcoin ETFs is also thought to be playing a critical role in Bitcoin’s price action. </p><p>Shortly after reaching $64,000, Bitcoin price flash crashed to $58,700, likely the result of a sell wall at this level and a clearing out of late leverage longs, but at the time of publishing, BTC had recovered nearly 5% of the downside move. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-hits-64k-as-traders-anticipate-new-all-time-high-before-halving\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2024-02-28T17:50:42.000Z",
    "title": "Solana (SOL) Rival Priced $0.0013 Earns Bonk (BONK) & Solana (SOL) Investor Support",
    "url": "https://nulltx.com/solana-sol-rival-priced-0-0013-earns-bonk-bonk-solana-sol-investor-support/",
    "description": "In the vibrant world of cryptocurrency, where innovation and strategic positioning play crucial roles in determining a project&#8217;s success, a new contender has emerged, challenging established players and reshaping investor portfolios. Shiba Budz (BUDZ), priced at an enticing $0.0013, has quickly caught the attention of the crypto community, particularly drawing [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-28T18:00:15.000Z",
    "title": "Who Let The DOGE Out? Dog-Themed Coins Soar By 12%, WIF And FLOKI Lead The Way",
    "url": "https://www.newsbtc.com/news/who-let-the-doge-out-dog-themed-coins-soar-by-12-wif-and-floki-lead-the-way/",
    "description": "The crypto market seems to be going nowhere but up. Bitcoin nears $60,000, Ether has been surfing above the $3,000 wave for four days, currently sitting at the $3,330 level, and the rest of the market continues to gain momentum. Significant developments and a strong bullish sentiment have built up over the past couple of months, and as a result, the top gainers during this bull run are coming from every sector of the market. This is the case of Dog-themed coins, which currently sit among the cryptocurrencies with the best performance over the last few days. Related Reading: Ethereum Price Primed To Hit $3.5K After Bitcoin Rallies Past $60K Dog-Themed Coins Are Soaring Dog-inspired cryptocurrencies are some of the most popular coins among the crypto community. The trend started with the popular internet doge meme and has inspired some of the most recognizable memecoins in the market. The largest by market capitalization in this category, Dogecoin, currently stays out of the top ten cryptocurrencies by this metric. However, it has remained close to the top with its 11th place. Top ten dog-themed coins by market cap. Source: CoinGecko The Dog-themed market cap has shown a 12.8% growth in the last 24 hours, as CoinGecko data shows. The sector’s market capitalization sits at an impressive $23.8 billion, and the dog-based coins trading volume reached over $4.25 billion in the last 24 hours. The chart above shows that the top ten dog-inspired cryptocurrencies display positive performance, with green numbers all over the board in the last 7 days. Impressive Performance From WIF, FLOKI And More Dogecoin, Shiba Inu, and Bonk lead the dog-inspired market. However, none of these tokens are among the top five gainers on the last day or week. At writing time, the coins that have seen the best performance in this category include dogwifhat (WIF), FLOKI (FLOKI), Samoyedcoin (SAMO), Myro (MYRO), and Chihuahua Chain (HUAHUA). Let’s take a look at the 3 top gainers: Dogwifhat (WIF) WIF’s price jumped 41.9% during the last day and now trades at $0.7765. Earlier today, the coin’s price recorded a new all-time high (ATH) after reaching $0.79. Just last week, a crypto analyst predicted that the price of WIF was about to go “turbo parabolic” and possibly reach $1. Fans of the project have shown their excitement by suggesting that investors &#8220;keep their hats on&#8221; during this leg of the rally. Dogwifhat’s daily trading volume of $123.5 million represents a 34.30% increase from one day ago. This hints at a recent rise in &#8220;hats being put on&#8221; after the token has shown an impressive 117.8% and 137.8% price jump in the last 7 and 30 days, respectively. FLOKI As previously reported, FLOKI has been soaring after DWF Labs announced its plans to strengthen its partnership with the project. The digital assets investment firm will purchase $10 million worth of FLOKI tokens directly from the project’s treasury over two years. Since then, the token’s price has risen 37.7% in the last 24 hours. Currently trading at $0.00005973, FLOKI has maintained its gains over the week with an 85.4% price increase. Additionally, its performance recorded a 100.1% jump in the 30-day time frame. According to CoinGecko data, FLOKI is outperforming the global crypto market with its performance in the last week. Similarly, it has increased its trading volume by 116.6% in 24 hours, with over $382 million. Chihuahua Chain Chihuahua Chain surprised the crypto community after becoming one of the largest global earners on the last day. Members of the ‘HUAHUA Army’ speculated if the token would break out of the downtrend seen after the token’s massive pump in December. HUAHUA experienced a massive 48.4% price jump in the last 24 hours. The token went from its $0.00018 price to trade at $0.0003411. Its daily trading volume massively increased by 140.4% and currently sits at $1.017 million. This performance has been sustained over the last month, as the token’s price has grown 50.3%. Related Reading: Top Memecoins Face Pullback Amid Recent Market Rally WIF is trading at $0.7267 in the 1-day chart. Source: WIFUSDT on TradingView.com Feature image from Unsplash.com, Chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-28T17:41:35.000Z",
    "title": "Solana (SOL) Investors Join New Rival Presale, 300% Profit Made Already",
    "url": "https://www.crypto-news-flash.com/solana-sol-investors-join-new-rival-presale-300-profit-made-already/?utm_source=rss&utm_medium=rss&utm_campaign=solana-sol-investors-join-new-rival-presale-300-profit-made-already",
    "description": "<img width=\"1260\" height=\"787\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Solana.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Solana.jpg 1260w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Solana-300x187.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Solana-1200x750.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Solana-768x480.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Solana-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Solana-450x281.jpg 450w\" sizes=\"(max-width: 1260px) 100vw, 1260px\" />The emergence of Shiba Budz (BUDZ) as a formidable rival to Solana (SOL) and the significant profits already realized by its early investors highlight a paradigm shift in crypto investments. As investors continue to seek out opportunities that offer both innovation and inclusivity, platforms like Shiba Budz (BUDZ) are well-positioned to play a pivotal role [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-28T17:55:02.000Z",
    "title": "Top Trader Says Solana-Based Memecoin Setting Up for ‘Much Larger’ Leg Up – Here’s His Outlook",
    "url": "https://dailyhodl.com/2024/02/28/top-trader-says-solana-based-memecoin-setting-up-for-much-larger-leg-up-heres-his-outlook/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/Based-Memecoin-Setting-Up.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/Based-Memecoin-Setting-Up.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2024/02/Based-Memecoin-Setting-Up.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/Based-Memecoin-Setting-Up.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/Based-Memecoin-Setting-Up.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/Based-Memecoin-Setting-Up.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2024/02/Based-Memecoin-Setting-Up.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed analyst and trader believes one Solana (SOL) ecosystem memecoin is gearing up for a major breakout. The analyst pseudonymously known as The Flow Horse tells his 202,800 followers on the social media platform X that dogwifhat (WIF) is on the verge of flipping a key resistance level at $0.42 into support and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/28/top-trader-says-solana-based-memecoin-setting-up-for-much-larger-leg-up-heres-his-outlook/\">Top Trader Says Solana-Based Memecoin Setting Up for ‘Much Larger’ Leg Up – Here’s His Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]