[
  {
    "source": "CoinDesk",
    "date": "2024-02-20T21:30:23.000Z",
    "title": "Michael Saylor Not Interested in Selling: ‘Bitcoin Is the Exit Strategy'",
    "url": "https://www.coindesk.com/business/2024/02/20/michael-saylor-on-exiting-bitcoin-bitcoin-is-the-exit-strategy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Michael Saylor doesn’t plan to sell any of MicroStrategy' (MSTR)s bitcoin (BTC) anytime soon, or potentially ever, he said in an interview with Bloomberg TV on Tuesday."
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-20T21:19:53.000Z",
    "title": "Avalanche's AVAX Underperforms Ahead of $365M Token Unlock",
    "url": "https://www.coindesk.com/markets/2024/02/20/avalanches-avax-underperforms-ahead-of-365m-token-unlock/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Avalanche's AVAX was one of the few crypto assets that dipped in price over the past week as the token will undergo a $365 million unlocking event scheduled this week."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-20T21:33:27.000Z",
    "title": "LockBit Ransomware Gang Broken Up After Taking $120 Million in Bitcoin",
    "url": "https://decrypt.co/218249/lockbit-ransomware-gang-broken-up-120-million-bitcoin",
    "description": "U.S. agencies sanction two Russian nationals and 10 total Bitcoin and Ethereum wallets, and say victims can get help with recovery."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-20T21:25:33.000Z",
    "title": " Turkey releases first-phase digital lira project evaluation report ",
    "url": "https://cointelegraph.com/news/turkey-releases-first-phase-digital-lira-project-evaluation-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMTlmNzdiZDQtMjdlMS00MzYyLWE4ZDQtM2NlMTY5NzhiMTlmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The digital Turkish lira is set to be an intermediated CBDC with self-sovereign identity and offline transfers. </p>\n                    <p><p>The Central Bank of the Republic of Turkey (CBRT) has released an English translation of its report evaluating the first phase of its Central Bank Digital Turkish Lira Research and Development (R&amp;D) Project to develop a central bank digital currency (CBDC). The report was published in Turkish last year, but appeared in English translation on Feb. 19.</p><p>The first phase of the project dealt with the digital identity system, digital currency system, abstraction layer, service layer and wallet. The abstraction layer supports the modularity of the system. The first phase of the project began in 2021 and the CBRT <a href=\"https://cointelegraph.com/news/turkey-s-central-bank-completes-first-cbdc-test-with-more-to-come-in-2023\">carried out its first trial transactions</a> with the digital Turkish lira in 2022.</p><p>All parts of the system are independent of the others, allowing for easy replacement. The system operates on the Digital Turkish Lira Collaboration Platform <a href=\"https://cointelegraph.com/news/turkish-central-bank-taps-local-tech-firms-for-digital-currency-r-d\">that the CBRT operates</a> with the Scientific and Technological Research Council of Türkiye and the Aselsan and Havelsan companies.</p><p><a href=\"https://cointelegraph.com/news/turkey-releases-first-phase-digital-lira-project-evaluation-report\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-20T21:19:32.000Z",
    "title": " Starknet airdrop largely successful despite controversies ",
    "url": "https://cointelegraph.com/news/starknet-airdrop-largely-successful-despite-controversies",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvOTg1OTQ1NmQtODA0Yi00OTc4LWI4ZWYtZDYyNWYyNDAxYmVmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The protocol's total diluted market capitalization has since surpassed $20 billion. </p>\n                    <p><p>High demand in the much anticipated Ethereum layer-2 solution Starknet airdrop has caused the protocol’s fully diluted market cap to surpass $20 billion despite controversies.</p><p>On Feb. 20, Starknet developers allocated approximately 700 million STRK tokens out of a total supply of 10 billion to reward Ethereum solo and liquid stakes, Starknet developers, and users, as well as projects and developers from outside the Web3 ecosystem. Within the first 90 minutes, 45 million STRK tokens <a href=\"https://cointelegraph.com/news/starknet-7-binance-millions-tokens-claimed\">were claimed</a> and have since surpassed 220 million. </p><p>Users have until June 20, 2024, to claim the remaining balance. Despite investor enthusiasm, however, the price of STRK tokens has since fallen to $2 compared to its opening high price of $7 on the crypto exchange Binance, albeit the protocol still holds a high valuation. Currently, the protocol has a total value locked of $57 million.</p><p><a href=\"https://cointelegraph.com/news/starknet-airdrop-largely-successful-despite-controversies\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2024-02-20T21:32:14.000Z",
    "title": "Arweave Ecosystem Sees Remarkable Surge As $AR Token Hits Yearly High",
    "url": "https://nulltx.com/arweave-ecosystem-sees-remarkable-surge-as-ar-token-hits-yearly-high/",
    "description": "The Arweave ecosystem is attracting increasing attention as the $AR token experiences significant growth, with a remarkable 110% surge over the past 90 days.  In the last week alone, $AR has surged by 72%, and in the past 24 hours, it has seen a 25% increase, reaching a yearly high [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-20T21:16:35.000Z",
    "title": "Galxe Coin Faces Decline Despite Recent Surges,  Good Outlook Long-term ",
    "url": "https://nulltx.com/galxe-coin-faces-decline-despite-recent-surges-good-outlook-long-term/",
    "description": "In recent weeks, Galxe coin ($GAL) has experienced remarkable growth, boasting a surge of over 70% in the last 30 days and a notable 35% increase in the past 7 days.  However, the coin&#8217;s current trajectory shows a 6% decline over the past 24 hours, accompanied by a significant 70% [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-20T21:34:19.000Z",
    "title": "VanEck’s Bitcoin ETF sees 1,000% daily volume spike in fee cut anticipation",
    "url": "https://crypto.news/vanecks-bitcoin-etf-spike-daily-volume-fee-cut/",
    "description": "VanEck’s spot Bitcoin ETF jumped 14 times its daily average volume a day before the firm plans to implement a fee cut, reducing entry cost from 0.25% to 0.2%."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-20T21:24:27.000Z",
    "title": "STRK trading spikes on major exchanges after Starknet’s 128m airdrop",
    "url": "https://crypto.news/strk-trading-starknet-airdrop/",
    "description": "Many users are selling and swapping their airdropped STRK tokens, as Starknet peaked at $3.42 within an hour of its debut."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-20T21:30:21.000Z",
    "title": "Bitcoin Whales Steer Clear Of Significant Short Positions, Show Confidence In Price Surge",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-whales-steer-clear-of-significant-short/",
    "description": "Bitcoin traders are exhibiting cautious optimism as they refrain from &#8220;substantial short positions,&#8221; expecting continued price surges, according to analysts from Bitfinex this week&#8217;s Alpha report. Despite Bitcoin&#8217;s notable surge that brought the asset to trade as high as above $52,000 for the first time since 2021, analysts note a decrease in the short-squeeze ratio compared to previous years. The reason behind this declining short-squeeze ratio is revealed in the report. Whales Shun Short Positions Amid Bullish Sentiment Analysts at Bitfinex Alpha report that large whale investors are refraining from &#8220;substantial short positions&#8221; due to their belief that prices will only continue to increase further. Related Reading: The Bitcoin “Big Money Algos” Are Here: Will BTC Breach $70,000? The current market conditions are characterized by &#8220;tightening supply and increasing demand,&#8221; further supporting the bullish sentiment among traders. According to the Bitfinex Alpha report, the behavior of Bitcoin holders suggests the emergence of early bull-market conditions. This is evidenced by a reduction in the volume of long-term holder supply experiencing losses, a trend that correlates with the ongoing rise in the asset&#8217;s price. This observation suggests a positive outlook for Bitcoin&#8217;s price trajectory in the near term. The report noted: Currently, less than 6% of the aggregate long-term holder supply by individual entities are held at a loss. Historically, similar instances where the long-term holder cohort held a comparable volume of Bitcoin in loss have been indicative of early bull market conditions. Bitcoin Trajectory And Investor Sentiment In the past 24 hours, Bitcoin has experienced a slight retracement of nearly 2%, following a week-long uptrend that propelled its price to trade above $52,000 for the first time since 2021. Despite this retrace, investors remain optimistic, with ongoing asset accumulation amid bullish predictions from analysts and experts. Renowned financial guru Robert Kiyosaki recently made headlines with his bold prediction that Bitcoin will reach $100,000 by June 2024, further fueling optimism in the crypto community. BITCOIN to $100k by June 2024. — Robert Kiyosaki (@theRealKiyosaki) February 18, 2024 Moreover, recent whale activity in the Bitcoin market has caught the attention of analysts and investors alike. Crypto analyst Ali Martinez recently revealed that a specific class of Bitcoin investors, holding between 1,000 and 10,000 BTC, has accumulated the digital asset in recent weeks. Related Reading: Bitcoin’s Golden Projection: Analyst Envisions $600K Price Tag, Assessed In Gold Ounces Data from on-chain analytics firm Santiment shows that whales in this category have added over 140,000 coins to their holdings in the last three weeks, equivalent to a substantial $6.16 billion. #Bitcoin whales have been on a buying spree, acquiring 140,000 $BTC over the past three weeks, amounting to $6.16 billion! pic.twitter.com/ViRnYiJHmp — Ali (@ali_charts) February 10, 2024 This accumulation trend among whales reflects confidence in Bitcoin&#8217;s long-term potential and is a positive indicator for its future price trajectory. Featured image from Unsplash, Chart from TradingView"
  }
]