[
  {
    "source": "CoinDesk",
    "date": "2023-09-12T15:55:02.000Z",
    "title": "Coinbase to Face ‘Reality Check’ as Retail FOMO Is Fading, Mizuho Says",
    "url": "https://www.coindesk.com/business/2023/09/12/coinbase-to-face-reality-check-as-retail-fomo-is-fading-mizuho-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "In a break with historical norms, the exchange’s volumes continue to fall even as the bitcoin price has risen, suggesting disengagement by retail customers, the report said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-12T16:00:00.000Z",
    "title": "MetaMask Snaps to let users interact with Solana DApps through Solflare",
    "url": "https://cointelegraph.com/news/metamask-snaps-wallets-interact-with-solana-dapps-through-solflare",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/4ff2a373-b539-4385-8ac9-75a07c914389.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Solflare co-founder Filip Dragoslavic said that the integration removes the “friction” that prevented potential users from entering the Solana ecosystem. </p>\n                    <p><p>Solana wallet provider Solflare has integrated MetaMask Snaps to let MetaMask users manage their Solana portfolio directly from the popular crypto wallet. </p><p>According to an announcement sent to Cointelegraph, the Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) wallet provider is “easing the barrier of entry and usage” to the Solana blockchain with the new integration. Using an extension called MetaMask Snaps, Solflare will allow MetaMask users to interact with various <a href=\"https://cointelegraph.com/learn/what-are-dapps-everything-there-is-to-know-about-decentralized-applications\">decentralized applications (DApps)</a> within the Solana ecosystem. </p><p>According to Filip Dragoslavic, the co-founder of Solflare, the “friction\" of installing new wallets has “stopped many potential Solana users” from entering the ecosystem. “This integration could be a game-changer to introduce the biggest user base in Web3 to just try Solana and see for themselves,\" Dragoslavic added. </p><p>The feature is made possible through a collaboration with MetaMask Snaps, a way to extend the functionality of the popular Web3 wallet. Christian Montoya, the product lead at MetaMask Snaps, commented on the integration and said that onboarding MetaMask users to Solana DApps is a huge step toward a “more seamless user experience.\" </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Consensys head of strategy Simon Morris shared some of the details about the much anticipated <a href=\"https://twitter.com/MetaMask?ref_src=twsrc%5Etfw\">@MetaMask</a> Snaps, which will act as an app store within the MetaMask wallet, allowing devs to expand its functionality. <a href=\"https://t.co/z4hzKtMuXR\">https://t.co/z4hzKtMuXR</a></p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1699308459907576000?ref_src=twsrc%5Etfw\">September 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The much-anticipated MetaMask Snaps is designed to allow users to <a href=\"https://cointelegraph.com/news/crypto-wallet-dapp-store-consensys-preps-cross-chain-metamask-snaps\">interact with a variety of different blockchain networks</a>. In a recent Cointelegraph interview at the Korea Blockchain Week, ConsenSys head of strategy Simon Morris described Snaps as an “Apple App Store” for MetaMask, which allows third-party developers to launch DApps called “Snaps.\"</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/multichain-future-is-very-clear-metamask-to-support-all-tokens-via-snaps\">‘Multichain future is very clear’ — MetaMask to support all tokens via Snaps</a></em></strong></p><p>In addition, the feature allows users to manage SOL, Solana Program Library tokens and <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world#:~:text=Nonfungible%20tokens%20appeal%20to%20collectors,certified%20version%20of%20that%20asset.\">nonfungible tokens</a> through MetaMask. The announcement highlighted that it lets existing MetaMask users integrate their wallets across Ethereum and other Ethereum Virtual Machine (EVM) chains with the Solana blockchain. </p><p>Since Solana has a different infrastructure, access to the ecosystem requires Solana-specific wallets like Solflare. However, with the new feature, users will be able to manage their interactions with Solana through MetaMask. </p><p>To connect with Solana, MetaMask users will need to either visit Solflare’s website or connect their wallet to any Solana application. After an installation process, users will be able to bridge their EVM assets into Solana. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/metamask-snaps-wallets-interact-with-solana-dapps-through-solflare&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine:  <a href=\"https://cointelegraph.com/magazine/nft-collapse-and-monster-egos-feature-in-new-murakami-exhibition/\">NFT collapse and monster egos feature in new Murakami exhibition</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-12T16:00:57.000Z",
    "title": "Stablecoin holders can earn 8.5% annually on USDC, USDT via Ledn Growth Accounts",
    "url": "https://cryptoslate.com/stablecoin-holders-can-earn-8-5-annually-on-usdc-usdt-via-ledn-growth-accounts/",
    "description": "<p>Crypto lending firm Ledn announced on Sept. 12 that its interest-bearing Growth Accounts now support both of the crypto market&#8217;s leading stablecoins. Mauricio Di Bartolomeo, Co-Founder and CSO of Ledn, said:  &#8220;We have listened to the industry’s demand for a new way to earn yield in a safer and more transparent manner &#8230;  Ledn’s USD [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/stablecoin-holders-can-earn-8-5-annually-on-usdc-usdt-via-ledn-growth-accounts/\">Stablecoin holders can earn 8.5% annually on USDC, USDT via Ledn Growth Accounts</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-12T16:00:47.000Z",
    "title": "Franklin Templeton applies for spot Bitcoin ETF, tapping Coinbase as custody institution",
    "url": "https://cryptoslate.com/franklin-templeton-applies-for-spot-bitcoin-etf-tapping-coinbase-as-custody-institution/",
    "description": "<p>Franklin Templeton applied for a spot Bitcoin (BTC) exchange-traded application with the U.S. Securities and Exchange Commission on Sept. 12. In the filing, the global investment firm said the fund&#8217;s asset would be custodied at Coinbase-and it would trade on Cboe BZX Exchange, Inc. The filing did not include the proposed ticker for the ETF. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/franklin-templeton-applies-for-spot-bitcoin-etf-tapping-coinbase-as-custody-institution/\">Franklin Templeton applies for spot Bitcoin ETF, tapping Coinbase as custody institution</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-12T16:00:30.000Z",
    "title": "Bitcoin about to witness sixth death cross in 5 yrs",
    "url": "https://cryptoslate.com/insights/bitcoin-about-to-witness-sixth-death-cross-in-5-yrs/",
    "description": "<p>Quick Take As Bitcoin&#8217;s price hovers around $26,000, technical indicators suggest a death cross is imminent, a situation defined by the 50-day moving average (DMA) falling below the 200 DMA. Currently, the 50dma is around $27,625, strikingly close to the 200dma at $27,618. This impending event is a signal of weakening price momentum, often associated [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-about-to-witness-sixth-death-cross-in-5-yrs/\">Bitcoin about to witness sixth death cross in 5 yrs</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-12T15:58:06.000Z",
    "title": "Web3 Pioneer, Dan Wasyluk, Joins Jurat Blockchains as Chief Technology Officer",
    "url": "https://cryptodaily.co.uk/2023/09/web3-pioneer-dan-wasyluk-joins-jurat-blockchains-as-chief-technology-officer",
    "description": "Web3 Pioneer, Dan Wasyluk, Joins Jurat Blockchains as Chief Technology Officer"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-12T16:00:43.000Z",
    "title": "Biggest Movers: BCH 6% Higher, as Price Nears $200 Level",
    "url": "https://news.bitcoin.com/biggest-movers-bch-6-higher-as-price-nears-200-00-level/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2280419431-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: BCH 6% Higher, as Price Nears $200.00 Level\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2280419431-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2280419431-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2280419431-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2280419431-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2280419431-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2280419431-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2280419431.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin cash was one of Tuesday&#x2019;s biggest movers, as bullish sentiment returned to markets, following recent declines. After huge losses on Monday, bulls have seemingly moved to buy the dip in price, pushing the global market cap 1.55% higher as of writing. Solana also surged in today&#x2019;s session. Bitcoin Cash (BCH) Bitcoin cash (BCH) rose [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-12T16:09:11.000Z",
    "title": "BREAKING: Crypto Exchange CoinEX Reportedly Hit By Massive Hack, Losses Exceed $27 Million",
    "url": "https://www.newsbtc.com/breaking-news-ticker/breaking-crypto-exchange-coinex-reportedly-hit-by-massive-hack-losses-exceed-27-million/",
    "description": "In a concerning development, popular crypto exchange CoinEx is believed to have fallen victim to a suspected hack, resulting in significant losses from its Ethereum (ETH), TRON (TRX), and Polygon (MATIC) hot wallets. The incident, which unfolded on Tuesday, has sparked an ongoing investigation into the security breach. Related Reading: Bitcoin Forming Death Cross: Here’s What Happened Last Time Alarming Depletion Of CoinEx ETH Reserves According to reports by Colin Wu, a prominent cryptocurrency journalist, CoinEx reportedly lost a staggering 4,946 ETH and 354,762 TRX as part of the ongoing drain from the exchange&#8217;s wallets.  The total value of the funds lost surpasses $27.8 million, adding to the growing list of high-profile cryptocurrency exchange breaches. In his latest update, Colin Wu stated: CoinEX is moving the affected hot wallet assets to the cold wallet address 0xf54&#8230;7E5d. CoinEX wallets currently hold $97.83 million in assets, of which $89 million are stored in the cold wallet address 0xf54&#8230;7E5d, mainly ETH worth $51.7 million and USDT $18.23 million.  What’s more, In a concerning revelation, Julio Moreno, the Head of Research at CryptoQuant, has shed light on the peculiar behavior surrounding CoinEx&#8217;s Ethereum reserves.  The exchange has experienced a staggering depletion of its ETH holdings, with almost 5,000 ETH mysteriously vanishing within a single hour and a total loss of approximately 40,000 ETH since May. As a result, CoinEx&#8217;s ETH reserves now stand at virtually zero. CoinEx, however, has remained silent on the matter, refraining from issuing an official statement regarding the suspected hack.  The depletion of CoinEx&#8217;s ETH reserves indicates a potentially grave situation, as it suggests a significant outflow of funds from the exchange. Such a rapid decline in ETH holdings may have severe implications for CoinEx&#8217;s liquidity and ability to meet customer withdrawal demands. Related Reading: Crypto Analyst Predicts Where Bitcoin Price Will Be By End Of Year CoinEx&#8217;s stakeholders and the wider cryptocurrency community will closely watch how the exchange responds to these developments. Complemented by transparent communication, swift and decisive action will be vital in navigating this challenging situation and working towards a resolution. Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-12T16:00:32.000Z",
    "title": "Bitcoin Forming Death Cross: Here’s What Happened Last Time",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-forming-death-cross-happened-last-time/",
    "description": "Bitcoin appears to be in the process of forming a death cross currently. Here&#8217;s what happened to the asset the last time this pattern emerged. Bitcoin 50-Day MA Is Moving Below The 200-Day MA Right Now As pointed out by an analyst in a post on X, the 50-day moving average (MA) has been attempting a cross below the 200-day MA recently. A &#8220;Moving Average&#8221; is an analytical tool that calculates the average of any given quantity over a specific period of time. As its name suggests, it moves and changes alongside the quantity in question. The main benefit of an MA is that it removes short-term fluctuations from the data, smoothing out the curve. This makes the study of long-term trends easier to perform. MAs can be taken over any length of time, whether that be a minute or a decade. There are some periods that are particularly useful, however, like the 50-day and 200-day MAs, which are of relevance in the current discussion. Related Reading: Bitcoin Adoption: Addresses Saw 2nd-Highest Rise In History This Weekend The interactions between these two Bitcoin MAs have apparently had consequences for the asset&#8217;s trend in the past, and the chart below shows how these two MAs have looked recently: Looks like the two metrics have approached each other in recent days &#124; Source: @jimmyvs24 on X Historically, whenever the 50-day MA has dipped below the 200-day MA, the cross has proved to be a bearish one for the cryptocurrency&#8217;s price. In the above graph, it&#8217;s visible that the last time this type of crossover occurred was in January 2022. Back then, the asset had been on its way down from its November 2021 all-time high and the death cross may have cemented the asset&#8217;s fate, as a long bear-market drawdown had followed afterward. The opposite type of crossover, where the short-term MA moves above the long-term one, has generally been a bullish cross instead, as the asset has usually enjoyed uptrends following it. This crossover had been seen earlier in this year as well, after which BTC had gone on to see some significant rise. Recently, however, as the cryptocurrency&#8217;s price has been struggling, the 50-day MA has started to go down and has now neared the 200-day MA. If the former continues in this trajectory and completes the cross below the latter, then another death cross would form for Bitcoin. Such a cross would be an ominous sign for the asset, as it could imply that a significant drawdown may be ahead for the coin. So far, though, the bearish cross hasn&#8217;t been fully confirmed yet. Related Reading: Bitcoin Price Bounces Back To $26,000, Here’s Why It now remains to be seen if the death cross will be completed in the coming days, or if BTC would turn itself around before it happens, leading to the 50-day MA pulling away from the 200-day MA for now. BTC Price Bitcoin has gone through a bit of a rollercoaster in the past two days, as its price had first dropped towards the $25,100 level, but has since already recovered above $26,100. BTC has sharply surged during the past day &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-12T16:07:32.000Z",
    "title": "Binance Charity’s $3 Million Aid: BNB Airdrop for Morocco Earthquake Victims",
    "url": "https://www.crypto-news-flash.com/binance-charitys-3-million-aid-bnb-airdrop-for-morocco-earthquake-victims/?utm_source=rss&utm_medium=rss&utm_campaign=binance-charitys-3-million-aid-bnb-airdrop-for-morocco-earthquake-victims",
    "description": "Binance Charity plans to distribute $3 million in Binance Coin (BNB) to users affected by the Morocco earthquake.  Binance will also provide $10 worth of BNB to active traders across Morocco, extending support beyond the earthquake-stricken areas. According to an official statement that Binance released today, the charity arm of the world-renowned cryptocurrency exchange is [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-12T16:00:56.000Z",
    "title": "Dogecoin or Bitcoin Spark: Breaking Down the Best Investment",
    "url": "https://www.crypto-news-flash.com/dogecoin-or-bitcoin-spark-breaking-down-the-best-investment/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-or-bitcoin-spark-breaking-down-the-best-investment",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-4-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-4-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-4-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-4-1-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Choosing the best cryptocurrency investment can be pivotal in the ever-expanding digital landscape. Among the projects making waves, Dogecoin and Bitcoin Spark present strong contention with their unique features, potential, and appeal.  Bitcoin Spark (BTCS) The Bitcoin Spark project soars with its fast-rising ICO and has attracted a massive following and widespread adoption. BTCS’s interest [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-12T16:00:37.000Z",
    "title": "Ripple’s XRP Price Takes a Hit, but a Key Metric Skyrockets by 140%",
    "url": "https://www.crypto-news-flash.com/ripples-xrp-price-takes-a-hit-but-a-key-metric-skyrockets-by-140/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-xrp-price-takes-a-hit-but-a-key-metric-skyrockets-by-140",
    "description": "<img width=\"1280\" height=\"783\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN-300x184.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN-1024x626.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN-768x470.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Despite XRP&#8217;s price fall from $0.49 to $0.47, its trading volume witnessed a monumental rise of 140% to reach $1.3 billion. Ripple intensifies its footprint in the cryptocurrency arena by acquiring Fortress Trust, signaling a profound commitment to the sector. The Dual Narrative of XRP: Volume and Valuation In a marketplace characterized by its volatility, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-12T15:59:12.000Z",
    "title": "VeChain’s Role in Revolutionizing Global Logistics with Blockchain",
    "url": "https://www.crypto-news-flash.com/vechains-role-in-revolutionizing-global-logistics-with-blockchain/?utm_source=rss&utm_medium=rss&utm_campaign=vechains-role-in-revolutionizing-global-logistics-with-blockchain",
    "description": "VeChain network is focused on introducing transparency in the global supply chain in different industries with the help of NFTs. The VeChain network has already partnered with several crucial enterprises including BMW, Walmart China, PwC, and DNV GL, among others. The use of blockchain technology by mainstream users has been widely anticipated to take place [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-12T16:03:00.000Z",
    "title": "BitBoy Crypto Ends: Team Embarks on New Beginning After Controversy",
    "url": "https://coinedition.com/bitboy-crypto-ends-team-embarks-on-new-beginning-after-controversy/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy.png 730w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/YouTuber_Bitboy_Ben_Armstrong_has_been_fired_from_his_company_Bitboy-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>BitBoy Crypto YouTube Channel has rebranded to “Discover Crypto” following weeks of internal disputes and the departure of former host and prominent crypto influencer Ben Armstrong. The team made this announcement in a video posted on YouTube titled “The END of BitBoy CRYPTO (WHAT Comes NEXT?) According to the video, the channel’s rebranding was necessitated [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitboy-crypto-ends-team-embarks-on-new-beginning-after-controversy/\">BitBoy Crypto Ends: Team Embarks on New Beginning After Controversy</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-12T15:52:43.000Z",
    "title": "Born for Initial Launches: Coinstore’s Brand Launch Conference Comes to a Successful Conclusion",
    "url": "https://coinedition.com/born-for-initial-launches-coinstores-brand-launch-conference-comes-to-a-successful-conclusion/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/CE-template-025.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"coinstore\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/CE-template-025.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/CE-template-025-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/CE-template-025-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/CE-template-025-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/CE-template-025-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/CE-template-025-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/CE-template-025-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/CE-template-025-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/CE-template-025-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/CE-template-025-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/CE-template-025-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/CE-template-025-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/CE-template-025-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/CE-template-025-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/CE-template-025-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/CE-template-025-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>On September 12, the crypto field ushered in an exciting moment. Serving emerging markets, Coinstore&#8217;s Brand Launch Conference 2023 successfully concludes at Singapore&#8217;s Fullerton Hotel. After more than two years of development, Coinstore makes its global brand debut. As one of the fastest growing trading platforms in 2022, Coinstore unites high-quality premium assets to empower [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/born-for-initial-launches-coinstores-brand-launch-conference-comes-to-a-successful-conclusion/\">Born for Initial Launches: Coinstore&#8217;s Brand Launch Conference Comes to a Successful Conclusion</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]