[
  {
    "source": "CoinDesk",
    "date": "2023-10-06T06:24:41.000Z",
    "title": "THORSwap Pauses Platform After Series of FTX Hack-Linked Trades",
    "url": "https://www.coindesk.com/tech/2023/10/06/thorswap-pauses-platform-after-series-of-ftx-hack-linked-trades/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A THORSwap developer said the team “stands firmly against any and all criminal actions” in a message to CoinDesk."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-06T06:21:40.000Z",
    "title": "Canadian regulatory body clarifies stablecoin rules for exchanges and issuers",
    "url": "https://cointelegraph.com/news/canada-regulator-csa-clarifies-stablecoin-rules",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/b740285b-becf-44a1-bd8e-6efedd4ee645.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The umbrella organization for Canada's securities regulators has set out conditions for the trading and issuance of stablecoins.</p>\n                    <p><p>The Canadian Securities Administrators (CSA) has provided guidance to exchanges and cryptocurrency issuers on its interim approach to what it calls value-referenced crypto assets, with a particular focus on <a href=\"https://cointelegraph.com/learn/stablecoins-101-what-are-crypto-stablecoins-and-how-do-they-work\">stablecoins</a>.</p><p>On Oct. 5, the umbrella organization of Canada’s provincial and territorial securities regulators <a href=\"https://www.securities-administrators.ca/news/canadian-securities-regulators-clarify-interim-approach-to-value-referenced-crypto-asset/\" target=\"_blank\" rel=\"noopener nofollow\">published</a> a clarification saying it may allow trading of certain cryptocurrencies that reference the value of a single fiat currency, subject to terms and conditions.</p><p>In February, the CSA reaffirmed its view that stablecoins “may constitute securities and/or derivatives” which Canadian crypto exchanges are prohibited from trading.</p><p>However, if issuers maintain an appropriate reserve of assets with a qualified custodian and crypto exchanges offering stablecoins make “certain information related to governance, operations, and reserve of assets publicly available,” then the CSA could allow for those assets to be traded.</p><p>CSA Chair and Chair and CEO of the Alberta Securities Commission, Stan Magidson, said in a statement: </p><blockquote>“This interim framework, which we will build upon in the future, sets certain standards to help ensure that investors receive the information they need about the assets they are purchasing, including the risks associated with them.”</blockquote><p>The CSA cautioned that fiat-backed crypto assets satisfying the terms are still risky and should not be viewed as endorsed or risk-free.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-canada-bitcoin-crypto-ownership-decline-2022-central-bank\"><strong><em>Canadian crypto ownership declines amid tight regulations, falling prices</em></strong></a></p><p>In August, Cointelegraph reported that <a href=\"https://cointelegraph.com/news/canada-s-regulatory-clarity-is-bringing-institutions-to-crypto-wonderfi-ceo\">regulatory clarity in Canada</a> has generated greater interest in crypto from institutions. </p><p>In July, the CSA issued <a href=\"https://cointelegraph.com/news/bitcoin-ether-best-support-canadian-regulator-explains-stance-on-crypto-staking-lending-for-investment-funds\">guidance on staking</a> stating that it was allowed but lending opportunities are limited and the proportion of “illiquid” assets is restricted.</p><p>Stablecoin market capitalization has been in decline over the past 18 months or so and is currently at $123 billion representing around 11% of the total crypto market cap. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\"><strong><em>Should you ‘orange pill’ children? The case for Bitcoin kids books</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  }
]