[
  {
    "source": "CoinDesk",
    "date": "2023-09-27T21:23:01.000Z",
    "title": "SEC’s Gensler Throws More Crypto Punches in Congressional Hearing",
    "url": "https://www.coindesk.com/policy/2023/09/27/secs-gensler-throws-more-crypto-punches-in-congressional-hearing/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "U.S. Securities and Exchange Commission (SEC) Chair Gary Gensler continued his combative stance against crypto \"hucksters\" in congressional testimony on Wednesday, declining to answer the industry's most urgent questions while arguing that digital assets companies have been dangerously careless with customer assets."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-27T21:30:26.000Z",
    "title": "Curve Founder Michael Egorov Clears Aave Loan, Reduces Total Debt To $42.7 Million",
    "url": "https://www.newsbtc.com/analysis/crv/curve-founder-michael-egorov-clears-aave-loan-reduces-total-debt-to-42-7-million/",
    "description": "Michael Egorov, founder of Curve Finance, has settled his loan on the Aave Protocol and cut his total debt to $42.7 million.  Egorov’s DeFi debt profile was revealed on August 1 following a Curve Finance hack that extracted $73.5 million worth of assets across various liquidity pools.  As expected, the exploit caused a significant decline in the price of CRV, with the Curve governance token losing over 24% of its value in a single day, based on data from CoinMarketCap. This fall in CRV’s market price brought much attention to Egorov’s multiple debt positions.  According to a report by blockchain research firm Delphi Digital, it was revealed that the Curve Finance founder owed around $100 million across several DeFi protocols. Interestingly, these loans were collateralized by 427.5 million CRV tokens, representing 47% of the entire CRV circulating supply.  Therefore, the dwindling price of CRV presented a threat of liquidation, which could have been dangerous to the entire DeFi ecosystem.  Related Reading: Curve Finance Announces $1.85 Million Bounty For Stable Pool Exploiter Michael Egorov Closes Debt Profile On Aave Protocol According to a report on Wednesday by the on-chain analytics platform Lookonchain, Micheal Egorov has now cleared his debt on the Aave protocol.  The report stated that the Curve Founder deposited 68 million CRV, worth $35.5 million, on DeFi lending protocol Silo before proceeding to borrow $10.77 million worth of the stablecoin crvUSD. After that, Egorov swapped the crvUSD tokens for USDT and finalized the repayment of his debt on the Aave Protocol.  Related Reading: Curve Finance Exploiter Returns 61,000 ETH After Protocol’s Stern Warning Egorov&#8217;s Current Debt Profile  Based on more data from Lookonchain, Michael Egorov’s total debt now stands at $42.7 million spread across 4 lending protocols: Fraxlend, Silo, Inverse Finance, and Cream Finance. In detail, the Curve Finance founder has his largest debt on Silo, where he owes 17.14 million crvUSD backed by 105.8 million CRV, worth $55.3 million. On Fraxlend, Egorov owes 13.08 million FRAX, collateralized by 68.7 million CRV, valued at $35.94 million.  While on Inverse Finance, Michael Egorov has an outstanding debt of 10 million DOLA, backed by 66.18 million CRV, worth $34.5 million. The Curve Finance founder’s lowest debt can be found on Cream Finance, which comprises 2.02 million USDT and 506,000 USDC, secured by 13 million CRV, valued at $6.8 million.  Altogether, Egorov’s $42.7 million debt is backed by 253.67 million CRV, worth $132.53 million, representing 28.87% of the total CRV circulating supply.  CRV trades at $0.516 when writing, with a 2.99% gain on the last day. Meanwhile, the token’s daily trading volume is down by 0.73%, valued at $33.85 million. CRV ranks as the 70th largest cryptocurrency with a market cap value of $452.87 million. CRV trading at $0.5161 on the hourly chart &#124; Source: CRVUSDT chart on Tradingview.com Featured image from Entrepreneur, chart from Tradingview"
  }
]