[
  {
    "source": "Cointelegraph",
    "date": "2023-06-25T21:50:31.000Z",
    "title": "Uncertainty over digital assets traps institutions in 'supervisory void' — Fed Governor ",
    "url": "https://cointelegraph.com/news/uncertainty-over-digital-assets-traps-institutions-in-supervisory-void-fed-governor",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a3c71d44-15a1-470f-99be-4abdc74372eb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Lack of clarity on digital assets could have significant consequences for banks navigating higher interest rates, according to Fed Governor Michelle Bowman.  </p>\n                    <p><p>During a speech at the Salzburg Global Seminar on bank regulation and supervision, Bowman called for attention from global regulators to the current supervision of novel banking activities, in particular banking as a service and digital assets. According to Bowman, financial institutions have been left in a \"supervisory void\" in terms of emerging technologies.</p><p>\"While there have been some efforts to provide guidance, there remains substantial uncertainty about the permissibility of and supervisory expectations for these activities [...]. This leaves banks in the perilous position of relying on general but non-binding statements by policymakers only to be criticized at some point in the future,\" said Bowman, whose term at the Fed ends in 2034.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Speech by Governor Bowman on bank regulation and supervision: <a href=\"https://t.co/LzwsKieEcx\">https://t.co/LzwsKieEcx</a></p>&mdash; Federal Reserve (@federalreserve) <a href=\"https://twitter.com/federalreserve/status/1672961035509145602?ref_src=twsrc%5Etfw\">June 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Moreover, the governor spoke of the risks posed by the current regulatory state, noting that without a clear regulatory framework, regulators may impose new requirements on businesses after significant investments have been made. \"If our role is effective supervision and regulation, we must be willing to engage in both the novel and traditional activities,\" she added. </p><p>Bowman joins dozens of other voices for a clear regulatory framework for digital assets. Ratings agency Moody's <a href=\"https://cointelegraph.com/news/bipartisan-support-crypto-regulation-attractive-to-firms-moodys\">warned on June 20 that investors and companies</a> could turn to other crypto-friendly jurisdictions without support from U.S. lawmakers for legislation focused on digital assets.</p><p>Lawmakers with the House Financial Services Committee and House Agriculture Committee have recently <a href=\"https://cointelegraph.com/news/us-lawmakers-aim-for-crypto-regulatory-clarity-with-proposed-bill-putting-the-screws-to-sec\">released a draft discussion offering certain crypto assets a pathway</a> to being labeled digital commodities. The draft bill would prohibit the U.S. Securities and Exchange Commission (SEC) from denying digital asset trading platforms registration as a regulated alternative trading system and would allow such firms to offer “digital commodities and payment stablecoins.”</p><p>Failure to provide a clear approach for financial institutions on novel technologies \"could have significant consequences for banks navigating higher interest rates,\" Bowman warned. </p><p>Michelle Bowman, member of the Board of Governors of the U.S. Federal Reserve System, has <a href=\"https://www.federalreserve.gov/newsevents/speech/bowman20230625a.htm\" target=\"_blank\" rel=\"noopener nofollow\">criticized</a> the absence of a clear regulatory framework for novel technologies in the United States.</p><p><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Magazine: Crypto regulation — Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-25T21:48:00.000Z",
    "title": "Monero Price Prediction 2023-2032: Should You Buy XMR Now?",
    "url": "https://www.cryptopolitan.com/monero-price-prediction/",
    "description": "Monero Price Prediction 2023-2032 This Monero Price Prediction will cover details about Monero, applications, price history, and factors affecting the native currency. There are plenty of things to consider before moving on to the Monero (XMR) price prediction. How much is Monero worth? Today&#8217;s Monero price is $162.36 USD with a 24-hour trading volume of $96,669,785 ... <a title=\"Monero Price Prediction 2023-2032: Should You Buy XMR Now?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/monero-price-prediction/\" aria-label=\"More on Monero Price Prediction 2023-2032: Should You Buy XMR Now?\">Read more</a>"
  }
]