[
  {
    "source": "Decrypt",
    "date": "2023-07-16T20:26:19.000Z",
    "title": "Judge in Coinbase Case Expresses ‘Skepticism’ Over SEC's Prior S-1 Approval",
    "url": "https://decrypt.co/148818/judge-in-coinbase-case-focuses-on-sec-s1-approval",
    "description": "The Judge appeared to align herself with Coinbase, saying its S-1 may have some legal weight."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-16T20:17:31.000Z",
    "title": "Ripple decision is 'troublesome on multiple fronts', says former SEC official ",
    "url": "https://cointelegraph.com/news/ripple-decision-is-troublesome-on-multiple-fronts-says-former-sec-official",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/4fec39a3-35f6-4753-8c4a-2993202c323b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to John Reed Stark, former attorney in the SEC's Enforcement Division, the ruling in favor of Ripple Labs \"resides on shaky ground\". </p>\n                    <p><p>Former Securities and Exchange Commission official John Reed Stark spoke out against the recent ruling on Ripple Lab's case,<a href=\"https://www.linkedin.com/pulse/ripple-decision-cause-crypto-celebration-momentarily-best-stark/\" target=\"_blank\" rel=\"noopener nofollow\"> calling</a> the decision \"troublesome on multiple fronts\" in a LinkedIn analysis.</p><p>Stark broke down Judge Analisa Torres' decision from July 13 by examining the grounds upon which she<a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\"> ruled in favor of Ripple in a lawsuit</a> brought by the SEC back in 2020, alleging that the company's XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) token was a security. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Some thoughts on the SEC/Ripple decision. <a href=\"https://t.co/A94kHlGI9N\">https://t.co/A94kHlGI9N</a> <a href=\"https://t.co/lcwWML49kO\">pic.twitter.com/lcwWML49kO</a></p>&mdash; John Reed Stark (@JohnReedStark) <a href=\"https://twitter.com/JohnReedStark/status/1679904748273532936?ref_src=twsrc%5Etfw\">July 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Judge Torres' verdict states that XRP token was a security when sold to institutional investors, but that it wasn't a security in 'programmatic sales' [public sales] and 'other types of sales', such as token distribution to employees. Ripple also faces a penalty for the alleged violation, as well as a rescission for institutional investors — whose sales reportedly involved $720 million.</p><p>In the decision, Judge Torres argues that institutional investors “reasonably expected that Ripple would use the capital it received from its sales to improve the XRP ecosystem and thereby increase the price of XRP,” while the investors who used exchanges to buy XRP tokens “could not reasonably expect the same.”</p><p>For Stark, the decision establishes a \"class of quasi-securities that discriminates\" based on the sophistication of the investor buying the token.</p><blockquote>\"The Ripple Decision holds that the same exact token can be a security sometimes but not a security other times. And the more ignorance and willful blindness by retail investors, than the less protection the retail investors will receive. And the less disclosure about the token, then the less liability for the token issuer. That just can’t be right.\"</blockquote><p>Stark also notes that this argument seems contrary to investors protection principles, which state that an investor's level of protection should not be affected by whether they read materials related to the purchase of an asset. \"Securities laws were specifically designed to protect individual investors, based on the idea that they can’t fend for themselves [...]. The Ripple decision turns this notion on its head,\" Stark noted. </p><p>In Stark's view, who served as an attorney for over 18 years in the SEC's Enforcement Division, the \"decision resides on shaky ground, is likely (and ripe) for appeal, will likely result in reversal.\" </p><p>\"The bottom line: Stock is always stock – it can’t transmogrify into 'not stock.' So my take is that the SEC will appeal the Ripple decision to the 2nd Circuit and the 2nd Circuit will overturn the District Court’s rulings related to 'programmatic' and 'other sales',\" he noted.</p><p>Judge Torres' ruling was received as a victory by the crypto community and Ripple. The company's CEO Brad Garlinghouse said during a recent interview that the SEC might face a <a href=\"https://cointelegraph.com/news/sec-file-appeal-ripple-case-brad-garlinghouse\">prolonged process before having the chance to appeal</a> the decision. In addition, Garlinghouse called the institutional sale decision \"the smallest piece\" of the lawsuit, and said that an appeal by the SEC against the retail sale ruling would only bolster Torres' ruling.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/coinbase-pauses-staking-services-following-regulators-orders&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Magazine: Crypto regulation — Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-07-16T20:34:24.000Z",
    "title": "What is Worldcoin: the iris-scanning crypto project that sparks privacy debates",
    "url": "https://crypto.news/what-is-worldcoin-the-iris-scanning-crypto-project-that-sparks-privacy-debates/",
    "description": "Worldcoin, by OpenAI&#8217;s Sam Altman, combines blockchain and UBI, igniting privacy and security debates. Will this iris-scanning global financial network shape socio-economic reform? The internet has always been a breeding ground for the bizarre and the extraordinary. As AI technologies&#8230;"
  }
]