[
  {
    "source": "Cointelegraph",
    "date": "2023-08-23T00:44:15.000Z",
    "title": "Australian CBDC could be useful for payments, tokenization, says RBA",
    "url": "https://cointelegraph.com/news/australia-rba-cbdc-pilot-finds-uses-payments-tokenization",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/70720218-4bc3-4fdd-944f-f3382a85edde.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The RBA has wrapped up its CBDC pilot program and outlined four key areas that could be improved by the introduction of central bank-issued digital currency. </p>\n                    <p><p>Australia's central bank has completed it's pilot of a central bank digital currency (CBDC) exploring use cases for a potential e-AUD, finding its useful in four main areas including enabling complex payments and asset tokenization.</p><p>The Reserve Bank of Australia (RBA) and the Digital Finance Cooperative Research Centre (DFCRC) unveiled their findings in an Aug. 23 <a href=\"https://www.rba.gov.au/payments-and-infrastructure/central-bank-digital-currency/pdf/australian-cbdc-pilot-for-digital-finance-innovation-project-report.pdf\" target=\"_blank\" rel=\"noopener nofollow\">report</a> that also detailed a number of cases where a CBDC wasn't exclusively required to achieve the stated use case.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We’ve released a report with the Digital Finance CRC <a href=\"https://twitter.com/DigiFinanceCRC?ref_src=twsrc%5Etfw\">@DigiFinanceCRC</a> today on the findings from an Australian central bank digital currency pilot.<a href=\"https://t.co/k3Zn0VFbwG\">https://t.co/k3Zn0VFbwG</a> <a href=\"https://twitter.com/hashtag/RBA?src=hash&ref_src=twsrc%5Etfw\">#RBA</a> <a href=\"https://twitter.com/hashtag/CBDC?src=hash&ref_src=twsrc%5Etfw\">#CBDC</a> <a href=\"https://twitter.com/hashtag/Payments?src=hash&ref_src=twsrc%5Etfw\">#Payments</a> <a href=\"https://twitter.com/hashtag/DigitalPayments?src=hash&ref_src=twsrc%5Etfw\">#DigitalPayments</a> <a href=\"https://twitter.com/hashtag/Blockchain?src=hash&ref_src=twsrc%5Etfw\">#Blockchain</a> <a href=\"https://twitter.com/hashtag/FinTech?src=hash&ref_src=twsrc%5Etfw\">#FinTech</a> <a href=\"https://t.co/N3mp1ID6gd\">pic.twitter.com/N3mp1ID6gd</a></p>— Reserve Bank of Australia (@RBAInfo) <a href=\"https://twitter.com/RBAInfo/status/1694137648674152682?ref_src=twsrc%5Etfw\">August 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The pilot found four primary areas which could be improved by a CBDC including the enablement of \"smarter\" payments where a tokenized CBDC enabled a range of complex payment arrangements that were not currently supported by existing payment systems.</p><p>Additionally, the report detailed that a CBDC may support financial markets innovation such as debt securities markets, promoted innovation in emerging private digital money sectors and enhanced resilience and inclusion within the wider digital economy. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/bde8f879-f5f3-4f1d-9575-79d430df109b.png\"><figcaption style=\"text-align: center;\"><em>The pilot found a CBDC could be useful in four main areas, including for some payments and asset tokenization. Source: RBA</em></figcaption></figure><p>The CBDC pilot program was structured as a real legal claim on the RBA rather than a proof-of-concept which caused uncertainty over its legal status and regulatory treatment with participants.</p><p>\"Some participants were uncertain if they were providing custody services or dealing in a regulated financial product because of holding or dealing in the pilot CBDC,\" the report said. \"These issues would ideally be anticipated and resolved in any legal and regulatory reforms that accompany the issuance of a CBDC.\"</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-23T01:00:40.000Z",
    "title": "Bitcoin dips but options market holds steady",
    "url": "https://cryptoslate.com/bitcoin-dips-but-options-market-holds-steady/",
    "description": "<p>Last week, the crypto market experienced a massive sell-off that sent Bitcoin&#8217;s price down to as low as $25,000. The sharp market movement ended several months of unprecedented calmness in the crypto market. Previous CryptoSlate analysis pinpointed the derivatives market as the primary catalyst for the aggressive sell-off. The futures market saw a significant deleveraging [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-dips-but-options-market-holds-steady/\">Bitcoin dips but options market holds steady</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-23T01:00:00.000Z",
    "title": "Camino approved by Hexens after successful audit",
    "url": "https://crypto.news/camino-approved-by-hexens-after-successful-audit/",
    "description": "Camino, a blockchain serving the global travel industry, has been successfully audited by Hexens, a cybersecurity service provider"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T01:00:37.000Z",
    "title": "Bitcoin Chicken Game: Why Losing This Level Could Send BTC Back To $20,000",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-chicken-game-why-losing-this-level-could-send-btc-back-to-20000/",
    "description": "The price of Bitcoin has stalled again around its current levels as an explosion in downside volatility broke critical support. The cryptocurrency is trapped between major players waiting and positioning for the next move; which side will prevail in this battle? Related Reading: Bitcoin On-Chain Data Suggests Price Is Top Heavy, What It Means As of this writing, Bitcoin trades at $26,000 with sideways movement in the last 24 hours. In the previous seven days, the cryptocurrency recorded a 12% correction which has severely impacted other assets in the sector, notably XRP and Binance Coin (BNB), which recorded losses north of 15% in the same period. Retail Traders Likely To Push Bitcoin Price Lower? In a report from Bitfinex Alpha, an analyst points out the influence of the derivatives sector on the spot Bitcoin price. Last week, BTC’s volatility was compressed, declining into historical lows, but a negative delta (high selling pressure) persisted, moving the price lower. At the time, Bitcoin dropped enough to trigger a liquidation cascade, which was potentially worsened by a prominent trader being forced out of their position on a crypto exchange, the report speculated. The chart below shows that Open Interest in the derivatives sector followed BTC’s price action. This market dynamics left Bitcoin in its current state. Analysts from Material Indicators called it a “game of chicken” between prominent players waiting to see if enough liquidity will be added to support the current levels or if the selling pressure will return. The analysts indicated that the BTC price orderbook is the thinnest in 6 months while adding the following: (…) we are seeing small amounts of bid liquidity ladder up from $20k closer to the active trading zone, but no liquidity of any size (new or moved) has been stacked into the range defending price from a Lower Low. Needless to say, printing a LL in this TF has macro implications. Printing 2 LLs would push #BTC down to sub $20k levels. Material Indicators showed that when the price of Bitcoin broke below critical support, most of the selling was done by relatively small traders. However, whales likely used small selling orders to reduce slippage and push prices down to current levels. Related Reading: 3rd Biggest Bitcoin Stash Now Belongs To Unknown Wallet, Amassed In Over 3 Months A similar scenario seems likely if the BTC price slowly bleeds into critical support triggering another liquidation cascade. In the meantime, the number one cryptocurrency seems bound to carry on its game of Chicken between large players. Cover image from Unsplash, chart from Tradingview"
  }
]