[
  {
    "source": "Cointelegraph",
    "date": "2023-07-10T18:42:00.000Z",
    "title": "How to use third-party ChatGPT plugins",
    "url": "https://cointelegraph.com/news/how-to-use-third-party-chatgpt-plugins",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/751b1339-473c-4a70-9879-c30e545cf4bf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>ChatGPT currently supports third-party plugins with different functionalities that augment ChatGPT’s utility. </p>\n                    <p><p>After its release on Nov. 30, 2022, the <a href=\"https://cointelegraph.com/news/is-chatgpt-king-how-top-free-ai-chatbots-fared-during-field-testing\">OpenAI-created ChatGPT</a>, an artificial intelligence (AI) language processing tool, captivated the world. Its mind-bending ability to generate content, effortlessly mimicking human language intricacies, enthralled users worldwide and was one of the main reasons behind its rapid rise in popularity.</p><p>Trained on a vast corpus of data spanning an expansive array of literary works and online sources, ChatGPT ushered in an era where AI impacts communication, computations, transcriptions, <a href=\"https://cointelegraph.com/news/5-ai-tools-for-translation\">translations</a> and more.</p><p>While ChatGPT’s standard capabilities are already being utilized in a wide range of environments, both OpenAI and third-party developers are working to enhance its capabilities through plugins.</p><p>In March 2023, OpenAI<a href=\"https://openai.com/blog/chatgpt-plugins\" target=\"_blank\" rel=\"noopener nofollow\"> unveiled</a> its own library of ChatGPT plugins alongside a<a href=\"https://cointelegraph.com/news/7-chatgpt-plugins\"> collection of third-party plugins</a>. The initial list of third-party plugins included offerings from renowned companies like Expedia, Instacart, OpenTable, Kayak, Milo, Slack and Shopify.</p><h2>What are the benefits of using third-party ChatGPT plugins?</h2><p>Third-party ChatGPT plugins play a pivotal role in improving the capabilities of ChatGPT. The following outlines some of the main advantages of using third-party ChatGPT plugins:</p><h3>ChatGPT enhancements for improved functionality</h3><p>Third-party plugins augment ChatGPT’s aptness by incorporating novel features and services beyond its foundational capabilities. Some of the chatbot enhancements offer industry-specific solutions to counter unique challenges by configuring ChatGPT capabilities in a way that enables nuanced workflows and compliance with internal standards.</p><p>For example, plugins designed for use in the healthcare industry can be set up to use medical terminology, and to come up with possible diagnoses based on patient symptoms and tests. Third-party plugin developers bolster ChatGPT’s efficacy across a broader range of sectors by honing in on industry-specific use cases.</p><h3>Removal of limitations</h3><p>Third-party plugins enhance the ChatGPT user experience by unlocking various features beyond what the standard ChatGPT version offers. For instance, certain plugins can utilize information released after 2021, whereas the standard ChatGPT tool can only access information up to 2021.</p><p>Many plugins rely on dedicated services that provide access to more recent data, enabling them to have this capability.</p><h2>How to install third-party ChatGPT plugins</h2><p>The first step in installing ChatGPT plugins is obtaining a ChatGPT Plus subscription, as ChatGPT plugins are exclusively available to ChatGPT Plus users. Once you have a ChatGPT Plus subscription, log in to your account, locate the “Settings” icon in the bottom left corner of the page and click on it. This will direct you to the settings menu.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/193161c5-886d-4c72-ad9f-0531e87d5a00.jpg\"  /></figure><p>Within the settings menu, you will find the “Beta Features” section. Click on it to access the settings for beta features. Inside the “Beta Features” section, toggle the “Plugins” button to enable plugin support and then select “New Chat” from the dropdown menu situated in the top left area of the page.</p><p>Once completed, switch the ChatGPT version to GPT-4. The next step is to access the Plugin Store by clicking “Plugins” on the menu and selecting “Plugin Store.” This will allow you to manage and install ChatGPT plugins.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/e08a55ad-2e61-4e12-a030-c69beb65b9a9.jpg\"  /></figure><p>Take your time to carefully browse through the options and select the plugins that you wish to install. To initiate the installation process, click the “Install” button for the respective plugin.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/66277245-62d8-473a-847f-2f96087d7223.jpg\"  /></figure><p>Once the installation process is complete, you can begin using the installed plugins. So, are ChatGPT plugins free? Yes, the plugins are free and available via a ChatGPT Plus subscription.</p><h2>What features do third-party ChatGPT plugins offer?</h2><p>Third-party ChatGPT plugins are used for numerous purposes based on their functionality. The following is a breakdown of how to use plugins with ChatGPT and some of the main purposes of third-party ChatGPT plugins:</p><h3>Retrieval</h3><p>Some third-party ChatGPT plugins are used for retrieval purposes. Many of them are designed to optimize the procuring of pertinent data from a vast knowledge base. Instead of relying solely on ChatGPT’s generative faculties, these plugins harness pre-indexed data from internal records to swiftly retrieve information.</p><p>By employing indexing methodologies or specialized search algorithms, these plugins enable ChatGPT to access specific information, hasten response times and increase response accuracy.</p><p>The ChatGPT Retrieval plugin is an example of a ChatGPT plugin developed for retrieval purposes. The plugin has semantic search capabilities allowing it to retrieve data from third-party sources. </p><p>Users who use the plugin can obtain relevant information by querying ChatGPT with relevant questions, which are then processed and conveyed using natural language. The plugin was developed for organizations seeking to enhance convenience by making their internal documents more readily accessible to their staff through ChatGPT.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/7bec1ba3-b967-446a-80c2-566d894bd8d2.jpg\"  /></figure><h3>Computation</h3><p>Some ChatGPT plugins are designed for computation purposes. The plugins are used for extending ChatGPT functionality by integrating AI with mathematical libraries or frameworks that allow for the solving of unique arithmetic and other computational tasks.</p><p>Many plugins analyze the user’s input to identify mathematical expressions embedded within the conversation. They then process these expressions using the underlying mathematical libraries.</p><p>Once the computations are performed, the plugins generate an appropriate response that includes relevant information related to the computation and the computed result.</p><p>The Wolfram ChatGPT plugin is an example of a computation plugin designed for ChatGPT customization and integration. The plugin allows ChatGPT to leverage real-time data and the unique computational capabilities offered by the Wolfram technology stack to enhance ChatGPT’s proficiency in providing insightful and data-driven responses. </p><p>This is made possible by harnessing Wolfram|Alpha technology, which encompasses computation algorithms that can calculate various mathematical problems, including differential equations and linear algebra.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/36309a92-a9ff-4ef2-b41a-9d05718b8b29.jpg\"  /></figure><h3>Visualization</h3><p>Third-party ChatGPT visualization plugins are designed to integrate visualizations and graphical representations into the responses generated by ChatGPT, enabling users to comprehend and interpret data and trends more intuitively. The visualizations are usually presented using diagrams, charts, graphs and related visual representations.</p><p>They facilitate the analysis of users’ input in ChatGPT to discern the type of visualization required and then present the queried data in the appropriate format.</p><p>That said, ChatGPT visualization plugins vary in how they work due to their varied designs. Some plugins, for example, offer domain-specific visualizations, while others may have a more general-purpose approach.</p><p>The Polygon ChatGPT plugin is an example of a domain-specific third-party ChatGPT plugin used to generate data visualizations. The plugin aids users in exploring real-time and historical market trends in financial markets by presenting the information in a visual format for a more gradated data presentation. It covers stocks, forex, options, indexes and crypto markets. Some general-purpose third-party plugins, such as Notable, which create computational notebooks, can also be used to create data visualizations.</p><h3>Other functionalities</h3><p>Besides the functionalities above, ChatGPT plugins can recommend online shopping items, create travel recommendations, enable ChatGPT browsing, and even assist with coding and transcription. The possibilities are essentially boundless due to the unique functionalities of the plugins.</p><p>Apart from the standard plugins, there are also ChatGPT Chrome extensions that integrate with ChatGPT. The extensions allow users to directly engage with the AI within the Chrome browser window. Some enhance users’ search experiences by displaying the AI’s responses alongside results from search engines.</p><h2>Are third-party ChatGPT plugins reliable?</h2><p>It’s important to note that while third-party plugins can expand ChatGPT’s capabilities, they are not part of the core model and have their own limitations. The effectiveness of these plugins depends on their design, quality of integration, and the data and services they have access to.</p><p>Additionally, ChatGPT plugins typically require human input to ensure that the information they generate is accurate and reliable, so their output is likely to be less refined without supervision.</p><p>The other limitation is that third-party plugin developers are likely to provide varying levels of support. As a result, the frequency of updates and the reliability of the plugins can vary significantly.</p><h2>The future of ChatGPT plugins</h2><p>Third-party ChatGPT plugins are expected to bring significant advancements and innovations to further augment the <a href=\"https://cointelegraph.com/news/generative-ai\">generative large language model’s</a> versatility, utility and ChatGPT resources.</p><p>Future plugin developments will likely enable them to provide more refined responses. Besides this, <a href=\"https://cointelegraph.com/news/how-regulators-are-mitigating-the-risk-of-extinction-from-ai-law-decoded-may-29-june-5\">ethical considerations</a> will likely play a pivotal role in the future development of ChatGPT plugins as AI regulations loom. As such, plugin developers will likely incorporate more bias mitigation mechanisms to ensure that responses are fair and adhere to ethical standards.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/how-to-use-third-party-chatgpt-plugins&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-10T19:00:28.000Z",
    "title": "Analyst: Expect Altcoin Season After Bitcoin Halves In 2024",
    "url": "https://www.newsbtc.com/bitcoin-news/analyst-expect-altcoin-season-after-bitcoin-halves-in-2024/",
    "description": "A crypto analyst on Twitter expects altcoin prices to be muted in the second half of 2023. Data indicate that the fate of altcoins and the possibility of an &#8220;alt season&#8221; is highly dependent on the performance of Bitcoin. Being the foremost cryptocurrency and market leader, according to CoinMarketCap data, Bitcoin&#8217;s impact on altcoins cannot be underestimated. Altcoins Are In Accumulation Phase, Waiting On Bitcoin? In his assessment, altcoins are currently in the &#8220;accumulation phase,&#8221; which has kept the sector at a market cap between $290 billion and $460 billion for the past few trading months. This trend, he forecasts, will likely continue until next year, when Bitcoin is expected to halve its block reward to 3.125 BTC.  Considering the performance of Bitcoin after past halving events, the cryptocurrency could see further profits as the event nears. This, in turn, factoring in the direct correlation between Bitcoin and altcoins, will likely trigger an &#8220;altcoin season.&#8221; Related Reading: PEPE Bulls Losing Steam? Fatigue Appears To Undermine Price Rally To cement his market preview, he shared a screenshot depicting the total market capitalization of altcoins excluding Bitcoin and Ethereum, revealing extended periods of sideways trading during previous bear markets. Extending from this outlook, the analyst expects altcoins&#8217; price movements to be limited until after the halving event, as seen in the chart below.  Historically, Bitcoin surges tend to support altcoins, a trend observed in recent cycles. Altcoin&#8217;s relatively thin liquidity often leads to price gains outpacing the more liquid BTC. Conversely, whenever Bitcoin prices crash, altcoins tend to collapse faster. Most Altcoins Are Weak?  In recent months, Bitcoin has been firm, rising 80% in H1 2023 after prices bottomed up in late 2022. On the other hand, despite the direct correlation, most altcoins remain suppressed, down from 2021 peaks. To illustrate, coins like ADA, SOL, DOGE, ALGO, and others are down roughly 85% from 2021 peaks and remain under pressure when writing on July 10. Regulatory headwinds and generally suppressed market conditions have worsened sentiment, diffusing upside momentum. The U.S. Securities and Exchange Commission (SEC) recently alleged that several altcoins, including SOL and ADA, are securities, a comment that saw prices dump in June. Related Reading: Stellar (XLM) Sheds 13% As Bearish Sentiment Takes Over The only outlier among altcoins is XRP. Optimism in the ongoing legal battle between Ripple and the SEC has supported the coin, forcing prices to diverge from other altcoins. Even so, the final ruling will likely significantly impact prices and volatility. Currently, XRP is trading below $0.50 but is up roughly 45% from 2022 lows and is firm, trading in a bullish formation above $0.45.  XRP will likely tear higher if a favorable ruling supports Ripple&#8217;s assertion that XRP, a coin they use in their On-Demand Liquidity (ODL) platform, is not a security but a utility like Bitcoin. A ruling in support of the SEC would trigger a sell-off, possibly unwinding recent gains. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-10T18:51:11.000Z",
    "title": "Vechain’s Vision: Blockchain Integration and Digital Transformation at Global Scale",
    "url": "https://www.crypto-news-flash.com/vechains-vision-blockchain-integration-and-digital-transformation-at-global-scale/?utm_source=rss&utm_medium=rss&utm_campaign=vechains-vision-blockchain-integration-and-digital-transformation-at-global-scale",
    "description": "<img width=\"1000\" height=\"640\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/RuskaDesign-VeChain-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Coinbase adds two new digital assets, they are VeChain and VeThor additionally Bince U.S includes VET in the list of 10 selected cryptocurrencies offering both USD and USDT trading.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/RuskaDesign-VeChain-1.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/RuskaDesign-VeChain-1-300x192.jpg 300w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />VeChain is bolstering its foothold in the blockchain world with a number of new developers being onboarded. The VeChain protocol is set to launch a number of products and ink partnerships to advance its sustainability agenda. According to a blog post, VeChain developers have been keen on developing solutions to enhance the entire ecosystem since [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-10T18:40:50.000Z",
    "title": "Shiba Inu Altcoin Soars as Shytoshi Kusama Announces ‘Shibapendence Day’ Ahead of Layer-2 Launch",
    "url": "https://www.crypto-news-flash.com/shiba-inu-altcoin-soars-as-shytoshi-kusama-announces-shibapendence-day-ahead-of-layer-2-launch/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-altcoin-soars-as-shytoshi-kusama-announces-shibapendence-day-ahead-of-layer-2-launch",
    "description": "<img width=\"1200\" height=\"600\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/shiba-6763358_1920-1200x600-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shiba Inu Holding a $GOLDEN Token\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/shiba-6763358_1920-1200x600-1.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/shiba-6763358_1920-1200x600-1-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/shiba-6763358_1920-1200x600-1-1024x512.jpg 1024w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />The announcement of Shibapendence Day had a profound impact on Bone ShibaSwap (BONE). SHIB has achieved a significant milestone, highlighting its rapid adoption and increasing utility.  The Shiba Inu (SHIB) ecosystem has experienced a rapid surge following the introduction of the first &#8220;truly decentralized exchange&#8221; by its lead developer, just before the anticipated launch of [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-10T18:45:53.000Z",
    "title": "Polygon (MATIC) Developer Announces Promotion of Web3 Veteran As Company’s New CEO",
    "url": "https://dailyhodl.com/2023/07/10/polygon-matic-developer-announces-promotion-of-web3-veteran-as-companys-new-ceo/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/matic-jumps-spike-built.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/matic-jumps-spike-built.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/matic-jumps-spike-built.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/matic-jumps-spike-built.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/matic-jumps-spike-built.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/matic-jumps-spike-built.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/matic-jumps-spike-built.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The developer behind the Ethereum (ETH) layer-2 scaling solution Polygon (MATIC) just announced the promotion of its chief legal officer to CEO. Web3 veteran Marc Boiron is taking the helm of Polygon Labs as the company’s president, Ryan Watt, is set to step down at the end of the month to take on an advisory [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/10/polygon-matic-developer-announces-promotion-of-web3-veteran-as-companys-new-ceo/\">Polygon (MATIC) Developer Announces Promotion of Web3 Veteran As Company’s New CEO</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-10T18:41:56.000Z",
    "title": "Another Massive Wave of Capital From Institutional Investors Hits Bitcoin and Crypto Markets: CoinShares",
    "url": "https://dailyhodl.com/2023/07/10/another-massive-wave-of-capital-from-institutional-investors-hits-bitcoin-and-crypto-markets-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/Open-Institutional-Floodgates-crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/Open-Institutional-Floodgates-crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/Open-Institutional-Floodgates-crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/Open-Institutional-Floodgates-crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/Open-Institutional-Floodgates-crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/Open-Institutional-Floodgates-crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/Open-Institutional-Floodgates-crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says institutional investors are still bullish on Bitcoin (BTC) and altcoins as crypto sees over $136 million in inflows last week. In its latest Digital Asset Fund Flows Weekly Report, CoinShares finds that institutional investors poured $136 million into the crypto markets last week, the third week of significant inflows in a row. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/10/another-massive-wave-of-capital-from-institutional-investors-hits-bitcoin-and-crypto-markets-coinshares/\">Another Massive Wave of Capital From Institutional Investors Hits Bitcoin and Crypto Markets: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]