[
  {
    "source": "CoinDesk",
    "date": "2023-08-07T16:44:06.000Z",
    "title": "Mantle Introduces New Governing Body for Treasury Management",
    "url": "https://www.coindesk.com/business/2023/08/07/mantle-introduces-new-governing-body-for-treasury-management/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The new layer 2 network passed a governance vote that establishes the Mantle Economics Committee as well as introduces more liquid staking into the ecosystem by authorizing liquid staking protocol Mantle LSD and the allocation of 40,000 ETH from its treasury to stETH."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-07T16:57:18.000Z",
    "title": "Investment Analyst Predicts a 50% Chance of Bitcoin Dipping Below $25,000 Before a Bull Run",
    "url": "https://www.cryptoglobe.com/latest/2023/08/investment-analyst-predicts-a-50-chance-of-bitcoin-dipping-below-25000-before-a-bull-run/",
    "description": "In a recent post on X, the platform formerly known as Twitter, Timothy Peterson, a prominent expert in alternative investments, made a bold prediction about the future of Bitcoin. According to Peterson, who works at Cane Island Alternative Advisors (which is a registered investment advisor offering advisory services in the State of Texas and in […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-07T17:00:00.000Z",
    "title": "Could Trump’s Links to Crypto Add up to His Charges?",
    "url": "https://cryptodaily.co.uk/2023/08/could-trumps-links-to-crypto-add-up-to-his-charges",
    "description": "<p>Records of Trump&rsquo;s and his inner circle&rsquo;s crypto promotions could be used against him in court and the upcoming presidential race.</p>\nFirst US President to Ever Be Indicted\n<p>Former US President. Donald J. Trump is the first American leader to ever be indicted. Trump is currently facing numerous charges in connection with at least three criminal cases including hush money payments, mishandling of classified documents, and the January 6 insurrection case, an effort to overturn the 2020 election. The 45th President of the US pleaded not guilty to all of the counts. However, the investigation continues. Trump might also face charges related to the election interference in the state of Georgia in 2020.&nbsp;</p>\n<p>As for crypto, some suggest that Trump&rsquo;s and his inner circle&rsquo;s involvement in activities related to digital assets could add up to the criminal charges against the former president and decrease his chances of reelection.</p>\nTrump Family Jumps into NFT Space\n<p>Former first lady, Melania Trump, was the first one to release an NFT collection called &ldquo;Melania&rsquo;s Vision&rdquo;on the Solana blockchain back in 2021. However, Melania Trump was later accused of buying the winning bid of her NFT auction in an effort to inflate the price of the collection.</p>\n<p>This year, Melania Trump launched another batch of NFTs titled &ldquo;The 1776 Collection&rdquo;, timed for the US Independence Day, which seemed to have rolled out smoothly. Yet, her most recent NFT collection with the theme of Apollo 11 may have got the former first lady in trouble with NASA! Apparently, the agency doesn't approve of its images being used in connection with NFTs.</p>\n\n<p>&ldquo;NASA is not approving any merchandising applications involving Non-Fungible Tokens (NFTs), as they are not consistent with the categories of products the agency is approved to merchandise,&rdquo; the document on the NASA website reads.&nbsp;</p>\n\nDonald Trump&rsquo;s Controversial NFT Collection\n<p>Even though Doland Trump had previously spoken out against crypto, he later followed his wife&rsquo;s steps and dropped his own NFT collection, &ldquo;Trump Digital Trading Cards&rdquo;. The first batch of NFTs, priced at $99 each, was sold within just 12 hours, raising over $5 million in the process. However, the floor price of the collectibles quickly dipped after.</p>\n<p>Ironically, what made the NFT collection surge in price again (by a whopping 462%!) was the news about the former president's indictment and his arrest in New York City. Following the sudden success of the collection, in April 2023, Trump decided to launch the second series of his &ldquo;Digital Trading Cards&rdquo;.&nbsp;</p>\n<p>The Trump-branded NFTs were widely criticized and ridiculed both in the political and crypto spaces. It was recently revealed that the 45th President had made somewhere between $500,000 and $1 million on the sale of his collection so far. It is not clear what Trump will use this money for. Some speculate that the sum is aimed at funding the former president&rsquo;s legal battles.</p>\n<p>Donald Trump will be running for president again in the upcoming 2024 election, along with other pro-crypto candidates.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T17:06:17.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T17:03:39.000Z",
    "title": "Credit Suisse’s massive job cuts in Hong Kong",
    "url": "https://www.cryptopolitan.com/credit-suisses-massive-job-cuts-in-hong-kong/",
    "description": "It&#8217;s a choppy sea for Credit Suisse&#8217;s investment banking personnel based in Hong Kong, as the storm of massive layoffs hits the financial hub. As the Swiss banking giant merges with UBS Group, roughly 80% of its investment banking workforce in Hong Kong is set to vanish, according to insider sources. This puts a dark ... <a title=\"Credit Suisse&#8217;s massive job cuts in Hong Kong\" class=\"read-more\" href=\"https://www.cryptopolitan.com/credit-suisses-massive-job-cuts-in-hong-kong/\" aria-label=\"More on Credit Suisse&#8217;s massive job cuts in Hong Kong\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T16:58:03.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T16:57:38.000Z",
    "title": "Lido’s July 2023 report reveals surge in total value locked and adoption",
    "url": "https://www.cryptopolitan.com/lidos-july-2023-report-reveals-surge-in-total-value-locked-and-adoption/",
    "description": "In July 2023, the Lido protocol, a prominent Ethereum staking platform, showcased significant advancements in its performance and collaborations. It is important to know that the Total Value Locked (TVL) in Lido surpassed the $15 billion mark, a threshold not witnessed since May 2022. This growth is particularly noteworthy given the recent decline in the ... <a title=\"Lido&#8217;s July 2023 report reveals surge in total value locked and adoption\" class=\"read-more\" href=\"https://www.cryptopolitan.com/lidos-july-2023-report-reveals-surge-in-total-value-locked-and-adoption/\" aria-label=\"More on Lido&#8217;s July 2023 report reveals surge in total value locked and adoption\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T16:49:52.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T16:40:46.000Z",
    "title": "What if the BRICS and the SCO merge? – What then?",
    "url": "https://www.cryptopolitan.com/what-if-the-brics-and-the-sco-merge/",
    "description": "Global geopolitics has long been a game of intricate chess, with power blocs rising and falling, forging alliances, and pushing their agendas. The current climate of international relations and global conflict – a setting that one Indian analyst boldly labels as the onset of World War III – presents us with a thought-provoking question: What ... <a title=\"What if the BRICS and the SCO merge? &#8211; What then?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/what-if-the-brics-and-the-sco-merge/\" aria-label=\"More on What if the BRICS and the SCO merge? &#8211; What then?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-07T17:00:50.000Z",
    "title": "Is Worldcoin Just Another LUNA? Crypto Influencer Reveals",
    "url": "https://www.newsbtc.com/altcoin/is-worldcoin-just-another-luna-crypto-influencer-reveals/",
    "description": "Worldcoin (WLD) has recently emerged as a subject of fervent discussion especially due to its biometric data collection through retina scans. Its launch came in amid the growing interest in decentralized finance (DeFi) and blockchain technology as well as new tokens and projects constantly striving to stand out and make a significant impact. Among the voices guiding investors through the labyrinthine world of crypto is Jordi Alexander, a renowned crypto influencer and the chief alchemist of the Mantle Network. Recently, he stirred conversations by drawing a parallel between Worldcoin and LUNA, though not entirely for auspicious reasons. Related Reading: Short-Lived Hype: Worldcoin (WLD) Signups Dwindle Less Than A Week After Launch According to the crypto influencer, Worldcoin might just be the next LUNA given some factors that comes with the token&#8217;s objective which makes it similar to LUNA which was portrayed as a &#8220;new digital currency&#8221; that needed to &#8220;maximize adoption in order to become useful.&#8221; The most important thing you need to know about Worldcoin is that it aims to become a currency. An unbacked currency used for monetary transactions. A.K.A. base money. Sound familiar? pic.twitter.com/9MdLAnqqEQ — Jordi Alexander (@gametheorizing) July 29, 2023 The Rise Of Worldcoin And Its Ambitions Worldcoin, under the vision of Sam Altman &#8211; the brains also behind ChatGPT, has made headlines with its mission. The Worldcoin Foundation envisions creating the largest decentralized identity and financial network on the globe. Central to this vision is Worldcoin’s native token, WLD. For the project to be successful, WLD&#8217;s widespread adoption is imperative, as is its ability to service the &#8220;Orbs&#8221; used in the new user onboarding process via retina scans. Lets put aside the eyeball scanning weirdness. And the VC allocations and Market Maker deals, the ZK-proofs and the Low-float tokenomics. &#8212;-&#62; The crypto-economics of Worldcoin are ill-considered and potentially very dangerous. Here&#8217;s why $WLD might become the next $LUNA&#8211; 🧵 pic.twitter.com/0LTjJMGI8s — Jordi Alexander (@gametheorizing) July 29, 2023 In his discussion on Crypto Banter, Alexander elaborated on Worldcoin&#8217;s goal to position WLD as an alternative to fiat currencies. Their agenda to become a digital base currency mimics the aspirations that LUNA once held. The gravity of this comparison is substantial, especially when considering LUNA&#8217;s precipitous fall from grace due to financial challenges. Trillion-Dollar Bubble In The Making? While drawing parallels with LUNA, Alexander&#8217;s intent wasn’t to prophesize an equivalent success for Worldcoin but rather to signal the risks of potential downfall. A primary concern centers around the controversial methods that Worldcoin employs, notably, collecting biometric data through retina scans. The rapid appreciation of WLD’s value further compounds these concerns. Since its inception just over a week ago, the token&#8217;s value has surged significantly from $0.1 to as high as trading above $5. This growth has inevitably attracted a slew of investors, catapulting its market capitalization to more than $200 million. Related Reading: Why Worldcoin (WLD) And PEPE Dominate The Crypto Market Trends This Week It&#8217;s this velocity of growth, coupled with Worldcoin&#8217;s overarching ambition, that leads Alexander to opine that the cryptocurrency might be veering into &#8220;bubble&#8221; territory. He even suggested the possibility of it snowballing into a trillion-dollar bubble if unchecked. Worldcoin (WLD) price is moving sideways on the 4-hour chart. Source: WLD/USDT on TradingView.com Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-07T17:00:44.000Z",
    "title": "Fund Manager Confirms Bullish Outlook for Solana (SOL) and InQubeta (QUBE)",
    "url": "https://www.crypto-news-flash.com/fund-manager-confirms-bullish-outlook-for-solana-sol-and-inqubeta-qube/?utm_source=rss&utm_medium=rss&utm_campaign=fund-manager-confirms-bullish-outlook-for-solana-sol-and-inqubeta-qube",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T101739.091.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T101739.091.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T101739.091-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As the exciting world of cryptocurrency continues to evolve, investors and experts alike are increasingly placing their bets on emerging platforms that promise innovative solutions and robust growth. Among these, Solana and InQubeta are proving to be powerhouses, both showcasing remarkable potential for future growth. Recent confirmation of a bullish outlook from a prominent fund [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-07T16:55:00.000Z",
    "title": "BTC Hodlers Drive Market Surge, 97 Out Of 700+ Crypto Funds Shut Down",
    "url": "https://coinedition.com/btc-hodlers-drive-market-surge-97-out-of-700-crypto-funds-shut-down/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BTC Hodlers Drive Market Surge, 97 Out Of 700+ Crypto Funds Shut Down\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/BTC-Hodlers-Drive-Market-Surge-97-Out-Of-700-Crypto-Funds-Shut-Down-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to Swiss investment adviser 21e6 Capital, 97 of 700 global crypto funds closed in 2023. Bitcoin outperformed crypto funds as part of a significant January gain, followed by a March surge. Directional funds struggled with uncertain markets, operational hurdles, and FTX collapse recovery. The crypto winter, while still in recovery, has hit the industry [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/btc-hodlers-drive-market-surge-97-out-of-700-crypto-funds-shut-down/\">BTC Hodlers Drive Market Surge, 97 Out Of 700+ Crypto Funds Shut Down</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-07T16:55:06.000Z",
    "title": "Cardano Witnesses ‘Impressive’ 198% Growth in Total Value Locked This Year Amid Price Decline: Analytics Firm",
    "url": "https://dailyhodl.com/2023/08/07/cardano-witnesses-impressive-198-growth-in-total-value-locked-this-year-amid-price-decline-analytics-firm/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/Catalysts-Will-Determine-ADA.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/Catalysts-Will-Determine-ADA.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/Catalysts-Will-Determine-ADA.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/Catalysts-Will-Determine-ADA.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/Catalysts-Will-Determine-ADA.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/Catalysts-Will-Determine-ADA.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/Catalysts-Will-Determine-ADA.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ethereum (ETH) rival Cardano (ADA) has seen its total value locked (TVL) explode nearly 200% since the beginning of the year, crypto analytics firm Messari reports. TVL refers to the amount of capital deposited within a protocol&#8217;s smart contracts and is often used to gauge the health of a crypto ecosystem. In a new report [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/07/cardano-witnesses-impressive-198-growth-in-total-value-locked-this-year-amid-price-decline-analytics-firm/\">Cardano Witnesses ‘Impressive’ 198% Growth in Total Value Locked This Year Amid Price Decline: Analytics Firm</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]