[
  {
    "source": "Cointelegraph",
    "date": "2024-02-09T18:26:04.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">John Reed Stark, who served with the United States Securities and Exchange Commission (SEC) for 18 years, has sided with crypto investors in their lawsuit against the National Basketball Association. Meanwhile, spot Bitcoin exchange-traded funds in the United States racked up $403 million on Feb. 8, recording the third-largest daily inflow. BlackRock and Fidelity's spot Bitcoin ETFs have scooped up more assets in a month than any other newly launched ETF in 30 years in the United States. </p><p>John Reed Stark, the former internet enforcement head for the SEC, <a href=\"https://cointelegraph.com/news/sec-official-nba-voyager-digital-heroin\">has sided with crypto investors</a> in their lawsuit against the NBA.</p><p>Stark took to X (formerly Twitter) to critcize the NBA for allowing the Dallas Mavericks to partner with the now defunct Voyager Digital crypto exchange. Like other digital asset platforms, <a href=\"https://cointelegraph.com/news/voyager-digital-files-for-chapter-11-bankruptcy-proposes-recovery-plan\">Voyager went belly up in 2022</a> amid crypto winter. It reached a $1.65 billion settlement with the Federal Trade Commission in November 2023.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-09T18:20:00.000Z",
    "title": " Price analysis 2/9: BTC, ETH, BNB, SOL, XRP, ADA, AVAX, DOGE, DOT, LINK  ",
    "url": "https://cointelegraph.com/news/price-analysis-2-9-btc-eth-bnb-sol-xrp-ada-avax-doge-dot-link",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvOGY3NTM1ZGUtNjYwNy00ZGUyLWE3NTQtNTA0OWFhZjhiMjZjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Rising inflows into the spot Bitcoin ETFs have improved investors' sentiment toward the crypto market and could a factor in BTC price and altcoins moving higher.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is on the move, and the exchange-traded funds (ETFs) investors are cheering the rise by buying more. The spot Bitcoin ETFs witnessed <a href=\"https://cointelegraph.com/news/bitcoin-etfs-third-largest-inflow-btc-price-46-000\">their third largest inflows on Feb. 8</a>, totaling $403 million. This brings the total inflows into the ETFs to more than $2.1 billion since the launch on Jan. 11.</p><p>BlackRock and Fidelity’s spot Bitcoin ETFs have each amassed <a href=\"https://cointelegraph.com/news/blackrock-fidelity-etfs-largest-debut-month-30-years\">more than $3 billion in assets under management</a>. Comparing the first-month performance of all ETF launches in the past 30 years, Bloomberg ETF analyst Eric Balchunas said in a Feb. 8 post on X (formerly Twitter) that BlackRock’s iShares Bitcoin Trust (IBIT) and Fidelity’s Wise Origin Bitcoin Fund (FBTC) are in “league of own,” occupying the top two spots by a wide margin.</p><p>The bullish move is not limited to Bitcoin alone, as select <a href=\"https://cointelegraph.com/news/bitcoin-price-nears-45-5-k-altcoins-historic-breakout\">altcoins have also started to move up</a>, breaking above their respective overhead resistance levels. This indicates that the sentiment is improving in the entire crypto space.</p><p><a href=\"https://cointelegraph.com/news/price-analysis-2-9-btc-eth-bnb-sol-xrp-ada-avax-doge-dot-link\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-09T18:10:36.000Z",
    "title": " Apple is poised to bring metaverse mainstream and dominate the market ",
    "url": "https://cointelegraph.com/news/apple-poised-metaverse-mainstream-dominate-vision-pro-augmented-reality-market",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNmQ5MTdhMGUtYzg2OC00MDZiLTlmOTYtZDFkNGI5NzJjNzIwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>If the past is any predictor, soon everyone will be wearing computers on their faces.</p>\n                    <p><p data-ct-non-breakable=\"true\">Apple’s biggest new hardware launch in decades happened on Feb. 2 when the Vision Pro spatial computer hit the United States market. Based on the reported preorder sales and the company’s history of hardware hits, there are plenty of reasons for metaverse enthusiasts to be optimistic for the future. </p><p>The Apple Vision Pro is a spatial computing device that takes the form of an augmented reality headset. Not to be confused with virtual reality, the Vision Pro gives users a view of the world outside of their headset and then overlays that reality with digital imagery. Essentially, it turns the physical world into your computer desktop. </p><p data-ct-non-breakable=\"true\">The distinction between spatial computing and virtual reality is an important one. Despite positive gaming sales and steady enterprise adoption, virtual reality hasn’t managed to grab a foothold in the mainstream consumer market. </p><p><a href=\"https://cointelegraph.com/news/apple-poised-metaverse-mainstream-dominate-vision-pro-augmented-reality-market\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-09T18:30:26.000Z",
    "title": "Over 92% of Bitcoin supply now profitable as price soars past $47,000",
    "url": "https://cryptoslate.com/insights/over-92-of-bitcoin-supply-now-profitable-as-price-soars-past-47000/",
    "description": "<p>Quick Take Bitcoin&#8217;s recent surge past $47,000 is accompanied by a notable development — over 92.5% of its circulating supply is now in profit. The figure represents the percentage of existing coins whose price at their last movement was lower than the current price. Interestingly, during Bitcoin&#8217;s previous peak at $49,000, just above 93% of [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/over-92-of-bitcoin-supply-now-profitable-as-price-soars-past-47000/\">Over 92% of Bitcoin supply now profitable as price soars past $47,000</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-09T18:17:10.000Z",
    "title": "Deloitte Tohmatsu Revolutionizes Sports Industry with Astar zkEVM Integration",
    "url": "https://www.cryptopolitan.com/deloitte-tohmatsu-sports-astar-zkevm/",
    "description": "In an innovative leap forward for the sports and digital asset industries, Deloitte Tohmatsu Group, under the leadership of Group CEO Kenichi Kimura, has unveiled a significant advancement in the realm of non-fungible tokens (NFTs) and blockchain technology. The group has successfully developed a new NFT tool that is fully compatible with the Astar zkEVM [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-09T18:30:12.000Z",
    "title": "Ethereum price crosses milestone to bring weekly gains to 13%",
    "url": "https://crypto.news/ethereum-milestone-bring-weekly-gains-13-percent/",
    "description": "Ethereum on-chain analysis provides data-driven insights on how rising staking deposits could impact ETH short-term price action. "
  },
  {
    "source": "BTCManager",
    "date": "2024-02-09T18:30:00.000Z",
    "title": "DeeStream may outperform Manta Network and Arbitrum in 2024",
    "url": "https://crypto.news/deestream-may-outperform-manta-network-and-arbitrum-in-2024/",
    "description": "Manta Network (MANTA), Arbitrum (ARB), and DeeStream (DST) could shape crypto in the future"
  }
]