[
  {
    "source": "Decrypt",
    "date": "2023-11-16T01:23:57.000Z",
    "title": "Irregular Sleep More Harmful Than Shorter Sleep Sessions, Study Suggests",
    "url": "https://decrypt.co/206297/irregular-sleep-more-harmful-than-shorter-sleep-sessions-study-suggests",
    "description": "Saying “I’ll sleep when I’m dead” is wrong in more ways than one, as better sleep is linked to greater longevity."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-16T01:26:26.000Z",
    "title": "Grayscale ETH futures ETF a ‘trojan horse’ for spot Ethereum ETF: Analyst",
    "url": "http://cointelegraph.com/news/grayscale-eth-futures-etf-trojan-horse-spot-eth-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/65452c46-d023-4b28-a876-979d52172971.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bloomberg ETF analyst James Seyffart thinks Grayscale’s Ether futures ETF application is just a ploy to corner the SEC to approve its spot Ether ETF.</p>\n                    <p><p>Grayscale Investments is using its Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) futures exchange-traded fund (ETF) application as a “trojan horse” to corner the United States Securities and Exchange Commission into approving its spot Ether ETF, says Bloomberg ETF analyst James Seyffart.</p><p>Seyffart said in a Nov. 15 X (Twitter) <a href=\"https://x.com/JSeyff/status/1724847410407452800?s=20\" target=\"_blank\" rel=\"noopener nofollow\">post</a> following the SEC delaying Grayscale’s <a href=\"https://cointelegraph.com/news/grayscale-files-for-new-ethereum-futures-etf\">ETH futures ETF bid</a> that he believes if the SEC approves Grayscale’s application, then it would enable Grayscale to argue for the approval of its spot Ether ETF application.</p><p>If the SEC denies Grayscale’s bid, the asset manager could argue the SEC is treating Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether futures ETFs differently by allowing one under the Securities Act of 1933 but not the other.</p><blockquote>“Watch [the SEC] try to either approve and argue why this is different from spot. Or Deny and argue why 1933 act products are meaningfully different from 1940 act products. Both are bad for SEC [in my opinion]. Genius move.”</blockquote><p>Grayscale’s Ether futures ETF bid was submitted via a form 19b-4 — which exchanges file to inform the SEC of a security-based swap request. Seyffart said none of the 40 or so approved Ether ETF products went through the 19b-4 approval process.</p><p>Seyffart was initially unsure why Grayscale filed its Ether futures ETF via a 19b-4. He now believes Grayscale is playing “chess” with the SEC by using the Ether Futures ETF as a “trojan horse” to obtain a 19b-4 order from the regulator to corner them into a lose-lose situation.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I was initially unsure why they would even file for this. But my thoughts have evolved over the last few weeks and they are basically this:<br>Grayscale is playing Chess, not checkers here. They&#39;re likely hoping to force the SEC into issuing a 19b-4 decision on an ETH futures ETF.…</p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1724847410407452800?ref_src=twsrc%5Etfw\">November 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Seyffart and Scott Johnsson, General President at Van Buren Capital General, <a href=\"https://x.com/JSeyff/status/1724853212992184748\" target=\"_blank\" rel=\"noopener nofollow\">agreed</a> Grayscale wouldn’t launch the Ether futures ETF. </p><p>“Doubtful this product ever trades, but useful as a vessel to get spot ETH over the finish line,” Johnsson said. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-etf-will-drive-adoption-in-2024-mike-novogratz\"><strong><em>Bitcoin ETFs will drive institutional adoption in 2024 — Galaxy Digital’s Mike Novogratz</em></strong></a></p><p>Seyffart’s comments come as the SEC <a href=\"https://www.sec.gov/files/rules/sro/nysearca/2023/34-98944.pdf\" target=\"_blank\" rel=\"noopener nofollow\">delayed</a> its decision on Grayscale’s Ether futures ETF on Nov. 15 — two days earlier than its Nov. 17 deadline. Seyffart said he wasn’t surprised by the delay.</p><p>Hashdex’s <a href=\"https://www.sec.gov/files/rules/sro/nysearca/2023/34-98947.pdf\" target=\"_blank\" rel=\"noopener nofollow\">application</a> to convert its Bitcoin futures exchange-traded fund (ETF) into a spot product was also put on hold by the securities regulator on Nov. 15.</p><p>BlackRock shared a similar sentiment to Seyffart last week, arguing that the SEC <a href=\"https://cointelegraph.com/news/blackrock-argues-sec-has-no-grounds-to-treat-crypto-futures-and-spot-etfs-differently\">doesn't have a legitimate reason</a> to treat cryptocurrency spot and futures ETF applications differently.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-etf-optimist-and-worldcoin-skeptic-gracy-chen-hall-of-flame/\"><strong><em>Bitcoin ETF optimist and Worldcoin skeptic Gracy Chen: Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]