[
  {
    "source": "CryptoGlobe",
    "date": "2023-10-18T00:50:00.000Z",
    "title": "Cardano’s Current Consolidation Could End in Massive $ADA Price Rally to $6",
    "url": "https://www.cryptoglobe.com/latest/2023/10/cardanos-current-consolidation-could-end-in-massive-ada-price-rally-to-6/",
    "description": "Popular cryptocurrency analyst Ali Martinez has recently revealed that Cardano ($ADA) has been enduring a consolidation trend that “eerily mirrors” its consolidation between 2018 and 2020, which would suggest that the cryptocurrency could, in the future, surge to as much as $6. Per Martinez, if history repeats itself, the smart contract platform’s native token ADA […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-18T01:00:43.000Z",
    "title": "Bitcoin Thief’s Decade-Long Heist: Solving The Mystery Of The Stolen Silk Road BTC",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-thiefs-decade-long-heist-solving-the-mystery-of-the-stolen-silk-road-btc/",
    "description": "In 2012, a staggering 50,000 Bitcoin (BTC) were stolen from the infamous Silk Road, an illicit dark web marketplace. Over the years, the value of the stolen BTC skyrocketed to $3 billion, making it one of the most significant mysteries in cryptocurrency. However, nearly a decade later, a critical mistake by the thief led to a breakthrough in the case, allowing the IRS-CI (Internal Revenue Service Criminal Investigation) to crack the puzzle.  CNBC has obtained exclusive footage that reveals how investigators meticulously connected the dots, ultimately leading to the unmasking of the perpetrator behind the Bitcoin heist. Silk Road Bitcoin Heist Unraveled The story begins in Athens, Georgia, an unsuspecting college town familiar with typical misdemeanors. On the night of March 13, 2019, 28-year-old Jimmy Zhong, a local computer expert, made an unusual 911 call to report the theft of hundreds of thousands of dollars&#8217; worth of Bitcoin from his home.  Per the report, the investigation into the theft from Zhong&#8217;s residence initially yielded no suspects. The Athens-Clarke County Police Department, inexperienced in crypto-related cases, struggled to make headway.  Related Reading: Time To Cash Out? Bitcoin’s 4-Hour RSI Triggers Sell Indicator In a quest for answers, Zhong sought the assistance of local private investigator Robin Martinelli. Although not well-versed in cryptocurrencies, Martinelli was determined to crack the case. Martinelli meticulously examined Zhong&#8217;s extensive home surveillance system and stumbled upon a crucial piece of evidence—a slender figure captured in the footage from the night of the crime.  Little did Zhong know that while reporting his stolen Bitcoin, a team of IRS agents worked tirelessly to solve the 2012 Silk Road hack. However, the hacker&#8217;s identity remained concealed until a tiny slip-up occurred. In September 2019, the hacker mistakenly transferred around $800 worth of BTC to a cryptocurrency exchange that adhered to established banking regulations, including &#8220;know your customer&#8221; procedures. To the investigators&#8217; surprise, the account used for the transaction was registered in Jimmy Zhong&#8217;s name, linking him to the stolen Silk Road funds. The IRS contacted the Athens-Clarke County Police Department, seeking collaboration to build a solid case against Zhong. United by a shared objective, Lt. Jody Thompson, IRS-CI special agent Trevor McAleenan, and Shaun MaGruder, CEO of cyber intelligence company BlockTrace, formed a team.  Armed with evidence, they obtained a federal search warrant for Zhong&#8217;s residence. On November 9, 2021, a large team of officers raided Zhong&#8217;s home, delivering the shocking news that he was the prime suspect. From Creator To Thief? Investigations revealed that Zhong, an early coder allegedly involved in the development of Bitcoin since its inception in 2009, had played a role in perfecting the technology.  In an ironic twist, a hacker involved in the creation of Bitcoin had transformed into one of the most prominent BTC thieves in history. Zhong was charged with wire fraud, pleaded guilty, and received a sentence of one year and a day in federal prison, starting on July 14, 2023. Zhong could not retain the illicit funds despite his immense fortune in stolen BTC. The US government seized the assets, initiating a process for victims of the Silk Road hack to reclaim their lost Bitcoin.  However, no claimants came forward, and the government sold the seized Bitcoin, with the proceeds likely to be shared with the Athens-Clarke County Police Department as a token of appreciation for their assistance. Related Reading: Shiba Inu Whale Moves $32.4 Million In SHIB, Large Sell Incoming? In his statement to the judge, Zhong admitted that the stolen Bitcoin had made him feel important, but ultimately, his actions had only benefited the government financially. While the original crime of the Bitcoin theft from Zhong&#8217;s Athens residence remains unsolved, the arrest and conviction of Zhong have brought closure to one of the most significant cryptocurrency crimes of our time. Featured image from Shutterstock, chart from TradingView.com "
  }
]