[
  {
    "source": "CoinDesk",
    "date": "2023-07-14T20:26:27.000Z",
    "title": "Coinbase to Pause Staking in California, New Jersey, South Carolina and Wisconsin",
    "url": "https://www.coindesk.com/business/2023/07/14/coinbase-to-pause-staking-in-california-new-jersey-south-carolina-and-wisconsin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "tk"
  },
  {
    "source": "Decrypt",
    "date": "2023-07-14T20:32:55.000Z",
    "title": "Jay-Z’s Roc Nation and Puma Drop NFT-Enhanced Sneakers",
    "url": "https://decrypt.co/148651/jay-z-roc-nation-puma-drop-nft-enhanced-sneakers",
    "description": "Inspired by the 50th anniversary of hip-hop, each pair of Puma kicks comes tied to exclusive digital content, including new music."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-14T20:15:41.000Z",
    "title": "Aave DAO Votes to Launch GHO Stablecoin on Ethereum Mainnet",
    "url": "https://decrypt.co/148627/aave-dao-votes-to-launch-gho-stablecoin-on-ethereum-mainnet",
    "description": "Aave's GHO stablecoin has been in development for the last year, and its aim is to make markets more accessible and efficient for its users."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-14T20:13:24.000Z",
    "title": "Coinbase Restricts Ethereum, Solana Staking in Four US States",
    "url": "https://decrypt.co/148648/coinbase-restricts-ethereum-solana-staking-in-four-us-states",
    "description": "The announcement comes after 11 states alleged Coinbase was violating securities laws. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T20:30:00.000Z",
    "title": "Token hoarders defeat the purpose of most DAOs: Study",
    "url": "https://cointelegraph.com/news/token-hoarders-defeat-purpose-of-most-daos-study",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/21544e6b-ddc0-40fd-8ce0-5994f79ac860.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The study also showed that decentralized organizations work best when they’re built around a tight-knit group of focused participants. </p>\n                    <p><p>A pair of researchers from the University of Texas at Austin and Princeton University <a href=\"https://onlinelibrary.wiley.com/doi/10.1111/jofi.13192\" target=\"_blank\" rel=\"noopener nofollow\">conducted</a> a study to determine how tokenization affects decentralization in decentralized autonomous organizations (DAOs). Their findings indicate that many of the challenges to autonomy are related to the reasons individual users have for participating. </p><p>According to their research, the larger a DAO grows, the more incentive participants have to consider DAO tokens investments:</p><blockquote>“The presence of investors diverts the subsidy away from users and thus harms their participation. More importantly, investors may even take a majority stake to seize control of the platform.”</blockquote><p>In a typical token-based DAO scheme, rather than having a CEO or leader implement decisions, individual participants are issued distributed authority through tokens. This prevents the people who maintain the DAO from exploiting the participants because their tokens work like votes. </p><p>“The key distinction between tokens and securities,” per the team’s research paper, “is that tokens are a claim to the platform’s services while securities are a claim to its revenue.”</p><p>As long as the participants in a DAO are aligned in purpose and willing to spend their tokens to vote for actions that move that purpose forward or on services and utilities that provide value to the community, the DAO tends to thrive. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/imf-sees-climate-change-daos-cbdc-threats-to-marshall-islands-urges-reforms\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/imf-sees-climate-change-daos-cbdc-threats-to-marshall-islands-urges-reforms/amp\"><strong><em>IMF sees climate change, DAOs, CBDC as threats to Marshall Islands, urges reforms</em></strong></a></p><p>The researchers modeled DAOs over time to determine how user growth and tokenization affect outcomes. Their primary finding, according to the team’s research paper, is that tokenization serves the purpose of shifting ownership from initial equity holders to a platform’s users, but the tradeoff is that there’s no single entity that can subsidize network participation. </p><p>This evidently leaves the gates open for investors to treat purpose-driven DAOs like traditional stocks.</p><p>“The ability to get high returns has hurt cryptocurrencies as mediums for payment, because people don’t want to spend it,” <a href=\"https://phys.org/news/2023-07-decentralized-platforms-backslide.html\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://phys-org.cdn.ampproject.org/c/s/phys.org/news/2023-07-decentralized-platforms-backslide.amp\">said</a> lead researcher Michael Sockin in a press release, “They can easily take us back to being like Amazons and Apples, which is the whole issue we were trying to move away from.\"</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T20:29:26.000Z",
    "title": "Cardano price turns bullish, but is there substance to the ADA rally?",
    "url": "https://cointelegraph.com/news/cardano-ada-rallies-is-0-40-in-the-cards",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/070d8260-345c-44b7-b73a-83953aafa895.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cardano’s DeFi footprint and network activity show an uptick in users, but will it be enough to sustain ADA’s recent bullish price action? </p>\n                    <p><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) experienced a remarkable price surge of 23.9% on July 13, leaving investors curious about the potential for further gains. This significant rally comes on the heels of a favorable judicial decision regarding <a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>, leading many to question if ADA has what it takes to break above the $0.40 mark.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/f63586f0-d573-403c-bf93-6fd7889b627b.png\"  /><figcaption style=\"text-align: center;\"><em>Cardano 1-day price in USD at Coinbase. Source: TradingView</em></figcaption></figure><p>There are three reasons to support Cardano’s bullish momentum, including its potential to integrate other blockchains, increased activity in decentralized applications, and the decreased regulatory risk, although the latest XRP event requires a more cautious approach.</p><h2>SEC actions specifically named ADA as a potential security</h2><p>Cardano and its ADA token found itself in the spotlight as the Securities and Exchange Commission (SEC) referred to it as a potential security during the recent <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">court action against Coinbase and Binance</a> exchange. However, it's important to distinguish that while the staking offering may be considered a security, it does not pose a direct risk to Cardano or its development companies. </p><p>Following the SEC's remarks in June, ADA faced a 36% correction, dropping to $0.24. However, the <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">recent XRP ruling on July 13</a> helped alleviate regulatory risks, leading to a boost in the rally of ADA and other coins impacted by the regulator's comments.</p><h2>The idea of implementing sidechains sparked additional interest</h2><p>After a recent video shared by John Woods, CTO at Algo Foundation, Charles Hoskinson, co-founder of Cardano, proposed incorporating Algorand (<a href=\"https://cointelegraph.com/algorand-algo-price-index\">ALGO</a>) as a Cardano sidechain. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It might be prudent for Algorand to consider becoming a sidechain of Cardano. Always here to help. <a href=\"https://t.co/h3lQeF7WlK\">https://t.co/h3lQeF7WlK</a></p>&mdash; Charles Hoskinson (@IOHK_Charles) <a href=\"https://twitter.com/IOHK_Charles/status/1679137033615290370?ref_src=twsrc%5Etfw\">July 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Although it may seem unlikely for the Algorand community to accept such a suggestion, the proposal gains relevance amidst AlgoFi's shutdown announcement on July 11. The decision followed the SEC's allegations of security-like characteristics against Algorand due to its ICO. This could provide a way for Algorand to avoid regulatory scrutiny, and it could also boost the adoption of Cardano's ecosystem.</p><p>It's worth noting that smaller altcoins could be incentivized monetarily to become a Cardano sidechain, leveraging Cardano's rich treasury and marketing potential.</p><h2>Increased activity in Cardano DApps and NFT markets</h2><p>Smart contract activity plays a vital role in the success of blockchains designed for decentralized applications, especially as Ethereum struggles with soaring transaction fees. Therefore, assessing ADA’s activity in terms of deposits locked on smart contracts and the number of DApp users becomes crucial in determining the sustainability of the current bull run. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/a020248f-38ac-457f-801d-999d05f43fbf.png\"  /><figcaption style=\"text-align: center;\"><em>Cardano smart contracts TVL, in ADA terms. Source: DefiLlama</em></figcaption></figure><p>According to DefiLlama, Cardano's Total Value Locked (TVL) in ADA terms increased by 10% month-on-month, reaching 550 million ADA on July 14. Additionally, DEX volumes saw a 6% increase over the past seven days. </p><p>Cardano's NFT sales, as reported by CryptoSlam, surged by 56% to $3.1 million, outperforming leading platforms like Solana and Ethereum.</p><p><strong>Data sounds promising, but ADA could still face regulatory setbacks</strong></p><p>The recent rally in ADA is certainly encouraging, but there are still some risks to consider before investing in the project.</p><p>Despite the beneficial XRP decision, it's important to note that Cardano's ICO was not explicitly cleared by the court ruling, as it solely addressed sales via exchanges and OTC desks. The ongoing XRP trial will further determine the fate of Cardano's regulatory status. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/xrp-price-hit-1-dollar-ripple-levels\"><strong><em>Can XRP price hit $1? Watch these levels next</em></strong></a></p><p>Additionally, ADA’s TVL of $200 million lags behind other layer-1 smart contract alternatives such as Tron ($5.9 billion), <a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a> Smart Chain ($3.4 billion) and Avalanche ($727 million). This suggests that there is still limited demand for ADA's services.</p><p>To solidify its position and potentially surpass the $0.40 mark, Cardano needs to continue growing and delivering on its promises, including the planned updates for 2023. Important upcoming updates include the Hydra layer-2 solution that uses sidechains to offload transactions from the main chain, and Basho, a layer-1 scalability and performance improvement proposal including improved block structure, parallelization, and pipelining.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T20:20:00.000Z",
    "title": "Ethereum scaling protocols drive zero-knowledge proof use: Finance Redefined",
    "url": "https://cointelegraph.com/news/ethereum-scaling-protocols-drive-zero-knowledge-proof-use-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/dd1054e8-781b-44e3-a8d4-07b4d4b587e9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The top 100 DeFi tokens had a mixed week, with most of the tokens trading in a narrow range before surging on July 13 courtesy of Ripple’s partial win in its court battle with the SEC.</p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance/amp\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>This week, Finance Redefined looks at the growing popularity of zero-knowledge proof-based scalable solutions. Zero-knowledge rollups (ZK-rollups) technology has gained a lot of traction over the past year thanks to its increased use in the Ethereum ecosystem. </p><p>Bug bounties are seen as a great reward system for white hat hackers to weed out bugs in the DeFi ecosystem, which often fall prey to exploits. However, recent analysis suggests these programs have mixed results. </p><p>After a series of exploits on the Multichain protocol over the past couple of weeks, the founder of Connext proposed a “Sovereign Bridged Token” standard to prevent future issues and exploits.</p><p>Algorand’s decentralized lending protocol is set to wind down by year-end as developers claimed building a borrowing and lending protocol is “no longer a viable path” for the protocol.</p><p>The top 100 DeFi tokens had another mixed week in terms of price action, followed by a late surge on July 13, aided by the partial verdict for Ripple in its fight against the United States Securities and Exchange Commission (SEC), leading to an 84% surge in the XRP (<a href=\"https://cointelegraph.com/xrp-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/xrp-price-index\">XRP</a>) price.</p><h2>Ethereum scaling protocols drive zero-knowledge proof use in 2023</h2><p>Ethereum <a href=\"https://cointelegraph.com/learn/a-beginners-guide-on-blockchain-layer-2-scaling-solutions\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/a-beginners-guide-on-blockchain-layer-2-scaling-solutions/amp\">scaling</a> protocols dominate the use of ZK-rollups, with major launches, new research and healthy competition among the key highlights in a sector report published by ZKValidator.</p><p>The node infrastructure operator’s “State of ZK Q2” report reflects on significant events across the ZK ecosystem, with notable launches of ZK-powered layer 2’s highlighting the use of the technology for scaling in comparison with other market segments.</p><p><a href=\"https://cointelegraph.com/news/ethereum-scaling-protocols-drive-zero-knowledge-proof-use-2023\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ethereum-scaling-protocols-drive-zero-knowledge-proof-use-2023/amp\"><strong>Continue reading</strong></a></p><h2>Algorand decentralized lending protocol Algofi to shut down by end of 2023</h2><p>Algofi, the borrowing and lending protocol built on the decentralized finance blockchain Algorand, will soon shut down.</p><p>According to a July 11 announcement, developers’ “belief in the strength of Algorand’s technology and novel consensus algorithm has not wavered,” however, the Algofi platform will wind down soon.</p><p><a href=\"https://cointelegraph.com/news/algorand-decentralized-lending-protocol-algofi-shut-down-by-end-of-year\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/algorand-decentralized-lending-protocol-algofi-shut-down-by-end-of-year/amp\"><strong>Continue reading</strong></a></p><h2>Bug bounties can help secure blockchain networks, but have mixed results</h2><p>Bug bounties are programs organizations offer to incentivize security researchers or ethical or white hat hackers to find and report vulnerabilities in their software, websites or systems. Bug bounties aim to improve overall security by identifying and fixing potential weaknesses before malicious actors can exploit them.</p><p>Organizations that implement bug bounty programs typically establish guidelines and rules outlining the scope of the program, eligible targets and the types of vulnerabilities they are interested in. Depending on the severity and impact of the discovered vulnerability, they may also define the rewards offered for valid bug submissions, ranging from small amounts of money to significant cash prizes.</p><p><a href=\"https://cointelegraph.com/news/bug-bounties-can-help-secure-blockchain-networks-but-have-mixed-results\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bug-bounties-can-help-secure-blockchain-networks-but-have-mixed-results/amp\"><strong>Continue reading</strong></a></p><h2>Arbitrum-based Rodeo Finance exploited for the second time, $1.5 million stolen</h2><p>Arbitrum-based decentralized finance (DeFi) protocol Rodeo Finance was exploited for $1.53 million on July 11. The DeFi protocol was exploited using a code vulnerability in its Oracle, leading to a loss of over 810 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). Rodeo Finance was earlier exploited on July 5 for around $89,000 due to a vulnerability in its mintProtocolReserves function. </p><p>According to data shared by blockchain analytic firm PeckShield, the exploiter later bridged the stolen funds from Arbitrum to Ethereum and swapped 285 ETH for unshETH. The exploiter then deposited the ETH on Eth2 staking. Finally, the exploiter routed the stolen ETH using the popular mixer service Tornado Cash, which exploiters often use as an exit route to obscure the transaction’s footprint.</p><p><a href=\"https://cointelegraph.com/news/arbitrum-based-rodeo-finance-exploited-for-1-53m-the-second-time-in-a-week\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/arbitrum-based-rodeo-finance-exploited-for-1-53m-the-second-time-in-a-week/amp\"><strong>Continue reading</strong></a></p><h2>Connext founder proposes ‘Sovereign Bridged Token’ standard after Multichain incident</h2><p>A July 7 Ethereum improvement proposal (EIP) seeks to standardize how tokens are bridged between networks. The “Sovereign Bridged Token” standard, or EIP-7281, allows token issuers to create canonical bridges across multiple networks.</p><p>The proposal was co-authored by Arjun Bhuptani, founder of the Connext bridging protocol. In a July 7 social media post, Bhuptani claimed the protocol would help prevent issues like the July 6 Multichain incident, which some experts <a href=\"https://cointelegraph.com/news/multichain-mpc-bridge-sees-millions-in-outflows-exploit-feared\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/multichain-mpc-bridge-sees-millions-in-outflows-exploit-feared/amp\">have described as a hack</a>.</p><p><a href=\"https://cointelegraph.com/news/connext-founder-proposes-sovereign-bridged-token-standard-after-multichain-incident\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/connext-founder-proposes-sovereign-bridged-token-standard-after-multichain-incident/amp\"><strong>Continue reading</strong></a></p><h2>DeFi market overview</h2><p>DeFi’s total market value saw a bullish surge after three bearish weeks. Data from <a href=\"https://pro.cointelegraph.com/users/sign_in?\">Cointelegraph Markets Pro</a> and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bullish week, with most tokens trading in the green. The total value locked in DeFi protocols remained below $50 billion.</p><p>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/ethereum-scaling-protocols-drive-zero-knowledge-proof-use-finance-redefined&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles\" data-amp=\"https://mint-cointelegraph-com.cdn.ampproject.org/c/s/mint.cointelegraph.com/?url=https://cointelegraph.com/news/ethereum-scaling-protocols-drive-zero-knowledge-proof-use-finance-redefined&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles/amp\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-14T20:20:56.000Z",
    "title": "Binance CEO foresees DeFi outgrowing CeFi in 6 years, despite regulatory hurdles",
    "url": "https://cryptoslate.com/binance-ceo-foresees-defi-outgrowing-cefi-in-6-years-despite-regulatory-hurdles/",
    "description": "<p>Binance CEO Changpeng &#8216;CZ&#8216; Zhao predicted that decentralized finance (DeFi) would become more prominent than centralized finance (CeFi) within the next six years in a July 14 statement to celebrate the exchange&#8217;s sixth anniversary. According to Zhao, DeFi activities will continue accelerating as more people use DeFi products and interact directly with blockchain networks. He [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-ceo-foresees-defi-outgrowing-cefi-in-6-years-despite-regulatory-hurdles/\">Binance CEO foresees DeFi outgrowing CeFi in 6 years, despite regulatory hurdles</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T20:28:28.000Z",
    "title": "A Trend: Logan Paul and Top Celebs Abandoning their Crypto Projects",
    "url": "https://www.cryptopolitan.com/celebs-abandoning-their-crypto-projects/",
    "description": "Cryptocurrencies have witnessed a remarkable rise in popularity and intrigue, capturing the attention of seasoned investors and the general public. As this digital revolution took hold, an interesting trend emerged—the involvement of celebrities in various crypto projects. From endorsements and investments to actively participating in Initial Coin Offerings (ICOs), famous figures lent their names and ... <a title=\"A Trend: Logan Paul and Top Celebs Abandoning their Crypto Projects\" class=\"read-more\" href=\"https://www.cryptopolitan.com/celebs-abandoning-their-crypto-projects/\" aria-label=\"More on A Trend: Logan Paul and Top Celebs Abandoning their Crypto Projects\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T20:21:01.000Z",
    "title": "What’s the Future for Big Four Accounting Firms On Adopting Blockchain Technology?",
    "url": "https://www.cryptopolitan.com/big-four-accounting-firms-adopt-blockchain/",
    "description": "The big four accounting firms have recognized the importance of blockchain and are investing heavily in the technology. They see blockchain as a potential game-changer for the accounting industry and are eager to be at the forefront of adopting this new technology. Blockchain has the potential to revolutionize the accounting industry in some ways. For ... <a title=\"What&#8217;s the Future for Big Four Accounting Firms On Adopting Blockchain Technology?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/big-four-accounting-firms-adopt-blockchain/\" aria-label=\"More on What&#8217;s the Future for Big Four Accounting Firms On Adopting Blockchain Technology?\">Read more</a>"
  }
]