[
  {
    "source": "Decrypt",
    "date": "2023-10-17T23:01:29.000Z",
    "title": "Canadian Citizens In This City Have Lost $22.5 Million to Crypto Scams",
    "url": "https://decrypt.co/202050/canadian-citizens-in-this-city-have-lost-22-5-million-to-crypto-scams",
    "description": "One survey found a third of crypto-holding Canadians reported being victims of crypto scams."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-17T22:50:41.000Z",
    "title": "Evidence shows Bankman-Fried and associates gave $230M to friends, family, politicians, PACs, and special interests",
    "url": "https://cryptoslate.com/evidence-shows-bankman-fried-and-associates-gave-over-230m-to-friends-family-politicians-pacs-and-special-interests/",
    "description": "<p>An extensive list of donations made by FTX associates became public during the criminal trial of FTX founder Sam Bankman-Fried on Oct. 17. Bankman-Fried&#8217;s own donation list details more than $133 million in spending, primarily made up of $119 million in political donations. The list includes a number of recognizable politicians or their campaigns. Republican [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/evidence-shows-bankman-fried-and-associates-gave-over-230m-to-friends-family-politicians-pacs-and-special-interests/\">Evidence shows Bankman-Fried and associates gave $230M to friends, family, politicians, PACs, and special interests</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-17T23:00:29.000Z",
    "title": "FTX founder Sam Bankman-Fried’s trial day 10: Recap ",
    "url": "https://crypto.news/ftx-founder-sam-bankman-frieds-trial-day-10-recap/",
    "description": "On the 10th day of Sam Bankman-Fried’s historic trial, Nishad Singh reveals how events up to the bankruptcy unfolded. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-17T23:00:18.000Z",
    "title": "Meme Coins That Are Ripe For The Picking Following $3.2 Billion Crash",
    "url": "https://www.newsbtc.com/analysis/pepe/meme-coins-3-2-billion-crash/",
    "description": "As the crypto market suffered major losses due to the bear season, meme coins were not left out. These tokens which are often created in line with memes on the internet saw their cumulative market cap drop by $3.2 billion in 2023. This decline has paved the way for possibly buying these highly popular tokens at what could be considered a discount. Dogecoin (DOGE): King Of The Meme Coins Dogecoin (DOGE) has managed to retain its title as the king of the meme coins over the years but that has not helped the altcoin to dodge the bloodbath. Despite starting out the year 2023 strong and trading close to the $0.1 level, it has succumbed to the seemingly never-ending bear pressure and fallen around 50% since then. Related Reading: Cardano Whale Addresses Continue To Fall, What Does This Mean For ADA Price? Dogecoin is currently trading at one of its lowest points since the year began, which could signal a prime time for purchasing the meme coin. According to data from Messari, DOGE’s price is currently over 91% lower than its all-time high price of $0.738. This means that a return to its all-time high in a bull market would be an almost 10x return on investment from its current $0.059 level. Shiba Inu (SHIB): The DOGE Killer When Shiba Inu first came out in 2020 as an alleged ‘Dogecoin killer’, crypto investors did not take it seriously. It wasn’t until it mounted one of the most impressive rallies of 2021 that investors saw its potential. Eventually, it grew to become the second-largest crypto among the meme coins, clocking an over $10 billion market cap at one point. However, just like its biggest competitor Dogecoin, Shiba Inu has been subject to unfavorable conditions which have seen its price decline rapidly. It is almost 92% below its October 2021 all-time high of $0.0000869. So just like Dogecoin, a return to its all-time high price will also see SHIB return almost 10x on its current price of $0.00000706. SHIB price losses $0.000007 support &#124; Source: SHIBUSD on Tradingview.com SHIB also remains a fierce competition for Dogecoin after the team released their very own Layer 2 blockchain called Shibarium. This blockchain, built atop the Ethereum network, has put it in the league of large players such as Polygon (MATIC), Arbitrum (ARB), and Optimism (OP). Pepe Coin (PEPE): The New Kid On The Block Pepe Coin (PEPE) is currently only a few months old but it has already shown that it deserves to be listed among the top meme coins. PEPE’s run-up to over $1.4 billion in a bear market was nothing short of historical. But even this new kid on the block could not completely shake off the bears. Related Reading: Standard Chartered Says Ethereum Price Can Reach $35,000, Here’s When PEPE’s market cap has fallen by over $1.2 billion since it hit its all-time high in May, which could present a buying opportunity. Now, given PEPE’s performance in a bear market, it is expected to rally even more in a bull market. Since it is currently 84% below its all-time high price, a return to that level from here would mean an 8x return. The coin also commands a significant following with 520,000 followers on Twitter, making it one of the most followed meme coins in the space. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from BrightNode, chart from TradingView.com"
  }
]