[
  {
    "source": "CoinDesk",
    "date": "2023-06-09T11:14:20.000Z",
    "title": "Hut 8 Says Repairs to Damaged Crypto Mining Equipment Are Taking Longer Than Expected",
    "url": "https://www.coindesk.com/business/2023/06/09/hut-8-says-repairs-to-damaged-crypto-mining-equipment-are-taking-longer-than-expected/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The delays are impairing the miner's hashrate and bitcoin production."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-09T11:13:30.000Z",
    "title": "US House committee releases new stablecoin bill draft",
    "url": "https://cointelegraph.com/news/us-house-committee-releases-new-stablecoin-bill-draft",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/3ad441e2-f6b1-48b3-87be-e89820393fa3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The draft bill is set to go before the House committee for discussion on June 13 and, if approved, could become the first example of crypto legislation in the United States.</p>\n                    <p><p>The United States House Financial Services Committee has released the third draft of the stablecoin bill presented by the Republican chair Patrick McHenry. The latest draft of the bill is aimed at bipartisan legislation and includes certain proposals from both Republican and Democratic financial services committees. </p><p>The draft bill titled “The Future of Digital Assets: Providing Clarity for the Digital Asset Ecosystem” was first proposed on June 8 and is expected to be discussed during the upcoming committee hearing on June 13. </p><p>The latest version of the bill proposes Federal Reserve as the key regulator tasked with formulating requirements for issuing stablecoins. However, at the same time, the bill aims to offer state regulators powers to oversee the companies issuing the tokens.</p><p>The bill further discusses legislation on who can issue these stablecoins and the requirements of a payment stablecoin. If approved the bill will offer first comprehensive guidance on the supervision and enforcement of stablecoin markets. The bill also proposes a two-year moratorium for collateralized stablecoins from the date of enactment.</p><p>If approved by the U.S. House of Financial Services Committee and the US Senate, the bill would become the first form of crypto legislature in the U.S.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/stablecoins-are-solution-to-crypto-s-banking-problem-exec-says\"><strong><em>Stablecoins are the solution to crypto’s banking problem, exec says</em></strong></a></p><p>The latest version also grants a few additional authorities to the Federal regulator compared to the previous bill. These additional powers include the power to intervene against state-regulated issuers in cases of emergency. On the other hand, States could also pass their supervision duties over to the federal watchdog if they deem it necessary.</p><p>The <a href=\"https://cointelegraph.com/news/draft-bill-suggests-separating-legislation-on-payment-stablecoins-and-digital-asset-markets\">previous version of the draft bill</a> was issued on April 24 and focused on stablecoin payments rather than overseeing other aspects of digital asset markets such as custodial service providers and algorithmic stablecoins. And the latest version of the bill has become more concise while granting certain powers to the state legislature as well. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-09T11:28:05.000Z",
    "title": "Coinbase CEO’s $1.8 million stock sale raises eyebrows amid SEC lawsuit",
    "url": "https://cryptoslate.com/coinbase-ceos-1-8-million-stock-sale-raises-eyebrows-amid-sec-lawsuit/",
    "description": "<p>Coinbase CEO Brian Armstrong sold $1.8 million worth of company shares on June 5, according to data from Dataroma, before news of the U.S. Securities and Exchange Commission (SEC) lawsuit against the company tanked its shares by more than 15% on June 6. The SEC alleges Coinbase operated as an unregistered broker, exchange, and clearing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinbase-ceos-1-8-million-stock-sale-raises-eyebrows-amid-sec-lawsuit/\">Coinbase CEO&#8217;s $1.8 million stock sale raises eyebrows amid SEC lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-09T11:30:44.000Z",
    "title": "Report: Zimbabwean Crypto Trader Uses Recovery Phrase to Steal Digital Assets Worth $457K From Client",
    "url": "https://news.bitcoin.com/report-zimbabwean-crypto-trader-uses-recovery-phrase-to-steal-digital-assets-worth-457k-from-client/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1156995490-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Report: Zimbabwe Crypto Trader Uses Recovery Phrase to Steal Digital Assets Worth $457K From Client\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1156995490-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1156995490-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1156995490-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1156995490-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1156995490-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1156995490-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1156995490.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A Zimbabwean crypto trader has appeared in court to face theft and money laundering charges after prosecutors accused him of stealing digital assets worth more than $457,000 from his client. The crypto trader is accused of siphoning the digital assets using seed phrases and passwords he obtained when he helped set up the client&#8217;s crypto [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T11:35:07.000Z",
    "title": "NEAR Protocol price analysis: NEAR finds support at the $1.40 mark, where is the asset headed next?",
    "url": "https://www.cryptopolitan.com/near-protocol-price-analysis-2023-06-09/",
    "description": "TL;DR Breakdown The NEAR Protocol price analysis shows that the NEAR price action found support at the $1.400 mark and the bullish momentum has enabled the price to return to the $1.420 mark. However, the price action still faces strong bearish pressure at press time as the bulls face rejection at the $1.450 mark.&#160; The ... <a title=\"NEAR Protocol price analysis: NEAR finds support at the $1.40 mark, where is the asset headed next?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-protocol-price-analysis-2023-06-09/\" aria-label=\"More on NEAR Protocol price analysis: NEAR finds support at the $1.40 mark, where is the asset headed next?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T11:30:27.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T11:26:21.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-09T11:25:57.000Z",
    "title": "ApeCoin Holders Suffer Financial Pain As 95% Endure Negative Returns",
    "url": "https://www.newsbtc.com/news/apecoin-holders-suffer-financial-pain-as-95-endure-negative-returns/",
    "description": "ApeCoin (APE), created by Yuga Labs, once soared to great heights, capturing the attention of investors and enthusiasts alike. However, recent developments have cast a dark cloud over the once-promising digital asset. With an astonishing 95% of ApeCoin holders finding themselves deep in the red, the future of this innovative cryptocurrency hangs in the balance. Negative sentiment surrounding ApeCoin has become a prominent concern for its community. Once buoyed by optimism and excitement, investors now face frustration as their holdings plummet in value.  This loss of confidence not only undermines ApeCoin&#8217;s credibility but also raises questions about its long-term sustainability. Related Reading: Pepecoin 15% Drop Sparks Speculation: Will Further Pain Follow? Diminishing Network Growth, Trading Velocity Compound APE&#8217;s Challenges Founder of NotLarvaLabs, Pauly, has revealed a troubling statistic: an alarming 95% of ApeCoin holders are currently grappling with financial losses, painting a bleak picture for the once-promising cryptocurrency.  Looks like @apecoin is already right around it’s all time low price. Over 95% of the holders are already at a loss. And the @yugalabs team, insiders and “launch contributors” are paying themselves 10s of millions of dollars a month in $ape. See here:https://t.co/toavf11b8v — PAULY (@Pauly0x) June 7, 2023 ApeCoin&#8217;s price decline can be primarily attributed to the diminishing growth of its network, which has witnessed a noticeable decrease in interest from new addresses over the past three months. This decline in interest reflects a diminishing enthusiasm for APE among potential investors. In addition to the decline in network growth, ApeCoin&#8217;s trading velocity, which measures the frequency of transactions, has also experienced a significant drop during this period. This decline in trading activity further exacerbates the challenges faced by ApeCoin, indicating a lack of liquidity and reduced participation in the market. &#160; Source: Coingecko As per the latest information from CoinGecko, ApeCoin is currently priced at $2.90, with a marginal 24-hour rally of 0.2%. However, the cryptocurrency has undergone a notable decline of 6.6% over the past seven days, underscoring the volatility and uncertainty surrounding its value. Whale Interest Persists Amidst ApeCoin&#8217;s Struggles Interestingly, despite the aforementioned challenges, there remains a glimmer of interest in ApeCoin from influential investors known as whales. These large addresses continue to demonstrate their engagement with APE, as evidenced by the increasing percentage of ApeCoin held by them.  This suggests that some prominent investors still perceive potential in the cryptocurrency, although the impact of their involvement on ApeCoin&#8217;s overall trajectory remains uncertain. Bitcoin halfway from the $27K territory. BTCUSD chart: TradingView.com MVRV Ratio Declines As APE&#8217;s Price Drops The falling price of APE has had a direct impact on its MVRV (Market Value to Realized Value) ratio, indicating that a considerable number of APE holders lack significant incentives to sell their holdings at the current juncture. Related Reading: Polkadot Metrics Surge With Project Launches – Good News For DOT Price? This decline in the MVRV ratio raises concerns about the selling pressure on APE and suggests that many investors are reluctant to part ways with their APE tokens while the price remains low. Meanwhile, the sell-offs by short-term holders could create additional downward pressure on APE&#8217;s price and further exacerbate the challenges faced by the cryptocurrency. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk) Featured image from iStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T11:30:40.000Z",
    "title": "We Asked ChatGPT if Bitcoin (BTC) is Dead? IOTA and Collateral Network Hints at Bullish Momentum",
    "url": "https://www.crypto-news-flash.com/we-asked-chatgpt-if-bitcoin-btc-is-dead-iota-and-collateral-network-hints-at-bullish-momentum/?utm_source=rss&utm_medium=rss&utm_campaign=we-asked-chatgpt-if-bitcoin-btc-is-dead-iota-and-collateral-network-hints-at-bullish-momentum",
    "description": "<p>Crypto experts have been weighing on the future of Bitcoin (BTC), with most saying that it will be hard for it to reach another all-time high this year. Meanwhile, experts predict a bullish trend for IOTA (MIOTA) and Collateral Network (COLT) as both tokens attract market attention. But which of the two will perform better? [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/we-asked-chatgpt-if-bitcoin-btc-is-dead-iota-and-collateral-network-hints-at-bullish-momentum/\">We Asked ChatGPT if Bitcoin (BTC) is Dead? IOTA and Collateral Network Hints at Bullish Momentum</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T11:14:15.000Z",
    "title": "Trillions of Dollars Worth of Value in the Global Financial System Set to Move onto the Blockchain – Will Link Price Skyrocket?",
    "url": "https://www.crypto-news-flash.com/trillions-of-dollars-worth-of-value-in-the-global-financial-system-set-to-move-onto-the-blockchain-will-link-price-skyrocket/?utm_source=rss&utm_medium=rss&utm_campaign=trillions-of-dollars-worth-of-value-in-the-global-financial-system-set-to-move-onto-the-blockchain-will-link-price-skyrocket",
    "description": "<p>Chainlink partners with Swift and will help banks onboard to blockchain networks while establishing interoperability through its Cross-Chain Interoperability Protocol (CCIP). Top banking players have strong client demand to go beyond custody and make on-chain financial products while allowing them to move between chains. Blockchain is making faster inroads into the global financial system and [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/trillions-of-dollars-worth-of-value-in-the-global-financial-system-set-to-move-onto-the-blockchain-will-link-price-skyrocket/\">Trillions of Dollars Worth of Value in the Global Financial System Set to Move onto the Blockchain &#8211; Will Link Price Skyrocket?</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-09T11:26:52.000Z",
    "title": "Top 5 Altcoins to Buy in the Dip",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-5-altcoins-to-buy-in-the-dip/",
    "description": "<p>Holding altcoins can be an exciting and potentially lucrative opportunity in the bear market. However, the volatile nature of these assets often presents investors with market dips, which can be the ideal time to strategically enter the market. In this article, we will explore some of the best altcoins to consider buying during market dips, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-5-altcoins-to-buy-in-the-dip/\">Top 5 Altcoins to Buy in the Dip</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-09T11:32:32.000Z",
    "title": "Fairspin’s TFS Token Unveils the Future of the Gaming World",
    "url": "https://coinedition.com/fairspins-tfs-token-unveils-the-future-of-the-gaming-world/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Fairspins-TFS-Token-Unveils-Gamified-Hold-to-Earn-Program-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Fairspin’s TFS Token Unveils Gamified Hold-to-Earn Program\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Fairspins-TFS-Token-Unveils-Gamified-Hold-to-Earn-Program-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Fairspins-TFS-Token-Unveils-Gamified-Hold-to-Earn-Program-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Fairspins-TFS-Token-Unveils-Gamified-Hold-to-Earn-Program.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>TFS Token has opened the doors to a multi-level loyalty program and gamified earning, providing players with instant TFS rakeback on every bet through the Play to Earn program. What sets it apart is the ability to stake earned tokens via the Hold to Earn program, offering an opportunity for passive income with high-yield interest [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/fairspins-tfs-token-unveils-the-future-of-the-gaming-world/\">Fairspin’s TFS Token Unveils the Future of the Gaming World</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-09T11:24:58.000Z",
    "title": "Hong Kong Planning New Regulatory Framework for Web3, Virtual Assets",
    "url": "https://coinedition.com/hong-kong-planning-new-regulatory-framework-for-web3-virtual-assets/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Chen_Maobo_Hong_Kong_will_help_regional_opening_up_and_cooperation-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Chen_Maobo_Hong_Kong_will_help_regional_opening_up_and_cooperation-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Chen_Maobo_Hong_Kong_will_help_regional_opening_up_and_cooperation-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Chen_Maobo_Hong_Kong_will_help_regional_opening_up_and_cooperation.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>During the 2023 Caixin Summer Summit on June 9, Chen Maobo, the Financial Secretary of the Hong Kong Special Administrative Region Government, announced Hong Kong&#8217;s intention to implement an appropriate regulatory framework that supports the responsible growth of web3 and virtual assets in the region. The Hong Kong financial secretary noted that blockchain could build [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/hong-kong-planning-new-regulatory-framework-for-web3-virtual-assets/\">Hong Kong Planning New Regulatory Framework for Web3, Virtual Assets</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]