[
  {
    "source": "Cointelegraph",
    "date": "2023-08-10T05:29:51.000Z",
    "title": "‘No fucking way’ — Joe Rogan, Post Malone slam US government CBDC",
    "url": "https://cointelegraph.com/news/joe-rogan-slams-cbdc-podcast-post-malone",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/94aa6db9-e035-4030-ba3b-6c7248e8977e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>CBDCs have turned out to be a popular talking point among the American public, garnering takes from comedians, rappers and presidential candidates alike. </p>\n                    <p><p>Podcaster and commentator Joe Rogan has blasted the idea of a United States central bank digital currency (CBDC), describing a digital dollar as a “game over” scenario for American citizens. </p><p>In an Aug. 8 <a href=\"https://open.spotify.com/episode/4L2mPZUl0K1NR0jnjlYR7V?si=40VfOY8CQQSUqPEcn75Xiw&amp;nd=1\" target=\"_blank\" rel=\"noopener nofollow\">episode</a> of the widely-watched podcast Joe Rogan Experience, Rogan and rapper Post Malone turned to topics surrounding the U.S. financial system, pausing to focus on the potential abuses of power that could come with CBDCs in the United States. </p><p>Joe Rogan’s podcast typically amasses more than 11 million listeners per episode. Meanwhile, Post Malone boasts a combined 31 million followers across X and Instagram. It comes as discussions around CBDCs have started to make their way into <a href=\"https://cointelegraph.com/news/ron-desantis-vows-to-ban-cdbc-in-the-us\">U.S. presidential campaigns</a>. </p><p>Rogan didn’t mince words when asked for his thoughts on a CBDC:</p><blockquote>“No f*cking way. No way. That’s what I think. I think that’s checkmate. That’s game over.”</blockquote><p>Rogan spelled out a scenario where a tyrannical government could tie the flow of a CBDC to one’s social credit score, saying that citizens could easily be cut off from their finances for breaking the rules. </p><p>“If they decide somehow or another that you need some social credit score system and it’s for the benefit of society, and they outline that, they can track your behavior and your tweets and all your things [...] They just decided you fucked up, and the rules are the rules,” he said. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">.<a href=\"https://twitter.com/joerogan?ref_src=twsrc%5Etfw\">@JoeRogan</a> Says ‘No F*cking Way’ to Central Bank Digital Currency: “That’s Game Over”<a href=\"https://twitter.com/PostMalone?ref_src=twsrc%5Etfw\">@PostMalone</a> asked <a href=\"https://twitter.com/joerogan?ref_src=twsrc%5Etfw\">@JoeRogan</a>, “So how do you feel about the government’s digital currency that they’re working [on]?”<br><br>Rogan answered, “No f*cking way. No way. That’s what I think. I think… <a href=\"https://t.co/OvQ7Cw1o4E\">pic.twitter.com/OvQ7Cw1o4E</a></p>&mdash; The Vigilant Fox  (@VigilantFox) <a href=\"https://twitter.com/VigilantFox/status/1689015119764672514?ref_src=twsrc%5Etfw\">August 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Malone also mentioned his concerns with the banking system in the United States, noting that FDIC insurance only covers bank account values up to $250,000. </p><p>The pair also discussed the controversial decision by the Canadian government to <a href=\"https://cointelegraph.com/news/ontario-government-freezes-millions-more-in-donations-to-freedom-convoy\">freeze the bank accounts</a> associated with the “Freedom Convoy” truckers in February last year. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Joe Rogan &amp; Post Malone talk why we need <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>. <a href=\"https://t.co/77s2ywAhRl\">pic.twitter.com/77s2ywAhRl</a></p>&mdash; Altcoin Daily (@AltcoinDailyio) <a href=\"https://twitter.com/AltcoinDailyio/status/1689354669339062273?ref_src=twsrc%5Etfw\">August 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Malone argued that the U.S. government has too much control over the flow of everyday people’s finances and that they could potentially cut off funding to anyone at a moment's notice. </p><p>It echoes similar sentiments from avid supporters of decentralized cryptocurrencies.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/russia-cbdc-digital-ruble-trials-banks\"><strong><em>Russia to begin CBDC trials with 13 banks</em></strong></a></p><p>Meanwhile, discussion around CBDCs have become a talking point in United States politics. In July, Republican presidential candidate and Florida Governor Ron DeSantis <a href=\"https://cointelegraph.com/news/ron-desantis-vows-to-ban-cdbc-in-the-us\">swore to ban CBDCs in the U.S.</a> if elected president. </p><p>On the other side of the fence, Democratic candidate Robert F. Kennedy Jr. <a href=\"https://cointelegraph.com/news/rfk-jr-elaborates-position-on-cbdc-crypto-it-isn-t-just-criminals-who-want-privacy\">criticized CBDCs for being</a> instruments of “control,” and instead promised to <a href=\"https://cointelegraph.com/news/rfk-jr-will-back-us-dollar-with-bitcoin-if-president\">back the U.S. dollar with hard assets</a> including Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), if he were elected president. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\"><strong><em>Experts want to give AI human ‘souls’ so they don’t kill us all</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-10T04:45:20.000Z",
    "title": "NFT project y00ts to return $3M grant as it ditches Polygon for Ethereum",
    "url": "https://cointelegraph.com/news/nft-y00ts-returns-polygon-grant-migrates-to-ethereum",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/f3bc71cc-f910-4621-96a3-bac615172126.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>DeLabs has promised to return the $3 million grant initially provided by Polygon Labs to support y00ts from Solana to Polygon.</p>\n                    <p><p>Non-fungible token project y00ts is again switching blockchain networks, only four months after bridging the majority of its NFTs from Solana to Polygon. </p><p>DeLabs, the NFT firm behind y00ts, <a href=\"https://twitter.com/y00tsNFT/status/1689404417072889867\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> via its X (Twitter) account on Aug. 9 it will soon be migrating to Ethereum in line with its DeGods NFT collection.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1. y00ts will be migrating to Ethereum.</p>&mdash; y00ts (@y00tsNFT) <a href=\"https://twitter.com/y00tsNFT/status/1689404417072889867?ref_src=twsrc%5Etfw\">August 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The NFT collection had mostly <a href=\"https://polygon.technology/blog/y00ts-migration-to-polygon-is-77-complete\" target=\"_blank\" rel=\"noopener nofollow\">migrated</a> from Solana to Polygon in April. The move was first initially announced in December, with the migration starting officially on March 28. By March 30, Polygon announced 11,633 of a total of 15,000 y00ts NFTs had been bridged.</p><p>DeLabs said the move was to unite its y00ts community with its DeGods community. DeGods had also announced it would be bridging off Solana in December and similarly began its migration from Solana to Ethereum at the start of April.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/d235792b-13a1-4d8a-a609-eeafdc2637af.png\"  /><figcaption style=\"text-align: center;\"><em>DeLabs’ listings of y00ts on NFT marketplace OpenSea. Source: </em><a href=\"https://opensea.io/collection/y00ts\" target=\"_blank\" rel=\"noopener nofollow\"><em>OpenSea</em></a></figcaption></figure><p>“We still love Polygon. It's just time to unite the DeGods &amp; y00ts communities,” y00ts wrote in a statement. </p><p>The team has also disclosed it will be returning a <a href=\"https://cointelegraph.com/news/nft-project-accepted-3m-to-move-its-collection-to-polygon\">$3 million grant from Polygon Labs,</a> which it had received in January from the blockchain firm to support its migration. </p><p>“We're returning 100% of the grant provided by Polygon. The funds will be re-deployed for NFT ecosystem growth to empower builders and creators,” it said. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1. We tried our best to make it work but we just need to bring our 2 communities together.<br><br>I would appreciate it if everyone remains respectful of all parties involved.<br><br>It’s all love. <a href=\"https://t.co/6AT4SMUT76\">https://t.co/6AT4SMUT76</a></p>&mdash; Frank (@frankdegods) <a href=\"https://twitter.com/frankdegods/status/1689404792505040897?ref_src=twsrc%5Etfw\">August 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/star-trek-trademark-nfts-the-final-frontier\"><strong><em>Star Trek trademarks for NFTs: The final frontier </em></strong></a></p><p>The news was met with mixed reactions by members of the NFT community.</p><p>Some industry pundits offered their <a href=\"https://twitter.com/marccolcer/status/1689404828311814148\" target=\"_blank\" rel=\"noopener nofollow\">support</a> and backing behind NFT project founder FrankDeGods, while others expressed concern about the seemingly diminishing state of Polygon’s NFT ecosystem.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Huge blow to the Polygon NFT ecosystem<br><br>but organic NFT demand on Polygon seems nonexistent<br><br>I support this choice, feels like it was a no brainer tbh<br><br>Happy for y00t holders, this is an easy dub <a href=\"https://t.co/TwWtLTpq26\">https://t.co/TwWtLTpq26</a></p>&mdash; Iced (@IcedKnife) <a href=\"https://twitter.com/IcedKnife/status/1689447679753957376?ref_src=twsrc%5Etfw\">August 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><a href=\"https://nftpricefloor.com/\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to NFT Price Floor, DeGods and y00ts currently boast the 6th and 22nd highest floor prices at 8.66 <a href=\"https://cointelegraph.com/ethereum-price\">ETH</a> ($16,065) and 1.35 ETH ($2,465) respectively.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/nft-collector-snoop-nft-passport-the-goose-millennials-sothebys/\"><strong><em>NFT Collector: Snoop’s NFT nostalgia, The Goose draws Gen Y to Sotheby’s</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-10T04:54:00.000Z",
    "title": "Ethereum ($ETH) Addresses With a Balance Hit New Record High Above 100 Million",
    "url": "https://www.cryptoglobe.com/latest/2023/08/ethereum-eth-addresses-with-a-balance-hit-new-record-high-above-100-million/",
    "description": "The number of addresses on the Ethereum ($ETH) network with a balance has recently hit a new all-time high of 104,076,868, meaning that these addresses now hold at least one wei, the smallest unit of ETH, in a figure that represents a significant rise from figures in previous years. The data comes from cryptocurrency analytics […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-10T05:25:49.000Z",
    "title": "SEC Asks Court To File Interlocutory Appeal Vs. Ripple, XRP Price Stable",
    "url": "https://www.newsbtc.com/news/ripple/sec-asks-file-interlocutory-appeal-ripple-xrp/",
    "description": "In a meticulously detailed letter to Judge Analisa Torres of the Southern District of New York, the US Securities and Exchange Commission (SEC) has delineated its grounds for seeking an interlocutory appeal against Ripple Labs Inc. This move, which has sent ripples (pun intended) through the XRP community, focuses on the intricate legalities surrounding Ripple&#8217;s sales and distributions of XRP. Ripple Vs. SEC: Interlocutory Appeal Incoming The SEC&#8217;s primary contention revolves around Ripple&#8217;s &#8220;programmatic&#8221; sales to XRP buyers over crypto asset trading platforms and Ripple&#8217;s &#8220;other distributions&#8221; in exchange for labor and services. The regulatory body asserts that these transactions should be classified as offers or sales of securities, drawing upon the precedent set by the Howey case. Related Reading: Pro-XRP Lawyer John Deaton Says He Is Willing To Bet That Ripple Will Win SEC Appeal The SEC&#8217;s letter states, &#8220;Specifically, the SEC seeks to certify the Court’s holding that Defendants’ &#8216;Programmatic&#8217; offers and sales to XRP buyers over crypto asset trading platforms and Ripple’s &#8216;Other Distributions&#8217; in exchange for labor and services did not involve the offer or sale of securities under SEC v. W.J. Howey Co., 328 U.S. 293 (1946).&#8221; Delving deeper into the document, the SEC underscores the existence of an intra-district split (Judge Jed Rakoff’s ruling in the SEC vs. Terra case) indicating that there are substantial grounds for differences in legal opinion. The letter points out, &#8220;Interlocutory review is warranted here. These two issues involve controlling questions of law on which there is substantial ground for differences of opinion, as reflected by an intra-district split that has already developed.&#8221; The SEC further draws attention to the potential implications of the court&#8217;s previous order, suggesting that it could influence a multitude of pending litigations. The document reads, &#8220;The Programmatic Sales and Other Distributions rulings concern issues that may arise in various pending cases, including many in this Circuit where the alleged investment contracts were offered and sold by issuers &#8211; like Ripple &#8211; on crypto asset trading platforms or for non-cash consideration.&#8221; Related Reading: XRP Price: Breaking This Key Resistance Could Propel Crypto To $21 By 2025 – Analyst Jeremy Hogan, a legal luminary in the XRP community, weighed in, noting, &#8220;AND&#8230; the SEC continues making questionable decisions, requesting an interlocutory appeal. Note that it is NOT appealing whether XRP itself is a security &#8211; just its losses on the programmatic and individual sales issues.&#8221; Stuart Alderoty, Ripple&#8217;s Chief Legal Officer (CLO), clarified the SEC&#8217;s intent, emphasizing that the regulatory body is in the preliminary stages of seeking the court&#8217;s permission for the appeal. He stated, &#8220;The SEC does not have the right to appeal just yet which is why they are asking permission to file an interlocutory appeal. Ripple will file its response with the Court next week.&#8221; XRP Price Despite the intricate legal maneuvers and the potential ramifications, XRP&#8217;s market price has remained notably stable, suggesting a mature market response to the ongoing legal developments. At press time, XRP actually saw a slight uptick, trading at $0.6378. Featured image from Fox Business, chart from TradingView.com"
  }
]