[
  {
    "source": "CoinDesk",
    "date": "2023-07-20T10:19:58.000Z",
    "title": "SEC’s Stuttering Litigation Strategy Draws Comment From France ",
    "url": "https://www.coindesk.com/policy/2023/07/20/secs-stuttering-litigation-strategy-draws-comment-from-france/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "French officials boast of crypto-ready laws that contrast with a stuttering enforcement campaign from the U.S. SEC – and are looking to the next generation of Web 3 gaming rules."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-20T10:32:04.000Z",
    "title": "Telegram Bot Tokens Surge Toward $100M Market Cap",
    "url": "https://decrypt.co/149313/telegram-bot-tokens-surge-toward-100m-market-cap",
    "description": "The sector has experienced massive growth in a short period, as projects such as Unibot and Ready Swap flood the markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-20T10:11:14.000Z",
    "title": "Shared Web3 user base could power new social app integrations — Aave CEO",
    "url": "https://cointelegraph.com/news/web3-userbase-could-power-new-dapp-development",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/18daa4bf-5548-49f2-ac8f-88acd0d57fec.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Web3 social layer Lens Protocol aims to power seamless connectivity of applications across blockchain and non-blockchain platforms.</p>\n                    <p><p>The latest version of Web3 social layer Lens Protocol has been released, introducing improved functionality to support new use cases and shared monetization for its growing Web3 user base.</p><p>Decentralized Finance (DeFi) firm Aave Companies announced <a href=\"https://cointelegraph.com/news/what-is-lens-protocol-and-how-does-it-work\">Lens Protocol</a> v2 on July 17 <a href=\"https://cointelegraph.com/news/vitalik-buterin-ethereum-ethcc-paris-account-abstraction-ethereum\">during EthCC in Paris</a>, with the code powering the protocol reworked to enable improved composability, configurability and functionality.</p><p>Aave and Lens Protocol founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/stani-kulechov\">Stani Kulechov</a> told Cointelegraph that Lens is a decentralized protocol built on Polygon featuring a technology stack that allows developers to build and deploy Web3 social apps, as well as allowing Web3 social features to be integrated with existing Web2 and mobile experiences:</p><blockquote>“Our vision is for Lens Protocol to enable all applications to connect seamlessly across blockchain and non-blockchain applications, and reward both individuals and the collective shared network.”</blockquote><p>According to Kulechov, Lens has around 119,000 Web3 users in its beta, with a lengthy waiting list. Applications built on Lens can leverage this same audience, which is a key component of the protocol’s social graph <a href=\"https://docs.lens.xyz/docs/what-is-lens\" target=\"_blank\" rel=\"noopener nofollow\">architecture</a>.</p><p>The protocol provides an alternative to conventional Web2 networks and their centralized database models, which rule out portability. As Lens’ core <a href=\"https://docs.lens.xyz/docs\" target=\"_blank\" rel=\"noopener nofollow\">documentation</a> details, Web2 platforms fight a zero-sum game for user attention, with one’s gain equaling another’s loss.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/web3-social-media-protocol-launches-layer-3-to-provide-instant-posts\">Web3 social media protocol launches scaling solution to provide instant posts</a></em></strong></p><p>Lens Protocol allows users to own and carry personal data across connected or integrated applications. Kulechov added that Lens is designed to enable human engagement across the internet while benefiting contributors and the wider ecosystem:</p><blockquote>“We are still in the early days of Web3 social. Lens has been working with builders and content creators to attract them to develop consumer apps and publish content on Lens.”</blockquote><p>Kulechov said that it’s traditionally difficult for new social platforms to compete with incumbents for audience and funding. Lens intends to remove some risk associated with the “cold start” problem that developers face, with ecosystem apps sharing the same Web3 audience.</p><p>He added that the recently launched Threads is an example of how Instagram leveraged its existing audience to attract them to a new app that competes with Twitter. </p><blockquote>“By utilizing their built-in Instagram users, Threads demonstrated the power of shared social networks when launching a new app. Only, in this case, the shared network is closed — allowing only Meta apps to benefit.”</blockquote><p>V2 of the protocol is expected to deliver more ways to share value, allowing users to choose specific algorithms and move freely between communities and applications. For Kulechov, the prospect of new social experiences built on Lens remains a main draw card as the protocol’s shared user base allows new apps or integrations to leverage the existing network.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/unstoppable-domains-adds-eth-domains\">Unstoppable Domains adds .eth domains through Ethereum Name Service</a></em></strong></p><p>Kulechov also stressed that Lens is not designed to be a “front-end” app but rather a shared network protocol that hands value back to users, creators and developers. </p><blockquote>“Lens utilizes blockchain, smart contracts, decentralized storage and NFTs to reimagine social networks that are open and diverse, offering different types of experiences and communities.”</blockquote><p>The likes of <a href=\"https://cointelegraph.com/news/unstoppable-domains-launches-web3-alliance-and-seeks-self-regulating-boards\">Unstoppable Domains</a> and the <a href=\"https://cointelegraph.com/news/ethereum-name-service-founder-reflects-as-2-million-registration-mark-nears\">Ethereum Name Service</a> have driven the uptake of Web3 decentralized domain names that act as self-custodial digital identities and human-readable wallets over the past two years.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/web3-userbase-could-power-new-dapp-development&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/tokenizing-music-royalties-nfts-taylor-swift-3lau-nas-the-weeknd/\">Tokenizing music royalties as NFTs could help the next Taylor Swift</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-20T10:10:21.000Z",
    "title": "Push Protocol announces web3 Twitter Spaces competitor ‘Push Spaces ‘",
    "url": "https://cryptoslate.com/push-protocol-announces-web3-twitter-spaces-competitor-push-spaces/",
    "description": "<p>Push Protocol, the web3 messaging project, announced the launch of its innovative, decentralized, community-based streaming solution, Push Spaces, at EthCC. This introduction marks a notable step towards a future of improved online communication, which the company believes will revolutionize how web3 users interact. Harsh Rajat, co-founder and lead of Push Protocol, told CryptoSlate, &#8220;Our goal [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/push-protocol-announces-web3-twitter-spaces-competitor-push-spaces/\">Push Protocol announces web3 Twitter Spaces competitor &#8216;Push Spaces &#8216;</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T10:33:42.000Z",
    "title": "Kuwait implements strict crypto ban, setting a global precedent for regulation",
    "url": "https://www.cryptopolitan.com/kuwait-implements-strict-crypto-ban-setting-a-global-precedent-for-regulation/",
    "description": "Kuwait, a prominent Middle Eastern nation, has made headlines again by implementing stringent measures to combat illicit cryptocurrency-related activities. The Capital Markets Authority (CMA), Kuwait&#8217;s primary financial regulator, has taken a decisive stand against using Bitcoin (BTC) and other virtual assets. In a recent circular released on July 18, the CMA reaffirmed its commitment to ... <a title=\"Kuwait implements strict crypto ban, setting a global precedent for regulation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kuwait-implements-strict-crypto-ban-setting-a-global-precedent-for-regulation/\" aria-label=\"More on Kuwait implements strict crypto ban, setting a global precedent for regulation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T10:32:05.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.131, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 1.46% increase. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T10:15:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. BNB prices have dropped by 23.95% since April 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T10:30:26.000Z",
    "title": "B2BinPay and Ledger Roll Out Special Edition Custom-Branded Hardware Wallets",
    "url": "https://www.crypto-news-flash.com/b2binpay-and-ledger-roll-out-special-edition-custom-branded-hardware-wallets/?utm_source=rss&utm_medium=rss&utm_campaign=b2binpay-and-ledger-roll-out-special-edition-custom-branded-hardware-wallets",
    "description": "<img width=\"512\" height=\"284\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T114043.407.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T114043.407.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T114043.407-300x166.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />B2BinPay proudly announces its latest collaborative project with Ledger,  the global platform for digital assets.   This groundbreaking partnership introduces customers to a unique Ledger Nano X, personalized and featuring a creative crypto-processing design adorned with the B2BinPay symbol. The specially-branded Ledger will be accessible to two kinds of clients: Freshly registered merchants and enterprise customers; [...]"
  }
]