[
  {
    "source": "Decrypt",
    "date": "2024-02-06T20:01:02.000Z",
    "title": "Solana Outage Can't Stop GameStop Tribute Meme Coin From Skyrocketing",
    "url": "https://decrypt.co/216146/gamestop-gme-meme-coin-price-solana-outage",
    "description": "The GME token inspired by GameStop has nearly doubled in price over the past day, even amid the Solana network outage."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-06T19:42:02.000Z",
    "title": "US Treasury Secretary Calls For Crypto Legislation On ‘Non-Security’ Tokens",
    "url": "https://decrypt.co/216141/us-treasury-secretary-calls-for-crypto-legislation-on-non-security-tokens",
    "description": "Existing laws leave gaps in crypto that enforcement agencies don't account for, Janet Yellen argues."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-06T19:55:00.000Z",
    "title": " 3 reasons why Bitcoin price is showing strength this week ",
    "url": "https://cointelegraph.com/news/3-reasons-why-bitcoin-price-is-showing-strength-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNGY0MGI4YWQtZjYxYi00M2U2LWEwYjQtOTAyOTE4YzM3NGQ3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin bulls are pushing BTC price higher but is there enough willpower to overcome the resistance at $43,500?</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price witnessed only a 0.3% decline over the past week, but new data suggests there are a few positive catalysts for a potential rally. </p><p>Bitcoin has consolidated between the price range of $41,800 and $43,900. While the immediate direction for BTC price is uncertain, there are three factors pointing to a potentially positive short-term outcome.</p><p>According to CoinShares’ reporting, BTC investment products <a href=\"https://blog.coinshares.com/volume-168-digital-asset-fund-flows-weekly-report-16427d7d3235\" target=\"_blank\" rel=\"noopener nofollow\">recorded 99%</a> of all inflows. Bitcoin welcomed $703 million inflows, bringing the total global assets under management to $53 billion. </p><p><a href=\"https://cointelegraph.com/news/3-reasons-why-bitcoin-price-is-showing-strength-this-week\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-06T19:49:17.000Z",
    "title": " US Treasury Secretary calls for federal regulator to oversee stablecoins ",
    "url": "https://cointelegraph.com/news/treasury-secretary-regulatory-gaps-digital-assets",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMTcxOWQyYWYtMWYyYS00ZDA2LTlkNzItNmQ3YWZiZjMxYzFkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>In a hearing of the House Financial Services Committee, Janet Yellen said there should be a regulatory approach on stablecoins applicable to all U.S. states.</p>\n                    <p><p>Janet Yellen, United States Secretary of the Treasury, told lawmakers Congress should address gaps in digital asset regulation, some of which could present risks to either investors or the financial system.</p><p>In a Feb. 6 hearing over the Financial Stability Oversight Council annual report, House Financial Services Committee chair Patrick McHenry <a href=\"https://www.youtube.com/watch?v=x5U8rieK_kw\" target=\"_blank\" rel=\"noopener nofollow\">questioned</a> Yellen about her views on pending legislation aimed at addressing stablecoins and regulatory clarity of the crypto space. The Treasury Secretary called regulation “critical” for certain areas, including protecting wallet holders and overseeing stablecoin issuers.</p><p>“There are many areas with respect to digital assets where we do have clear regulatory authority, but we’ve identified some gaps where, for consumer investor protection and to address financial stability risk, it would be useful for Congress to take action to fill those gaps,” said Yellen.</p><p><a href=\"https://cointelegraph.com/news/treasury-secretary-regulatory-gaps-digital-assets\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-06T20:04:52.000Z",
    "title": "Ronin down nearly 30% after Binance listing",
    "url": "https://cryptoslate.com/ronin-down-nearly-30-after-binance-listing/",
    "description": "<p>Ronin (RON) saw its value plummet by 26% right after its listing on the Binance exchange, erasing a 15% gain and marking a nearly 30% drop in the last 24 hours. Following a short-lived recovery that pushed Ronin above the $3 mark for the first time since February 2022, the digital asset encountered strong resistance [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ronin-down-nearly-30-after-binance-listing/\">Ronin down nearly 30% after Binance listing</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-06T19:46:34.000Z",
    "title": "SEC seeks comments on Ethereum spot ETF proposal from Galaxy and Invesco",
    "url": "https://cryptobriefing.com/sec-seeks-comments-ethereum-spot-etf-proposal-galaxy-invesco/?utm_source=feed&utm_medium=rss",
    "description": "SEC requests feedback on a proposed rule change to list an Ethereum spot exchange-traded fund from Galaxy Digital and Invesco."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-06T19:54:40.000Z",
    "title": "Cardano Foundation CEO Frederik Gregaard on 2023 Milestones and Vision for the Future",
    "url": "https://www.cryptoglobe.com/latest/2024/02/cardano-foundation-ceo-frederik-gregaard-on-2023-milestones-and-vision-for-the-future/",
    "description": "In the Cardano Foundation’s “Activity Report 2023,” CEO Frederik Gregaard reflects on the organization’s progress and outlines its future direction. Drawing inspiration from former Bank of England Governor Mark Carney, Gregaard emphasizes the importance of public trust and consent in the value of money, a principle that guides the foundation’s efforts in advancing the Cardano […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-06T20:00:04.000Z",
    "title": "Solana Mobile’s ‘Chapter 2’ Crypto Phone Surpasses 60,000 Preorders",
    "url": "https://news.bitcoin.com/solana-mobiles-chapter-2-crypto-phone-surpasses-60000-preorders/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/solana_mobile_phone-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Solana Mobile&#039;s &#039;Chapter 2&#039; Phone Hits 60K Preorders Ahead of 2025 Launch\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/solana_mobile_phone-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/solana_mobile_phone-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/solana_mobile_phone-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/solana_mobile_phone-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/solana_mobile_phone-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/solana_mobile_phone-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/solana_mobile_phone.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The crypto community has shown remarkable support for Solana Mobile&#8217;s upcoming &#8220;Chapter 2&#8221; smartphone, amassing over 60,000 preorders after its announcement, as the company gears up for a launch in 2025. Solana Mobile&#8217;s &#8216;Chapter 2&#8217; Phone Hits 60K Preorders Ahead of 2025 Launch Solana Mobile&#8217;s upcoming &#8220;Chapter 2&#8221; crypto phone has already garnered 60,000 preorders, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T19:59:09.000Z",
    "title": "Alameda gap sparks surge in Bitcoin ETF interest among traders",
    "url": "https://www.cryptopolitan.com/alameda-gap-bitcoin-etf-interest-for-traders/",
    "description": "The catastrophic implosion of FTX and its sibling hedge fund Alameda Research didn&#8217;t just leave a bad taste in the mouths of crypto enthusiasts; it carved out what&#8217;s been dramatically dubbed the &#8220;Alameda gap&#8221; in the trading universe. This void, marked by shriveled trading volumes and a hamstrung ability to smoothly execute orders, has been [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T19:57:26.000Z",
    "title": "Algorand Price Prediction 2024-2033: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2024-2033 Algorand is one of the best choices to consider when investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2024 to 2033. Algorand is a very consistent blockchain and, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T19:50:47.000Z",
    "title": "EIA’s energy data directive sparks controversy as Bitcoin miner cries foul play",
    "url": "https://www.cryptopolitan.com/eias-energy-data-directive-to-bitcoin-miners/",
    "description": "In a recent statement, Brian Morgenstern, Head of Public Policy at Riot Platforms Inc., the second-largest Bitcoin miner in the United States, has strongly criticized the US Energy Information Administration&#8217;s (EIA) new directive to gather data on energy consumption by Bitcoin miners. Morgenstern alleges that this move is driven by political motives and not genuine [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T19:47:48.000Z",
    "title": "GBTC’s woes don’t hold back Spot Bitcoin ETFs’ performance",
    "url": "https://www.cryptopolitan.com/gbtcs-woes-dont-hold-back-spot-bitcoin-etfs/",
    "description": "The financial landscape is ever-evolving, and in this dynamic world, Bitcoin ETFs are making their mark, unfazed by the challenges faced by their counterparts. While Grayscale Bitcoin Trust (GBTC) navigates through turbulent waters, witnessing significant outflows, the performance and appeal of spot Bitcoin ETFs managed by powerhouses like BlackRock and Fidelity are soaring. This phenomenon [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T19:46:39.000Z",
    "title": "Alchemy Pay Price Prediction 2024-2033: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2024-2033 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and platform they need to build blockchain solutions. At this time, we can only make educated guesses about [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-06T19:47:40.000Z",
    "title": "Is cryptocurrency investment in 2024 worth the risk?",
    "url": "https://crypto.news/is-crypto-a-good-investment/",
    "description": "Get answers to your crypto investment questions. Learn about trends, promising coins, market risks, and whether investing in cryptocurrency is wise in 2024. Despite a buoyant surge in Dec. 2023, leading to an over 16% increase in the total crypto&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-06T20:00:42.000Z",
    "title": "Massive $29.3 Million Whale Transfer Threatens XRP Price With More Sell Pressure",
    "url": "https://www.newsbtc.com/analysis/xrp/29-3-million-whale-xrp-price/",
    "description": "The XRP price has yet to recover from the latest exploit, which resulted in Ripple&#8217;s co-founder Chris Larsen being hacked and 213 million XRP worth $120 million carted away. This seems to have further spooked a depleting whale account base, as on-chain data points to XRP whales already exiting their positions in the past few weeks.  Particularly, on-chain data from whale transaction tracker WhaleAlerts points to a recent transaction of 29 million XRP tokens transferred from an unknown wallet to the crypto exchange Bitstamp. Massive XRP Whale Transfer To Crypto Exchange The actions of whales or large holders of cryptocurrencies seem to always tell the nature of general market sentiment. XRP, for instance, has been under selling pressure in the past week, as the crypto is currently down by 5.51% in a 7-day timeframe.  Related Reading: Chainlink (LINK) Price Breaks Out Of Bullish Flag Pole, Here’s The Next Target However, recent data points to continued selling pressure in the near term. For instance, according to whale alerts, 29 million XRPs worth $14.7 million were sent to Bitstamp. Similarly, 28.85 million XRP worth $14.6 million was sent to Bitstamp in another transaction. The nature of these transactions likely points to whales dumping their holdings, and moves like this could foreshadow further declines. 🚨 28,850,000 #XRP (14,628,631 USD) transferred from unknown wallet to #Bitstamphttps://t.co/ujvPfK3ezM — Whale Alert (@whale_alert) February 5, 2024 On-chain data from Santiment Supply by Addresses metric, which tracks the number of wallet addresses holding more than 1 million XRP tokens, tells a similar tale. According to this metric, the number of addresses in this category saw a steady increase, reaching 1,986 on January 28. This figure dropped to 1,957 on February 3rd, which indicated that 29 whale wallets cut down on their holdings during this period. At the time of writing, the metric stands at 1,962 wallets. Source: Santiment XRP Price Selling Pressure To Continue? XRP recently crossed below $0.5 for the first time since October after news of the hack broke out. However, the price has since made a slight recovery from $0.49 and is trading at the $0.50 level at the time of writing.  Related Reading: Bitcoin To $45,000 Or $30,000? Analyst Reveals Key Factor That Will Drive The Decision Despite seeing a 27.43% increase in trading volume, the XRP price has failed to post gains in the past 24 hours and is down by 0.35%. On a larger timeframe, the crypto is down by 10.6% in 30 days, with price movement indicating the formation of lower highs and lower lows. Consequently, if the selling pressure continues and the current minor support at $0.501 fails to hold, XRP could break below to form a lower low around $0.48 According to crypto analyst EGRAG CRYPTO, known for his bullish stance on XRP, the current decline is a perfect opportunity to accumulate more tokens while suggesting the XRP price could spike to $22 very soon. XRP price struggles amid unfavorable market headwinds &#124; Source: XRPUSD on Tradingview.com Featured image from U.Today, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-06T19:45:36.000Z",
    "title": "SEC Chair Gary Gensler Will Meet With Korean Regulator To Discuss Global Impact of Bitcoin ETF: Report",
    "url": "https://dailyhodl.com/2024/02/06/sec-chair-gary-gensler-will-meet-with-korean-regulator-to-discuss-global-impact-of-bitcoin-etf-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/sec-will-meet-impact.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/sec-will-meet-impact.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/02/sec-will-meet-impact.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/sec-will-meet-impact.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/sec-will-meet-impact.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/sec-will-meet-impact.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/02/sec-will-meet-impact.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>U.S. Securities and Exchange Commission (SEC) Chair Gary Gensler reportedly plans to meet with a top South Korean financial regulator later this year to discuss crypto and the newly approved spot Bitcoin (BTC) exchange-traded funds (ETFs). Lee Bok-hyun, head of South Korea&#8217;s Financial Supervisory Service (FSS), announced this week that he plans to travel to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/06/sec-chair-gary-gensler-will-meet-with-korean-regulator-to-discuss-global-impact-of-bitcoin-etf-report/\">SEC Chair Gary Gensler Will Meet With Korean Regulator To Discuss Global Impact of Bitcoin ETF: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-06T19:41:35.000Z",
    "title": "Monero Crashes 30% After Binance Includes XMR in Altcoin Delisting Spree",
    "url": "https://dailyhodl.com/2024/02/06/monero-crashes-30-after-binance-includes-xmr-in-altcoin-delisting-spree/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/02/binance-donates-ukraine.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/02/binance-donates-ukraine.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/02/binance-donates-ukraine.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/02/binance-donates-ukraine.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/02/binance-donates-ukraine.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/02/binance-donates-ukraine.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/02/binance-donates-ukraine.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Monero (XMR), the biggest privacy-focused cryptocurrency on the market, is being delisted by Binance, the largest crypto exchange in the world. In an announcement, Binance says that after review, XMR will be included in a fresh delisting spree. XMR, which has been a favorite for those seeking blockchain anonymity since 2014, immediately dropped after the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/06/monero-crashes-30-after-binance-includes-xmr-in-altcoin-delisting-spree/\">Monero Crashes 30% After Binance Includes XMR in Altcoin Delisting Spree</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]