[
  {
    "source": "Decrypt",
    "date": "2023-07-10T16:48:00.000Z",
    "title": "100 Thieves' Moe Says Blockchain Games Will 'Eventually' Be Accepted by Livestreamers",
    "url": "https://decrypt.co/videos/interviews/xHhh62ID/100-thieves-moe-says-blockchain-games-will-eventually-be-accepted-by-livestreamers",
    "description": "100 Thieves content creator and gamer Moe also goes by \"Yassuo\" online after his favorite League of Legends character. Decrypt's Kate Irwin asks him about 100 Thieves' future crypto plans and whether Moe thinks creators like xQc and Pokimane might ever come around to blockchain games."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-10T17:03:19.000Z",
    "title": "Perpetual futures market sees Bitcoin reclaim dominance over Ethereum",
    "url": "https://cryptoslate.com/insights/perpetual-futures-market-sees-bitcoin-reclaim-dominance-over-ethereum/",
    "description": "<p>Quick Take Perpetual Futures have traditionally attracted significant open interest and trading volumes for both Bitcoin (BTC) and Ethereum (ETH). This trend underscores their widespread popularity as the futures products of choice within the crypto investment milieu. Historically, BTC has maintained a trading volume supremacy over ETH in this market. However, this trend underwent a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/perpetual-futures-market-sees-bitcoin-reclaim-dominance-over-ethereum/\">Perpetual futures market sees Bitcoin reclaim dominance over Ethereum</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-10T16:57:43.000Z",
    "title": "Wasn’t crypto supposed to be for retail investors?",
    "url": "https://cryptodaily.co.uk/2023/07/wasnt-crypto-supposed-to-be-for-retail-investors",
    "description": "<p>As retail investors leave crypto in droves, is institutional money coming in to quietly buy the cream of the cryptocurrencies?</p>\nSell and perhaps get in lower?\n<p>Bitcoin is at a critical juncture. A narrative going around social media platforms such as Twitter suggests that with the backdrop of the SEC enforcement actions against Coinbase and Binance, the liquidity and investor interest that would normally propel the next bitcoin bull market just isn&rsquo;t there.</p>\n<p>Bitcoin is going sideways and downwards, and certain influencers and analysts believe that the latest rejection from the $31,000 price level is the start of a fairly large pullback that could be in the range of 30% for bitcoin and up to 50% for the altcoins.</p>\n<p>In this sort of very uncertain environment weak hands are going to sell and even stronger hands might be thinking to do the same thing with a view to improving their position a lot lower down.</p>\nFickle retail money vs institutional know-how\n<p>So we perhaps have the perfect scenario for an institutional take over of cryptocurrencies that have been in the hands of retail investors ever since they came onto the scene.</p>\n<p>It must be wondered though just how fickle retail is. It is hardly any time at all since Larry Fink, CEO of Blackrock, the largest asset management firm in the world, said on national TV in the US that bitcoin was an &ldquo;international asset&rdquo; and &ldquo;digitised gold&rdquo;.</p>\n<p>Obviously, it&rsquo;s not at all sure that the Blackrock filing for a Spot Bitcoin ETF will be approved, especially given Gensler and the SEC&rsquo;s extremely negative stance on crypto. Be that as it may, Blackrock isn&rsquo;t just any company. It is a behemoth, and has untold influence in Washington and across the world. It will surely get the business done at some point.</p>\n<p>A Washington Post article published on Saturday posits that the &ldquo;tech-focused investors&rdquo; have moved on from crypto and are now much more interested in artificial intelligence, and that the once crazy amounts of venture capital that used to be thrown at crypto has &ldquo;slowed to a trickle&rdquo;.</p>\n<p>When this kind of narrative becomes this strong, and the bitcoin halving only 280 days away, it&rsquo;s a perfect time for big money to slowly start coming into the crypto space. It cannot be argued that crypto will provide the solutions for many issues, especially in finance, and therefore now could be a good time for entry.</p>\nThe narrative is established\n<p>When Satoshi Nakamoto launched bitcoin in the time of the Great Financial Crisis of 2008, he meant for bitcoin to be bought by the people in order to save them from the next, probably even worse crisis.&nbsp;</p>\n<p>The average retail investor is scared though. Mainstream media has done its work, and so has the Biden administration, central banks across the world, and regulatory agencies such as the SEC. As this next financial crisis looms larger, retail needs to be brave and hang on in there. The alternative can be so much worse.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T16:53:43.000Z",
    "title": "Standard Chartered predicts Bitcoin supply shock will send the price to $120K",
    "url": "https://www.cryptopolitan.com/standard-chartered-btc-to-reach-120k-in-2024/",
    "description": "According to a research report published on Monday by Standard Chartered Bank, Bitcoin (BTC), the largest crypto by market capitalization, could reach $50,000 by the end of the year and $120,000 by the end of 2024. The banking behemoth announced a BTC price recovery in the report published on July 10 and cited by media ... <a title=\"Standard Chartered predicts Bitcoin supply shock will send the price to $120K\" class=\"read-more\" href=\"https://www.cryptopolitan.com/standard-chartered-btc-to-reach-120k-in-2024/\" aria-label=\"More on Standard Chartered predicts Bitcoin supply shock will send the price to $120K\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T16:52:53.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T16:49:49.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T16:45:52.000Z",
    "title": "Holochain Price Prediction 2023-2032: Will HOT coin reach $1?",
    "url": "https://www.cryptopolitan.com/holochain-price-prediction/",
    "description": "Holochain Price Prediction 2023-2032 Holochain stands out with its distinctive features that differentiate it from traditional architectures and decentralized frameworks. It adopts an agent-centric design, prioritizing individual users by giving them control over their identities and data. Applications run directly on users&#8217; devices, eliminating the need for central servers and promoting user autonomy. Let’s see ... <a title=\"Holochain Price Prediction 2023-2032: Will HOT coin reach $1?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/holochain-price-prediction/\" aria-label=\"More on Holochain Price Prediction 2023-2032: Will HOT coin reach $1?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-10T17:00:20.000Z",
    "title": "Bitcoin NVT Golden Cross Says BTC Is Overpriced, Decline Soon?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-nvt-golden-cross-says-btc-is-overpriced-decline-soon/",
    "description": "On-chain data shows the Bitcoin NVT Golden Cross has neared the overvalued zone recently, a sign that a drawdown could be coming. Related Reading: XRP FUD Spikes, Will This Trigger A Price Reversal? Bitcoin NVT Golden Cross Is Near &#8220;Overpriced&#8221; Territory An analyst in a CryptoQuant post pointed out that the BTC NVT Golden Cross has recently increased. The &#8220;Network Value to Transactions (NVT) ratio&#8221; is an indicator that measures the ratio between the market cap of Bitcoin and its transaction volume. The &#8220;transaction volume&#8221; here naturally refers to the total amount of the asset that investors are moving around on the blockchain. The NVT ratio can be viewed as a comparison between the asset&#8217;s value (the market cap) and the blockchain&#8217;s ability to transact coins. When the indicator is high, the market cap is higher than the cryptocurrency&#8217;s volume. Such a trend can indicate that the asset&#8217;s price is currently overvalued. On the other hand, low values imply the market cap is low relative to the network&#8217;s ability to move tokens, so the asset&#8217;s spot price may be undervalued currently. The indicator of interest here is not the NVT itself but a modified form called the &#8220;NVT Golden Cross.&#8221; This metric compares the long-term moving average (30-day) of the NVT with the short-term one (10-day). Here is a chart that shows the trend in the Bitcoin NVT Golden Cross over the past year or so: The value of the metric seems to have been going up in recent days &#124; Source: CryptoQuant In the above graph, the quant has marked the historical undervalued and overvalued zones for the Bitcoin NVT Golden Cross. It looks like above a value of 2.2, the asset may be considered overpriced, as the cryptocurrency&#8217;s price has generally taken a hit when the indicator has entered into this territory. Similarly, the underpriced condition is defined at values under -1.6, with the cryptocurrency usually finding bottoms whenever the metric has dipped inside this zone. The chart shows that the NVT Golden Cross has been rising in the last few weeks as the latest leg in the BTC rally has taken place. Earlier in the month, the metric almost touched the overpriced zone, but it declined before fully entering it, as the asset price dropped from above the $31,000 level. Though the Bitcoin drawdown has been small, the indicator still has a relatively high value as it continues to be at a hand&#8217;s reach from the overvalued territory. Related Reading: Bitcoin Short-Term Holders Continue Exchange Inflows, But Price Holds On It remains to be seen whether the metric will go up again in the coming days and break into the overvalued territory (in which case, the price might observe a top formation) or if it will see further decline. BTC Price At the time of writing, Bitcoin is trading around $30,200, down 1% in the last week. BTC has been quite stagnant recently &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-10T16:46:58.000Z",
    "title": "TRON Releases Periander and the First TRON-Based RAW Product, and Burns 7,238,121 TRX ($579,049.68)",
    "url": "https://www.crypto-news-flash.com/tron-releases-periander-and-the-first-tron-based-raw-product-and-burns-7238121-trx-579049-68/?utm_source=rss&utm_medium=rss&utm_campaign=tron-releases-periander-and-the-first-tron-based-raw-product-and-burns-7238121-trx-579049-68",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/skyscrapers-5838029-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/skyscrapers-5838029-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/skyscrapers-5838029-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/skyscrapers-5838029-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/skyscrapers-5838029-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/skyscrapers-5838029-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/skyscrapers-5838029-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/skyscrapers-5838029-104x69.jpg 104w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Tron includes token burn, Real World Asset (RWA) products, and Hackathon unveiling in its weekly update. TRX is, however, struggling to rise despite the groundbreaking upgrades and announcements.  Tron (TRX) has been very active in the crypto space in the last couple of years as the team seeks to advance the ecosystem to compete at [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-10T16:55:49.000Z",
    "title": "Stablecoin Issuers Circle and Tether Freeze Stablecoins Tied to Multichain Exploit: On-Chain Data",
    "url": "https://dailyhodl.com/2023/07/10/stablecoin-issuers-circle-and-tether-freeze-stablecoins-tied-to-multichain-exploit-on-chain-data/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/usdt-slashes-paper.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/usdt-slashes-paper.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/usdt-slashes-paper.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/usdt-slashes-paper.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/usdt-slashes-paper.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/usdt-slashes-paper.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/usdt-slashes-paper.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Blockchain data reveals that stablecoin firms Circle and Tether have frozen coins linked to the recent multi-million-dollar Multichain exploit. Earlier this week, blockchain security firm PeckShield found that Multichain, a cross-chain crypto platform, saw its Fantom (FTM) bridge hacked to the tune of $126 million worth of digital assets. The crypto assets stolen include Chainlink [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/10/stablecoin-issuers-circle-and-tether-freeze-stablecoins-tied-to-multichain-exploit-on-chain-data/\">Stablecoin Issuers Circle and Tether Freeze Stablecoins Tied to Multichain Exploit: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]