[
  {
    "source": "CoinDesk",
    "date": "2024-02-29T14:00:54.000Z",
    "title": "Digital Asset Manager Onramp Invest Integrates CoinDesk 20 Index for RIAs",
    "url": "https://www.coindesk.com/tech/2024/02/29/digital-asset-manager-onramp-invest-integrates-coindesk-20-index-for-rias/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Onramp is the first U.S.-based firm to allow for investible access via the CoinDesk 20 Index."
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-29T14:00:47.000Z",
    "title": "Protocol Village: Crypto Losses From Hacks, Rug Pulls Up 15% YTD, Immunefi Says ",
    "url": "https://www.coindesk.com/tech/2024/02/28/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Feb. 29-March 6."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-29T14:05:29.000Z",
    "title": "‘Pig Butchering’ Crypto Romance Scams Up 85 Times Since 2020",
    "url": "https://decrypt.co/219668/pig-butchering-crypto-romance-scams-up-85-times-since-2020",
    "description": "Revenue from romance scams doubled from 2022 to 2023, even as the total value sent to scams fell, according to a new report from Chainalysis."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-29T14:01:02.000Z",
    "title": "Ethereum NFT Card Game 'Gods Unchained' Hits iOS and Android",
    "url": "https://decrypt.co/219587/ethereum-nft-card-game-gods-unchained-ios-android",
    "description": "Gods Unchained is finally making the leap to mobile, bringing its Hearthstone-esque NFT card battles to iOS and Android devices alike."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-29T13:48:01.000Z",
    "title": "These Crypto Stocks Outperformed Bitcoin in Feburary Despite BTC's Rally",
    "url": "https://decrypt.co/219624/crypto-stocks-outperformed-bitcoin-coin-mara-mstr",
    "description": "Despite Bitcoin's 45% rise since the start of February, a trader would have seen even bigger gains investing in three crypto stocks."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-29T14:01:00.000Z",
    "title": " Murder by (smart) contract: Ari Juels publishes crypto thriller ",
    "url": "https://cointelegraph.com/news/smart-contract-ari-juels-book-oracle",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZWM2MGE2NGUtMzdjOS00OTAzLWE4ZDItZGEyYjYzMWNkNzE4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A Cornell Tech professor and blockchain luminary has written a cautionary novel about smart contracts gone rogue.</p>\n                    <p><p data-ct-non-breakable=\"true\">Where do we draw the line between life and fiction? </p><p>Ari Juels is a chaired professor at Cornell Tech, a computer science faculty member at Cornell University and chief scientist at Chainlink Labs, a leader in decentralized oracle networks. He’s also just written a crypto thriller novel, <em>The Oracle, </em>published by Talos Press.</p><p>The novel’s protagonist is, like Juels, an expert on blockchain oracles, which are entities that connect blockchains to external systems. Juels <a href=\"https://research.chain.link/whitepaper-v2.pdf\" target=\"_blank\" rel=\"noopener nofollow\">co-authored</a> Chainlink Labs’ 2021 white paper. </p><p><a href=\"https://cointelegraph.com/news/smart-contract-ari-juels-book-oracle\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-29T14:00:00.000Z",
    "title": " AI-powered community engagement rewards: Chappyz joins Cointelegraph Accelerator ",
    "url": "https://cointelegraph.com/news/ai-powered-community-engagement-rewards-chappyz-joins-cointelegraph-accelerator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy8zNTk5YzUzMjhjZTUzY2Q1YTg4MTE4ZjNhYjdhMDNkNS5qcGc=.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Chappyz, an AI-powered protocol that aims to increase conversational engagement in social media platforms, joins the Cointelegraph Accelerator program.</p>\n                    <p><p><a href=\"https://chappyz.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Chappyz</a>, a plug-and-play Web3 protocol, becomes the latest participant of the <a href=\"https://cointelegraph.com/accelerate/\">Cointelegraph Accelerator</a> program.</p><p>With over <a href=\"https://datareportal.com/reports/digital-2024-global-overview-report\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">5.35 billion</a> internet users, it’s no wonder that social media has become the biggest phenomenon of the last decade. Each user <a href=\"https://datareportal.com/social-media-users\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">navigates</a> an average of 6.7 social media platforms, resulting a stiff competition between networks.</p><p>In this crowded and competitive landscape, the battle for attention is won through user engagement, which <a href=\"https://www.forbes.com/sites/kylewong/2014/05/13/what-is-the-value-of-social-media-engagement/?sh=3c7e1b7a5951\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">determines</a> the platforms’ success, reach and profitability. Platforms that draw users’ interest through active participation secure a larger share of these minutes and foster a sense of community and belonging that is crucial for long-term success.</p><p><a href=\"https://cointelegraph.com/news/ai-powered-community-engagement-rewards-chappyz-joins-cointelegraph-accelerator\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-29T14:00:00.000Z",
    "title": " Darknet market crypto crimes on the rise in 2023, $1.7B revenue — Chainalysis ",
    "url": "https://cointelegraph.com/news/darknet-market-crypto-crimes-rise-chainalysis",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZjJjZTZlYjctNzZkNi00ZDUyLTkwMjQtOTg3YTBmZmNkNzdkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Chainalysis 2024 Crypto Crime Report highlights a $1.7 billion revenue surge in darknet markets and a rise in crypto-linked sanctions and new scam trends. </p>\n                    <p><p data-ct-non-breakable=\"true\">The crypto industry continues to suffer from cybercrimes, with darknet markets being one of the two categories showing an increase in revenue in 2023, according to the latest report from blockchain analysis firm Chainalysis. </p><p>The Chainalysis “2024 Crypto Crime Report,” released on Feb. 29, <a href=\"https://go.chainalysis.com/crypto-crime-2024.html\" target=\"_blank\" rel=\"noopener nofollow\">reveals</a> that darknet marketplaces received revenue of at least $1.7 billion in 2023 — a rebound from its 2022 data when authorities shut down <a href=\"https://cointelegraph.com/news/crypto-scams-fall-65-after-gullible-noobs-exit-the-market-chainalysis\">the world’s largest darknet marketplace</a>, Hydra.</p><p>While no single marketplace replaced Hydra, the report revealed that smaller marketplaces are thriving by serving specific niches and developing more “specialized roles.” Chainalysis highlighted Mega Darknet Market leading the pack with over $500 billion in crypto inflows.</p><p><a href=\"https://cointelegraph.com/news/darknet-market-crypto-crimes-rise-chainalysis\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-29T14:00:00.000Z",
    "title": " Funds hacked in 2024 increased by 15.4% vs. the same period in 2023 — Immunefi ",
    "url": "https://cointelegraph.com/news/hacked-funds-2024-increased-compared-last-year",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMDgxOTU2YjctMTI5OC00ZTIzLTkyOGMtZTcyMzZkOTUxOWQ0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ethereum was the most targeted chain for hackers in 2024, accounting for 85% of the value lost in February.</p>\n                    <p><p data-ct-non-breakable=\"true\">Over $200 million worth of cryptocurrency has been lost to hacks and rug pulls in 2024 year-to-date (YTD) across 32 individual incidents, according to a Feb. 29 research report by blockchain security firm Immunefi.</p><p>The over $200 million loss YTD represents a 15.4% increase compared to January and February 2023, when $173 million of digital assets were stolen. </p><p>February saw over $67 million worth of crypto stolen across 12 specific hack and fraud incidents. This represents a nearly 50% decrease from January, which recorded $133 million worth of stolen crypto.</p><p><a href=\"https://cointelegraph.com/news/hacked-funds-2024-increased-compared-last-year\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-29T14:00:38.000Z",
    "title": "Analysis challenges Bitcoin diminishing returns theory amid recent gains",
    "url": "https://cryptoslate.com/insights/analysis-challenges-bitcoin-diminishing-returns-theory-amid-recent-gains/",
    "description": "<p>Quick Take The diminishing returns theory, suggesting that Bitcoin will yield lesser returns with each cycle, is a subject of intense scrutiny. The examination of this theory from two points of view, the cycle low and the cycle all-time high, provides interesting insights. In November 2022, Bitcoin&#8217;s cycle low occurred during the FTX collapse, dropping [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/analysis-challenges-bitcoin-diminishing-returns-theory-amid-recent-gains/\">Analysis challenges Bitcoin diminishing returns theory amid recent gains</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T14:08:42.000Z",
    "title": "FFXIV Implements Harsh Penalties for Real Money Trading Violations",
    "url": "https://www.cryptopolitan.com/ffxiv-implements-harsh-penalties-for-real/",
    "description": "In a recent crackdown on Real Money Trading (RMT) within the popular MMORPG Final Fantasy XIV (FFXIV), Square Enix has terminated over 10,000 player accounts.&#160; The company defines RMT as the sale of in-game items, currency, characters, or other data for real-world currency, a practice strictly prohibited under the game&#8217;s policies.&#160; This mass banning comes [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T14:03:59.000Z",
    "title": "Crypto trader optimistic about Bitcoin and Ethereum amidst growing US debt concerns",
    "url": "https://www.cryptopolitan.com/crypto-trader-optimistic-about-bitcoin/",
    "description": "Amidst surging cryptocurrency prices, prominent commodity trader Peter L. Brandt took to social media to congratulate Bitcoin holders and enthusiasts while expressing optimism about the future of digital currencies in the face of mounting US state debt. Brandt&#8217;s remarks shared on the X platform (formerly known as Twitter), shed light on his steadfast belief in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T14:00:11.000Z",
    "title": "HackerOne Launches AI Co-pilot Hai to Enhance Vulnerability Response",
    "url": "https://www.cryptopolitan.com/hackerone-launches-ai-co-pilot-hai/",
    "description": "In a significant development within the cybersecurity industry, HackerOne, a leading global security company, has announced the beta launch of its innovative artificial intelligence (AI) co-pilot, dubbed Hai. This cutting-edge technology is designed to revolutionize the way organizations approach vulnerability response times, aiming to streamline and enhance the efficiency of vulnerability management processes. HackerOne to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T14:00:00.000Z",
    "title": "Coinbase Makes Case to SEC for Spot Ethereum ETF; Quant and Monero Killer Sets the Bar High",
    "url": "https://www.cryptopolitan.com/coinbase-makes-case-to-sec-for-spot-ethereum-etf-quant-and-monero-killer-sets-the-bar-high/",
    "description": "Ethereum (ETH) might be one of the best altcoins to invest in right now due to the likelihood of spot exchange-traded funds being launched in May 2024. The second-largest cryptocurrency exchange around, Coinbase, has filed a 27-page letter to the U.S. Securities and Exchange Commission (SEC), formally asking for the approval of Grayscale’s request to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T13:55:15.000Z",
    "title": "Forget the Bitcoin halving fear – Here’s where BTC is headed",
    "url": "https://www.cryptopolitan.com/forget-the-bitcoin-halving-fear/",
    "description": "Bitcoin halving events often stir anxiety and speculation within the crypto community as they mark significant milestones in the protocol&#8217;s monetary policy. However, focusing solely on the fear surrounding halvings can obscure the broader trajectory of BTC&#8217;s journey. Despite the apprehension accompanying these events, looking beyond the short-term fluctuations and considering the fundamental principles and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T13:51:40.000Z",
    "title": "Helldivers 2 Introduces Game Master Joel: Behind-the-Scenes Insights and Gameplay Evolution",
    "url": "https://www.cryptopolitan.com/helldivers-2-introduces-game-master-joel/",
    "description": "Helldivers 2, the acclaimed online shooter developed by Arrowhead Studios, has recently unveiled an intriguing addition to its development team: Joel, the Game Master (GM). Joel&#8217;s role within the studio brings elements of tabletop role-playing games (TTRPGs) like Dungeons and Dragons to the fast-paced world of Helldivers 2. This article explores Joel&#8217;s influence, the game&#8217;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T13:41:47.000Z",
    "title": "Nigeria’s Central Bank Governor raises concerns over untraceable funds flowing through Binance",
    "url": "https://www.cryptopolitan.com/untraceable-funds-flowing-through-binance/",
    "description": "In a recent development concerning Nigeria&#8217;s financial landscape, Olayemi Cardoso, the Governor of the Central Bank of Nigeria (CBN), has voiced apprehensions regarding the significant influx of untraceable funds through Binance Nigeria, one of the country&#8217;s prominent cryptocurrency exchanges. Multiple local media outlets have reported on Cardoso&#8217;s remarks, highlighting the urgency of addressing this issue [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-29T14:00:58.000Z",
    "title": "Ethereum Bulls Get Aggressive As Traders Set Sights on $4,000 Amid Market Frenzy",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-bulls-get-aggressive-as-traders-set-sights-on-4000-amid-market-frenzy/",
    "description": "Ethereum has been exhibiting a robust and sustained upward trend, showing its mettle in the volatile cryptocurrency market. At the time of writing, the price of ETH was hovering around $3,743, surpassing its moving averages with considerable bullish momentum. The cryptocurrency community is now eagerly anticipating the breach of the significant $3,500 price threshold, marking a potential milestone for Ethereum&#8217;s continued ascent to the highly-coveted $4,000 price tag. Related Reading: Bitcoin Ascent To $64,000 Causes Coinbase To Crash – Here’s What Happened Notably, the current price has surged well above the 50-day moving average, which stands at approximately $2,700, underscoring the strength of the ongoing bullish trend. Furthermore, the 100-day moving average, situated at $2,400, serves as another crucial support level. Historically, these key supports have proven instrumental in propelling Ethereum prices higher upon retesting. ETH Surge: Price Correction In The Offing? Ethereum (ETH) surged alongside Bitcoin (BTC) on February 28th, reaching within spitting distance of its all-time high of $3,500. While bulls celebrate, a technical indicator hints at a potential pause in the rally. The CryptoQuant Funding Rates metric, reflecting fees paid in perpetual futures contracts, reveals a significant spike for ETH on February 28th. Reaching 0.07%, it marks the highest level since April 2021, exceeding the 0.06% peak observed before ETH&#8217;s previous peak of $4,800 in November 2021. Historically, such surges in funding rates have often preceded price corrections. Source: CryptoQuant The high CryptoQuant Funding Rates not only suggest a potential pause in the rally but also raise concerns about the sustainability of the current momentum. Typically, such dramatic surges indicate excessive bullish sentiment and overheated markets fueled by highly leveraged long positions. Crypto market cap now stands at $2.27 trillion. Chart: TradingView.com There are two reasons why this scenario is extremely complex. First off, in the event that prices turn around, it exposes bulls to significant losses. Second, it raises the possibility of a long squeeze, an uncommon situation in which strong short-term selling pushes holders of long positions to liquidate, thus quickening the price decrease. ETH up 16% in the weekly chart. Source: Coingecko Imagine a domino effect: leveraged long positions get called upon margin calls, forcing liquidation, which triggers further selling, pushing prices down further, and causing more margin calls. This cascading effect can lead to panic selling and significant losses for overly optimistic investors. Although there is no assurance that a prolonged squeeze will occur, the increased funding rates serve as a harsh reminder of the inherent risks that are associated with chasing a highly stretched rally. 💤 A dormant pre-mine address containing 72 #ETH (243,771 USD) has just been activated after 8.6 years!https://t.co/K8769uQJ0w — Whale Alert (@whale_alert) February 28, 2024 Old Ethereum Whales Reappear, Sparking Crypto Speculation In another development, a pre-mine Ethereum wallet that had remained inactive for almost nine years has been reopened, according to data released by the cryptocurrency tracker Whale Alert. It has 72 ETH valued at $243,771 in it. This tracking platform discovered that these 72 ETH funds had been moved to another anonymous cryptocurrency wallet. In addition to this wallet, according to recent sources, a number of dormant Ethereum whales awoke in February and held premined Ethereum worth 100 ETH, 429 ETH, 3,465 ETH (valued at roughly $10.4 million), and 100 ETH. They had all been dormant for about nine years. Featured image from Pixabay, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-29T14:01:34.000Z",
    "title": "IOTA Fuels TradeTech Revolution with $10M Investment: Transforming Global Trade",
    "url": "https://www.crypto-news-flash.com/iota-fuels-tradetech-revolution-with-10m-investment-transforming-global-trade/?utm_source=rss&utm_medium=rss&utm_campaign=iota-fuels-tradetech-revolution-with-10m-investment-transforming-global-trade",
    "description": "<img width=\"1728\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-hand-held-logo.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"IOTA\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-hand-held-logo.jpg 1728w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-hand-held-logo-300x208.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-hand-held-logo-1024x711.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-hand-held-logo-768x533.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-hand-held-logo-1536x1067.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-hand-held-logo-150x104.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-hand-held-logo-450x313.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-hand-held-logo-1200x833.jpg 1200w\" sizes=\"(max-width: 1728px) 100vw, 1728px\" />IOTA&#8217;s $10M investment marks a significant step towards digitizing global trade and finance. The initiative aims to empower startups and innovators, especially in the UAE and Africa, to create cutting-edge trade solutions. The IOTA Ecosystem DLT Foundation, based in the United Arab Emirates, has announced a colossal investment exceeding $10 million. This strategic funding is [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-29T14:00:15.000Z",
    "title": "Experts Are Confident This Cryptocurrency Will Repeat Solana’s (SOL) 700% Surge With Upcoming Exchange Listings",
    "url": "https://www.crypto-news-flash.com/experts-are-confident-this-cryptocurrency-will-repeat-solanas-sol-700-surge-with-upcoming-exchange-listings/?utm_source=rss&utm_medium=rss&utm_campaign=experts-are-confident-this-cryptocurrency-will-repeat-solanas-sol-700-surge-with-upcoming-exchange-listings",
    "description": "<img width=\"1200\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-29T160045.037.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-29T160045.037.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-29T160045.037-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-29T160045.037-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-29T160045.037-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-29T160045.037-450x253.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Few things in the quick-paced world of cryptocurrencies draw investors&#8217; and fans&#8217; attention as much as a potential crypto gem being listed on a major exchange.The spotlights are currently focused on Retik Finance (RETIK) as it gets ready for its official listing on exchanges, with excitement and anticipation growing. Many analysts believe that Retik Finance [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-29T13:58:18.000Z",
    "title": "UFO Gaming Announces Super Galactic Closed Beta Campaign",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/ufo-gaming-announces-super-galactic-closed-beta-campaign/",
    "description": "<p>Gamers worldwide are eagerly anticipating the March start of the closed beta phase, ready to experience gaming&#8217;s future. Let&#8217;s discover more about UFO Gaming. Phase 1: Refining Gameplay and Mechanics Phase 1 refined the game client and gameplay mechanics, including PVP and PVE modes. The forthcoming closed and open-beta versions promise to elevate the gaming [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/ufo-gaming-announces-super-galactic-closed-beta-campaign/\">UFO Gaming Announces Super Galactic Closed Beta Campaign</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-29T14:03:39.000Z",
    "title": "Jeff Bezos Enters the Bitcoin Speculation Spotlight After Amazon Stock Sale",
    "url": "https://coinedition.com/jeff-bezos-enters-the-bitcoin-speculation-spotlight-after-amazon-stock-sale/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Crypto_Trader_Believes_Bitcoin_BTC_is_Poised_for_an_Explosive_Move.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Jeff Bezos Enters Bitcoin Speculation\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Crypto_Trader_Believes_Bitcoin_BTC_is_Poised_for_an_Explosive_Move.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Crypto_Trader_Believes_Bitcoin_BTC_is_Poised_for_an_Explosive_Move-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Crypto_Trader_Believes_Bitcoin_BTC_is_Poised_for_an_Explosive_Move-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency world is filled with speculation following several financial movements made by the founder of Amazon, Jeff Bezos, which have generated rumors that he might invest in Bitcoin. The chatter gained momentum after Apollo co-founder Thomas Fahrer hinted on X about Bezos&#8217;s recent activities, suggesting a significant move into the cryptocurrency space. According to [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/jeff-bezos-enters-the-bitcoin-speculation-spotlight-after-amazon-stock-sale/\">Jeff Bezos Enters the Bitcoin Speculation Spotlight After Amazon Stock Sale</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]