[
  {
    "source": "Bitcoin.com",
    "date": "2024-01-03T06:30:34.000Z",
    "title": "Ordinals Founder Casey Rodarmor Warns Bitcoin Maxis That ‘Whining’ Makes Them ‘Look Weak’",
    "url": "https://news.bitcoin.com/ordinals-founder-casey-rodarmor-warns-bitcoin-maxis-that-whining-makes-them-look-weak/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/whining-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/whining-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/whining-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/whining-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/whining-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/whining-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/whining-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/whining.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Casey Rodarmor, the developer of the Ordinals protocol, has called out ideological Bitcoin maxis for their views on inscriptions and censoring transactions on the Bitcoin blockchain. Rodarmor stated that the &#8220;whining&#8221; around the protocol and its usage of block space make them &#8220;look weak,&#8221; contradicting the idea that Bitcoin is &#8220;unstoppable internet money.&#8221; Ordinals Dev [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T06:35:29.000Z",
    "title": "CBOE predicts approval of spot Bitcoin ETF will attract institutional investors",
    "url": "https://www.cryptopolitan.com/cboe-predicts-approval-of-spot-bitcoin-etf/",
    "description": "The Chicago Board Options Exchange (CBOE) Digital president, John Palmer, has expressed optimism about the potential approval of a spot Bitcoin exchange-traded fund (ETF) and its impact on the cryptocurrency market. Palmer said this approval could usher in a new era of institutional and retail interest in Bitcoin derivatives. In a recent interview on Bloomberg [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T06:27:53.000Z",
    "title": "AI in Healthcare: Americans Trust AI for Diagnoses and Treatment Recommendations",
    "url": "https://www.cryptopolitan.com/ai-in-healthcare-americans-trust-ai/",
    "description": "Americans are increasingly turning to Artificial Intelligence (AI) for healthcare insights, diagnoses, and treatment recommendations. A recent study of 2,000 American adults conducted by UserTesting revealed that 52% of respondents had sought assistance from large language models (LLMs) like ChatGPT to evaluate their symptoms.&#160; Even more notably, 81% of those who used AI for diagnosis [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T06:15:00.000Z",
    "title": "Navigating the Fallout – AI Frenzy Sends Tech Stocks on a Rollercoaster",
    "url": "https://www.cryptopolitan.com/ai-frenzy-tech-stocks-on-a-rollercoaster/",
    "description": "In the fast-paced realm of technology, the dawn of 2024 is shrouded in uncertainty as the aftermath of the AI frenzy of the previous year unfolds. The selloff in technology stocks sends a clear signal that the speculative gains fueled by the allure of artificial intelligence might be facing a harsh reality check. The very [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T06:12:29.000Z",
    "title": "Exploit halts cross-chain lending on Radiant Capital’s Arbitrum platform",
    "url": "https://www.cryptopolitan.com/exploit-halts-lending-on-radiant-capitals/",
    "description": "Radiant Capital, a prominent cross-chain lending protocol, has temporarily suspended its lending and borrowing markets on the Arbitrum blockchain due to a substantial security breach.&#160; Reports indicate that a flash loan attack resulted in the unauthorized withdrawal of approximately $4.5 million in Ether from one of its newly established USDC Coin (USDC) markets. Radiant Capital [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-03T06:38:24.000Z",
    "title": "XRP Price Could Rally If It Clears This Hurdle – $0.75 Next?",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-could-rally-0-75-next/",
    "description": "XRP price is consolidating above the $0.600 support. The price could start a fresh rally if there is a daily close above the $0.650 resistance. XRP is attempting a fresh increase from the $0.600 support level. The price is now trading above $0.620 and the 100 simple moving average (4 hours). There is a key contracting triangle forming with resistance near $0.6380 on the 4-hour chart of the XRP/USD pair (data source from Kraken). The pair start a fresh rally if it clears the $0.638 and $0.650 resistance levels. XRP Price Aims Higher After a downside correction, XRP price found support near the $0.600 zone. The price formed a base and started a minor increase above the $0.612 level, but upsides were limited and less compared to Bitcoin and Ethereum. The price spiked a few times above the 50% Fib retracement level of the key decline from the $0.700 swing high to the $0.578 swing low. However, the bears protected a close above the $0.650 resistance. It is now consolidating below $0.640. XRP is stable above $0.620 and the 100 simple moving average (4 hours). On the upside, immediate resistance is near the $0.638 zone. There is also a key contracting triangle forming with resistance near $0.6380 on the 4-hour chart of the XRP/USD pair. The next major resistance is near the $0.650 zone or the 61.8% Fib retracement level of the key decline from the $0.700 swing high to the $0.578 swing low. A close above the $0.650 resistance zone could spark a strong increase. Source: XRPUSD on TradingView.com The next key resistance is near $0.672. If the bulls remain in action above the $0.672 resistance level, there could be a rally toward the $0.700 resistance. Any more gains might send the price toward the $0.720 resistance. Downside Break? If XRP fails to clear the $0.638 resistance zone, it could start a fresh decline. Initial support on the downside is near the $0.610 zone and the triangle trend line. The next major support is at $0.600. If there is a downside break and a close below the $0.600 level, XRP price might accelerate lower. In the stated case, the price could retest the $0.550 support zone. Technical Indicators 4-Hours MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $0.610, $0.600, and $0.550. Major Resistance Levels – $0.638, $0.650, and $0.700."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-03T06:21:54.000Z",
    "title": "Is Internet Computer (ICP) The Next Big Thing? 60% Jump Raises Eyebrows",
    "url": "https://www.newsbtc.com/news/is-internet-computer-icp-the-next-big-thing-60-jump-raises-eyebrows/",
    "description": "In the past day, the value of Internet Computer (ICP) has increased by 20% to $15.76. ICP has grown significantly over the last week, showing an astounding increase of more than 60% from its starting value of $8.98 to its current rate. According to data from Coingecko, its current price is a noteworthy increase, highlighting the coin&#8217;s dynamic performance in the context of recent market movements. It&#8217;s important to remember that although the price has increased significantly, the all-time high for Internet Computer is still $700.65. This indicates a significant room for expansion, but it also emphasizes how volatile the crypto industry is by nature. Anxiously observing these oscillations, investors and fans are speculating about Internet Computer&#8217;s future course as it negotiates the intricate terrain of digital asset appraisals. Related Reading: SEI Price Soars Over 80% – How High Will The Altcoin Climb In 2024? Growing Interest In Internet Computer ICP&#8217;s fundamentals indicate that it is not solely reliant on the volatility of Bitcoin. Rather, utilities are another factor influencing its worth. Several utilities impact its value, such as its ability to hold money and the ability to stake using its Network Nervous System. The DAO in charge of the Internet Computer blockchain is the NNS. By staking ICP utility tokens in so-called neurons, everyone can take part in this open, permissionless governance system. Voting on proposals, which are open to submission by anybody, determines decisions. It was therefore simple to draw the conclusion that growing interest in cryptocurrencies was the cause of the price increase. ICPUSD currently trading at $16.273 on the daily chart: TradingView.com ICP Price Analysis Price: Over the past 24 hours, the price of Internet Computer (ICP) has fluctuated between $13.50 and $14.50. It is currently trading at $14.00, which is down slightly from its price at the start of the day. Over the past week, ICP has been more volatile, trading between $12.50 and $15.00. Volatility: The Bollinger Bands on the chart show that volatility has been higher over the past week than it has been over the past 24 hours. This is likely due to the increase in trading volume that has been seen over the past week. Source: Benzinga Trading volume: Trading volume for ICP has increased by 135.0% over the past week. This is a significant increase, and it suggests that there is a lot of interest in ICP at the moment. Circulating supply: The circulating supply of ICP has also increased over the past week, by 1.08%. This means that there are more ICP tokens in circulation now than there were a week ago. This could put downward pressure on the price of ICP, as there are more tokens available to be sold. Market cap: ICP is currently ranked #18 in terms of market capitalization, with a market cap of $6.67 billion. This is down from its market cap of $7.77 billion at the start of the week. Overall, the chart shows that ICP has been a volatile crypto asset over the past week. The increase in trading volume and circulating supply suggests that there is a lot of interest in ICP, but it is also possible that this could put downward pressure on the price of ICP in the future. Related Reading: Bitcoin SV (BSV) Ushers In 2024 With A 110% Bang – Details Is ICP The Next &#8216;Big Thing?&#8217; While Internet Computer&#8217;s recent 60% surge has undoubtedly raised eyebrows, declaring it the &#8220;next big thing&#8221; remains a gamble. Its price, while impressive compared to its starting point, still sits far below its all-time high, showcasing the volatility inherent in the crypto market. Though potential for further growth undeniably exists, cautious optimism is key. ICP&#8217;s dynamic performance demands a close watch, but only time will tell if its current momentum translates into sustained success, solidifying its place among the cryptocurrency titans. Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-03T06:28:58.000Z",
    "title": "Bitcoin On-Chain Analysis: Price Targets Revealed, BTC Aims for $50,000",
    "url": "https://www.crypto-news-flash.com/bitcoin-on-chain-analysis-price-targets-revealed-btc-aims-for-50000/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-on-chain-analysis-price-targets-revealed-btc-aims-for-50000",
    "description": "<img width=\"1216\" height=\"763\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/btc.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />As the deadline for the U.S. SEC to approve a spot Bitcoin ETF approaches, Bitcoin bulls are setting their sights on $50,000. Despite earlier speculation about a potential Bitcoin Spot ETF approval this week, Fox Business analyst Eleanor Terrett expresses uncertainty, suggesting it would be surprising if approvals happen so soon. The world&#8217;s largest cryptocurrency [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-03T06:27:47.000Z",
    "title": "Beginner’s Goldmine: Discovering The Cryptos That Could Turn Small Investments into Fortunes",
    "url": "https://www.crypto-news-flash.com/beginners-goldmine-discovering-the-cryptos-that-could-turn-small-investments-into-fortunes/?utm_source=rss&utm_medium=rss&utm_campaign=beginners-goldmine-discovering-the-cryptos-that-could-turn-small-investments-into-fortunes",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-34.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />NuggetRush (NUGX) turns the meme coin sector around with its substantial real-world rewards. Optimism (OP) is in the red after significant price boosts last week.  Chainlink (LINK) focuses on real-world asset tokenization as whales buy up millions of LINK tokens. Prominent investors are recommending NuggetRush (NUGX) to anyone who wants to make incredible returns on [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-03T06:17:51.000Z",
    "title": "Polygon’s NFT Market Explodes: $47 Million Sales in December 2023",
    "url": "https://www.crypto-news-flash.com/polygon-nft-market-explodes-47-million-sales-in-december-2023/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-nft-market-explodes-47-million-sales-in-december-2023",
    "description": "<img width=\"947\" height=\"631\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/NFT.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />Polygon NFT market has printed impressive growth with a $47 million volume in December 2023. Despite obvious advances, Polygon still lags behind key rivals in NFT activities. Beyond the recent impressive surge in the price of MATIC, Polygon&#8217;s native token, December 2023 saw the Non-Fungible Token (NFT) ecosystem on the Polygon network explode, with sales [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-03T06:23:50.000Z",
    "title": "Bitcoin (BTC) Price Prediction 2024-2030: Will BTC Price Hit $75,000 Soon?",
    "url": "https://coinedition.com/bitcoin-btc-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Bitcoin-BTC-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin-BTC-Price-Prediction\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Bitcoin-BTC-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Bitcoin-BTC-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Bitcoin-BTC-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Bitcoin-BTC-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Bitcoin-BTC-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bitcoin (BTC) is the most prominent cryptocurrency with tremendous growth potential. Over the years, BTC has also gained significant recognition in the economy, being acknowledged by governments and used as a medium of payment among users. Bitcoin was first defined as a decentralized digital currency in an essay published in 2008 under the identity of [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bitcoin-btc-price-prediction/\">Bitcoin (BTC) Price Prediction 2024-2030: Will BTC Price Hit $75,000 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]