[
  {
    "source": "CoinDesk",
    "date": "2023-07-11T23:06:13.000Z",
    "title": "Tokenized U.S. Treasurys Surpass $600M as Crypto Investors Capture TradFi Yield",
    "url": "https://www.coindesk.com/markets/2023/07/11/tokenized-us-treasurys-surpass-600m-as-crypto-investors-capture-tradfi-yield/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto investors now effectively lend $614 million to the U.S. government via different tokenized Treasury products, according to real-world asset data firm RWA.xyz."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-11T22:58:31.000Z",
    "title": "Arkham CEO Defends ‘Dox-To-Earn’ Program, Says It Will Boost the Reputation of Crypto",
    "url": "https://decrypt.co/148208/arkham-ceo-miguel-morel-dox-to-earn-twitter-spaces",
    "description": "“Arkham focuses on strictly publicly available information to then draw connections about what entities own what wallets,” said Miguel Morel."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-11T22:49:01.000Z",
    "title": "'Gran Saga: Unlimited' Is a Promising MMORPG Launching on Aptos",
    "url": "https://decrypt.co/148189/gran-saga-unlimited-promising-mmorpg-launching-aptos",
    "description": "PREVIEW: Gran Saga: Unlimited is an open-world anime game that lets players fight creatures using guns, melee weapons, and magic."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-11T23:00:57.000Z",
    "title": "Bitcoin mining difficulty sees 7% uptick in 11th such rise this year",
    "url": "https://cryptoslate.com/insights/bitcoin-mining-difficulty-sees-7-uptick-in-11th-such-rise-this-year/",
    "description": "<p>Quick Take The difficulty level of Bitcoin mining has recently undergone an upward adjustment exceeding 7%. This noteworthy shift signifies the 11th such increase seen this year, clearly highlighting a pattern of escalating difficulty. Interestingly, the last adjustment trended in the contrary direction, making the present increase the second-largest adjustment observed this year. These fluctuations [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-mining-difficulty-sees-7-uptick-in-11th-such-rise-this-year/\">Bitcoin mining difficulty sees 7% uptick in 11th such rise this year</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-11T22:55:29.000Z",
    "title": "Cboe files amended spot Bitcoin ETF applications; finalizes surveillance agreement with Coinbase",
    "url": "https://cryptoslate.com/cboe-files-amended-spot-bitcoin-etf-applications-finalizes-surveillance-agreement-with-coinbase/",
    "description": "<p>Cboe filed several amendments for Bitcoin spot  ETFs on July 11, indicating that surveillance sharing agreements (SSAs) with Coinbase have been finalized. Beginning in late June, Cboe filed for spot Bitcoin ETFs on behalf of several asset managers. Later, on June 30, the Wall Street Journal reported that the U.S. Securities and Exchange Commission (SEC) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/cboe-files-amended-spot-bitcoin-etf-applications-finalizes-surveillance-agreement-with-coinbase/\">Cboe files amended spot Bitcoin ETF applications; finalizes surveillance agreement with Coinbase</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T23:04:25.000Z",
    "title": "Filecoin Price Prediction 2023-2032: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2023-2032 How much is Filecoin (FIL) worth? The live Filecoin price today is $4.25 USD with a 24-hour trading volume of $73,689,600 USD. Filecoin is down 2.50% in the last 24 hours. The current CoinMarketCap ranking is #30, with a live market cap of $1,849,057,507 USD. It has a circulating supply of ... <a title=\"Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/filecoin-price-prediction/\" aria-label=\"More on Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T22:47:38.000Z",
    "title": "BIS releases contrasting reports on CBDCs and crypto",
    "url": "https://www.cryptopolitan.com/bis-release-contrasting-reports-cbdcs-crypto/",
    "description": "In anticipation of the upcoming meeting of the G20 finance ministers and central bank governors, the Bank for International Settlements Innovation Hub (BISIH) released two significant reports on cryptocurrency and central bank digital currencies (CBDCs) on July 11. These reports present divergent perspectives on the technologies involved. BIS favors CBDCs ahead of crypto The shorter ... <a title=\"BIS releases contrasting reports on CBDCs and crypto\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bis-release-contrasting-reports-cbdcs-crypto/\" aria-label=\"More on BIS releases contrasting reports on CBDCs and crypto\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-11T23:07:47.000Z",
    "title": "LUNC token burn nears historical high of 70 billion",
    "url": "https://crypto.news/lunc-token-burn-nears-historical-high-of-70-billion/",
    "description": "Approximately 68.3 billion LUNC tokens have been burned so far, accounting for approximately 0.99% of the total token supply. Of this burned amount, 44.8 billion LUNC tokens have recently been sent to the burning address. Restore the digital currency&#8217;s reputation&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-11T22:51:45.000Z",
    "title": "Global metaverse market could reach $322 billion by 2030, research shows",
    "url": "https://crypto.news/global-metaverse-market-could-reach-322-billion-by-2030-research-shows/",
    "description": "The global metaverse market is projected to grow massively, reaching $322 billion by 2030, according to a report by ResearchAndMarkets. Massive growth potential  According to ResearchAndMarkets&#8217; latest report, the metaverse market was valued at around $42.05 billion during the 2021&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-11T23:00:57.000Z",
    "title": "Bitcoin And NASDAQ Composite Index Correlation Drops To A 2-Year Low",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-nasdaq-correlation-2-year-low/",
    "description": "New data from Kaiko on July 11 indicates that the correlation between Bitcoin and the Nasdaq Composite Index is at a two-year low. The correlation coefficient between these two assets dropped to less than 1% in early July. At this level, it is at July 2021 lows. The NASDAQ Composite Index tracks the performance of all stocks listed on the NASDAQ stock exchange. Among stocks listed on this bourse include Coinbase’s COIN. Dropping Correlation Between Bitcoin And NASDAQ A correlation coefficient of around 0% signifies a weak negative relationship between Bitcoin and the NASDAQ. This implies that Bitcoin prices moved in the opposite direction or are unrelated to the NASDAQ Composite Index action.  Related Reading: Bitcoin Google Search Interest Stands At Critical Level, What This Forecast For BTC As of July 10, Bitcoin prices were relatively firm, oscillating around the $30,000 level and generally in an uptrend looking at price performance in Q2 2023. For context, Bitcoin is less than $2,000 away from 2023 highs of $31,400 registered in June 2023. Meanwhile, market data shows that the NASDAQ Composite Index is also at multi-month highs and firm, reflecting the broader market recovery in the United States. The dwindling correlation between Bitcoin and the NASDAQ may be attributed to several factors. One potential explanation is that investors are becoming more discerning in their investment choices. As the cryptocurrency market matures and regulations are drafted, investors might seek assets with low correlation with traditional finance instruments like stocks and indices. The other reason could stem from the recent action of the cryptocurrency market. In 2022, cryptocurrencies, including Bitcoin, fell from highs registered in 2021. After peaking at over $69,000, Bitcoin prices crashed in 2022. This was fast-tracked by the solvency of several centralized finance platforms offering crypto services, including Celsius. The collapse of FTX, a popular cryptocurrency exchange, forced prices even low. In November 2022, BTC prices crashed below $16,000.  Like crypto assets, technology stocks like COIN listed on NASDAQ are relatively volatile and were also impacted by rising interest rates in 2021. Subsequently, the dump in asset prices might have forced investors to be more risk-averse and diversify their holdings, forcing the correlation between NASDAQ and Bitcoin even lower.  Watching The US Federal Reserve Whether this correlation will fall in the months ahead remains to be seen. However, at the moment, the cryptocurrency market seems fragile. Bitcoin bulls have failed to break above June 2023 highs in continuation of bullish pressure in the past few weeks.  Related Reading: Bulls Remain Resilient Despite Litecoin’s Fall Below $100, Key Levels To Watch At the same time, market participants closely track how the United States Federal Reserve will proceed with its monetary policy.  After steadily increasing interest rates to tame rising inflation, the central bank paused rate hikes in Q2 2023. Whether they will slash rates in the coming months remains to be seen. Feature image from Canva, chart from TradingView"
  }
]