[
  {
    "source": "Decrypt",
    "date": "2023-07-27T01:19:34.000Z",
    "title": "Robert F. Kennedy Jr. Says He Bought 14 Bitcoin for His Kids",
    "url": "https://decrypt.co/150273/robert-kennedy-jr-bought-14-bitcoin-in-may",
    "description": "The Democratic candidate for U.S. President also blasted banks for succumbing to political pressure."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-27T01:26:22.000Z",
    "title": "Crypto bills pass congressional committee in 'huge win' for US crypto",
    "url": "https://cointelegraph.com/news/crypto-regulatory-framework-bill-pass-house-congressional-committee",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/b7ef6e8f-e643-40f4-af98-36eb82b1ae40.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Two crypto regulatory bills have been passed by the United States House Financial Services Committee United States in one day.</p>\n                    <p><p>A key United States House panel has approved a pair of bills that will be key to developing a regulatory framework for cryptocurrencies, that will reduce regulatory red tape for crypto and set clearer rules for the industry.</p><p>On July 26, the majority of U.S. lawmakers voted in favor of the Financial Innovation and Technology for the 21st Century Act as well as the Blockchain Regulatory Certainty Act.</p><p>The House Financial Services Committee approved the Financial Innovation and Technology for the 21st Century Act in a 35-15 vote which <a href=\"https://cointelegraph.com/news/crypto-bills-could-change-us-landscape-explained\">would establish rules</a> for crypto firms on when to register with either the Commodity Futures Trading Commission (CFTC) or the Securities and Exchange Commission (SEC).</p><p>The Republican bill also outlines a process for firms to certify with the SEC that their projects are adequately decentralized which would allow them to register digital assets as a digital commodity with the CFTC. </p><p>Meanwhile, the bipartisan “Blockchain Regulatory Certainty Act” led by Republican Congressman Tom Emmer and Democratic Congressman Darren Soto, <a href=\"https://emmer.house.gov/2021/8/emmer-introduces-legislation-to-provide-clarity-for-blockchain-innovators\" target=\"_blank\" rel=\"noopener nofollow\">aims</a> to set out guidelines that remove hurdles and requirements for “blockchain developers and service providers” such as miners, multi-signature service providers and decentralized finance (DeFi) platforms.</p><p>Republican Representative Tom Emmer praised the passing of the Blockchain Regulatory Certainty Act as a \"huge win\" for the United States.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BREAKING: My nonpartisan bill – the Blockchain Regulatory Certainty Act – just passed out of the <a href=\"https://twitter.com/FinancialCmte?ref_src=twsrc%5Etfw\">@FinancialCmte</a>.<br><br>This is a huge win for the United States as we are one step closer to putting Americans in the driver’s seat in crafting the future peer-to-peer digital economy. <a href=\"https://t.co/JEOuflDMax\">pic.twitter.com/JEOuflDMax</a></p>&mdash; Tom Emmer (@GOPMajorityWhip) <a href=\"https://twitter.com/GOPMajorityWhip/status/1684352218688892928?ref_src=twsrc%5Etfw\">July 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Others, including Democratic Representative Maxine Waters have <a href=\"https://cointelegraph.com/news/us-lawmaker-calls-for-info-from-treasury-and-sec-on-crypto-market-structure-bill\">opposed the market structure bill</a> saying it could mean fewer protections for crypto investors.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  }
]