[
  {
    "source": "Cointelegraph",
    "date": "2024-01-23T04:00:40.000Z",
    "title": " Coinbase, Paradigm, others argue crypto mixer rules are a ‘waste of time’ ",
    "url": "https://cointelegraph.com/news/coinbase-paradigm-firms-argue-fincen-crypto-mixer-rules-too-broad",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZDdlYTRlZDYtNmMzNi00MmIwLWFhY2ItMGRhNTY0ZjBmY2E0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Crypto firms including Coinbase, Consensys, the Blockchain Association and others have filed comments on FinCEN’s proposed reporting requirements for crypto mixing activities.</p>\n                    <p><p>Crypto firms Coinbase, Paradigm, and Consensys are urging the United States Treasury to revisit its proposed reporting requirements for transactions involving crypto mixers, arguing they lack specificity and would be a drain on resources. </p><p>On Jan. 22, Coinbase sent a letter in <a href=\"https://assets.ctfassets.net/c5bd0wqjc7v0/68ReA5Fygo9vUHcc1JzM0F/1ac7e172b64b881f6713ee94bf2f078e/Coinbase_Response_to_NPRM_re._Mixing.pdf\" target=\"_blank\" rel=\"noopener nofollow\">response</a> to the U.S. Treasury Department’s Financial Crimes Enforcement Network’s (FinCEN) notice of proposed rulemaking that proposes “requiring domestic financial institutions to implement recordkeeping and reporting requirements on transactions involving convertible virtual currency mixing.”</p><p>The firm argued that the proposed requirements were overly broad, burdensome, and ineffective and gave two main reasons backing their argument. </p><p><a href=\"https://cointelegraph.com/news/coinbase-paradigm-firms-argue-fincen-crypto-mixer-rules-too-broad\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-23T04:00:47.000Z",
    "title": "Why is so much old and hodled Bitcoin on the move but UTXOs and exchanges remain unaffected?",
    "url": "https://cryptoslate.com/why-is-so-much-old-and-hodled-bitcoin-on-the-move-but-utxos-and-exchanges-remain-unaffected/",
    "description": "<p>On-chain data lets us see the extent and scope of the activity surrounding spot Bitcoin ETFs beyond its impact on BTC price. CryptoSlate&#8217;s analysis of on-chain metrics first brought on in Glassnode&#8217;s Cointime Economics research paper shows how this affected the activity-to-vaulting ratio (A2VR). The A2VR metric assesses the balance between Bitcoin&#8217;s active and inactive [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/why-is-so-much-old-and-hodled-bitcoin-on-the-move-but-utxos-and-exchanges-remain-unaffected/\">Why is so much old and hodled Bitcoin on the move but UTXOs and exchanges remain unaffected?</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T04:07:28.000Z",
    "title": "Eco-friendly Bitcoin mining gains traction in the top 10 countries",
    "url": "https://www.cryptopolitan.com/eco-friendly-bitcoin-mining-gains-traction/",
    "description": "Bitcoin mining has been under the spotlight recently, with a growing emphasis on environmentally sustainable practices. Proponents of the cryptocurrency have pointed to a shift in the industry towards renewable energy sources.&#160; Seth, a prominent pro-Bitcoin portfolio manager, has drawn attention to this trend, citing a report by Visual Capitalist that analyzes the countries leading [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T03:56:16.000Z",
    "title": "Blockchain Protocol Empowers Media Outlets in Their Dealings with AI Developers",
    "url": "https://www.cryptopolitan.com/blockchain-protoco-media-ai-developers/",
    "description": "In a groundbreaking move, Fox Corp. has unveiled Verify, a blockchain-based platform developed by its in-house technology team. This innovative protocol aims to revolutionize how media outlets track and manage their content online, with a particular focus on addressing the concerns of large artificial intelligence (AI) developers. Verify, powered by Polygon, utilizes cryptographic signatures to [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-23T04:00:40.000Z",
    "title": "Pastor Accused Of Defrauding Congregation With $3 Million Crypto Ponzi Scheme",
    "url": "https://www.newsbtc.com/news/pastor-accused-of-defrauding-congregation-with-3-million-crypto-ponzi-scheme/",
    "description": "Denver-based internet pastor, Eli Regalado, is at the center of a controversy surrounding an alleged crypto Ponzi scheme involving INDX coin.  The self-proclaimed spiritual leader has come under scrutiny as Colorado&#8217;s securities regulator investigates his deceptive practices, which reportedly resulted in over $3 million in ill-gotten gains. Fortune magazine report shed light on the matter, exposing Regalado&#8217;s questionable actions and shedding light on the plight of the victims involved. Pastor Regalado&#8217;s Deceptive Crypto Venture According to Colorado&#8217;s securities regulator, Regalado, and his wife orchestrated a “small-scale swindle”, targeting hundreds of individuals with promises of extraordinary returns on their investments in INDX coin.  Presenting his appeals with biblical undertones, using terms like &#8220;sowing&#8221; and &#8220;tithing,&#8221; Regalado convinced his online church followers that purchasing the cryptocurrency would yield a tenfold increase in their investments.  However, the promised returns never materialized, and investors lost their “hard-earned” money. To compound matters, it is alleged that the Regalados diverted a significant portion of the funds to finance personal expenses, including home renovations and luxury purchases, further exacerbating the victims&#8217; financial losses. Related Reading: Crypto Analyst Predicts Cardano Price Will Climb 2,000% To Reach $11 Despite the allegations and mounting legal troubles, Regalado chose to address the accusations head-on by posting a 10-minute video on the crypto project&#8217;s website. In the video, he attempts to deflect responsibility, claiming that misappropriating funds was not solely his decision, but rather a result of divine guidance for a home remodeling project.  Displaying a lack of understanding of financial concepts, Regalado haphazardly employs buzzwords like &#8220;leverage&#8221; and &#8220;liquidity&#8221; without demonstrating a clear comprehension of their meaning.  Furthermore, Regalado boasts about the supposed success of the project, mentioning &#8220;$300 million of coins sown before the exchange went live.&#8221; However, the Colorado regulator clarifies that these coins have no value, primarily because they could only be traded on the Kingdom Wealth Exchange, an ill-functioning service operated by the Regalados themselves. Colorado Authorities Take Action To Recover Funds According to Fortune, the next steps in this ongoing investigation are expected to involve the state of Colorado seizing any remaining funds and returning them to the defrauded investors.  Meanwhile, Regalado&#8217;s video attempts to invoke divine intervention, predicting that the INDX coin debacle will resolve itself miraculously through divine intervention in the financial sector. Related Reading: Hold On For Four Months: Analyst Predicts When Bitcoin Price Will Reach New ATH According to CoinGecko data, the total crypto market cap has declined over 4.6%, reaching as low as $1.51 trillion on Monday.  However, when compared to one year ago, the cryptocurrency market has witnessed an impressive surge of 55.27%.  At the forefront of the cryptocurrency market stands Bitcoin (BTC), the pioneering digital currency that continues to dominate the landscape. As of today, Bitcoin&#8217;s market cap stands at an impressive $795 billion, accounting for a substantial 47.66% of the total cryptocurrency market.  Featured image from Shutterstock, chart from TradingView.com"
  }
]