[
  {
    "source": "Decrypt",
    "date": "2023-07-06T02:47:29.000Z",
    "title": "AI is Okay, But Artists Still Need to Get Paid: Musician Emily Lazar",
    "url": "https://decrypt.co/147474/ai-is-okay-artists-still-need-to-get-paid-musician-emily-lazar",
    "description": "\"This is evolution,\" she says. \"This is going to happen, whether we like it or not.\""
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-06T03:00:36.000Z",
    "title": "Blame The “Supermoon” If Bitcoin Crashes Or Rallies Towards $35,000 In July",
    "url": "https://www.newsbtc.com/bitcoin-news/blame-the-supermoon-if-bitcoin-crashes-or-rallies-towards-35000-in-july/",
    "description": "If historical Bitcoin price performance leads, one trader is adamant that the coin is at a critical inflection point at spot rates. Based on astronomical patterns and moon arrangement, trading desk QCP Capital believes Bitcoin prices can swing higher in a bull run towards the $33,000 to $35,000 level, reversing following sharp losses in 2022. Conversely, after a recovery that has seen Bitcoin price rally 20% from mid-June 2023, there can be a contraction that may see the coin dip after an impressive performance in the past few trading weeks. Supermoons Coincide With Key Bitcoin Price Reversals Based on technical and fundamental actions, the trading desk cited the past performance of Bitcoin at different cyclical stages. For instance, when Bitcoin fell in the early days of 2020, primarily due to fears of the far-reaching consequences of lockdowns brought by the COVID-19 pandemic, it posted a 161% rally from early March to May 2020. The same was observed from mid-June to August 2022 when Bitcoin, at the depth of the last cyclical bear market, prices soared 43%. Marking peaks, Bitcoin corrected from the end of April to June 2021, falling 51% in a predominantly bullish market. According to the trading desk, major reversals in bearish and bullish runs occurred during a &#8220;supermoon.&#8221; In astrology, a supermoon is a full moon that forms when the moon is at its closest point to the Earth in its elliptical orbit. The moon appears brighter than usual during this time and happens only once or twice a year. A supermoon formed on July 4, and the trader believes Bitcoin is at a critical reaction point. Related Reading: AAVE Records 26% Weekly Gain, Looks To Break Key Resistance For years, there has been a belief that supermoons correlate with bullish markets. However, no scientific findings support this, and neither have statistical correlations. Still, based on the trader&#8217;s analysis, the multiple correlations and timing of peaks and bottoms of Bitcoin prices during supermoons can be used to predict BTC markets. Will Prices Rally Or Dump? While it is yet to be seen whether BTC will edge higher, breaking above $31,300 and rally towards the $35,000 zone, the trading desk says fundamental factors will play a critical role and remains bullish that BTC may rally to within the $33,000 to $35,000 liquidation zone. Overall, monitoring how the Federal Reserve of the United States will implement its monetary policies will be necessary in the future. Although inflation has been dropping, the trader observes that it has not fallen low enough to warrant a rate cut. Rate cuts tend to move the capital to store-of-value assets from which Bitcoin will likely benefit.  Related Reading: Analyst Says XRP Will Reach $100, Here’s Why On a more pessimistic side, the trading desk expresses caution saying BTC has strong resistance at spot levels since the recent leg up was most likely the fifth and the last wave from November 2022 lows. At the same time, the $33,000 to $35,000 resistance zone is a critical resistance trend line. For this reason, any dump may see BTC retest the $24,000 and $26,000 support zone. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-06T03:08:17.000Z",
    "title": "BRICS Has ‘Ambition’ To Create New Global Currency and Challenge US Dollar in Medium to Long-Term, Says Official",
    "url": "https://dailyhodl.com/2023/07/05/brics-has-ambition-to-create-new-global-currency-and-challenge-us-dollar-in-medium-to-long-term-says-official/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/ambition-brics-US-Dollar.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/ambition-brics-US-Dollar.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/ambition-brics-US-Dollar.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/ambition-brics-US-Dollar.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/ambition-brics-US-Dollar.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/ambition-brics-US-Dollar.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/ambition-brics-US-Dollar.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The economic coalition of nations known as BRICS has &#8220;medium to long-term&#8221; ambitions to create a new global currency and challenge the US dollar, according to the chief financial officer of the BRICS New Development Bank. BRICS nations, which consists of Brazil, Russia, India, China and South Africa, are currently pushing to boost direct trade [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/05/brics-has-ambition-to-create-new-global-currency-and-challenge-us-dollar-in-medium-to-long-term-says-official/\">BRICS Has &#8216;Ambition&#8217; To Create New Global Currency and Challenge US Dollar in Medium to Long-Term, Says Official</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]