[
  {
    "source": "Decrypt",
    "date": "2023-06-09T14:24:27.000Z",
    "title": "Robinhood Moves to Cut Support for Cardano, Polygon and Solana",
    "url": "https://decrypt.co/143946/robinhood-moves-cut-support-cardano-polygon-solana",
    "description": "Robinhood opted to axe three tokens after the SEC listed them as unregistered securities in their lawsuits against Coinbase and Binance."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-09T14:34:53.000Z",
    "title": "Bitcoin trades at slight discount on Binance.US as banking partners cut ties",
    "url": "https://cryptoslate.com/bitcoin-trades-at-slight-discount-on-binance-us-as-banking-partners-cut-ties/",
    "description": "<p>Bitcoin (BTC) is trading at a slight discount on Binance.US following the exchange&#8217;s announcement of its banking partners&#8217; decision to halt USD payment channels on June 13, amidst ongoing regulatory troubles, according to Kaiko data. Kaiko stated that BTC traded at a premium on Binance.US  between June 6 and June 8 when rumors surfaced that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-trades-at-slight-discount-on-binance-us-as-banking-partners-cut-ties/\">Bitcoin trades at slight discount on Binance.US as banking partners cut ties</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T14:27:18.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years, and there is no stopping it anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. Various APE price highlights unfold in this ApeCoin Price Prediction. How much is ApeCoin ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-09T14:26:58.000Z",
    "title": "How SEC chair Gary Gensler moved from crypto advisor to antagonist",
    "url": "https://crypto.news/how-sec-chair-gary-gensler-moved-from-crypto-advisor-to-antagonist/",
    "description": "From earlier, seemingly crypto-supportive stances to his current hardline approach, Gary Gensler&#8217;s journey traverses his dynamic narratives, confrontations with crypto giants, and the rumors that abound, offering a unique perspective. It&#8217;s almost reminiscent of a summer blockbuster &#8211; the good&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-09T14:30:11.000Z",
    "title": "Crypto Market Tension: ADA, BNB, MATIC, SOL Crash Over 10% In Past Week",
    "url": "https://www.newsbtc.com/altcoin/crypto-market-tension-ada-bnb-matic-sol-crashes/",
    "description": "In a market heavily influenced by Bitcoin (BTC) and Ethereum (ETH), their slight price decline recently has been overshadowed by a more substantial fall in larger altcoins. Notably, Cardano (ADA), BNB (BNB), Polygon (MATIC), and Solana (SOL) have seen a more than 10% drop over the past week. This downturn traces back to regulatory actions taken by the US Securities and Exchange Commission (SEC) against industry titans Binance and Coinbase. Regulatory Pressure And The Crypto Market This heightened market volatility follows charges laid by the SEC on Tuesday against Coinbase for facilitating the trading of crypto assets they labeled as unregistered securities. The list of implicated assets includes FLOW, VGX, MATIC, and ADA. A similar charge was filed against Binance, where these assets, among others like BNB, BUSD, SOL, FIL, ATOM, SAND, MANA, ALGO, AXS, and COTI, were categorized as securities. It&#8217;s interesting to note that the SEC did not include tokens with substantial trading volumes such as ETH, USDC, USDT, LTC, and BTC. Charles Hoskinson, the founder of Cardano, responded to these charges by suggesting that the regulatory crackdown was a move to pave the way for a Central Bank Digital Currency (CBDC). In his view, the government aims to leverage the CBDC as a tool to assert control over people&#8217;s finances, facilitated by a selection of influential banks. Hoskinson noted: With respect to Binance, I&#8217;m reading through the SEC complaint. It&#8217;s over 130 pages, but seems like the next in a series of steps to implement chokepoint 2.0 in the United States. The end goal is a agenda based CBDC partnered with a handful of massive banks and end-to-end control over every aspect of your financial life. The Market Impact On ADA, BNB, MATIC, And SOL In the wake of this regulatory scrutiny, ADA&#8217;s price has seen a market downtrend, falling by 15% over the past 7 days, with a further 2.8% loss in the past 24 hours alone. At the time of writing, ADA is trading at $0.31, a significant drop from its pre-regulation price. In spite of the price drop, ADA&#8217;s trading volume surged from $228 million to over $400 million between last Friday and yesterday, indicating a high sell pressure. It is worth noting that over the past week, more than $2 billion have been subtracted from the asset&#8217;s market capitalization.  Related Reading: Cardano (ADA) Declines As Market Recovers Amid Security Charges Similarly, other altcoins such as Polygon (MATIC), Binance Coin (BNB), and Solana (SOL) have mirrored ADA&#8217;s price action. In the past week, MATIC, BNB, and SOL have recorded downward turns of 13.6%, 15.7%, and 11.4% respectively. Notably, among the global crypto market capitalization, ADA currently ranks 8th with SOL and MATIC ranking below Dogecoin (DOGE). Meanwhile, despite the large impact on BNB, the asset still ranks 3rd in the global crypto market. This turbulent market activity, however, underscores the substantial influence of regulatory entities on the cryptocurrency market.  Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T14:30:34.000Z",
    "title": "Crypto Regulation On The Horizon: UK Legislators Urge Its Necessity",
    "url": "https://www.crypto-news-flash.com/crypto-regulation-on-the-horizon-uk-legislators-urge-its-necessity/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-regulation-on-the-horizon-uk-legislators-urge-its-necessity",
    "description": "<p>Is trading crypto the same as gambling? If you are to believe the UK’s House of Commons Treasury Committee, then the answer is yes. In a new publication, titled Regulating Crypto, the Committee outlines their very negative view of the current crypto trade and its real-world applications and use cases. The time for regulation to [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/crypto-regulation-on-the-horizon-uk-legislators-urge-its-necessity/\">Crypto Regulation On The Horizon: UK Legislators Urge Its Necessity</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T14:30:15.000Z",
    "title": "Terra Projects Shine Bright: Cosmos DeFi Thrive, Carbon lists first Alliance Assets and Warp Protocol Launches on Testnet",
    "url": "https://www.crypto-news-flash.com/terra-projects-shine-bright-cosmos-defi-thrive-carbon-lists-first-alliance-assets-and-warp-protocol-launches-on-testnet/?utm_source=rss&utm_medium=rss&utm_campaign=terra-projects-shine-bright-cosmos-defi-thrive-carbon-lists-first-alliance-assets-and-warp-protocol-launches-on-testnet",
    "description": "<p>According to a recent tweet from the Terra community, a handful of projects have hit new milestones despite ongoing market chaos.  Carbon aligns with the Terra money community, revealing the long term benefits that the move will have on the Carbon network.  In a recent tweet, Orbit Command, a community validator dedicated to educating and [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/terra-projects-shine-bright-cosmos-defi-thrive-carbon-lists-first-alliance-assets-and-warp-protocol-launches-on-testnet/\">Terra Projects Shine Bright: Cosmos DeFi Thrive, Carbon lists first Alliance Assets and Warp Protocol Launches on Testnet</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-09T14:30:30.000Z",
    "title": "Two Major Catalysts Are a Boon for Ethereum Price, Says Bloomberg Analyst Mike McGlone – But There’s a Catch",
    "url": "https://dailyhodl.com/2023/06/09/two-major-catalysts-are-a-boon-for-ethereum-price-says-bloomberg-analyst-mike-mcglone-but-theres-a-catch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/money-flow-eth-merge.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/money-flow-eth-merge.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/money-flow-eth-merge.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/money-flow-eth-merge.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/money-flow-eth-merge.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/money-flow-eth-merge.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/money-flow-eth-merge.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bloomberg Intelligence’s senior macro strategist Mike McGlone says that two major catalysts could send Ethereum (ETH) much higher. In a tweet to his 58,000 followers, McGlone says that rising demand for ETH and a declining supply are bullish signs for the smart contract platform. However, the macro strategist says headwinds from continued Federal Reserve rate [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/09/two-major-catalysts-are-a-boon-for-ethereum-price-says-bloomberg-analyst-mike-mcglone-but-theres-a-catch/\">Two Major Catalysts Are a Boon for Ethereum Price, Says Bloomberg Analyst Mike McGlone – But There’s a Catch</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]