[
  {
    "source": "Cointelegraph",
    "date": "2023-06-09T14:56:54.000Z",
    "title": "Binance VP of Marketing: crypto needs to 'double down' on community support",
    "url": "https://cointelegraph.com/news/crypto-needs-to-double-down-on-community-binance-vp-of-marketing-interview",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/cf1bf208-3efe-4e19-9ace-b8a70abce6b3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> Rachel Conlan, the new VP of Marketing at Binance, says that “critical” times in the industry call for major companies to emphasize community, clarity and simplicity.</p>\n                    <p><p>The crypto industry faced more scrutiny from regulators in the United States this past week, as the U.S. Securities and Exchange Commission (SEC) served <a href=\"https://cointelegraph.com/news/sec-lawsuits-coinbase-binance-ceos-net-worths\">both Coinbase and Binance.US</a> with lawsuits regarding their operations. </p><p>Amid the accusations from regulatory officials, the members of the crypto community have <a href=\"https://cointelegraph.com/news/sec-lawsuit-binance-coinbase-crypto-industry-comments\">spoken out against</a> the behavior of the SEC while still agreeing certain regulations are necessary. </p><p>Rachel Conlan, joined Binance as the new VP of Marketing this week and spoke with Cointelegraph about the importance of fostering community in what she calls a “critical juncture for crypto.”</p><p>“Let’s be clear, regulation is needed,” she said. “But as any industry that has tried to be disruptive and has challenged the status quo we are facing some headwinds. ”</p><p>She continued to stress that while “simplicity and clarity” of the message is important when regulators have a tight grip on the industry, so is an emphasis on community. </p><blockquote>“My strategy really is how we double down and support our existing community and really celebrate them.”</blockquote><p>According to the exchange’s official website, Binance currently has 120 million registered users which is over 25% of the <a href=\"https://www.zippia.com/advice/cryptocurrency-statistics/#:~:text=There%20are%20approximately%20200%2C000%20Bitcoin,in%2C%20or%20traded%20a%20cryptocurrency\" target=\"_blank\" rel=\"noopener nofollow\">estimated</a> 420 million global crypto users as of 2023. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/evidence-in-sec-suit-includes-2022-testimony-of-binance-us-long-silent-ex-ceo\"><strong><em>Evidence in SEC suit includes 2022 testimony of Binance.US’ long silent ex-CEO</em></strong></a></p><p>Conlan believes her role is to showcase and educate that audience going forward through times of industry uncertainty. She said she especially wants to \"lean in\" to showcase how the community interacts with the product. </p><blockquote>“We need to be able to use them to tell stories and show integrations that really open up this world to people so that maybe they can have a different perspective of crypto.”</blockquote><p>Additionally, she pointed out that for platforms in the Web3 space like Binance that offer more services than just trading, balance is key. </p><blockquote>“It's about balance - showing the broad spectrum of utility and making sure that you are identifying the right moments for that.”</blockquote><p>Conlan said that not everyone in the crypto ecosystem wants to trade, and new users are entering the space for new reasons, be it remittance payments or following a favorite artist or sports star. </p><p>“ We are a financial business, but it's also about entertainment,” she said. “While at the same time educating people. What better way to do that than in moments where they're open to hearing.”</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-09T14:52:36.000Z",
    "title": "Do Kwon saga erupts into Montenegrin political scandal",
    "url": "https://cryptoslate.com/do-kwon-saga-erupts-into-montenegrin-political-scandal/",
    "description": "<p>Disgraced Terraform Labs Co-founder Do Kwon has an established relationship with an influential Montenegrin politician, according to the Korean news agency Yonhap. Montenegro&#8217;s Prime Minister revealed this information days before the country&#8217;s parliamentary elections &#8211; scheduled for June 11. During a June 8 press conference, Prime Minister Abazović told reporters he had received a handwritten [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/do-kwon-saga-erupts-into-montenegrin-political-scandal/\">Do Kwon saga erupts into Montenegrin political scandal</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T15:03:08.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T14:59:07.000Z",
    "title": "Brian Armstrong sold $1.8M Coinbase shares ahead of SEC lawsuit",
    "url": "https://www.cryptopolitan.com/brian-armstrong-sold-1-8m-coin-sec-lawsuit/",
    "description": "Reports around the crypto community have it on good report that the CEO of Coinbase made heavy sales ahead of the SEC crypto dilemma. According to Dataroma, Brian Armstrong sold his shares for $1.8 million just before the SEC filed a lawsuit against the company. On-chain data shows that on June 6, news of the ... <a title=\"Brian Armstrong sold $1.8M Coinbase shares ahead of SEC lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/brian-armstrong-sold-1-8m-coin-sec-lawsuit/\" aria-label=\"More on Brian Armstrong sold $1.8M Coinbase shares ahead of SEC lawsuit\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-09T15:00:01.000Z",
    "title": "Circle dumps U.S. Treasury bonds to protect USDC, Avorak Unaffected",
    "url": "https://nulltx.com/circle-dumps-u-s-treasury-bonds-to-protect-usdc-avorak-unaffected/",
    "description": "The stablecoin issuer Circle has made a drastic decision by ditching U.S. treasury bonds to protect its stablecoin USDC. Circle believes that the inflation rate embedded within the fiat ecosystem might become a barrier causing the firm to fall apart. This indicates that there needs to be a transformation from the traditional monetary system toward [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-09T14:39:57.000Z",
    "title": "Moody’s downgrades Coinbase amid SEC lawsuit",
    "url": "https://crypto.news/moodys-downgrades-coinbase-amid-sec-lawsuit/",
    "description": "Moody's, the international credit ratings agency, has revised its outlook on Coinbase, the cryptocurrency exchange, from \"stable\" to \"negative.\""
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T15:01:09.000Z",
    "title": "Vechain Revolutionizes the Coffee Industry with Blockchain: Traceability, Supply Chain Security, Sustainability, and Marketing Innovations",
    "url": "https://www.crypto-news-flash.com/vechain-revolutionizes-the-coffee-industry-with-blockchain-traceability-supply-chain-security-sustainability-and-marketing-innovations/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-revolutionizes-the-coffee-industry-with-blockchain-traceability-supply-chain-security-sustainability-and-marketing-innovations",
    "description": "<p>VeChain&#8217;s problem-solving role in the coffee industry could make the ecosystem even bigger. VeChain is said to have a solution to the adverse effects of coffee on the environment. VeChain (VET) is one of the few blockchains in the crypto industry with several real-world use cases across different fields. In a latest article, the use [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/vechain-revolutionizes-the-coffee-industry-with-blockchain-traceability-supply-chain-security-sustainability-and-marketing-innovations/\">Vechain Revolutionizes the Coffee Industry with Blockchain: Traceability, Supply Chain Security, Sustainability, and Marketing Innovations</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T15:00:19.000Z",
    "title": "Hollywood X PEPE ($HXPE) Vs Wall Street Memes Presale: Unleashing the Power of Next-Gen Investment Potential",
    "url": "https://www.crypto-news-flash.com/hollywood-x-pepe-hxpe-vs-wall-street-memes-presale-unleashing-the-power-of-next-gen-investment-potential/?utm_source=rss&utm_medium=rss&utm_campaign=hollywood-x-pepe-hxpe-vs-wall-street-memes-presale-unleashing-the-power-of-next-gen-investment-potential",
    "description": "<p>Greetings, investors, crypto enthusiasts, and readers. In the ever-evolving world of cryptocurrency, today we&#8217;re going to tackle two trending topics &#8211; Hollywood X PEPE ($HXPE) and Wall Street Memes Presale. While both offer fascinating perspectives in the crypto sphere, the focus of this article is to provide you with an insight into why $HXPE stands [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/hollywood-x-pepe-hxpe-vs-wall-street-memes-presale-unleashing-the-power-of-next-gen-investment-potential/\">Hollywood X PEPE ($HXPE) Vs Wall Street Memes Presale: Unleashing the Power of Next-Gen Investment Potential</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T14:41:29.000Z",
    "title": "Polygon Takes the Stand: Testifying at U.S. House Committee Hearing to Democratize the Internet with Web3 and Blockchain, Advocating for the Crypto Industry as a Whole",
    "url": "https://www.crypto-news-flash.com/polygon-takes-the-stand-testifying-at-u-s-house-committee-hearing-to-democratize-the-internet-with-web3-and-blockchain-advocating-for-the-crypto-industry-as-a-whole/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-takes-the-stand-testifying-at-u-s-house-committee-hearing-to-democratize-the-internet-with-web3-and-blockchain-advocating-for-the-crypto-industry-as-a-whole",
    "description": "<p>Polygon Labs veterans were part of a hearing with the US Congress&#8217;s Committee. The importance of blockchain and the role of Polygon in the industry was highlighted. Polygon Labs president Ryan Wyatt together with many legal practitioners has appeared before the United States House of Representatives Energy and Commerce Committee’s Subcommittee on Innovation, Data and [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/polygon-takes-the-stand-testifying-at-u-s-house-committee-hearing-to-democratize-the-internet-with-web3-and-blockchain-advocating-for-the-crypto-industry-as-a-whole/\">Polygon Takes the Stand: Testifying at U.S. House Committee Hearing to Democratize the Internet with Web3 and Blockchain, Advocating for the Crypto Industry as a Whole</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]