[
  {
    "source": "CryptoSlate",
    "date": "2023-08-04T23:00:28.000Z",
    "title": "Curve attacker begins to return stolen funds after bounty issued",
    "url": "https://cryptoslate.com/curve-crv-token-jumps-6-after-exploiter-begins-to-return-part-of-stolen-funds/",
    "description": "<p>The attacker who targeted Curve Finance, a decentralized finance (DeFi) protocol, has begun returning some of the stolen funds. The attacker sent 4,821 Ethereum (ETH), worth approximately $9 million, in a series of transactions to Alchemix Finance, one of the victims. Earlier today, the attacker had sent an on-chain message to Alchemix, asking the protocol [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/curve-crv-token-jumps-6-after-exploiter-begins-to-return-part-of-stolen-funds/\">Curve attacker begins to return stolen funds after bounty issued</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T22:41:50.000Z",
    "title": "How AI and Blockchain Boost NHL Crypto Betting Into A New Era of Informed Predictions",
    "url": "https://www.cryptopolitan.com/ai-and-blockchain-boost-nhl-crypto-betting/",
    "description": "The world of sports betting has seen a monumental shift with the integration of Artificial Intelligence (AI) in NHL crypto betting platforms. Bettors no longer rely solely on gut instincts and luck; they can now leverage cutting-edge technology to make informed decisions and elevate their betting experience. For the uninitiated who want to get into ... <a title=\"How AI and Blockchain Boost NHL Crypto Betting Into A New Era of Informed Predictions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-and-blockchain-boost-nhl-crypto-betting/\" aria-label=\"More on How AI and Blockchain Boost NHL Crypto Betting Into A New Era of Informed Predictions\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-04T23:00:39.000Z",
    "title": "Coinbase Research Expert Decodes Latest Crypto And Finance Market Trends",
    "url": "https://www.newsbtc.com/crypto/coinbase-research-expert-decodes-latest-crypto-and-finance-market-trends/",
    "description": "Coinbase’s Head of Research, David Duong, has shared his insights on the recent market movements in traditional finance and crypto.  He believes that current macro conditions suggest a temporary pause in the recent strong USD trend, which should support the crypto market.  Related Reading: Is SUI Price Stability Under Threat Due To Transactional Boom And Bust? Key Crypto &#38; Finance Movements Duong notes that the recent carry trades upset by the Bank of Japan’s decision to raise the hard cap on its 10-year bond yield have created instability across different pockets of the FX market.  Meanwhile, the surprise decision by Brazil’s central bank to cut its benchmark SELIC rate by 50bps (compared to expectations of 25bps) has led to higher interest rates in some price currencies coming down. In the US, the yield curve steepened significantly following the rally in Treasury bonds only two weeks ago, as the US Treasury Department announced an increase in the size of its debt issuance plans.  Although Fitch cut the US debt rating from AAA to AA+ due to concerns about the fiscal outlook, Duong believes this impact on bond yields was fairly limited. Duong emphasizes that the US dollar is more sensitive to front-end rates, and the 2y yield seems well anchored. This suggests a temporary pause in the recent strong USD trend, which should support the crypto market.  However, he expresses concern that crypto performance may recouple with US equities in the short term, which may cap the upside on digital assets due to stretched valuations. Duong also discusses the recent exploit of four liquidity pools on Curve, which didn&#8217;t help risk appetite in the crypto space but didn&#8217;t sustainably accelerate the downtrend that’s been ongoing since mid-July.  He believes the actual systemic risk associated with the exploit is limited by mitigating factors that offset some attack vulnerabilities. He also thinks this is not evidence of DeFi’s weakness but highlights the system’s antifragile properties. Related Reading: Crypto Trading Volumes Fall To Lowest Level In 2023 Amid Bear Market Woes Regarding market catalysts, Duong mentions the court decision in the Grayscale case (to convert its trust to an ETF), distributions from the Mt Gox Rehabilitation Trust to creditors, and any movement on the various Bitcoin spot Exchange-Traded Fund (ETF) applications in the US.  However, he notes that all those events are difficult to position for, so the market will have to wait for more information before pricing them in. Duong notes that flows on the desk have been balanced in the majors while altcoins have been net for sale. He also highlights Optimism’s OP token, which has traded better than expected, up 15% over the last 7 days, primarily attributed to the news around Base, Coinbase&#8217;s L2 on Ethereum. That chain, built on the OP stack, will broadly open on August 9. The total market capitalization of the cryptocurrency market stands at $1.13 trillion, which is consistent with its trading level since the start of August.  Additionally, Bitcoin&#8217;s dominance level is at 50.25%, while its price is currently trading at $29,216, showing a slight decline of 0.1% over the last 24 hours. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-08-04T23:03:28.000Z",
    "title": "Tether and Bitfinex Win Comprehensive Legal Victory as U.S. District Court Dismisses Class Action Lawsuit",
    "url": "https://blog.bitfinex.com/announcements/tether-and-bitfinex-win-comprehensive-legal-victory-as-u-s-district-court-dismisses-class-action-lawsuit/",
    "description": "<p>Today, Chief Judge Laura Taylor Swain of the U.S. District Court for the Southern District Of New York issued a comprehensive and incisive 6-page decision that included an order dismissing the meritless class action lawsuit filed by Matthew Anderson and Shawn Dolifka against Tether and...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/announcements/tether-and-bitfinex-win-comprehensive-legal-victory-as-u-s-district-court-dismisses-class-action-lawsuit/\">Tether and Bitfinex Win Comprehensive Legal Victory as U.S. District Court Dismisses Class Action Lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]