[
  {
    "source": "CoinDesk",
    "date": "2023-10-20T15:46:57.000Z",
    "title": "Coinbase's Grewal Is 'Quite Hopeful' That Bitcoin Spot ETFs Will be Approved",
    "url": "https://www.coindesk.com/business/2023/10/20/coinbases-grewal-is-quite-hopeful-that-bitcoin-spot-etfs-will-be-approved/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Grewal said in a CNBC interview that he is \"confident\" that after SEC will fulfill its responsibilities in making a decision about the approval of the ETF applications."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-20T15:50:39.000Z",
    "title": "LBRY concedes to total shutdown, citing loss to SEC and millions in debt",
    "url": "https://cryptoslate.com/lbry-concedes-to-total-shutdown-citing-loss-to-sec-and-millions-in-debt/",
    "description": "<p>LBRY Inc., the developer of the LBRY blockchain, is shutting down services because it lost a lawsuit to the U.S. Securities and Exchange Commission (SEC), and it &#8220;has several million dollars in debts.&#8221; In an Oct. 19 statement, LBRY explained that it owed several million dollars in debt to its legal team, private debtors, and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/lbry-concedes-to-total-shutdown-citing-loss-to-sec-and-millions-in-debt/\">LBRY concedes to total shutdown, citing loss to SEC and millions in debt</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-20T16:00:13.000Z",
    "title": "Biggest Movers: XRP Surges as SEC Drops Lawsuit Against Ripple’s Senior Management",
    "url": "https://news.bitcoin.com/biggest-movers-xrp-surges-as-sec-drops-lawsuit-against-ripples-senior-management/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1103967176-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"XRP Surges, as SEC Drops Lawsuit Against Ripple Senior Management\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1103967176-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1103967176-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1103967176-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1103967176-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1103967176-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1103967176-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1103967176-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />XRP was a big gainer on Friday, as markets reacted to the SEC&#x2019;s decision to drop its lawsuit against Ripple&#x2019;s management team. The commission previously alleged that CEO Brad Garlinghouse and chairman Chris Larsen had violated securities laws. Solana also surged, rising by over 10% today. XRP XRP rose to a two-week high on Friday, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-20T16:07:43.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-20T15:49:27.000Z",
    "title": "World’s First Blockchain Invoicing Platform InvoiceMate Migrates Internet Computer",
    "url": "https://www.cryptopolitan.com/invoicemate-migrates-internet-computer/",
    "description": "World’s first blockchain invoice platform InvoiceMate has jumped ship from Hyperledger Fabric to Internet Computer following a new partnership with DFINITY Foundation, according to a recent announcement. DFINITY, a not-for-profit research and development organization behind the Internet Computer blockchain (ICP), announced it would support InvoiceMate in this transition as it becomes an important part of ... <a title=\"World’s First Blockchain Invoicing Platform InvoiceMate Migrates Internet Computer\" class=\"read-more\" href=\"https://www.cryptopolitan.com/invoicemate-migrates-internet-computer/\" aria-label=\"More on World’s First Blockchain Invoicing Platform InvoiceMate Migrates Internet Computer\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-20T15:44:50.000Z",
    "title": "Unveiling the Future: World’s Fastest Light-Powered AI Processor Revealed",
    "url": "https://www.cryptopolitan.com/fastest-light-powered-ai-processor-revealed/",
    "description": "In a groundbreaking development, the scientific team from the Department of Informatics at the Aristotle University of Thessaloniki (AUTH) has unveiled one of the world&#8217;s fastest AI processors. Leveraging photonic neurons that operate with light instead of electricity, this cutting-edge processor marks a significant milestone in the quest for alternative computing systems. Headed by postdoctoral ... <a title=\"Unveiling the Future: World&#8217;s Fastest Light-Powered AI Processor Revealed\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fastest-light-powered-ai-processor-revealed/\" aria-label=\"More on Unveiling the Future: World&#8217;s Fastest Light-Powered AI Processor Revealed\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-20T16:00:12.000Z",
    "title": "xDay 2023: Elon Musk’s X Competitor? xPortal Unveils Rival Features",
    "url": "https://www.newsbtc.com/news/xday-2023-elon-musks-x-competitor-xportal-unveils-rival-features/",
    "description": "In the next three days, our team at Bitcoinist will cover xDay 2023, an event organized by MultiversX in the Palace of Parliament, Romania. Formerly known as Elrond, the project rebranded in 2022 to focus on the Metaverse, one of the hottest trends in crypto. Related Reading: xDay 2023 Day 2: Google And MultiversX Join Hands, How The Big Tech Giant Will Support The Community During the event, the head of product for MultiversX’s native “SuperApp” xPortal, Sergius Biris, unveiled new features to expand the ecosystem. The project aims to onboard new users to the network by providing social interactions, a bridge with other blockchains, and more to compete with Elon Muk. xPortal Goes After Elon Musk&#8217;s Ambitions Since last year, when Musk acquired Twitter (rebranded as “X”), the entrepreneur has progressively tried to turn it into something more. The social media app allows users to receive tips, subscribe to their favorite content, and interact with non-fungible tokens. These features highlight the relevance for users to operate with a single hub. MultiversX and xPortal want to compete with Elon Musk by providing users access to these and other features announced during the conference, such as gamification, access to the metaverse, and NFTs to provide a “multifaceted digital experience.” In contrast with X and Musk’s attempts, the team behind xPortal believes they have a critical advantage: their product is live and has over 1.5 million users already transecting and interacting with the MultiversX ecosystem. Moreover, MultiversX has a vision to remove all friction from onboarding their ecosystem. Thus, xPortal announced a new fiat to crypto on and off-ramping capability and a feature enabling users to swap their tokens. For European users, xPortal will enable peer-to-peer fiat payments with the traditional banking system, SEPA and SWIFT, earlier next year. During the conference, Biris stated: The features launched today, most notably the debit cards, were a long time in the making. Today&#8217;s launch elevates xPortal from a crypto wallet to a financial super app. We thus created a bridge to an interconnected future where the lines between crypto, fiat, and emerging technologies like AI dissolve, bringing an unparalleled user experience. The new features also included tools for developers and creators to leverage the MultiversX ecosystem. The xPortal app already allows them to launch their products for users to download quickly, similar to Apple’s Appstore and Google’s PlayStore. Turning Web3 And Crypto Into “Money” The conference has been conducted under a key vision: users want to leverage the technology, so crypto projects need to focus on security, scaling, and making accessible products. Rather than “Web3” or “Web4,” xPortal is about turning crypto into “money” available for anyone. Related Reading: xDay 2023 Day 1: How MultiversX Is Bridging The Metaverse, AI, And Blockchain Under Ecosystem Sergiu Biris, Head of Product at xPortal, spoke to us during the event in an exclusive interview and shared the project’s vision: They have to be able to do anything, whether it&#8217;s crypto or fiat, they don&#8217;t have to think about Blockchain is this, blockchain is not money. We are trying to dissolve those barriers between crypto and fiat because in our vision, money, it&#8217;s just money. And that&#8217;s why we want to make it easier for anyone to do whatever they need in terms of financial needs through the app. Cover image from MultiversX, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-20T16:06:18.000Z",
    "title": "Ripple’s SEC Saga: Third Court Loss Sparks Speculation of Settlement in XRP Lawsuit",
    "url": "https://www.crypto-news-flash.com/ripples-sec-saga-third-court-loss-sparks-speculation-of-settlement-in-xrp-lawsuit/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-sec-saga-third-court-loss-sparks-speculation-of-settlement-in-xrp-lawsuit",
    "description": "<img width=\"800\" height=\"390\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple vs sec\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1.png 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1-300x146.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1-768x374.png 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" />The SEC has confirmed that it is dropping all charges against Ripple co-founder Chris Larsen and CEO Brad Garlinghouse. Facing a nearly certain loss in the XRP lawsuit, many in the crypto community speculate that the regulator could opt to settle with Ripple. Ripple CEO Brad Garlinghouse and co-founder Chris Larson are today celebrating the [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-20T15:44:00.000Z",
    "title": "6-Year Trendline — a Formidable Obstacle, Will XRP Break It?",
    "url": "https://coinedition.com/6-year-trendline-a-formidable-obstacle-will-xrp-break-it/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/XRP_As_I_have_stated_many_times_the_e_wave_of_a_triangle_is_the.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"xrp price\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/XRP_As_I_have_stated_many_times_the_e_wave_of_a_triangle_is_the.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/XRP_As_I_have_stated_many_times_the_e_wave_of_a_triangle_is_the-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/XRP_As_I_have_stated_many_times_the_e_wave_of_a_triangle_is_the-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/XRP_As_I_have_stated_many_times_the_e_wave_of_a_triangle_is_the-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/XRP_As_I_have_stated_many_times_the_e_wave_of_a_triangle_is_the-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/XRP_As_I_have_stated_many_times_the_e_wave_of_a_triangle_is_the-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A Crypto Analyst who goes by the pseudonym JD tweeted that XRP was making higher highs in price while printing lower lows in RSI and Stochastic RSI on the weekly timeframe. This coincided while the token was bouncing off a 2-year trendline. Furthermore, the analyst stated that for XRP to spike drastically, it has to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/6-year-trendline-a-formidable-obstacle-will-xrp-break-it/\">6-Year Trendline — a Formidable Obstacle, Will XRP Break It?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]