[
  {
    "source": "CoinDesk",
    "date": "2023-06-14T13:00:00.000Z",
    "title": "P2P.org’s Ethereum Staking Application Is Now Available on Popular Wallet Provider Safe",
    "url": "https://www.coindesk.com/tech/2023/06/14/p2porgs-ethereum-staking-application-is-now-available-on-popular-wallet-provider-safe/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The integration makes it easier for crypto users to participate in staking without operating the physical infrastructure."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-14T13:00:00.000Z",
    "title": "Big week for crypto — Here’s everything you need to know",
    "url": "https://cointelegraph.com/news/big-week-for-crypto-here-s-everything-you-need-to-know",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/88387dee-1768-4cc4-8ed3-0fc2a1204656.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>On this week’s episode of The Market Report, Cointelegraph’s resident expert discusses all the important events scheduled for this week in the crypto space and how they could impact the market.</p>\n                    <p><p>In the latest episode of <em>The Market Report</em>, analyst and writer Marcel Pechman explains that United States inflation slowed for an 11th straight month in May, even though the Consumer Price Index increased 4% year-over-year. That’s down from 4.9% in April but still above the 2% target.</p><p>Next, Pechman raises the question of regulation in light of the U.S. Securities and Exchange Commission suing Binance and Coinbase for allegedly violating securities laws by offering tokens including BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>), Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>), Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>), Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) and Algorand (<a href=\"https://cointelegraph.com/algorand-algo-price-index\">ALGO</a>), among others.</p><p>When analyzing Binance’s appeal to the SEC’s attempt to freeze its funds, Pechman says the exchange is fighting back and shows how flawed some of the regulator’s arguments are, especially regarding Merit Peak, the offshore trading entity. Pechman emphasizes that Binance.US clients will not face losses even if there is stronger intervention by regulators.</p><p>Furthermore, Pechman explains why it is so important for the SEC to score a win in this case, opening room for further action, potentially including the U.S. Department of Justice. But, for now, his base case assumes zero impact on Binance’s international operations.</p><p>Next, the show covers a proposed bill in the U.S. House of Representatives, which aims to fire and replace SEC chair Gary Gensler. According to Pechman, Gensler could only be removed from the position if some kind of wrongdoing is proven, which doesn’t seem to be the case.</p><p>Pechman explains that there’s an apparent effort to suppress the crypto industry in the U.S., although we don’t yet know the motives. However, the SEC is not acting alone or opposing recent actions from the Commodity Futures Trading Commission, the Department of Justice and the New York Department of Financial Services.</p><p>As for the Hinman documents, Pechman reminds everyone that it happened five years ago, so no sane judge would consider a former SEC employee’s opinion from that era to rule on whether XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) is a security or not.</p><p>The show airs every Tuesday on the <a href=\"https://www.youtube.com/@cointelegraphmarketresearch\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets &amp; Research YouTube channel</a>. Don’t miss it!</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-14T13:00:00.000Z",
    "title": "Going parabolic",
    "url": "https://cointelegraph.com/innovation-circle/going-parabolic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/4e607034-bf43-473a-b468-41bb934db235.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Crypto, memes and bad news have a similar adoption curve these days.</p>\n                    <p><p>Chances are, in the past, you took up parabolas, exponents, logarithms and the power law in your math subjects in school. During that time, you probably thought it was just something you needed to pass, not really something you would have a practical use for in the future. </p> <p>Another topic you probably studied in school was algebra, where you likely encountered the formula for a straight line, y = mx + b. Again, most likely you thought of all these as just topics you needed to understand and pass. But as you mature in this world, you realize that topics like logarithms and exponential functions do have uses. One such use is in modeling the parabolic popularity and adoption of memes, crypto, films, the spread of diseases like Covid — and even artificial intelligence.</p> <p>Earlier in 2023, it was <a href=\"https://www.reuters.com/technology/chatgpt-sets-record-fastest-growing-user-base-analyst-note-2023-02-01/\">announced</a> in the news that ChatGPT recently reached its 100 millionth user in a few weeks. It went from zero to 100 million in a few weeks after its launch late in 2022. That’s probably every marketer’s dream. We also heard that Silicon Valley Bank’s depositors <a href=\"https://edition.cnn.com/2023/03/14/tech/viral-bank-run/index.html\">withdrew</a> their money and almost drained the bank’s coffers in the span of a few hours. Everything that happens these days seems to be on internet time — given the speed of networks and how word travels fast on social media.</p> <p>In most of our experiences with previous businesses, our expectations are often more linear than parabolic. If you set up a coffee shop somewhere, maybe on the first day you’ll have five customers. Then on the second and third day, you’ll have seven to ten. On the fourth and fifth, maybe you’ll have more than ten, but it would probably take you some time to get to a thousand customers. Sure, your traditional business is growing but it is slow. It is a linear expectation type of business.</p> <p>This is why when ChatGPT reported its one millionth and then one hundred millionth users just a few days apart, people were surprised. This is the same with the withdrawal speed at SVB, or crypto memecoins like Pepe, Doge and Shiba Inu. It’s not normally in their realm of expected outcomes. </p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://circle.cointelegraph.com/learn-more?utm_campaign=Coin&_ga=2.123197772.699257063.1649682515-719256619.1645538730\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <p>People are not normally used to parabolic outcomes. But disease vectors, crypto, AI and memes are often able to reach parabolic adoption given certain conditions. First of all, the wide availability of smartphones, laptops, fast internet and social media has accelerated adoption. When you post something on the web, within a few seconds, a few thousand to several million people may see it immediately.</p> <p>Mathematically, that may mean, instead of the y = mx + b linear function, the function could be something where the expected number of adopters today could be squared, cubed — or even higher — of the number of people using it today. That could mean that two becomes four, and four becomes sixteen, or two becomes eight and eight becomes sixty-four, etc. So, it becomes more like how diseases spread, or how bacteria divide and multiply. It gets huge in a short period of time.</p> <p>Inversely, this parabolic effect could also become a quick drop in popularity. Take for instance the potential negative impact on sales of a product due to controversial partnerships. In these cases, pushing an agenda that goes against the beliefs of the core target market can just as quickly push consumers to abandon a product.</p> <p>The easiest way companies can use the parabolic effect for their products include attempting to trend using their hashtags on Twitter or getting on the news cycle with either bad news that dumps their product, good news that enhances it, or a catchy commercial or film placement. Anything that gets people talking in droves, that goes against the normal flow of things without appearing contrived, can drive topics to become viral.</p> <p>If the content or application is really viral and interesting, then these people may immediately click and adopt it to at least test before they adopt it. Some might hesitate, some might test it and hate it and then some might like it. Then, they spread word of mouth — whether good or bad — about their experience to their friends and acquaintances.</p> <p>Crypto, memes and bad news have a similar adoption curve these days. A cute doggie, frog or cat meme coin might receive defamatory remarks from intellectuals, but maybe they are just underestimating the number of people out there who like cute pets like cats and dogs. There might be different reasons for why meme fans buy, of course.</p> <p>We now live in an age of parabolic power law adoption. The possibility is there, but it will only “go parabolic” if the application is not a “me too” one, but something new that unlocks a primordial human desire or need.</p> <p><em>The information provided here is not investment, tax or financial advice. You should consult with a licensed professional for advice concerning your specific situation.</em></p> <p><em><a href=\"http://www.zain-ventures.com/\">Zain Jaffer</a> is the CEO of Zain Ventures focused on investments in Web3 and real estate.</em></p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\" /> </div> </div> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://circle.cointelegraph.com/\"><em><strong>Learn more about Cointelegraph Innovation Circle and see if you qualify to join</strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-14T12:45:59.000Z",
    "title": "Prime Trust subsidiary Banq files for bankruptcy amid BitGo acquisition deal",
    "url": "https://cointelegraph.com/news/prime-trust-subsidiary-banq-bankruptcy-filing-amid-bitgo-deal",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/28453bac-775b-410f-8b71-9af89d748fa6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Prime Trust payment subsidiary Banq files for bankruptcy, citing “unauthorized’ asset transfers to Fortress Group.</p>\n                    <p><p>The payments subsidiary of crypto custodian Prime Trust, Banq, filed for bankruptcy protection in the United States on June 13, court documents show..</p><p>The move comes just days after wallet infrastructure provider and digital asset custodian <a href=\"https://cointelegraph.com/news/bitgo-intent-agreement-acquire-buy-prime-trust\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitgo-intent-agreement-acquire-buy-prime-trust/amp\">BitGo signed a non-binding letter of intent</a> to acquire Prime Trust, which was announced on June 8.</p><p>Banq’s bankruptcy <a href=\"https://www.courtlistener.com/docket/67498178/banq-inc/\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> listed $17.72 million and liabilities of $5.4 million and cited the “unauthorized transfer” of $17.5 million in assets to Fortress NFT Group as well as the illicit transmission of trade secrets and proprietary information to Fortress.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e09f3aca-b5c4-428b-8e0f-f3ed41bc988c.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Excerpt from Banq's bankruptcy filing detailing summary of assets and liabilities.  </em></figcaption></figure><p>Fortress NFT Group was set up by Banq’s former CEO, CTO and CPO, <a href=\"https://cryptoslate.com/prime-trust-subsidiary-banq-declares-bankruptcy/\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://cryptoslate-com.cdn.ampproject.org/c/s/cryptoslate.com/prime-trust-subsidiary-banq-declares-bankruptcy/?amp=1\">reports</a> say, and Banq is currently in arbitration with Fortress NFT Group over these allegations.</p><p>The timing of the filing, just after the BitGo acquisition deal of Banq’s parent Prime Trust was announced, raises questions about how it might affect the agreement.</p><p>While the terms of the deal were not disclosed, if it goes through, BitGo will acquire Prime Trust’s payment rails and cryptocurrency IRA fund and increase its wealth management offerings.</p><p>Prime Trust’s Nevada Trust Company will also join BitGo’s network of regulated trust companies in South Dakota, New York, Germany, and Switzerland. Prime Trust’s API infrastructure and exchange network will “map over 1:1” with BitGo services. BitGo stated:</p><blockquote>“This acquisition makes BitGo the first global digital asset company to provide a full suite of solutions for institutions and fintech platforms.”</blockquote><p>The crypto custody market is evolving rapidly, with recent deals including Ripples acquisition of <a href=\"https://cointelegraph.com/news/ripple-acquires-swiss-blockchain-custody-firm-metaco-for-250m\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ripple-acquires-swiss-blockchain-custody-firm-metaco-for-250m/amp\">Swiss digital asset custody provider Metaco</a> in May for $250 million.</p><p>The BitGo/Prime Trust deal, if it goes ahead, comes just as the United States Securities and Exchange Commission<a href=\"https://cointelegraph.com/news/sec-to-target-crypto-firms-operating-as-qualified-custodians-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-to-target-crypto-firms-operating-as-qualified-custodians-report/amp\"> has proposed rule changes</a> that would make it harder for crypto companies to act as custodians of their customers’ funds.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/prometheum-subsidiary-receives-finra-approval-for-digital-asset-qualified-custody\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/prometheum-subsidiary-receives-finra-approval-for-digital-asset-qualified-custody/amp\">Prometheum subsidiary receives FINRA approval for digital asset qualified custody</a></em></strong></p><p>Prime Trust has been under pressure for a while, having reportedly<a href=\"https://cointelegraph.com/news/crypto-firms-cut-nearly-3-000-jobs-in-january-despite-bitcoin-s-rise\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-firms-cut-nearly-3-000-jobs-in-january-despite-bitcoin-s-rise/amp\"> laid off a third of its staff</a> in January. Later, <a href=\"https://cointelegraph.com/news/binance-us-unable-to-find-bank-partners-in-the-united-states-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-us-unable-to-find-bank-partners-in-the-united-states-report/amp\">it stepped in to hold</a> Binance.US customer funds through a network of partner banks after the banking crisis in March.</p><p>It was the <a href=\"https://cointelegraph.com/news/ftx-exec-revealed-as-big-donor-to-oregon-democrats-following-misidentification\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ftx-exec-revealed-as-big-donor-to-oregon-democrats-following-misidentification/amp\">center of a scandal </a>in the U.S. state of Oregon last year when it was identified as the source of a $500,000 contribution to the state Democratic Party that later turned out to have come from FTX executive Nishad Singh.</p><p>BitGo itself was close to being acquired by Galaxy Digital for $1.2 billion last year and sued Galaxy for acquisition breach after the deal was canceled.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/account-abstraction-supercharges-ethereum-wallets-dummies-guide/\">‘Account abstraction’ supercharges Ethereum wallets: Dummies guide</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T12:58:54.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $15.19 with a 24-hour trading volume of $130,897,839. Solana is down 2.90% in the last 24 hours. The current CoinMarketCap ranking is #10, with a live market cap of $1,273,881,101. It has a circulating supply of 394,890,490 SOL coins and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T12:52:06.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-14T13:05:51.000Z",
    "title": "What happened to Celsius Network: a year in review",
    "url": "https://crypto.news/what-happened-to-celsius-network-a-year-in-review/",
    "description": "What was once a beacon of hope for cryptocurrency investors spiraled into a major financial fiasco. The crypto lender Celsius Network (CEL) that promised a new dawn in the decentralized finance (DeFi) movement collapsed in June 2022, sparking a wave&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-14T13:00:00.000Z",
    "title": "Moxy partners with Stainless Games to release Shock Rods",
    "url": "https://crypto.news/moxy-partners-with-stainless-games-to-release-shock-rods/",
    "description": "Moxy and Stainless Games have joined forces to release Shock Rods on the Moxy platform for an immersive esports gamer experience"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-14T12:43:55.000Z",
    "title": "Twitter thread shows Coinbase’s servers may be compromised",
    "url": "https://crypto.news/twitter-thread-shows-coinbases-servers-may-be-compromised/",
    "description": "A Coinbase user recently shared a Coinbase-related scam story indicating that the exchange&#8217;s servers might be compromised. Jacob Canfield, a YouTube host and bitcoin enthusiast, claimed he received a text message about a changed two-factor authentication (2FA) setting on their&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T13:06:49.000Z",
    "title": "Open Exchange (OPNX) Tokenizes Celsius Bankruptcy Claims",
    "url": "https://www.crypto-news-flash.com/open-exchange-opnx-tokenizes-celsius-bankruptcy-claims/?utm_source=rss&utm_medium=rss&utm_campaign=open-exchange-opnx-tokenizes-celsius-bankruptcy-claims",
    "description": "Hong Kong, Hong Kong, June 14th, 2023, Chainwire Open Exchange (OPNX) has officially added Celsius claims to its marketplace. OPNX will now accept claims from the Celsius bankruptcy proceedings through its verification and tokenization partner, Heimdall. Holders of a claim can have it turned into a tokenized asset, allowing it to be traded as a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T13:00:24.000Z",
    "title": "Binance coin price dips 14%, Cardano down 15.6%,Tradecurve price surges 25%",
    "url": "https://www.crypto-news-flash.com/binance-coin-price-dips-14-cardano-down-15-6tradecurve-price-surges-25/?utm_source=rss&utm_medium=rss&utm_campaign=binance-coin-price-dips-14-cardano-down-15-6tradecurve-price-surges-25",
    "description": "The cryptocurrency market has dipped as investors and traders begin offloading cryptocurrencies due to the SEC&#8217;s lawsuits against Binance and Coinbase. These CEXs took a hit in user count, and altcoins like Binance Coin and Cardano are down in value as a result.  However, decentralized projects are thriving, as evident by the increase in the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T13:00:21.000Z",
    "title": "Chainlink Labs and QuickNode Form Strategic Partnership to Strengthen Secure Blockchain Infrastructure",
    "url": "https://www.crypto-news-flash.com/chainlink-labs-and-quicknode-form-strategic-partnership-to-strengthen-secure-blockchain-infrastructure/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-labs-and-quicknode-form-strategic-partnership-to-strengthen-secure-blockchain-infrastructure",
    "description": "QuickNode and Chainlink Labs have entered into a partnership to enhance secure blockchain infrastructure. QuickNode will provide Chainlink BUILD projects with QuickNode Credits, enabling them to create RPC endpoints and access Web3 services and developer resources. .@QuickNode has partnered with @ChainlinkLabs to help provide the Web3 ecosystem with secure blockchain infrastructure. Discover how this partnership [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-14T12:48:19.000Z",
    "title": "IQ Protocol Launches Their Marketplace for Rental NFTs",
    "url": "https://www.altcoinbuzz.io/blockchain-gaming/iq-protocol-launches-their-marketplace-for-rental-nfts/",
    "description": "<p>Have you heard the complaints that NFTs are too expensive? IQ Protocol is about to change. On their brand-new marketplace, you can rent out NFTs. That&#8217;s particularly good for gamers. Now you don&#8217;t need a big investment, but can rent your NFTs. To clarify, that&#8217;s without collateral! So, let&#8217;s see what ideas and solutions IQ [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/blockchain-gaming/iq-protocol-launches-their-marketplace-for-rental-nfts/\">IQ Protocol Launches Their Marketplace for Rental NFTs</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-14T12:48:00.000Z",
    "title": "Prime Trust Subsidiary Banq Files for Chapter 11 Bankruptcy",
    "url": "https://coinedition.com/prime-trust-subsidiary-banq-files-for-chapter-11-bankruptcy/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Prime-Trust-Subsidiary-Banq-Files-for-Chapter-11-Bankruptcy-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Prime-Trust-Subsidiary-Banq-Files-for-Chapter-11-Bankruptcy-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Prime-Trust-Subsidiary-Banq-Files-for-Chapter-11-Bankruptcy-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Prime-Trust-Subsidiary-Banq-Files-for-Chapter-11-Bankruptcy.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The beleaguered crypto custodian Prime Trust’s subsidiary Banq officially filed for bankruptcy in the U.S. bankruptcy court in the district of Nevada. According to the filings, Banq disclosed its assets totaling around $17.72 million, while its liabilities amount to $5.4 million. The bankruptcy filing comes just a week after BitGo Holdings, Inc., signed a non-binding [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/prime-trust-subsidiary-banq-files-for-chapter-11-bankruptcy/\">Prime Trust Subsidiary Banq Files for Chapter 11 Bankruptcy</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]