[
  {
    "source": "CryptoSlate",
    "date": "2023-08-09T01:00:41.000Z",
    "title": "US prosecutors to issue superseding indictment against Sam Bankman-Fried next week",
    "url": "https://cryptoslate.com/us-prosecutors-to-issue-superseding-indictment-against-sam-bankman-fried-next-week/",
    "description": "<p>U.S. prosecutors intend to seek a superseding indictment against FTX founder Sam Bankman-Fried in the week of Aug. 14 that will include the charge of conducting an illegal campaign finance scheme, according to a letter filed with the court on Aug. 8. The U.S. government intends to pursue seven charges against FTX founder Sam Bankman-Fried [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/us-prosecutors-to-issue-superseding-indictment-against-sam-bankman-fried-next-week/\">US prosecutors to issue superseding indictment against Sam Bankman-Fried next week</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-09T00:58:00.000Z",
    "title": "Crypto Trader Makes $1.5 Million in $ETH by Outsmarting a Bot on an NFT Marketplace",
    "url": "https://www.cryptoglobe.com/latest/2023/08/crypto-trader-makes-1-5-million-in-eth-by-outsmarting-a-bot-on-an-nft-marketplace/",
    "description": "In a sophisticated maneuver in the volatile world of digital assets, a trader known by the pseudonym Hanwe Chang has reportedly managed to make over $1.5 million in the second-largest digital asset by market capitalization Ethereum ($ETH) by outmaneuvering a bot on a popular marketplace. According to reports from various trader, backed by on-chain data, […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T01:03:05.000Z",
    "title": "Organizations Worldwide Contemplate Bans on Generative AI Applications, BlackBerry Research",
    "url": "https://www.cryptopolitan.com/organizations-on-generative-ai-applications/",
    "description": "In a recent study conducted by BlackBerry Limited, a renowned leader in cybersecurity solutions, it was unveiled that a staggering 75% of organizations globally are in the process of implementing or deliberating the imposition of bans on Generative AI applications, including the widely used ChatGPT, within their workplace environments. This research brings to light the ... <a title=\"Organizations Worldwide Contemplate Bans on Generative AI Applications, BlackBerry Research\" class=\"read-more\" href=\"https://www.cryptopolitan.com/organizations-on-generative-ai-applications/\" aria-label=\"More on Organizations Worldwide Contemplate Bans on Generative AI Applications, BlackBerry Research\">Read more</a>"
  }
]