[
  {
    "source": "NullTX",
    "date": "2024-02-09T23:46:11.000Z",
    "title": "Multibit (MUBI) Faces Steep Decline Amid Whale Dumping",
    "url": "https://nulltx.com/multibit-mubi-faces-steep-decline-amid-whale-dumping/",
    "description": "Multibit ($MUBI), a dual-sided bridged token operating on both the BRC20 and ERC20 platforms, has experienced a significant downturn in its value over the past month.  With losses exceeding 33% in the last 30 days and 21% in the past week, the token faces considerable downward pressure. Today, the decline [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-10T00:00:05.000Z",
    "title": "XRP Ledger (XRPL) Token Market Cap Surged 47% In Q4 To $169M: What Caused The Surge?",
    "url": "https://www.newsbtc.com/xrp-news/xrp-ledger-xrpl-token-market-cap-surged-47-in-q4-to-169m-what-caused-the-surge/",
    "description": "A recent report by Messari sheds light on the state of the XRP Ledger (XRPL) and its notable performance during the fourth quarter (Q4) of 2023.  The report highlights significant milestones, including its native token market capitalization, distribution, burning mechanism, price movement, legal battle, and network activity. Distribution Of 4 Billion XRP Contributes To Market Cap Growth?  As of Q4 2023, XRP, the native token of the XRPL, emerged as the sixth-largest cryptocurrency by market capitalization, reaching $33.7 billion. The token&#8217;s circulating market cap witnessed a substantial 21.2% increase quarter-over-quarter (QoQ) and an impressive 93.6% growth year-over-year (YoY).  According to Messari, the increase in market capitalization was primarily due to the distribution of 4 billion XRP and a significant price spike on November 13, when the token reached as high as $0.7503. Related Reading: Crypto CEO Says Get Ready For Solana To ‘Rally Higher Again’ With New Target Throughout 2023, 4 billion tokens were distributed, accounting for 8% of the XRP supply from the end of 2022. While this distribution contributed to the increase in market cap, it was overshadowed by the impact of the price spike.  Additionally, the XRPL employs a transaction fee-burning mechanism, applying deflationary pressure to the total supply of 100 billion XRP. However, the low transaction fees on the network have resulted in a relatively low burn rate of approximately 12 million XRP since the inception of the XRP Ledger. Network Activity Shows Mixed Trends In Q4 2023 Q4 2023 marked a significant turning point for XRP, concluding a multi-year legal battle with the US Securities and Exchange Commission (SEC). In July 2023, the district court ruled that XRP is not considered an investment contract or a security, distinguishing it from many other blockchain assets.  This ruling triggered a surge in XRP&#8217;s price, with an increase of over 70% on July 14 and a peak of $0.82 on July 20. The subsequent relisting of XRP on major cryptocurrency exchanges further bolstered its position. Network activity on the  XRPLedger displayed mixed trends in Q4. While active addresses decreased by 31.3% QoQ, transactions increased by 22.7% QoQ.  Notably, a significant portion of transaction activity originated from a group of accounts sending transactions to a single account for inscription-related activity. The number of accounts on the XRPL increased by 188,000, reaching 5.00 million in Q4.  Related Reading: Bitcoin Flies Above $47,300, But Watch Out For Extreme Greed Overall, the Q4 2023 report on the XRP Ledger showcases its growth, driven by various factors such as price spikes, legal victories, and network activity. With its expanding market capitalization and increasing adoption, XRP continues to solidify its position in the cryptocurrency market. Featured image from Shutterstock, chart from TradingView.com"
  }
]