[
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T23:35:23.000Z",
    "title": "Why the U.S. will lose if it picks a fight with China and Russia",
    "url": "https://www.cryptopolitan.com/us-lose-if-it-picks-fight-with-china-russia/",
    "description": "Standing on the precipice of a new global order, the U.S. faces a daunting challenge. The increasing nuclear prowess of China, coupled with Russia&#8217;s established might, presents an unparalleled test. For the first time, America is confronting the reality of two nuclear-powered rivals with ambitions potent enough to challenge the international status quo. Navigating Unchartered ... <a title=\"Why the U.S. will lose if it picks a fight with China and Russia\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-lose-if-it-picks-fight-with-china-russia/\" aria-label=\"More on Why the U.S. will lose if it picks a fight with China and Russia\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-13T23:30:33.000Z",
    "title": "What To Expect If Historical Bitcoin Halving Cycles Repeat",
    "url": "https://www.newsbtc.com/news/bitcoin/historical-bitcoin-halving-cycles/",
    "description": "It&#8217;s been quite a bearish week for Bitcoin, as the crypto has fallen around 3% since the beginning of the week. Price action, in particular, has had Bitcoin struggling to break above $27,000, indicating a potential risk of more losses below this resistance level in the near term.  However, according to a crypto analyst, this current retracement might be the beginning of a historical Bitcoin cycle before each halving. Analyst Shows Bitcoin Price Correction Based On Historical Trends Crypto analyst Rekt Capital has said in a post that if historical Bitcoin &#8220;halving cycles&#8221; are any indication, a major price correction could be right around the corner. The Bitcoin halving cuts the block reward for miners in half.  Related Reading: US Mega Bank JPMorgan Predicts Harsh Drop In This Bitcoin Metric This happens roughly every 4 years to slow the creation of new BTC and control inflation. Based on historical data from the previous two Bitcoin halvings, the price of BTC could drop by up to 38% before the next halving. In a chart shared on X (formerly Twitter), Rekt Capital showed a major pull back has happened around six months before each halving. In the 2015 cycle, BTC retraced 25% 196 days before the 2016 halving.  In 2019, BTC retraced 38%, 196 days before the 2020 halving. So with the next halving slated to occur around April 2024, it would seem the market is now in a prime position for the next correction.  Previous halving trends &#124; Source: X Bitcoin is currently 60% below its all-time high, following a similar pattern with past halvings. 200 days before the 2020 halving, BTC was 60% below its all-time high. Likewise, 200 days before the 2016 halving, BTC was 65% below its all-time high. What A Correction Would Mean For BTC Bitcoin&#8217;s price direction is currently uncertain, especially as on-chain transactions on the blockchain are now at a three-month low. On-chain metrics have shown that 95% of Bitcoin&#8217;s circulating supply hasn&#8217;t changed hands in the past month, as investors seem to be holding on to the cryptocurrency in anticipation of the SEC&#8217;s approval of spot Bitcoin ETFs. Although past performance doesn’t always repeat, if this pattern shows up again before the next halving, Bitcoin could be in for a big correction. With the current price of BTC now at $26,770, a 38% retracement could see BTC fall below $18,000. If this happens, it would be devastating for BTC holders.  Related Reading: Bitcoin Price Plunge: Long-Term Holders Buy $1.35 Billion Worth Of BTC Even though a price correction may be on the horizon, Bitcoin&#8217;s long-term growth prospects remain strong. Over the past decade, Bitcoin has shown a consistent upward trend as the largest crypto by market cap despite facing several setbacks.  Bitcoin has been named the best performer this year in terms of asset investing by Reflexivity, a digital asset research firm. According to billionaire hedge fund manager Paul Tudor Jones, this is the best time to buy BTC.  BTC price at $26,782 &#124; Source: BTCUSD on Tradingview.com Featured image from Asia Crypto Today, chart from Tradingview.com"
  }
]