[
  {
    "source": "Crypto Daily",
    "date": "2023-11-16T08:44:41.000Z",
    "title": "SEC Delays Decision On Hashdex And Grayscale ETF Applications",
    "url": "https://cryptodaily.co.uk/2023/11/sec-delays-decision-on-hashdex-and-grayscale-etf-applications",
    "description": "The United States Securities and Exchange Commission has delayed its decision on the Hashdex spot bitcoin ETF application and Grayscale’s Ether futures filing. The agency stated in its filing that it would make a decision on the applications by the 1st of January, 2024."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-16T09:03:52.000Z",
    "title": "How Will AI Trends Redefine Journalism and Broadcasting in 2023?",
    "url": "https://www.cryptopolitan.com/ai-trends-journalism-broadcasting-in-2023/",
    "description": "In the pulsating heart of technological evolution, the tapestry of 2023 unfolds with the mesmerizing ascent of artificial intelligence (AI), leaving an indelible mark on the intricate weave of industries. At the helm of this transformative tide is Grigory Mindlin, the visionary general manager for broadcast at disguise, providing an illuminating lens into the myriad ... <a title=\"How Will AI Trends Redefine Journalism and Broadcasting in 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-trends-journalism-broadcasting-in-2023/\" aria-label=\"More on How Will AI Trends Redefine Journalism and Broadcasting in 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-16T08:44:48.000Z",
    "title": "CFTC chair warns of repeat FTX scenario amid static crypto risks",
    "url": "https://www.cryptopolitan.com/cftc-chair-of-repeat-ftx-scenario/",
    "description": "Still reeling from the shockwaves of the FTX collapse, the cryptocurrency market faces ongoing scrutiny and calls for regulatory oversight. Rostin Behnam, chairman of the Commodity Futures Trading Commission (CFTC), recently emphasized the urgent need for a comprehensive regulatory framework to safeguard investors and stabilize the volatile market. During a seminar at Georgetown University, Behnam, ... <a title=\"CFTC chair warns of repeat FTX scenario amid static crypto risks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cftc-chair-of-repeat-ftx-scenario/\" aria-label=\"More on CFTC chair warns of repeat FTX scenario amid static crypto risks\">Read more</a>"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-16T08:51:30.000Z",
    "title": "Matic to POL. What’s happening?",
    "url": "https://www.altcoinbuzz.io/spotlight/matic-to-pol-whats-happening/",
    "description": "<p>POL introduces added features such as restaking. Aligning with Polygon&#8217;s integration of zero-knowledge technology, and expansion into a ZK validium Layer 2 network. POL will have an initial supply of 10 billion tokens and a future emission rate capped at 1%. So POL (Polygon Ecosystem Token) will replace the MATIC token over 4 years. What [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/spotlight/matic-to-pol-whats-happening/\">Matic to POL. What&#8217;s happening?</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]