[
  {
    "source": "Cointelegraph",
    "date": "2023-07-27T17:45:00.000Z",
    "title": "'Pro crypto bill' passes out of US House Agriculture Committee",
    "url": "https://cointelegraph.com/news/republican-crypto-bill-passes-us-house-agriculture-committee",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/ed0ed164-669e-445c-b62e-eb8b1966b8f4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Republican bill, dubbed FIT for the 21st Century, was drafted by two House committees and passed after strenuous preparations by members of both parties.</p>\n                    <p><p>Tact was pervasive in the United States House of Representatives Agricultural Committee’s <a href=\"https://agriculture.house.gov/calendar/eventsingle.aspx?EventID=7673\" target=\"_blank\" rel=\"noopener nofollow\">consideration</a> of the Financial Innovation and Technology for the 21st Century Act on July 27. With many references to bipartisanship and self-congratulatory mentions of the members’ cooperation and hard work, the committee plowed through a series of amendments calmly and quickly. </p><p>The bill, co-written by Republican members of the Agriculture and Financial Services Committee, <a href=\"https://cointelegraph.com/news/digital-assets-bill-introduced-house-republican-committees\">seeks to create a comprehensive regulatory framework</a> for digital assets. It was <a href=\"https://cointelegraph.com/news/us-lawmakers-invoke-ftx-spar-direction-crypto-bills\">debated in the Financial Services Committee</a> along with several other bills a day earlier. </p><p>Ranking member David Scott introduced the Democrats’ concerns, claiming that consumer protections need to be strengthened in the bill. It does not provide for third-party auditing, he said.</p><p>In addition, funding for the Commodity Futures Trading Commission (CFTC) was not increased in line with the new authorities the bill would give it, though it was later pointed out that the bill provides the CFTC with the minimum level of funding requested by chair Rostan Behnam.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/us-lawmakers-hold-eu-and-uk-as-examples-of-crypto-regulation-in-joint-hearing\">US lawmakers hold EU and UK as examples of crypto regulation in joint hearing</a></em></strong></p><p>The bipartisanship took a while to show through as Rep. Alma Adams called the bill “a fast track to investor confusion.” Her amendment to guarantee diversity on the boards of market participants was later voted down.</p><p>The provisional registration measures evoked comment from several legislators. Eventually, an amendment proposed by Rep. Yadira Caraveo to require provisionally registered parties to belong to a futures trade association was passed, with the purpose of providing some oversight of them while regulations were being worked out. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Shifting over to <a href=\"https://twitter.com/HouseAgGOP?ref_src=twsrc%5Etfw\">@HouseAgGOP</a> as they markup the Financial Innovation and Technology for the 21st Century Act, Chair Thompson noted the following in his opening remarks:<br><br>&quot;This legislation marks a significant milestone in the House Committee on Agriculture&#39;s efforts to create a…</p>&mdash; DeFi Education Fund (@fund_defi) <a href=\"https://twitter.com/fund_defi/status/1684568653428310016?ref_src=twsrc%5Etfw\">July 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Market participants will also be required to have physical addresses under an amendment by Rep. Jasmine Crockett. Disclosure requirements were also strengthened. </p><p>The chair, Rep. Glenn Thompson, and ranking member agreed to study decentralized finance further. The bill was successfully passed out of the committee.</p><p>The crypto community has vocally supported the bill. Crypto Council for Innovation CEO Sheila Warren praised the committee’s passage of the bill in a statement:</p><blockquote>“It's a significant marker that shows keeping the status quo is not an option. There is too much at risk for consumers, US competitiveness and national security to take a back seat.” </blockquote><p>Warren added, “The definition of ‘digital asset trading system’ should be narrowed and the new exclusion category to the definition of ‘digital asset’ included in Section 101 and the restrictions on mixed digital asset transactions further clarified.” </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/opinion-republican-crypto-maxis-democrat-anti-crypto-army-mchenry-warren/\">Opinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-27T17:59:26.000Z",
    "title": "BlackRock and India’s Jio Financial Services Join Forces",
    "url": "https://cryptodaily.co.uk/2023/07/blackrock-and-indias-jio-financial-services-join-forces",
    "description": "<p>BlackRock and India&rsquo;s Jio Financial Services will soon enter a joint venture to launch a &ldquo;digital-first offering&rdquo; in India. </p>\n<p>Today, the world&rsquo;s largest asset manager, BlackRock, announced it would join Jio Financial Services (JFS) in a 50:50 joint venture to launch asset management services in India. Joi Financial Services is part of Indian tycoon Mukesh Ambani&rsquo;s Reliance Industries.</p>\n<p>The venture, named &ldquo;Joi BlackRock,&rdquo; will see each company invest $150 million in the project and aims to offer &ldquo;tech-enabled&rdquo; access to &ldquo;affordable, innovative investment solutions&rdquo; to millions of Indian investors.</p>\n<p>Today&rsquo;s press release said the project would combine BlackRock&rsquo;s &ldquo;scale and investment expertise with Joi Financial Services&rsquo; knowledge and resources&rdquo; to transform India&rsquo;s asset management industry through a digital-first offering.</p>\n<p>Hitesh Sethia, President and CEO of JFS, commented:</p>\n\n<p>&ldquo;This is an exciting partnership between JFS and BlackRock, one of the largest and most respected asset management companies globally. The partnership will leverage BlackRock&rsquo;s deep expertise in investment and risk management along with the technology capability and deep market expertise of JFS to drive digital delivery of products.</p>\n<p>Jio BlackRock will be a truly transformational, customer centric and digital-first enterprise with the vision to democratise access to financial investment solutions and deliver financial well-being to the doorstep of every Indian.&rdquo;</p>\n\n<p>Rachel Lord, Chair and Head of APAC for BlackRock, said:</p>\n\n<p>&ldquo;India represents an enormously important opportunity. The convergence of rising affluence, favourable demographics, and digital transformation across industries is reshaping the market in incredible ways.</p>\n<p>We are very excited to be partnering with JFS to revolutionise India&rsquo;s asset management industry and transform financial futures. Jio BlackRock will place the combined strength and scale of both of our companies in the hands of millions of investors in India.&rdquo;</p>\n\nBlackRock Makes Waves\n<p>The assets manager recently made headlines when it announced it had applied to a Bitcoin spot exchange-traded fund (ETF). If the SEC approves it, BlackRock&rsquo;s iShares ETF will become the first crypto spot ETF in the US. The firm is, however, facing obstacles in the form of the SEC, and was forced to refile its application after the securities agency took issue with it.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T17:47:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T17:45:00.000Z",
    "title": "AI Revolutionizes Adverse Media Screening, Yet Some Compliance Teams Remain Cautious",
    "url": "https://www.cryptopolitan.com/ai-revolutionizes-adverse-media-screening-yet-some-compliance-teams-remain-cautious/",
    "description": "Adverse media screening is an essential aspect of safeguarding a company&#8217;s reputation, and to achieve this, many organizations are turning to artificial intelligence (AI) solutions. According to a recent survey by cybersecurity firm Ripjar, 71% of companies now utilize AI or machine learning (ML) as a core component in their screening processes. The report, titled ... <a title=\"AI Revolutionizes Adverse Media Screening, Yet Some Compliance Teams Remain Cautious\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-revolutionizes-adverse-media-screening-yet-some-compliance-teams-remain-cautious/\" aria-label=\"More on AI Revolutionizes Adverse Media Screening, Yet Some Compliance Teams Remain Cautious\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-27T18:01:29.000Z",
    "title": "Scammers hack Twitter portal using stolen Italian government emails",
    "url": "https://crypto.news/scammers-hack-twitter-portal-using-stolen-italian-government-emails/",
    "description": "Crypto scammers recently accessed Twitter’s Legal Request portal using stolen Italian government emails"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-27T17:49:07.000Z",
    "title": "VET and ADA holders explore Tradecurve, TCRV is bullish",
    "url": "https://crypto.news/vet-and-ada-holders-explore-tradecurve-tcrv-is-bullish/",
    "description": "VeChain (VET) and Cardano (ADA) investors appear to be redirecting their focus on Tradecurve (TCRV), a new crypto project"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-27T18:00:25.000Z",
    "title": "Solana (SOL) Records Positive Moves As Bears Took Control, What’s Pushing It?",
    "url": "https://www.newsbtc.com/news/solana/solana-sol-records-positive-moves-as-bears-took-control-whats-pushing-it/",
    "description": "The crypto market witnessed heightened volatility last week, with most coins observing steep declines. However, today, June 27, the market has registered a slight recovery as most coins posted a few gains, but SOL&#8217;s gain is the most notable among all.  Solana&#8217;s native token, SOL, recorded over 3% price growth over the past 24 hours, while others, like Bitcoin, barely crossed 1%, given the significant increase. The Ethereum killer is now number 9 among the top-gaining coins today. However, considering the steep volatility index, whether SOL bulls can sustain today&#8217;s rally remains uncertain. SOL Price Outlook Solana saw bearish days in June after the SEC listed it among tokens labeled as securities in its lawsuit against Binance and Coinbase. SOL’s price nosedived, dropping over 41% between June 3 and June 16. The asset’s price consolidated between $15 and $19 until July.  Related Reading: Shibarium Bridge Goes Live In Beta But There’s A Catch However, SOL reached a monthly high of $29.31 on July 13 after news of Ripple’s win against the US SEC in the multi-year lawsuit circulated throughout the industry.  Although the bearish momentum observed in the last seven days snatched some gains from the asset, its 30-day price movement remains bullish, with over 52% price growth. Solana has lost 2.33% of its market valuation over the past seven days before rebounding with notable gains today. On Thurdsay morning, SOL traded at $25.25, with a 3.71% 24-hour price increase. SOL-Based Investment Funds Skyrockets Following Heightened Regulatory Optimism SOL&#8217;s trading volume has increased in the last 24 hours. On July 26, SOL recorded a 57.07% increase in trading volume. This growth in trading activity suggests increased interest in SOL and SOL-related products. Following Ripple&#8217;s partial victory in the SEC&#8217;s securities lawsuit, Solana-based investment products have received massive attention from investors. According to CCData’s digital asset management review, Solana-based investment funds&#8217; assets under management (AUM) increased in July. The report showed that most of the boost happened on July 14, a day after Judge Torres ruled that XRP token sales on the secondary market are not investment contracts. Judge Torres’ ruling acted as a point of reference to other assets, including SOL, marked as securities by the SEC. CCData’s report stated that the AUM for SOL-based investment products increased by 55.7% to $87.8 million in July. This observation could be attributed to SOL&#8217;s impressive performance over the past month. Solana DeFi Activity On Bullish Recovery Regulatory uncertainty and the FTX fiasco affected the sentiment around Solana-based dApps, dipping further into the Solana DeFi ecosystem.  DeFi Llama data shows that Solana&#8217;s total value Locked (TVL) crumbled from a peak of $9.66 billion in November 2021 to less than $300 million in 2023. But with the partial resolution and the heightened optimism for a clearer regulatory atmosphere, Solana DeFi&#8217;s activities have improved.  Related Reading: Is Arbitrum Promise Fading? Downtime, Metrics Decline Raise ARB Price Alarms As of July 14, SOL TVL hit a yearly peak of approximately $1.1 billion before retracing to $313.9 million. A close look at the chart shows SOL TVL has witnessed a slight increase and now stands at $316 million.  Chances that SOL will see a more bullish rebound following a total resolution of ongoing regulatory issues are high. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-27T18:00:01.000Z",
    "title": "Bitcoin (BTC) Hovers Around $30K, Borroe (ROE) AI NFT Marketplace Takes the Crypto World by Storm",
    "url": "https://www.crypto-news-flash.com/bitcoin-btc-hovers-around-30k-borroe-roe-ai-nft-marketplace-takes-the-crypto-world-by-storm/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-btc-hovers-around-30k-borroe-roe-ai-nft-marketplace-takes-the-crypto-world-by-storm",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T182418.718.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T182418.718.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T182418.718-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T182418.718-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T182418.718-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T182418.718-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the ever-evolving world of cryptocurrencies, Bitcoin (BTC) remains the central token, with its price continually attracting media attention. Presently hovering around $30,000, Bitcoin faces challenges in establishing a bullish breakout, and impacting the broader crypto market.  However, amidst this turmoil, Borroe (ROE), an emerging star in the crypto space, has captured the attention of [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-27T18:05:24.000Z",
    "title": "Crypto Analyst Breaks Down Bitcoin (BTC), Chainlink (LINK) and Shiba Inu (SHIB) Rival Dogecoin (DOGE)",
    "url": "https://dailyhodl.com/2023/07/27/crypto-analyst-breaks-down-bitcoin-btc-chainlink-link-and-shiba-inu-shib-rival-dogecoin-doge/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/Trader-Explores-Bouncing-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/Trader-Explores-Bouncing-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/Trader-Explores-Bouncing-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/Trader-Explores-Bouncing-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/Trader-Explores-Bouncing-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/Trader-Explores-Bouncing-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/Trader-Explores-Bouncing-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader believes that today and tomorrow&#8217;s price action for Bitcoin (BTC) are of major importance. Crypto analyst Michaël van de Poppe tells his 661,300 Twitter followers that BTC&#8217;s price action will be determined by the US&#8217;s personal consumption expenditure (PCE) and gross domestic product (GDP) numbers, both released today. &#8220;Bitcoin rejects at [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/27/crypto-analyst-breaks-down-bitcoin-btc-chainlink-link-and-shiba-inu-shib-rival-dogecoin-doge/\">Crypto Analyst Breaks Down Bitcoin (BTC), Chainlink (LINK) and Shiba Inu (SHIB) Rival Dogecoin (DOGE)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]