[
  {
    "source": "CoinDesk",
    "date": "2023-07-19T10:00:00.000Z",
    "title": "GOP Lawmakers Suggest Gensler's SEC Is Gaming News Cycle to Thwart Crypto Legislation",
    "url": "https://www.coindesk.com/policy/2023/07/19/gop-lawmakers-suggest-genslers-sec-is-gaming-news-cycle-to-thwart-crypto-legislation/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Recent actions by the regulator seem to have been timed to coincide with Congressional grandstanding, Reps. French Hill and Dusty Johnson wrote."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-19T09:46:35.000Z",
    "title": "XRP Futures Set Open Interest Record High for 2023",
    "url": "https://www.coindesk.com/markets/2023/07/19/xrp-futures-set-open-interest-record-high-for-2023/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Open interest on XRP-based futures contracts crossed the $1.1 billion mark in the past 24 hours."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-19T10:06:02.000Z",
    "title": "XRP Gains 6% on Possible SEC Settlement Conference, Ripple Metaverse Investment",
    "url": "https://decrypt.co/149118/xrp-gains-6-on-possible-sec-settlement-conference-ripple-metaverse-investment",
    "description": "XRP outperforms the crypto market as hopes of settlement with the SEC and metaverse investment boost buyer sentiments."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-19T09:58:20.000Z",
    "title": "It’s only a matter of time for bitcoin",
    "url": "https://cryptodaily.co.uk/2023/07/its-only-a-matter-of-time-for-bitcoin",
    "description": "<p>The writing is on the wall. Bitcoin ETFs are queued at the SEC and it is now just a matter of time before bitcoin explodes higher.</p>\nSEC Gensler in a tough place\n<p>The anti-crypto chairman of the SEC, Gary Gensler, is in between a rock and a hard place. He has the biggest asset management company in the world (Blackrock) as well as several other financial giants, awaiting his decision.</p>\n<p>To buy himself time Gensler could put his decision back as much as 240 days, but the chances of the environment changing as far as granting a Spot Bitcoin ETF would likely be very small.</p>\n<p>The SEC chair could continue to back himself and just turn the ETF applications down en masse. However, he is really running out of grounds for doing so, and the political pressure he must already be facing would ratchet up to insufferable levels.</p>\nPoor SEC decisions\n<p>Gensler would need to be a man of iron in order to continue steering his anti-crypto course, but his performances so far do not indicate that he has the backbone to do this.</p>\n<p>Under his leadership the SEC has changed from its role as cop on the beat, that makes sure markets run smoothly, and that investors have proper protections, into a vehicle that is carrying out a hostile crusade against the crypto industry.</p>\n<p>Gensler&rsquo;s decision to attack Coinbase now seems to have been a very poorly judged move, especially in the light of the recent SEC/Ripple case court decision that ruled that secondary sales of XRP on exchanges did not constitute the transaction of a security.</p>\n<p>Therefore, continuing to spend millions of taxpayer dollars on trying to bring Coinbase down, a company that is seen to have made every effort to be compliant, looks to be folly, and might be regarded as the SEC making a perverse effort to destroy all the crypto exchanges in order to prevent retail investors from using them.</p>\nA power that transcends government\n<p>It might very well be argued that it&rsquo;s not just Gensler using the SEC as an armament against crypto. The decision to bring crypto down may well have come from much higher up, and possibly from the very highest echelon.&nbsp;</p>\n<p>However, there is still one power in the US that continues to transcend politics and government, and that is the power of money, and this comes in the form of institutional companies that own a piece of just about everything. Blackrock is the company at the pinnacle of all of them, and it will have the inside contacts and the resources to get what it wants, and that is a Spot Bitcoin ETF.</p>\n<p>Whether it&rsquo;s good that such a company should have its fingers inside the Bitcoin pie is another thing, but given that Bitcoin is for everyone, those who are able to fully understand it and invest in it first will be those who profit the most.</p>\nJust a matter of time\n<p>Therefore, it is just a matter of time now before an ETF is granted and bitcoin is shot skywards on a wave of institutional buying. And if the SEC wins the day and somehow comes up with a reason for not approving an ETF, the institutions will still find a way to eventually get the job done.</p>\n<p>That Bitcoin has begun its bull market there can be little doubt. Institutions or no institutions, if 75% of BTC holders are not selling, and with the halving approaching next year, bitcoin will still do its thing.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T09:41:15.000Z",
    "title": "Robert F. Kennedy Jr. plans to back the dollar with Bitcoin if elected as president in 2024",
    "url": "https://www.cryptopolitan.com/kennedy-jr-plans-to-back-dollar-with-bitcoin/",
    "description": "Robert F. Kennedy Jr. has shared his vision to progressively back the US dollar with Bitcoin if he is elected president. RFK Jr. asserted in a speech at a Heal-the-Divide PAC event on July 19 that supporting the dollar with what he said was &#8220;hard currency,&#8221; such as gold, silver, platinum, or Bitcoin, may assist ... <a title=\"Robert F. Kennedy Jr. plans to back the dollar with Bitcoin if elected as president in 2024\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kennedy-jr-plans-to-back-dollar-with-bitcoin/\" aria-label=\"More on Robert F. Kennedy Jr. plans to back the dollar with Bitcoin if elected as president in 2024\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-19T09:56:00.000Z",
    "title": "USDT market cap rises, USDC declines",
    "url": "https://crypto.news/usdt-market-cap-rises-usdc-declines/",
    "description": "In recent months, the market capitalization of tether (USDT) has experienced a remarkable increase, closely mirroring the surge in bitcoin&#8217;s (BTC) price. Conversely, its counterpart, USD Coin (USDC), has encountered a substantial decline in market cap.  Simona, a market analyst&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-19T10:00:38.000Z",
    "title": "Unleashing the Power of Blockchain in the World of EdTech with TinyTap",
    "url": "https://www.crypto-news-flash.com/unleashing-the-power-of-blockchain-in-the-world-of-edtech-with-tinytap/?utm_source=rss&utm_medium=rss&utm_campaign=unleashing-the-power-of-blockchain-in-the-world-of-edtech-with-tinytap",
    "description": "<img width=\"512\" height=\"307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T122617.839.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T122617.839.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T122617.839-300x180.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T122617.839-336x200.png 336w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The emergence of blockchain and Web3 technologies has heralded a new era in education, transitioning from traditional systems to decentralized, learner-centric models. These technologies have revolutionized the storage, verification, and sharing of educational records, thereby opening new avenues for personalized learning, peer-to-peer interactions, and content monetization. Moreover, this transformation has also led to a more [...]"
  }
]