[
  {
    "source": "Decrypt",
    "date": "2023-06-07T22:51:17.000Z",
    "title": "The SEC Has Not Labeled Any Proof-of-Work Asset as a Security—Why Is That?",
    "url": "https://decrypt.co/143760/why-has-the-sec-not-labeled-any-proof-of-work-asset-as-a-security",
    "description": "The agency has focused on Proof-of-Stake coins, leaving Bitcoin and other Proof-of-Work blockchains unfazed by the current regulatory push. "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-07T22:52:37.000Z",
    "title": "Coinbase has no plans to delist assets or end staking service",
    "url": "https://cryptoslate.com/coinbase-has-no-plans-to-delist-assets-or-end-staking-service/",
    "description": "<p>Coinbase executives have stated that their company does not intend to end support for tokens and services named in a securities case. Coinbase doesn&#8217;t intend to reduce options The U.S. Securities and Exchange Commission (SEC) filed charges against Coinbase on June 6. It identified at least 13 of the cryptocurrencies listed by Coinbase, as well [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinbase-has-no-plans-to-delist-assets-or-end-staking-service/\">Coinbase has no plans to delist assets or end staking service</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-07T22:50:00.000Z",
    "title": "Bitcoin ($BTC) Whales ‘Aggressively’ Accumulating While Smaller Holders Divest of Their Holdings",
    "url": "https://www.cryptoglobe.com/latest/2023/06/bitcoin-btc-whales-aggressively-accumulating-while-smaller-holders-divest-of-their-holdings/",
    "description": "Bitcoin ($BTC) has been witnessing a significant accumulation trend over the past six weeks, predominantly from non-exchange owners of the currency who possess substantial holdings, meaning Bitcoin whales with more than 10,000 BTC in their wallets. According to cryptocurrency analytics firm Glassnode, non-exchange Bitcoin whales holdings more than $265 million in the flagship cryptocurrency have […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-07T23:00:03.000Z",
    "title": "Cardano (ADA) Declines As Market Recovers Amid Security Charges",
    "url": "https://www.newsbtc.com/news/cardano/cardano-ada-declines-as-market-recovers-amid-security-charges/",
    "description": "Cardano (ADA) has emerged as one of the worst performers over the last day despite the rest of the market seeing some upside. This can be attributed to the security charges from the United States Securities and Exchange Commission (SEC), a classification that has loomed heavy over staking tokens in the last year. Cardano Foundation Deny Security Claims In the SEC lawsuits that have circulated against crypto exchanges such as Binance and Coinbase this week, the SEC has pointed to some cryptocurrencies as being securities in a bid to nail the exchanges for unregistered securities trading. Related Reading: Not Immune To FUD? Binance Sees $1.5 Billion In Outflows In 24 Hours One of the cryptocurrencies that were named is Cardano, a network that uses a proof of stake mechanism where users stake their native token, ADA, to help secure the network, and earn rewards for it. ADA was named among a list of other tokens including MATIC, BUSD, BNB, FIL, SOL, SAND, ATOM, MANA, COTI, AXS, and ALGO. And despite this already long list, the SEC seems to believe more tokens qualify as securities given the wording of “including but not limited to.” In light of this recent classification by the SEC, the Cardano Foundation has come forward to contest the regulator’s claims. In a tweet on its official page, the foundation expressed its disagreement with this classification and said it looked forward to working with regulators. “The Cardano Foundation disagrees with the recent qualification of ADA as a security under US law. We look forward to the continued engagement with regulators and policymakers to achieve legal clarity and certainty on these matters,” the Foundation said. ADA price falls to $0.33 &#124; Source: ADAUSD on TradingView.com ADA Continues To Struggle Despite the Cardano Foundation taking to Twitter to debunk the SEC’s claims of ADA being a security, the coin has not fared well in the market. While the general market is on a recovery trend with Bitcoin moving back above $26,000, ADA has remained stagnant. Out of the top 10 largest cryptocurrencies by market cap, ADA is currently the worst performer of the bunch. Where Bitcoin and Ethereum are seeing an upside of around 3% at this time, Cardano’s token is nursing 3.6% losses. Its performance is even worse on the weekly chart with 9% losses in seven days. Related Reading: Galaxy Digital CEO Mike Novogratz Says This Will Kickstart The Bitcoin Bull Market ADA’s performance is not out of the ordinary as such a classification has put selling pressure on the digital asset. Investors are understandably moving to remove some of their holdings for fear of further legal action from the SEC. However, there has been no indication of what the regulator plans to do against the digital assets it classified as securities. At the time of writing, ADA is changing hands at a price of $0.3406, bringing its total market cap to $11.89 billion. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]