[
  {
    "source": "CoinDesk",
    "date": "2023-10-31T15:57:01.000Z",
    "title": "BlackRock's Bitcoin ETF Might Have Trading Support of Heavyweights Like Jane Street, Jump and Virtu: Source",
    "url": "https://www.coindesk.com/business/2023/10/31/blackrocks-bitcoin-etf-might-have-trading-support-of-heavyweights-like-jane-street-jump-and-virtu-source/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Amid the crypto crackdown, a BTC ETF, if approved, would open a new pathway for U.S.-based firms to get a piece of the crypto action – in a way that plays to their conventional strengths."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-31T16:00:00.000Z",
    "title": "NFT projects: Keep your community engaged with these 12 tips",
    "url": "http://cointelegraph.com/innovation-circle/nft-projects-keep-your-community-engaged-with-these-12-tips",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/dcd9d147-4bee-4743-9046-d7655f03b0c9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>An engaged, loyal community is an essential ingredient in the long-term success of an NFT project.</p>\n                    <p><p>The members of a community of any type want to feel like they’re involved, connected and part of something that’s genuinely unique and valuable. That’s certainly true of the communities that support nonfungible token projects. </p> <p>And it’s not just about a “warm and fuzzy” feeling. A healthy, engaged community can not only provide valuable feedback and long-term investors for NFT project leaders, but its members can also generate buzz, leading to increased demand and, optimally, driving up the value of their investments. Through their own initiatives, they can even grow the project’s ecosystem.</p> <p>Without a doubt, creative and conscientious NFT project leaders who work to foster an enthusiastic community can create a circle of mutual, ongoing benefit. Below, 12 members of <a href=\"https://circle.cointelegraph.com/?_ga=2.198681135.1484442309.1667485998-1927108766.1652715111\">Cointelegraph Innovation Circle</a> share practical, effective tips to help NFT project leaders launch strong, build an engaged community, and grow and prosper together.</p> <h2>Strive for a genuine emotional pull</h2> <p>We are in a bear market that’s being driven by a period of low liquidity. Try to ensure that your NFTs really have an emotional pull and are not simply cash grabs. You can tell when an artist has spent many hours making a real piece of art, versus something that’s been whipped up quickly and hyped up. Obvious cash grabs will quickly fall by the wayside. – <a href=\"https://circle.cointelegraph.com/u/008ee5ae-3d26-4c82-a558-db3e57e4c769\">Zain Jaffer</a>, <a href=\"http://www.zain-ventures.com\">Zain Ventures</a></p> <h2>Ensure continuous engagement</h2> <p>For NFT projects, continuous engagement is key. Offer exclusive content, host community events and solicit feedback for project direction. Authenticity and consistent communication build trust and keep your community invested in the project’s long-term vision. – <a href=\"https://circle.cointelegraph.com/u/0d167285-44f8-41a6-9001-72aab6b4058d\">Tomer Warschauer Nuni</a>, <a href=\"http://www.kryptomon.co\">Kryptomon</a></p> <h2>Bring on active and talented community managers</h2> <p>Ensure your community managers have good people skills, that they clearly understand the mission and vision of your NFT project, and that they consistently engage with community members. While bots can be useful, they also take away from the humanity of interaction. Remember, the attention of members is fragile and needs constant nurturing. – <a href=\"https://circle.cointelegraph.com/u/d44c746c-442d-4c14-bb46-c229b457455a\">Irina Litchfield</a>, <a href=\"https://www.lumeria.io/\">Lumeria</a></p> <h2>Give holders a say in the decisions you make</h2> <p>It’s one thing to have regular communication with your community, but in order to keep them engaged today, you also have to provide value from day one. That means token governance. Ensure that NFT holders feel like they have a hand in the decisions you make, whether via voting or some other way. NFTs are not governance tokens, but this does not preclude you from taking your communities into consideration. – <a href=\"https://circle.cointelegraph.com/u/e7c3b482-7235-41b4-a853-23df3d932ab9\">Jason Fernandes</a>, <a href=\"http://adlunam.cc\">AdLunam Inc.</a></p> <h2>Develop creative and unique experiences</h2> <p>Imagine hosting a “digital masquerade ball.” Members don unique NFT masks, tokens of their digital identity. Through games, tales and auctions, these masks evolve into symbols of participation, fostering continuous interaction. Like a dance in a pixelated ballroom, NFT community engagement thrives on rhythmic creativity and unique experiences. – <a href=\"https://circle.cointelegraph.com/u/8179044f-5f09-469d-8c72-d17fd6274257\">Arvin Khamseh</a>, <a href=\"http://soldoutnfts.io\">SOLDOUT NFTs</a></p> <h2>Showcase the hard work behind the scenes</h2> <p>Balance short-term milestones with long-term objectives. NFT projects should leverage smaller achievements by sharing them with their communities in between major updates. Even if the news is not always groundbreaking, consistent communication keeps users engaged while showcasing some of the hard work that is happening behind the scenes. – <a href=\"https://circle.cointelegraph.com/u/abc0e9e1-b580-49da-b9fb-105caa752b79\">Wolfgang Rückerl</a>, <a href=\"https://entity.global\">ENT Technologies AG</a></p> <h2>Set up features that can be unlocked over time</h2> <p>Value creation. Don’t just sell a digital asset; offer an experience. Use smart contracts to enable features — like exclusive content, voting rights or even revenue-sharing — that can be unlocked over time or based on specific conditions. Keep the community involved in decision-making processes, and always be transparent about your roadmap. The NFT is not the end; it’s the beginning of a relationship. – <a href=\"https://circle.cointelegraph.com/u/16cde551-5395-4ca9-8281-7152cbb88396\">Tiago Serôdio</a>, <a href=\"https://www.partisiablockchain.com/\">Partisia Blockchain</a></p> <h2>Consistently deliver value</h2> <p>Build and foster a vibrant and inclusive community by consistently delivering value, engaging in open communication and involving the community in decision-making processes to create a sense of ownership and belonging. It’s important to properly and effectively share ecosystem updates and announcements so as to not mislead the community. – <a href=\"https://circle.cointelegraph.com/u/5cae7f29-8588-4852-bb31-c66fd1d805c6\">Anthony Georgiades</a>, <a href=\"https://pastel.network/\">Pastel Network</a></p> <h2>Foster an inclusive environment</h2> <p>For NFT projects, the key is to continuously offer value beyond the initial purchase. Regularly release exclusive content, host community events and actively seek feedback. Prioritize transparency in project developments, and foster an inclusive environment where community members feel valued and heard. Remember, an engaged community is built on trust, consistent interaction and shared growth. – <a href=\"https://circle.cointelegraph.com/u/d720a7cd-d784-46d6-9998-f4df393114ab\">Erki Koldits</a>, <a href=\"https://www.popspot.com\">OÜ Popspot</a></p> <h2>Notify members about developments and prices</h2> <p>NFT communities need updates on the latest developments that have taken place, or are going to take place, in their project of interest. Since most of the community members will have bought and hold multiple NFTs from the same project, they will want to receive a few price predictions about their assets. Also, free giveaways help a lot in keeping the community engaged. – <a href=\"https://circle.cointelegraph.com/u/1d9f8b61-2e77-4452-a837-4db4245d01ca\">Abhishek Singh</a>, <a href=\"http://acknoledger.com/\">Acknoledger</a></p> <h2>Share real-time updates and engage on social media</h2> <p>It’s important to maintain consistent communication with your community. There have been many rug pulls with past NFT projects, so sharing real-time updates on project developments, partnerships and news is key. Engage regularly on social media and Discord to keep members feeling involved and to address their concerns. Show that you’re listening to feedback, and implement their ideas when possible. – <a href=\"https://circle.cointelegraph.com/u/1bff9b74-7b61-4788-a1c8-203b31439d85\">Ayelet Noff</a>, <a href=\"https://slicedbrand.com/\">SlicedBrand</a></p> <h2>Communicate both good news and bad</h2> <p>Give clear roadmaps of both the good and the bad. If something initially planned is not scheduled to happen anymore (or vice versa), be upfront. Constant communication is critical for projects in the Web3 space in general, as we all learn and grow together. – <a href=\"https://circle.cointelegraph.com/u/84007b98-8c0e-4c02-8807-ff7876b7765d\">Megan Nyvold</a>, <a href=\"http://bingx.com/en-us/\">BingX</a></p> <hr class=\"wp-block-separator\" /> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-31T16:00:55.000Z",
    "title": "Bitcoin vs. Gold: Mapping current trends onto historical data",
    "url": "https://cryptoslate.com/insights/bitcoin-vs-gold-mapping-current-trends-onto-historical-data/",
    "description": "<p>Quick Take A compelling trend has emerged in the financial world, with gold recently closing above $2,000, a threshold it first surpassed earlier this year in April. Over the last five years, gold has consistently outperformed the S&#38;P 500, delivering a return of 62% compared to the S&#38;P&#8217;s 53%. Currently, both are recording year-to-date increases [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-vs-gold-mapping-current-trends-onto-historical-data/\">Bitcoin vs. Gold: Mapping current trends onto historical data</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-31T15:55:01.000Z",
    "title": "SBF’s defense claims FTX had no fiduciary relationship with customers on technicality",
    "url": "https://cryptoslate.com/sbfs-defense-claims-ftx-had-no-fiduciary-relationship-with-customers-on-technicality/",
    "description": "<p>Sam Bankman-Fried&#8216;s defense team has filed a request to include jury instructions that ask the jury to consider the influence of English law on FTX&#8217;s terms of service. In an unusual request, Bankman-Fried&#8217;s legal team has asked the court to reject the idea that FTX and its customers technically had any fiduciary relationship on the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sbfs-defense-claims-ftx-had-no-fiduciary-relationship-with-customers-on-technicality/\">SBF&#8217;s defense claims FTX had no fiduciary relationship with customers on technicality</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-31T15:49:53.000Z",
    "title": "Vitalik Buterin publishes article discussing dimensions of connectedness to Ethereum",
    "url": "https://crypto.news/vitalik-buterin-publishes-article-discussing-dimensions-of-connectedness-to-ethereum/",
    "description": "On Oct. 31, the Ethereum co-founder released an article highlighting the dimensions of connectedness to the blockchain network as being the security of withdrawing to Ethereum and security of reading Ethereum."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-31T16:00:44.000Z",
    "title": "Spot Bitcoin ETF: Here’s The Magic Number To Push BTC Past $40,000",
    "url": "https://www.newsbtc.com/news/bitcoin/spot-bitcoin-etf-magic-number-push-btc-40000/",
    "description": "David Lawant, the head of research for FalconX, an institutional crypto trading platform tailored for financial institutions, recently provided an insightful forecast regarding the future of Bitcoin (BTC) prices in light of the anticipated launch of a spot Bitcoin ETF in the United States. Sharing his predictions via X (previously known as Twitter), he articulated the financial variables that might play a decisive role. Lawant remarked, “The next significant variable to watch in the spot BTC ETF launch saga will be how much AUM these instruments will gather once they launch. I think the market is currently expecting this inflow to be between $500 million and $1.5 billion.” The Magic Number To Push Bitcoin Price Past $40,000 The crypto community is keenly anticipating a positive nod for a Spot Bitcoin ETF either at the end of 2023 or the beginning of 2024. A crucial date on the calendar is January 10, 2024, which is set as the final deadline for the ARK/21 Shares application, leading the current series of applications. Related Reading: Bitcoin Price Could Skyrocket Like In March If This Happens: Expert Undoubtedly, a green signal from regulatory authorities for the spot ETF will be a game-changer for the entire crypto asset class. Lawant highlighted the importance of this development, stating, “It will open room for large pockets of capital that today can’t properly access crypto, such as financial advisors, and bring a stamp of approval from the world&#8217;s most prominent capital markets regulator.” The pressing question, though, is the immediate impact on capital inflow. “The first couple of weeks after launch will be critical to test how much appetite there is for crypto at the moment in these still relatively untapped pools of capital,” Lawant emphasized. Relying on historical data, Lawant pointed out the stability of the ask side of BTC’s order book, especially for prices situated above the $30,000 mark. This data allows for an approximation of how the inflow of capital might influence the price trajectory of BTC. Through various inflow scenarios squared against a spectrum of the depth of market scenarios, Lawant deduces that the market is possibly forecasting net inflows ranging between $500 million and $1.5 billion within the initial weeks post-launch. Drawing conclusions from his analysis, Lawant surmised: For BTC to establish a new range between the current level and more than $40k, the total net inflows would need to amount to $1.5 billion+. On the other hand, if total net inflows come in below $500 million, we could move back to the $30k level or even below. Related Reading: Bitcoin To $3 Million Is “A 100X From Today”, And You Are Still Early: Crypto Advocate However, it’s paramount to note the inherent assumptions in Lawant&#8217;s analysis. He admits, “One is that the move from $28.5k to $34.0k was entirely attributed to the market anticipating price-insensitive net inflows from the ETF launch.” This means, among other things, that the current price increase was triggered neither by the correlation with gold nor by the global crises or turmoil in the bond market. Lawant also highlighted the potential variability in BTC price movement across the order book. Nonetheless, given the stature of issuers like BlackRock, Fidelity, Invesco, and Ark Invest in the SEC queue, the current favorable macroeconomic climate for alternative monetary assets, and prospective improved liquidity conditions, Lawant remains bullish about the potential BTC price rally following the ETF debut. He concluded with, “ceteris paribus I’m still excited about how the BTC price could react to the ETF launch.” At press time, BTC traded at $34,542. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-31T16:03:08.000Z",
    "title": "Valkyrie Amends Bitcoin ETF Application",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/valkyrie-amends-bitcoin-etf-application/",
    "description": "<p>Valkyrie Investments has amended its spot Bitcoin ETF application with the SEC.  The updated filing seeks to provide investors with a chance to invest in common shares backed by Bitcoin. Let&#8217;s explore more about this important announcement. Valkyrie Joins the Bitcoin ETF Bandwagon The shares are scheduled to be traded on the Nasdaq Stock Market [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/valkyrie-amends-bitcoin-etf-application/\">Valkyrie Amends Bitcoin ETF Application</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]