[
  {
    "source": "Decrypt",
    "date": "2023-10-04T22:47:02.000Z",
    "title": "Is Polygon in Trouble? Another Executive Departs Amid Crypto Market Downturn",
    "url": "https://decrypt.co/200194/polygon-in-trouble-executive-departures",
    "description": "The co-founder's exit extends a long list of similar departures from prominent crypto projects in 2023. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-04T23:00:51.000Z",
    "title": "Crypto Investor Buying Power Just Reached A 6-Month High, What This Means",
    "url": "https://www.newsbtc.com/crypto/crypto-investor-buying-power/",
    "description": "For the crypto market to fully enter another epic bull run, investors must be willing to purchase digital assets in large quantities. After a long stretch of abysmal performance, it looks like crypto investors are finally starting to believe in the market as they begin to pool their buying power to enter back into the market. Crypto Buying Power At 6-Month Highs An interesting development reported by the on-chain data tracker Santiment is the accumulation of Tether’s USDT stablecoin by crypto investors. As Santiment points out, the total amount of USDT being held on exchanges saw a notable uptick recently. Related Reading: Why You Should Pay Attention To The XRP Price Predictions The figure which takes into account the total USDT held across the top exchanges went from only 17.6% of the stablecoin’s circulating supply to a whopping 24.7%. This 7.1% jump represents the growing interest of investors to get back into the market which could be bullish for prices. As always, the large whales led the charge in this accumulation trend. The top 10 largest wallets saw their combined holdings rise from $7.23 billion to more than $9.42 billion in the same timeframe. Stablecoin on exchanges reach 6-month highs &#124; Source: Santiment on X Now, when investors start upping their stablecoin holdings, it signals a readiness to begin buying digital assets once more and also shows the current buying power. As the amount of USDT held on exchanges has crossed over to a 6-month high, it could point toward the start of the largest rally seen in the market in 2023. The accumulation being spread across large and small wallets alike shows that this is not a localized sentiment. Rather, most investors are seeing genuine chances for an upside and are looking to harness some of those gains for themselves. Total market cap drops to $1.06 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com What To Expect After accumulating a large tranche of stablecoins as illustrated in the Santiment report, crypto investors would often wait for a good time to deploy it. This is usually when the market experiences a notable crash, plunging the entire space into the red. At this point, investors would be looking to get back into coins at a time when they look to be on discount. This is often when the market forms support and then prices begin to surge not too long afterward. Related Reading: Brace For Impact As $200 Million In Crypto Is Being Unlocked In October Mainly, these stablecoins will be deployed into the largest digital assets first such as Bitcoin (BTC) and Ethereum (ETH). Then once there are enough profits, investors will usually rotate into smaller cap coins, which is why altcoins tend to delay a bit in following Bitcoin’s recovery. Such a scenario will likely see the price of Bitcoin rally toward $29,000 and then bring the crypto market cap above $1.1 trillion once more. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from E-Commerce Times, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-04T23:07:00.000Z",
    "title": "SEC vs XRP: Judge Torres Rejects Comparison to Terraform and LBRY",
    "url": "https://coinedition.com/sec-vs-xrp-judge-torres-rejects-comparison-to-terraform-and-lbry/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Arch_rivals_XRP_and_the_SEC_are_set_for_an_epic_showdown.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SEC vs XRP: Judge Torres Rejects Comparison to Terraform and LBRY\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Arch_rivals_XRP_and_the_SEC_are_set_for_an_epic_showdown.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Arch_rivals_XRP_and_the_SEC_are_set_for_an_epic_showdown-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Arch_rivals_XRP_and_the_SEC_are_set_for_an_epic_showdown-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Arch_rivals_XRP_and_the_SEC_are_set_for_an_epic_showdown-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Arch_rivals_XRP_and_the_SEC_are_set_for_an_epic_showdown-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto influencer sheds light on Judge Torres&#8217; perspective regarding the SEC&#8217;s argument in the XRP case. The SEC&#8217;s attempt to compare the XRP case to Terraform and LBRY faced scrutiny from the court. The court rejected the SEC&#8217;s motion for an interlocutory appeal in its case against Ripple. Crypto influencer Ashley Prosper highlighted Judge Torres&#8217; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sec-vs-xrp-judge-torres-rejects-comparison-to-terraform-and-lbry/\">SEC vs XRP: Judge Torres Rejects Comparison to Terraform and LBRY</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]