[
  {
    "source": "CoinDesk",
    "date": "2023-06-21T08:00:00.000Z",
    "title": "Digital Euro: The Bill Is Ready but Politicians Aren’t Convinced",
    "url": "https://www.coindesk.com/policy/2023/06/21/digital-euro-the-bill-is-ready-but-politicians-arent-convinced/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A plan to legislate for the central bank digital currency may still be on track for publication, but there is still significant political skepticism about the purpose."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-21T07:58:57.000Z",
    "title": "Cardano, Ether Surge as Bitcoin-Led Rally Sees Short Traders Lose $125M",
    "url": "https://www.coindesk.com/markets/2023/06/21/cardano-ether-surge-as-bitcoin-led-rally-sees-short-traders-lose-125m/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto market capitalization rose 5% likely as sentiment rose on the back of two institutional bitcoin plays in the past week."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T07:45:00.000Z",
    "title": "Flashbots Co-Founder Warns Of Challenges In Departure Letter",
    "url": "https://cryptodaily.co.uk/2023/06/flashbots-co-founder-warns-of-challenges-in-departure-letter",
    "description": "<p>Co-founder of Ethereum infrastructure service Flashbots Alex Obadia has warned of serious challenges ahead for the company in a farewell letter posted on his Twitter handle.&nbsp;</p>\n<p>Obadia&rsquo;s departure comes amidst sweeping personnel changes at Flashbots as the company looks to raise funds at a valuation of $1 billion.&nbsp;</p>\nSerious Challenges Ahead&nbsp;\n<p>Flashbots was founded to counter the negative consequences of MEV extraction techniques on Ethereum. Alex Obadia, one of the company&rsquo;s co-founders and co-lead of the strategy division, announced his departure from the Paradigm-backed company. In a farewell letter posted on Twitter, Obadia offered his thanks and gratitude towards the company, along with the friendships built and lessons learned. However, he also used the letter to warn of serious challenges that lay ahead for the company. In the letter, Obadia stated that the system Flashbots was designed to protect was still vulnerable to centralization.&nbsp;</p>\n\n<p>&ldquo;The system we committed to protect is still vulnerable to centralization from phenomena such as cross-domain MEV and exclusive order flow. To top it off, as we&rsquo;ve grown into an incumbent, we now also need to protect the system against ourselves to avoid becoming the very Moloch we&rsquo;re fighting against.&rdquo;</p>\n\n<p>Obadia was one of the earliest employees at Flashbot after it was founded in 2020 and held the formal title of &ldquo;founding steward&rdquo; of the company. However, he did not dwell on the reason why he was leaving the company, stating,&nbsp;</p>\n\n<p>&ldquo;I leave for multiple reasons, some more personal than others, but really what it boils down to is that I feel my vision and values will be better served somewhere else. We&rsquo;ve often had differing opinions within leadership, and that has been part of our strength. However, I believe we will now achieve better results going our separate ways.&rdquo;</p>\n\n<p>A Flashbots representative thanked Obadia for his contributions towards the company, Flashbots ecosystem, and the crypto industry in general. Obadia has suggested that he is open to collaborating with Flashbots in the future.&nbsp;</p>\nA Fund Raise In The Works&nbsp;\n<p>Flashbots creates software that facilitates the extraction of MEV or Maximal Extractable Value, which is extra profit that can be earned by strategically ordering how the transactions are organized into blocks that are written to the blockchain&rsquo;s ledger. Flashbot&rsquo;s MEV-Boost middleware is used by nearly all validators that help in Ethereum operations. Furthermore, the upcoming SUAVE network also aims to offer similar MEV-extracting functionality to other major blockchains.&nbsp;</p>\n<p>Flashbots is also on the verge of announcing a Series B funding round. The round will reportedly value the firm at $1 billion. It will help secure funding for MEV research and development as Flashbots works towards the launch of SUAVE and their vision to democratize and distribute MEV to other blockchains.&nbsp;</p>\nSweeping Personnel Changes\n<p>With the impending Series B funding round looming, Flashbots has also seen significant personnel changes. One of the most high-profile new hires is Andrew Miller. Miller joins the Flashbots team as a research lead and will work on Trusted Execution Environments and SUAVE. Miller is also well known for being one of the researchers who successfully broke Intel&rsquo;s SGX code. This required a significant and massive overhaul of the secret blockchain and had security ramifications far beyond the crypto ecosystem.&nbsp;</p>\n<p>Miller has also been working as the associate director of the Initiative for Cryptocurrencies and Contracts (IC3). He is also the assistant professor of electrical and computer engineering at the University of Illinois, Urbana-Champaign, from where he will be taking a leave of absence as he gears up to take his new role with Flashbots. Other prominent hires joining Flashbots are Daniel Marzec, an engineer at Blocknative, another major MEV industry player, and Danning Sui, formerly the head of data science at the decentralized finance (DeFi) firm 0x. Marzec will be joining Flashbots as a research engineer, while Sui will lead the Flashbots&rsquo; data science team.&nbsp;</p>\n<p>So far, Flashbots has added 13 new team members over the past six months, taking the total size of the team to over 50. A representative for Flashbots stated,&nbsp;</p>\n\n<p>&ldquo;Flashbots is working closer towards its goal to illuminate, democratize and distribute the dark forest.&rdquo;</p>\n\n<p>Dark Forest refers to the competition between different blockchain players to squeeze out MEV.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-21T07:50:16.000Z",
    "title": "Asset manager WisdomTree files bitcoin ETF application",
    "url": "https://crypto.news/asset-manager-wisdomtree-files-bitcoin-etf-application/",
    "description": "WisdomTree Investments, a well-known US asset manager, has swiftly applied for a new ETF focused on bitcoin. This follows closely after BlackRock&#8217;s similar move. WisdomTree has submitted its application to the US Securities and Exchanges Commission (SEC) during a critical&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-21T07:42:06.000Z",
    "title": "TrueUSD halts USD attestations amid balance discrepancies",
    "url": "https://crypto.news/trueusd-halts-usd-attestations-amid-balance-discrepancies/",
    "description": "The TrueUSD (TUSD) stablecoin has temporarily paused its automated attestations due to possible balance discrepancies. The stablecoin project also encountered some glitches last week. TrueUSD (TUSD), a US dollar-backed stablecoin project, has encountered a challenge in its attestation process. The&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-21T07:49:16.000Z",
    "title": "ApeCoin Q2 Slump Continues: Is There A Silver Lining Ahead?",
    "url": "https://www.newsbtc.com/news/apecoin-q2-slump-continues/",
    "description": "ApeCoin (APE) has experienced a notable slump throughout the second quarter of this year. As the digital currency landscape continues to evolve, investors and enthusiasts have been closely monitoring the token&#8217;s performance, eagerly awaiting signs of a potential turnaround.  With concerns mounting, many are left wondering: is there a silver lining ahead for ApeCoin, or is it destined to remain trapped in the grips of a prolonged downward trend? Can ApeCoin Bulls Find Strength Amid The Downtrend? In recent months, ApeCoin APE has experienced a significant decline, with its price plummeting by over 55% from its mid-April swing highs of approximately $4.5 to its current value of $2.17 at the time of writing, according to a new APE price report. Related Reading: PEPE Jumps Nearly 10% In 24 Hours, Sparking Speculation Of A New Rally Although the cryptocurrency rallied by 6.4% in the past 24 hours, the 14-day chart reveals a substantial slump of 27.2%. Adding to the bearish sentiment, the trendline resistance has proven to be a formidable obstacle, hindering any potential upside movement. Source: CoinMarketCap Moreover, the Relative Strength Index (RSI) has been exhibiting lower highs since late January, indicating a notable decrease in buying pressure. This decline in demand is further corroborated by the decreasing On Balance Volume (OBV). The convergence of these negative indicators has reinforced the control of sellers and raised the possibility of APE dropping below the $2.0 mark. In fact, there is speculation that the cryptocurrency could potentially reach $1.0, its initial opening price on the Binance exchange. Keeping An Eye On Bitcoin Despite the prevailing downtrend, there is a glimmer of hope for bullish investors as Bitcoin has now rebounded above the $27,000 threshold. At CoinMarketCap, BTC is trading at $28,792.51. ApeCoin price movement in the last seven days. Source: CoinMarketCap Bitcoin&#8217;s price ascent can have an impact on APE&#8217;s price trajectory based on recent data. In fact, it&#8217;s been observed that as Bitcoin price climbs, so do the other crypto assets.  Related Reading: ZachXBT Legal Fight Turns Into Funding Success, Over $1 Million Raised But, the outcome remains uncertain, leaving many to wonder whether ApeCoin can find a ray of hope amidst the prevailing bearish sentiment. Bitcoin showing its resilience at the $28K territory. Chart: TradingView.com Meanwhile, throughout the month of May, APE witnessed an increase in its supply on exchanges, indicating a continued trend of token holders moving their assets to exchanges for the purpose of selling. ApeCoin supply on exchanges and daily active addresses. Source: Santiment This surge in supply has further solidified the control of sellers over APE, exacerbating the downward pressure on the cryptocurrency. On the other hand, there has been a notable decline in the supply of APE outside of exchanges during the same period. This decrease in supply indicates a diminishing interest in APE among investors who are choosing to hold onto their tokens rather than actively trading or selling them. Featured image from Andrew Milligan/AP"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-21T07:45:17.000Z",
    "title": "Bitcoin Hits $138,000 On Binance US, What Happened?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-hits-138000-on-binance-us/",
    "description": "The Bitcoin price has been experiencing a sharp rally since last Thursday, when BlackRock filed its application for a Bitcoin spot ETF. Since hitting its local low of $24,819 right along the Tether FUD, the BTC price has risen by over 16% since the BlackRock news broke. Bitcoin Hits $138,070 On Binance US However, this is in no way an explanation for the following news: Some Binance US users are reporting that the Bitcoin price has hit a whopping price of over $138,000 on the exchange. The popular Twitter account @MikeBurgersburg wrote: &#8220;Lololololol- Bitcoin hit $138,070 on Binance US a little bit ago. Everything ok over there, CZ?&#8221;. The anomaly was also shared by Twitter user @OperationAjax, who posted the screenshot below, writing: &#8220;I think someone broke the moneymaker on @BinanceUS lol. Someone put them on &#8220;UltraWASH Mode&#8221; and sent #BTC/ Tether to $140,000/BTC.&#8221; At press time, neither Binance US nor Binance CEO Changpeng Zhao have commented on the anomaly in the Bitcoin price. Therefore, it can only be speculated what happened. The most likely explanation is an internal data glitch. But, other reasons are also conceivable, such as insufficient liquidity on the exchange, which led to the phenomenal price. As market data provider Kaiko reported yesterday, Binance US trading volumes have plummeted since the beginning of the year. Related Reading: SEC Sues Binance, Coinbase Then BlackRock Files For Bitcoin Spot ETF; Is This An Inside Job? &#8220;The U.S. crypto exchange market is more fraught than ever,&#8221; Kaiko wrote via Twitter, sharing the chart below, which shows that Binance US&#8217;s share of the American market has plummeted from 8% at the start of the year to 1.5% currently. However, against the theory of insufficient liquidity speaks the fact that the price is currently no longer displayed on Binance US. In this respect, a data error seems more likely. Pressure On Binance May Increase Further Meanwhile, pressure on Binance in the US could continue to mount, even though the US Securities and Exchange Commission (SEC) and Binance US reached a tentative agreement last Friday, 16 June, over the threat of an asset freeze. As NewsBTC reported, the proposed measures include restricting Binance officials&#8217; access to private keys and disclosing business expenses. The settlement still needs to be approved by the relevant federal judge. Related Reading: Bitcoin Breaks Out Of Ichimoku Cloud, Storms Toward $28,000 Otherwise, Travis Kling, former equity portfolio manager and senior investment adviser at Ikigai Asset Management, commented via Twitter that there is currently a lot of chatter about the Blackrock Bitcoin ETF, &#8220;and rightfully so.&#8221; However, Kling sees Binance as an obstacle to the ETF, indirectly implying that Operation Choke Point 2.0 is not over yet: One thing I’ll say- there is no chance, and I mean zero, that this ETF is approved with Binance in its current position of market dominance. If this ETF is approved, Binance is either gone entirely or their role in price discovery is massively diminished. If Binance holds on to its current level of influence, no chance this ETF is approved. At press time, the Bitcoin price was at $28,859, breaking the downtrend that persisted since mid-April this year. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T08:06:18.000Z",
    "title": "6 Highly Innovative Projects In The NFT Space",
    "url": "https://www.crypto-news-flash.com/6-highly-innovative-projects-in-the-nft-space/?utm_source=rss&utm_medium=rss&utm_campaign=6-highly-innovative-projects-in-the-nft-space",
    "description": "As the concept of non-fungible tokens continues to evolve, dozens of new startups have emerged to push the boundaries of what’s possible with this innovative new technology. NFTs have the potential to revolutionize the way people collect, trade and monetize digital assets.  NFTs are “non-fungible”, meaning that each and every one is unique and cannot [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T08:02:12.000Z",
    "title": "AvaGPT: Avalanche’s AI Chatbot Revolutionizes User Assistance, Making Avalanche and Core a Breeze to Navigate",
    "url": "https://www.crypto-news-flash.com/avagpt-avalanches-ai-chatbot-revolutionizes-user-assistance-making-avalanche-and-core-a-breeze-to-navigate/?utm_source=rss&utm_medium=rss&utm_campaign=avagpt-avalanches-ai-chatbot-revolutionizes-user-assistance-making-avalanche-and-core-a-breeze-to-navigate",
    "description": "AvaGPT, the first-ever AI chatbot on a crypto web portfolio, is now available for Core web users. With AvaGPT, accessing crucial information about Avalanche and Core products has never been more user-friendly. AvaGPT: The Game-Changing AI Chatbot Enhancing Crypto Web Portfolios Introducing the first-ever AI chatbot to live on a crypto web portfolio: AvaGPT, is [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-21T08:06:25.000Z",
    "title": "MATIC, AVAX, ADA May Hit These Points If Bitcoin Surges Above $29,000",
    "url": "https://coinedition.com/matic-avax-ada-may-hit-these-points-if-bitcoin-surges-above-29000/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Polygon (MATIC), Cardano (ADA), and Avalanche (AVAX) were the biggest gainers out of the top 20 tokens in the last 24 hours. This rise has been possible due to the resurgence of Bitcoin (BTC) over the previous few days. Furthermore, the coin’s return above $25,000 and breaking the $27,500 resistance has pushed it into an [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/matic-avax-ada-may-hit-these-points-if-bitcoin-surges-above-29000/\">MATIC, AVAX, ADA May Hit These Points If Bitcoin Surges Above $29,000</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-21T07:45:21.000Z",
    "title": "Fidelity, Citadel, Schwab Backs EDX Markets’ Crypto Exchange Launch",
    "url": "https://coinedition.com/fidelity-citadel-schwab-backs-edx-markets-crypto-exchange-launch/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/016-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/016-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/016-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/016-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/016-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/016-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/016-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/016-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/016-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/016-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/016-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/016-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/016-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/016-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/016-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/016-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/016-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to the latest reports, on June 20,&#160; the non-custodial cryptocurrency exchange EDX Markets announced its highly-anticipated launch. This event garnered attention from the crypto market, as it coincided with the entry of several traditional financial services firms into the crypto space. This is the second news that has managed to reignite positive sentiments within [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/fidelity-citadel-schwab-backs-edx-markets-crypto-exchange-launch/\">Fidelity, Citadel, Schwab Backs EDX Markets’ Crypto Exchange Launch</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]