[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-27T08:02:59.000Z",
    "title": "Federal Judge agrees to hear Sam Bankman-Fried’s defense against late release of 4 million pages of evidence",
    "url": "https://www.cryptopolitan.com/federal-judge-agrees-to-hear-sam-bankman-frieds-defense/",
    "description": "A federal judge agreed to hear the defense arguments of Sam Bankman-Fried, the former CEO of FTX, against a newly released batch of 4 million pages of evidence. The evidence was provided by the U.S. Department of Justice less than six weeks before Bankman-Fried&#8217;s trial, which is scheduled for October 3, 2023. The defense team ... <a title=\"Federal Judge agrees to hear Sam Bankman-Fried&#8217;s defense against late release of 4 million pages of evidence\" class=\"read-more\" href=\"https://www.cryptopolitan.com/federal-judge-agrees-to-hear-sam-bankman-frieds-defense/\" aria-label=\"More on Federal Judge agrees to hear Sam Bankman-Fried&#8217;s defense against late release of 4 million pages of evidence\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-27T07:54:06.000Z",
    "title": "Is the UK’s £100 Million AI Chip Investment Adequate for Global Tech Rivals?",
    "url": "https://www.cryptopolitan.com/uks-100-million-ai-chip-investment-rivals/",
    "description": "In a bid to solidify its position as a global leader in the AI sector, the United Kingdom recently announced a substantial investment of £100 million (equivalent to $125.8 million) in the acquisition and development of computer chips crucial for artificial intelligence (AI) systems. But, industry experts are raising concerns that this investment might fall ... <a title=\"Is the UK&#8217;s £100 Million AI Chip Investment Adequate for Global Tech Rivals?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uks-100-million-ai-chip-investment-rivals/\" aria-label=\"More on Is the UK&#8217;s £100 Million AI Chip Investment Adequate for Global Tech Rivals?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-27T07:44:46.000Z",
    "title": "Worldcoin Meltdown: 50% Crash Caused By Mounting Data Privacy Paranoia",
    "url": "https://www.newsbtc.com/all/worldcoin-meltdown-50-crash-caused-by-mounting-data-privacy-paranoia/",
    "description": "The Worldcoin cryptocurrency project, led by Sam Altman, the brains behind ChatGPT, is facing increased scrutiny from regulators worldwide. The project&#8217;s use of eye-ball scanning orbs for user enrollment has raised concerns about potential violations of data protection laws. The unique method of collecting biometric data without clear consent has prompted discussions on legality and ethics. Regulatory bodies are closely examining the project&#8217;s compliance with privacy regulations, highlighting the challenges of balancing innovation with legal and ethical standards. The value of biometric investments made through Worldcoin&#8217;s crypto-based &#8220;free money&#8221; promise has decreased by half since its launch. This decline can be attributed to the growing concerns about the project&#8217;s data collection and the unease it caused regulators. Why Is Worldcoin Token Crumbling? Based on information provided by CoinMarketCap, the current trading value of the WLD token stands at $1.28, at the time of writing. This figure signifies a substantial decline of 53% from its initial peak price of $2.71 on the day of the project&#8217;s launch. The day after WLD&#8217;s Binance listing, on July 25, it traded for $2.456. As of Friday morning, the token&#8217;s price had decreased from that time to $1.317. Given that several altcoins and cryptocurrencies recently had market crashes followed by recoveries within a few weeks, this is a big decrease for a token. WLDUSDT trading at $1.286 on the weekend chart: TradingView.com Related Reading: Tron Reverses August Slump As TRX Open Interest Climbs According to data from CoinGecko, the price of WLD has decreased from slightly under $2.50 at the start of August to roughly $1.31 as of August 25. That represents a 44% decline in the previous 30 days, and if it keeps going in the wrong direction, WLD&#8217;s price will go to single digits in the next 30 days. Ongoing investigations by authorities in various countries around the world have dealt a heavy blow to the price of the WLD token. The project&#8217;s goal of establishing decentralized user identities has raised alarm bells because of its eye-ball scanning and biometric data collection. This process potentially breaches national data protection laws, leading to investigations in Germany, France, and the United Kingdom. The Euphoria Quickly Faded Worldcoin reported 2 million sign-ups for World ID and distributed 43 WLD tokens during its launch. Altman promoted iris scanning, but the initial excitement waned. Early scanners received 25 WLD valued at $60, now reduced to around $30. Early investors could have lost half their investment, while short sellers profited from Worldcoin&#8217;s decline. Meanwhile, in the last 30 days, WLD&#8217;s social volume and social dominance have decreased by a whopping 95% and 74%, respectively, according to on-chain data source Santiment. This denotes a sharp decline in the project&#8217;s hype. Source: Santiment Related Reading: Shiba Inu Nears Make-Or-Break Resistance Barrier – What Awaits Traders? Worldcoin&#8217;s original white paper outlined its aspiration to participate in global competition, provide funds to those without financial resources, and offer banking services to those currently without access to traditional banking systems. It appears that ambition will demand more than mere lip service at this point. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Nation Media Group"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-27T08:04:24.000Z",
    "title": "Bitcoin Bears Asking To Be ‘Obliterated’ As BTC Flashes Reversal Signals, According to Crypto Strategist",
    "url": "https://dailyhodl.com/2023/08/27/bitcoin-bears-asking-to-be-obliterated-as-btc-flashes-reversal-signals-according-to-crypto-strategist/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/Nailed-2018-bear-market.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/Nailed-2018-bear-market.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/Nailed-2018-bear-market.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/Nailed-2018-bear-market.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/Nailed-2018-bear-market.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/Nailed-2018-bear-market.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/Nailed-2018-bear-market.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto analyst is issuing a warning to Bitcoin (BTC) bears that the crypto king is showing signs of strength on the daily and weekly charts. Pseudonymous analyst Credible Crypto tells his 346,000 followers on the social media platform X that Bitcoin&#8217;s relative strength index (RSI) is flashing a classic bullish divergence on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/27/bitcoin-bears-asking-to-be-obliterated-as-btc-flashes-reversal-signals-according-to-crypto-strategist/\">Bitcoin Bears Asking To Be ‘Obliterated’ As BTC Flashes Reversal Signals, According to Crypto Strategist</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]