[
  {
    "source": "Cointelegraph",
    "date": "2024-02-26T20:26:14.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">The price of Bitcoin (BTC) rallied amid news that inflows into spot BTC exchange-traded funds (ETFs) continued to rise last week. Alarm bells are ringing as it’s reported that the BitForex exchange has put the brakes on withdrawals and is maintaining radio silence with its customers. Bitcoin-holding firm MicroStrategy’s X account was hacked, leading to scammers posting a phishing link disguised as a fake airdrop. Meanwhile, creditors of defunct crypto hedge fund Three Arrows Capital (3AC) have until March to file their dividend claims.</p><p>The <a href=\"https://cointelegraph.com/news/bitcoin-hits-2-year-high-as-institutional-investors-inflow-nears-600m\">price of Bitcoin</a> rallied sharply on Feb. 26, and approached $55,000 for the first time in more than two years.</p><p>According to data from <a href=\"https://subscription.cointelegraph.com/?_ga=2.127364424.41646327.1708884720-68533732.1612103760&amp;_gl=1*9lwd4v*_ga*Njg1MzM3MzIuMTYxMjEwMzc2MA..*_ga_53R24TEEB1*MTcwODk3Nzg4OC44NjQuMS4xNzA4OTc4NjA1LjAuMC4w\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a>, Bitcoin’s price came within a hair of $55,000, having rallied more than 5% during the day. The largest cryptocurrency by market cap has gained more than 30% over the past month.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-26T20:29:42.000Z",
    "title": "Saudi Arabia launches metaverse platform to commemorate culture on founding day",
    "url": "https://www.cryptopolitan.com/saudi-arabia-launches-metaverse-platform/",
    "description": "The Saudi Arabian Ministry of Culture has launched a pioneering metaverse platform to showcase the nation’s rich cultural heritage. This innovative initiative was unveiled on Saudi Arabia&#8217;s founding day. Bridging the past and future through technology The Cultural Universe metaverse, which went live on Feb. 22, is a digital realm constructed on Oracle’s Hyperledger Fabric [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-26T20:18:52.000Z",
    "title": "NFT sales soar across Ethereum, Solana, and Arbitrum",
    "url": "https://www.cryptopolitan.com/nft-sales-soar-ethereum-solana-and-arbitrum/",
    "description": "In a dynamic turn of events within the non-fungible token (NFT) market, Arbitrum has emerged as a frontrunner, showcasing an impressive 111% surge in NFT sales within the past 24 hours. This surge has not only surpassed its counterparts Ethereum and Solana but has also underscored Arbitrum&#8217;s growing prominence in the NFT ecosystem. Arbitrum&#8217;s astonishing [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-26T20:17:19.000Z",
    "title": "Bitcoin leads digital asset funds in 4th straight week of inflows",
    "url": "https://crypto.news/bitcoin-digital-asset-funds-inflows/",
    "description": "Bitcoin-backed funds from the U.S. ushered most of $598 million in digital asset investment product inflows last week."
  }
]