[
  {
    "source": "Bitcoin.com",
    "date": "2023-10-07T10:30:09.000Z",
    "title": "Bank of Korea and BIS Prepare Wholesale CBDC Pilot",
    "url": "https://news.bitcoin.com/bank-of-korea-and-bis-prepare-wholesale-cbdc-pilot/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2138573115-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bank of Korea and BIS Prepare Tokenization and Wholesale CBDC Pilot\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2138573115-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2138573115-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2138573115-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2138573115-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2138573115-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2138573115-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2138573115.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Bank of Korea and the Bank for International Settlements (BIS) have announced a new pilot that will test the functionality of a Korean wholesale central bank digital currency (CBDC), which will serve as a tool for banks to settle interbank transactions and issue CBDC-backed digital currencies that can be fractionally backed depending on the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-07T10:25:53.000Z",
    "title": "Elon Musk’s X platform faces controversy over XRP account suspension",
    "url": "https://www.cryptopolitan.com/elon-musks-x-platform-faces-controversy/",
    "description": "In a recent turn of events, the proprietor of the renowned social media platform X (formerly known as Twitter), Elon Musk, has come under fire for the suspension of an XRP-related X account.&#160; The account in question, bearing the username @digitalassetbuy, had gained recognition for its outspoken advocacy of the native digital currency of Ripple ... <a title=\"Elon Musk&#8217;s X platform faces controversy over XRP account suspension\" class=\"read-more\" href=\"https://www.cryptopolitan.com/elon-musks-x-platform-faces-controversy/\" aria-label=\"More on Elon Musk&#8217;s X platform faces controversy over XRP account suspension\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-07T10:25:25.000Z",
    "title": "Web3 platform Galxe Protocol experiences DNS attack, Suffers Over $150K in losses",
    "url": "https://www.cryptopolitan.com/web3-platform-galxe-protocol-dns-attack/",
    "description": "In a recent cybersecurity incident, the Web3 platform&#8217;s community forum, Galxe Protocol, fell victim to a malicious attack on its Domain Name System (DNS) records, resulting in significant financial losses. The attack, which occurred on October 6, disrupted the platform&#8217;s services for approximately an hour. Galxe Protocol took to social media to alert its users ... <a title=\"Web3 platform Galxe Protocol experiences DNS attack, Suffers Over $150K in losses\" class=\"read-more\" href=\"https://www.cryptopolitan.com/web3-platform-galxe-protocol-dns-attack/\" aria-label=\"More on Web3 platform Galxe Protocol experiences DNS attack, Suffers Over $150K in losses\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-07T10:14:05.000Z",
    "title": "Yuga Labs announces layoffs and strategic Shift, Prioritizing Otherside metaverse development ",
    "url": "https://www.cryptopolitan.com/yuga-lab-announce-layoff-and-strategic-shift/",
    "description": "Yuga Labs, the innovative force behind the Bored Ape Yacht Club and CryptoPunks, is making strategic moves in response to the tumultuous global economic landscape. In an announcement that has caught the industry&#8217;s attention, the company has unveiled a series of layoffs within its U.S. teams, citing the need to weather economic uncertainties while preserving ... <a title=\"Yuga Labs announces layoffs and strategic Shift, Prioritizing Otherside metaverse development \" class=\"read-more\" href=\"https://www.cryptopolitan.com/yuga-lab-announce-layoff-and-strategic-shift/\" aria-label=\"More on Yuga Labs announces layoffs and strategic Shift, Prioritizing Otherside metaverse development \">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-07T10:30:46.000Z",
    "title": "When Are AMMs Coming To XRP Ledger? Ripple CTO Gives Clear Answer",
    "url": "https://www.newsbtc.com/news/when-are-amms-coming-to-xrp-ledger-ripple-cto-gives-clear-answer/",
    "description": "Following the announcement that the AMM functionality would be proposed as an amendment under the latest rippled version, many in the XRP community have continued to wonder how soon it could be implemented if passed. As a result, Ripple’s Chief Technology Officer (CTO) David Schwartz has provided some answers to the community to quench speculations. How Soon The AMM Implementation Could Happen   In response to a tweet asking how soon the AMM will go live on the ledger after voting, Schwartz stated that it should be enabled on the XRP Ledger (XRPL) “in about two weeks” if most validators vote yes to the proposal.   The voting process kickstarted on September 7 following the announcement by Ripple’s developers. However, it seems that validators haven’t looked through the proposal yet or taken action. To the best of his knowledge, Schwartz mentioned that no validator has voted yes to the proposal yet, and 80% of validators need to vote yes for the amendment to be passed.  Related Reading: Dogecoin Under Pressure: Will Bearish Momentum Push Meme Coin Below $0.06? He further gave his opinion on how the process should go, as he believes “validators shouldn’t vote yes individually.” Rather, the decision should lie with the community, with the validators voting in favor of the amendment if they “believe” the community supports it.  Contrary to what many may think, the amendment process isn’t “supposed to be a governance mechanism,” according to Schwartz. Instead, the aim of the voting process is to “coordinate activation and prevent activation if a problem is discovered.” He emphasized that validators should be guided by the community’s decision, not what “they think is best.” Bitcoin approaching the $28K level on the weekly chart: TradingView.com Schwartz&#8217;s Role In Ensuring Amendment Is Passed In a subsequent tweet, the Ripple CTO mentioned that he was going to review the performance testing results in the next few days and run a “few code checks” using feedback that he had gotten from several people. If everything works out fine and no “new objections surface,” Schwartz mentioned that he will “start asking people to consider voting yes.” 1/ Extensive performance testing of the XLS-30 #AMM has now been completed. XLS-30 is a proposed amendment as part of the rippled 1.12.0 upgrade. If adopted, it will bring automated swap, trading, and liquidity provisioning capabilities to the #XRPLedger.https://t.co/Cz1w76uc8c — RippleX (@RippleXDev) October 6, 2023 Meanwhile, Ripple’s developers confirmed in a tweet that they have completed the extensive performance testing of the AMM feature. If adopted, this AMM functionality will bring “automated swap, trading, and liquidity provisioning capabilities to the ledger.” Community members also have a chance to earn passive income by acting as liquidity providers (LPs) to the ecosystem.  Related Reading: Trillions In Shiba Inu On The Move: What Lies Ahead For The Meme Coin? Many in the XRP community seem to have welcomed the idea of a novel AMM feature on the XRPL, as it could help improve liquidity on the network and enhance faster and seamless trading.  However, the same cannot be said about the ‘Clawback feature,’ another proposed amendment under the latest rippled version. Despite Schwartz defending the feature, many in the community argue that it undermines the essence of blockchain technology and decentralization. Featured image from CoinCodex"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-07T10:28:00.000Z",
    "title": "ADA Challenges Resistance as It Leads in Development Activity",
    "url": "https://coinedition.com/ada-challenges-resistance-as-it-leads-in-development-activity/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Cardano-Developments.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano Developments\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Cardano-Developments.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Cardano-Developments-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Cardano-Developments-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/Cardano-Developments-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Cardano-Developments-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Cardano-Developments-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The blockchain intelligence platform Santiment revealed in an X (formerly Twitter) post that Cardano (ADA) has recorded the highest level of development activity over the past 30 days. According to the post, Cardano pushed the highest number of notable Github commits throughout this past month. Meanwhile, ADA’s price was able to break above the 50-day [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ada-challenges-resistance-as-it-leads-in-development-activity/\">ADA Challenges Resistance as It Leads in Development Activity</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]