[
  {
    "source": "Cointelegraph",
    "date": "2023-11-23T15:51:47.000Z",
    "title": "HTX to restore services 'within 24 hours' after $13.6M hack",
    "url": "http://cointelegraph.com/news/htx-restore-services-within-24-hours-after-hack",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/e6723f36-a9bc-432d-b62c-4f8adfd3d74c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>\"Huobi HTX has now properly handled this attack,\" the crypto exchange stated.  </p>\n                    <p><p>Crypto exchange HTX, formerly Huobi Global, will resume deposits and withdrawals within 24 hours after suffering a $13.6 million exploit on Nov. 22.</p><p>According to its official <a href=\"https://www.htx.com/support/zh-cn/detail/24955033595175\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, the exchange promised to \"fully compensate for the losses caused by this attack and 100% guarantee the safety of user funds.\" In addition, developers wrote, \"the amount of funds lost by Huobi HTX this time accounts for a very small amount of the total funds of the platform,\" noting that the \"normal operations\" of HTX were not affected by the incident. </p><p>The day prior, Huobi suffered a $13.6 million hack to its exchange hot wallets as part of an <a href=\"https://cointelegraph.com/news/htx-exchange-loses-14-million-hot-wallet-hack\">orchestrated $86.6 million attack</a> against the HTX Eco (HECO) Chain bridge, consisting of HTX, Tron (TRX), and BitTorrent (BTT). All three entities are linked or de-facto controlled by Chinese blockchain entrepreneur Justin Sun. </p><p>Like previous incidents, HTX stated that \"protecting user assets and information security is our highest responsibility, and we will take all necessary measures to prevent such incidents from happening again.\" Over the past two months, HTX and Justin Sun-linked entities have been hacked four times. The largest was the $100 million Poloniex exploit on Nov. 10 caused by an apparent <a href=\"https://cointelegraph.com/news/poloniex-resumes-withdrawals-hack\">private key compromise</a>. </p><p>Sun has since stated, \"We are investigating the specific reasons for the hacker attack. Once we complete the investigation and identify the cause, we will resume services.\" A <a href=\"https://cointelegraph.com/news/poloniex-hacker-identity-confirmed-10-million-bounty\">$10 million white hat bounty</a> for the return of stolen funds in the $100 million Poloniex exploit remains open at the time of publication. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/huobi-new-name-htx-stands-for-exchange-tron-and-10th-anniversary\">Huobi’s new name, HTX, raises community eyebrows</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-23T15:57:20.000Z",
    "title": "Ethereum open interest nears record high on CME following 21% surge",
    "url": "https://cryptoslate.com/insights/ethereum-open-interest-nears-record-high-on-cme-following-21-surge/",
    "description": "<p>Quick Take While CME retains its position as the leading exchange in terms of Bitcoin futures, the past 24 hours have witnessed a remarkable surge in Ethereum open interest. Specifically, Ethereum open interest has escalated by 2.5%, reaching 3.59 million ETH &#8211; the most substantial level since August. This uptick signifies heightened trader interest and [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/ethereum-open-interest-nears-record-high-on-cme-following-21-surge/\">Ethereum open interest nears record high on CME following 21% surge</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-23T16:01:32.000Z",
    "title": "Top 5 Underrated Cryptos with a 100x Potential in 2024",
    "url": "https://cryptodaily.co.uk/2023/11/top-5-underrated-cryptos-with-a-100x-potential-in-2024",
    "description": "Explore our expert analysis of the Top 5 Underrated Cryptocurrencies poised for a 100x potential in 2024. Uncover hidden gems in the crypto market and learn about key factors driving their growth potential."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-23T16:00:42.000Z",
    "title": "Bitcoin User Unwittingly Pays $3.1 Million in Single Transaction Fee",
    "url": "https://news.bitcoin.com/bitcoin-user-unwittingly-pays-3-1-million-in-single-transaction-fee/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/btc56-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin User Unwittingly Pays $3.1 Million in Single Transaction Fee\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/btc56-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/btc56-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/btc56-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/btc56-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/btc56-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/btc56-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/btc56.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Onchain data reveals a staggering incident where a bitcoin user inadvertently paid a fee of 83.65 BTC, amounting to a costly mistake of $3.1 million, in a single transaction. This blunder occurred in block 818,087, mined by Antpool, marking the highest fee ever recorded on the Bitcoin blockchain. Bitcoin Transaction Gone Wrong: User Forks Out [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-23T16:04:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Binance coin and the entire crypto market have seen little gains in the past few days, as prices have been consolidating in tight regions. BNB prices have dropped by 14.11% since touching $248.9 in August 2023. What does the future hold for Binance Coin? How much is BNB worth? The ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-23T15:45:06.000Z",
    "title": "Teamfight Tactics Unveils Set 10: Remix Rumble with a Musical Twist",
    "url": "https://www.cryptopolitan.com/teamfight-tactics-set-10-remix-rumble/",
    "description": "Explore the latest update in Teamfight Tactics, Set 10: Remix Rumble, which brings a fresh musical twist to the game's characters and arenas. Discover the enhanced mobile gaming experience with improved UI and graphics."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-23T16:00:59.000Z",
    "title": "FTX’s FTT Token Leads Market Gains With 55% Rally, What’s Driving It?",
    "url": "https://www.newsbtc.com/analysis/ftt/ftx-ftt-token-55-rally/",
    "description": "The utility token of the defunct crypto exchange FTX, FTT is one of the top gainers in the last few days, rising 55% in just 48 hours alone. This has led to speculations as to what may be driving the token’s rally. One of them relates to a recent event in the crypto industry.  FTT Token&#8217;s Recent Rally Propelled By Binance News In a post on its X (formerly Twitter) platform, the market intelligence platform Santiment noted that the second rally for FTT came after the Binance news. The world’s largest crypto exchange and its former CEO Changpeng “CZ” Zhao had both pleaded to criminal charges and agreed to a settlement of over $4 billion in fines. Related Reading: Grayscale Files Updated Spot ETF As Bitcoin Barrels Past $37,000 As to the correlation between both events, Binance and FTX have always been closely knitted in several regards. For one, CZ, in particular, has sometimes been credited for being responsible for FTX’s collapse. Prior to the bank run on FTX, the former executive had made a tweet about his company liquidating their FTT holdings.  As such, it is believed that Binance, going through this difficult phase, comes off as bullish for the FTT token because of the animosity that the FTX and Binance ecosystem share. Interestingly, while FTT has continued to rally, Binance’s BNB has suffered an inverse fate. BNB is down by over 6% in the last seven days, according to data from CoinMarketCap.  Sam Bankman-Fried’s Conviction Also Contributed It is worth mentioning that the FTT rally didn’t just kickstart on the back of the Binance news. FTT’s market value is reported to be about 255% up against Bitcoin in the past 3 weeks. This resurgence began just after the 10 largest wallets began accumulating, with $12.8 million worth of FTT bought by these whales since November 3. Interestingly, November 3 happens to be a day after FTX’s former CEO Sam Bankman-Fried (SBF), was convicted. The FTX founder was convicted of all seven charges leveled against him. Going by this, it would seem that his conviction was conceived as bullish for these whales who decided to double down on their FTT holdings.  Related Reading: Cardano Forecast: Crypto Analyst Identifies The Event That Could Send ADA Price To $11 Another factor that might also be contributing to the token’s resurgence is the talks about FTX making a comeback. The defunct crypto exchange is reported to have suitors who are interested in rebooting it. The Chair of the Securities and Exchange Commission (SEC), Gary Gensler, had also noted that it was a possibility as far as the rules and guidelines are abided by. At the time of writing, FTT is currently trading at around $4.50, up over 21% in the last 24 hours and up by over 336% in the past month, according to data from CoinMarketCap. FTT tops list of gainers &#124; Source: FTTUSDT on Tradingview.com Featured image from IQ.Wiki, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-23T16:03:25.000Z",
    "title": "Gate.io Implements Zero-Knowledge Tech in New Proof of Reserves Method",
    "url": "https://www.crypto-news-flash.com/gate-io-implements-zero-knowledge-tech-in-new-proof-of-reserves-method/?utm_source=rss&utm_medium=rss&utm_campaign=gate-io-implements-zero-knowledge-tech-in-new-proof-of-reserves-method",
    "description": "<img width=\"512\" height=\"256\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-2023-11-23T190153.925.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-2023-11-23T190153.925.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-2023-11-23T190153.925-300x150.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Nov. 23rd &#8211; Gate.io, a leading cryptocurrency exchange and Web3 innovator, has announced upgrades to its Proof of Reserves (PoR) process, which includes a new open-source method utilizing zero-knowledge technology. Following the upgrade, the PoR process will now cover the top 100 digital assets, with certificates published regularly for enhanced transparency. Gate.io pioneered PoR in [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-23T15:53:53.000Z",
    "title": "Ripple’s CTO Draws a Clear Line: XRP Holders Are Not Investors in Ripple, Echoes Amazon Model",
    "url": "https://www.crypto-news-flash.com/ripples-cto-draws-a-clear-line-xrp-holders-are-not-investors-in-ripple-echoes-amazon-model/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-cto-draws-a-clear-line-xrp-holders-are-not-investors-in-ripple-echoes-amazon-model",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/CBDC-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/CBDC-Ripple.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/CBDC-Ripple-300x158.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/CBDC-Ripple-1024x538.jpg 1024w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Ripple CTO David Schwartz is always quick to defend the company, and recently, he took shots at a Twitter user who suggested that XRP holders are investors in Ripple. David dispelled the myth, and in drawing parallels to Amazon, noted that the e-commerce giant gets most of its running capital from purchases, but that doesn&#8217;t [...]"
  }
]