[
  {
    "source": "Cointelegraph",
    "date": "2023-11-12T14:20:45.000Z",
    "title": "Pre-ETF BTC price 'crash' or $150K in 2025? Bitcoin forecasts diverge",
    "url": "http://cointelegraph.com/news/pre-etf-btc-price-crash-150k-2025-bitcoin-forecasts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/b7719201-c106-4c68-aa3d-35a6dee0989d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin ETF launch day could be more than just a \"sell the news\" event for BTC price, says Peter Schiff.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) will “most likely” see a serious price drawdown before a key date for institutional investors dawns, says gold bug Peter Schiff.</p><p>In recent X activity, the longtime Bitcoin skeptic sounded the alarm over recent BTC price gains.</p><h2>Schiff bets on a BTC price \"crash\" before ETF launches</h2><p>Bitcoin is a favoirte topic of criticism for Peter Schiff, the chief economist and global strategist at asset management firm Europac.</p><p>Throughout the years, he has <a href=\"https://cointelegraph.com/news/peter-schiff-wins-debate-over-whether-gold-is-a-better-store-of-value-than-btc\">repeatedly insisted</a> that unlike gold, Bitcoin’s value is destined to return to zero, and that no one in fact wishes to hold it except in order to sell higher later on.</p><p>Now, with BTC/USD <a href=\"https://cointelegraph.com/news/bitcoin-traders-btc-price-targets-40k-volume\">circling 18-month highs</a>, he has turned his attention to what others say will be a watershed moment for cryptocurrency — the launch of the United States’ first Bitcoin spot price exchange-traded fund (ETF).</p><p>An approval is thought to be due in early 2024, while rumors that a green light could come in November are thought to have fueled last week’s ascent past $37,000.</p><p>While some believe that the announcement will be a “sell the news” event, where investors reduce exposure once certainty over the ETF hits, for Schiff, a BTC price comedown may not even wait for that.</p><p>In an X survey on Nov. 9, he offered two scenarios for a Bitcoin “crash” — before and after the ETF launch. Alternatively, respondents could choose “Buy and HODL till the moon,” which ultimately became the most popular choice with 68% of the nearly 25,000 votes.</p><p>Despite this, however, Schiff stood his ground.</p><p>“Based on the results my guess is that Bitcoin crashes before the ETF launch,” he responded. </p><blockquote>“That why the people who bought the rumor won't actually profit if they wait for the fact to sell.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">When will <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> crash?</p>&mdash; Peter Schiff (@PeterSchiff) <a href=\"https://twitter.com/PeterSchiff/status/1722640540649279590?ref_src=twsrc%5Etfw\">November 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>AllianceBernstein: Bitcoin ETF \"getting slowly priced in\"</h2><p>As Cointelegraph <a href=\"https://cointelegraph.com/news/bitcoin-moon-top-5-btc-price-predictions-2024-beyond\">reported</a>, the mood among the institutional sphere is lightening as the ETF debate looks increasingly set to end in Bitcoin’s favor.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-terminal-price-next-btc-all-time-high-at-least-110k\">Bitcoin ‘Terminal Price’ hints next BTC all-time high is at least $110K</a></em></strong></p><p>Among the latest optimistic BTC price forecasts is that of AllianceBernstein, which last week predicted a peak of $150,000 next cycle.</p><p>“We believe early flows could be slower and the build up could be more gradual, and post-halving is when ETF flows momentum could build, leading to a cycle peak in 2025 and not 2024,” analysts wrote in a note <a href=\"https://www.marketwatch.com/story/bitcoin-could-reach-150-000-in-2025-during-new-bull-cycle-says-alliancebernstein-37cc32a3\" target=\"_blank\" rel=\"noopener nofollow\">quoted</a> by MarketWatch and others.</p><blockquote>“The current BTC break-out is just simply ETF approval news getting slowly priced in and then the market monitors the initial outflows and likely gets disappointed in the short run.”</blockquote><p>An accompanying chart showed BTC price past and future behavior delineated by halving cycles.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/9d3b7b54-e105-4e40-aa8c-f0a965084e8f.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD cycle phases (screenshot). Source: AllianceBernstein/MarketWatch</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  }
]