[
  {
    "source": "Decrypt",
    "date": "2023-09-07T10:06:11.000Z",
    "title": "Judge Refers Sam Bankman-Fried's Request for Pretrial Release to 3-Judge Panel",
    "url": "https://decrypt.co/155266/judge-refers-sam-bankman-frieds-request-for-pretrial-release-to-3-judge-panel",
    "description": "With less than a month to go before the FTX founder’s trial, the judge has denied SBF’s request for \"immediate release.\""
  },
  {
    "source": "Decrypt",
    "date": "2023-09-07T10:01:02.000Z",
    "title": "Louis Vuitton and Prada-Backed Aura Blockchain Consortium Names New CEO",
    "url": "https://decrypt.co/155235/louis-vuitton-prada-backed-aura-blockchain-consortium-names-new-ceo",
    "description": "Aura Blockchain Consortium, which also counts Richemont and Mercedes-Benz among its members, is targeting a \"new phase of growth.\""
  },
  {
    "source": "Decrypt",
    "date": "2023-09-07T09:51:25.000Z",
    "title": "Former OpenSea Manager Opts to Serve Prison Sentence While Appeal is Pending",
    "url": "https://decrypt.co/155261/former-opensea-manager-opts-to-serve-prison-sentence-while-appeal-is-pending",
    "description": "Nathaniel Chastain was previously sentenced to three months in prison for making tens of thousands of dollars through insider trades of NFTs."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-07T09:55:01.000Z",
    "title": "Marketing company wants 90% of Japanese population on Web3: KBW 2023",
    "url": "https://cointelegraph.com/news/kbw-2023-avalanche-partners-japan-loyalty-marketing-company-onboard-100-million-users-web3",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/3d4cad82-3e00-4d25-a1ac-71569d93569f.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ava Labs head of product Nick Mussallem explained how Japanese company Loyalty Marketing is aiming to introduce Web3 to its 100 million users. </p>\n                    <p><p>Proof-of-stake (PoS) blockchain platform Avalanche is expecting 5-10 million transactions on a subnet as a Japanese loyalty program company that claims to have 100 million users has partnered with the network to bring their mass-scale loyalty rewards program into a blockchain. </p><p>Cointelegraph’s Andrew Fenton interviewed Nick Mussallem, Ava Labs' head of product at the Korea Blockchain Week 2023, held in Seoul, South Korea. The duo spoke about various topics including the recently announced partnership with blockchain services provider PlayThink and Japanese points service provider Loyalty Marketing to onboard more than 100 million users into the Web3 space. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/e875ddc1-ba54-4da8-8ce5-1685b2991aad.jpg\"  /><figcaption style=\"text-align: center;\"><em>Nick Mussallem at the Avalanche House area of the Korea Blockchain Week 2023. Source: Cointelegraph</em></figcaption></figure><p>According to Mussallem, Loyalty Marketing is expecting up to 10 million mints for its nonfungible token (NFT) program as it targets onboarding its entire user base into a Web3 system. On its website, the company claims to have around 280,000 partner stores across Japan and 112.6 million users, which is almost 90% of the entire population of the East Asian country. He explained: </p><blockquote>“With this deal, they are committed to trying to get the entire user base. They're taking the system that they have right now, and migrating the entire thing over in phases, to a Web3 system that's going to run on their subnet.”</blockquote><p>Mussallem also highlighted that there are two areas where blockchain makes sense for the company. The Ava Labs executive explained that there’s a composability aspect for onboarding merchants and an engagement aspect for users. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/dydx-to-launch-decentralized-order-books-exchange-on-cosmos-kbw-2023\"><strong><em>DYdX to launch decentralized order book exchange on Cosmos: KBW 2023</em></strong></a></p><p>According to the executive, merchants being onboarded into the company’s system could be very tricky as they would have to get into their data systems and “figure out how it works.” However, the case is different for blockchains. </p><p>“When it's a blockchain, it's just the asset, especially in the way they run on subnets. It's very composable,” Mussallem explained. The executive also highlighted that this takes away the overhead that comes with onboarding new vendors and adding interoperability. </p><p>When it comes to users, the executive believes that the benefits lie within engagement. Mussallem believes that the move is about giving them something “a bit more interesting.” This includes ownership of assets and the ability to spend their loyalty points across different types of stores. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/nft-collapse-and-monster-egos-feature-in-new-murakami-exhibition/\"><strong><em>NFT collapse and monster egos feature in new Murakami exhibition</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-07T09:49:44.000Z",
    "title": "Palau to freeze USD-backed stablecoin after pilot launch in July",
    "url": "https://cointelegraph.com/news/usd-backed-stablecoin-halted-after-palau-pilot",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/31b963f1-3986-4404-86d1-c79227c9eabf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Palau's USD-backed stablecoin build on XRP Ledger will be frozen on Sept. 15 as the government will be collecting feedback from users to shape the way ahead.</p>\n                    <p><p>Palau, a country in the western Pacific Ocean, is wrapping up its U.S. dollar stablecoin project after launching the pilot in August.</p><p>Jay Hunter, Palau Ministry of Finance member and head of digital residency program, took to X (formerly Twitter) to announce that the government will <a href=\"https://twitter.com/JHX_1138/status/1699650336581882041?s=20\" target=\"_blank\" rel=\"noopener nofollow\">cease</a> the distribution of the Palau Stablecoin (PSC) on Sept. 8.</p><p>Following the distribution halt, the Palau Stablecoin will also be frozen after Sept. 15, becoming unavailable for spending by users, Hunter said, noting: </p><blockquote>“After Sept. 15 you will no longer be able to spend the PSC. This will give us time to process retailer redemptions before the pilot’s official termination at the end of the month.”</blockquote><p>In the announcement, Hunter didn’t provide exact reasons for freezing the stablecoin, only noting that the government will send a survey to pilot participants next week. The move came weeks after the <a href=\"https://cointelegraph.com/news/us-dollar-backed-stablecoin-pilot-project-launched-pacific-island-nation-palau\">government launched the PSC</a> in late July.</p><p>“If we are authorized to move forward with the next phase of the stablecoin program, our collective lessons learned will shape the way ahead,” the official said. He added that users' feedback would be critical to developing the final report to the Palau Congress and the president.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/us-dollar-backed-stablecoin-pilot-project-launched-pacific-island-nation-palau\"><strong><em>Visa taps into Solana to widen USDC payment capability</em></strong></a></p><p>The news comes shortly after Hunter posted a study devoted to stablecoin technology and related security considerations from the National Institute of Standards and Technology. Issued in September, the study evaluated some of the necessary properties of security and stability and identified “18 potential issues in stablecoin implementations.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Stablecoins are a type of cryptocurrency that aim to maintain a stable price relative to a specified asset (usually a fiat currency). <br><br>Much has been written about how to use stablecoins and about the economic implications of doing so, specifically price variability. However,… <a href=\"https://t.co/Hek7tUqXZR\">pic.twitter.com/Hek7tUqXZR</a></p>&mdash; Jay Hunter Anson (@JHX_1138) <a href=\"https://twitter.com/JHX_1138/status/1699079515513688409?ref_src=twsrc%5Etfw\">September 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Nicknamed the Kluk, the Palau Stablecoin is designed to reduce transaction costs and enhance the speed of transfers for citizens, merchants and the government of Palau. The stablecoin was built on <a href=\"https://cointelegraph.com/news/xrp-grows-strong-q2-despite-sec-lawsuit-concerns-messari-report\">Ripple’s XRP Ledger</a>, a platform focused on the issuance of central bank digital currencies (CBDC).</p><p>The XRP ledger CBDC platform also serves as the foundation for similar pilot projects in countries like <a href=\"https://cointelegraph.com/news/ripple-partners-colombia-central-bank-explore-blockchain-technology\">Hong Kong, Bhutan, Colombia and Montenegro</a>.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>Magazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-07T10:00:25.000Z",
    "title": "Vitalik Buterin introduces decentralized privacy pools for balancing crypto regulation and anonymity",
    "url": "https://cryptoslate.com/vitalik-buterin-introduces-privacy-pools-for-balancing-crypto-regulation-and-anonymity/",
    "description": "<p>A new research paper led by Ethereum creator Vitalik Buterin proposes &#8220;Privacy Pools,&#8221; a novel approach to balance privacy protections and regulatory compliance in cryptocurrencies. The paper outlines how Privacy Pools allows users to prove their crypto withdrawals do not originate from illicit sources without revealing their complete transaction histories. Users can generate zero-knowledge proofs [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/vitalik-buterin-introduces-privacy-pools-for-balancing-crypto-regulation-and-anonymity/\">Vitalik Buterin introduces decentralized privacy pools for balancing crypto regulation and anonymity</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-07T10:00:57.000Z",
    "title": "Chainlink Price Prediction For September: Buy LINK Now?",
    "url": "https://www.newsbtc.com/news/chainlink/chainlink-price-prediction-september-buy-link-now/",
    "description": "Chainlink (LINK) has been a standout in the crypto market recently, registering an 11% increase over the past six days, even as the broader crypto market sentiment remains subdued. Will Uptober Start Early For Chainlink? A significant factor that might be driving this price action is the behavior of LINK&#8217;s major holders. On-Chain analysis firm, Santiment, highlighted this in a recent tweet, stating: &#8220;Chainlink&#8217;s key shark tier that holds between 10K-100K LINK has been on an accumulation spree.&#8221; Diving deeper into the data, there are now 3,127 wallets holding between 10,000-100,000 LINK, marking the highest level since December 3, 2022. These wallets have added a staggering $9.6 million worth of LINK in just three days. Since September 3rd, there&#8217;s been a 3.2% rise in the number of wallets in this category, with 98 new wallets emerging. This group has accumulated 0.154% of the entire LINK supply in the same period. Related Reading: LINK Price Prediction: Chainlink Needs To Clear $6.25 For Hopes of a Fresh Rally However, Chainlink&#8217;s journey hasn&#8217;t been entirely smooth. The token has been ensnared in a sideways range for an exhausting 485 days, which is over 15 months. The LINK/BTC pair has been on a downward trajectory for more than three years. Chainlink&#8217;s much-anticipated release of the Cross-Chain Interoperability Protocol (CCIP) was met with significant hype. Yet, despite its potential to revolutionize cross-chain communication, its release didn&#8217;t provide the expected boost to LINK&#8217;s price. Also the news that a tokenization experiment by interbank messaging system Swift and Chainlink successfully transferred value across multiple blockchains could not move price substantially. In June Chainlink and Swift announced that they would be collaborating with dozens of financial institutions such as BNP Paribas, BNY Mellon, The Depository Trust &#38; Clearing Corporation and Lloyds Banking Group and others. Related Reading: Crypto Analyst Shares Bullish Insights On Chainlink As Users Accumulate 295 Million LINK However, the upcoming Chainlink&#8217;s SmartCon in October from October 2nd to 3rd might be the catalyst the token needs. Rumors are rife about a potential major announcement between Swift and Chainlink Labs, which could connect web3 infrastructure to the banks involved in previous tests. If history is any indication, Chainlink could experience a surge in price leading up to the event, driven by the euphoria and speculation. &#8220;Uptober&#8221; could come early for the Chainlink price. LINK Technical Analysis The recent 11% surge in LINK&#8217;s price suggests that the market might already be reacting to the upcoming hype. However, the 4-hour chart indicates a rejection at the 23.6% Fibonacci retracement level at $6.37, which aligns closely with the 200 EMA at $6.40. For LINK to sustain its upward trajectory, it&#8217;s imperative to breach this level, with the next significant target being the 50% Fibonacci retracement level at $7.08. The 1-week chart paints a picture of LINK&#8217;s prolonged downtrend. The recent hold above the 23.6% Fibonacci retracement level at $5.92 is a positive sign for the bulls, potentially paving the way for another try on the upper trendline of the downtrend channel. However, several difficult challenges lie ahead. The 50% Fibonacci retracement level at $7.20 is the first major resistance. If LINK can push past this, a breakout from the 15-month downtrend channel becomes possible. For this to happen, Chainlink would need to break above the $8.30-$8.40 area as it currently stands, and would then encounter the 78.6% Fibonacci retracement level at $8.58. Large selling pressure can be expected at this point. Should LINK falter at this juncture, a return to the downtrend channel is likely. Conversely, if the $8.58 mark is surpassed, it would signal a significant win for the bulls, potentially setting LINK on a path to challenge its 15-month high at $9.61. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-07T10:00:41.000Z",
    "title": "Shiba Inu’s Shibarium Spikes in Popularity and Triples in Size, Everlodge to Climb 35x at Launch",
    "url": "https://www.crypto-news-flash.com/shiba-inus-shibarium-spikes-in-popularity-and-triples-in-size-everlodge-to-climb-35x-at-launch/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-shibarium-spikes-in-popularity-and-triples-in-size-everlodge-to-climb-35x-at-launch",
    "description": "<img width=\"512\" height=\"242\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-46.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-46.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-46-300x142.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As August is nearing its end, the crypto market is recovering, with many cryptocurrencies experiencing surges in value. Shiba Inu (SHIB)&#8217;s Shibarium network achieved a new milestone, where it tripled its size within the span of 24 hours. Many are bullish on the future of crypto and have diversified with the Everlodge (ELDG) project, which [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-07T09:58:47.000Z",
    "title": "VeChain-Powered EXPlus Unveils Groundbreaking Phygital Medals Integrated with NFTs",
    "url": "https://www.crypto-news-flash.com/vechain-powered-explus-unveils-groundbreaking-phygital-medals-integrated-with-nfts/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-powered-explus-unveils-groundbreaking-phygital-medals-integrated-with-nfts",
    "description": "<img width=\"1280\" height=\"768\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"VeChain blockchain\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-48x29.jpg 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />EXPlus debuts unique &#8220;Phygital&#8221; medals blending the tangible with digital. VeChain&#8217;s system enables traceability, ensuring authenticity and efficiency in the second-hand fashion marketplace. Leading the way in the fusion of the physical and digital realms, EXPlus recently revealed their pioneering Phygital medals with NFC chips, harmoniously incorporated into VeChain NFTs. The groundbreaking initiative was spotlighted [...]"
  }
]