[
  {
    "source": "Decrypt",
    "date": "2023-12-12T23:00:51.000Z",
    "title": "Mistral AI Picks ‘Mixture of Experts’ Model to Challenge GPT 3.5",
    "url": "https://decrypt.co/209540/mistral-ai-picks-mixture-of-experts-model-to-challenge-gpt-3-5",
    "description": "Fresh from a fundraising round at a $2 billion valuation, the French startup tout its LLM's strengths against established rival OpenAI."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-12T22:58:43.000Z",
    "title": "Checkmate: Immortal Game Ditches Chess NFTs, Crypto Token Over 'Heavy Cheating'",
    "url": "https://decrypt.co/209533/checkmate-immortal-game-ditches-chess-nfts-crypto-token-over-heavy-cheating",
    "description": "After raising millions from crypto investors, the Immortal Game chess platform will no longer support its token or \"play-to-earn\" elements."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-12T22:50:17.000Z",
    "title": "USDC tops S&P Global’s stablecoin stability chart while Tether faces scrutiny",
    "url": "https://cryptoslate.com/usdc-tops-sp-globals-stablecoin-stability-chart-while-tether-faces-scrutiny/",
    "description": "<p>S&#38;P Global Ratings, a leader in providing credit ratings, announced a crucial series of stability assessments for various stablecoins on Dec. 12, rating each asset&#8217;s stability strength on a five-point scale. Lapo Guadagnuolo, senior analyst at S&#38;P Global Ratings, said: &#8220;We see stablecoins becoming further embedded into the fabric of financial markets, acting as an [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/usdc-tops-sp-globals-stablecoin-stability-chart-while-tether-faces-scrutiny/\">USDC tops S&#038;P Global&#8217;s stablecoin stability chart while Tether faces scrutiny</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-12T23:00:40.000Z",
    "title": "Donald Trump Launches ‘Mugshot Edition’ Digital Cards With Suit Scraps and Gala Dinner Invitations",
    "url": "https://news.bitcoin.com/donald-trump-launches-mugshot-edition-digital-cards-with-suit-scraps-and-gala-dinner-invitations/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/trump-mugshot-collection-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Donald Trump Launches &#039;Mugshot Edition&#039; Digital Cards With Suit Scraps and Gala Dinner Invitations\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/trump-mugshot-collection-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/trump-mugshot-collection-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/trump-mugshot-collection-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/trump-mugshot-collection-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/trump-mugshot-collection-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/trump-mugshot-collection-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/trump-mugshot-collection.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Former U.S. President Donald Trump has launched a new digital trading card collection, the Mugshot Edition, and this is the first time he is also offering physical cards. Buyers who purchase 47 of these Mugshot Edition cards will receive a scrap of the suit Trump wore for his mugshot photo, along with an invitation to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-12T23:00:35.000Z",
    "title": "Ripple unveils new San Francisco HQ amid SEC lawsuit",
    "url": "https://www.cryptopolitan.com/ripple-unveils-new-san-francisco-hq/",
    "description": "In a significant development for the blockchain industry, Ripple, a prominent crypto payments company, has officially opened its new corporate headquarters in San Francisco. This move was announced by David Schwartz, Ripple’s Chief Technology Officer, through a tweet accompanied by striking photographs of the new office. Located at 600 Battery St. in Jackson Square, near [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-12T22:54:12.000Z",
    "title": "Ankr blockchain unveils new product to enhance privacy and compliance in Web3 authentication",
    "url": "https://www.cryptopolitan.com/ankr-new-product-enhance-privacy-compliance/",
    "description": "Ankr, a key player in the Web3 development sector, has recently launched its new product, &#8220;Ankr Verify.&#8221; This innovative solution is designed to redefine user authentication across blockchain and decentralized applications, using zero-knowledge user identity verification. Also, this new product aims to combine compliance with KYC (Know Your Customer) standards and the unique privacy benefits [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-12T23:00:30.000Z",
    "title": "Here’s How Much You Would Have If You Bought Bitcoin When Jim Cramer Said Sell",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-jim-cramer-sell/",
    "description": "Jim Cramer, the host of CNBC’s Mad Money show, has come to be known in Bitcoin circles for his constantly wrong predictions about the asset. Cramer has, at various points, called for investors to sell their Bitcoin but with the crypto’s price continuing to go up after his calls, here’s how much Bitcoin has gained since Cramer last called for a BTC sell-off. Counter-Trading Jim Cramer’s Advice On Bitcoin Back in 2022 when the FTX crypto exchange collapsed and filed for bankruptcy, the Bitcoin price had fallen more than 50% to trade below $15,000. This crash took place in November 2022 and a few months later, there was a slight recovery in price and Cramer gave one of his infamous ‘Sell Bitcoin Now’ advice. Related Reading: Solana-Based Meme Coin Outperforms Dogecoin, Shiba Inu To Become 3rd-Largest As shown in a video of Cramer shared by the parody account @CramerTracker on X (formerly Twitter), the Mad Money show host can be seen advising investors to sell their Bitcoin. At the time, the asset’s price had risen around 4% in one week to $24,000 and Cramer believed this was an opportunity to sell. According to him, BTC’s price was being manipulated, and selling into the slight pump was the best thing. Cramer also asserted that the ‘price manipulation’ has made him no longer believe in the asset. “I would sell my Bitcoin right into this rally,” Cramer said. “Believe me, I had been a believer one time in Bitcoin. Not here. Not now,” the show host further added. In true Cramer fashion, he would turn out to be wrong less than a year later as Bitcoin’s price would keep going up. In fact, buying Bitcoin at the time when Cramer advised investors to sell proved to be one of the best buying opportunities. From Cramer’s sell call at $24,000 to now, the price has increased by 80%. This means that if an investor had bought $100,000 in BTC when Cramer said sell and held until now, they would have a whopping $180,000 in their portfolio, meaning an $80,000 profit in less than one year. BTC price over 80% higher than Cramer's sell call &#124; Source: BTCUSD on Tradingview.com The Inverse Cramer Tracker ETF Cramer’s propensity for being wrong has brought him notoriety to the point that there is currently a fund dedicated to doing the opposite of what the CNBC host says. The Inverse Cramer Tracker ETF is currently sitting at $22.07 after hitting an all-time high of $26, data from MarketWatch shows. Related Reading: Bitcoin Vulnerability Discovered By A Developer Has Been Flagged By The US Government Currently, the ProShares Bitcoin Strategy ETF is the top holding in the fund (5.50%) which currently has around $3.1 million in net assets. Other prominent investments include PayPal Holdings Inc., AMC Entertainment Holdings Inc., and Dominion Energy Inc., among others. Interestingly, Cramer changed his stance on Bitcoin in November 2023, just months after his initial prediction. He has gone on to endorse Bitcoin investments and referred to his earlier predictions as ‘premature.’ Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Cryptorobin.com, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-12T23:01:17.000Z",
    "title": "Do Kwon Must Stay Two More Months in Montenegro as Authorities Extend Custody Period: Report",
    "url": "https://dailyhodl.com/2023/12/12/do-kwon-must-stay-two-more-months-in-montenegro-as-authorities-extend-custody-period-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/terra-investors-defrauded.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/terra-investors-defrauded.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/terra-investors-defrauded.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/terra-investors-defrauded.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/terra-investors-defrauded.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/terra-investors-defrauded.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/terra-investors-defrauded.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Terra (LUNA) founder Do Kwon is staying in Montenegrin custody for at least two more months at the request of the United States and South Korea. According to a new Bloomberg report, Terraform Labs co-founder Do Kwon will be held in Montenegro for two more months as officials from the US and Korea seek charges related [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/12/do-kwon-must-stay-two-more-months-in-montenegro-as-authorities-extend-custody-period-report/\">Do Kwon Must Stay Two More Months in Montenegro as Authorities Extend Custody Period: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]