[
  {
    "source": "Cointelegraph",
    "date": "2023-09-28T09:01:17.000Z",
    "title": "Celsius valuation advisor approves value of debtors’ assets and liabilities",
    "url": "https://cointelegraph.com/news/celsius-network-advisor-approves-valuation-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/d023dc43-db02-402e-8adf-8e7bbb5704b4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Stout Risius Ross, LLC, the valuation advisor for Celsius Network confirmed the accuracy of the bankrupt firm's valuation report.</p>\n                    <p><p>Joel E. Cohen, a mathematician and biologist representing Celsius Network’s valuation advisor Stout Risius Ross, LLC, confirmed the accuracy of the fair value of certain of the debtors’ assets and liabilities as of May 31, 2023.</p><p>Following months of back and forth, most Celsius creditors recently voted in favor of a plan to see approximately $2 billion worth of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) returned to creditors.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The voting results are in! Over 95% of creditors across all eligible classes voted to accept the Plan, a testament to our collaborative efforts during Chapter 11. <a href=\"https://t.co/9Z5xlBhNts\">https://t.co/9Z5xlBhNts</a> <a href=\"https://twitter.com/CelsiusUcc?ref_src=twsrc%5Etfw\">@CelsiusUcc</a>  <a href=\"https://twitter.com/FahrenheitHldg?ref_src=twsrc%5Etfw\">@FahrenheitHldg</a>.</p>&mdash; Celsius (@CelsiusNetwork) <a href=\"https://twitter.com/CelsiusNetwork/status/1706430965701087676?ref_src=twsrc%5Etfw\">September 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Two days after <a href=\"https://cointelegraph.com/news/crypto-lender-celsius-creditors-vote-favor-reorganization-plan\">attaining consensus around Celsuis’ reorganization plan</a>, a Sept. 28 court <a href=\"https://cases.stretto.com/public/x191/11749/PLEADINGS/1174909272380000000074.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> confirmed the accuracy of the value of debtors’ assets and liabilities. Stout conducted the valuations of cryptocurrency assets, loans and alternative investments. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/f431dc09-5f77-4c64-973d-e6c53155febe.png\"  /><figcaption style=\"text-align: center;\"><em>Summary of conclusions provided for Celsius Network's valuation report. Source: cases.stretto.com</em></figcaption></figure><p>In the declaration provided at the New York bankruptcy court, Cohen explained the methodologies used in the valuation analysis, and concluded:</p><blockquote>“Based on my work performed and the information and methodologies considered, I believe the Valuation Report accurately reflects the fair value of certain of the Debtors’ assets and liabilities as of May 31, 2023.”</blockquote><p>According to a <a href=\"https://cases.stretto.com/public/x191/11749/PLEADINGS/1174908172380000000172.pdf\" target=\"_blank\" rel=\"noopener nofollow\">disclosure</a> statement filed on Aug. 17, approximately $2 billion will be redistributed among creditors and the plan will also distribute equity in a new company, temporarily dubbed “NewCo.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-raises-concerns-over-coinbase-in-objection-to-celsius-restructuring-plan\"><strong><em>SEC raises concerns over Coinbase in objection to Celsius restructuring plan</em></strong></a></p><p>Sporting a similar situation, bankrupt cryptocurrency lending platform BlockFi’s liquidation plan got approval from the New Jersey bankruptcy court. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/de86a2dd-d48e-4213-a426-33204762a34a.png\"  /><figcaption style=\"text-align: center;\"><em>Sept. 26 court filing in the bankruptcy case of BlockFi. Source: Kroll</em></figcaption></figure><p>The repayment amount received by BlockFi’s unsecured creditors will largely depend on whether BlockFi succeeds in its legal battle against FTX and other bankrupt cryptocurrency firms.</p><p><em><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\">Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis</a></strong></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-28T08:47:28.000Z",
    "title": "Michael Egorov Settles Aave Loan, Slashes Debt To $42.7 Million",
    "url": "https://cryptodaily.co.uk/2023/09/michael-egorov-settles-aave-loan-slashes-debt-to-427-million",
    "description": "The settlement of the Aave loan eased the looming contagion fears, with Egorov’s total debt now reduced by over 50%."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T08:53:57.000Z",
    "title": "Social Media Platforms Face Scrutiny Over Failure to Address AI-Generated Misinformation",
    "url": "https://www.cryptopolitan.com/social-media-platforms-face-scrutiny/",
    "description": "Major social media platforms, Facebook and YouTube, are now facing increased scrutiny for their lack of response to two concerning incidents involving the far-right group Republika. These incidents center around using artificial intelligence (AI) to impersonate prominent political figures and spread false information.&#160; Such concerns have been amplified as the European Union&#8217;s Digital Services Act ... <a title=\"Social Media Platforms Face Scrutiny Over Failure to Address AI-Generated Misinformation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/social-media-platforms-face-scrutiny/\" aria-label=\"More on Social Media Platforms Face Scrutiny Over Failure to Address AI-Generated Misinformation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T08:45:31.000Z",
    "title": "Why Top Cybersecurity Companies Using AI Are in Demand As Frontliners",
    "url": "https://www.cryptopolitan.com/top-cybersecurity-companies-using-ai-demand/",
    "description": "In an increasingly digitized world, cybersecurity and data protection are paramount for individuals, organizations, and governments. With cyber threats evolving in complexity and scope, the traditional defensive mechanisms are often found wanting. Enter Artificial Intelligence (AI)—a groundbreaking fusion that promises to revolutionize how we perceive and handle cyber threats. The merger of AI with cybersecurity ... <a title=\"Why Top Cybersecurity Companies Using AI Are in Demand As Frontliners\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-cybersecurity-companies-using-ai-demand/\" aria-label=\"More on Why Top Cybersecurity Companies Using AI Are in Demand As Frontliners\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-28T09:00:26.000Z",
    "title": "Analyst Presents 4 Charts That Prove Crypto Is Not Dead",
    "url": "https://www.newsbtc.com/crypto/analyst-crypto-is-not-dead/",
    "description": "As the crypto market faces constant volatility challenges and regulatory pressures, major cryptocurrencies have experienced significant declines and slowed growth over the years. However, a new chart report has revealed that despite these downward trends, the crypto industry is still achieving new milestones in terms of adoption.  Chart Reveals Crypto Adoption On The Rise The broader crypto market has been recovering at a snail’s pace since the crypto crash in 2021. Cryptocurrencies were at their peak during this time, and Bitcoin had the highest growth rate, reaching a price of over $60,000 while Ethereum’s price was around $4,000.  Related Reading: Crypto Analyst Predicts Huge Double-Digit Breakout For Bitcoin Price However, the upward trend was short-lived and the industry was hit with many challenges including regulatory hurdles that restricted its advancement into different regions and market forces which constantly caused instability in crypto prices.  Amid all this, DeFi Researcher, Thor Hartvigsen has presented in an X (formerly Twitter) post, chart reports that display the continuous growth in adoption of the crypto industry despite negative trends in the ecosystem.  Hartvigsen disclosed the four charts showed an increase in crypto adoption in the industry. One of the charts shows a spike in total daily wallets for users in the Ethereum and Layer 2 (L2) landscape which was previously in a bear market. Another chart reveals a surge in traction in decentralized stablecoins which have been in decline since August 2022.  The third chart illustrates Ethereum’s growth rate over the years, surpassing $10 billion in revenue and promoting the emergence of innovative businesses in the crypto industry. The last chart shows liquid staking at an all-time high, growing from $7.9 billion to more than $20 billion in 2023. This report also adds to recent data which revealed a spike in liquid staking platforms in the United States after hitting 370,000 Ether (ETH) in only five days and reaching a new milestone of $20 million staked ether.  Total market cap struggles to hold above $1 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com Major Incentives Driving Growth Rates The evolution of the crypto industry has been pushed back a couple of years following the Terra Luna crash which saw one of the largest stablecoins declining by 99%.  After the LUNA crash, the crypto industry suffered another loss from the FTX descent and insolvency. The industry has been under scrutiny by major regulatory authorities like the United States Securities and Exchange Commission (SEC).  There have also been multiple crypto scams, rug pulls, and cyber attacks over the years on major exchange platforms and marketplaces in the industry.  Related Reading: ETH Gate Saga Continues: What Is Lubin’s ‘Piece Of Paper’? Presently, the crypto industry is slowly gaining back its strength and advancing rapidly, as seen in some major innovative developments like the integration of spot Bitcoin ETFs, and Ethereum spot ETFs. The ecosystem is also thriving with new infrastructure upgrades and improvements in the DeFi ecosystem, ensuring the sustainability and longevity of the industry. Featured image from CNBC, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T08:49:30.000Z",
    "title": "Billion-Dollar Wallet Provider Copper Enhances Stellar (XLM) Network Integration for Wealthy Institutional Clients",
    "url": "https://www.crypto-news-flash.com/billion-dollar-wallet-provider-copper-enhances-stellar-xlm-network-integration-for-wealthy-institutional-clients/?utm_source=rss&utm_medium=rss&utm_campaign=billion-dollar-wallet-provider-copper-enhances-stellar-xlm-network-integration-for-wealthy-institutional-clients",
    "description": "<img width=\"1000\" height=\"625\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszewski-Stellar-Lumens.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Stellar Lumens Copper.co\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszewski-Stellar-Lumens.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszewski-Stellar-Lumens-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszewski-Stellar-Lumens-768x480.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszewski-Stellar-Lumens-343x215.jpg 343w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszewski-Stellar-Lumens-326x205.jpg 326w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszewski-Stellar-Lumens-163x102.jpg 163w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Copper.co, a digital asset custodian, has enhanced its integration with Stellar, a blockchain network. Institutional clients of Copper.co can now trade more tokens on the Stellar blockchain, including Stellar USDC. Copper.co, a prominent digital asset custodian, has announced a significant enhancement to its integration with the Stellar blockchain network. This upgrade allows institutional clients to [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-28T08:57:59.000Z",
    "title": "Top Solana Coins in Q3-2023",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-solana-coins-in-q3-2023/",
    "description": "<p>Its remarkable speed and cost-efficiency even outpace Ethereum, the widely recognized leader in the field. As we step into Q4 2023, it&#8217;s time to explore the Solana projects that hold promise for investment in the post-FTX era. Let&#8217;s take a closer look! 1) Marinade Finance ($MNDE) Marinade Finance is a non-custodial liquid staking protocol meticulously [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-solana-coins-in-q3-2023/\">Top Solana Coins in Q3-2023</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-28T08:53:00.000Z",
    "title": "Binance Opts Turkey’s Istanbul for Binance Blockchain Event",
    "url": "https://coinedition.com/binance-opts-turkeys-istanbul-for-binance-blockchain-event/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/BinanceUS_Claims_41_Of_Coinbases_Global_Trading_Volume_in_a_Week.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/BinanceUS_Claims_41_Of_Coinbases_Global_Trading_Volume_in_a_Week.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/BinanceUS_Claims_41_Of_Coinbases_Global_Trading_Volume_in_a_Week-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/BinanceUS_Claims_41_Of_Coinbases_Global_Trading_Volume_in_a_Week-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/BinanceUS_Claims_41_Of_Coinbases_Global_Trading_Volume_in_a_Week-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/BinanceUS_Claims_41_Of_Coinbases_Global_Trading_Volume_in_a_Week-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/BinanceUS_Claims_41_Of_Coinbases_Global_Trading_Volume_in_a_Week-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Turkey garners attention in the highly competitive crypto space with its tremendous crypto-friendly environment and stupendous crypto adoption. Acknowledging the vast opportunities of the transcontinental country, Binance has chosen Istanbul as the venue for the upcoming Binance Blockchain Week, scheduled for November, 8-9. Binance Blockchain Week is a yearly gathering of traders, founders, investors, regulators, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-opts-turkeys-istanbul-for-binance-blockchain-event/\">Binance Opts Turkey’s Istanbul for Binance Blockchain Event</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]