[
  {
    "source": "CryptoGlobe",
    "date": "2023-11-08T01:00:00.000Z",
    "title": "XRP Price Could Skyrocket to Surpass $10 Within a Month, Crypto Analyst Says",
    "url": "https://www.cryptoglobe.com/latest/2023/11/xrp-price-could-skyrocket-to-surpass-10-within-a-month-crypto-analyst-says/",
    "description": "A popular cryptocurrency analyst has recently suggested that the price of XRP, the native token of the XRP Ledger, could soon go “parabolic,” as based on its historical data it could soon move up between 1,000% and 1,485%. According to a post shared on the microblogging platform X (formerly known as Twitter) by Cryptoinsightuk, on […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-08T01:00:36.000Z",
    "title": "Bitcoin On The Brink? Analyst Predicts Soaring Open Interest May Signal 20% Price Correction",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-on-the-brink-analyst-predicts-open-interest/",
    "description": "Bitcoin&#8217;s open interest—the total number of outstanding derivative contracts that have not been settled—has surged to levels not seen in over six months. Amid these high-interest levels, market analysts warn that Bitcoin may see a 20% price correction. Analysts Weigh In On Market Implications The surge in open interest has been linked to a substantial increase in derivatives market activity. Financial commentator Tedtalksmacro hinted at the potential market shifts, noting a significant addition to open interest, which could indicate impending &#8220;fireworks&#8221; in the market. Almost 10k BTC (~$350MM USD) in open interest added today. Fireworks soon. — tedtalksmacro (@tedtalksmacro) November 7, 2023 With more than $16 billion in open interest recorded currently, according to data from CoinGlass, the market is witnessing noticeable fluctuations that could spell out more significant changes in Bitcoin&#8217;s valuation. Related Reading: Crypto Forecast: Analyst Predicts ‘Santa Claus Squeeze’ May Deliver Year-End Gains So far, analysts are keenly observing these fluctuations, interpreting them as signals for future market movements. James Van Straten from CryptoSlate pointed out the record open interest in the CME exchange, often &#8220;preferred by institutional investors.&#8221; The analyst noted: The CME exchange, preferred by institutional investors, has achieved a new record in open interest, with 105,380 BTC contracts open, valued at $3.68 billion. Binance has edged past this figure with open interest of approximately 113,500 BTC. With Binance&#8217;s open interest slightly surpassing the CME&#8217;s figures, Van Straten suggests that this trend could indicate a growing interest in Bitcoin futures, which may reflect a &#8220;positive shift&#8221; in market sentiment or a strategic move by investors to adopt &#8220;protective strategies.&#8221; The implications of this rising open interest, however, are not universally seen as positive. J. A. Maartunn from CryptoQuant cautioned that such high open interest levels have historically preceded price drawdowns of at least 20% for Bitcoin. This pattern, he argues, warrants &#8220;significant attention&#8221; as it could indicate an upcoming price correction.  Bitcoin Latest Price Action The current trajectory of Bitcoin’s market performance has been discussed among analysts, particularly in light of the recent surge in open interest. Despite this interest, Bitcoin has experienced a slight pullback from its recent growth spurt. Related Reading: Bitcoin’s Price Tide: Could ASIC Miner Values Signal An Approaching Crypto Surge? At the time of writing, the cryptocurrency has seen a 1% decrease over the last day, now valued at $34,722. Meanwhile, over the last week, Bitcoin&#8217;s growth has been modest, charting a 1.4% increase, while the bi-weekly figures show a slightly 3.1% rise. This corrective movement in Bitcoin&#8217;s price is mirrored by a notable drop in its daily trading volume, which has fallen sharply from last week’s high of $21 billion to a current figure of just $3.8 billion within the past day. This reduction in volume may be indicative of a cooling off in trading activity. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-08T01:00:41.000Z",
    "title": "Analyst Who Accurately Called Bitcoin 2018 Bottom Predicts Big Ethereum Rally – But There’s a Catch",
    "url": "https://dailyhodl.com/2023/11/07/analyst-who-accurately-called-bitcoin-2018-bottom-predicts-big-ethereum-rally-but-theres-a-catch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/who-called-big-rally.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/who-called-big-rally.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/who-called-big-rally.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/who-called-big-rally.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/who-called-big-rally.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/who-called-big-rally.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/who-called-big-rally.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto analyst who correctly called Bitcoin’s (BTC) 2018 bottom thinks Ethereum (ETH) is primed to surge in the next few months. The pseudonymous trader Bluntz shares a chart with his 226,500 followers on the social media platform X that projects a brief correction for ETH before the asset jumps to nearly $2,400 in price [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/07/analyst-who-accurately-called-bitcoin-2018-bottom-predicts-big-ethereum-rally-but-theres-a-catch/\">Analyst Who Accurately Called Bitcoin 2018 Bottom Predicts Big Ethereum Rally – But There’s a Catch</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]