[
  {
    "source": "CryptoSlate",
    "date": "2023-12-07T12:25:34.000Z",
    "title": "Bitcoin transaction fees surge, rivaling Ethereum daily gas fee totals",
    "url": "https://cryptoslate.com/insights/bitcoin-transaction-fees-surge-rivaling-ethereum-daily-gas-fee-totals/",
    "description": "<p>Quick Take Bitcoin transaction fees have witnessed a significant uptick recently, echoing patterns seen last month during the Inscription frenzy. This time, however, the catalyst appears to be an increase in transactions awaiting confirmation in the Bitcoin network&#8217;s mempool. The volume of coins in transactions held in the mempool reached 88,000 BTC. Furthermore, a detailed [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-transaction-fees-surge-rivaling-ethereum-daily-gas-fee-totals/\">Bitcoin transaction fees surge, rivaling Ethereum daily gas fee totals</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-07T12:10:42.000Z",
    "title": "Ocean Mining defends accusations of censoring privacy-focused Bitcoin transactions by Samourai Wallet",
    "url": "https://cryptoslate.com/samourai-wallet-accuses-ocean-mining-of-censoring-privacy-focused-bitcoin-transactions/",
    "description": "<p>Samourai Wallet, a Bitcoin mobile app wallet, accused Ocean Mining, a decentralized BTC mining pool, of censoring &#8220;privacy enhancing transactions&#8221; on the blockchain network in an extensive Dec. 7 thread on social media platform X (formerly Twitter). However, Ocean Mining&#8217;s top executive retorted that a bug in Samurai&#8217;s system caused the problem. The issue The [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/samourai-wallet-accuses-ocean-mining-of-censoring-privacy-focused-bitcoin-transactions/\">Ocean Mining defends accusations of censoring privacy-focused Bitcoin transactions by Samourai Wallet</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-07T12:30:28.000Z",
    "title": "Zero Knowledge Rollups as a Service Hasten the ‘Implementation of Secure and Scalable Networks’ — Alvaro Fernandez",
    "url": "https://news.bitcoin.com/zero-knowledge-rollups-as-a-service-hasten-the-implementation-of-secure-and-scalable-networks-alvaro-fernandez/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/gooon-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Zero Knowledge Rollups as a Service Hasten the &#039;Implementation of Secure and Scalable Networks&#039; — Alvaro Fernandez\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/gooon-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/gooon-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/gooon-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/gooon-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/gooon-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/gooon-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/gooon.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Alvaro Fernandez, the Chief Operations Officer (COO) at Lumoz, has stated that while zero-knowledge rollups have demonstrated exceptional security and scalability, the technology is still not user-friendly. To address this issue, networks should opt for ZK Rollups-as-a-Service (ZK-RaaS) because this simplifies the creation process for a single ZK-Rollup. This makes them &#8220;more accessible for developers [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-07T12:38:08.000Z",
    "title": "AI Algorithm Enhances Road Safety by Monitoring Driver Workload",
    "url": "https://www.cryptopolitan.com/ai-algorithm-enhances-road-safety-driver/",
    "description": "Researchers from the University of Cambridge, in collaboration with Jaguar Land Rover (JLR), have developed an adaptable algorithm that has the potential to significantly improve road safety by predicting when drivers can safely interact with in-vehicle systems or receive messages while driving. This innovative approach combines on-road experiments with machine learning techniques to continuously measure ... <a title=\"AI Algorithm Enhances Road Safety by Monitoring Driver Workload\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-algorithm-enhances-road-safety-driver/\" aria-label=\"More on AI Algorithm Enhances Road Safety by Monitoring Driver Workload\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-07T12:36:10.000Z",
    "title": "Crypto clarity debate heats up in Congress: SEC grilled on regulation",
    "url": "https://www.cryptopolitan.com/crypto-clarity-debate-heats-up-in-congress/",
    "description": "In a recent congressional hearing, U.S. Congressman Tom Emmer engaged in a heated exchange with Valerie Szczepanik, the Head of the Strategic Hub for Innovation and Financial Technology at the U.S. Securities and Exchange Commission (SEC). The interrogation focused on the SEC&#8217;s approach to crypto regulation and the level of clarity provided to the market ... <a title=\"Crypto clarity debate heats up in Congress: SEC grilled on regulation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-clarity-debate-heats-up-in-congress/\" aria-label=\"More on Crypto clarity debate heats up in Congress: SEC grilled on regulation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-07T12:29:16.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 Aptos Price Prediction 2023 – up to $8.25 Aptos Price Prediction 2026 – up to $30.38 Aptos Price Prediction 2029 – up to $94.60 Aptos Price Prediction 2032 – up to $293.92 As we venture into 2023 to 2032, the next decade promises to be a critical period for Aptos as ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-07T12:15:49.000Z",
    "title": "Riot Blockchain spends a huge $290 million on Bitcoin miners",
    "url": "https://www.cryptopolitan.com/riot-blockchain-spend-290m-on-bitcoin-miners/",
    "description": "Riot Blockchain, a prominent player in the Bitcoin mining industry, is gearing up for the anticipated Bitcoin halving event in April 2024 with a substantial expansion of its mining operations. The company has announced the acquisition of 66,560 mining rigs from MicroBT, marking one of the most significant increases in hash rate capacity in its ... <a title=\"Riot Blockchain spends a huge $290 million on Bitcoin miners\" class=\"read-more\" href=\"https://www.cryptopolitan.com/riot-blockchain-spend-290m-on-bitcoin-miners/\" aria-label=\"More on Riot Blockchain spends a huge $290 million on Bitcoin miners\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-12-07T12:26:25.000Z",
    "title": "AVALANCHE PRICE ANALYSIS & PREDICTION (December 7) – $Avax Reaches A New Milestone With 15% Surge In A Day",
    "url": "https://nulltx.com/avalanche-price-analysis-prediction-december-7-avax-reaches-a-new-milestone-with-15-surge-in-a-day/",
    "description": "$Avax resumed bullish this week and flipped the previous resistance level after posting 38% gains in a week. It tapped a new multi-high and saw a slight rejection. More rallies are expected once the demand level keeps rising. Following last month’s correction, which pulled the price to from a high [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-07T12:22:13.000Z",
    "title": "Tether’s marketcap reaches new milestone of $90b",
    "url": "https://crypto.news/tethers-marketcap-reaches-new-milestone-of-90b/",
    "description": "The market capitalization of Tether&#8216;s stablecoin USDT has surpassed $90 billion. This indicates strong investor demand for stablecoins and the growth of their use in the digital economy. USDT currently accounts for about 70% of the stablecoin market. The market capitalization of&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-07T12:15:39.000Z",
    "title": "ARK Invest offloads another $24.3m in Coinbase shares, $3.5m in GBTC",
    "url": "https://crypto.news/ark-invest-offloads-another-24-3m-in-coinbase-shares-3-5m-in-gbtc/",
    "description": "Cathie Wood&#8217;s ARK Invest continued to sell Coinbase (COIN) shares for the third consecutive day, despite the crypto exchange&#8217;s share price hovering near a 19-month peak. The investment management company carried out sales of Coinbase shares through its different ETFs,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-07T12:30:08.000Z",
    "title": "Apollo Crypto Predicts Bitcoin Price Of $200,000 This Cycle, Here’s Why",
    "url": "https://www.newsbtc.com/news/bitcoin/apollo-crypto-bitcoin-price-200000-this-cycle/",
    "description": "Apollo Crypto, a renowned name in the field of cryptocurrency analysis, has recently released a comprehensive report predicting a significant surge in the Bitcoin price, potentially reaching as high as $200,000 in the current cycle. Authored by Henrik Andersson, the report delves into various factors that could contribute to this remarkable growth. A pivotal aspect of the report is the anticipated approval of the first spot Bitcoin Exchange-Traded Fund (ETF) in the United States. Eric Balchunas, the senior Bloomberg ETF analyst, is quoted saying, &#8220;There is a 90% chance of an approval by January 10, 2024.&#8221; This development is seen as a significant driver for Bitcoin&#8217;s price increase. The report elaborates on the interest from prominent asset managers in Bitcoin spot ETFs, asserting, &#8220;In our view, it is likely that the SEC won’t give preferential treatment to a single ETF issuer; therefore several of them are likely to get approval at the same time.&#8221; Bitcoin ETF Inflow Estimate And Multiplier Effect A key element in Apollo Crypto&#8217;s analysis is the potential new money inflow into Bitcoin ETFs. The report estimates this by considering the total size of US holdings of equities at $64.7 trillion. Related Reading: Bitcoin Poised For December Surge As Historical Patterns Suggest Strong Upside Ahead It assumes that 10% of these investors would allocate 1% to Bitcoin ETFs, leading to an estimated inflow of $65 billion. This number is cross-referenced with the total US ETF market size of $6.5 trillion, where Bitcoin ETFs are expected to capture 1%, aligning with the $65 billion inflow estimate. The concept of the &#8216;Bitcoin multiplier&#8217; is also central to the report&#8217;s analysis. This refers to the effect of each dollar inflow on Bitcoin’s market cap. The report cites the next BTC halving in April 2024, which will reduce the new supply of BTC, as a factor that could increase the multiplier effect. Referring to a Bank of America report titled &#8220;Bitcoin’s dirty little secrets,&#8221; Apollo Crypto notes, &#8220;For example, we estimate that a net inflow of just $93 million would result in price appreciation of 1%.&#8221; From this, they deduce a 114x multiplier effect as an upper bound but apply a more conservative estimate of 50x for their scenario. Related Reading: Bitcoin Bullish Fractal Returns: Analyst Predicts Another Leg-Up With Price Target Combining the inflow estimate and the multiplier effect, the report concludes that Bitcoin could reach $200,000 per coin in this cycle: Putting it all together leads us to believe that we could see $65 billion in inflow to Bitcoin ETFs in the coming cycle. Applying a 50x multiplier effect leads to an increased market cap of $3.25 trillion in which case we would see Bitcoin trading at $200,000 per coin. We realize this is a bold estimate with a lot of uncertainty. Flow-On Effect On Ethereum The report doesn&#8217;t stop at Bitcoin. It also analyzes the performance relationship between Bitcoin and Ethereum during the last bull market, using a specified period from September 2020 to November 2021. During this phase, the report notes, &#8220;Bitcoin increased 4.8x while Ethereum increased 9.8x; Ethereum increased twice as much as Bitcoin during this time.&#8221; This historical data is crucial as it indicates that Ethereum tends to have a higher beta, or sensitivity, to Bitcoin&#8217;s market movements. Building on this relationship, the report projects that if Bitcoin&#8217;s price were to quintuple &#8211; as suggested in their forecast from $40,000 to $200,000 &#8211; then based on the past market behavior, Ethereum could potentially experience a parallel and more pronounced surge. The report estimates, &#8220;If the relationship holds for the coming cycle and Bitcoin increases 5x, then Ethereum would reach $22,000.&#8221; At press time, BTC traded at $43,371. Featured image from Shutterstock, chart from TradingView.com"
  }
]