[
  {
    "source": "Cointelegraph",
    "date": "2023-10-05T11:45:00.000Z",
    "title": "Sam Bankman-Fried’s jets are subject to forfeiture, says prosecution ",
    "url": "https://cointelegraph.com/news/ftx-sam-bankman-fried-jets-forfeiture",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/eb5c6aca-9489-4458-801c-79425c60d075.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The U.S. Department of Justice says the two jets purchased by Bankman-Fried via FTX are now property that is subject to forfeiture due to charges brought against SBF. </p>\n                    <p><p>Sam Bankman-Fried’s (SBF) two multi-million dollar luxury jets are now subject to forfeiture, according to a <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590940/gov.uscourts.nysd.590940.314.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> from the United States Department of Justice (DOJ) on Oct. 4. </p><p>The document says that the possibility of forfeiture comes as a result of the “offenses described in Counts One through Four and Seven of Indictment 22 Cr. 673 (LAK)” which were brought against SBF. </p><p>The jets listed included a Bombardier Global and an Embraer Legacy aircraft. These two aircraft are currently at the heart of an ownership debacle between the government, SBF's former cryptocurrency exchange FTX and the aviation companies operating the jets Island Air Capital (IAC), according to documents filed on Sept. 21 with the Delaware Bankruptcy Court. </p><p>In the arguments the government has said both aircraft are subject to forfeiture due to being purchased with fraudulent funds, while FTX says the loans used to purchase the jets were not documented. </p><p>In December 2022, the U.S. Commodity Futures Trading Commission (CFTC) <a href=\"https://cointelegraph.com/news/cftc-files-lawsuit-against-sam-bankman-fried-ftx-and-alameda-for-fraud\">filed a lawsuit</a> against SBF, FTX and Alameda Research accusing the latter parties of being in violation of the Commodity Exchange Act. Accusations against SBF from the CFTC included “used FTX customer funds for a variety of personal expenditures” - one of which was the private jets.</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-sbf-trial-jury-revealed\"><strong><em>These 12 people will decide the fate of Sam Bankman-Fried</em></strong></a></p><p>This filing comes as Bankman-Fried currently sits <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\">on trial for criminal and fraud charges</a> related to the fall of FTX in November 2022. SBF has pleaded not guilty to all charges and is being heard by Judge Lewis Kaplan. </p><p>The trial began on Oct. 3 with a selection of the jury and <a href=\"https://cointelegraph.com/news/opening-arguments-sam-bankman-fried-trial\">opening arguments</a> from both the prosecution and the defense were heard the following day on Oct. 4. </p><p>The DOJ’s opening stance portrayed Bankman-Fried as deliberately deceiving customers and investors to get rich and expand his operations, while the defense argued for SBF as simply a young entrepreneur whose business plans “didn’t work out.”</p><p>The trial continues its proceedings on Oct.5. Cointelegraph is on the ground in New York with the latest updates on the trial. <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\">Follow live updates here</a>.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/us-government-250k-bitcoin-price-prediction-tim-draper-hall-of-flame/\"><strong><em>US gov’t messed up my $250K Bitcoin price prediction: Tim Draper, Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-05T11:43:59.000Z",
    "title": "Sam Bankman-Fried inner circle to testify today",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-inner-circle-testify-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/a77f0ca1-1485-4c2e-b930-1dc678023ab2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sam Bankman-Fried trial reaches the third day in Manhattan with Adam Yedidia and Gary Wang as witnesses.</p>\n                    <p><p>A young entrepreneur who made mistakes while running a crypto empire or a liar who stole and used people's money to enrich himself? In the first hours of Sam Bankman-Fried's six-week trial, that was the tone between his defense counsel and the prosecution.</p><p>The former FTX CEO is facing a total of seven charges related to fraud and conspiracy to commit fraud. He could spend over 100 years in prison if convicted of these charges.</p><p>At trial, Bankman-Fried appeared to be focused on his defense strategy, constantly checking his laptop and attorneys' paperwork. As his defense counsel delivered an opening statement, he turned his focus towards the 12 jurors who will decide if Bankman-Fried intentionally misused its customers' money or if mistakes were made in good faith.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-preview\"><strong><em>Sam Bankman-Fried FTX trial — 5 things you need to know</em></strong></a></p><p>Two witnesses testified on the first day of the trial, Marc Juilliard, a French trader who lost four Bitcoins worth over $100,000 in November 2022, and Adam Yedidia, a personal friend of SBF and a former employee of Alameda and FTX.</p><p>FTX advertising campaigns, celebrity endorsements, and SBF tweets were among the evidence used by prosecutors to prove that SBF lied to customers while defrauding them. </p><p>According to the defense, however, there's nothing wrong with hiring Tom Brady for an advertisement and filing for bankruptcy during a time of markets downturn.</p><p>The third day of the trial begins around 10:00 am in a federal court in lower Manhattan. It will feature Yedidia's second testimony stint along with Gary Wang, FTX co-founder and a key witness in the case.</p><p>Cointelegraph is on the ground in New York with the latest updates on the trial. <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\">Follow live updates here</a>.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-05T12:08:39.000Z",
    "title": "Manifold Finance Launches Auctions-based MEV Protocol For Validators",
    "url": "https://cryptodaily.co.uk/2023/10/manifold-finance-launches-auctions-based-mev-protocol-for-validators",
    "description": "According to Manifold Finance, the new protocol aims to redefine the dynamics of value capture and distribution from within the Ethereum network."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-05T11:48:12.000Z",
    "title": "Is Meme Kombat The Meme Coin Everyone Has Been Waiting For? Learn What Makes It So Special",
    "url": "https://cryptodaily.co.uk/2023/10/is-meme-kombat-the-meme-coin-everyone-has-been-waiting-for-learn-what-makes-it-so-special",
    "description": "Meme Kombat looks like it could transform the meme coin niche. We explain what makes the MK token and its offerings so special here, among other things."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-05T12:07:17.000Z",
    "title": "Report: FTX employees were aware of Alameda’s backdoor code",
    "url": "https://crypto.news/report-ftx-employees-were-aware-of-alamedas-backdoor-code/",
    "description": "Alameda Research used a secret backdoor in FTX to withdraw billions of dollars of customer funds, and some of the exchange's employees were aware "
  },
  {
    "source": "BTCManager",
    "date": "2023-10-05T11:44:09.000Z",
    "title": "Crypto exchanges in Estonia and Lithuania allegedly helped Russians circumvent sanctions",
    "url": "https://crypto.news/crypto-exchanges-in-estonia-and-lithuania-allegedly-helped-russians-circumvent-sanctions/",
    "description": "Crypto exchanges in Estonia and Latvia reportedly helped Russians circumvent sanctions and convert rubles into other currencies"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-05T12:00:27.000Z",
    "title": "Solana Price On Fire: October Red-Hot Prediction – $30 Within Reach?",
    "url": "https://www.newsbtc.com/news/solana-price-on-fire-october-red-hot-prediction-30-within-reach/",
    "description": "Solana (SOL) kicked off the month with a remarkable price surge, surging by more than 10% and decisively breaking through the local resistance level of $22. This substantial move has left traders and investors wondering if SOL has what it takes to sustain this bullish momentum and embark on a sustained recovery. The breakout from the $22 resistance, bolstered by a notable increase in trading volume, suggests a heightened level of confidence among buyers. It&#8217;s a clear signal that they are poised for further gains, but the question that looms large is whether this momentum is robust enough to support a prolonged upward trajectory for SOL. As SOL&#8217;s price demonstrates its ability to maintain levels above the $22 mark, a price analysis is eyeing an 11% potential gain, which could see the cryptocurrency challenging the $25 threshold. However, a broader perspective reveals that the ongoing recovery in SOL&#8217;s price is well within the confines of a channel pattern. Related Reading: Is XRP Growth Real Or Just Smoke And Mirrors? Here’s What Liquidation Data Shows Solana&#8217;s Strong Start: Breaking The Resistance Barrier The ascending trajectory of SOL&#8217;s price is expected to follow the upper trend line of this channel pattern. A breakout from either of these trendlines could serve as a catalyst for a directional rally, potentially amplifying the ongoing surge. However, the resurgence in supply pressure, coupled with Bitcoin&#8217;s recent reversion from the $28,000 level, has introduced a level of uncertainty into SOL&#8217;s price action. Analysis emphasizes that this intensified supply pressure materialized around the $24 mark, leading to a minor pullback. This pullback is seen as a valuable opportunity to assess the support strength of the recently breached level. SOL market cap nearing the $10 billion region. Chart: TradingView.com At the time of writing, SOL is trading at approximately $23 on CoinGecko, reflecting a marginal 0.3% decline over the past 24 hours. However, the cryptocurrency has witnessed an impressive 20.5% surge over the past seven days. SOL price ascent in the last week. Source: Coingecko The recent price surge has propelled Solana into the limelight, catapulting it to the position of the 8th largest cryptocurrency by market capitalization. In this remarkable ascent, SOL has overtaken popular cryptocurrencies such as Cardano (ADA) and Dogecoin (DOGE).  Charting SOL&#8217;s Course This past week has been especially robust for SOL, marking its strongest performance since mid-July and recording a staggering 38% increase from its September low. However, it&#8217;s worth noting that these figures remain a considerable distance from the peak levels seen during the bull market. Solana seven-day price movement. Source: Coingecko As the price of SOL experiences fluctuations, the cryptocurrency faces key resistance levels at $25 and $28. If bullish sentiment persists, the path to $30, the high reached in July, appears open. On the flip side, SOL enjoys support at $22 and $20 in case bears take control. Related Reading: Shiba Inu Investors Beware: 425 Billion Tokens On The Move – Is It A Sell-Out? Solana continues to shine as it surges up the market cap rankings. The coming days will reveal whether the cryptocurrency can sustain its momentum and potentially reach new heights or if it will encounter resistance along the way.  (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-05T11:40:29.000Z",
    "title": "Decoding the XRP Drama: Legal Expert Sheds Light on Ripple’s Tussle with SEC",
    "url": "https://www.crypto-news-flash.com/decoding-the-xrp-drama-legal-expert-sheds-light-on-ripples-tussle-with-sec/?utm_source=rss&utm_medium=rss&utm_campaign=decoding-the-xrp-drama-legal-expert-sheds-light-on-ripples-tussle-with-sec",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-154.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-154.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-154-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-154-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The federal court confirms XRP as non-security, penalizing Ripple with a $700 million fine. The SEC&#8217;s next steps involve either proceeding to trial, settling, or dismissing the Ripple case. The Court&#8217;s Stand on Ripple vs. SEC In a pivotal ruling, the federal court, led by Judge Analisa Torres, put a damper on the SEC&#8217;s endeavors [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-05T11:49:00.000Z",
    "title": "4 Cryptocurrencies to Watch as Their Supplies Enter Exchanges",
    "url": "https://coinedition.com/4-cryptocurrencies-to-watch-as-their-supplies-enter-exchanges/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon.jpg 730w, https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/10/FET_LRC_REN_and_TVK_Could_Experience_Increased_Volatility_Soon-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The blockchain intelligence firm Santiment revealed in an X post yesterday that altcoins are continually failing to reach consensus regarding what direction their prices should move. Meanwhile, Fetch.ai (FET), Loopring (LRC), Ren (REN) and Virtua (TVK) have seen more and more of their supplies shift onto exchange platforms. According to the firm, this increased amount [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/4-cryptocurrencies-to-watch-as-their-supplies-enter-exchanges/\">4 Cryptocurrencies to Watch as Their Supplies Enter Exchanges</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-05T11:45:58.000Z",
    "title": "Bitcoin Could Plunge by Over 60% as One Massive Risk Looms, According to Bloomberg Analyst Mike McGlone",
    "url": "https://dailyhodl.com/2023/10/05/bitcoin-could-plunge-by-over-60-as-one-massive-risk-looms-according-to-bloomberg-analyst-mike-mcglone/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Could-Plunge-60.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Could-Plunge-60.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Could-Plunge-60.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Could-Plunge-60.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Could-Plunge-60.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Could-Plunge-60.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Could-Plunge-60.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bloomberg Intelligence senior macro strategist Mike McGlone says Bitcoin (BTC) could be staring down the barrel of a 60% price plunge. McGlone says the key indicator for BTC is that liquidity remains negative and global rates continue to rise &#8220;despite recession signals.&#8221; The analyst still believes the US will endure a recession by the end [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/05/bitcoin-could-plunge-by-over-60-as-one-massive-risk-looms-according-to-bloomberg-analyst-mike-mcglone/\">Bitcoin Could Plunge by Over 60% as One Massive Risk Looms, According to Bloomberg Analyst Mike McGlone</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]