[
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T08:53:49.000Z",
    "title": " Bitcoin short ETPs record $1M weekly outflow anticipating spot BTC ETF approval ",
    "url": "https://cointelegraph.com/news/bitcoin-short-etps-1m-outflows-spot-btc-etf-approval",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNzEzNTEwOWQtOGZjZi00YWNkLWI0YjEtMThmMzgwZWFhOTY2LkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>There was an outflow of investment from various Bitcoin short investment products totaling over $1 million, suggesting that traders are bullish on the potential spot Bitcoin ETF. </p>\n                    <p><p>The digital asset investment products or exchange-traded products (ETPs) saw inflows of $151 million in the first week of 2024, according to <a href=\"https://blog.coinshares.com/volume-164-digital-asset-fund-flows-weekly-report-1df57aabb9c5\" target=\"_blank\" rel=\"noopener nofollow\">data </a>shared by CoinShares. The latest week of inflow brought the total inflows since the <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">Grayscale vs. SEC lawsuit</a> to $2.3 billion. </p><p>The latest digital asset investment flow data paints a bullish picture for the crypto ecosystem in the lead-up to the <a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-inevitable-sec-chair-former-jay-clayton\">potential approval of the first spot Bitcoin exchange-traded fund (ETF) in the United States</a> as U.S based exchanges contributed 55% of the total investment flow over the past week.</p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) contributed the largest share of inflows at $113 million, followed by Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) at $29.6 million. Altcoins that saw notable inflows include Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>), Avalanche (<a href=\"https://cointelegraph.com/avalanche-price-index\">AVAX</a>) and Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>), with $3.7 million, $2 million and $1.4 million, respectively.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-short-etps-1m-outflows-spot-btc-etf-approval\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-09T08:53:13.000Z",
    "title": "CFTC Report On DeFi Highlights Significant Regulatory Concerns",
    "url": "https://cryptodaily.co.uk/2024/01/cftc-report-on-defi-highlights-significant-regulatory-concerns",
    "description": "The United States Commodity Futures Trading Commission (CFTC) has released a detailed report on the challenges faced by decentralized finance (DeFi)."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T09:03:55.000Z",
    "title": "OpenAI Dismisses New York Times Lawsuit, Alleges Manipulation of AI Model",
    "url": "https://www.cryptopolitan.com/openai-dismisses-new-york-times-lawsuit/",
    "description": "In response to The New York Times&#8217; recent lawsuit against OpenAI, the leading artificial intelligence research organization has issued an official statement firmly rejecting the allegations. OpenAI contends that The New York Times manipulated prompts to induce AI models to regurgitate data related to their articles without permission. The lawsuit, filed on December 27, 2023, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T09:01:17.000Z",
    "title": "Ripple vs. SEC: Rispoli predicts potential outcomes",
    "url": "https://www.cryptopolitan.com/ripple-vs-sec-rispoli-predicts-potential/",
    "description": "In the ongoing legal battle between the U.S. Securities and Exchange Commission (SEC) and Ripple, a quiet period has raised questions and speculations among the XRP community. Legal expert Fred Rispoli recently shared his insights on this silence&#8217;s possible implications and outcomes on a social media platform. Rispoli analyzes SEC&#8217;s inactivity in Ripple lawsuit Since [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T08:55:49.000Z",
    "title": "Bitcoin rockets to the moon: A historic mission marks the dawn of a lunar crypto economy",
    "url": "https://www.cryptopolitan.com/bitcoin-rockets-to-the-moon-a-historic/",
    "description": "In a groundbreaking move that merges the realms of cryptocurrency and space exploration, the cryptocurrency derivatives exchange BitMEX has successfully launched a physical Bitcoin wallet containing at least 1 BTC to the moon.&#160; This historic mission marks a significant milestone in space exploration and represents the first step toward establishing a monetary system for a [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-09T08:45:16.000Z",
    "title": "Favorite Cryptocurrencies of Big Investors: THORChain, Rebel Satoshi, and Bitcoin Cash",
    "url": "https://nulltx.com/favorite-cryptocurrencies-of-big-investors-thorchain-rebel-satoshi-and-bitcoin-cash/",
    "description": "TLDR: THORChain gained 172% in Q4 2023, and experts predict more growth in 2024. Bitcoin Cash jumped 15% in Q4 2023, and analysts believe a bull run is coming. Rebel Satoshi attracts more investors after surging 100% and promising more gains. The crypto market performed incredibly well during Q4 2023, [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-09T08:43:02.000Z",
    "title": "Regretting Not Investing in Solana and Cardano? Is This the Right Moment to Consider This Cryptocurrency?",
    "url": "https://nulltx.com/regretting-not-investing-in-solana-and-cardano-is-this-the-right-moment-to-consider-this-cryptocurrency/",
    "description": "As Solana (SOL) NFTs sales took a huge leap, surpassing Ethereum in December, Cardano (ADA) ties partnership with Petrobras. Both SOL and ADA have seen a big jump over the past months. Meanwhile, investors find the right moment to capture their sight on one of the new DeFi projects, Borroe [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-09T09:00:47.000Z",
    "title": "Spot Bitcoin ETFs Could Trade 8% Above Fair Value: Renowned Expert",
    "url": "https://www.newsbtc.com/news/bitcoin/spot-bitcoin-etfs-8-above-fair-value/",
    "description": "In a recent interview with Bloomberg, Reggie Browne, Co-Global Head of ETF Trading and Sales at GTS, shared insightful predictions regarding the potential trading dynamics of spot Bitcoin exchange-traded funds (ETFs). Browne foresees these ETFs trading at a significant premium, estimating as high as 8% above their net asset value (NAV). Why Spot Bitcoin ETFs Could Trade At A 8% Premium To NAV &#8220;I think the spreads will be very competitive and tight. The market maker community is resilient and prepared to offer a lot of liquidity,&#8221; Browne stated. However, he highlighted a critical concern, saying, &#8220;I think it&#8217;s going to be the premium to NAV&#8230; US broker dealers can&#8217;t trade Bitcoin cash inside their broker dealers. So you’re going to have to trade hedges over futures and trade it on a premium, and then take that off, and I think there is a lot of complexity there.&#8221; This complexity, according to Browne, arises from the cash creation model forced by the SEC and regulatory constraints that limit direct Bitcoin trading within US broker dealers, compelling them to rely on futures for hedging. He expressed, &#8220;What I think, potentially, you could see 8% of premium above fair value. It&#8217;s a big number, but let&#8217;s see how it plays out.&#8221; Related Reading: Former SEC Chair Affirms: ‘Nothing Left To Decide,’ Bitcoin ETF Approval Imminent Additionally, Browne touched upon the subject of in-kind creations and redemptions, aspects that were points of contention during negotiations with the Securities and Exchange Commission (SEC). Despite the challenges, he remains optimistic about their future implementation. &#8220;Absolutely, I think this was really just to get the ball moving&#8230; the in-kind will come after we climb a couple of mountains,&#8221; Browne remarked. Echoing Browne&#8217;s sentiments, Eric Balchunas, a Bloomberg ETF expert, commented on the potential premium, expressing surprise at the anticipated high rate. He drew a comparison with Canada&#8217;s spot ETFs, which are also cash creations but have much smaller premiums, despite occasional spikes. [Browne] thinks bid-ask spreads on spot ETFs will be tight but (thx to cash only creations) premiums could be as high as 8%. That’s really high and I’m a bit shocked tbh. For context Canada spot ETFs are cash creations and their premiums are very small.. albeit the occasional 2% day. Related Reading: Why This Analyst Thinks It’s Impossible For The Bitcoin ETF To Be Priced In The crypto community is closely monitoring the SEC as it approaches a critical deadline to decide on the first batch of several spot Bitcoin ETF applications by tomorrow, January 10. Prominent asset managers such as BlackRock, Fidelity, Ark Invest, Bitwise, Franklin Templeton, Grayscale, WisdomTree, and Valkyrie are among those with pending applications. Browne believes that the approval of spot Bitcoin ETFs could attract substantial investor interest, projecting massive inflows over the first year. “I expect investors to add at least $2 billion to spot Bitcoin ETFs within the first 30 days they trade, if approved. For the full year, I see $10 billion-$20 billion in the funds,&#8221; he noted. This prediction underscores the significant interest and potential market impact of spot Bitcoin ETFs. At press time, BTC traded at $46,768. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-09T09:00:49.000Z",
    "title": "Bitcoin (BTC) Indicator Hits $45k Hurdle; Monero (XMR) and InQubeta (QUBE) Ready for Upward Trajectories",
    "url": "https://www.crypto-news-flash.com/bitcoin-btc-indicator-hits-45k-hurdle-monero-xmr-and-inqubeta-qube-ready-for-upward-trajectories/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-btc-indicator-hits-45k-hurdle-monero-xmr-and-inqubeta-qube-ready-for-upward-trajectories",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-57-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-57-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-57-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-57-1-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-57-1-450x301.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Bitcoin spiked above $45,000 at the start of the year for the first time since April 2022, continuing a scorching recent run by the world&#8217;s largest cryptocurrency. Bitcoin hit an intraday high of $45,519.52 at around 10.30 p.m. EST on Monday, marking a 21-month peak, having gained 156% in 2023, which is pretty impressive in [...]"
  }
]