[
  {
    "source": "CryptoSlate",
    "date": "2023-05-29T16:56:38.000Z",
    "title": "BKEX freezes withdrawals amid money laundering probe",
    "url": "https://cryptoslate.com/bkex-freezes-withdrawals-amid-money-laundering-probe/",
    "description": "<p>Crypto exchange BKEX suspended withdrawals after funds on its platform were used for money laundering, according to a May 29 statement. BKEX stated that its users&#8217; funds were involved in money laundering, adding that it was cooperating with law enforcement agencies to gather evidence. Due to this, the exchange suspended withdrawals for an undisclosed period. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bkex-freezes-withdrawals-amid-money-laundering-probe/\">BKEX freezes withdrawals amid money laundering probe</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-29T17:00:28.000Z",
    "title": "Undeads Metaverse Starts Building The New Endless Runner Mini-Game",
    "url": "https://news.bitcoin.com/undeads-metaverse-starts-building-the-new-endless-runner-mini-game/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/1280x720-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/1280x720-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/1280x720-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/1280x720-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/1280x720-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/1280x720-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/1280x720-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/1280x720.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Hot on the heels of generating $1M in sales in sold-out first mint event, Undeads Metaverse is excited to announce the development of another zombie-filled game that will allow NFT holders to earn rewards on their Undead NFTs sooner than anticipated. The new game, &#8220;Undeads Runner,&#8221; was inspired by Yuga Labs&#8217; Dookey Dash [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T16:57:38.000Z",
    "title": "Floki Inu token sees surge in trading volumes amid China-focused expansion of Valhalla Metaverse game",
    "url": "https://www.cryptopolitan.com/floki-inu-token-sees-surge-in-trading-volumes-amid-china-focused-expansion-of-valhalla-metaverse-game/",
    "description": "Floki Inu (FLOKI), a token inspired by the popular Shiba Inu dog breed, witnessed a remarkable surge in trading volumes, with a staggering 232.83% increase on Monday. This surge marks the highest level of trading activity seen in over three weeks for the cryptocurrency. The renewed interest in Floki Inu can be attributed to its ... <a title=\"Floki Inu token sees surge in trading volumes amid China-focused expansion of Valhalla Metaverse game\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-token-sees-surge-in-trading-volumes-amid-china-focused-expansion-of-valhalla-metaverse-game/\" aria-label=\"More on Floki Inu token sees surge in trading volumes amid China-focused expansion of Valhalla Metaverse game\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-29T16:40:34.000Z",
    "title": "Bybit set to expand into Kazakhstan following regulatory approval",
    "url": "https://crypto.news/bybit-set-to-expand-into-kazakhstan-following-regulatory-approval/",
    "description": "Bybit, currently the second-largest cryptocurrency derivative exchange worldwide by volume, has been granted in-principle approval by the Astana Financial Services Authority (AFSA) of Kazakhstan to offer a range of crypto services. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-29T17:00:39.000Z",
    "title": "Get Rich Or Get Rugged? RUGME’s Unique Liquidity Mechanism Sparks Controversy",
    "url": "https://www.newsbtc.com/news/get-rich-or-get-rugged-rugme-unique-liquidity-mechanism-sparks-controversy/",
    "description": "In the cryptocurrency world, a new token has emerged, causing a stir among investors. Rug Me (RUGME) has a unique liquidity mechanism that is daring investors to try to “rug” the contract.  According to the DeFi researcher Tsubasa, the token comes with a big brain game that challenges the most intelligent investors to solve a complex puzzle, promising high rewards. However, there is a catch. If someone is smart enough to solve the puzzle, they can rug the liquidity and take 20% of the pool. Rugging the liquidity means that someone can pull out a significant amount of funds from the pool and cause the token&#8217;s value to drop rapidly. This can result in significant losses for investors who hold the token. Related Reading: Polkadot Experiences Correction After Reaching $5.54: What’s Next In Store? RUGME, Big Brain Game, Or Big Risk? RUGME has a 1 trillion supply, with 100% of the supply used as liquidity. The token has a 10% transfer and buy fee, with no selling fee. All fees are disbursed to holders, who can claim them from the contract. When the liquidity is rug-pulled, 20% goes to the rugger, and 80% is refunded to the holders. Furthermore, Tsubasa believes investing in Rug Me is not for the faint. The token is high-risk and high-reward, with the potential for significant loss. However, Rug Me (RUGME) offers a unique and exciting investment opportunity for investors willing to take the risk. Despite the risk, investors are flocking to RUGME, with 15 ETH already in the liquidity pool. The token has a 100e curve, meaning that any buy below 100e will get the same price, with no first-comer advantage. The token has a 10% transfer and buy fee, with all fees disbursed to holders who can claim from the contract. This mechanism incentivizes holding the token, as holders can earn fees every time the token is transferred or bought. The flat pricing below 100e makes it easier for investors to enter the market at the same price point as others rather than being at a disadvantage due to coming in later. The earlier investors are, the more fees they earn from buys. However, after 100e, the price will start moving, and if people keep buying, the price could skyrocket. But the risk of rug-pulling is ever-present, and investors need to know the potential for loss. Is The Memecoin Craze Losing Steam? Signs Point To A Slowdown The Pepe (PEPE) token, a meme-inspired cryptocurrency, recently experienced a surge in popularity that saw its price skyrocket from $0.00000002764 on April 17 to a high of $0.000004354 on May 5. However, the frenzy has cooled considerably, leaving many investors wondering if the Pepe (PEPE) craze is over. Currently, the token is trading at $0.0000014390, Down by 1% in the last 24 hours and more than 7% in the seven-day time frame.  According to data from CoinGecko, the price of Pepe (PEPE) has fallen by more than 63% from its all-time high on May 5. Additionally, the daily transaction volume, which peaked at over $1 billion, has dropped to $270 million over the last 24 hours. Onchain data reveals a significant decline in interest in PEPE as the frenzy appears to end. Related Reading: No All-Time High For Bitcoin In 2023, Former BitMEX Head Arthur Hayes Predicts While the recent surge in popularity of meme-inspired cryptocurrencies like Pepe has captured the attention of investors, there are concerns about the sustainability of these coins. Many of them are highly speculative investments with no real-world use case or underlying value, and the recent drop-off in interest in Pepe (PEPE) seems to indicate that the hype may have been short-lived. Featured image from Unsplash, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-29T16:48:21.000Z",
    "title": "Litecoin Achieves Impressive Milestones as Halving Event Inches Closer – Will LTC Price Reach a New All-Time High of $500? Report",
    "url": "https://www.crypto-news-flash.com/litecoin-achieves-impressive-milestones-as-halving-event-inches-closer-will-ltc-price-reach-a-new-all-time-high-of-500-report/?utm_source=rss&utm_medium=rss&utm_campaign=litecoin-achieves-impressive-milestones-as-halving-event-inches-closer-will-ltc-price-reach-a-new-all-time-high-of-500-report",
    "description": "<p>Open interest for Litecoin’s futures derivatives contracts has surged past a staggering $420 million.  Data from Glassnode reveals that Litecoin addresses have surpassed those of Bitcoin.  Litecoin (LTC), a long-standing altcoin related to Bitcoin is preparing for yet another halving. Market players are convinced that the asset will benefit investors and traders, with demand for [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/litecoin-achieves-impressive-milestones-as-halving-event-inches-closer-will-ltc-price-reach-a-new-all-time-high-of-500-report/\">Litecoin Achieves Impressive Milestones as Halving Event Inches Closer &#8211; Will LTC Price Reach a New All-Time High of $500? Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-29T16:56:04.000Z",
    "title": "Bitcoin.com’s VERSE Token Now Available for Trading on Kucoin",
    "url": "https://dailyhodl.com/2023/05/29/bitcoin-coms-verse-token-now-available-for-trading-on-kucoin/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin.com-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin.com-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin.com-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin.com-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin.com-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin.com-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>May 29, 2023 – Tokyo, Japan Bitcoin.com’s ecosystem token, VERSE, has been listed on Kucoin, a top-tier cryptocurrency exchange platform known for being the home of crypto gems. Trading is open now, with the initial pair being VERSE/USDT. A milestone moment for Bitcoin.com, this first exchange listing for VERSE is significant because it amplifies the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/29/bitcoin-coms-verse-token-now-available-for-trading-on-kucoin/\">Bitcoin.com’s VERSE Token Now Available for Trading on Kucoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-29T16:55:26.000Z",
    "title": "ARK Invest’s Cathie Wood Says Tech Giants Google, Apple and Amazon About To Be Disrupted by AI",
    "url": "https://dailyhodl.com/2023/05/29/ark-invests-cathie-wood-says-tech-giants-google-apple-and-amazon-about-to-be-disrupted-by-ai/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/Details-One-Altcoin-That-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/Details-One-Altcoin-That-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/Details-One-Altcoin-That-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/Details-One-Altcoin-That-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/Details-One-Altcoin-That-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/Details-One-Altcoin-That-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/Details-One-Altcoin-That-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Cathie Wood of ARK Invest says that the ruling giants of the technology industry are at risk of being disrupted by artificial intelligence (AI). In a new interview with Bloomberg, Wood says that ChatGPT could potentially enhance Google&#8217;s products and services, but could also destroy them by taking away the tech giant&#8217;s advertising revenue. She [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/29/ark-invests-cathie-wood-says-tech-giants-google-apple-and-amazon-about-to-be-disrupted-by-ai/\">ARK Invest’s Cathie Wood Says Tech Giants Google, Apple and Amazon About To Be Disrupted by AI</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]