[
  {
    "source": "Cointelegraph",
    "date": "2023-09-26T13:01:00.000Z",
    "title": "‘Massive’ crypto use cases to surface by 2030 — Coinbase exec",
    "url": "https://cointelegraph.com/news/crypto-use-cases-coinbase-jesse-pollack",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/c6012794-4ded-4935-9356-50633229bff5.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cointelegraph talks with Coinbase protocols lead and Base creator Jesse Pollak about the company’s new blockchain, which is already a force to be reckoned with.</p>\n                    <p><p>Coinbase launched Base, its new blockchain, in late July, and it has already become a major player among Ethereum-based layer-2 chains. </p><p>On Sept. 21, for instance, the chain <a href=\"https://basescan.org/chart/tx\" target=\"_blank\" rel=\"noopener nofollow\">notched</a> some 677,000 transactions, with 870,163 “new addresses seen,” according to Etherscan. </p><p>By comparison, Arbitrum, a prominent layer 2 that launched in June 2021, <a href=\"https://arbiscan.io/chart/tx\" target=\"_blank\" rel=\"noopener nofollow\">had</a> 925,000 transactions and 54,233 new addresses on the same day.</p><p>Base is now hosting hundreds of decentralized projects, Jesse Pollak, head of protocols at Coinbase, told Cointelegraph at Messari’s Mainnet conference in New York City on Wednesday, Sept. 20, including decentralized inflation oracles, restaurant rewards projects, an insurance aggregator and everything in between. </p><p>A major force behind the Base project, Pollak sat down with Cointelegraph at Mainnet for a Q&A encompassing Coinbase’s vision for its new platform, the rising promise of decentralized applications (DApps) and the evolution of blockchain technology. </p><p><strong>Cointelegraph: You’ve said Base was created with a “clear vision: </strong><strong>bring the next million builders and billion users on-chain.”</strong><strong> Those are big numbers. How long will they take to achieve?</strong></p><p><strong>Jesse Pollak</strong>: It’s less about Base specifically and more about a billion users coming on-chain — embracing the power of this new platform [i.e., blockchain] that’s transparent, open, global — and developing apps that can improve people’s lives. Base is obviously going to play a big role in that, but it’s much bigger than just us. We really see our role as helping grow that pie.</p><p><strong>CT: And the timeline? </strong></p><p><strong>JP:</strong> I see it happening this decade, i.e., one million developer jobs by 2030. There’s already been massive change in the 2020s — not just in the industry but the entire world. It’s going to happen faster than people might expect.</p><p><strong>CT: What still needs to be done before we see mainstream adoption? </strong></p><p><strong>JP</strong>: Three high-level things need to happen. First, we need to make it cheaper for people to use these apps that are being built. We’ve done the first few orders of magnitude of cost reduction with Base. The same app might have cost $5 or $10 to use now costs 5 to 10 cents. </p><p>But we don’t think that’s enough. We really want to lower it so far that the cost is almost imperceptible to users.</p><p>Second, we want to make it easier for people to use these apps. A lot of that is building better wallet experiences.</p><p>Third, we need to have better identity infrastructure on-chain. Today, most consumer borrowing in the United States and other developed countries is under-collateralized borrowing in the form of credit cards or buy-now-pay-later arrangements. And almost none of this is possible on-chain now because we don’t have reliable identity systems.</p><p>So, to enable that next wave of big use cases, we’ll need lower costs, better wallets and better identity.</p><p><strong>CT: You’ve said that what most people have done with crypto until now is speculate on the crypto markets, and it’s time to move on. Has it been a mistake to focus so much on the market price of Bitcoin, say?</strong></p><p><strong>Pollak: </strong>I don’t think it’s wrong if you look at the way that technology life cycles evolve. Carlota Perez, for instance, <a href=\"https://soentrepreneurial.com/tag/carlota-perez/\" target=\"_blank\" rel=\"noopener nofollow\">writes</a> that financial bubbles are almost inevitable when you have meaningful technological innovation like the internet or electricity. You have this S-curve of adoption. [See chart below.] In the beginning, a lot of innovation is fueled by speculation as people see potential in the technology. This speculation draws in capital, which basically funds the innovation and eventually leads to impacts that change the world.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/e0d64f21-75bb-4f83-9f02-31a903890b04.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\">Technology adoption often follows an S-curve. Blockchain may now be at a turning (inflection) point.</figcaption></figure><p><strong>CT: Where are we now?</strong></p><p><strong>JP</strong>: We’ve reached the point where it’s time to move out of that [speculative] phase and into the phase of really bringing utility to everyday people. The infrastructure is ready.</p><p>Even two years ago, if you wanted to use an app on Ethereum, it was going to cost you $5 or $10 or $100. That’s just not something that is supportive of building everyday use cases.</p><p><strong>CT: Speaking of Ethereum, why did Coinbase decide to build its layer 2 on the Ethereum blockchain? Did you ever consider using another mainnet? </strong></p><p><strong>JP: </strong>We actually looked three times at building a chain: In 2018 and 2020, and then most recently in 2023. And the first two times, we looked at building an alternative layer 1, one which would have been competitive with Ethereum. Our takeaway was we didn’t want to put ourselves on an island disconnected from the rest of the ecosystem.</p><p>The third time, we looked at all of the options: Ethereum, alternative layer 1s, layer 2s, etc. What felt natural to us about Ethereum was it is the largest crypto ecosystem by value, by activity, by developers — by order of magnitude or two — and so by building Base as an Ethereum layer 2, we could both contribute to scaling Ethereum and be a part of this ecosystem that’s larger than us.</p><p><strong>CT: What about Ethereum’s oft-discussed scalability shortcomings, including network congestion and sometimes ballooning fees? Have those been largely solved through extensive use of layer-2 rollups like Optimism and Arbitrum (and now Base), where transactions are “batched” and added to the mainnet in a single lot?</strong></p><p><strong>JP: </strong>If you look at the history of Ethereum, the original vision was: We’re going to do all this at layer 1, and we’re going to scale up through sharding. But around 2020 and 2021, as layer 2s emerged, the Ethereum community and core development groups basically said: What if we changed our strategy where instead of trying to introduce all of this complexity at layer 1, we build the infrastructure to enable innovation at layer 2? </p><p>That was something that Vitalik [Buterin, Ethereum co-founder] wrote about a lot. And over the last two years, that’s what happened. Coinbase supported an initiative over the last year-and-a-half called <a href=\"https://ethereum.org/en/roadmap/danksharding/\" target=\"_blank\" rel=\"noopener nofollow\">EIP-4844</a>, for instance, that introduced data availability for rollups, leading to reduced fees and more transaction throughput.</p><p>But do I think we’ve solved the problem? No. These things take years to solve, and I think we are now two to three years into making those investments, and we have another two to three years or more potentially to go. But I think we’ve made a lot of progress.</p><p>You can see this at <a href=\"https://l2beat.com/scaling/activity\" target=\"_blank\" rel=\"noopener nofollow\">L2Beat</a>. [See chart below]. Two years ago [Sept. 21, 2021], there were eight transactions per second [on average] on layer-2 projects and 13 TPS on the Ethereum mainnet. Today, there’s 58 TPS on layer 2s and 11 TPS on the Ethereum mainnet. So we’ve gone from less than 1x to 5.7 times faster in two years.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/4c5882fa-fae6-4002-b2bc-356c50a0c82b.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\">On Sept. 20, 2023, average transactions-per-second (TPS) on “projects” was 54.63 TPS, up from 8.03 TPS in September 2021. The Ethereum TPS line, by comparison, changed little during this period.</figcaption></figure><p><strong>CT: Are you surprised that a </strong><a href=\"https://cointelegraph.com/news/friendtech-pronounced-dead-inflows-activity-declines\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/friendtech-pronounced-dead-inflows-activity-declines/amp\"><strong>“buzzy” social media DAPP</strong></a><strong> — Friend.tech — was initially Base’s biggest performer after its summer launch? Its fees surpassed $1 million in one 24-hour period. Still, maybe this wasn’t the serious use case that some critics were hoping for.</strong></p><p><strong>JP: </strong>Well, when the first social apps launched on the internet, some people looked at them and said, hey, these things are toys. When are we going to go do the serious stuff like bringing newspapers online? If you look at where we are today, social apps are used by billions of people every day. They will continue to be a way that people connect, and social apps will play a critical role on-chain.</p><p>What’s powerful about this next generation of on-chain social apps is that they will enable people to have sovereign ownership. They will continue to own their creativity, and they'll continue to be in control — rather than the large corporations that are controlling them now.</p><p><strong>CT: Can you tell us about a DApp launched on Base that excites you?</strong></p><p><strong>JP: </strong>Check out Blackbird, a customer engagement platform for restaurants. You walk into any participating restaurant, you tap your phone, and it instantly knows who you are. They customize the experience for you. Repeat visitors can earn rewards. It’s in 10 or 15 restaurants now in New York City but is soon expanding into California. A lot of people are talking about it on Twitter. </p><p><strong>CT: Where will blockchain finally find its “killer app” — to do for the cryptoverse what email did for the internet? Or has it already emerged in your view?</strong></p><p><strong>JP:</strong> There won’t be one killer app. There will be many killer apps. We’re starting to see some of those emerge. The one with the most real-world adoption is stablecoins. If you look at the total volume of stablecoin transactions over the last year, it’s a massive number. It will be a big driver of economic freedom in the decade ahead. It gives people in places like Argentina or Turkey access to a stable currency like the U.S. dollar. </p><p>But stablecoins won’t be alone. We will see many on-chain applications that will change people’s lives for the better.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/crypto-use-cases-coinbase-jesse-pollack&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles\" data-amp=\"https://mint-cointelegraph-com.cdn.ampproject.org/c/s/mint.cointelegraph.com/?url=https://cointelegraph.com/news/crypto-use-cases-coinbase-jesse-pollack&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles/amp\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-26T12:42:06.000Z",
    "title": "Ripple CTO David Schwartz Breaks Down How the XRP Ledger Works",
    "url": "https://www.cryptoglobe.com/latest/2023/09/ripple-cto-david-schwartz-breaks-down-how-the-xrp-ledger-works/",
    "description": "On 26 September 2023, David Schwartz, the Chief Technology Officer of Ripple, elucidated the inner workings of the XRP Ledger (XRPL), specifically discussing the roles of nodes and validators. The XRP Ledger (XRPL) is a decentralized cryptographic ledger that is powered by a network of peer-to-peer servers. It is the underlying technology that supports the […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-26T13:08:47.000Z",
    "title": "Mitsubishi UFG Trust Collabs With Binance Japan For New Stablecoin",
    "url": "https://cryptodaily.co.uk/2023/09/mitsubishi-ufg-trust-collabs-with-binance-japan-for-new-stablecoin",
    "description": "Japan’s largest bank, Mistubishi UFG Trust, has teamed up with Binance Japan to launch a Yen-backed stablecoin offering."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-26T12:47:09.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC, ETH Rebound Ahead of US Consumer Confidence Data",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-eth-rebound-ahead-of-us-consumer-confidence-data/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1059774677-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC, ETH Rebound Ahead of US Consumer Confidence Data\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1059774677-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1059774677-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1059774677-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1059774677-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1059774677-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1059774677-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1059774677.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin rebounded from a multi-week low on Tuesday, as markets awaited the latest consumer confidence report in the United States. The latest figures from the Conference Board are expected to show a slight decline, with a reading of 105.9 in September. This will be down from 106.1 the month prior. Bitcoin Bitcoin was back in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T12:59:07.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here’s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T12:57:44.000Z",
    "title": "UNUS SED LEO Price Prediction 2023-2032: Is the Coin a Good Investment?",
    "url": "https://www.cryptopolitan.com/unus-sed-leo-price-prediction/",
    "description": "UNUS SED LEO Price Prediction 2022-2032 The Latin name makes an interesting side story: A vixen bragged about how many children she had and sneered at a lion for only having one. The lioness then replies, &#8220;One, but a lion.&#8221; So in the Leo whitepaper, they bragged they would burn ALL of the tokens, except ... <a title=\"UNUS SED LEO Price Prediction 2023-2032: Is the Coin a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/unus-sed-leo-price-prediction/\" aria-label=\"More on UNUS SED LEO Price Prediction 2023-2032: Is the Coin a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-26T12:42:05.000Z",
    "title": "Justin Sun launches ‘SAFU’ fund after HTX $8m hack",
    "url": "https://crypto.news/justin-sun-launches-safu-fund-after-htx-8-million-hack/",
    "description": "Justin Sun, HTX advisory board member, introduced the SAFU fund after the platform had suffered a $8 million security breach."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-26T13:06:47.000Z",
    "title": "Synthetix Network (SNX) Holders Are Rotating Capital into Pikamoon Presale; Here’s Why!",
    "url": "https://www.crypto-news-flash.com/synthetix-network-snx-holders-are-rotating-capital-into-pikamoon-presale-heres-why/?utm_source=rss&utm_medium=rss&utm_campaign=synthetix-network-snx-holders-are-rotating-capital-into-pikamoon-presale-heres-why",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-150.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-150.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-150-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-150-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Regardless of how positive or otherwise a crypto project might be faring, investors always have an eye out for other promising projects. This explains why Synthetix Network (SNX) holders are rotating capital into Pikamoon presale despite the SNX price impressive rally. Pikamoon&#8217;s presale has been a hotbed of activity over the past six months, drawing [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-26T12:39:50.000Z",
    "title": "Polygon (MATIC) Stays Resilient Above $0.50: Are Hodlers the Key to Recovery?",
    "url": "https://www.crypto-news-flash.com/polygon-matic-stays-resilient-above-0-50-are-hodlers-the-key-to-recovery/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-matic-stays-resilient-above-0-50-are-hodlers-the-key-to-recovery",
    "description": "<img width=\"960\" height=\"540\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg.jpg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg-768x432.jpg 768w\" sizes=\"(max-width: 960px) 100vw, 960px\" />Polygon&#8217;s MATIC is proving resilient amidst bearish pressure as it defends the $0.50 support level. Investors are cautious that the support could be breached as hodlers cash in but remain optimistic based on recent network activity. Polygon (MATIC) has in the last 24 hours added around 2 percent to its value to reach a little [...]"
  }
]