[
  {
    "source": "Decrypt",
    "date": "2023-10-06T18:46:54.000Z",
    "title": "'Unfinished Garbage': No One Is Playing Bethesda's 'Redfall' Months After Release",
    "url": "https://decrypt.co/200478/unfinished-garbage-no-one-playing-bethesda-redfall-months-after-release",
    "description": "Redfall released in May and has seen a sharp decline in players after being plagued with bad reviews. Why is its player count nearing zero?"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-06T19:00:00.000Z",
    "title": "September sets 2023 exploit record, and DAOs can democratize science: Finance Redefined",
    "url": "https://cointelegraph.com/news/september-sets-2023-exploit-record-and-daos-can-democratize-science-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/949e2490-2d76-4eff-a7cf-8fa0d716b6e3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>September was the biggest exploit month in DeFi, with over $300 million in losses, taking the crown from August.</p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>In this week’s newsletter, September became the biggest month of crypto exploits in DeFi, with over $300 million in losses, and the popular DeFi lending protocol Yield announced its permanent closure by December.</p><p>Polygon co-founder Jaynti Kanani has stepped down from his day-to-day roles at the firm, saying he will now monitor from the sidelines, and decentralized autonomous organizations (DAOs) can help scientists find funding and community, according to a prestigious science journal.</p><p>The DeFi market had a mixed week in terms of price action, with most of the top 100 tokens trading in the same price zone as last week.</p><h2>September becomes the biggest month for crypto exploits in 2023: CertiK</h2><p>September has officially become the worst month in 2023 (so far) for crypto-related exploits — with a whopping $329.8 million in crypto stolen.</p><p>On Oct. 2, blockchain security firm CertiK said the most significant contributor to the month’s totals came from the <a href=\"https://cointelegraph.com/news/mixin-network-hack-200-m-crypto-assets\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/mixin-network-hack-200-m-crypto-assets/amp\">Mixin Network attack</a> on Sept. 23, when the Hong Kong-based decentralized cross-chain transfer protocol lost $200 million due to a breach of its cloud service provider.</p><p><a href=\"https://cointelegraph.com/news/crypto-exploits-top-for-crypto-exploits-in-2023-certi-k\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-exploits-top-for-crypto-exploits-in-2023-certi-k/amp\"><strong>Continue reading</strong></a></p><h2>Yield Protocol to permanently “wind down” operations by December 2023</h2><p>Yield Protocol announced its decision to shut down by the end of the year due to a lack of business demand and global regulatory pressures.</p><p>Yield Protocol will cease to exist after its December 2023 series ends, which is due to mature on Dec. 29. Yield Protocol’s announcement detailing the “wind down” operation confirmed that the March 2024 fixed rate series launch had been canceled.</p><p><a href=\"https://cointelegraph.com/news/yield-protocol-permanently-wind-down-december-2023\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/yield-protocol-permanently-wind-down-december-2023/amp\"><strong>Continue reading</strong></a></p><h2>Polygon co-founder steps down, will contribute “from the sidelines”</h2><p>Jayant Kanani announced that he has stepped back “from the day-to-day grind” on the project for the first time in six years. </p><p>In an Oct. 4 X (formerly Twitter) thread, Kanani said he planned to focus “on new adventures” while contributing to Polygon “from the sidelines.” Along with software engineers, including Sandeep Nailwal, Anurag Arjun and Mihailo Bjelic, Kanani helped found the Matic network in 2017, which was later rebranded to Polygon.</p><p><a href=\"https://cointelegraph.com/news/polygon-co-founder-steps-down\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/polygon-co-founder-steps-down/amp\"><strong>Continue reading</strong></a></p><h2>DAOs can help scientists find funding and community, says Nature science journal</h2><p>The Nature science journal recently published an editorial in its Nature biotechnology section lauding DAOs as a revolutionary new method by which researchers working in underfunded scientific fields can create communities around their work and raise funding that otherwise might not be available.</p><p>In a DAO-based research scheme, a project’s organization, fundraising, feedback and pipeline from discovery to product/industry can all be handled by the same decentralized governing body.</p><p><a href=\"https://cointelegraph.com/news/dao-help-scientists-funding-community-nature-science-journal\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/dao-help-scientists-funding-community-nature-science-journal/amp\"><strong>Continue reading</strong></a></p><h2>Wirex taps ZK-proofs for noncustodial crypto debit card issuance</h2><p>Crypto payment service provider Wirex announced the launch of a <a href=\"https://cointelegraph.com/explained/zero-knowledge-proofs-explained\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/zero-knowledge-proofs-explained/amp\">zero-knowledge proof (ZK-proof)</a>-based noncustodial crypto debit card service called W-Pay on Oct. 3.</p><p>Wirex’s new decentralized solution utilizes zero-knowledge technology and is built on Polygon’s Chain Development Kit, promising increased scalability and security. Polygon’s CDK has been built with ZK-proofs in focus, enabling companies and users to develop their own ZK-powered layer-2 rail.</p><p><a href=\"https://cointelegraph.com/news/crypto-debit-card-issuance-wirex-taps-zk-proofs\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-debit-card-issuance-wirex-taps-zk-proofs/amp\"><strong>Continue reading</strong></a></p><h2>DeFi market overview</h2><p>Data from <a href=\"https://pro.cointelegraph.com/users/sign_in?\">Cointelegraph Markets Pro</a> and TradingView shows that DeFi’s top 100 tokens by market capitalization had a minor pullback from the last week, with most tokens trading in the green on weekly charts. The total value locked into DeFi protocols dropped to $45.07 billion.</p><p>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-06T18:44:27.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>FTX’s former chief technology officer, Gary Wang, testified at former CEO Sam Bankman-Fried’s trial on Oct. 6. Meanwhile, the European Union’s markets regulator has issued a second consultation on Markets in Crypto-Assets (MiCA) and plans to submit its final report to the European Commission by June 2024. Additionally, a judge has given EthereumMax (EMAX) investors suing celebrities over their alleged endorsements a third and final shot at an amended class-action complaint.</p><h3>Alameda account on FTX had “special privileges,” according to Wang</h3><p>Wang appeared at <a href=\"https://cointelegraph.com/news/alameda-account-ftx-special-privileges-gary-wang\">Bankman-Fried’s trial</a> on Oct. 6, where he was asked a series of questions about the alleged connections between FTX and Alameda Research.</p><p>According to reports, Wang said that Alameda’s FTX account was the only one allowed to trade more funds than it had available. This feature, called “allow negative,” presumably enabled Alameda to continue trading despite having a negative account balance. </p><p>“We had said we wouldn’t use funds like this,” Wang reportedly said. “After I said the Alameda balances were off by billions, [Bankman-Fried] asked to meet in the Bahamas office. He asked me about the bug, and then he told Caroline [Ellison] Alameda can go ahead and return the borrows.”</p><p>According to Wang, Bankman-Fried gave Alameda “special privileges” on FTX, which were tied to the exchange’s native FTX Token (FTT).</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Subscribe to our ‘1 Minute Letter’ NOW for daily deep-dives straight to your inbox! ⚖️ Be the first to know every twist and turn in the Sam Bankman-Fried case! Subscribe now: <a href=\"https://t.co/jQOIYUv6IW\">https://t.co/jQOIYUv6IW</a>  <a href=\"https://twitter.com/hashtag/SBF?src=hash&amp;ref_src=twsrc%5Etfw\">#SBF</a> <a href=\"https://t.co/gp7zJu5sgy\">pic.twitter.com/gp7zJu5sgy</a></p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1709911708049772942?ref_src=twsrc%5Etfw\">October 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\">Bankman-Fried’s trial</a> began earlier this week. The former FTX CEO faces a slew of criminal charges. </p><h3>European regulator publishes second consultation on MiCA</h3><p>The European Securities and Markets Authority (ESMA), the European Union’s markets regulator, released a second consultative paper on MiCA mandates on Oct. 5. The previous consultation paper was published in July.</p><p>In the 307-page document, the ESMA seeks stakeholders’ input on five areas of MiCA, including sustainability indicators for distributed ledgers, disclosures of inside information, technical requirements for white papers, trade transparency measures and record-keeping for crypto asset service providers (CASPs).</p><p>Among the sustainability indicators, the authority counts quantitative metrics on the consumption of energy, greenhouse gas emissions and the production of waste, together with a qualitative statement on the impact of the use of equipment by blockchain network nodes on natural resources.</p><p>As for post-trade transparency, the ESMA proposes requiring CASPs to report trading and publication date and time, identification of the crypto-asset, pricing information, quantity, venue of execution and transaction ID.</p><p>The ESMA also suggests allowing CASPs to store transaction data in “the format they consider most appropriate,” provided they can convert it into a specified format should the authorities request it. </p><p>The regulator will publish a final report based on feedback received and submit the draft technical standards to the European Commission by June 30, 2024. However, before that, it will also publish a third consultation package in Q1 of 2024.</p><h3>Judge gives EMAX investors final shot at class suit </h3><p>The judge presiding over the EthereumMax investor class action <a href=\"https://cointelegraph.com/news/emax-investors-final-shot-celeb-promo-suit\">gave a final chance</a> for the plaintiffs to amend their lawsuit against celebrities they accuse of promoting the now-defunct cryptocurrency.</p><p>In an Oct. 3 order, United States District Court Judge Michael Fitzgerald gave EMAX investors a third try at submitting an amended complaint — but warned it’s their last time to get it right.</p><blockquote>“Plaintiffs have repeatedly failed to cure the deficiencies identified by the Court and were explicitly warned that this would be their last opportunity to amend.”</blockquote><p>The suit alleges boxing champion Floyd Mayweather, pro basketball star Paul Pierce, reality TV personality Kim Kardashian and others promoted EMAX — which the suit called a “pump and dump” scheme.</p><p>Last year, the suit was dismissed but was <a href=\"https://cointelegraph.com/news/emax-class-action-against-kim-k-and-mayweather-is-back-on-says-judge\">revived in June</a> after the judge refused to throw out the plaintiff’s “unfair competition” claims against the celebrities.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-06T19:00:13.000Z",
    "title": "ETH Futures ETFs Receive Tepid Response Compared to BTC Counterparts, Says Coinbase Research Head",
    "url": "https://www.cryptoglobe.com/latest/2023/10/eth-futures-etfs-receive-tepid-response-compared-to-btc-counterparts-says-coinbase-research-head/",
    "description": "On 6 October 2023, David Duong, the Head of Coinbase Research, shared insights on LinkedIn regarding the underwhelming market response to the newly launched ETH futures ETFs in the United States. According to Duong, these ETFs failed to generate the same level of excitement and trading volume as the first BTC futures ETF, ProShares’ BITO, […]\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-06T19:12:17.000Z",
    "title": "Binance Research reports stablecoins on a continuous decline in monthly report",
    "url": "https://crypto.news/binance-research-reports-stablecoins-on-a-continuous-decline-in-monthly-report/",
    "description": "On Oct. 5, Binance Research released a monthly market report with numbers indicating a continuous decline on stablecoins, which hit a low of US$123.8b."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-06T19:03:36.000Z",
    "title": "U.S. officials link North Korea to the major security breach at Mixin",
    "url": "https://crypto.news/u-s-officials-link-north-korea-to-the-major-security-breach-at-mixin/",
    "description": "A U.S. official implicates North Korea in a significant cyberattack on decentralized finance platform Mixin Network, with losses under $150 million."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-06T19:00:12.000Z",
    "title": "Is Ethereum’s Staking Boom A Ticking Time Bomb? JPMorgan Weighs In",
    "url": "https://www.newsbtc.com/news/ethereum/is-ethereum-staking-boom-a-ticking-time-bomb-jpmorgan-weighs-in/",
    "description": "Ethereum (ETH), a forerunner in the decentralized finance (DeFi) ecosystem, has seen a notable surge in its staking activities. This staking boom has raised eyebrows among experts from JPMorgan concerned over ETH&#8217;s increase in centralization and the consequences that may arise. Ethereum, aiming to transition to a proof-of-stake consensus mechanism, opened the floodgates for staking. This meant holders could &#8216;stake&#8217; or lock their tokens to support network operations like block validation. However, while this promises rewards for the stakers, JPMorgan analysts have reported that there could be ripple effects. Related Reading: Whales Abandon Ship? Ethereum’s Value In Jeopardy As Major Holders Liquidate Ethereum Centralization Concerns Rise To The Surface JPMorgan analysts, led by Nikolaos Panigirtzoglou, highlight the inadvertent increase in Ethereum&#8217;s network centralization, particularly post the Merge and Shanghai upgrades. The Ethereum network became &#8220;more centralized as the overall staking yield declined,&#8221; they noted.  According to the analysts, what’s leading to this centralization could be attributed to liquid staking providers. Lido, a notable player, has been pinpointed for its dominant role. The JPMorgan report noted: The top 5 liquid staking providers control more than 50% of staking on the Ethereum network, and Lido specifically accounts for almost one-third. The analysts further disclosed while platforms such as Lido tote their decentralized nature, the underlying reality appears different. The analysts said these platforms “involve a high degree of centralization.&#8221; According to the analysts, the ramifications of such centralization can&#8217;t be understated. They mentioned that &#8220;a concentrated number of liquidity providers or node operators&#8221; might compromise the network&#8217;s integrity, leading to potential points of failure, attacks, or even conspiracy, resulting in an &#8220;oligopoly.&#8221; They further highlighted that such centralized entities could censor or exploit user transactions, undermining the community&#8217;s interests. The Rehypothecation Risk And Declining Rewards Another dimension to the staking story is the looming threat of &#8216;rehypothecation.&#8217; In simple terms, it&#8217;s the act of leveraging staked assets as collateral across various DeFi platforms. According to the JPMorgan&#8217;s analysts: Rehypothecation could then result in a cascade of liquidations if a staked asset drops sharply in value or is hacked or slashed due to a malicious attack or a protocol error. Furthermore, as Ethereum continues its journey on the staking path, the staking rewards seem to diminish. The report indicated a drop in total staking yield from 7.3% before the Shanghai upgrade to roughly 5.5% recently. Related Reading: Ethereum Price At Risk of Sharp Decline Unless ETH Clears This Heavy Resistance Regardless, Ethereum has shown a slight upward trajectory of 1.5% in the past 24 hours, with a market price currently sitting at $1,643 and a market cap of approximately $9 billion, at the time of writing. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-06T18:45:22.000Z",
    "title": "U.S. SEC Will Probably Approve All Spot Bitcoin ETFs at the Same Time, Says Ex-BlackRock Managing Director",
    "url": "https://dailyhodl.com/2023/10/06/u-s-sec-will-probably-approve-all-spot-bitcoin-etfs-at-the-same-time-says-ex-blackrock-managing-director/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/all-spot-etf-same.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/all-spot-etf-same.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/all-spot-etf-same.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/all-spot-etf-same.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/all-spot-etf-same.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/all-spot-etf-same.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/all-spot-etf-same.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A former executive at global investment titan BlackRock says US regulators will likely give their nod to all spot Bitcoin (BTC) exchange-traded fund (ETF) applications at once. During a panel discussion at CCData’s Digital Asset Summit in London, ex-BlackRock managing director Martin Bednall, who is now the CEO of Jacobi Asset Management, says that the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/06/u-s-sec-will-probably-approve-all-spot-bitcoin-etfs-at-the-same-time-says-ex-blackrock-managing-director/\">U.S. SEC Will Probably Approve All Spot Bitcoin ETFs at the Same Time, Says Ex-BlackRock Managing Director</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-06T18:41:16.000Z",
    "title": "U.S. Securities and Exchange Commission (SEC) Seeks To Force Elon Musk Testimony in Twitter Takeover Probe",
    "url": "https://dailyhodl.com/2023/10/06/u-s-securities-and-exchange-commission-sec-seeks-to-force-elon-musk-testimony-in-twitter-takeover-probe/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Names-One-Tech-Sector-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Names-One-Tech-Sector-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Names-One-Tech-Sector-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Names-One-Tech-Sector-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Names-One-Tech-Sector-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Names-One-Tech-Sector-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Names-One-Tech-Sector-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Securities and Exchange Commission (SEC) is looking to force billionaire Elon Musk to testify in its probe of his purchase of the social media platform X, formerly known as Twitter. In a new litigation release, the regulatory agency says that it has filed an application seeking an order that directs the business magnate [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/06/u-s-securities-and-exchange-commission-sec-seeks-to-force-elon-musk-testimony-in-twitter-takeover-probe/\">U.S. Securities and Exchange Commission (SEC) Seeks To Force Elon Musk Testimony in Twitter Takeover Probe</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-10-06T19:03:43.000Z",
    "title": "What are Runes in Bitcoin?",
    "url": "https://blog.bitfinex.com/education/what-are-runes-in-bitcoin/",
    "description": "<p>Bitcoin Runes are unique, fungible tokens that exist on the Bitcoin blockchain. They are designed to represent fungible assets with distinct characteristics and metadata. Casey Rodamor, the creator of the Ordinals protocol, recently dropped a proposal for a replacement to the BRC-20 fungible token protocol,...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/education/what-are-runes-in-bitcoin/\">What are Runes in Bitcoin?</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]