[
  {
    "source": "CoinDesk",
    "date": "2023-07-28T07:53:20.000Z",
    "title": "Crypto Mining Retailer Phoenix Looks at IPO in UAE: Bloomberg",
    "url": "https://www.coindesk.com/business/2023/07/28/crypto-mining-retailer-phoenix-looks-at-ipo-in-uae-bloomberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The UAE-based firm is developing one of the region’s largest mining facilities."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T07:53:50.000Z",
    "title": "Crypto.com registers in the Netherlands, cleared to advertise services",
    "url": "https://cointelegraph.com/news/crypto-com-registers-in-the-netherlands",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/6c02192c-aafa-4b98-8270-cee4a4457001.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The company received the green light from De Nederlandsche Bank to offer its services in the country. </p>\n                    <p><p>Crypto.com is the latest cryptocurrency firm to receive a green light from the Netherlands Central Bank to offer its services in the country.</p><p>The platform <a href=\"https://crypto.com/company-news/crypto-com-secures-registration-approval-in-the-netherlands\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that it had registered as a cryptocurrency service provider with De Nederlandsche Bank (DNB), following a comprehensive review of Crypto.com’s business and compliance with the country’s AML and terror financing prevention requirements.</p><p>As previously reported, 36 cryptocurrency-related businesses are currently <a href=\"https://www.dnb.nl/en/public-register/?p=2&amp;l=20&amp;rc=V1dGVEFD\" target=\"_blank\" rel=\"noopener nofollow\">registered</a> with the Dutch central bank, with the likes of Coinbase Europe, eToro and Bitstamp notable operators that also have clearance to operate in the Netherlands.</p><p><a href=\"https://cointelegraph.com/news/coinbase-enters-the-netherlands-with-central-bank-approval\"><strong><em>Related: Coinbase enters the Netherlands with central bank approval</em></strong></a></p><p>Cointelegraph spoke exclusively to Tobias Oudejans, DNB press officer for supervision, fintech, cryptocurrencies, resolution and payment systems, who noted that the DNB could not comment on specific registrations due to legal requirements of supervisory laws.</p><p>Oudejans clarified that the registration specifically allows cryptocurrency service providers to supply cryptocurrency wallets to customers and process fiat currency and cryptocurrency exchanges.</p><p>Crypto.com’s services were accessible in the Netherlands before the registration announcement. Oudejans told Cointelegraph that Dutch-based users are legally allowed to sign up for a service, but a company without registration would be acting illegally if it solicited or advertised its services to potential Dutch users.</p><p>Binance recently <a href=\"https://cointelegraph.com/news/netherlands-central-bank-says-binance-failed-registration-confidential\">announced</a> that it would give up efforts to register as a cryptocurrency service provider in the Netherlands and cease its operations in the jurisdiction, after failing to get approval from the DNB.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/crypto-com-registers-in-the-netherlands&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/elegant-and-ass-backward-jameson-lopps-first-impression-of-bitcoin/\">‘Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T07:31:29.000Z",
    "title": "Binance, CZ challenge CFTC lawsuit, seek dismissal",
    "url": "https://cointelegraph.com/news/binance-cz-challenge-cftc-seek-lawsuit-dismissal",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/96a69632-a2d6-481b-8f8a-f1f6cfcacdce.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance said that the CFTC is attempting to regulate foreign individuals and corporations operating outside the United States, going beyond the limits of its statutory jurisdiction.</p>\n                    <p><p>Crypto exchange Binance and its CEO Changpeng “CZ” Zhao requested the dismissal of a lawsuit filed by the United States Commodity Futures Trading Commission (CFTC).</p><p>In a July 27 court <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.ilnd.431767/gov.uscourts.ilnd.431767.59.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filing</a>, attorneys for Binance and CZ accused the CFTC of exceeding its regulatory authority and engaging in regulatory overreach. The filing states that the CFTC is attempting to regulate foreign individuals and corporations operating outside the United States, which goes beyond the limits of its statutory jurisdiction and interferes with well-established principles of comity with foreign sovereigns.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/ac8089e5-0067-4289-bf62-20bd7ee06a16.JPG\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of the motion to dismiss the CFTC lawsuit.  Source: CourtListener</em></figcaption></figure><p>As per the filing, the first six charges presented by the CFTC do not pertain to the foreign conduct addressed in the case, and certain charges do not meet the required legal standards. Additionally, the seventh charge, accusing Binance of evading the Commodity Exchange Act (CEA), should be dismissed as the agency fails to satisfy the requirements for such an accusation.</p><p>The motion to dismiss argues that the CFTC lacks regulatory authority over spot trading domestically and internationally. It questions whether Binance․com should be subject to specific registration and regulatory compliance provisions in the CEA and CFTC regulations based on its introduction of additional products after 2019, and its previous restriction on U.S. users. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-adopts-cyberattack-disclosure-rules-crypto-firms\"><strong><em>SEC adopts cyberattack disclosure rules, listed crypto firms included</em></strong></a></p><p>In March, the CFTC <a href=\"https://cointelegraph.com/news/binance-and-cz-sued-by-cftc-over-us-regulatory-violations\">initiated a lawsuit against Binance</a>, alleging that the company offered unregistered derivatives products in the U.S., including <a href=\"https://cointelegraph.com/learn/how-to-trade-cryptocurrencies-the-ultimate-beginners-guide\">cryptocurrency trading </a>services, futures and options products. The regulator also accused Binance of inadequate supervision, lacking a reliable Know Your Customer or Anti-Money Laundering program, and failing to register as a futures commissions merchant, designated contract market or swap execution facility.</p><p>In addition to the CFTC lawsuit, Binance is also <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">confronting legal challenges in the U.S</a>. stemming from a lawsuit filed by the Securities and Exchange Commission in June.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/binance-cz-challenge-cftc-seek-lawsuit-dismissal&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/web3-gamer-apple-gaming-sec-hates-metaverse-tokens-logan-paul-trolled-on-steam/\">Web3 Gamer: Apple to fix gaming? SEC hates Metaverse, Logan Paul trolled on Steam</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-28T08:00:43.000Z",
    "title": "Roger Ver at Webx Asia: Reflections on Payments, Self-Custody, and the Role of Crypto Lawbreakers",
    "url": "https://news.bitcoin.com/roger-ver-at-webx-asia-reflections-on-payments-self-custody-and-the-role-of-crypto-lawbreakers/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/roger-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Roger Ver at Webx Asia: Reflections on Payments, Self-Custody, and the Role of Crypto Lawbreakers\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/roger-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/roger-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/roger-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/roger-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/roger-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/roger-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/roger.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />When asked whether he&#x2019;d rather be called a &#x201C;bitcoin evangelist,&#x201D; or &#x201C;Bitcoin Jesus&#x201D; at the recent Webx seminar in Tokyo, Roger Ver responds: &#x201C;I prefer to be called Roger.&#x201D; The enthusiastic and outspoken figure in crypto, scattering sats around the world with unapologetic frankness about government, the bitcoin block size wars, and conflations of legality [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T08:05:25.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.1256, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 0.034% increase. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T08:05:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T08:04:11.000Z",
    "title": "Billionaire Marc Andreessen sees AI as a Game-Changer for Human experience and a better World",
    "url": "https://www.cryptopolitan.com/marc-andreessen-ai-human-better-world/",
    "description": "Artificial Intelligence (AI) is not just a tool; it has the potential to redefine how humans learn and enhance virtually every aspect of our lives, according to billionaire investor Marc Andreessen. With a net worth of $1.8 billion, Andreessen is an influential figure in the tech world, and his recent views on AI have garnered ... <a title=\"Billionaire Marc Andreessen sees AI as a Game-Changer for Human experience and a better World\" class=\"read-more\" href=\"https://www.cryptopolitan.com/marc-andreessen-ai-human-better-world/\" aria-label=\"More on Billionaire Marc Andreessen sees AI as a Game-Changer for Human experience and a better World\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T07:31:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-28T07:43:17.000Z",
    "title": "Crypto Trading Banks Occupy 74% Of Top 50 Global Banks",
    "url": "https://nulltx.com/crypto-trading-banks-occupy-74-of-top-50-global-banks/",
    "description": "In 2023, the landscape of cryptocurrency trading within the world&#8217;s biggest banks is showing signs of evolution. While 74% of the top 50 global banks by assets under management have embraced crypto trading by connecting to regulated exchanges like Binance and Coinbase, they have yet to support retail crypto trading or on-ramping from their native [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-28T08:06:07.000Z",
    "title": "Missing crypto millionaire found dismembered in Argentina",
    "url": "https://crypto.news/missing-crypto-millionaire-found-dismembered-in-argentina/",
    "description": "The dismembered remains of Fernando Pérez Algaba, a missing millionaire crypto influencer, were found inside a suitcase by children in a stream in Argentina. Fernando Perez Algaba, known affectionately as Lechuga, made his fortune doing luxury vehicle rental and cryptocurrency&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-28T07:30:49.000Z",
    "title": "Crunching The Data: Will Bitcoin Price Soar Or Slump In The Coming Days?",
    "url": "https://www.newsbtc.com/news/bitcoin/data-bitcoin-price-soar-or-slump-coming-days/",
    "description": "The Bitcoin price is currently in an uncertain situation. After BTC broke below the one-month trading range between $29.800 and $31.500, the bulls have so far failed to recapture this area. A first attempt failed on Wednesday at $29.725, a second effort on Thursday at $29.600. On the other hand, the bears currently also fail to push the price below the critical support at $29.000. In which direction the next movement will go is, as always, pure speculation, but data can give indications. Bullish Signal 1: Decreasing BTC Supply On Exchanges Renowned crypto analyst Ali Martinez shared an intriguing bullish chart, revealing that only 2.25 million BTC are currently held in known crypto exchange wallets. This is the lowest Bitcoin supply on trading platforms since January 2018. The data suggests that investors and long-term holders are refraining from selling and are instead choosing to keep their BTC off exchanges. This &#8220;hodling&#8221; behavior indicates a positive sentiment BTC holders. Bullish Signal 2: Lack Of Inflows From Bitcoin Whales Head of Research at CryptoQuant, Julio Moreno, pointed out another bullish sign when he shared a chart showing a lack of inflows from large investors with 1,000 to 10,000 BTC (aka Bitcoin whales) into exchanges. Moreno stated, “&#8221;Not really seeing Bitcoin whale inflows into exchanges.&#8221; Additionally, the same trend is observed among smaller investors, indicating a reluctance to deposit BTC into centralized exchanges. Commenting on the exchange deposit transactions (7-day SMA) chart, Moreno added, “indeed, seems nobody wants to deposit into centralized exchanges.&#8221; Related Reading: Don’t Change The Channel! Why Bitcoin Could Target $42K If Uptrend Holds Such behavior suggests that significant holders and institutions are holding onto their BTC assets, potentially anticipating future price increases. Bearish Signal: Short-Term Holder (STH) MVRV Metric On-chain analyst Axel Adler Jr. addressed the short-term holder (STH) MVRV metric, saying: &#8220;STH MVRV is actively falling and we may see something similar to what happened in the two previous corrections.&#8221; The chart shown by Adler reveals that the STH MVRV fell either close to 0 or even below during the lows of the sharp Bitcoin price corrections in mid-March and mid-June. Currently, the STH MVRV is still somewhat elevated, so a last pullback in the Bitcoin price triggered by short term holder selling may be necessary for the MVRV to reset to 0. Adler also remarked that there isn&#8217;t a substantial Inflow to futures exchanges at the moment like there was in March and June. &#8220;Don&#8217;t expect a sharp breakthrough upwards or downwards,&#8221; added Adler. BTC Binance Spot Liquidity Analysis Analyst @52kskew shared a comprehensive analysis of BTC Binance spot liquidity, highlighting an interesting observation. The bid liquidity (bids &#62; asks) and spot asks moved lower towards price due to low volatility. He added, “note the difference in volume leading to previous selloff &#38; current falling volume &#38; minimal decline.” Related Reading: Fed’s No Recession Claim Boosts Bitcoin And Crypto, Historical Data Contradicts Given the bid liquidity between $29,000 and $28,500, this area could be the point for buyers to step in if BTC experiences a pullback. In a bullish scenario, spot buying would occur in this area, followed by a rotation out of shorts. New longs get opened and price migrates towards spot supply near $30,000. In a sell off scenario, price grinds through spot bid liquidity and forced selling occurs, says Skew. Potential Impact of Economic Data On Bitcoin In addition, it is crucial to keep an eye on macroeconomic factors that could influence Bitcoin&#8217;s price. The release of the Personal Consumption Expenditures Price Index (PCE) at 8:30 am EST today is of particular importance. During Wednesday&#8217;s FOMC press conference, Fed Chairman Jerome Powell stressed the importance of core inflation, which is proving sticky. Therefore, the Core PCE in particular, needs to continue falling to alleviate the Fed&#8217;s inflation concerns. If the 4.2% expectation for core PCE is exceeded, a bullish reaction from Bitcoin can be expected. At press time, the Bitcoin price stood at $29,210. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T07:50:35.000Z",
    "title": "Fantom Reeling From Multichain Hack Side-Effects, QUBE Pumping Hard As Bulls Target 1000% growth",
    "url": "https://www.crypto-news-flash.com/fantom-reeling-from-multichain-hack-side-effects-qube-pumping-hard-as-bulls-target-1000-growth/?utm_source=rss&utm_medium=rss&utm_campaign=fantom-reeling-from-multichain-hack-side-effects-qube-pumping-hard-as-bulls-target-1000-growth",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T104732.229.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T104732.229.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T104732.229-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T104732.229-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As the crypto space continues to evolve and navigate through various challenges, there has been a remarkable shift in investor confidence. Recent developments surrounding Fantom (FTM), specifically the adverse effects from the Multichain protocol hack, have left the project reeling and seeking alternatives. In contrast, the InQubeta (QUBE) project has been experiencing a bullish momentum [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T07:33:09.000Z",
    "title": "Terra Luna Classic Community Seeks to Restore 800 million of Malfunctioning Terra Classic USD – Community Divided on Utilizations",
    "url": "https://www.crypto-news-flash.com/erra-luna-classic-community-seeks-to-restore-800-million-of-malfunctioning-terra-classic-usd-community-divided-on-utilizations/?utm_source=rss&utm_medium=rss&utm_campaign=erra-luna-classic-community-seeks-to-restore-800-million-of-malfunctioning-terra-classic-usd-community-divided-on-utilizations",
    "description": "<img width=\"1280\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Terra.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Lunc price surge\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Terra.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Terra-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Terra-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Terra-768x432.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The Terra Luna Classic community aims to reclaim 800 million USTC from the malfunctioning Ozone Protocol project. Community members are divided on whether to return the funds to the community pool or burn them to increase the value of existing USTC. The Terra Luna Classic community finds itself in a challenging position as it seeks [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T07:15:14.000Z",
    "title": "Crypto Twitter Reacts to US Gov Dropping Charges On FTX Founder SBF",
    "url": "https://www.crypto-news-flash.com/crypto-twitter-reacts-to-us-gov-dropping-charges-on-ftx-founder-sbf/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-twitter-reacts-to-us-gov-dropping-charges-on-ftx-founder-sbf",
    "description": "<img width=\"1000\" height=\"563\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/AdobeStock_193450689.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/AdobeStock_193450689.jpeg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/AdobeStock_193450689-300x169.jpeg 300w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />U.S. prosecutors decide to drop campaign finance charges against FTX founder, Sam Bankman-Fried (SBF), highlighting information from the Bahamas representative. SBF, known for donating large sums to political campaigns, still faces seven charges related to defrauding users and FTX&#8217;s creditors. In a surprising turn of events, the U.S. prosecutor has decided to drop the campaign [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T07:14:47.000Z",
    "title": "Private Banking Firm with $14B Assets Launches Spain’s First Crypto Fund- Bitcoin (BTC) Set For More Adoption In Europe",
    "url": "https://www.crypto-news-flash.com/private-banking-firm-with-14b-assets-launches-spains-first-crypto-fund-bitcoin-btc-set-for-more-adoption-in-europe/?utm_source=rss&utm_medium=rss&utm_campaign=private-banking-firm-with-14b-assets-launches-spains-first-crypto-fund-bitcoin-btc-set-for-more-adoption-in-europe",
    "description": "<img width=\"1280\" height=\"960\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/spain-gf06a60ca8_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"A&amp;G, a banking institution headquartered in Spain and specializing in private banking, has introduced the inaugural cryptocurrency fund under Spanish law.\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/spain-gf06a60ca8_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/spain-gf06a60ca8_1280-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/spain-gf06a60ca8_1280-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/spain-gf06a60ca8_1280-768x576.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />A&#38;G revealed that CACEIS, the asset servicing banking group of Crédit Agricole and Santander, will serve as the depositary for the fund. A&#38;G has selected CACEIS Bank, the asset servicing division of Crédit Agricole, to serve as the fund&#8217;s depositary, and PwC will undertake the auditor role. A&#38;G, a banking institution headquartered in Spain and [...]"
  }
]