[
  {
    "source": "Decrypt",
    "date": "2024-01-09T20:15:02.000Z",
    "title": "Bitcoin ETFs Will Not Be a ‘Winner-Take-All Market’: VanEck CEO",
    "url": "https://decrypt.co/212151/bitcoin-etfs-will-not-be-a-winner-take-all-market-vaneck-ceo",
    "description": "With SEC approval widely anticipated tomorrow, Jan van Eck predicts trading will start Thursday for Bitcoin ETFs."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T20:15:00.000Z",
    "title": " Stablecoin inflows to exchanges spike as traders prepare for spot Bitcoin ETF decision ",
    "url": "https://cointelegraph.com/news/stablecoin-inflows-to-exchanges-spike-as-traders-prepare-for-spot-bitcoin-etf-decision",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvODA2NmNmMDUtOWY4OS00ZGI0LWI3Y2UtM2RiMjQ1ODJlZTcyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Stablecoin inflows to exchanges swell as investors prepare for volatility leading into the SEC’s decision on a spot Bitcoin ETF.</p>\n                    <p><p>Data shows an uptick in stablecoin inflows amid renewed bullish action in the crypto market fueled by the expectation of a spot Bitcoin exchange-traded fund (ETF) approval in the United States. </p><p>The trend of Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) and USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) flooding exchanges suggests that traders are possibly preparing to enter the market depending on their spot ETF expectations.</p><p>According to market data provider <a href=\"https://twitter.com/cryptoquant_com/status/1355037171728584705?s=20\" target=\"_blank\" rel=\"noopener nofollow\">CryptoQuant</a>, stablecoin holdings in known crypto exchange wallets rose from $18.05 billion on Jan. 1 surpassing $19.99 billion on Jan. 7.</p><p><a href=\"https://cointelegraph.com/news/stablecoin-inflows-to-exchanges-spike-as-traders-prepare-for-spot-bitcoin-etf-decision\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-09T20:16:20.000Z",
    "title": "Blockchain Association defends crypto hiring practices in formal response to Senator Warren",
    "url": "https://cryptoslate.com/blockchain-association-defends-crypto-hiring-practices-in-formal-response-to-senator-warren/",
    "description": "<p>The Blockchain Association formally responded to Senator Elizabeth Warren&#8216;s criticism regarding the crypto industry&#8217;s recruitment of former government officials. The association said that these former officials chose to join an emerging industry of their own volition and slammed the senator for questioning the motives of people who had spent years defending the U.S. and its [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/blockchain-association-defends-crypto-hiring-practices-in-formal-response-to-senator-warren/\">Blockchain Association defends crypto hiring practices in formal response to Senator Warren</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NullTX",
    "date": "2024-01-09T20:10:51.000Z",
    "title": "Whale Movements In Crypto Space Amidst Price Surge To Watch ",
    "url": "https://nulltx.com/whale-movements-in-crypto-space-amidst-price-surge-to-watch/",
    "description": "Recent on-chain reports have unveiled intriguing activities in the crypto space as Bitcoin ($BTC) and Wrapped Bitcoin ($WBTC) witnessed notable price movement. Lookonchain data indicates that a savvy whale made strategic moves after Bitcoin surpassed the $45,000 mark. The whale deposited a substantial 1,000 $BTC ($22.47M) into Binance after the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-09T20:24:17.000Z",
    "title": "Valkyrie CIO Anticipates XRP And Ethereum Spot ETFs Following Bitcoin’s Approval",
    "url": "https://www.newsbtc.com/breaking-news-ticker/valkyrie-cio-anticipates-xrp-and-ethereum-spot-etfs-following-bitcoins-approval/",
    "description": "While Bitcoin exchange-traded fund (ETF) applications are still awaiting approval from the US Securities and Exchange Commission (SEC), executives from asset management firms are already speculating about the potential launch of spot ETFs for other major cryptocurrencies, including XRP and Ethereum (ETH).  Valkyrie Invest&#8217;s Chief Investment Officer, Steven McClurg, expressed his belief that the SEC&#8217;s potential approval of a Bitcoin ETF could pave the way for similar offerings in the XRP and Ethereum markets.  However, regulatory challenges and classifying XRP and Ethereum as securities may present hurdles toward these index funds. XRP And Ethereum Spot ETF Potential Hurdles Unlike Bitcoin, which has been classified as a commodity by regulators, XRP and Ethereum have been deemed securities. This divergence in classification poses potential difficulties and may necessitate a more complex approval process for spot ETFs tracking these cryptocurrencies.  Related Reading: ETHBTC May Capitulate, Will These Factors Support Ethereum? The anticipated impact of spot ETF approval on the XRP and Ethereum price would mirror the pattern seen with Bitcoin. Still, the SEC&#8217;s skepticism towards the broader cryptocurrency market could pose additional hurdles for XRP and Ethereum ETFs. Nevertheless, the outcome of the ongoing Ripple vs. SEC case holds significant implications and could hold the key for the cryptocurrency industry to pursue these index funds for other cryptocurrencies.  If Ripple, the blockchain payment company associated with XRP, emerges victorious and is not classified as a security by Judge Analisa Torres, it could establish a precedent for asset managers seeking to apply for an XRP ETF.  This legal precedent could also prompt potential litigation against the SEC to support an Ethereum ETF application. While discussions revolve around the possibility of spot ETFs for XRP and Ethereum, there is still uncertainty surrounding the approval of Bitcoin ETFs.  The SEC may reject or delay the pending applications, making it uncertain whether these other index funds will materialize. Furthermore, US regulators&#8217; current classification of XRP and Ethereum as securities adds an additional layer of complexity to their respective ETF prospects. Bitcoin ETF Decision Imminent As reported on Monday by NewsBTC, Sources close to the process have indicated that the ultimate approval for Bitcoin ETFs may come on Wednesday.  CNBC&#8217;s sources suggest that this coincides with the application deadline for Ark Invest and 21 Shares, raising the possibility of a potential trading launch between Thursday and Friday. Several applications are expected to receive the green light, pending updates from the SEC on the filings. Related Reading: Cardano’s 2024 Rollercoaster: Price Plunges 18% Despite 250% Surge In Development Activity Overall, as anticipation builds around the potential approval of Bitcoin ETFs, asset managers are already contemplating the prospect of spot ETFs for other major cryptocurrencies like XRP and Ethereum.  However, the regulatory challenges and the classification of XRP and Ethereum as securities present significant hurdles for these index funds. The Ripple vs. SEC case outcome could have far-reaching implications, potentially setting a legal precedent for asset managers to pursue XRP and Ethereum ETFs.  XRP is trading at $0.5673, showing a lack of bullish momentum with a 1% decline in the past 24 hours. Furthermore, it has experienced a continuous downtrend of 13% over the past 30 days. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-09T20:35:48.000Z",
    "title": "Bitcoin ETF Fee Battle: Grayscale Bucks the Trend with Premium Pricing",
    "url": "https://www.crypto-news-flash.com/bitcoin-etf-fee-battle-grayscale-bucks-the-trend-with-premium-pricing/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-etf-fee-battle-grayscale-bucks-the-trend-with-premium-pricing",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Spot Bitcoin ETF\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1-450x300.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-1-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Intense fee competition among Bitcoin ETF issuers reflects the growing relevance of cryptocurrencies in traditional markets. Grayscale&#8217;s strategy emphasizes confidence in its product and highlights aspects such as security and investor experience. Amid fierce competition to attract investors to Bitcoin exchange-traded funds (ETFs), Grayscale is standing firm with its Bitcoin investment product, despite the fee [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-09T20:34:41.000Z",
    "title": "Fox and Polygon Join Forces: ‘Verify’ Tool Unleashed to Combat Deepfakes",
    "url": "https://www.crypto-news-flash.com/fox-and-polygon-join-forces-verify-tool-unleashed-to-combat-deepfakes/?utm_source=rss&utm_medium=rss&utm_campaign=fox-and-polygon-join-forces-verify-tool-unleashed-to-combat-deepfakes",
    "description": "<img width=\"640\" height=\"431\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/rubaitul-azad-D6NxPgzORsw-unsplash.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"media-of-communication-news\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/rubaitul-azad-D6NxPgzORsw-unsplash.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/rubaitul-azad-D6NxPgzORsw-unsplash-300x202.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/rubaitul-azad-D6NxPgzORsw-unsplash-150x101.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/rubaitul-azad-D6NxPgzORsw-unsplash-450x303.jpg 450w\" sizes=\"(max-width: 640px) 100vw, 640px\" />&#8220;Verify,&#8221; the innovative tool from Fox and Polygon, employs blockchain to track media authenticity, fighting deepfakes and fake news. Developed in beta by Fox&#8217;s technology team, &#8220;Verify&#8221; allows publishers and consumers to verify the provenance of digital content. In the ongoing fight against fake news and the proliferation of deepfakes, media powerhouse Fox Corp, parent [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-09T20:38:00.000Z",
    "title": "GMT Continues To Slip After Unlocking Activity; Is This The Right Moment For Buyers?",
    "url": "https://coinedition.com/gmt-continues-to-slip-after-unlocking-activity-is-this-the-right-moment-for-buyers/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Price-analysis-9-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Upon Finding Support at $0.3746, GMT Bulls Pounce, Propelling Prices by 2.52%\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Price-analysis-9-1.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Price-analysis-9-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Price-analysis-9-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/Price-analysis-9-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Price-analysis-9-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Price-analysis-9-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Highlighting a recent token unlocking activity, Lookonchain, a market analytical platform, reported that the STEPN wallet had unlocked 74 million GMT for investors, which is approximately $25.47 million in value. The platform further mentioned that some of the investors deposited GMT on exchanges, immediately receiving the altcoin. At the reported time, GMT is currently falling [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/gmt-continues-to-slip-after-unlocking-activity-is-this-the-right-moment-for-buyers/\">GMT Continues To Slip After Unlocking Activity; Is This The Right Moment For Buyers?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]