[
  {
    "source": "Crypto Daily",
    "date": "2023-08-16T08:00:00.000Z",
    "title": "Market Maker GSR Scales Back Amidst High Profile Departures",
    "url": "https://cryptodaily.co.uk/2023/08/market-maker-gsr-scales-back-amidst-high-profile-departures",
    "description": "<p>GSR, the oldest market maker in the crypto space, is feeling the full impact of the ongoing bear market, with multiple top executives, including the CFO, departing the company.&nbsp;</p>\n<p>The company had also announced a staff cut in October 2022, terming them as a part of &ldquo;structural changes&rdquo; in the organization.&nbsp;</p>\nTop Executives Depart&nbsp;\n<p>As crypto&rsquo;s largest market maker retreats in the face of the bear market onslaught, several high-level executives, including C-level and department heads, are headed toward the exit. According to sources, the retrenchment is having a major impact on one of the industry&rsquo;s oldest and best-known players and one that is extremely prominent in the US markets. The most recent and maybe the most high-profile departure from the firm is its Chief Financial Officer, Jonathan Hugh. Hugh joined GSR in 2021 and played a pivotal role in building the company&rsquo;s finance function. Hugh has so far not commented on his departure.&nbsp;</p>\n<p>Other high-level executives leaving the company include GSR&rsquo;s Global Head of Product, Benoit Bosc, and its Director of Trading Operations, Aman Bhalla. Bosc had taken over the sales role from Michael Bressler, a highly experienced TradeFi executive from JP Morgan and Goldman Sachs. Bressler had joined GSR in 2021, becoming the company&rsquo;s sales head in 2021. However, Bressler left the firm in 2022.&nbsp;</p>\nOther Notable Departures&nbsp;\n<p>Other notable departures from the company include Jake Dwyer. Dwyer had joined the firm in 2021 and was tasked with leading GSR&rsquo;s DeFi and venture initiatives. Trader Quentin Dubois and the head of Quant Trading, Romain Bernard, have also exited the company, according to sources familiar with the matter. The Director of Business Development at GSR, Jeff Stern, has also left the organization. All of these departures occurred this year.&nbsp;</p>\n<p>While Dwyer confirmed his departure from GSR, the others, including Bhalla, Bosc, Vince, Barnard, and Dubois, have not commented on the matter. A spokesperson from GSR commented on the matter, stating that the company will look to evolve with the fast-moving crypto markets.&nbsp;</p>\n\n<p>&ldquo;GSR has been at the center of crypto markets for ten years &mdash; markets that are fast-moving and volatile. We owe it to our clients to continue adapting and evolving to keep pace with the speed of crypto, and we will continue to do so.&rdquo;</p>\n\n<p>The spokesperson also confirmed the departures of Bosc and Bhalla. However, they added that they will continue in their respective roles until the end of August and ensure a smooth transition of their respective roles.&nbsp;</p>\n\n<p>&ldquo;Our business operations and strategy have naturally evolved to respond to changing market conditions, but there has been no restructuring.&rdquo;</p>\n\nCrypto Winter Takes Its Toll&nbsp;\n<p>GSR had laid off around 10% of its workforce in October 2022, adding that the layoffs were part of structural changes. In doing so, the company became the latest in a long line of crypto firms that had to curtail their growth and ambitions in the face of a crippling crypto winter. Companies and exchanges operating have sanctioned a wave of layoffs as they look to navigate the crypto bear market. The firm had undertaken an aggressive expansion drive, growing its workforce to over 200 and reaching a peak of 300 before the layoffs took place. A source familiar with the firm and its operations stated,&nbsp;</p>\n\n<p>&ldquo;The executive team is mostly friends, and I think it threw off a lot of the momentum GSR built in the previous cycle. They hired a lot of corporate Wall Street executives that came in at the top of the bull market, which ended up costing the firm dearly.&rdquo;</p>\n\n<p>Most of the c-suite executives have links with Winton, CEO Jacob Palmstierna&rsquo;s former employer, or Goldman Sachs, the former employer of Rich Rosenblum and Cristian Gil. Staff at GSR believes that the firm got too big too soon and the team needs to be better streamlined. A GSR spokesperson stated,&nbsp;</p>\n\n<p>&ldquo;While last year&rsquo;s bear market created challenges for all crypto companies, our long-term belief in the space hasn&rsquo;t changed. We have continued investing and hiring in high-conviction areas and have maintained a world-class team of TradFi and DeFi talent that is uniquely positioned for another decade of growth.&rdquo;</p>\n\nScaling Back US Operations&nbsp;\n<p>The firm is also focusing on scaling back its US operations. Multiple sources have attributed the retreat to a combination of a number of factors. These include a decreasing appetite for token listings, a high cost of talent acquisition, and concerns around regulations. According to a source, the company has also moved from its New York office, taking up a space in Jersey City instead.&nbsp;</p>\n\n<p>&ldquo;At one point, it was probably their largest office, and they have been scaling it down meaningfully. They have given up their New York office and have a smaller space in Jersey City.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T07:46:19.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.1077, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 1.21% decrease. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T07:39:52.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $23.45 with a 24-hour trading volume of $618,897,839. Solana is down 5.97% in the last 24 hours. The current CoinMarketCap ranking is #9, with a live market cap of $9,473,881,101. It has a circulating supply of 418,890,490 SOL coins, and the maximum supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-16T08:08:41.000Z",
    "title": "Astounding Upswing Ahead? ARC-64 & ARC-71 Votes Might Herald Terra’s Price Surge",
    "url": "https://www.crypto-news-flash.com/astounding-upswing-ahead-arc-64-arc-71-votes-might-herald-terras-price-surge/?utm_source=rss&utm_medium=rss&utm_campaign=astounding-upswing-ahead-arc-64-arc-71-votes-might-herald-terras-price-surge",
    "description": "<img width=\"1500\" height=\"500\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/1500x500-2.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/1500x500-2.jpeg 1500w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/1500x500-2-300x100.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/1500x500-2-1024x341.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/1500x500-2-768x256.jpeg 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\" />Astroport&#8217;s ARC-64 is set to bridge $ASTRO for LP rewards to the Sei Network. ARC-71 part 2 envisions an enhanced PCL pool version on Terra after addressing a past liquidity issue. The decentralized finance ecosystem buzzes with excitement as Astroport brings forth two transformative proposals ripe for community voting. With the crypto world eagerly awaiting [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-16T08:01:06.000Z",
    "title": "Bitcoin Cash, VeChain and Pomerdoge Are Showing Steady Upside in Bear Market",
    "url": "https://www.crypto-news-flash.com/bitcoin-cash-vechain-and-pomerdoge-are-showing-steady-upside-in-bear-market/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-cash-vechain-and-pomerdoge-are-showing-steady-upside-in-bear-market",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-47.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-47.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-47-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-47-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Even during an overall bear market, some cryptocurrencies managed to stay on a steady upside with their value. Three altcoins that have reached significant gains even during this time include Bitcoin Cash (BCH) VeChain (VET), and Pomerdoge (POMD). Today, we will be taking a look at each altcoin individually to see how far they can [...]"
  }
]