[
  {
    "source": "Cointelegraph",
    "date": "2023-06-26T10:28:55.000Z",
    "title": "Crypto adoption in Cyprus beefed up by ByBit license approval",
    "url": "https://cointelegraph.com/news/bybit-gains-crypto-license-approval-in-cyprus",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/36fbbc33-78ab-4929-96ea-8862574dc970.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Following Binance's departure from the island, ByBit strengthens Cyprus' crypto ecosystem with license approval for operations</p>\n                    <p><p>Crypto exchange Bybit has announced a license approval to operate as an exchange and custody service in Cyprus. The world’s third most visited crypto exchange will begin offering to trade between crypto and fiat currency pairs and crypto-related financial services.</p><p>Cyprus is the third most populous island in the Mediterranean Sea with a population of 1.2 million people. In a press release, Ben Zhou, co-founder and CEO of Bybit explained the importance of expanding the group’s global presence, highlighting crypto’s role as a way of opting out of the legacy financial system: </p><blockquote>“We are excited to introduce the Crypto Ark to Cyprus.\"</blockquote><p>Cyprus is increasingly a crypto hotspot in the Mediterranean, in some parts driven by actions from the public sector. In 2022, Kyriacos Kokkinos, Republic then Cyprus Deputy Minister to the President for Research, <a href=\"https://www.youtube.com/watch?v=gKVG104SaWg\" target=\"_blank\" rel=\"noopener nofollow\">explained</a> that the country would become a hub for new disruptive technologies, including blockchain. </p><p>Historically, the Cypriot central bank <a href=\"https://seekingalpha.com/article/4585967-bitcoin-10-years-since-cyprus\" target=\"_blank\" rel=\"noopener nofollow\">warned</a> against crypto; while a decade has passed since a run on Cypriot banks induced a 600% price increase for Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). In 2023, Cyprus expressed its intentions to adopt blockchain technologies, sharing the Distributed Ledger Technology Bill in 2021.</p><p>Nonetheless, adoption levels pale compared to those observed on the island of Malta, also situated in the Mediterranean Sea. Malta <a href=\"https://media.licdn.com/dms/document/media/D4D1FAQGwOuNccHI-hQ/feedshare-document-pdf-analyzed/0/1687645783222?e=1688601600&amp;v=beta&amp;t=YSEcqbwi-6FIcSCiY-18LQbQdJPvdb0kAjFeN1Wr9KY\" target=\"_blank\" rel=\"noopener nofollow\">offers</a> three times as many blockchain-related jobs per capita and is commonly referred to as<a href=\"https://cointelegraph.com/news/malta-s-blockchain-island-strategy-falters-as-banks-refuse-to-play-ball\"> “Blockchain Island,”</a> while Bitcoin OGs, including Adam Back, speak <a href=\"https://twitter.com/adam3us/status/1440990446226968584?s=20\" target=\"_blank\" rel=\"noopener nofollow\">highly</a> of the crypto environment in Malta. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-adoption-in-mexico-boosted-by-lightning-partnership-with-retail-giant\"><strong><em>Bitcoin adoption in Mexico boosted by Lightning partnership with retail giant</em></strong></a></p><p>Furthermore, crypto industry behemoth Binance recently announced it would <a href=\"https://cointelegraph.com/news/binance-applies-to-deregister-in-cyprus\">deregister in Cyprus.</a> Initially headquartered in China, Binance now hosts offices worldwide and in crypto-friendly hotspots such as Dubai and Bahrain, and has besmirched Cyprus to focus on larger markets worldwide. </p><p>ByBit recognizes the “Immense potential of the Cyprus market,” while the newly approved license will make a contribution to the local cryptocurrency ecosystem.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/real-bedford-soccer-team-puts-bitcoin-on-the-map/\">Peter McCormack’s Real Bedford Football Club puts Bitcoin on the map</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T10:27:00.000Z",
    "title": "Binance struggles amid regulatory scrutiny, market share hits all-time low",
    "url": "https://www.cryptopolitan.com/binance-struggles-amid-regulatory-scrutiny-market-share-hits-all-time-low/",
    "description": "Binance, a leading cryptocurrency exchange, grapples with a significant decline in market share, reaching a one-year low. The exchange&#8217;s struggle to recover from this downward trend can be attributed to heightened regulatory scrutiny and legal actions by regulatory bodies, such as the US Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC). ... <a title=\"Binance struggles amid regulatory scrutiny, market share hits all-time low\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-struggles-amid-regulatory-scrutiny-market-share-hits-all-time-low/\" aria-label=\"More on Binance struggles amid regulatory scrutiny, market share hits all-time low\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T10:10:56.000Z",
    "title": "Binance targets UAE as key hub for expansion",
    "url": "https://www.cryptopolitan.com/binance-targets-uae-as-key-hub-for-expansion/",
    "description": "The world&#8217;s largest cryptocurrency exchange, Binance, has its eyes set on the United Arab Emirates (UAE) as a critical pivot for its expansion strategy. As the crypto behemoth grapples with regulatory challenges in various international jurisdictions, the promising regulatory clarity in the UAE presents a potentially fertile ground for Binance&#8217;s growth. Binance turning a new ... <a title=\"Binance targets UAE as key hub for expansion\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-targets-uae-as-key-hub-for-expansion/\" aria-label=\"More on Binance targets UAE as key hub for expansion\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-26T10:24:49.000Z",
    "title": "Golteum (GLTM) Is Not Another SHIB Or PEPE – Here’s Why GLTM Is Built For The Long Run",
    "url": "https://nulltx.com/golteum-gltm-is-not-another-shib-or-pepe-heres-why-gltm-is-built-for-the-long-run/",
    "description": "Everyone wants to find the next cryptocurrency rich overnight. But between the hype and FOMO, it can be hard to tell the difference between cryptocurrencies that leave some investors wandering and a project with real staying power. While other meme coins are focused on hype and popularity, Golteum (GLTM) is focused on real utility and [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-26T10:15:09.000Z",
    "title": "TMS Network (TMSN) Crushing ApeCoin (APE) and EOS (EOS) Market Share as Investment Surges",
    "url": "https://nulltx.com/tms-network-tmsn-crushing-apecoin-ape-and-eos-eos-market-share-as-investment-surges/",
    "description": "TMS Network’s (TMSN) investment surge has grabbed crypto enthusiasts’ attention, raising a remarkable $6 million since its coin offering event started. It crushes established platforms like ApeCoin (APE) and EOS (EOS) with token gains of around 2000% into the fourth presale phase. This article will discuss each platform basis and explain why TMS Network (TMSN) [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-26T10:18:40.000Z",
    "title": "Avalanche (AVAX) Rumbles With 18% Gain – Is A Trend Reversal On The Horizon?",
    "url": "https://www.newsbtc.com/news/avalanche-avax-rumbles-with-18-gain-is-a-trend-reversal-on-the-horizon/",
    "description": "Avalanche (AVAX) recently experienced a breakout, successfully overcoming a major obstacle at $13. This particular hurdle had proven to be a significant challenge for AVAX bulls in the preceding weeks, hampering their upward momentum. The surge in AVAX&#8217;s performance can be attributed to multiple factors, one of which is the increasing demand for the wrapped version of Bitcoin (BTC) on the Avalanche network.  As Bitcoin prices rose, more users sought to utilize the wrapped BTC on Avalanche, contributing to the network&#8217;s growing user base. Will AVAX’s upward momentum continue? Avalanche Price Shows Signs Of Exhaustion The price of AVAX, currently standing at $13.37 according to CoinGecko, has demonstrated a 2.7% rally within the past 24 hours, accompanied by an impressive seven-day surge of 18.0%. However, a closer examination reveals that AVAX&#8217;s recent upward momentum may be losing steam. Source: Coingecko Between June 10 and 25, AVAX gained a substantial 40% and established a price range spanning from $9.65 to $14.25. Despite approaching the upper boundary of this range, indications of exhaustion are becoming increasingly evident. Related Reading: Uniswap (UNI) Price Rockets 22% – Is There More Fuel In The Tank? Notably, from June 21 to 25, AVAX&#8217;s price formed three distinct higher highs. However, during the same period, the AVAX’s Relative Strength Index (RSI) and Awesome Oscillator (AO) formed lower highs. AVAX 7-day price climb. Source: CoinMarketCap This disparity, known as &#8220;bearish divergence,&#8221; suggests that the momentum behind AVAX&#8217;s recent ascent may be waning. In technical analysis, this formation typically serves as a sell signal and often precedes a correction in the underlying asset. Source: TradingView Bitcoin&#8217;s Influence May Shape AVAX Future Meanwhile, the potential resumption of bullishness in Bitcoin&#8217;s price at the beginning of a new week could present a challenging scenario for bears. The interplay between Bitcoin&#8217;s movement and AVAX&#8217;s price trajectory plays a pivotal role in determining the future direction of AVAX. As one of the most dominant cryptocurrencies in the market, Bitcoin serves as a major influencer for the overall sentiment and trends within the crypto space. Its movements often set the tone for the entire market, and AVAX, being an altcoin, is not immune to this influence. Avalanche market cap currently at $4.6 billion. Chart: TradingView.com Related Reading: PEPE Leapfrogs With 72% Rally – What’s Behind The Surprise Vigor? Bitcoin&#8217;s price movements have historically exhibited a strong correlation with the wider cryptocurrency market. When Bitcoin experiences significant price fluctuations, it tends to trigger a ripple effect that impacts other cryptocurrencies, including AVAX. This correlation stems from various factors, such as Bitcoin&#8217;s status as a benchmark cryptocurrency, its high trading volume, and its position as a store of value for many investors. As investors and enthusiasts closely monitor these developments, the question of whether AVAX can overcome the sell signals and embark on a renewed ascent lingers in the air. Featured image from Getty Images"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T10:17:38.000Z",
    "title": "Shiba Inu: Anticipating Shibarium Launch as SHIB Inches Closer to $0.00001",
    "url": "https://www.crypto-news-flash.com/shiba-inu-anticipating-shibarium-launch-as-shib-inches-closer-to-0-00001/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-anticipating-shibarium-launch-as-shib-inches-closer-to-0-00001",
    "description": "Shibarium, the highly anticipated layer-2 solution, is on the horizon, bringing potential benefits to SHIB investors. The recent suspension of the ShibBurn Twitter app disrupts the burn information sharing, but the burning initiatives remain active. As Shiba Inu (SHIB) edges closer to the $0.00001 mark, anticipation mounts for the impending release of Shibarium, the much-awaited [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T10:09:28.000Z",
    "title": "Ripple Onboarded for Real-Time Settlement Platform by Federal Reserve Bank of America – Will it Propel XRP Price to New ATH?",
    "url": "https://www.crypto-news-flash.com/ripple-onboarded-for-real-time-settlement-platform-by-federal-reserve-bank-of-america-will-it-propel-xrp-price-to-new-ath/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-onboarded-for-real-time-settlement-platform-by-federal-reserve-bank-of-america-will-it-propel-xrp-price-to-new-ath",
    "description": "The Federal Reserve Bank of America is rumored to be working with Ripple following some comments by Jerome Powell. The Federal Reserve’s upcoming instant payment service, FedNow, will launch in the coming month with several financial institutions onboarded already Ripple partners. Rumors are swirling on Twitter about the Federal Reserve Bank of America working with [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-26T10:20:25.000Z",
    "title": "Bitcoin’s Accumulation Trend Score Is Approaching Midpoint",
    "url": "https://coinedition.com/bitcoins-accumulation-trend-score-is-approaching-midpoint/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/The_Bitcoin_Accumulation_Trend_Score_by_Cohort_has_transitioned-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Data from Glassnode, the on-chain and financial metrics platform, reveals a more balanced regime in the Bitcoin Accumulation Trend Score by Cohort. The Bitcoin market metric transitioned from a heavy distribution to a balanced one. Glassnode indicates that only the Dolphin to Shark cohort, with 100 to 1,000 BTC, is still experiencing aggressive distribution. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoins-accumulation-trend-score-is-approaching-midpoint/\">Bitcoin’s Accumulation Trend Score Is Approaching Midpoint</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]