[
  {
    "source": "Decrypt",
    "date": "2023-08-25T11:44:50.000Z",
    "title": "Blockchain Tech and AI Will Have ‘Very Tight Coupling’: Marathon Digital CEO",
    "url": "https://decrypt.co/153714/blockchain-tech-and-ai-will-have-very-tight-coupling-marathon-digital-ceo",
    "description": "Amid ongoing AI hype, Bitcoin mining firm Marathon Digital is seeking to diversify its operations, both technologically and geographically."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T11:59:50.000Z",
    "title": "Vauld gets permission for board restructuring from the court ",
    "url": "https://cointelegraph.com/news/vauld-gets-permission-for-board-restructuring-from-the-court",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/eb629336-f507-4900-8d5b-b9bfad3b9937.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Singapore-based crypto exchange has been ongoing bankruptcy proceedings since August 2022.</p>\n                    <p><p>Vauld, a Singapore-based crypto exchange, that has been ongoing bankruptcy proceedings since August 2022, has said that it received permission from the court to restructure its board. The new top management will lead the company’s bailout process. </p><p>On Aug. 24, Vauld’s co-founder Darshan Bathija <a href=\"https://twitter.com/darshanbathija/status/1694810207233380483\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a> on X (former Twitter), that the company got its scheme of arrangement passed in Singapore court. According to the plan, the current board will be replaced with a new CEO, a creditor representative, and a scheme manager. </p><p>The platform also resumed the know-your-customer (KYC) checks for existing customers, who now have to resubmit their verification documents. In August 2022, Indian law enforcement <a href=\"https://techcrunch.com/2022/08/12/india-seizes-46-million-from-crypto-exchange-vauld-in-money-laundering-probe/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAACSNTUA1gt_cUa1xg3X8sMwKjql1Z0hVLwnfNGZN2XFrRHoNndU_NdrEmdi-RfAUEehO4X6TCvtcXm-BQnYiEGFbaZ1_vzMR496xLYnzPL3y70jpL5q3bh5fxdAdKz85NcGe87sX0HW3p5RrnYqQpo_6tjhiSw5DHMF1iRpGDTA1\" target=\"_blank\" rel=\"noopener nofollow\">seized</a> $46.4 million from the Indian branch of Vauld, Flipvolt Technologies, due to the allegations of money laundering. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/3ac-cofounder-avoids-contempt-charges-following-evidence-singaporean-citizenship\"><strong><em>3AC co-founder avoids contempt charges following evidence of Singaporean citizenship</em></strong></a></p><p>Vauld f<a href=\"https://cointelegraph.com/news/troubled-crypto-lender-vauld-gets-extended-creditor-protection#:~:text=halted%20withdrawals%20for%20its%20800%2C000%20customers\">roze the withdrawal option</a> for their customers in July 2022, citing unfavorable market conditions and a two-week “bank run” costing $200 million worth of withdrawals. The company cited the losses relating to the declining prices of major cryptocurrencies and its exposure to the stablecoin UST, which collapsed in May 2022. </p><p> In August 2022, it was granted a three-month moratorium to develop a restructuring plan. The plan suggested an acquisition by a Swiss-headquartered crypto lender Nexo, but in January 2023 Nexo’s office <a href=\"https://cointelegraph.com/news/bulgarian-authorities-charge-four-individuals-following-raid-on-nexo-office-report\">was raided by law enforcement</a> and the negotiations stopped. </p><p>The same month Vauld <a href=\"https://cointelegraph.com/news/troubled-crypto-lender-vauld-gets-extended-creditor-protection\">was given another period</a> of creditor protection by a Singapore court, and in February it was <a href=\"https://bingx.com/en-us/news/22505/\" target=\"_blank\" rel=\"noopener nofollow\">extended</a>. The company owes its creditors around $400 million, the majority of which is individual depositors' money. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-25T11:55:23.000Z",
    "title": "Stablecoin volume outpaces Mastercard, PayPal as digital payments wars loom",
    "url": "https://cryptoslate.com/stablecoin-volume-outpaced-mastercard-paypal-in-2022-as-digital-payments-wars-loom/",
    "description": "<p>Fiat-backed stablecoins have eclipsed Mastercard and PayPal in moving more value across their networks in 2022, according to a Bloomberg Intelligence note on Aug. 25. According to Bloomberg Intelligence crypto market analyst Jamie Coutts, stablecoins on several Layer-1 networks transacted $6.87 trillion in 2022, surpassing the transaction volumes of Mastercard and PayPal. However, stablecoins still [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/stablecoin-volume-outpaced-mastercard-paypal-in-2022-as-digital-payments-wars-loom/\">Stablecoin volume outpaces Mastercard, PayPal as digital payments wars loom</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-25T11:43:28.000Z",
    "title": "HashKey to Give Hong Kong Traders Bitcoin, Ether Options",
    "url": "https://cryptobriefing.com/hashkey-bitcoin-ether-options/?utm_source=feed&utm_medium=rss",
    "description": "HashKey Exchange preps to unveil Bitcoin and Ether retail trading in Hong Kong, supplemented by an investor grading framework."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-25T12:08:42.000Z",
    "title": "\n                        Can I Earn Crypto Without Investing a Dime?\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/can-i-earn-crypto-without-investing-a-dime",
    "description": "\n                        <p dir=\"ltr\">Crypto is a concept that intrigues many of us. With its features and advantages, it has the potential to become a great part of what we call finance. But how do you start working with crypto?</p>\n<p dir=\"ltr\">Well, a good option may be buying some coins or tokens. But to get a surprising profit, you will have to invest a significant amount of fiat, which can drive away some crypto enthusiasts.</p>\n<p dir=\"ltr\">However, you can earn crypto without investing in it, and in this article, we will talk about some of the most popular ways to earn digital assets with little to no effort but lots of fun.&nbsp;</p>\nAirdrops\n<p dir=\"ltr\">Crypto airdrops are special events organized by newly launched crypto projects to increase their popularity and allow crypto enthusiasts to invest in the project in its early stages. Basically, a crypto airdrop implies distributing free tokens to a certain number of wallet addresses within a particular blockchain.&nbsp;</p>\n<p dir=\"ltr\">While being part of a project&rsquo;s marketing strategy, crypto airdrops are also organized to reward existing token holders. However, the concept is similar in both situations. Such special events can build an engaged community and introduce new users to the world of cryptocurrencies by providing them with digital assets to trade.&nbsp;</p>\n<p dir=\"ltr\">Participating in a crypto airdrop usually implies completing specific actions that can increase the popularity of the crypto project. For example, you might be required to follow the company on Twitter, Instagram, Facebook, or Twitter, join its Discord and Telegram channels, or subscribe to its YouTube channel.&nbsp;</p>\n<p dir=\"ltr\">Also, you may be able to refer some friends to get extra entries, and you can submit your wallet address or provide personal information to sign up for the airdrop. Your wallet address will be useful when the airdrop ends, and the project distributes the free tokens.&nbsp;</p>\nLearn and Earn\n<p dir=\"ltr\">What could be better than earning crypto while learning new things about this amazing industry? Learn and earn activities have become very important for cryptocurrency adoption, offering users an interactive way to acquire knowledge about various topics, such as blockchain technology, digital assets, DeFi, and many more.</p>\n<p dir=\"ltr\">Currently, plenty of apps and platforms allow users to get through some guides and then complete quizzes to earn crypto rewards. The tutorials are designed to educate newcomers regarding various crypto-related topics. As users engage with educational content, they can earn crypto as rewards, thus being able to apply what they have learned to trade the crypto rewards and make some profits.&nbsp;</p>\n<p dir=\"ltr\">The process is extremely straightforward. All you have to do is find a platform that offers learn and earn activities, go to the section, and start reading or watching the first guide. After you gather the information you need, you will be required to take a quick test to ensure that everything you&rsquo;ve learned is clear and will help you afterward.&nbsp;</p>\n<p dir=\"ltr\">When you finish the quiz, the platform will offer you a small crypto reward you can withdraw and use as you like. You can trade or swap it or even opt to stake the crypto earned if the cryptocurrency works based on a PoS (Proof of Stake) consensus mechanism. This way, you will be able to earn profit without having to study the crypto market thoroughly.&nbsp;</p>\nUse a Crypto Browser\n<p dir=\"ltr\">We are not talking about simply using a crypto browser and winning crypto by searching whatever you want and navigating through the results. However, you can look for a crypto search engine that allows users to earn crypto while completing various tasks.&nbsp;</p>\n<p dir=\"ltr\">For instance, you can get paid to watch crypto videos. All you have to do is find the crypto-related videos the platform provides and watch them. Then, a tiny crypto reward will be delivered to your wallet.&nbsp;</p>\n<p dir=\"ltr\">Then, you can also get paid to click on ads. Ads are everywhere, but most of the time, we don&rsquo;t click on them. However, if you want to earn crypto this way, you will be required to click on ads in different sections, and the crypto search engine will reward you once again.&nbsp;</p>\n<p dir=\"ltr\">Furthermore, if you&rsquo;ve already earned some crypto assets this way, you can be offered more through a profit-sharing program. Some crypto browsers share a significant percentage of their profit with all those holding tokens in the system.</p>\nGet Paid in Crypto\n<p dir=\"ltr\">These days, you can easily get paid in crypto and hold significant amounts of tokens this way. For instance, if you are a freelancer, you can offer clients the option to pay you in crypto. All you have to do is provide a valid wallet address.&nbsp;</p>\n<p dir=\"ltr\">As a freelancer, there are many jobs available, and considering that crypto is becoming increasingly popular, there is a high possibility that some clients will prefer paying for your products or services with digital assets.</p>\n<p dir=\"ltr\">Then, if you want a full-time job that offers payments in crypto, you may be able to find it on various crypto job platforms. The jobs in crypto are plenty and cover multiple fields. For instance, you can contribute to developing a project as a programmer, work with a marketing team to promote a new product or service, or even ensure that the project does not violate regulations from a specific area. Depending on your experience, crypto job platforms surely have something available that will catch your attention.&nbsp;</p>\nPlay P2E Games\n<p dir=\"ltr\">One of the most fun ways in which you can earn crypto without investing is by playing a P2E (Play-to-Earn) game. The name says it all; you play, you earn. Unlike traditional video games, where in-game achievements might lead to virtual rewards, blockchain-based P2E games reward users with various digital assets. There are plenty of such games in the crypto industry, and the rewards can be pretty remarkable.&nbsp;</p>\n<p dir=\"ltr\">Usually, P2E games can challenge you to grow something, such as a dragon, or even prove your strategy and fight skills while competing in specific tournaments. A play-to-earn game will always use a native token that can be either withdrawn or used for in-game purchases.&nbsp;</p>\n<p dir=\"ltr\">P2E games use NFTs (Non-Fungible Tokens) and blockchain technology to establish ownership of in-game assets. Players can acquire, trade, and sell NFTs that represent items, characters, land, and many more.&nbsp;</p>\nIn Conclusion\n<p dir=\"ltr\">As surprising as it may seem, you can easily earn crypto without investing, and this can be a great way to start your journey in the world of cryptocurrencies. If you start with a small amount of digital assets and know how to trade them right, you will earn some profit in no time.&nbsp;</p>\n<p dir=\"ltr\">Some of the best ways to earn crypto without investing include participating in airdrops, using crypto search engines, playing P2E games, completing learn-and-earn activities, or simply getting paid in crypto for your work.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p>&nbsp;</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T12:01:20.000Z",
    "title": "Exploring the AI Landscape in Europe and Best Locations for AI Careers",
    "url": "https://www.cryptopolitan.com/ai-landscape-in-europe-and-best-locations/",
    "description": "As we delve into the realm of AI tools in workplaces, it becomes evident that Europe holds promising grounds for AI-focused roles. The year 2023 has unmistakably been dominated by artificial intelligence, particularly generative AI, making waves across various sectors. Notably, ChatGPT, the flagship example of generative AI, set a remarkable milestone by amassing 100 ... <a title=\"Exploring the AI Landscape in Europe and Best Locations for AI Careers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-landscape-in-europe-and-best-locations/\" aria-label=\"More on Exploring the AI Landscape in Europe and Best Locations for AI Careers\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-25T12:00:34.000Z",
    "title": "Domini ($DOMI) vs. Avalanche vs. Stellar: Forecasting the Next Big Investment Wave",
    "url": "https://nulltx.com/domini-domi-vs-avalanche-vs-stellar-forecasting-the-next-big-investment-wave/",
    "description": "Avalanche ($AVAX) has been going through a rough patch in this month, and similarly, Stellar ($XLM) has been down considerably since around the start of August Meanwhile, Domini ($DOMI) has entered the scene in the context of these top altcoins falling. So what is Domini ($DOMI), and what does it do? Moreover, can it truly [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-25T11:40:43.000Z",
    "title": "Bitcoin Whales Buy Dip, Addresses Now At Pre-Crash Levels",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-whales-buy-dip-addresses-now-at-pre-crash-levels/",
    "description": "On-chain data shows the Bitcoin whales have been buying the dip, as their addresses have surged back towards pre-crash levels again. Bitcoin Whales Have Fully Recovered To Their Pre-Crash Number As pointed out by an analyst in a post on X, the whales appear to have been accumulating recently. The relevant indicator here is the &#8220;whale address count,&#8221; which measures the total number of Bitcoin addresses that hold at least 1,000 BTC and at most 10,000 BTC. At the current exchange rate, this range converts to approximately $26 million at the lower bound and $260 million at the upper bound. These are clearly very significant amounts and the only investors large enough to be owners of these addresses would be the whale entities. The whales naturally carry some influence in the market, due to the fact that they hold a notable part of the total circulating supply of the asset. Thus, their movements can be worth keeping an eye on, as they can influence the price of the asset. Another version of the indicator tracks the addresses with balances upwards of 10,000 BTC (that is, this range&#8217;s upper bound), but at those levels, the wallets become more likely to belong to central entities like exchanges, so the trend in their addresses may not hold the same significance as what that of the normal whales would. Now, here is a chart that shows the trend in the Bitcoin whale address count over the past month or so: Looks like the value of the metric has spiked in recent days &#124; Source: @ali_charts on X As displayed in the above graph, the whale address count observed a large drop around the time of the asset&#8217;s crash a few days back, where the price plummeted from the $29,000 level to below the $26,000 mark. This decline in the number of addresses of these humongous investors would imply that some members of this cohort participated in distribution during the crash. Related Reading: Bitcoin Bottom: BTC Not Fulfilling This Historical Pattern Yet These whales who participated in the selloff didn&#8217;t necessarily clear out their entire holdings and exit the market, though, as distribution just enough to bring their address balances below the 1,000 BTC mark would still lead to a drawdown in the indicator. Initially, following the crash, the number of these large Bitcoin holders remained flat, implying that there wasn&#8217;t any significant accumulation or distribution taking place. In the past few days, however, the BTC whale address count has registered a sharp spike, suggesting that more whale-sized addresses have popped up on the network. With this uplift, the indicator has returned back to about the same values as it was before the price crash had occurred. Related Reading: Bitcoin NVT Flashes Buy Signal, Bottom In? The whales participating in buying at the current price lows is naturally a positive sign for the cryptocurrency, as it could provide a more solid foundation for a rebound in the asset&#8217;s value. BTC Price At the time of writing, Bitcoin is trading near $26,021, down 1% in the last seven days. BTC appears to have been moving sideways around the $26,000 level recently &#124; Source: BTCUSD on TradingView Featured image from Todd Cravens on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T12:00:06.000Z",
    "title": "Whale Who Bought Filecoin and VeChain Before They Exploded in Value Is Now Accumulating Everlodge",
    "url": "https://www.crypto-news-flash.com/whale-who-bought-filecoin-and-vechain-before-they-exploded-in-value-is-now-accumulating-everlodge/",
    "description": "<img width=\"512\" height=\"307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-131.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-131.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-131-300x180.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-131-336x200.png 336w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto whale who bought a significant amount of Filecoin (FIL) and VeChain (VET) is now eyeing the Everlodge cryptocurrency. This upcoming project will enter the real-estate world and will make it far more liquid and accessible to the everyday person. Today, we will explore all three projects to see what kind of future is [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-25T11:41:13.000Z",
    "title": "How Crypto VCs Can Buy Cryptos Without Altering Their Price?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-crypto-vcs-can-buy-cryptos-without-altering-their-price/",
    "description": "<p>Over-the-counter (OTC) trading has emerged as a strategic solution to this issue, allowing market participants to buy cryptocurrencies without causing sudden price fluctuations. In this article, we delve into the concept of OTC trading, especially in crypto transactions,  exploring its definition, its beneficiaries, as well as its advantages and limitations. Understanding OTC Trading Over-the-counter (OTC) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-crypto-vcs-can-buy-cryptos-without-altering-their-price/\">How Crypto VCs Can Buy Cryptos Without Altering Their Price?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-25T12:01:00.000Z",
    "title": "Lending Protocol Magnate Finance Rug Pulls, Exits With $6.5 Million",
    "url": "https://coinedition.com/lending-protocol-magnate-finance-rug-pulls-exits-with-6-5-million/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/CertiK-Alert-Reports-Bitpaid-Faces-81-Drop-And-30K-Loss-Due-to-Exploit.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"CertiK Alert Reports Bitpaid Faces 81% Drop And $30K Loss Due to Exploit\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/CertiK-Alert-Reports-Bitpaid-Faces-81-Drop-And-30K-Loss-Due-to-Exploit.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/CertiK-Alert-Reports-Bitpaid-Faces-81-Drop-And-30K-Loss-Due-to-Exploit-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/CertiK-Alert-Reports-Bitpaid-Faces-81-Drop-And-30K-Loss-Due-to-Exploit-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/CertiK-Alert-Reports-Bitpaid-Faces-81-Drop-And-30K-Loss-Due-to-Exploit-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/CertiK-Alert-Reports-Bitpaid-Faces-81-Drop-And-30K-Loss-Due-to-Exploit-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/CertiK-Alert-Reports-Bitpaid-Faces-81-Drop-And-30K-Loss-Due-to-Exploit-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>CertiK Alerts, a platform that provides information on crypto hacks and scams, has reported an exit scam on Magnate Finance, a DeFi lending and borrowing platform. CertiK Alert posted on Twitter (X) that it has observed an 89% slippage on Magnate Finance. The alerts platform noted that 247 WETH, $1.3m DAI, and $2m USDbC were [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/lending-protocol-magnate-finance-rug-pulls-exits-with-6-5-million/\">Lending Protocol Magnate Finance Rug Pulls, Exits With $6.5 Million</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-25T11:45:05.000Z",
    "title": "Crypto Trader Calls One Blue-Chip Altcoin’s Price Action ‘Scary’, Updates Outlook on Bitcoin and THORChain",
    "url": "https://dailyhodl.com/2023/08/25/crypto-trader-calls-one-blue-chip-altcoins-price-action-scary-updates-outlook-on-bitcoin-and-thorchain/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Trader-Says-One-Blue.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Trader-Says-One-Blue.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Trader-Says-One-Blue.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Trader-Says-One-Blue.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Trader-Says-One-Blue.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Trader-Says-One-Blue.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Trader-Says-One-Blue.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader says that Binance Coin (BNB) is dangerously close to losing key support amid a bearish digital assets market. Pseudonymous trader Altcoin Sherpa tells his 196,300 followers on the social media platform X that BNB could dip below the $200 level as the altcoin trades well below its 200-day simple moving [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/25/crypto-trader-calls-one-blue-chip-altcoins-price-action-scary-updates-outlook-on-bitcoin-and-thorchain/\">Crypto Trader Calls One Blue-Chip Altcoin’s Price Action ‘Scary’, Updates Outlook on Bitcoin and THORChain</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]