[
  {
    "source": "Cointelegraph",
    "date": "2023-07-27T03:13:58.000Z",
    "title": "Robert Kennedy Jr. admits to buying 2 Bitcoin for each of his 7 children",
    "url": "https://cointelegraph.com/news/presidential-candidate-rfk-jr-purchased-bitcoin-for-his-children",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/b4c6eaf8-4662-4147-b9f4-6f220e140fca.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>“I’m going to put my money where my mouth is,” said the Democratic presidential candidate as he doubled down on his support for Bitcoin.</p>\n                    <p><p>Democratic presidential candidate Robert F. Kennedy Jr. has confirmed he purchased a significant amount of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), earlier this year — buying two BTC for each of his seven children.</p><p>Speaking in a July 26 Twitter <a href=\"https://twitter.com/scottmelker?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" target=\"_blank\" rel=\"noopener nofollow\">space</a>, Kennedy said the decision came after he received “a lot of criticism” from crypto industry pundits and the mainstream press in the wake of his pro-Bitcoin comments made at the Bitcoin Miami Conference in May. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Live now discussing <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> with ⁦<a href=\"https://twitter.com/RobertKennedyJr?ref_src=twsrc%5Etfw\">@RobertKennedyJr</a>⁩ ⁦<a href=\"https://twitter.com/Breedlove22?ref_src=twsrc%5Etfw\">@Breedlove22</a>⁩ ⁦<a href=\"https://twitter.com/1MarkMoss?ref_src=twsrc%5Etfw\">@1MarkMoss</a>⁩ ⁦<a href=\"https://twitter.com/natbrunell?ref_src=twsrc%5Etfw\">@natbrunell</a>⁩ and ⁦<a href=\"https://twitter.com/MartyBent?ref_src=twsrc%5Etfw\">@MartyBent</a>⁩  <a href=\"https://t.co/gx5a63SDOj\">https://t.co/gx5a63SDOj</a></p>&mdash; The Wolf Of All Streets (@scottmelker) <a href=\"https://twitter.com/scottmelker/status/1684266777910337549?ref_src=twsrc%5Etfw\">July 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Kennedy said he was critiqued for promoting a “volatile commodity” while not having any skin of his own in the game. </p><blockquote>“Right after that Bitcoin conference I got a big check and I said, okay, you know, I'm going to put my money where my mouth is and so I bought two Bitcoin for every one of my seven children.”</blockquote><p>Kennedy has six biological children, including for sons and two daughters, whose ages range from 22 to 38.</p><p>Assumedly, the seventh child comes from Kennedy's most recent marriage to actress Cheryl Hines, who had one daughter before the pair married in 2014. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BREAKING: Democrat Presidential candidate Robert Kennedy Jr. announces that he is a <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> holder.</p>&mdash; Dennis Porter (@Dennis_Porter_) <a href=\"https://twitter.com/Dennis_Porter_/status/1684224436633849856?ref_src=twsrc%5Etfw\">July 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>At the time of his speech at the conference — where he also announced that he would <a href=\"https://cointelegraph.com/news/breaking-robert-f-kennedy-jr-to-accept-campaign-donations-in-bitcoin\">begin accepting campaign donations in Bitcoin</a> — the candidate denied having any personal investment in the cryptocurrency. </p><p>“I am not an investor, and I am not here to give investment advice,” he said.</p><p>This marks the first time that Kennedy has admitted to owning the cryptocurrency, and lines up with a <a href=\"https://cointelegraph.com/news/robert-f-kennedy-jr-invested-up-to-250-000-in-bitcoin-after-miami-conference\">leaked financial disclosure which revealed</a> the candidate “between $100,001 and $250,000” worth of Bitcoin at the end of June. </p><p>However, if RFK had purchased a total of 14 Bitcoin for an approximate price of $26,800 in the days following the end of the conference — his total holdings at the end of June would’ve surpassed $380,000. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/rfk-jr-elaborates-position-on-cbdc-crypto-it-isn-t-just-criminals-who-want-privacy\"><strong><em>RFK Jr. elaborates position on CBDC, crypto: ‘It isn’t just criminals who want privacy’</em></strong></a></p><p>At the time of publication, the price of Bitcoin stands at $29,327, according to Cointelegraph price <a href=\"https://cointelegraph.com/price-indexes\">data</a>, meaning that Kennedy’s investment is now worth a total of $410,000. </p><p>In the interview, Kennedy reaffirmed his plan to <a href=\"https://cointelegraph.com/news/rfk-jr-will-back-us-dollar-with-bitcoin-if-president\">back the U.S. dollar with Bitcoin</a> as well as making the asset exempt from capital gains taxes if elected President. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This kind of thing partly explains the appeal of Bitcoin. Our freedom to transact and save should not be at the mercy of political enforcers. No payment platform should be allowed to discriminate against people for exercising their right to free speech.</p>&mdash; Robert F. Kennedy Jr (@RobertKennedyJr) <a href=\"https://twitter.com/RobertKennedyJr/status/1683999117243023363?ref_src=twsrc%5Etfw\">July 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Saying that he sees Bitcoin as a vehicle for returning innovation to America, he added that any capital gains exemptions on Bitcoin conversions should only apply to smaller investors and businesses, as to not create “huge windfalls” for large companies like BlackRock and Goldman Sachs. </p><p><strong><em>Opinion: </em></strong><a href=\"https://cointelegraph.com/magazine/opinion-republican-crypto-maxis-democrat-anti-crypto-army-mchenry-warren/\"><strong><em>GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-27T03:13:00.000Z",
    "title": "Crypto Investment Products Focused on $XLM, $XRP, and $SOL See Significant Inflows: CCData Report",
    "url": "https://www.cryptoglobe.com/latest/2023/07/crypto-investment-products-focused-on-xlm-xrp-and-sol-see-significant-inflows-ccdata-report/",
    "description": "Cryptocurrency investment products focused on three major altcoins – Stellar ($XLM), $XRP, and Solana ($SOL ) – all saw major inflows this month, which led to significant rises in their assets under management, even though the main surge in assets under management came from Bitcoin ($BTC) products. According to CCData’s latest Digital Asset Management Review […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-27T03:11:01.000Z",
    "title": "Bitcoin Price Struggles Post Expected Fed Result, More Losses Ahead?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-struggles-29600/",
    "description": "Bitcoin price is struggling to recover above the $29,000 resistance level. BTC must settle above $29,000 and then $29,600 to move into a positive zone. Bitcoin is attempting a recovery wave above the $28,850 level. The price is trading below $29,200 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support near $29,250 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could face a strong resistance near the $29,600 resistance. Bitcoin Price Still In The Negative Zone Bitcoin price started a short-term recovery wave above the $29,000 resistance zone. BTC was able to climb above the $29,200 resistance zone after the Fed interest rate decision. There was a move above the 23.6% Fib retracement level of the key drop from the $30,335 swing high to the $28,880 low. However, the bears were active near the $29,600 resistance zone and there was no close above the 100 hourly Simple moving average. Bitcoin is now trading below $29,200 and the 100 hourly Simple moving average. Besides, there is a key bullish trend line forming with support near $29,250 on the hourly chart of the BTC/USD pair. Immediate resistance is near the $29,450 level and the 100 hourly Simple moving average. The first major resistance is near the $29,600 level. It is near the 50% Fib retracement level of the key drop from the $30,335 swing high to the $28,880 low. Source: BTCUSD on TradingView.com The next major resistance is near the $29,800 level, above which the price might start a decent increase toward the $30,000 resistance zone. The next major resistance is near the $30,350 level, above which the price could gain bullish momentum. Fresh Decline in BTC? If Bitcoin fails to clear the $29,600 resistance, it could start a fresh decline. Immediate support on the downside is near the $29,200 level and the trend line. The next major support is near the $29,000 level, below which the price could drop toward $28,880. The next support is near the $28,500 level. Any more losses might call for a move toward the $28,200 level in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $29,200, followed by $29,000. Major Resistance Levels – $29,400, $29,600, and $30,000."
  }
]