[
  {
    "source": "Decrypt",
    "date": "2024-03-29T20:06:02.000Z",
    "title": "Bitcoin ETFs Rebound With $854 Million in Investments in One Week",
    "url": "https://decrypt.co/224132/bitcoin-etfs-rebound-with-854-million-in-investments-in-one-week",
    "description": "Interest surrounding the market’s newest investment vehicle returned after several days of malaise."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-29T20:06:11.000Z",
    "title": "CFTC’s Caroline Pham says KuCoin charges may infringe on SEC authority",
    "url": "https://cryptoslate.com/cftcs-caroline-pham-says-kucoin-charges-may-infringe-on-sec-authority/",
    "description": "<p>CFTC Commissioner Caroline Pham said on March 29 that her agency&#8217;s charges against KuCoin may infringe on the duties of the SEC. Pham acknowledged the CFTC case as an &#8220;aggressive enforcement action&#8221; and commended the Division of Enforcement for the move. However, she raised concerns about part of the allegations. Distinction needed According to Pham, the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/cftcs-caroline-pham-says-kucoin-charges-may-infringe-on-sec-authority/\">CFTC&#8217;s Caroline Pham says KuCoin charges may infringe on SEC authority</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-29T19:45:45.000Z",
    "title": "European trading hours lead global Bitcoin surge in 2024’s first quarter",
    "url": "https://cryptoslate.com/insights/european-trading-hours-lead-global-bitcoin-surge-in-2024s-first-quarter/",
    "description": "<p>Quick Take Bitcoin has experienced a remarkable first quarter in 2024, as reported by Coinglass, with the digital asset surging by an impressive 64% over the quarter and by 13% in March alone. This surge marks the seventh consecutive month of gains for Bitcoin. The introduction of spot Bitcoin ETFs in the United States has [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/european-trading-hours-lead-global-bitcoin-surge-in-2024s-first-quarter/\">European trading hours lead global Bitcoin surge in 2024&#8217;s first quarter</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-29T20:09:01.000Z",
    "title": "Elon Musk’s X to introduce advanced Grok-1.5 AI to testers next week",
    "url": "https://cryptobriefing.com/elon-musks-x-grok-ai/",
    "description": "Elon Musk's X platform to feature Grok-1.5 AI, with advanced reasoning and a 128K token capacity for early testers next week."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-29T20:04:31.000Z",
    "title": "SBF’s team plans appeal as financial landscape shifts",
    "url": "https://www.cryptopolitan.com/sbfs-team-plans-appeal/",
    "description": "Ex-FTX CEO SBF receives a 25-year prison term from a federal judge for various felonies, eliciting conflicting responses from the crypto community and beyond. SBF&#8217;s sentencing location and sentencing On March 28, after multiple felony convictions, Federal Judge Lewis Kaplan sentenced former FTX CEO Sam &#8220;SBF&#8221; Bankman-Fried to 25 years in prison. The judge called [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-29T20:00:49.000Z",
    "title": "Global Officials Emphasize Responsible Use of AI to Drive Innovation",
    "url": "https://www.cryptopolitan.com/responsible-use-of-ai-to-drive-innovation/",
    "description": "In an event at the Swedish Embassy, the United States and Sweden leaders highlighted the future of artificial intelligence (AI) technology that may reshape all areas while reiterating the responsible and ethical use of such power to better the world. International collaboration for ethical AI Mr. Paul-Arne Hjelmborn, director general for trade in the Swedish [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-29T19:48:01.000Z",
    "title": "Polymarket sees bets of $2.4 million on Ethereum ETF approval",
    "url": "https://www.cryptopolitan.com/polymarket-bets-2-4-million-ether-etf/",
    "description": "Crypto traders have entered the speculative market, making bets on the potential approval of a spot Ethereum exchange-traded fund (ETF) by the United States Securities and Exchange Commission. The United States SEC is set to make its verdict before May 31, and market participants have lined up to make bets on it on Ploymarket. Polymarket [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-29T19:42:10.000Z",
    "title": "League of Legends MidSeason Invitational 2024: Details and Ticket Information",
    "url": "https://www.cryptopolitan.com/league-of-legends-midseason-invitational/",
    "description": "The world&#8217;s top esports has just been announced by Riot Games, the League of Legends Midseason Invitational (MSI), to be hosted in Chengdu, China, in May 2019. This tournament is expected to give the best teams in the world a chance to flaunt their skills in a unique format and increase the stakes. Format overview [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-29T20:02:18.000Z",
    "title": "Litecoin’s price breaks above $106 for 1st time since July 2023; More gains ahead?",
    "url": "https://crypto.news/litecoin-price-gains-ahead/",
    "description": "Litecoin's price reached an eight-month peak of $106.2 on March 29, and recent trends observed among miners and speculative traders suggest more gains ahead."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-29T20:00:54.000Z",
    "title": "Crypto Expert Predicts Massive Shiba Inu Run As Price Mirrors 2021",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-price-mirrors-2021/",
    "description": "Crypto expert Rekt Capital has suggested that Shiba Inu (SHIB) could follow a similar trajectory to its move back in 2021. If so, this sets up the crypto token for a parabolic move that could see it hit its all-time high (ATH) and even surpass it.  2024 Shiba Inu To Mirror 2021 Action Rekt Capital mentioned in an X (formerly Twitter) post that SHIB’s retest was successful and that history was repeating itself. According to him, SHIB needs to break above the $0.000033285 price range to begin its uptrend continuation. In a previous post, the crypto analyst raised the possibility of SHIB’s price action mirroring the one from 2021.  Related Reading: The Bulls Are Back: Spot Bitcoin Inflows Surge With New Records He noted how SHIB came close to that price range but couldn’t break this resistance level. This was the same thing in late 2021, as Shiba Inu didn’t break that resistance level on the first attempt. That forced the meme coin to retest the $0.000026041 price level as a new support before confirming further upside.  Source: X This time, Shiba Inu also retested that $0.000026041 price level during its recent price dip, which was partly caused by a wave of profit-taking. The meme coin showed great resolve and somehow managed to hold above that level, and it has since made a good recovery.  Now, it needs to break above the $0.000033285 price range to confirm that history is repeating itself and that a price surge to the one in 2021 is on the horizon. 2021 was SHIB’s breakout year when it enjoyed a mouth-watering gain of 46,000,000% on its way to an ATH of $0.00008845 in October 2021.  Analysts Optimistic About Shiba Inu’s Future Trajectory Rekt Capital isn’t the only one optimistic about SHIB’s future trajectory. Crypto analyst and trader Xanrox recently predicted that SHIB could rise to $0.00008854 by July, representing a new ATH for the meme coin. Interestingly, that looks to be only the starting point for the meme coin, as other analysts have predicted that SHIB could shed another zero.  Related Reading: Dogecoin Holder Base Reaches New Record Amid Surge In Interest One of them is crypto investor and analyst Oscar Ramos, who expressed his bullish sentiment about the meme coin when he predicted it could rise to $0.0001. Technical analyst Javon Marks also echoed similar sentiments when he suggested that SHIB could rise to as high as $0.0001553.  Meanwhile, crypto analyst Ali Martinez once suggested that SHIB’s price gain in 2021 could be nothing compared to what lies ahead for the meme coin. Specifically, Martinez predicted that Shiba Inu could see a historic 122,000% price surge to $0.011. At the time of writing, SHIB is trading around $0.00003116, up over 3% in the last 24 hours according to data from CoinMarketCap.  SHIB price at $0.00003 &#124; Source: SHIBUSDT on Tradingview.com Featured image from Coinpedia, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-29T20:06:07.000Z",
    "title": "SHIB Chart Analysis: Signs Point to Upcoming Bullish Rally for Shiba Inu",
    "url": "https://www.crypto-news-flash.com/shib-chart-analysis-signs-point-to-upcoming-bullish-rally-for-shiba-inu/?utm_source=rss&utm_medium=rss&utm_campaign=shib-chart-analysis-signs-point-to-upcoming-bullish-rally-for-shiba-inu",
    "description": "The Shiba Inu (SHIB) token has gradually transitioned from a speculative-reliant meme coin to a utility-based altcoin. Following the notable adoption of SHIB, the Ethereum-based meme coin is expected to scale beyond the $100 billion market cap during this crypto bull cycle. Shiba Inu (SHIB), an Etheruem-based meme coin and the second largest dog-themed altcoin [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-29T20:00:07.000Z",
    "title": "Three Crypto AI Projects Announce Merger To Form ‘The Superintelligence Alliance’ With New Token in the Works",
    "url": "https://dailyhodl.com/2024/03/29/three-crypto-ai-projects-announce-merger-to-form-the-superintelligence-alliance-with-new-token-in-the-works/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/announce-merger-to-form.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/announce-merger-to-form.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/03/announce-merger-to-form.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/announce-merger-to-form.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/announce-merger-to-form.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/announce-merger-to-form.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/03/announce-merger-to-form.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Fetch.ai (FET), Singularitynet (AGIX) and Ocean Protocol (OCEAN) are merging to create the largest independent player in artificial intelligence (AI) research and development. In a statement, Fetch.ai says it is melding minds with the two other blockchain-based artificial intelligence (AI) platforms to form The Superintelligence Alliance. “The Superintelligence Alliance is a united stand against the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/29/three-crypto-ai-projects-announce-merger-to-form-the-superintelligence-alliance-with-new-token-in-the-works/\">Three Crypto AI Projects Announce Merger To Form ‘The Superintelligence Alliance’ With New Token in the Works</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-29T19:55:10.000Z",
    "title": "Crypto Analyst Says Altcoin Markets Are Ready To Pop, Lays Out a Path for Bitcoin",
    "url": "https://dailyhodl.com/2024/03/29/crypto-analyst-says-altcoin-markets-are-ready-to-pop-lays-out-a-path-for-bitcoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Popular-Trader-Spots-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Popular-Trader-Spots-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Popular-Trader-Spots-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Popular-Trader-Spots-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Popular-Trader-Spots-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Popular-Trader-Spots-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Popular-Trader-Spots-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader is analyzing the altcoin and crypto markets while plotting out Bitcoin&#8217;s (BTC) next move. Crypto analyst Michaël van de Poppe tells his 708,700 followers on the social media platform X that the altcoin markets, which include all tokens except for BTC and Ethereum (ETH), are prepping to reach for a new all-time [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/29/crypto-analyst-says-altcoin-markets-are-ready-to-pop-lays-out-a-path-for-bitcoin/\">Crypto Analyst Says Altcoin Markets Are Ready To Pop, Lays Out a Path for Bitcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]