[
  {
    "source": "Cointelegraph",
    "date": "2024-03-22T21:23:23.000Z",
    "title": " Crypto markets need ‘disinfectant,’ says SEC chair ",
    "url": "https://cointelegraph.com/news/gary-gensler-crypto-disinfectant",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNmQ4YjFiYTctNWRhYi00ZjlmLTkxMDYtZWI2NDc0ZDc4ZTZlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Gary Gensler implied many market participants preferred to “whittle away at the SEC’s disclosure regime” rather than register, despite criticism that the requirements were unclear.</p>\n                    <p><p>United States Securities and Exchange Commission (SEC) Chair <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/gary-gensler\">Gary Gensler</a> took aim at crypto industry participants, claiming some avoided registration requirements with the regulator.</p><p>In a prepared speech released on March 22 for Columbia Law School, Gensler <a href=\"https://www.sec.gov/news/speech/gensler-remarks-columbia-law-school-032224\" target=\"_blank\" rel=\"noopener nofollow\">used</a> his closing remarks to criticize crypto firms’ approach to regulatory oversight. The SEC chair spoke in favor of the benefits of mandatory disclosure for market participants, citing Supreme Court Justice Louis Brandeis, who said, “Sunlight is said to be the best of disinfectants.”</p><p>“[T]here still are those who would like to whittle away at the SEC’s disclosure regime,” said the SEC chair. “There are participants in crypto securities markets that seek to avoid these registration requirements. No registration means no mandatory disclosure. Many would agree that the crypto markets could use a little disinfectant.”</p><p><a href=\"https://cointelegraph.com/news/gary-gensler-crypto-disinfectant\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-22T21:21:02.000Z",
    "title": "Bitcoin traders anticipate price drop below $50,000, options data show",
    "url": "https://cryptobriefing.com/bitcoin-price-drop-50k-options/",
    "description": "Bitcoin put options signal bearish outlook, with strike prices around $50K, as Bitcoin drops 10% from ATH amid spot ETF outflows."
  }
]