[
  {
    "source": "Decrypt",
    "date": "2023-07-26T22:40:16.000Z",
    "title": "'Alchemy: Battle for Ankhos' RPG Mashes Up Discord, Generative AI, and Solana NFTs",
    "url": "https://decrypt.co/149871/alchemy-battle-ankhos-rpg-mashes-up-discord-generative-ai-solana-nfts",
    "description": "Shown at Solana's PlayGG event, Alchemy: Battle for Ankhos taps into AI and blockchain alike for a decidedly unique concoction."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-26T22:51:58.000Z",
    "title": "Meta Q2 earnings: Reality Labs losses top $7.7B year to date",
    "url": "https://cointelegraph.com/news/meta-second-quarter-earnings-reality-labs-metaverse-loss",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/c6bc0878-2017-4753-b719-0e305fe25f32.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Meanwhile, Meta's metaverse-building business has racked up around $21 billion in losses since the start of 2022.</p>\n                    <p><p>Meta's metaverse-related losses topped $3.74 billion over the second quarter with the Big Tech player spending $7.7 billion on its virtual reality business so far in 2023.</p><p>Its second-quarter <a href=\"https://s21.q4cdn.com/399680738/files/doc_financials/2023/q2/Meta-06-30-2023-Exhibit-99-1-FINAL.pdf\" target=\"_blank\" rel=\"noopener nofollow\">results</a> released on July 26 saw Meta report an 11% revenue gain compared to the previous year, totaling $31.9 billion. Its metaverse-focused Reality Labs revenue topped $276 million. </p><p>Reality Labs' operating losses are set to increase through 2023, Meta said. It cited product development efforts in virtual reality and further investments in to its metaverse as the reason for the losses extending.</p><p>In Q1 2023, Meta reported Reality Labs losses at $3.9 billion for the quarter while bringing in $339 million in revenue. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/llama-2-open-source-ai-model-launched-by-meta-microsoft\">Meta and Microsoft launch open-source AI model Llama 2</a></em></strong></p><p>Meta's stock price jumped on the earnings and is up over 7% in after hours trading to around $320 according to Google Finance <a href=\"https://www.google.com/finance/quote/META:NASDAQ\" target=\"_blank\" rel=\"noopener nofollow\">data</a>. Meta shares have gained nearly 140% year-to-date but are still off from their September 2021 all-time high of over $378.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/19a37c71-eddb-4256-aab4-83452b3a1724.png\"  /><figcaption style=\"text-align: center;\">Meta's stock price neared spiked to over $320 on</figcaption></figure><p><strong><em>Web3 Gamer: <a href=\"https://cointelegraph.com/magazine/web3-gamer-apple-gaming-sec-hates-metaverse-tokens-logan-paul-trolled-on-steam/\">Apple to fix gaming? SEC hates Metaverse, Logan Paul trolled on Steam</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-26T23:00:10.000Z",
    "title": "SEC charges Quantstamp for 2017 initial coin offering",
    "url": "https://cryptoslate.com/sec-charges-quantstamp-for-2017-initial-coin-offering/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) charged Quantstamp, a well-known blockchain security firm, with conducting an unregistered Initial Coin Offering (ICO) on July 21. The SEC said that, in October and November 2017, Quantstamp raised over $28 million by selling QSP tokens to about 5,000 investors, including those in the United States. In the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-charges-quantstamp-for-2017-initial-coin-offering/\">SEC charges Quantstamp for 2017 initial coin offering</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-26T22:40:00.000Z",
    "title": "Dogecoin ($DOGE) Price Could Skyrocket 23,000% if It Repeats Historic Pattern, Analyst Suggests",
    "url": "https://www.cryptoglobe.com/latest/2023/07/dogecoin-doge-price-could-skyrocket-23000-if-it-repeats-historic-pattern-analyst-suggests/",
    "description": "The meme-inspired cryptocurrency Dogecoin ($DOGE) has formed a chart pattern that suggests the price of the cryptocurrency may surge over 23,000%, akin to a rise it experienced last year when the same pattern was formed on its chart. The chart pattern was first spotted by popular cryptocurrency analyst Ali Martinez, who noted on social media […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T22:55:15.000Z",
    "title": "Bank of Italy’s Milano hub to propel institutional DeFi research",
    "url": "https://www.cryptopolitan.com/bank-of-italys-hub-institution-defi-research/",
    "description": "The Bank of Italy’s Milano Hub innovation center is set to provide vital support for an ambitious project developed by Cetif Advisory. The focus of this collaboration revolves around researching a secure token ecosystem for institutional decentralized finance (DeFi). Bank of Italy’s Milano hub to help in DeFi research At the core of this endeavor ... <a title=\"Bank of Italy’s Milano hub to propel institutional DeFi research\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bank-of-italys-hub-institution-defi-research/\" aria-label=\"More on Bank of Italy’s Milano hub to propel institutional DeFi research\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-26T23:00:43.000Z",
    "title": "Bitcoin Pre-Halving Patterns Suggest Bull Market Is Not Starting In 2023",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bull-market-not-starting-in-2023/",
    "description": "The Bitcoin halving is arguably the most important event for the blockchain due to its function. As such, it has played a significant role in when the crypto bull market starts and how long it lasts in most cases. Although there have been slight deviations in how it triggers each bull market, pre-halving data over the years suggests that it keeps to quite a tight schedule. Bitcoin Maintaining Historical Trend While most of the year has seen Bitcoin deviate from many historical trends, leading to speculation that the next bull market won’t follow the established trend, the digital asset’s current pattern suggests that these widespread speculations may be wrong. Related Reading: Crypto Analyst Says It’s Time To Buy Dogecoin, Here’s Why In a chart shared on Twitter, pseudonymous crypto analyst @stockmoneyL has presented the argument that Bitcoin could indeed follow the previous bull market trends. The chart shows the number of days between the bottom of the bear market and the next halving event has always maintained a reasonably tight timeline. Going by the chart, if Bitcoin follows this same timeline, then the bull market will actually begin in 2024. With 532 days between the 2022 bottom and the next halving, it fits in with the average 530 days seen between cycles, after which bull markets have often begun. Timeline between BTC bottom and halving event match up &#124; Source: Twitter If this plays out in this instance as well, it would invalidate the expectations of a bull market starting in 2023. It then puts the start of the bull market toward the middle of 2024, similar to other bull markets that have begun following the halving event. Where Does BTC Land In The Bull Market? Over the last couple of bull markets, the price of Bitcoin has always surpassed its previous all-time high by a significant margin. For example, during the 2017-2018 bull market, the price of the digital asset clocked an all-time high price of $19,000. And even though it was significant at the time, it was nothing compared to the next ATH. BTC bulls push toward $29,500 &#124; Source: BTCUSD on Tradingview.com In 2021, at the height of the last bull market, the price of BTC reached as high as $69,000, more than triple its previous all-time high. This trend has always endured through all bull markets and if there is a repeat, then it is possible that the price of BTC will reach $150,000 in the next bull. Related Reading: Ethereum Whale Transfers To Exchanges Suggest More Selling Pressure For ETH Now, the exact time frame for this has varied depending on who the forecast was coming from. However, looking at Bitcoin’s previous all-time high peaks, they happen around a year after the halving and start of the bull market. So in this case, it would put the new ATH for the digital asset in 2025. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]