[
  {
    "source": "Decrypt",
    "date": "2024-02-02T02:01:02.000Z",
    "title": "Grand Jury Indicts Hackers Linked to $400 Million Stolen from FTX",
    "url": "https://decrypt.co/215367/grand-jury-indicts-hackers-linked-to-400-million-stolen-from-ftx",
    "description": "Three Americans have been charged with orchestrating the massive attack on the failed cryptocurrency exchange."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-02T02:00:37.000Z",
    "title": "Binance froze $4.2 million of XRP stolen in attack on Ripple co-founder",
    "url": "https://cryptoslate.com/binance-froze-4-2-million-of-xrp-stolen-in-attack-on-ripple-co-founder/",
    "description": "<p>Binance announced on Feb. 1 that it has frozen $4.2 million of XRP that was stolen from a Ripple executive one day earlier. Binance CEO Richard Teng said: &#8220;After finding out early on about the exploit &#8230; we’re happy to say that the Binance team has managed to freeze $4.2 Million worth of XRP stolen [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/binance-froze-4-2-million-of-xrp-stolen-in-attack-on-ripple-co-founder/\">Binance froze $4.2 million of XRP stolen in attack on Ripple co-founder</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-02T02:00:37.000Z",
    "title": "Bitcoin Buzz: Accumulation Trend Peaks At A 3-Year High – What’s Driving The Surge?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-buzz-accumulation-trend-peaks-at-a-3-year-high-whats-driving-the-surge/",
    "description": "According to data shared by renowned crypto analyst Ali, Bitcoin has recently witnessed a significant development in its investment dynamics, marking a notable shift in the crypto market. In a post on X published earlier today, Ali disclosed that Bitcoin is experiencing a substantial accumulation streak, which has not been seen in nearly three years. According to the analyst, this surge in the Accumulation Trend Score indicates the growing confidence among larger entities in the cryptocurrency market. Ali&#8217;s shared data further reveals that the Accumulation Trend Score for Bitcoin has consistently hovered near the peak level of 1 over the past four months. This sustained high score signals an active and ongoing accumulation by big investors. #Bitcoin is witnessing one of its most significant accumulation streaks in almost 3 years! Notably, the Accumulation Trend Score has hovered near 1 for the past 4 months, signaling that larger entities are accumulating $BTC. This trend indicates strong confidence in the market! pic.twitter.com/QcJOEhzBUb — Ali (@ali_charts) February 1, 2024 A Surge In Large-Scale BTC Holdings Further complimenting this near 3-year accumulation trend streak, Ali&#8217;s recent data revealed that the Bitcoin market has welcomed approximately 67 new &#8220;whales.&#8221; These entities, each holding over 1,000 BTC, represent a 4.50% increase in this category of investors within two weeks. This increase in whale activity coincided with a period where Bitcoin experienced a notable dip, falling below the critical $39,000 threshold. Ali noted: &#8220;While some shivered with fear during the recent price correction, Bitcoin whales were accumulating more BTC.&#8221; While some shivered with fear during the recent price correction, #Bitcoin whales were accumulating more $BTC! Around 67 new entities now hold 1,000 #BTC or more, marking a 4.50% increase in two weeks. pic.twitter.com/tje3fhznRR — Ali (@ali_charts) January 30, 2024 This downturn was primarily attributed to a significant outflow from Grayscale, amounting to over $5 billion since the Bitcoin Spot ETF was approved by the US Securities and Exchange Commission (SEC). As of January 29, 2024, the number of Bitcoins held by Grayscale was 496,573.8166. Additionally, GBTC’s AUM is approximately $21.431 billion. After the spot ETF passed, Grayscale users sold a total of 120,500 BTC, which is equivalent to approximately $5.508 billion.… — Wu Blockchain (@WuBlockchain) January 30, 2024 However, as this outflow has cooled off, Bitcoin has shown signs of recovery, trading above the $42,500 mark and registering a 6.1% increase in the past week. Bitcoin Poised For 40% Surge? Shifting the focus to the broader financial landscape, Arthur Hayes, founder of BitMEX, has offered an analysis of current economic conditions and their potential impact on Bitcoin. His commentary is particularly relevant in light of recent challenges faced by New York Community Bancorp (NYCB) and the banking sector. The bank’s significant stock decline, driven by unexpected losses and a substantial increase in loan loss reserves, has raised concerns about the stability and exposure of US regional banks, especially in the real estate sector. Hayes’s remarks point to a possible near-future scenario where the Federal Reserve might have to intervene by reinstating the Bank Term Funding Program (BTFP) or similar measures to stabilize the banking sector. Related Reading: Bitcoin Set For Weekend Rally Amid New Banking Crisis: Arthur Hayes He parallels the current situation and the March 2023 banking crisis, suggesting that similar market turbulence could lead to a brief dip in Bitcoin’s value, followed by a significant rally. Hayes postulates that such developments could see Bitcoin, often regarded as a digital gold or safe-haven asset, experience a surge in value similar to the 40% increase witnessed during the previous banking crisis. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-02T01:49:00.000Z",
    "title": "Shiba Inu Witnesses Massive Burn of Nearly 10 Billion Tokens in January",
    "url": "https://coinedition.com/shiba-inu-witnesses-massive-burn-of-nearly-10-billion-tokens-in-january/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shiba Inu Witnesses Massive Burn of Nearly 10 Billion Tokens in January\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Shibburn-Launches-Shib-Association-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>January 2024 brought a significant milestone for Shiba Inu as the popular cryptocurrency witnessed 9.9 billion SHIB tokens being permanently removed from its circulating supply. This remarkable achievement in token burning was unveiled by the Shiba Inu burn analytics platform, Shibburn, which has released fresh data highlighting the extent of this event. According to the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/shiba-inu-witnesses-massive-burn-of-nearly-10-billion-tokens-in-january/\">Shiba Inu Witnesses Massive Burn of Nearly 10 Billion Tokens in January</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]