[
  {
    "source": "Decrypt",
    "date": "2023-12-14T07:01:02.000Z",
    "title": "Axie Infinity NFTs Can Soon Evolve Like Pokémon—Here's How",
    "url": "https://decrypt.co/209166/axie-infinity-nfts-can-soon-evolve-like-pokemon-heres-how",
    "description": "Exclusive: You can finally power-up your Axies and give them a new look with upgraded parts, but it'll take money, materials, and time."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T06:45:36.000Z",
    "title": "Central banks are plotting a crypto invasion",
    "url": "https://www.cryptopolitan.com/central-banks-are-plotting-a-crypto-invasion/",
    "description": "In a move that&#8217;s stirring up the financial world like a tornado in a teapot, central banks across the globe are gearing up for what can only be described as a crypto invasion. From January 1, 2025, they are set to hold up to 2% of their reserves in cryptocurrencies, as per the groundbreaking directive [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T06:44:00.000Z",
    "title": "Is Gender Equality an Afterthought in the AI Industry’s Evolution?",
    "url": "https://www.cryptopolitan.com/gender-equality-an-afterthought-ai-industry/",
    "description": "In a recent expose by The New York Times, the underrepresentation of women in the modern artificial intelligence movement comes into sharp focus, raising critical questions about the impending risk of the AI industry evolving into yet another boys&#8217; club. This revelation follows closely on the heels of a shocking incident where a fake auto-generated [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-14T06:56:32.000Z",
    "title": "SkyBridge Founder Anthony Scaramucci Critiques Jamie Dimon; Binance (BNB), Avalanche Crypto (AVAX) and Pullix (PLX) – Altcoin Stars To Shine",
    "url": "https://nulltx.com/skybridge-founder-anthony-scaramucci-critiques-jamie-dimon-binance-bnb-avalanche-crypto-avax-and-pullix-plx-altcoin-stars-to-shine/",
    "description": "Recently, SkyBridge founder Anthony Scaramucci criticized Jamie Dimon, CEO of JPMorgan. In his statements, he took a stance in favor of the crypto market, opposing Dimon&#8217;s skeptical views on digital currencies. Meanwhile, altcoins like Binance (BNB) and Avalanche Crypto (AVAX) ride bullish waves. One new ICO is also making headlines [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-14T06:52:00.000Z",
    "title": "Undervalued Monero (XMR) And Dogecoin (DOGE) The Next To Pump, Traders Flock To Buy Everlodge (ELDG)",
    "url": "https://nulltx.com/undervalued-monero-xmr-and-dogecoin-doge-the-next-to-pump-traders-flock-to-buy-everlodge-eldg/",
    "description": "If you are looking for options to make investments in cryptocurrencies, Everlodge can be a great choice. Its ongoing presale is making fortunes for its early investors. So, you must not miss this opportunity to multiply your investment. On the contrary, big projects like Monero (XMR) and Dogecoin (DOGE) are [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-14T06:54:50.000Z",
    "title": "SEC postpones deadline for decision on Invesco Galaxy spot Ethereum ETF",
    "url": "https://crypto.news/sec-postpones-deadline-for-decision-on-invesco-galaxy-spot-ethereum-etf/",
    "description": "The U.S. Securities and Exchange Commission (SEC) has delayed its review of Invesco Galaxy&#8217;s Ethereum (ETH) spot ETF. Setting a new deadline of Feb. 6, the SEC has pushed back the applications of a spot ETH ETF that would allow&#8230;"
  }
]