[
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T04:00:27.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $24.67 with a 24-hour trading volume of $618,897,839. Solana is up 1.63% in the last 24 hours. The current CoinMarketCap ranking is #9, with a live market cap of $7,273,881,101. It has a circulating supply of 394,890,490 SOL coins and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-31T04:07:53.000Z",
    "title": "Ethereum Price Recovery Could Soon Fade If ETH Fails To Surpass $1,900",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-recovery-fade-1900-2/",
    "description": "Ethereum price is struggling to clear the $1,880 zone against the US Dollar. ETH could start a fresh decline if it stays below $1,880 and $1,900. Ethereum is facing major resistance near $1,880 and $1,900. The price is trading below $1,875 and the 100-hourly Simple Moving Average. Earlier, there was a break below a key bullish trend line with support near $1,870 on the hourly chart of ETH/USD (data feed via Kraken). The pair is now struggling to rise above the same trend line and $1,880. Ethereum Price Faces Key Resistance Ethereum’s price failed to clear the $1,885 resistance and started a fresh decline. ETH declined below the $1,875 and $1,870 levels within a range, similar to Bitcoin. Besides, there was a break below a key bullish trend line with support near $1,870 on the hourly chart of ETH/USD. The pair tested the $1,850 support and recently started a fresh increase. There was a move above the $1,865 level. The bulls pushed the price above the 50% Fib retracement level of the downward move from the $1,885 swing high to the $1,850 low. Ether is now struggling to rise above the same trend line and $1,880. It is trading below $1,875 and the 100-hourly Simple Moving Average. On the upside, immediate resistance is near the $1,875 level and the 100 hourly SMA. It is close to the 61.8% Fib retracement level of the downward move from the $1,885 swing high to the $1,850 low. Source: ETHUSD on TradingView.com The first major resistance is near the $1,885 level. The next key resistance is near the $1,900 level, above which the price might rise toward the $1,950 zone. Any more gains might send the price toward the $2,000 hurdle. Fresh Decline in ETH? If Ethereum fails to clear the $1,875 resistance, it could start another decline. Initial support on the downside is near the $1,860 level. The first major support is near the $1,850 zone, below which the price might test the $1,820 support zone. The next major support is near the $1,780 support level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,850 Major Resistance Level – $1,885"
  }
]