[
  {
    "source": "Cointelegraph",
    "date": "2024-02-08T04:25:14.000Z",
    "title": " ARK 21Shares refiles spot Ethereum ETF with cash creates, adds staking ",
    "url": "https://cointelegraph.com/news/ark-21shares-refiles-ethereum-etf-cash-creates-staking",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYzcwNzExMGItYWIzZS00OGNiLThhYmUtZTE5YmY4Mjk4MzY2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The proposed changes would bring ARK 21Shares’ spot Ether ETF application more in line with its recently approved spot Bitcoin ETF. </p>\n                    <p><p>ARK 21Shares has amended its spot Ethereum exchange-traded fund application to adopt a cash-creation model — <a href=\"https://cointelegraph.com/news/sec-spot-bitcoin-etf-approvals\">similar</a> to its approved spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ETF — and has also floated plans to stake a portion of the ETF’s Ether <a href=\"https://cointelegraph.com/ethereum-price\">(ETH)</a> to generate additional income. </p><p>In December, ARK 21Shares and BlackRock were among the first issuers to convert their spot Bitcoin ETFs to a <a href=\"https://cointelegraph.com/news/ark-blackrock-bitcoin-etf-sec-cash-create\">cash creation and redemption model</a> following back-and-forth meetings with the United States securities regulator.</p><p>ARK 21Shares initially proposed an in-kind redemption model for its Ether ETF too, which implies non-monetary payments such as BTC.</p><p><a href=\"https://cointelegraph.com/news/ark-21shares-refiles-ethereum-etf-cash-creates-staking\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T04:21:09.000Z",
    "title": "Talk of Ethereum ETF As Bitbot Crypto Presale Raises $426k",
    "url": "https://www.cryptopolitan.com/talk-of-ethereum-etf-as-bitbot-crypto-presale-raises-426k/",
    "description": "While Bitcoin ETFs were one of the hottest crypto topics during 2023, Ethereum ETFs could be 2024’s next catalyst. Top altcoin Ethereum’s ETFs are seen as next up, potentially opening the floodgates for billions of dollars to flood the crypto market. Amid this bullish atmosphere, Bitbot stands out as a project that could ride this [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-08T04:35:08.000Z",
    "title": "Ethereum Price Jumps To $2,450 as Bulls Take Over Crypto Market",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-jumps-to-2450/",
    "description": "Ethereum price gained traction and climbed above $2,400. ETH is now showing bullish signs and might extend gains toward the $2,550 level. Ethereum is gaining bullish momentum above the $2,380 zone. The price is trading above $2,350 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2,400 on the hourly chart of ETH/USD (data feed via Kraken). The pair might correct lower, but the bulls could be active near the $2,400 support zone. Ethereum Price Gains Strength Ethereum price remained strong above the $2,250 level. ETH started another increase like Bitcoin and was able to clear a few key hurdles near the $2,350 zone. The price jumped above the $2,400 level and tested the $2,450 resistance. A high is formed near $2,449 and the price is now consolidating gains. It is trading above the 23.6% Fib retracement level of the recent surge from the $2,353 swing low to the $2,449 high. Ethereum is also trading above $2,350 and the 100-hourly Simple Moving Average. Besides, there is a key bullish trend line forming with support at $2,400 on the hourly chart of ETH/USD. The trend line is close to the 50% Fib retracement level of the recent surge from the $2,353 swing low to the $2,449 high. On the upside, the first major resistance is near the $2,450 level. The next major resistance is near $2,500, above which the price might rise and test the $2,550 resistance. Source: ETHUSD on TradingView.com If the bulls remain in action, they could even pump the price above the $2,620 resistance. In the stated case, the price could rise toward the $2,700 level. Are Dips Limited In ETH? If Ethereum fails to clear the $2,450 resistance, it could start a downside correction. Initial support on the downside is near the $2,425 level. The next key support could be the $2,400 zone or the trend line. A clear move below the $2,400 support might send the price toward $2,375. The main support could be $2,350. Any more losses might send the price toward the $2,240 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $2,375 Major Resistance Level – $2,450"
  }
]