[
  {
    "source": "CryptoSlate",
    "date": "2023-08-02T05:00:44.000Z",
    "title": "Exclusive: Non-profit Glo launches stablecoin leveraging yields to alleviate extreme poverty",
    "url": "https://cryptoslate.com/exclusive-non-profit-glo-launches-stablecoin-leveraging-yields-to-alleviate-extreme-poverty/",
    "description": "<p>Nonprofit organization Glo has announced the Aug. 2 launch of Glo Dollar, a regulated stablecoin with an ambitious goal: leveraging cryptocurrency yields to lift millions out of extreme poverty. CryptoSlate spoke with Jasper Driessens, Co-Founder of Glo, about the project&#8217;s goals and how it leverages traditional finance to fund a non-profit stablecoin. Leveraging Treasury yields to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/exclusive-non-profit-glo-launches-stablecoin-leveraging-yields-to-alleviate-extreme-poverty/\">Exclusive: Non-profit Glo launches stablecoin leveraging yields to alleviate extreme poverty</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-02T04:49:00.000Z",
    "title": "Decentralized Exchange PancakeSwap to Reward $CAKE Stakers with Millions in Trading Fee Revenue",
    "url": "https://www.cryptoglobe.com/latest/2023/08/decentralized-exchange-pancakeswap-to-reward-cake-stakers-with-millions-in-trading-fee-revenue/",
    "description": "In an ambitious move to incentivize its stakers popular decentralized exchange (DEX) PancakeSwap ($CAKE) is set to disburse a share of its trading fee revenue amounting to millions of dollars to CAKE token stakers. According to a recent announcement from the exchange the initiative, dubbed the Revenue Sharing Pool (RSP), will distribute a weekly 5% […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-02T05:00:00.000Z",
    "title": "GameStop Ends Crypto Wallet Support Amid Regulatory Uncertainty",
    "url": "https://cryptodaily.co.uk/2023/08/gamestop-ends-crypto-wallet-support-amid-regulatory-uncertainty",
    "description": "<p class=\"md-end-block md-p\">GameStop Corp, the American video game, consumer electronics, and gaming merchandise retailer, is set to discontinue its digital wallets owing to the \"regulatory uncertainty of the crypto space,\" the company announced in a notice posted on its website.</p>\n<p class=\"md-end-block md-p\">Starting November 1, GameStop will withdraw its iOS and Chrome Extension wallets, designed to manage cryptocurrencies and nonfungible tokens (NFTs). As part of this move, the firm has advisred users to ensure they have access to their secret passphrases by October 1.</p>\n<p class=\"md-end-block md-p md-focus\">Launched in May 2022, these digital wallets were a part of GameStop's foray into the realm of cryptocurrencies and NFTs. A notable shift from its traditional business model, GameStop, which is well known for its brick-and-mortar stores that offer trade-ins of used consoles and games, has been striving to tap into digital asset-based growth opportunities. </p>\n<p class=\"md-end-block md-p\">GameStop previously partnered with blockchain startup Immutable X earlier in 2022 to work on the NFT marketplace, leveraging Immutable X's Ethereum-based layer-2 protocol, which promised a carbon-neutral environment, high transaction rates, and the elimination of gas fees, thus enabling affordable, faster, and nearly limitless transactions. This joint venture also led to the creation of a $100 million fund, designed to empower game developers and studios to build on the new NFT marketplace. The initiative allowed developers to engage in seamless trading and minting of NFTs, with the added assurance of securre transactions.</p>\n<p class=\"md-end-block md-p\">The retailer's entry into the crypto world followed the company's unexpected surge into the media spotlight in January 2021, when retail investors on Reddit triggered a short squeeze, causing significant losses for hedge fund managers. The incident has since prompted GameStop to launch its NFT marketplace and explore Web3 applications to bolster growth.</p>\n<p class=\"md-end-block md-p\">The specifics of the \"regulatory uncertainty\" cited by GameStop remain unclear. Being headquartered in the United States, the firm operates in a jurisdiction where lawmakers and regulators have diverse views on crypto and blockchain. Notably, the U.S. Securities and Exchange Commission (SEC) has recently ramped up its legal actions against crypto firms, resulting in several ongoing lawsuits between blockchain companies and their executives. </p>\n<p class=\"md-end-block md-p\">GameStop's decision to pull its digital wallets from the market comes amid these increasingly complex regulatory challenges, emphasizing the influence of regulatory landscapes on businesses operating within the crypto space.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  }
]