[
  {
    "source": "CoinDesk",
    "date": "2023-08-23T19:53:04.000Z",
    "title": "The Protocol: Coinbase Blockchain's Viral Use Case Puts Focus on Optimism's Tech",
    "url": "https://www.coindesk.com/tech/2023/08/23/the-protocol-coinbase-blockchains-viral-use-case-puts-focus-on-optimisms-tech/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The week in blockchain tech: Crypto-fueled social marketplace Friend.tech goes viral on Coinbase's new Base blockchain, Shiba Inu community's \"Shibarium\" network aims for fresh start, and Ethereum experts handicap the competition between leading technologies for layer-2 networks."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-23T19:51:14.000Z",
    "title": "The Next AI Medical Marvel: Early Detection of Parkinson’s Disease",
    "url": "https://decrypt.co/153513/parkinsons-disease-pre-screening-early-detection-with-ai",
    "description": "An AI analysis of data from over 150,000 patients found common characteristics that could give patients several years more advance notice of disease onset."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-23T19:42:31.000Z",
    "title": "Selena Gomez Reacts to Cloned Voice in ‘Starboy’ AI Remix",
    "url": "https://decrypt.co/153507/selena-gomez-reacts-to-cloned-voice-in-starboy-ai-remix",
    "description": "The singer called the AI-generated version of The Weeknd’s hit “scary.”"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-23T19:41:31.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Shopify merchants will soon be able to accept USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) payments through Solana Pay. The FBI has identified six Bitcoin wallets linked to North Korean hacker group, Lazarus, and has warned crypto firms to be vigilant. Meanwhile Binance.US tapped MoonPay to restore some U.S. dollar ramps for users after being crypto-only for the past two months.</p><h3>Shopify merchants will soon be able to accept USDC payments: Report</h3><p>E-commerce juggernaut Shopify will soon enable its merchants to accept USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) payments through Solana, potentially opening the door to wider stablecoin adoption. </p><p>On Aug. 23, it was reported that Shopify will <a href=\"https://cointelegraph.com/news/shopify-to-accept-usdc-payments-with-solana-report\">provide the USDC payment option</a> through Solana Pay, a peer-to-peer payment platform that gives merchants he ability to accept crypto transactions. </p><p>According to Josh Fried of Solana Labs, the intersection of digital assets and payments represents the next “killer app for crypto.” Fried said Solana Pay can signficantly reduce transaction costs compared with credit card processing. The Solana network currently charges an average of $0.00025 per transaction. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/65dfe31d-69dd-4dac-8e87-47eff1f11e21.jpg\"  /><figcaption style=\"text-align: center;\"><em>Average Solana fees. Source: Solana</em></figcaption></figure><p>Shopify says that roughly 10% of all e-commerce transactions in the United States are facilitated through its platform. In dollar terms, that amounts to $444 billion. The company has been expanding its reach into Web3, having recently launched <a href=\"https://cointelegraph.com/news/shopify-launches-suite-of-blockchain-commerce-tools-for-merchants\">a suite of blockchain commerce tools</a>.</p><h3>FBI flags 6 Bitcoin wallets linked to North Korea, urges vigilance in crypto firms</h3><p>The United States Federal Bureau of Investigation (FBI) has flagged six Bitcoin wallets linked to North Korean state-backed hacking group Lazarus. The six wallets contain 1,580 BTC worth $40 million believed to be hoarded from various cryptocurrency hacks over the past year.</p><p>The FBI in its investigation found that Lazarus Group moved approximately 1,580 BTC linked with several crypto exploits. These funds are currently sitting in the following Bitcoin addresses:</p><p>3LU8wRu4ZnXP4UM8Yo6kkTiGHM9BubgyiG</p><p>39idqitN9tYNmq3wYanwg3MitFB5TZCjWu</p><p>3AAUBbKJorvNhEUFhKnep9YTwmZECxE4Nk</p><p>3PjNaSeP8GzLjGeu51JR19Q2Lu8W2Te9oc</p><p>3NbdrezMzAVVfXv5MTQJn4hWqKhYCTCJoB</p><p>34VXKa5upLWVYMXmgid6bFM4BaQXHxSUoL</p><p>The FBI warned crypto companies that the movement of funds linked to the infamous North Korean hacking group could be a sign that they are looking to sell. The federal investigation agency advised crypto companies to keep an eye out for the six BTC wallets and use blockchain data to keep track of any movement of funds.</p><blockquote>“Private sector entities should examine the blockchain data associated with these addresses and be vigilant in guarding against transactions directly with, or derived from, the addresses.”</blockquote><p>The North Korean hacking group has been actively involved in multiple crypto-linked exploits over the years, stealing billions of dollars worth of crypto assets. A recent report from TRM Labs suggests that the North Korean hackers have stolen nearly $2 billion in crypto since 2018. The group was most active in 2022, having stolen nearly $1 billion worth of crypto assets last year alone.</p><p>2022 saw some of the biggest decentralized finance (DeFi) exploits, and Lazarus Group was identified as the mastermind behind Harmony’s Horizon bridge and Sky Mavis’ $625-million hack on Ethereum-linked sidechain Ronin Bridge last year.</p><p>Although crypto-linked exploits due to code vulnerabilities in platforms and protocols have increased due to the sophistication in methods used by these hackers, blockchain technology still makes it problematic for exploiters to launder or move their ill-gotten gains due to the public ledger that makes it possible to track the movement of funds.</p><p>Law enforcement agencies like the FBI, along with crypto companies, have worked together on several occasions in the past to freeze funds linked to such exploits. Earlier in February this year, Huobi and Binance froze $1.4 million worth of crypto assets linked to North Korea. Similarly, $63 million worth of assets linked to the Harmony Bridge hack was also frozen by crypto exchanges.</p><h3>Binance.US taps MoonPay in bid to restore USD ramps</h3><p>Crypto exchange Binance.US <a href=\"https://cointelegraph.com/news/binance-usd-deposits-withdrawals-moonpay-usdt\">announced a partnership</a> with crypto payments firm MoonPay on Aug. 22 allowing users to buy the stablecoin Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) with U.S. dollars. </p><p>It's been around two months since Binance.US became a crypto-only platform due to its banking partner relationships breaking down — which saw fiat deposits on the exchange halted as of June 9. </p><p>The exchange blamed <a href=\"https://cointelegraph.com/news/binance-us-suspends-usd-deposits-warns-withdrawal-pause-incoming\">the Securities and Exchange C</a><a href=\"https://cointelegraph.com/news/binance-us-suspends-usd-deposits-warns-withdrawal-pause-incoming\">ommission's</a> “aggressive and intimidating” tactics — which <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">sued the exchange and its affiliates</a> four days prior — as the reason for the disruption.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, we&#39;re excited to introduce a new <a href=\"https://twitter.com/search?q=%24USD&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USD</a> on-ramp!<br><br>✔️ Buy <a href=\"https://twitter.com/search?q=%24USDT&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDT</a> on <a href=\"https://t.co/AZwoBOgsqS\">https://t.co/AZwoBOgsqS</a> through payment partners like <a href=\"https://twitter.com/moonpay?ref_src=twsrc%5Etfw\">@moonpay</a>, which supports debit &amp; credit card, Apple Pay, and Google Pay.<br><br>✔️ Sell USDT for USD to withdraw via bank transfer.<br><br>Learn more &amp; get started ⤵️</p>&mdash; Binance.US  (@BinanceUS) <a href=\"https://twitter.com/BinanceUS/status/1694040010482135262?ref_src=twsrc%5Etfw\">August 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>USDT will be the new “base asset” for all exchange transactions and the MoonPay partnership allows a path for users to deposit and withdraw with Binance.US using dollars.</p><p>Direct bank deposits remain disabled but MoonPay offers Binance.US ramps that support debit and credit cards along with Apple and Google Pay.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T20:06:13.000Z",
    "title": "North Korean-linked Bitcoin wallets contain $40 million from recent hacks, FBI warns",
    "url": "https://www.cryptopolitan.com/north-korean-linked-bitcoin-wallets-40-million-from-recent-hacks-fbi-warns/",
    "description": "The FBI has identified six Bitcoin wallets believed to be connected to North Korean hacking groups Lazarus Group and APT38. These wallets are suspected to hold more than $40 million in stolen cryptocurrency. The funds are thought to have been taken from a series of high-profile hacks, including a $60 million theft from payment processor ... <a title=\"North Korean-linked Bitcoin wallets contain $40 million from recent hacks, FBI warns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/north-korean-linked-bitcoin-wallets-40-million-from-recent-hacks-fbi-warns/\" aria-label=\"More on North Korean-linked Bitcoin wallets contain $40 million from recent hacks, FBI warns\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T20:05:00.000Z",
    "title": "Unstoppable introduces instant messaging for crypto holders",
    "url": "https://www.cryptopolitan.com/unstoppable-instant-messaging-crypto-holders/",
    "description": "Gone are the days when crypto was simply about trading, buying, or storing digital coins. The crypto world is evolving, and companies like Unstoppable Domains are leading the way. The latest introduction from the firm? An encrypted messaging system tailored for crypto users with Web3 usernames, bridging a gap that many hadn&#8217;t even realized existed. ... <a title=\"Unstoppable introduces instant messaging for crypto holders\" class=\"read-more\" href=\"https://www.cryptopolitan.com/unstoppable-instant-messaging-crypto-holders/\" aria-label=\"More on Unstoppable introduces instant messaging for crypto holders\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T19:59:07.000Z",
    "title": "Former Alameda engineer shares unique inside look at SBF",
    "url": "https://www.cryptopolitan.com/former-alameda-engineer-inside-look-at-sbf/",
    "description": "You know, just when you think you&#8217;ve heard it all, a new revelation emerges to turn things upside down. The world of cryptocurrency, a sphere often colored by big promises and even bigger egos, is in the bad kind of spotlight, thanks to the criminal Samuel Bankman-Fried. And not just for his failed company or ... <a title=\"Former Alameda engineer shares unique inside look at SBF\" class=\"read-more\" href=\"https://www.cryptopolitan.com/former-alameda-engineer-inside-look-at-sbf/\" aria-label=\"More on Former Alameda engineer shares unique inside look at SBF\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T19:57:38.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? Today&#8217;s Aave price is $57.15, with a 24-hour trading volume of $68,510,844. Aave is up 5.50% in the last 24 hours. The current CoinMarketCap ranking is #44, with a live market cap of $830,045,416. It has a circulating supply of 14,523,214 AAVE coins and a ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-23T20:06:24.000Z",
    "title": "China sentences former party official to life in prison for enabling crypto mining",
    "url": "https://crypto.news/china-sentences-former-party-official-to-life-in-prison-for-enabling-crypto-mining/",
    "description": "The Hangzhou Intermediate People’s Court has found a former Chinese party official known as Xiao Yi guilty of abuse of power and bribery"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-23T20:00:23.000Z",
    "title": "Ripple CEO bolsters legal team ahead of jury trial against SEC",
    "url": "https://crypto.news/ripple-ceo-bolsters-legal-team-ahead-of-jury-trial-against-sec/",
    "description": "Amid the ongoing legal battle between SEC and Ripple, CEO Brad Garlinghouse is strengthening his legal defense"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-23T19:51:02.000Z",
    "title": "Australia’s central bank releases report highlighting CBDC use cases",
    "url": "https://crypto.news/australias-central-bank-releases-report-highlighting-cbdc-use-cases/",
    "description": "The Australian Central Bank and the Digital Finance Cooperative Research Centre have released a report on the use cases for CBDCs in the country"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-23T19:42:43.000Z",
    "title": "Binance accused of violating sanctions placed on Russia",
    "url": "https://crypto.news/binance-accused-of-violating-sanctions-placed-on-russia/",
    "description": "Binance, the largest crypto exchange by trading volumes, is accused of engaging with sanctioned companies in Russia despite pulling out of the country in H1 2023"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T20:00:19.000Z",
    "title": "Why This Solana Pay Integration Could Onboard Millions Into Crypto",
    "url": "https://www.newsbtc.com/news/solana/why-this-solana-pay-integration-could-onboard-millions-into-crypto/",
    "description": "A recent report from Techcrunch noted the integration between Solana and Shopify. One of the largest marketplaces in the world, the cooperation will enable millions of businesses and customers to use digital assets for their purchases. Related Reading: Solana In Turbulence: Analyzing The Death Cross And What Lies Ahead Solana Enters The Mainstream With Shopify Cooperation? Speaking with the media outlet, Josh Fried from the Solana Foundation highlighted that the Pay supported by stablecoin USDC is the first to integrate with the marketplace. This digital asset was chosen due to its low volatility and familiarity with the US dollar. However, in the future, other cryptocurrencies could become a part of the integration, including the native currency of the Solana ecosystem SOL. As Techcrunch noted, Shopify is one of the prominent marketplaces with $444 billion worth of global economic activity or 10% of the total US e-commerce. Thus, the Solana ecosystem will have the capacity to reach millions of users looking for alternative payment options when shopping online. Fried stated the following regarding the new integration: Some people argue the killer app for crypto hasn’t arrived, but it has: it’s payments. (Everyone) should be doubling down on this. The Solana Foundation member also highlighted the benefits for merchants who decided to adopt the new features on Shopify. Legacy payment rails cost merchants between 1.5% to 3.5% per transaction, compared to SOL’s $0.00025, which is “practically fee-free.” In addition to these benefits, Fried believes the new integration can help businesses launch loyalty programs and other services by leveraging SOL’s ecosystem. The report clarified that crypto bands, including Mad Labs, Helius, MonkeDAO, and others, have already adopted the integration. Fried called Solana Pay the ideal feature for payments for the reasons stated above and added: You need speed at the point of sale for merchant payments. No one wants to sit on a website to wait for wallet transactions. Similarly in a point of sale in a store, can you imagine waiting three minutes for your payment to go through? No one wants to do that. Shopify, eBay, and even e-commerce giant Amazon are warming up to crypto in some capacity. Shopify and its CEO, Tobias Lütke, have been taking steps to integrate with the nascent industry. In January, Lütke joined crypto exchange Coinbase and its board of directors. Related Reading: Solana Cuts Saga Price By 40%, But Case For New SOL Yearly High Increases As of this writing, SOL’s price trades at $21 after experiencing some profits during today’s trading session. The cryptocurrency recorded a 3% increase during this period. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-23T19:51:00.000Z",
    "title": "Can Ripple (XRP) Explode Beyond $127 in the Next Bull Run?",
    "url": "https://coinedition.com/can-ripple-xrp-explode-beyond-127-in-the-next-bull-run/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/XRP-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/XRP-4.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/XRP-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/XRP-4-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/XRP-4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/XRP-4-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/XRP-4-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/XRP-4-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/XRP-4-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/XRP-4-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/XRP-4-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/XRP-4-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/XRP-4-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/XRP-4-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/XRP-4-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/XRP-4-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/XRP-4-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Ripple (XRP) community may have been disappointed by the token’s performance in recent times. But according to crypto educator Toray Kortan, those who stick to holding XRP may reap the fruit of their trust in the token in the next bull run. Kortay, who is also the founder of Innovation Markets posted on Twitter [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/can-ripple-xrp-explode-beyond-127-in-the-next-bull-run/\">Can Ripple (XRP) Explode Beyond $127 in the Next Bull Run?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-23T20:00:21.000Z",
    "title": "Glassnode Founders Predict Bitcoin Will ‘Soar’ to New Highs Sooner Than Expected – Here’s Their Target",
    "url": "https://dailyhodl.com/2023/08/23/glassnode-founders-predict-bitcoin-will-soar-to-new-highs-sooner-than-expected-heres-their-target/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/glassnode-founder-soar-bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/glassnode-founder-soar-bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/glassnode-founder-soar-bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/glassnode-founder-soar-bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/glassnode-founder-soar-bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/glassnode-founder-soar-bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/glassnode-founder-soar-bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The co-founders of the crypto analytics firm Glassnode think Bitcoin (BTC) could soar toward a new all-time high faster than many analysts and traders expect. Glassnode co-founders Jan Happel and Yann Allemann, who share the Negentropic handle on the social media platform X, predict that the US dollar index (DXY) will peak at 106. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/23/glassnode-founders-predict-bitcoin-will-soar-to-new-highs-sooner-than-expected-heres-their-target/\">Glassnode Founders Predict Bitcoin Will ‘Soar’ to New Highs Sooner Than Expected – Here’s Their Target</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-23T19:55:12.000Z",
    "title": "Man Faces Life Sentence After China Accuses Him of Running Secret Crypto Mining Activities, Bribery: Report",
    "url": "https://dailyhodl.com/2023/08/23/man-faces-life-sentence-after-china-accuses-him-of-running-secret-crypto-mining-activities-bribery-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Backed-Crypto-Asset-Surges-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Backed-Crypto-Asset-Surges-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Backed-Crypto-Asset-Surges-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Backed-Crypto-Asset-Surges-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Backed-Crypto-Asset-Surges-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Backed-Crypto-Asset-Surges-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Backed-Crypto-Asset-Surges-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A Chinese man will reportedly spend the rest of his life in prison after being caught hiding illicit crypto mining activities and accepting bribes. According to a new report by the South China Morning Post, former senior provincial official Xiao Yi has been handed a life sentence for providing support for local crypto mining businesses. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/23/man-faces-life-sentence-after-china-accuses-him-of-running-secret-crypto-mining-activities-bribery-report/\">Man Faces Life Sentence After China Accuses Him of Running Secret Crypto Mining Activities, Bribery: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]