[
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T18:31:47.000Z",
    "title": "Ethereum death cross threatens more downside as ETH price trades at a key support level ",
    "url": "https://cointelegraph.com/news/ethereum-death-cross-threatens-more-downside-as-eth-price-trades-at-a-key-support-level",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/3435a47a-6e89-49d4-9437-39426d08805e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> ETH’s technical and on-chain indicators point toward further downside, but there is a silver lining.</p>\n                    <p><p>Ether price is down today, and several data points are beginning to suggest that further downside could be in store. </p><p>On July 24, Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) experienced a drop close to its monthly low, reaching $1,825, amid <a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-down-today\">Bitcoin's negative price action</a>, as uncertainty loomed over macroeconomic conditions and a potential whale sell-off.</p><p>Several on-chain and technical indicators point to further downside in ETH prices. However, the extent of this downward movement could be limited, considering the profit levels of existing holders and decrease in its liquid supply.</p><h2>ETH on-chain analysis suggests more downside</h2><p>Since the beginning of 2023, Ethereum's network value to transaction value (NVT) metric has indicated that the asset may have been overpriced.</p><p>Glassnode's NVT signal gauges the relative value of the Ethereum network by comparing the market price to the volume of on-chain transactions. A higher NVT reading implies that ETH could be trading at a premium.</p><p>The NVT chart from Glassnode reveals that the metric typically fluctuates between 80 and 30. However, at the start of 2023, it surged to three-year highs of 120 and has maintained higher levels since then. This suggests that either a pullback in price or an increase in Ethereum's on-chain activity would be necessary to trigger a reset in this metric.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/76cbb1c3-44fc-4347-a936-03cd483b8de9.png\"  /><figcaption style=\"text-align: center;\"><em>Ethereum NVT signal. Source: Glassnode</em></figcaption></figure><p>Nevertheless, the profit-levels of short and long-term holders suggest that the downturn could be restricted.</p><p>Ether’s negative price action usually reverses when the net unrealized profit/loss (NUPL) metric of short-term holders is negative, meaning short-term holders are in losses. It causes some weak hands to panic sell, allowing buyers to scoop up coins at a cheaper price.</p><p>Currently, the short-term NUPL ratio is close to neutral levels. However, there’s room for some downside based on historic levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/12262e26-379b-4f8f-83dd-8d8095d60077.png\"  /><figcaption style=\"text-align: center;\"><em>Ethereum’s net unrealized profit/loss metric for short-term holders. Source: Glassnode</em></figcaption></figure><p>The realized profit/loss metric which evaluates the relative profitability of ETH transfers paints a similar picture. On-chain analytics firm Santiment wrote in its <a href=\"https://insights.santiment.net/read/ethereum-enjoying-its-time-under-the-radar-7342?fpr=twitter\" target=\"_blank\" rel=\"noopener nofollow\">latest analysis</a> that “the ratio of on-chain transaction volume in profit to loss is still favoring profit takes” but not by much.</p><p>Santiment analyst Brian Quinlivan added: </p><blockquote>“If ETH drops a bit more from here and threatens the $1,700-$1,800 level again, panic sells would come pouring in to justify the buys.”</blockquote><p>Similarly, the NUPL ratio of long-term holders is also ranging near 2019 and early 2020 peak levels, suggesting that a pullback is likely. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/f5dd72f7-0d59-465f-ad51-b8da18afe072.png\"  /><figcaption style=\"text-align: center;\"><em>Ethereum’s NUPL metric for long-term holders. Source: Glassnode</em></figcaption></figure><p>ETH supply on <a href=\"https://cointelegraph.com/news/ethereum-price-eyes-3k-as-exchanges-eth-balances-drop-to-an-all-time-low\">exchanges has dropped drastically</a> since the <a href=\"https://cointelegraph.com/news/ethereum-s-shapella-hard-fork-executed-on-mainnet\">Shapella upgrade in April</a>. At the same time, the amount staked for validation of the proof-of-stake network has <a href=\"https://cointelegraph.com/news/ethereum-price-charts-reflect-weakness-but-inflow-to-lsdfi-could-prevent-an-eth-sell-off\">increased simultaneously</a>. The locking in staking contracts decreased its liquid supply of exchange, which is more susceptible to selling than staked ETH.</p><p>ETH’s realized price, which represents the fair value of the token based on the daily value moved on-chain, is currently at $1,507. In 2022, ETH quickly recovered below the realized price metric as the profit levels of long-term holders dropped in the negative territory.</p><p>The on-chain metrics show that the price could suffer some selling pressure from short-term holders and panic selling from investors spooked by relatively lower levels of activity in 2023. </p><p>Nevertheless, the profit levels of short-term and long-term holders suggest that the slump may not stretch far enough and the price could find support above the $1,500 level.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-btc-outflows-coinshares-while-ether-xrp-gain\"><strong><em>Crypto investors cool on Bitcoin funds, turning to Ether and XRP</em></strong></a></p><h2>ETH/USD price analysis </h2><p>Technically, the ETH/USD pair shows bearish risk in the short term with an impending death cross on the weekly scale. </p><p>Ether has witnessed only one death cross between the 50 and 200-period moving averages (MA) on a weekly scale in the past before in June 2019, following which its price dropped 60%.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/f652cb26-a823-42a0-b4c1-c7cf5dad5c13.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USD weekly price chart. Source: TradingView</em></figcaption></figure><p>On the daily chart, the ETH/USD pair threatens a fall toward the 200-day MA at $1,761, which also coincides with the support in line with the lower-highs from November 2022.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/a77d4fd1-a0ad-4182-b46f-5be8870ab9f8.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USD daily charts. Source: TradingView</em></figcaption></figure><p>The derivatives data for ETH indicates that there has been no significant change in the open interest volume for futures contracts, which reflects the demand for these contracts. This suggests that traders are currently not showing much interest in the recent lackluster price action.</p><p>Looking at the options data from Deribit, it reveals that contracts worth $1.1 billion are set to expire on July 28. The positioning in the options market indicates a bullish bias, with a notable concentration of call options between $1,900 and $2,400.</p><p>As the expiration date approaches, it is likely that the price will remain subdued around the maximum pain level for options buyers, which is at $1,850.</p><p>Based on the on-chain and market indicators, it appears that Ether's negative selling pressure could persist for a couple of weeks. However, there is potential for a strong influx of buyers, particularly at support levels at $1,700 and $1,500.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T18:21:40.000Z",
    "title": "Alphapo payment provider hack now estimated at over $60M — ZachXBT",
    "url": "https://cointelegraph.com/news/alphapo-payment-provider-hack-estimated-over-60m-on-chain-sleuth",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/4631048e-87dd-4022-a90b-92249fbacb8c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The on-chain sleuth ZachXBT claims to have found an additional $37 million in losses suffered from the unconfirmed attack.</p>\n                    <p><p>The alleged Alphapo payments provider hack of July 23 is now estimated to have caused losses exceeding $60 million, according to a July 25 report from on-chain sleuth ZachXBT. The loss was previously reported at roughly $31 million.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Hack update: An additional $37M stolen on TRON &amp; BTC from this hack has been located.<br><br>This now brings the total amount stolen to $60M.<br><br>This hack appears to likely have been done by Lazarus as they create a very distinct fingerprint on-chain. <a href=\"https://t.co/ACGSXiDwW3\">pic.twitter.com/ACGSXiDwW3</a></p>&mdash; ZachXBT (@zachxbt) <a href=\"https://twitter.com/zachxbt/status/1683747073227624448?ref_src=twsrc%5Etfw\">July 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Alphapo is a centralized crypto payment provider for e-commerce subscription services, gaming sites and other online businesses. It’s known as the provider for mystery box platform HypeDrop and gambling sites Bovada and Ignition. On July 23, security experts began reporting that the site’s hot wallets <a href=\"https://cointelegraph.com/news/alphapo-hot-wallets-hacked-for-over-31-million\">appeared to have been drained</a> of at least $21 million, with some sources reporting that the losses exceeded $31 million.</p><p>At the time, Alphapo did not comment on the alleged hack, but it did tell Cointelegraph that deposits and withdrawals were being reinstated at new addresses. The team said funds deposited to old addresses will be “additionally verified.” HypeDrop confirmed that its payment provider was “experiencing issues” that were causing withdrawals to be delayed but that withdrawals would be reinstated once the issue was resolved.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/eth-curve-omnipool-platform-conic-finance-hacked-for-3-2-million-in-eth\"><strong>Curve omnipool platform Conic Finance hacked for $3.2M in ETH</strong></a></em></p><p>Neither company confirmed that the issues were caused by a hack, but security researchers have argued that the large outflows from known hot wallets, combined with stalled withdrawals, imply that the funds may have been moved by an attacker.</p><p>The new report from ZachXBT identifies an additional $37 million allegedly drained from the old addresses on the Tron and Bitcoin networks, bringing the total to more than $60 million in losses. Citing data from Dune Analytics, the on-chain sleuth argued that the Lazarus Group may be behind the attack:</p><blockquote>“This hack appears to likely have been done by Lazarus as they create a very distinct fingerprint on-chain.”</blockquote><p>The Lazarus Group is a cybercrime group first identified by a consortium of security researchers led by Novetta in 2014. The group is believed to have ties to the government of North Korea.</p><p>Alphapo is not the only centralized crypto provider to have suffered mysteriously large withdrawals in July. On July 7, cross-chain bridging protocol Multichain <a href=\"https://cointelegraph.com/news/multichain-mpc-bridge-sees-millions-in-outflows-exploit-feared\">suffered over $100 million in unexplained withdrawals</a>. On July 14, the Multichain team <a href=\"https://cointelegraph.com/news/multichain-stops-operations-over-lack-of-funds\">announced that it would stop operations</a> after revealing that these withdrawals had been caused by an attacker accessing the protocol’s private keys through a cloud storage service.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-25T18:33:41.000Z",
    "title": "Musk’s Golden Ticket to Twitter Profitability ? DOGE, X and More",
    "url": "https://cryptobriefing.com/musks-golden-ticket-to-twitter-profitability/?utm_source=feed&utm_medium=rss",
    "description": "Billionaire entrepreneur Elon Musk has given Twitter, the popular social media platform, a rebrand to X. Then, sneakily, the Crypto Twitter noticed that Musk unveiled the Dogecoin logo in his..."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-25T18:29:31.000Z",
    "title": "$ADA: Crypto Analyst Explains His Concern Over Cardano’s Price Action, Reminds Him of 2019 Downtrend",
    "url": "https://www.cryptoglobe.com/latest/2023/07/ada-crypto-analyst-explains-his-concern-over-cardanos-price-action-reminds-him-of-2019-downtrend/",
    "description": "In a recent Cardano (ADA) trading strategy session, prominent crypto analyst Benjamin Cowen issued a warning about Cardano, a leading competitor to Ethereum (ETH). Cowen drew attention to the striking similarities between Cardano’s current price action and its performance in the latter half of 2019, a period marked by a consistent downward trend for ADA. […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T18:18:25.000Z",
    "title": "UK Information commission launches investigation into Worldcoin’s data practices",
    "url": "https://www.cryptopolitan.com/uk-looks-into-worldcoins-data-practices/",
    "description": "Worldcoin has emerged as a significant participant in the crypto industry, promising to broaden people&#8217;s access to virtual assets and make it easier to participate in the global financial system.&#160; The UK Information Commission, however, is very interested in Worldcoin due to the rising concern over data privacy and security. The commission&#8217;s investigation aims to ... <a title=\"UK Information commission launches investigation into Worldcoin&#8217;s data practices\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-looks-into-worldcoins-data-practices/\" aria-label=\"More on UK Information commission launches investigation into Worldcoin&#8217;s data practices\">Read more</a>"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-25T18:30:00.000Z",
    "title": "Xandeum, the Layer One With Scalable Storage Layer, Announces Grand Launch on July 30, 2023",
    "url": "https://dailyhodl.com/2023/07/25/xandeum-the-layer-one-with-scalable-storage-layer-announces-grand-launch-on-july-30-2023/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Xandeum-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Xandeum-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/07/Xandeum-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/07/Xandeum-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Xandeum-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/07/Xandeum-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>July 25, 2023 – Las Vegas, Nevada Xandeum, a trailblazing blockchain startup committed to accelerating humanity&#8217;s transition to decentralized control, announces its highly anticipated launch on July 30, 2023, at 6:00 PM UTC. Leveraging the power of blockchain technology, Xandeum&#8217;s mission is to empower collective self-determination by creating a scalable blockchain-based storage layer for smart [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/25/xandeum-the-layer-one-with-scalable-storage-layer-announces-grand-launch-on-july-30-2023/\">Xandeum, the Layer One With Scalable Storage Layer, Announces Grand Launch on July 30, 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]