[
  {
    "source": "Cointelegraph",
    "date": "2023-08-15T04:03:06.000Z",
    "title": "Binance files motion protective order against SEC’s ‘fishing expedition’",
    "url": "https://cointelegraph.com/news/binance-files-motion-for-protective-order-against-sec",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/701432a1-38dd-4fa3-8ffa-f4855d7eda8f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The exchange claims the SEC's deposition and discovery requests are outside the scope of the regulators lawsuit it filed against Binance.</p>\n                    <p><p>Binance has asked a court for a protective order against the Securities and Exchange Commission (SEC) over what the crypto exchange claims is a \"fishing expedition\" from the regulator.</p><p>In an Aug. 14 court <a href=\"https://www.courtlistener.com/docket/67474542/95/securities-and-exchange-commission-v-binance-holdings-limited/\" target=\"_blank\" rel=\"noopener nofollow\">filing</a>, Binance put forward a motion for a protective order following deposition notices and discovery requests from the SEC.</p><p>\"BAM has worked in good faith, but the SEC has been steadfast in its belief that the Consent Order gives it carte blanche to investigate every aspect of BAM’s asset custody practices without any discernible limitation whatsoever,\" the exchange wrote. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Binance is seeking a protective order against the SEC, claiming that they are conducting a &quot;fishing expedition&quot;.<a href=\"https://t.co/NquMV8ShNK\">https://t.co/NquMV8ShNK</a></p>&mdash; Molly White (@molly0xFFF) <a href=\"https://twitter.com/molly0xFFF/status/1691283278618066945?ref_src=twsrc%5Etfw\">August 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Binance claimed the SEC is demanding it produce communications dating back to November 2022 for \"dozens of topics — many of which have nothing to do with customer assets.\"</p><p>It also took issue with the SEC's request that the exchange make six of its employees and officers available for depositions including its CEO Changpeng \"CZ\" Zhao.</p><p>\"Now, the SEC is also demanding depositions of BAM’s most senior executives despite that they do not have unique firsthand knowledge about the facts surrounding the security, custody, and transfer of customer assets, and the employees who do have been offered for depositions,\" it argued.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-15T03:49:25.000Z",
    "title": "Ex-FTX exec Salame won’t testify in alleged illegal campaign donation case",
    "url": "https://cointelegraph.com/news/former-ftx-ryan-salame-wont-testify-in-campaign-donation-case",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/fd8ff103-958f-45a4-be52-1ad033ea8ede.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ryan Salame plans to plead the Fifth if he is asked to testify at Sam Bankman-Fried's criminal trial, according to United States prosecutors.</p>\n                    <p><p>Former FTX executive Ryan Salame will reportedly avoid testifying about his role in FTX’s alleged illegal campaign donation scheme if he is subpoenaed in Sam Bankman-Fried’s criminal trial.</p><p>Lawyers representing the former FTX co-CEO said that Salame will be unavailable as a witness to the case, <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590940/gov.uscourts.nysd.590940.204.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to an Aug. 14 motion filed by United States federal prosecutors.</p><p>“Salame’s attorney has represented that if subpoenaed, Salame would invoke his Fifth Amendment right against self-incrimination,” the prosecutor’s motion states, adding that Salame would be “unavailable as a witness.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">From the US government&#39;s motion in limine in the Sam Bankman-Fried criminal trial: &quot;[Ryan] Salame is unavailable as a witness... Salame’s attorney has represented that if subpoenaed, Salame would invoke his Fifth Amendment right against self-incrimination.&quot; <a href=\"https://t.co/NrB5d6PJDH\">pic.twitter.com/NrB5d6PJDH</a></p>&mdash; Molly White (@molly0xFFF) <a href=\"https://twitter.com/molly0xFFF/status/1691240264923275265?ref_src=twsrc%5Etfw\">August 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Salame, a former co-CEO of FTX Digital Markets with close ties to Sam Bankman-Fried, <a href=\"https://www.opensecrets.org/elections-overview/biggest-donors\" target=\"_blank\" rel=\"noopener nofollow\">donated</a> more than $24 million to Republican campaigns, according to Open Secrets.</p><p>The former FTX executive is reportedly facing possible <a href=\"https://cointelegraph.com/news/former-ftx-exec-ryan-salame-prosecutors-discuss-plea-deal\">finance campaign violation allegations</a> of his own and is considering a plea deal with the federal prosecutors.</p><p>He was a <a href=\"https://cointelegraph.com/news/sbf-s-inner-circle-received-3-2b-mainly-from-alameda-court-filings\">substantial beneficiary of loans</a> and payments given to a number of the top executives of FTX by way of the now-bankrupt firms’ trading house Alameda Research. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-superseding-indictment-includes-campaign-finance-allegations\"><strong><em>Superseding indictment against Sam Bankman-Fried includes using $100M for campaign contributions </em></strong></a></p><p><a href=\"https://cointelegraph.com/news/former-ftx-exec-ryan-salame-s-home-searched-by-fbi-report\">Salame had his house searched</a> by the U.S. Federal Bureau of Investigation in April. However it remains unknown what exactly they were looking for. </p><p>He was considered a close business partner of Bankman-Fried, <a href=\"https://cointelegraph.com/news/sam-bankman-fried-in-notorious-brooklyn-jail\">who is currently imprisoned</a> and is facing fraud charges in his upcoming trial in October.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T04:05:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-15T03:57:13.000Z",
    "title": "Bitcoin Price Relatively Muted – What Could Trigger A Sharp Decline?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-muted-29650/",
    "description": "Bitcoin price is still struggling below the $29,650 zone. BTC could gain bearish momentum if there is a close below the $29,100 support. Bitcoin is showing a few bearish signs below the $29,650 zone. The price is trading below $29,400 and the 100 hourly Simple moving average. There is a short-term bullish trend line forming with support near $29,320 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could continue to move down if it breaks the $29,250 and $29,100 support levels. Bitcoin Price Stuck Below $30K Bitcoin price remained well below the $30,000 resistance zone. BTC attempted a short-term upward move but the bears were active near the $29,650 resistance zone. A high was formed near $29,657 before there was a fresh decline to $29,250. The price is now consolidating and trading above the 23.6% Fib retracement level of the recent decline from the $29,657 swing high to the $29,250 low. Bitcoin is now trading below $29,400 and the 100 hourly Simple moving average. There is also a short-term bullish trend line forming with support near $29,320 on the hourly chart of the BTC/USD pair. Immediate resistance is near the $29,450 level. It is close to the 50% Fib retracement level of the recent decline from the $29,657 swing high to the $29,250 low. The next major resistance is near $29,500. The main resistance is now forming near the $29,650 level. Source: BTCUSD on TradingView.com A close above the $29,650 resistance could send the price toward the $30,000 resistance zone. Any more gains might change the trend and the price might rise toward $30,500. In the stated case, the price could even rise toward $31,200 or even $32,200 in the coming days. More Losses In BTC? If Bitcoin fails to clear the $29,650 resistance, it could continue to move down. Immediate support on the downside is near the trend line. The next major support is near the $29,250 level. The first key support is near $29,100. A downside break below the $29,100 level might start another steady decline. In the stated case, the price could drop toward $28,400. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $29,250, followed by $29,100. Major Resistance Levels – $29,450, $29,650, and $30,000."
  }
]