[
  {
    "source": "Bitcoin.com",
    "date": "2023-12-16T22:00:27.000Z",
    "title": "Crypto App Shakepay Reveals Data Breach Affecting a ‘Small Number’ of Customers",
    "url": "https://news.bitcoin.com/crypto-app-shakepay-reveals-data-breach-affecting-a-small-number-of-customers/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/jup-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto App Shakepay Reveals Data Breach Affecting a ‘Small Number’ of Customers\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/jup-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/jup-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/jup-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/jup-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/jup-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/jup-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/jup.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent announcement, Shakepay, the Canadian crypto app, disclosed a data breach involving unauthorized access to personal information of a select group of its customers. The breach, detected on Dec. 13, 2023, compromised data but did not affect any bank accounts, crypto wallets, or customer credentials. Shakepay Addresses Data Breach Concerns, Offers Free Credit [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-16T22:07:40.000Z",
    "title": "Security breach hits NFT trader, resulting in major losses",
    "url": "https://www.cryptopolitan.com/security-breach-hits-nft-trader-resulting-in/",
    "description": "In a significant security breach, the peer-to-peer trading platform NFT Trader experienced a cyberattack on, resulting in the theft of millions of dollars worth of nonfungible tokens (NFTs).&#160; The breach targeted outdated smart contracts, leading NFT Trader to urge its users to revoke delegations to two specific addresses: 0xc310e760778ecbca4c65b6c559874757a4c4ece0 and 0x13d8faF4A690f5AE52E2D2C52938d1167057B9af. NFT theft millions in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-16T22:00:53.000Z",
    "title": "BNB chain’s game-changing recovery from 2022 security breach",
    "url": "https://www.cryptopolitan.com/bnb-chains-game-changing-recovery-from-2022/",
    "description": "BNB Chain Core has unveiled a comprehensive strategy to recover from a security breach that occurred in October 2022, resulting in significant losses.&#160; The attacker managed to exploit the BNB Bridge, accumulating 630,240 BNB supply and borrowing 58,440,000 USDT and 37,440,000 USDC.&#160; After more than a year of meticulous planning, BNB Chain Core is taking [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-16T21:53:14.000Z",
    "title": "Senator Elizabeth Warren faces criticism over crypto stance",
    "url": "https://www.cryptopolitan.com/senator-elizabeth-warren-faces-criticism/",
    "description": "Renowned lawyer and cryptocurrency supporter, John E. Deaton, has taken to social media to express his disappointment in Senator Elizabeth Warren, accusing her of prioritizing political gains over genuine concerns about cryptocurrency regulation.&#160; In a recent tweet, Deaton criticized Warren for her apparent alignment with Jamie Dimon, the CEO of JPMorgan, during a congressional hearing [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-16T22:00:16.000Z",
    "title": "Polygon (MATIC) Price Faces Crucial Turning Point That Could Trigger 50% Rally, Analyst Says",
    "url": "https://www.newsbtc.com/matic/polygon-matic-price-50-rally/",
    "description": "Polygon (MATIC) is the altcoin in focus this time around as an analyst provides an analysis of the crypto token. Based on this analysis, there is a feeling that things could soon begin to look up for MATIC. Polygon Could See Significant Rally Soon In a video shared on the Cheeky Crypto YouTube Channel, crypto analyst JB noted that MATIC has declined following Bitcoin’s pullback. However, this move is unexpected as he believes that the crypto token’s decline to the particular retracement area sets it up nicely for an upward move. Based on his projection, MATIC could rise to between $0.87 and $1.36. Related Reading: Bitwise Reveals Two Major Triggers That Will Send Bitcoin Price To $80,000 JB also factored in other things that could suggest that an upward move is imminent. He alluded to the stochastic level, which had initially suggested an overbought condition. However, it has sharply corrected indicating that there could be another push to the upside for MATIC. On the other hand, the crypto analyst was also wary of factors that could spell a move to the downside. One of them happens to be the volumes that are seen across various cryptocurrencies. JB stated the current volumes aren’t great, and this has weakened the prices of these crypto tokens. This could potentially hinder any projection of an upward move. Another is the possibility of MATIC losing the cross above the 200 EMA, as this suggests that a dump is imminent.  Earlier in the video, JB had also emphasized the 5-wave pattern that was forming on different timeframes on the MATIC chart. The analyst seemed uncertain about whether or not the fifth wave was just forming. He noted that a push above $94.5 would suggest that the last wave is still to come. There is also the possibility that it could just be an A, B, and C pattern.  Polygon price makes its way above $0.85 &#124; Source: MATICUSD on Tradingview.com MATIC To $100 Still Possible Still analyzing MATIC’s price pattern on the charts, JB mentioned that he was still bullish on the crypto token ahead of the imminent bull market. He had previously mentioned a target of $100 for MATIC in the next bull run, and he is still standing by the projection. In fact, JB noted that a new structure forming on the charts suggests that the crypto token could rise higher than that.  Related Reading: Analyst Predicts XRP Price Will Rise 800% To $5.5 – The Timeframe Will Shock You As part of this prediction, he sees MATIC being a “powerhouse” in the bull run and being one of the standout altcoins. One of the factors that he believes will contribute to MATIC’s dominance is the potential approval of the pending Ethereum Spot ETF applications. He believes that the crypto token could be a huge beneficiary, considering its role in the Ethereum ecosystem.  At the time of writing, MATIC is trading at around $0.85, down over 1%, according to data from CoinMarketCap. Featured image from Admiral Markets, chart from Tradingview.com"
  }
]