[
  {
    "source": "CryptoSlate",
    "date": "2023-06-05T12:37:03.000Z",
    "title": "Looming June FOMC meeting roils Bitcoin market",
    "url": "https://cryptoslate.com/insights/looming-june-fomc-meeting-roils-bitcoin-market/",
    "description": "<p>Quick Take The Federal Reserve&#8217;s actions, specifically its interest rate decisions, serve as an external catalyst that influences Bitcoin&#8217;s price movements, as noted by Swissblock. The recent Nasdaq and NVIDIA rallies have not significantly affected the cryptocurrency market, but Swissblock has observed that the fluctuating likelihood of interest rate hikes has impacted Bitcoin&#8217;s price movements. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/looming-june-fomc-meeting-roils-bitcoin-market/\">Looming June FOMC meeting roils Bitcoin market</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-05T12:15:00.000Z",
    "title": "Crypto Risk Management Firm Elliptic Taps into ChatGPT",
    "url": "https://cryptodaily.co.uk/2023/06/crypto-risk-management-firm-elliptic-taps-into-chatgpt",
    "description": "<p class=\"md-end-block md-p md-focus\">Top cryptocurrency risk management firm Elliptic has announced last Thursday, June 1 their move to integrate large-language model (LLM) ChatGPT for their risk management and intelligence gathering operations. According to the statement, Elliptic expects that they &ldquo;will be able to synthesize and organize intelligence on new risk factors in higher volumes and at a quicker speed than ever before.&rdquo;</p>\n<p class=\"md-end-block md-p\">Elliptic has been at the forefront of cryptocurrency risk management and security. It recently published a report (commissioned by Nikkei Asia) on the cryptocurrency losses inflicted by North Korean hackers from 2017-2022. The report said that Asian countries, with Japan at the top, made up three of the four hotspots of hacking. Japan is estimated to have lost $721 million in cyberattacks. Now, Elliptic has taken steps to improve their solutions with the help of ChatGPT.</p>\n<p class=\"md-end-block md-p\">With the ChatGPT integration, Elliptic aims to bolster its capabilities in risk analysis and threat detection. According to CEO Simone Maini, their continuous pursuit of cutting-edge technology is crucial to their mission. \"We pride ourselves in being on the forefront of blockchain innovation, and incorporating cutting-edge technologies to enhance how we work without compromising the high standards for which we are known is part of our DNA,&rdquo; she stated.</p>\n<p class=\"md-end-block md-p\">The success of ChatGPT has attracted the attention of many in the crypto space and see a world full of potentials enabled by the LLM. Solana (SOL) has recently announced their plans to integrate the LLM through a plug-in and enable user interaction with the Solana network itself. The plug-in will enable users to ask questions and have them promptly answered by ChatGPT. At the same time, Solana has also announced a grant program for AI-focused projects built on the network.</p>\n<p class=\"md-end-block md-p\">The use of AI for crypto projects, and especially for risk management and security is not without its risks. Many have noted the LLM&rsquo;s shortcomings and limitations especially when dealing with more complex queries. There is still a very big room for improvements in the LLM and for a security firm as big as Elliptic, mistakes can be very costly.</p>\n<p class=\"md-end-block md-p\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T12:24:11.000Z",
    "title": "Top blockchain accelerators in 2023",
    "url": "https://www.cryptopolitan.com/top-blockchain-accelerators-in-2023/",
    "description": "If you are a blockchain startup founder in the early phases of developing your company, blockchain accelerators can help you. With chances for blockchain and crypto companies growing, now is the moment to board the rocket ship. It&#8217;s critical to understand that there are blockchain accelerators and incubators. Pay attention to the differences and similarities ... <a title=\"Top blockchain accelerators in 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-blockchain-accelerators-in-2023/\" aria-label=\"More on Top blockchain accelerators in 2023\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-05T12:36:48.000Z",
    "title": "Binance’s CZ could leave his post amid regulatory hurdle",
    "url": "https://crypto.news/binances-cz-could-leave-his-post-amid-regulatory-hurdle/",
    "description": "Binance has recently faced various regulatory challenges in multiple jurisdictions. Bloomberg reports that the crypto exchange might be preparing for a change in its top leadership. The exchange has recently lost its Australian payments partner, which led to the suspension&#8230;"
  },
  {
    "source": "Kraken Blog",
    "date": "2023-06-05T12:30:45.000Z",
    "title": "Meet Kraken’s new Chief Technology Officer, Vishnu Patankar",
    "url": "https://blog.kraken.com/post/18295/vishnu-patankar/",
    "description": "<p>Kraken, one of the world&#8217;s longest standing and most trusted crypto platforms, today announced the appointment of Vishnu Patankar as Chief Technology Officer (CTO). Patankar brings over twenty years of technology expertise to Kraken and helped Fortune 500 companies like Microsoft, Amazon, Intel, and Groupon&#8230;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.kraken.com/post/18295/vishnu-patankar/\">Meet Kraken&#8217;s new Chief Technology Officer, Vishnu Patankar</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.kraken.com\">Kraken Blog</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-05T12:32:17.000Z",
    "title": "Multichain Resumes Cross-Chain Services as Zhaojun Regains Freedom",
    "url": "https://coinedition.com/multichain-resumes-cross-chain-services-as-zhaojun-regains-freedom/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Seems_Zksync_Era_Kava_EVM_Avax_C_Chain_Multichain_service_is_back-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Seems_Zksync_Era_Kava_EVM_Avax_C_Chain_Multichain_service_is_back-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Seems_Zksync_Era_Kava_EVM_Avax_C_Chain_Multichain_service_is_back-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Seems_Zksync_Era_Kava_EVM_Avax_C_Chain_Multichain_service_is_back-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Seems_Zksync_Era_Kava_EVM_Avax_C_Chain_Multichain_service_is_back-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Seems_Zksync_Era_Kava_EVM_Avax_C_Chain_Multichain_service_is_back-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Seems_Zksync_Era_Kava_EVM_Avax_C_Chain_Multichain_service_is_back.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Bobie, the founder of Web3 knowledge graph protocol 0xScope, has confirmed that the Zksync Era/Kava EVM/Avax C-Chain Multichain service is back in action. In a tweet, Bobie also noted that Multichain’s CEO ZhaoJun has been released from jail. To prove his claim, Bobie shared some transaction screenshots that show Multichain has resumed operations with cross-chain [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/multichain-resumes-cross-chain-services-as-zhaojun-regains-freedom/\">Multichain Resumes Cross-Chain Services as Zhaojun Regains Freedom</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-05T12:22:19.000Z",
    "title": "How to Make Money Quickly With HappyMiner Cloud Mining platform",
    "url": "https://coinedition.com/how-to-make-money-quickly-with-happyminer-cloud-mining-platform/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/happy-miner-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/happy-miner-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/happy-miner-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/happy-miner-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/happy-miner-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/happy-miner-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/happy-miner.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>HappyMiner is a cloud mining company that allows individuals to return investment through its cloud mining services. The company is pleased to announce new affordable cloud mining plans. To address the latest innovation, HappyMiner announces new affordable cloud mining plans. It enables individuals to invest in cryptocurrency mining while minimizing the associated costs. By offering [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/how-to-make-money-quickly-with-happyminer-cloud-mining-platform/\">How to Make Money Quickly With HappyMiner Cloud Mining platform</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-06-05T12:20:34.000Z",
    "title": "Bitfinex Alpha | Mixed Economic Data Pushes Crypto Markets Towards a Lull",
    "url": "https://blog.bitfinex.com/bitfinex-alpha/bitfinex-alpha-mixed-economic-data-pushes-crypto-markets-towards-a-lull/",
    "description": "<p>As we survey the markets this week, mixed US economic data continues to emerge as crypto markets begin to look like they are entering a summer lull. We also begin to see strains in Europe, with Germany entering into a recession. In the US, the...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/bitfinex-alpha/bitfinex-alpha-mixed-economic-data-pushes-crypto-markets-towards-a-lull/\">Bitfinex Alpha | Mixed Economic Data Pushes Crypto Markets Towards a Lull</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]