[
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T15:26:17.000Z",
    "title": "80 Chinese crypto influencer accounts shut down in latest crackdown",
    "url": "https://cointelegraph.com/news/80-chinese-crypto-influencer-accounts-shut-down-latest-crackdown",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/57e86a6c-0575-46e9-9998-8f9395d13c0c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The accounts had over 8 million in combined followers before they were removed. </p>\n                    <p><p>Sina Weibo, one of the most popular Chinese social media apps with over 258 million daily active users, has removed 80 influencer accounts promoting cryptocurrency activities citing official legislation.</p><p>According to the Sept. 5 <a href=\"https://weibo.com/1191965271/M0d6cx30s\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, 80 crypto influencer accounts with over 8 million in total followers had been \"proactively removed\" by Weibo. The accounts were accused of breaching eight regulations related to telecommunications, finance, banking, online marketing, securities, exchanges, and internet safety for their role in promoting cryptocurrencies. </p><p>The platform has been periodically sweeping out crypto accounts ever since China's cryptocurrency ban took effect in September 2021. In March, Weibo <a href=\"https://news.cnstock.com/news,bwkx-202303-5029221.htm\" target=\"_blank\" rel=\"noopener nofollow\">removed</a> 131 accounts linked to crypto and stock trading activities. </p><p>The largest nationwide crackdown occurred in August 2022 when the Cyberspace Administration of China (CAC) removed 12,000 influencer accounts on Weibo and Baidu linked to cryptocurrencies and deleted 51,000 related promotional posts. In supporting the decision, the CAC <a href=\"https://weibo.com/1191965271/M0d6cx30s\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a>: </p><blockquote>\"[The purpose is to] Protect the property safety of the people in accordance with the law. Remind the majority of netizens to establish correct investment concepts, enhance risk prevention awareness, refrain from participating in virtual currency trading hype activities, and beware of personal property damage.\"</blockquote><p>Similarly, Weibo <a href=\"https://news.cnstock.com/news,bwkx-202303-5029221.htm\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in its previous enforcement action: </p><blockquote>\"[We will] Continue to increase the crackdown on illegal securities activities that exist on the platform, and strictly control related violations of laws and regulations, and will never tolerate them.\"</blockquote><p>Starting this year, China has been cracking down on private crypto-related activities due to a combination of capital flight, money laundering, and the need to preserve its state-run crypto efforts. Some of these efforts have resulted in collateral damage for non-Chinese investors.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/multichain-victims-search-for-answers-in-billion-dollar-exploit-as-new-evidence-emerges\">Multichain victims search for answers in $1.5B exploit as new evidence emerges</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-05T15:10:14.000Z",
    "title": "Visa expands USDC settlements to Solana blockchain in partnership with WorldPay, Nuvei",
    "url": "https://cryptoslate.com/visa-expands-usdc-settlements-to-solana-blockchain-in-partnership-with-worldpay-nuvei/",
    "description": "<p>Payment giant Visa has broadened its USD Coin (USDC) settlement capacities to the Solana (SOL) blockchain while collaborating with merchant acquirers Worldpay and Nuvei, according to a Sept. 5 statement. The move implies that certain merchants affiliated with WorldPay and Nuvei can now receive payments in USDC directly, instead of traditional fiat currency, when customers [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/visa-expands-usdc-settlements-to-solana-blockchain-in-partnership-with-worldpay-nuvei/\">Visa expands USDC settlements to Solana blockchain in partnership with WorldPay, Nuvei</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-05T15:23:08.000Z",
    "title": "Visa Expands its USD Coin ($USDC) Settlement Capabilities to Solana",
    "url": "https://www.cryptoglobe.com/latest/2023/09/visa-expands-its-usd-coin-usdc-settlement-capabilities-to-solana/",
    "description": "Global payments giant Visa has announced its latest move to modernize cross-border financial transactions. What Is USD Coin (USDC)? USDC, or USD Coin, is a type of stablecoin that is pegged to the U.S. dollar. Each USDC token is meant to be equivalent to one U.S. dollar, held in reserve by regulated financial institutions. The […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T15:30:22.000Z",
    "title": "Nima Capital dumps SYN tokens, shakes DeFi trust foundations",
    "url": "https://www.cryptopolitan.com/nima-capital-dumps-syn-tokens-shakes-defi-trust-foundations/",
    "description": "Nima Capital, a long-term financing partner of the Synapse cross-chain bridge, dumped over 9 million SYN tokens. The move sent the token&#8217;s value plummeting by 20%, hitting a multi-week low of $0.30. The firm also withdrew all stablecoin liquidity from the bridge. Later in the day, the token recovered slightly, settling above $0.35. Synapse X, ... <a title=\"Nima Capital dumps SYN tokens, shakes DeFi trust foundations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nima-capital-dumps-syn-tokens-shakes-defi-trust-foundations/\" aria-label=\"More on Nima Capital dumps SYN tokens, shakes DeFi trust foundations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T15:20:58.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T15:13:54.000Z",
    "title": "New Report Finds Gen Z Ready to Exploit A.I. Skills Gap, but Businesses Neglect Training",
    "url": "https://www.cryptopolitan.com/new-report-finds-gen-z-ready-to-exploit-a-i/",
    "description": "As AI gains momentum, concerns about its impact on jobs persist. Experts argue that AI will coexist with human workers, but a skills gap remains. New research highlights the need for businesses to provide AI training, particularly for Gen Z, who show promise in filling the void. The coexistence of AI and human workers Amid ... <a title=\"New Report Finds Gen Z Ready to Exploit A.I. Skills Gap, but Businesses Neglect Training\" class=\"read-more\" href=\"https://www.cryptopolitan.com/new-report-finds-gen-z-ready-to-exploit-a-i/\" aria-label=\"More on New Report Finds Gen Z Ready to Exploit A.I. Skills Gap, but Businesses Neglect Training\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T15:10:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-09-05T15:28:59.000Z",
    "title": "Visa Embraces Solana Blockchain for USDC Settlements",
    "url": "https://nulltx.com/visa-embraces-solana-blockchain-for-usdc-settlements/",
    "description": "Visa, the global payment giant, has made an exciting stride by extending its utilization of USDC stablecoin for settlement payments onto the Solana blockchain. This strategic move signifies Visa&#8217;s commitment to harnessing blockchain technology&#8217;s potential in the realm of payments. Why Solana? Solana stands out as a high-performance blockchain renowned for its remarkable traits: minimal [&#8230;]"
  },
  {
    "source": "Kraken Blog",
    "date": "2023-09-05T15:35:00.000Z",
    "title": "New UK clients can win a bitcoin with Kraken",
    "url": "https://blog.kraken.com/product/promotions/new-uk-clients-can-win-a-bitcoin-with-kraken",
    "description": "At Kraken, we&#8217;re committed to a world where everyone can achieve financial freedom and inclusion. So if you’re a U.K. resident thinking about getting into crypto, now is the perfect opportunity. Win a whole bitcoin Yes, you read that right! All new U.K. clients who sign up using the link below and make a trade [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-05T15:22:01.000Z",
    "title": "Ron DeSantis Unveils Bold Bitcoin (BTC) Economic Plan for America",
    "url": "https://www.crypto-news-flash.com/ron-desantis-unveils-bold-bitcoin-btc-economic-plan-for-america/",
    "description": "<img width=\"2000\" height=\"1333\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Deposit-photos-btc_204865564_L.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Deposit-photos-btc_204865564_L.jpg 2000w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Deposit-photos-btc_204865564_L-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Deposit-photos-btc_204865564_L-1024x682.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Deposit-photos-btc_204865564_L-104x69.jpg 104w\" sizes=\"(max-width: 2000px) 100vw, 2000px\" />Ron DeSantis, US Presidential hopeful has revealed plans to overhaul the economy. There are growing expectations that Bitcoin will form an integral part of his agenda. In a bid to improve the financial status and well being of Americans, Florida governor and Republican presidential candidate Ron DeSantis has introduced a “Declaration of Economic Independence.” The [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-05T15:09:51.000Z",
    "title": "How Metamask Wants to Replace Centralized Exchanges?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-metamask-wants-to-replace-centralized-exchanges/",
    "description": "<p>As of today, Metamask, the popular Ethereum wallet, will allow you to sell your cryptocurrencies, convert them into fiat currencies, and seamlessly deposit them into your bank account. This evolution signifies a crucial step towards Metamask&#8217;s potential to become the first alternative to replace centralized exchanges. The Evolution of Metamask Metamask, founded by ConsenSys, has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-metamask-wants-to-replace-centralized-exchanges/\">How Metamask Wants to Replace Centralized Exchanges?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]