[
  {
    "source": "Cointelegraph",
    "date": "2023-12-27T21:05:31.000Z",
    "title": " Ledger Live tracks users, says app developer and privacy advocate ",
    "url": "https://cointelegraph.com/news/ledger-live-tracks-users-says-app-developer-privacy-advocate",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNjgxY2MzNGYtZWZlYS00NzE2LWIzODAtYjE5OWUyOTNhYjcwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Developer REKTBuilder claims to have discovered a “genuine device check” that transmits data about users’ wallet usage, including which apps they install.</p>\n                    <p><p>Ledger Live software tracks its users and accumulates data about them, according to a report from pseudonymous software developer and privacy advocate REKTBuilder. The developer <a href=\"https://crypto.bi/forum/threads/a-look-at-ledger-live-genuine-check-reveals-its-impossible-to-avoid-being-tracked.6/\" target=\"_blank\" rel=\"noopener nofollow\">investigated</a> the software’s Python code and allegedly found that it performs a “genuine device check” every time the user connects their Ledger device to their PC or phone. This check lists every app installed on the device, REKTBuilder claimed, allowing Ledger to know which networks the wallet owner is using.</p><p>REKTBuilder is a pseudonymous researcher who posts to Crypto.bi forums and on X (formerly Twitter). On Dec. 6, they published a report <a href=\"https://twitter.com/rektbuildr/status/1732438593816182905\" target=\"_blank\" rel=\"noopener nofollow\">claiming</a> that Ledger Live was recording users’ crypto balances. The following day, they <a href=\"https://github.com/rektbuildr/lecce-libre\" target=\"_blank\" rel=\"noopener nofollow\">released</a> what they claimed to be a “tracker free” open-source alternative to Ledger Live, called “Lecce Libre.”</p><p>REKTBuilder now claims to have discovered an even bigger privacy issue with Ledger Live. According to their Dec. 27 post, they discovered that multiple lines of code contain the phrase “genuine check.” When they added “tracing prints” to this code, they found that it didn't run at the time when the software appeared to be checking the device. With their curiosity piqued, REKTBuilder investigated further and found that the actual check is embedded within a “listApps” subroutine. The check can be used by Ledger to determine the time and date of each moment that a user connects their device, REKTBuilder claimed.</p><p><a href=\"https://cointelegraph.com/news/ledger-live-tracks-users-says-app-developer-privacy-advocate\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-12-27T20:43:49.000Z",
    "title": "Vitalik Buterin pitches 3 pathways to simplify Ethereum’s PoS model",
    "url": "https://crypto.news/vitalik-buterin-pitches-3-pathways-to-simplify-ethereums-pos-model/",
    "description": "Ethereum co-creator Vitalik Buterin proposed three methods to address a possible “systemic complexity” stemming from the network’s proof-of-stake consensus design. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-27T21:00:12.000Z",
    "title": "Solana Meme Coins: A Guide to Buying, Trading, And Profiting From SOL Investments",
    "url": "https://www.newsbtc.com/news/solana/solana-meme-coins-sol/",
    "description": "In the ever-evolving landscape of cryptocurrency, Solana has emerged as a prominent player, and within its ecosystem, meme coins are creating a buzz in the crypto community. Meme coin trading, with its inherent thrill of pump-and-dump scenarios, has gained momentum on Solana, driven by a surge in liquidity and recent airdrops that have propelled SOL prices.  People who got the Pyth airdrop, the Jito airdrop, and the BONK airdrop need a place to dump and trade their free money, and Solana meme coins have given them the perfect avenue to do so.  This comprehensive guide aims to walk you through the intricate process of acquiring SOL and navigating the exciting world of Solana meme coin trades, emphasizing key considerations for successful and profitable transactions. Understanding The Landscape Of Meme Coins Before delving into the specifics, let&#8217;s briefly understand the unique landscape of meme coin trading on Solana. Unlike traditional cryptocurrencies with established utilities and roadmaps, meme coins often lack such fundamentals. Don&#8217;t expect a life-changing technology that is supposed to change the crypto game.  Related Reading: Crypto Trading Firm Expects Bitcoin To Crash To $36,000, Here’s Why These meme coins thrive on community-driven speculation, making them a double-edged sword for traders – an opportunity for exhilarating gains or potential losses. It&#8217;s a game of rug, loss, or victory. The moment you start trading, you either make a profit or you lose.  Acquiring SOL for Meme Coin Trades For those new to Solana meme coin trading, the journey begins with acquiring SOL, Solana&#8217;s native cryptocurrency. Popular exchanges like Binance, Kucoin, and Bybit offer a gateway to obtain SOL.  Once secured, the next step is transferring it to a compatible Solana decentralized exchange (DEX) wallet, such as Phantom Wallet. You can add the wallet to your computer’s browser as an extension or download the app directly to your device. The SOL price has been trading pretty high since trading activities have been increasing, thanks to the meme coin trading. The last bull run saw the SOL price increase driven by an increase in NFT trading; this time around, it’s meme coins. Related Reading: The Crypto Bulls Are Back: Digital Asset Inflows Cross $103 Million In One Week Identifying Profitable Meme Coins With SOL in your Phantom wallet, the focus shifts to identifying promising meme coins. Platforms like Solana Dexscreener become invaluable, allowing you to track meme coins specifically on the Solana chain.  Look for meme coins with lower market caps – an indicator that can significantly amplify profits during pump phases. Their names sometimes help, as meme coins with controversial names also help boost the chances of increasing the price or attracting people into trading them.  Navigating Social Signals To Buy Good Coins On Solana Beyond market cap considerations, a crucial aspect of meme coin trading is community engagement. A vibrant community can drive trading activity, contributing to a coin&#8217;s success. Check X (formerly Twitter) and other social platforms for discussions around the meme coin of interest.  An active community that posts updates and engages with its audience adds credibility to the project. People get more excited and motivated when they keep seeing people talk about them, this is where the FOMO (Fear Of Missing Opportunity) comes into play.  Related Reading: Bitcoin Millionaires Rise By 246% In 2023, Here’s How Many There Are Guarding Against Rug Pulls On Solana Network While pump and dump dynamics are inherent in meme coin trading, the specter of rug pulls adds an extra layer of risk. A rug pull occurs when the creators of a meme coin remove liquidity, rendering the coin untradable and leaving investors with a worthless asset. Rug pulls often go undetected until they happen, making due diligence crucial when selecting meme coins for trading. You can never be too careful about them, this is why it&#8217;s advisable to trade with what you can afford to lose. Additionally, there are scanners that provide some layer of security for investors by carrying out a rudimentary rug pull check. They check for common features of rug pull and honey pot contracts such as the inability to sell after buying, high taxes on transactions, etc. Examples of these tools include the Smart Contract Scanner by De.Fi. Choosing the Right Solana DEX The Solana ecosystem boasts various decentralized exchanges, each with its unique features. Jupiter Exchange, Raydium, Birdeye, and Orca are among the prominent options. Platforms like Birdeye also provide charting capabilities, simplifying the decision-making process for traders.  Some of the charts make trading meme coins easier as they have the contract addresses of the meme coins, but to be sure, it is advisable to check their Twitter because they can be fake copies of these meme coins that might want to take advantage of the meme coin hype and rug.  Related Reading: Billionaire Tim Draper Predicts When The Bitcoin Price Will Reach $250,000 Executing Your First Solana Meme Coin Trade With SOL secured in your phantom wallet and a meme coin identified, it&#8217;s time to execute your first trade. Obtaining the contract address from the meme coin&#8217;s Twitter page is an essential step in the trading process.  Connect your Phantom wallet to the chosen Solana DEX, input the contract address where you are supposed to swap for SOL, and initiate the swap, converting SOL to the selected meme coin. Alternatively, utilize Dexscreener to locate the &#8220;Trade On X&#8221; icon, where &#8220;X&#8221; represents the DEX for the Solana meme coin. A click directs you to a tab where the contract address is pre-filled, streamlining the trading process.  This makes it easier to trade, and saves you time, should, in case, you want to trade at launch to catch the best prices.  Related Reading: Harmony To See Redemption? Analyst Predicts Meteoric 650% Rise For ONE Token Risk Management And Future Trades Prudent risk management is essential in meme coin trading. Avoiding the &#8220;MAX&#8221; button ensures you retain SOL for transaction fees during future trades. Consider allocating a portion of your SOL rather than risking the entire amount, providing flexibility for subsequent transactions. Remember to always trade with what you can afford to lose, so you don&#8217;t lose all your money. Monitoring And Expanding Your Solana Portfolio Congratulations, you&#8217;ve completed your first Solana meme coin trade! Now, whether you choose to monitor the chart for price progress or explore additional meme coin opportunities on Dexscreener, stay informed.  Analyze trading activity, distinguishing between buying and selling actions – greens for buying, reds for selling. This analysis aids in making informed decisions, allowing you to stay ahead in the dynamic world of meme coin trading. Conclusion In conclusion, navigating the realm of Solana meme coin trading requires a blend of market awareness, community engagement, and strategic decision-making. By understanding the fundamentals, conducting thorough research, and implementing sound risk management practices, you can unlock the potential for profitable meme coin trades on the Solana blockchain. Related Reading: Crypto Analyst Predicts XRP Price Will Hit $1.33 ‘Pretty Fast’ As the crypto landscape continues to evolve, staying informed and adaptable will be key to success in this dynamic market. Happy trading! SOL price falls to $107  Source: SOLUSD On Tradingview.com Featured image from Facts.net, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-27T21:07:28.000Z",
    "title": "Unlocking the Future: How a Bitcoin ETF Could Propel BTC Beyond $100K",
    "url": "https://www.crypto-news-flash.com/unlocking-the-future-how-a-bitcoin-etf-could-propel-btc-beyond-100k/?utm_source=rss&utm_medium=rss&utm_campaign=unlocking-the-future-how-a-bitcoin-etf-could-propel-btc-beyond-100k",
    "description": "<img width=\"1000\" height=\"666\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />A Bitcoin spot ETF would make it easier than ever for baby boomers to invest in the crypto, appealing to a demographic that typically only invests in products with the highest regulation. It would also give Bitcoin the clearest regulatory validation since the SEC, CFTC, and Congress have all failed to issue policy directions for [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-27T21:00:04.000Z",
    "title": "Incoming Ethereum ‘God Candle’ Will Catch Many off Guard, Says Crypto Analyst – Here’s His Outlook",
    "url": "https://dailyhodl.com/2023/12/27/incoming-ethereum-god-candle-will-catch-many-off-guard-says-crypto-analyst-heres-his-outlook/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/god-candle-will-catch.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/god-candle-will-catch.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/12/god-candle-will-catch.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/god-candle-will-catch.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/god-candle-will-catch.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/god-candle-will-catch.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/12/god-candle-will-catch.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto trader believes that Ethereum (ETH) is gearing up for a sudden massive move to the upside that will take many by surprise. Pseudonymous crypto analyst Inmortal tells his 203,700 followers on the social media platform X that Ethereum could soon approach the $3,000 level, a more than 34% increase from its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/27/incoming-ethereum-god-candle-will-catch-many-off-guard-says-crypto-analyst-heres-his-outlook/\">Incoming Ethereum ‘God Candle’ Will Catch Many off Guard, Says Crypto Analyst – Here’s His Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-27T20:55:10.000Z",
    "title": "New Whales Suddenly Accumulate Chainlink (LINK) and One Additional Ethereum-Based Altcoin: Lookonchain",
    "url": "https://dailyhodl.com/2023/12/27/new-whales-suddenly-accumulate-chainlink-link-and-one-additional-ethereum-based-altcoin-lookonchain/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Chainlink-Offers-a-Proof-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Chainlink-Offers-a-Proof-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Chainlink-Offers-a-Proof-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Chainlink-Offers-a-Proof-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Chainlink-Offers-a-Proof-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Chainlink-Offers-a-Proof-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Chainlink-Offers-a-Proof-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Deep-pocketed investors are suddenly scooping up massive amounts of Chainlink (LINK) and one other Ethereum (ETH)-based altcoin, according to on-chain data. The blockchain data tracker Lookonchain noticed that newly created crypto whale wallets were accumulating two digital assets Wednesday using the top global crypto exchange Binance. One crypto whale scooped up more than $4 million [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/27/new-whales-suddenly-accumulate-chainlink-link-and-one-additional-ethereum-based-altcoin-lookonchain/\">New Whales Suddenly Accumulate Chainlink (LINK) and One Additional Ethereum-Based Altcoin: Lookonchain</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]