[
  {
    "source": "Cointelegraph",
    "date": "2024-02-23T22:30:00.000Z",
    "title": " Bitcoin halving ‘blood bath’ could push US miners offshore ",
    "url": "https://cointelegraph.com/news/bitcoin-btc-halving-could-move-mining-out-united-states",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZTIzNmZiNzYtYjZlMS00OTYwLWI4ZTQtMzE4OWUwZTdlMmE5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Hashlabs Mining co-founder and chief mining strategist Jaran Mellerud said Ethiopia, Nigeria, Kenya, Argentina and Paraguay could pick up more hash rate in the coming years.</p>\n                    <p><p data-ct-non-breakable=\"true\">Potential sluggishness in the price of Bitcoin after the Bitcoin halving could tank the share prices of high-cost public miners in the United States, forcing some to even move offshore.</p><p>“We might see a mining stock blood bath as investors realize these companies are barely making money,” says Jaran Mellerud, founder and chief mining strategist of Hashlabs Mining, referring to what could happen if the Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price doesn’t rise substantially <a href=\"https://cointelegraph.com/learn/bitcoin-halving-2024\">after the halving</a>. </p><p>Mellerud is now eyeing the three to four-month window after the halving to see the extent to which miner profitability is pressured by the slashing of block rewards.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-btc-halving-could-move-mining-out-united-states\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2024-02-23T22:26:59.000Z",
    "title": "Whale Activity Sparks Curiosity As ALT Token Surges Over 95% In Last 30 Days",
    "url": "https://nulltx.com/whale-activity-sparks-curiosity-as-alt-token-surges-over-95-in-last-30-days/",
    "description": "A recent substantial withdrawal of ALT tokens from Binance, a leading cryptocurrency exchange, by a whale address unaffiliated with a centralized exchange (CEX) or team, has sparked intrigue within the crypto investor community. This significant transaction occurred amidst a remarkable surge of nearly 10% witnessed in Altlayer&#8217;s native token, ALT, [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-23T22:13:30.000Z",
    "title": "AxieInfinity Co-Founder’s Wallets Compromised In $10.46M Hack",
    "url": "https://nulltx.com/axieinfinity-co-founders-wallets-compromised-in-10-46m-hack/",
    "description": "In a recent revelation, Jeffrey Zirlin, the co-founder of axieinfinity and the Ronin network, disclosed that two of his wallets fell victim to a hacking incident on Friday. This has been a tough morning for me.  Two of my addresses have been compromised. The attack is limited to my personal [&#8230;]"
  }
]