[
  {
    "source": "Decrypt",
    "date": "2024-01-18T21:02:43.000Z",
    "title": "Bitcoin Plunges 12% in 7 Days as BlackRock Collects $1.1 Billion From ETF",
    "url": "https://decrypt.co/213422/bitcoin-price-down-blackrock-1-billion-etf",
    "description": "BlackRock's Bitcoin ETF has broken records—but BTC's price is down bad since the historic launch of the long-awaited investment vehicles."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-18T21:01:02.000Z",
    "title": "‘Crypto Unicorns’ Game Ditching Polygon for Arbitrum’s Xai Network",
    "url": "https://decrypt.co/213416/crypto-unicorns-game-ditching-polygon-arbitrum-xai-network",
    "description": "Following last week’s XAI token airdrop, Arbitrum gaming network Xai will add Crypto Unicorns and related NFT games from Polygon."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-18T20:51:40.000Z",
    "title": "Half of Game Devs Use AI, But Creatives Are Wary: Survey",
    "url": "https://decrypt.co/213411/half-game-developers-use-ai-designers-worried-jobs",
    "description": "84% of developers raise ethical concerns, with AAA studios more likely to have AI policies, according to Game Developer."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-18T21:01:55.000Z",
    "title": " XRP price falls near critical support level as Bitcoin and crypto market correct ",
    "url": "https://cointelegraph.com/news/xrp-price-falls-near-critical-support-level-as-bitcoin-and-crypto-market-correct",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvM2UzY2RmNzktZmU0ZS00YTRjLWEyYTYtYTIyOTBlNjA0MDM2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>XRP price corrects as investors book profits and hope for a spot XRP ETF crumbles. </p>\n                    <p><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) price has dropped 10% in January, as investors book profits and broader bearish sentiment takes over the cryptocurrency market.</p><p>XRP price now appears primed for further losses in the short term, primarily due to a classic bearish pattern.</p><p>On Jan. 3, XRP broke below the support line of a descending triangle at $0.5934, risking a 17% correction. </p><p><a href=\"https://cointelegraph.com/news/xrp-price-falls-near-critical-support-level-as-bitcoin-and-crypto-market-correct\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-18T20:49:38.000Z",
    "title": "Roundhill introduces covered call Bitcoin ETF, a first for the U.S. market",
    "url": "https://cryptoslate.com/roundhill-introduces-covered-call-bitcoin-etf-a-first-for-the-u-s-market/",
    "description": "<p>Asset manager Roundhill has introduced the first covered call Bitcoin ETF in the U.S. market, according to a press release on Jan. 18. The exchange-traded fund is called the Roundhill Bitcoin Covered Call Strategy ETF. It trades under the ticker &#8220;YBTC&#8221; on the Cboe BZX exchange. Dave Mazza, Chief Strategy Officer at Roundhill Investments, said: [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/roundhill-introduces-covered-call-bitcoin-etf-a-first-for-the-u-s-market/\">Roundhill introduces covered call Bitcoin ETF, a first for the U.S. market</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-18T20:41:50.000Z",
    "title": "Electric Capital’s 2023 Crypto Developer Report: Future Trends in Blockchain Technology",
    "url": "https://www.cryptoglobe.com/latest/2024/01/electric-capitals-2023-crypto-developer-report-future-trends-in-blockchain-technology/",
    "description": "Electric Capital’s 2023 Crypto Developer Report presents an insightful analysis of the current state of blockchain development. Released on 17 January 2024, the report is based on an extensive study of open-source repositories. Developer Trends: A Mixed Picture Electric Capital’s report, which examined a staggering 485 million code commits across 818k open-source repositories, reveals a […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-18T21:00:07.000Z",
    "title": "Vitalik Buterin Debates Over Blockchain Scaling Terminology",
    "url": "https://news.bitcoin.com/vitalik-buterin-debates-over-blockchain-scaling-terminology/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/vitalik_buterin_debate_validium-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Vitalik Buterin Weighs in on Ethereum Layer-Two Inclusion\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/vitalik_buterin_debate_validium-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/vitalik_buterin_debate_validium-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/vitalik_buterin_debate_validium-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/vitalik_buterin_debate_validium-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/vitalik_buterin_debate_validium-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/vitalik_buterin_debate_validium-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/vitalik_buterin_debate_validium.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Amid the rapidly evolving Ethereum ecosystem, Vitalik Buterin has rejoined the debate on the classification of layer-two scaling solutions, putting the spotlight on the security and scalability trade-offs between rollups and validiums. Vitalik Buterin Weighs in on Ethereum Layer-Two Inclusion Ethereum co-founder Vitalik Buterin has once again returned to a discussion within the blockchain community [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T21:06:05.000Z",
    "title": "Bitcoin bulls propel U.S. ETFs to historic launch numbers",
    "url": "https://www.cryptopolitan.com/bitcoin-bulls-propel-us-etfs-to-new-highs/",
    "description": "The Bitcoin year 2024 has witnessed a remarkable surge in the launch of Exchange-Traded Funds (ETFs) in the United States, setting an early record for the industry. This notable development can be attributed, in part, to the growing influence of digital assets, particularly spot bitcoin funds, which have played a pivotal role in shaping investment [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T20:42:38.000Z",
    "title": "Tech titans set to rescue the global market from the 2024 slump",
    "url": "https://www.cryptopolitan.com/tech-to-rescue-the-globe-from-the-2024-slump/",
    "description": "As industries grapple with global uncertainties and shifting paradigms, tech shows emerge as pivotal catalysts in steering the market out of a tough start. A surge in some of the world&#8217;s greatest tech companies fuelled a stock rebound, with traders also looking to the latest economic data and Fedspeak for hints on the US central [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T20:40:00.000Z",
    "title": "U.S. jobless claims at the lowest they have been since 2022",
    "url": "https://www.cryptopolitan.com/us-jobless-claims-at-the-lowest-since-2022/",
    "description": "Defying the usual economic forecasts and leaving analysts scratching their heads, U.S. unemployment claims have plummeted to their lowest level since the latter part of 2022. In a striking show of labor market strength, initial claims for unemployment benefits in the U.S. took a sharp dive, landing at 187,000 for the week ending January 13. [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-18T21:01:07.000Z",
    "title": "RIPPLE PRICE ANALYSIS & PREDICTION (January 18) – XRP Signals More Drops But Trapped In This Demand Zone, Down 7% Weekly",
    "url": "https://nulltx.com/ripple-price-analysis-prediction-january-18-xrp-signals-more-drops-but-trapped-in-this-demand-zone-down-7-weekly/",
    "description": "Since Ripple entered a crucial demand zone this month, the price has remained trapped. However, it paints a gloomy picture on the daily chart with a potential breakdown. The price may roll back to the bottom. Following past months of bearish, XRP has lost over 30% of its valuation in [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-18T20:52:30.000Z",
    "title": "POLKADOT PRICE ANALYSIS & PREDICTION (January 18) – DOT Eyes $6.5 In The Upcoming Drawdown, Will This Price Level Produce A Rebound?",
    "url": "https://nulltx.com/polkadot-price-analysis-prediction-january-18-dot-eyes-6-5-in-the-upcoming-drawdown-will-this-price-level-produce-a-rebound/",
    "description": "Following a sharp rejection last week, Polkadot dropped and resumed selling this week but has remained calm in the past hours due to an extreme drop in volatility. We can expect a big drop if an expansion occurs.  During the last short-term bullish rally, Polkadot formed an “inverse head and [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-18T21:00:29.000Z",
    "title": "Bitcoin Price In Danger? This Terrible Story Could Happen Again",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-price-in-danger-this-terrible-story-could-happen-again/",
    "description": "The Bitcoin price has been moving steadily at its current but failed to meet general expectations. Following the approval of the spot Bitcoin Exchange Traded Funds (ETFs), market participants were expecting potential scenarios. Related Reading: Why Is Bitcoin Price Trading Sideways? 3 Key Factors In these potential scenarios, Bitcoin pushed through critical resistance at $48,000 and continued making new highs, or the cryptocurrency retraced to $30,000. As usual, the market has avoided pleasing the crowd as BTC trades at $42,000. Bitcoin Price Ready To Dip? The spot BTC ETFs have been influencing the market; the capital flows from these financial products have been used to suppress the cryptocurrency. A pseudonym analyst has been keeping track of crypto exchange Coinbase to connect the flows with the Bitcoin price action. Since its initial launch on January 11, the BTC flows into Coinbase have increased. This trading venue is key due to its role as Custodian in most spot Bitcoin ETFs filed with the US SEC. Thus, asset managers who want to buy or sell BTC go to Coinbase. The exchange sees fluctuations in its Bitcoin price in the spot market compared to other exchanges. As the trading volume on Coinbase has increased since the spot Bitcoin ETFs launch, the platform records some of its highest activity. In the meantime, the Bitcoin price trends sideways. The pseudonym analyst stated: (…) supply is coming from somewhere, obviously gbtc and maybe some others, like cme futures, anyways, whats most important is coinbase is still trading discount compared to other spot venues and thats very weak, unless you&#8217;re managing billions $, you can probably wait to fomo once coinbase is dragging market up instead of dripping sells. Another crypto analyst echoed these words; the chart below shows that the Coinbase Premium Gap signals strong selling pressure. If history repeats, the metric hints at a fierce crash for Bitcoin. In that sense, the analyst recommends “patience” while Bitcoin moves sideways and the Coinbase Premium Gap signals a potential dip into support. Bitcoin ETFs Breaking Record A report from Reuters indicates that the spot Bitcoin ETFs attracted almost $2 billion in their first few days of trading. BlackRock and Fidelity led these capital inflows and will maintain them depending on their fee structure, CEO of CF Benchmarks Sui Chung claims, while adding: Those that charge the lower management fees will unsurprisingly make themselves more appealing compared to their peers. Brand recognition is another core aspect. Related Reading: Bitcoin Sees Massive Sell-Off From Miners, As Price Holds Steady However, several experts have questioned these flows, which disputed the numbers. Three days after the ETFs launched, NewsBTC reported $800 million in new inflows based on a report by Eric Balchunas, ETF expert for Bloomberg Intelligence. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-18T21:00:30.000Z",
    "title": "Solana Primed To Outperform Ethereum by up to 5x, According to Glassnode Co-Founders – Here’s the Timeline",
    "url": "https://dailyhodl.com/2024/01/18/solana-primed-to-outperform-ethereum-by-up-to-5x-according-to-glassnode-co-founders-heres-the-timeline/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/solana-primes-outperform-glassnode.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/solana-primes-outperform-glassnode.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/solana-primes-outperform-glassnode.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/solana-primes-outperform-glassnode.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/solana-primes-outperform-glassnode.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/solana-primes-outperform-glassnode.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/solana-primes-outperform-glassnode.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The co-founders of the crypto analytics firm Glassnode think Solana (SOL) could outperform Ethereum (ETH) by up to 5x in the current bull run. Glassnode co-founders Jan Happel and Yann Allemann, who share the Negentropic handle on the social media platform X, say the SOL/ETH chart suggests the SOL/ETH ratio could surge. &#8220;In other words, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/18/solana-primed-to-outperform-ethereum-by-up-to-5x-according-to-glassnode-co-founders-heres-the-timeline/\">Solana Primed To Outperform Ethereum by up to 5x, According to Glassnode Co-Founders – Here’s the Timeline</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-18T20:55:43.000Z",
    "title": "Crypto Trader Updates Outlook on Bitcoin (BTC) Bull Market Progress, Calls Move Up for Solana (SOL)",
    "url": "https://dailyhodl.com/2024/01/18/crypto-trader-updates-outlook-on-bitcoin-btc-bull-market-progress-calls-move-up-for-solana-sol/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/sol-btc-top.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/sol-btc-top.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/sol-btc-top.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/sol-btc-top.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/sol-btc-top.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/sol-btc-top.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/sol-btc-top.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is updating his strategy on Bitcoin (BTC) as the crypto king&#8217;s next halving approaches. Pseudonymous crypto trader Rekt Capital tells his 388,300 followers on the social media platform X that BTC is likely to wrestle with resistance for the next few months. &#8220;The Macro Diagonal continues to act as resistance History [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/18/crypto-trader-updates-outlook-on-bitcoin-btc-bull-market-progress-calls-move-up-for-solana-sol/\">Crypto Trader Updates Outlook on Bitcoin (BTC) Bull Market Progress, Calls Move Up for Solana (SOL)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]