[
  {
    "source": "Decrypt",
    "date": "2023-06-13T20:28:56.000Z",
    "title": "Bitcoin Will ‘10X’ With Regulatory Clarity, Says Michael Saylor",
    "url": "https://decrypt.co/144465/bitcoin-will-10x-with-regulatory-clarity-says-michael-saylor",
    "description": "The head of MicroStrategy says it’s time to accept that ‘Bitcoin is the next Bitcoin.’"
  },
  {
    "source": "Decrypt",
    "date": "2023-06-13T20:15:44.000Z",
    "title": "Adidas Reveals Sneaker Collab With NFT Artist Fewocious",
    "url": "https://decrypt.co/144457/adidas-reveals-sneaker-collab-nft-artist-fewocious",
    "description": "Fewocious, a prominent Web3 artist, has teamed with the apparel giant to launch the Adidas Originals Campus 00s via NFT redemption ticket."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-13T20:15:00.000Z",
    "title": "Are NFTs the Next SEC Target?",
    "url": "https://decrypt.co/videos/interviews/YaGgY87J/are-nfts-the-next-sec-target",
    "description": "Decrypt's Kate Irwin discusses the current regulatory climate in the U.S. with Gala Games' President of Blockchain Jason Brink."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-13T20:35:00.000Z",
    "title": "Footwear conglomerate Puma launches 3D Web3 experience",
    "url": "https://cointelegraph.com/news/footwear-conglomerate-puma-launches-3d-web3-experience",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/77668118-1954-40fb-ade5-31cfc70a1bac.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The experience is designed for everyone but Puma Pass holders gain access to exclusive perks. </p>\n                    <p><p>On June 13, German footwear conglomerate Puma <a href=\"https://blackstation.puma.com/\" target=\"_blank\" rel=\"noopener nofollow\">launched</a> its 3D metaverse experience Black Station. As told by developers, Black Station is an \"experiential home\" for product drops built to provide \"unbridled access\" for Puma Pass nonfungible token (NFT) holders.</p><p>The firm says that the experience is for everyone to explore, but only those possessing RB tokens airdropped to Puma Pass holders can purchase a digital \"Rulebreaker\" sneaker and claim two digital wearables. At the time of publication, RB tokens currently have a price tag of 0.0125 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). Developers wrote:</p><blockquote>\"If you do not own an RB token there is still so much to explore. Unkai, our city in the clouds, and Unter, our exhilarating club below, both are filled with mysteries to explore and collect.\"</blockquote><p>Holders of the RB Token can burn them between June 13-20 on Black Station, granting their parent wallet access to various product drops on the metaverse. According to its roadmap, Black Station will have a few more general events and NFT drops this year, with 2024 events still in development.</p><p>The experience remains open until June 23. Previously, Puma stated it was exploring alternative chains, but nevertheless decided to remain on Ethereum. It is also possible to purchase digital collectibles via credit card in addition to connecting one's wallet and using ETH.</p><p>Cointelegraph reported in February 2022 that <a href=\"https://cointelegraph.com/news/puma-rebrands-to-puma-eth-on-twitter\">Puma registered an Ethereum Name Service</a> domain and changed its Twitter name to Puma.eth. At the time, Puma had invested in various feline-inspired NFT collections, including Cool Cats NFT, Lazy Lions, Gutter Cat Gang, and CatBlox.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Black Station is now LIVE! ⚡️<br><br>PUMA’s digital experience reveals new limited edition shoes in an entirely new light...<br><br>Explore UNKAI &amp; UNTER for yourself and discover the mysteries of these worlds <br><br>ENTER EXPERIENCE: <a href=\"https://t.co/5EXphtTxSA\">https://t.co/5EXphtTxSA</a> <a href=\"https://t.co/lRpOFw0nqe\">pic.twitter.com/lRpOFw0nqe</a></p>&mdash; PUMA.eth (@PUMA) <a href=\"https://twitter.com/PUMA/status/1668607969192443904?ref_src=twsrc%5Etfw\">June 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/nonfungible-tokens/\">Nonfungible Tokens - The Quick Guide</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-13T20:16:06.000Z",
    "title": "SBF seeks to sever new charges from trial, says proceedings may take 'years'",
    "url": "https://cointelegraph.com/news/sbf-seeks-to-sever-new-charges-from-trial-says-proceedings-may-take-years",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/aa20e65b-af82-4c55-8228-76927cef2c20.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The U.S. cannot try Sam Bankman-Fried for the charges until a lengthy appeals process in The Bahamas has been exhausted, defense attorneys stated.</p>\n                    <p><p>Attorneys for former FTX CEO Sam Bankman-Fried (also known as “SBF”) are seeking to <a href=\"https://docs.google.com/viewer?url=https%3A%2F%2Fstorage.courtlistener.com%2Frecap%2Fgov.uscourts.nysd.590940%2Fgov.uscourts.nysd.590940.158.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">sever</a> or dismiss six charges from his upcoming trial, claiming that it may take years for courts in The Bahamas to rule on whether they will allow him to be tried for these offenses, according to a June 12 document filed in a New York federal court.</p><p>Prosecutors acknowledged on May 29 that they <a href=\"https://cointelegraph.com/news/some-sbf-charges-will-be-dropped-if-bahamas-objects-u-s-prosecutors-say\">need permission from The Bahamas</a> to try Bankman-Fried for five of the charges he was indicted for since these offenses were not included in the original agreement that allowed him to be extradited to the United States. However, prosecutors stated they were seeking permission from the Bahamanian government to try him for these additional offenses.</p><p>In response, SBF’s lawyers on June 12 said they had asked The Bahamas Supreme Court to block the government from granting this permission except in accordance with the law. The Bahamas Court is expected to respond by June 13. In the meantime, the Supreme Court has told a minister in the executive branch not to issue a judgment on the issue, defense attorneys said. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/1345f1aa-81b7-4ff6-979a-01ceb9870e2f.png\"  /><figcaption style=\"text-align: center;\"><em>Excerpt from defense attorneys' June 12 filing. Source: CourtListener</em></figcaption></figure><p>According to the defense, even if the unnamed minister were to provide permission to charge SBF with additional offenses, the defendant would have the right to appeal this decision through The Bahamas courts. This means the process would \"likely take several months or years to resolve.” In the meantime, the charges should be dismissed, as they are used to detain the defendant under house arrest.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/sbf-upset-by-late-evidence-in-trail-ftx-seeks-ai-stock-sale\"><strong>SBF upset by criminal trial’s late evidence while FTX seeks sale of AI stock</strong></a></em></p><p>Defense attorneys also provided an alternative solution to the problem: If the Supreme Court feels that it can’t dismiss the charges, it should sever them from the upcoming trial. This would allow Bankman-Fried to be tried on the seven charges he agreed to be extradited on, but none other.</p><p>Bankman-Fried was originally <a href=\"https://cointelegraph.com/news/indictment-against-sbf-unsealed-contains-8-counts-of-financial-and-elections-fraud\">charged in December</a> in connection with his management of the failed crypto exchange, FTX. Prosecutors allege that he commingled customer funds and misled investors about FTX’s risk management practices, leading to losses for investors and customers. <a href=\"https://cointelegraph.com/news/sam-bankman-fried-i-didn-t-steal-funds-and-i-certainly-didn-t-stash-billions-away\">Bankman-Fried claims</a> the exchange collapsed because of ordinary management mistakes, not fraud.</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T20:24:14.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  }
]