[
  {
    "source": "CoinDesk",
    "date": "2023-10-23T08:24:59.000Z",
    "title": "Sam Altman's Worldcoin Switches Orb Rewards Plan to Boost WLD Supply",
    "url": "https://www.coindesk.com/markets/2023/10/23/sam-altmans-worldcoin-switches-orb-rewards-plan-to-boost-wld-supply/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Users will receive WLD tokens, instead of USDC, starting Tuesday, as per a new developer document."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-23T08:20:54.000Z",
    "title": "Lawmaker Tom Emmer Throws Hat in Ring for House Speaker Role",
    "url": "https://www.coindesk.com/policy/2023/10/23/lawmaker-tom-emmer-throws-hat-in-ring-for-house-speaker-role/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Congressman Tom Emmer, who's sponsored a number of crypto-related bills over the past few years and is a member of the Congressional Blockchain Caucus, said he's considering a bid for the vacant Speaker of the House position."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-23T08:16:03.000Z",
    "title": "BTC price nears 2023 highs — 5 things to know in Bitcoin this week",
    "url": "https://cointelegraph.com/news/btc-price-nears-2023-highs-5-things-bitcoin-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/b5cff161-9fc1-43de-81d7-3c6659755a01.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin is back near its year-to-date highs, but BTC price moves belie an underlying lack of support, analysis fears.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) starts the last week of October in classic style as 3% BTC price gains take cryptocurrency markets higher.</p><p>In what could yet turn out to be a classic “Uptober” for Bitcoin and altcoins, BTC/USD is back near 2023 highs as a resistance battle brews. Can bulls win?</p><p>That is the key question for traders and market observers going into the week’s first Wall Street open as Asia sets the tone for a crypto comeback.</p><p>Given the extent of resistance to overcome, however, traders are playing it safe — lofty BTC price predictions are less evident than might be expected, and few believe that the road beyond $32,000 will open up quickly or easily.</p><p>Bitcoin must also dodge potential headwinds in the form of macroeconomic data prints at a time when inflation continues to beat expectations.</p><p>Ahead of the United States Federal Reserve’s interest rate decision on Nov. 1, the month’s final prints will be all the more significant. Geopolitical events meanwhile add another element to market unpredictability.</p><p>With much at stake for crypto and risk assets, the week thus looks to be a rollercoaster in the making as Bitcoin bulls seek to effect a major trend change via a breakout from a multi-month trading range.</p><h2>RSI gives Bitcoin traders cold feet over rally</h2><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/f9a22b7c-2ebc-4c91-aa64-be1fbd4fed31.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day chart. Source: TradingView</em></figcaption></figure><p>As Cointelegraph <a href=\"https://cointelegraph.com/news/crypto-traders-bitcoin-price-3-month-high-31k\">reported</a>, these three-month highs are being treated with suspicion by some traders, who see breaking through $32,000 as a difficult challenge.</p><p>“Well on it's way towards the top of the 2023 range,” popular trader Daan Crypto Trades <a href=\"https://twitter.com/DaanCrypto/status/1716115443356774750/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">summarized</a> on X on the day.</p><blockquote>“$31K-32K won't be easy to break through but upon doing so I would be targeting $38K next. Remains range-bound until then.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/e5cd2dc7-d772-4ff6-a8d7-4f8ea2da08e9.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Daan Crypto Trades/X</em></figcaption></figure><p>With hours to go until the Wall Street open, BTC/USD is now retreating from the highs, on the way back toward the $30,000 mark.</p><p>Analyzing the odds of a deeper drawdown, popular trader Ali drew attention to relative strength index (RSI) readings.</p><p>“An impending price correction appears to be on the horizon unless BTC manages to clock a daily candlestick close above $31,560,” part of his comments <a href=\"https://twitter.com/ali_charts/status/1716054966505193805/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">warned</a>.</p><p>At 77 on Oct. 23, RSI was already at levels which Ali noted had triggered “sharp corrections” since March this year. As a rule, anything above 70 is considered \"overbought.\" </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/1639931f-6f00-4c98-91c2-5a2d905decaa.jpeg\"  /><figcaption style=\"text-align: center;\">BTC/USD chart with RSI. Source: Ali/X</figcaption></figure><p>Others were freely optimistic, among the Philip Swift, co-founder of trading suite DecenTrader and creator of statistics resource Look Into Bitcoin.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a> +$30k.<br><br>Goodbye bears.</p>&mdash; Philip Swift (@PositiveCrypto) <a href=\"https://twitter.com/PositiveCrypto/status/1716354571830735114?ref_src=twsrc%5Etfw\">October 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Popular trader CredibleCrypto meanwhile described a Bitcoin breakout as “almost there.” Updating an idea originally from late August, he suggested that $30,000 was the key level to break for a trend change.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Almost there... <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> <a href=\"https://t.co/13X3yX7Bib\">https://t.co/13X3yX7Bib</a></p>&mdash; CrediBULL Crypto (@CredibleCrypto) <a href=\"https://twitter.com/CredibleCrypto/status/1716279068415717624?ref_src=twsrc%5Etfw\">October 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Bitcoin saw a strong start to the last week of “Uptober” with a trip to near $31,000, data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> shows.</p><h2>PCE and GDP due in run-up to FOMC</h2><p>Personal Consumption Expenditures (PCE) Index data headlines the U.S. macro diary this week — and the timing is conspicuous.</p><p>The Fed is due to meet to decide on interest rate policy on Nov. 1, and as one of its preferred inflation metrics, PCE is being keenly eyed for cues by markets. Q3 GDP is also due.</p><p>Despite previous recent data prints persistently coming in higher than expected, underscoring sticky inflation, the odds of further rate hikes remain negligible. Per data from CME Group’s <a href=\"https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html\" target=\"_blank\" rel=\"noopener nofollow\">FedWatch Tool</a>, there is even a 1.6% chance of a rate cut by the Federal Open Market Committee (FOMC) next week.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/36157a6b-d74c-499b-9221-fc41e7c71745.png\"  /><figcaption style=\"text-align: center;\"><em>Fed target rate probabilities chart. Source: CME Group</em></figcaption></figure><p>“Meanwhile, earnings season is in full swing and Fed speculation continues. Volatility is great for traders,” financial commentary resource The Kobeissi Letter wrote in part of commentary on the week’s macro diary.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Key Events This Week:<br><br>1. Building Permits - Wednesday<br><br>2. New Home Sales - Wednesday<br><br>3. Fed Chair Powell Speaks - Wednesday<br><br>4. Q3 2023 GDP - Thursday<br><br>5. Pending Home Sales - Thursday<br><br>6. September PCE Inflation data - Friday<br><br>We are 1 week out from the November Fed meeting.</p>&mdash; The Kobeissi Letter (@KobeissiLetter) <a href=\"https://twitter.com/KobeissiLetter/status/1716076897031913823?ref_src=twsrc%5Etfw\">October 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Skew and others are meanwhile eyeing U.S. dollar strength, with the U.S. dollar index (DXY) cooling the rampant uptrend which began in mid-July.</p><p>“Looking for trend continuation or clear break of 1D trend some time this week or into November,” part of comments <a href=\"https://twitter.com/52kskew/status/1716271044548563143\" target=\"_blank\" rel=\"noopener nofollow\">stated</a>.</p><p>Skew added that a “major move” should come soon.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/39939c42-882d-4072-be4e-70622831e09f.png\"  /><figcaption style=\"text-align: center;\"><em>U.S. dollar index (DXY) 1-day chart. Source: TradingView</em></figcaption></figure><h2>Exchange balances show \"clear trend\"</h2><p>The trend of declining BTC balances on exchanges is <a href=\"https://cointelegraph.com/news/bitcoin-exchanges-same-btc-supply-late-2017\">frequently reported on</a> as it hits levels not seen since 2018.</p><p>According to the latest data from on-chain analytics platform <a href=\"https://cryptoquant.com/asset/btc/chart/exchange-flows/exchange-reserve?exchange=all_exchange&amp;window=DAY&amp;sma=0&amp;ema=0&amp;priceScale=log&amp;metricScale=linear&amp;chartStyle=line\" target=\"_blank\" rel=\"noopener nofollow\">CryptoQuant</a>, the major trading platforms now have a combined BTC balance of 2.024 million BTC.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/b48cb4f6-8d04-433d-995a-904de12cdad3.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin exchange BTC reserves chart. Source: CryptoQuant</em></figcaption></figure><p>The FTX meltdown in November 2022 hastened the pace of balance reduction, and despite the BTC price recovery this year, the trend has yet to reverse direction in step.</p><p>Now, exchange deposits are at year-to-date lows, James Straten, research and data analyst at crypto insights firm CryptoSlate, notes.</p><p>“Since Bitcoin started, deposits consistently outpaced withdrawals. However, with the FTX collapse in Nov '22 and the SVB crisis in Mar '23, the trend flipped for the first time,” part of an X post at the weekend <a href=\"https://twitter.com/jimmyvs24/status/1716181789021020575/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">read</a>. </p><blockquote>“Now, with deposits hitting YTD lows and withdrawals stable yet high, a clear trend emerges: coins are steadily leaving exchanges.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/ed73e080-5671-4f1c-8a6b-9299079b9fbb.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin exchange transaction dominance chart. Source: James Straten/X</em></figcaption></figure><p>An accompanying chart showed the proportion of BTC transactions involving exchanges, these accounting for 36% of the total.</p><h2>Bitcoin \"newbies\" absent this month</h2><p>BTC price action, while advantageous for market sentiment, is displaying “artificial” characteristics, CryptoQuant research warns.</p><p>In one of its <a href=\"https://cryptoquant.com/insights/quicktake/65350e911d9cbe2df4836af0-BTCs-price-seems-to-be-artificially-rising-without-newbies\" target=\"_blank\" rel=\"noopener nofollow\">Quicktake</a> market updates on Oct. 22, contributor SignalQuant revealed low numbers of new market entrants over the past month.</p><p>SignalQuant used the Sum Coin Age Distribution metric — a method of separating newer and older unspent transaction output (UTXO) data.</p><p>“Interestingly when this indicator spikes, it is a turning point for BTC’s price in the long term,” he wrote about outputs between one week and month old, corresponding to market “newbies.”</p><blockquote>“In fact, the 1w~1m entry trend indicator was above the baseline when BTC’s price hit its low in late '18, when it hit its low in late '22, and after Mar '20 Covid crash. But now, instead of heading towards the baseline, it's staying low.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/d99158d0-4025-4930-93fd-a9de4557a4cd.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Sum Coin Age Distribution annotated chart. Source: CryptoQuant</em></figcaption></figure><p>SignalQuant concluded that while no single indicator can provide an overall explanation of market behavior, the Coin Sum data was “too significant to ignore.”</p><p>Previously, Cointelegraph noted that long-term holders now control <a href=\"https://cointelegraph.com/news/bitcoin-long-term-investors-own-76-percent-btc\">more of the BTC supply</a> than ever before.</p><h2>Market fear absent in a “scary area” for Bitcoin</h2><p>After an extended period of barely any movement, the <a href=\"https://alternative.me/crypto/fear-and-greed-index/\" target=\"_blank\" rel=\"noopener nofollow\">Crypto Fear &amp; Greed Index</a> is beginning to show signs of volatility.</p><p>Over the weekend, the classic crypto sentiment gauge spiked into “greed” territory, reaching 63/100 — its highest reading since July 12.</p><p>The increase coincided with Bitcoin’s attempts to break through $30,000 over the weekend, reinforcing the significance of that price level in traders’ minds. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/1244037c-0c39-4aa0-8a6c-6e76a27d2ea9.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto Fear &amp; Greed Index (screenshot). Source: Alternative.me</em></figcaption></figure><p>On that topic, popular trader Altcoin Sherpa described $30,000 as a “scary area.”</p><p>“I still see this next high as extremely important when seeing where price goes,” he <a href=\"https://twitter.com/AltcoinSherpa/status/1716079961981718959/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">told</a> X subscribers on the day, adding that “we're about to see if we're going to see 20k or 40k in the midterm.”</p><p>Like others, Altcoin Sherpa highlighted $32,000 as the ultimate line in the sand for bulls to charge through.</p><p>“Basically if we break 32k strongly, we go to 40k,” he <a href=\"https://twitter.com/AltcoinSherpa/status/1716079964141875263\" target=\"_blank\" rel=\"noopener nofollow\">continued</a>. </p><blockquote>“If we form a lower high around here or reject around 32k strongly, I think we're going to go to low 20ks. Gut says 40k but 32k is a super strong level overall and I don't feel strong about it.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/76ecced2-4879-4956-bfcd-00c71444032c.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Altcoin Sherpa/X</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-23T08:10:40.000Z",
    "title": "‘Floodgates Get Unleashed’ for Solana ($SOL) at $32, Predicts Crypto Analyst",
    "url": "https://www.cryptoglobe.com/latest/2023/10/floodgates-get-unleashed-for-solana-sol-at-32-predicts-crypto-analyst/",
    "description": "A crypto analyst known by the pseudonym Bluntz has indicated that Solana (SOL) is on the cusp of a significant breakout. With a social media following of 225,200, Bluntz believes that SOL is poised to make gains against both Bitcoin (SOL/BTC) and the US dollar. Bluntz is optimistic about SOL’s recent price activity, suggesting that […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-23T08:11:31.000Z",
    "title": "ZK-Rollup-as-a-Service Provider Opside Rebrands As Lumoz & Unveils Ambitious Roadmap",
    "url": "https://cryptodaily.co.uk/2023/10/zk-rollup-as-a-service-provider-opside-rebrands-as-lumoz-unveils-ambitious-roadmap",
    "description": "The popular Rollups-as-a-Service (RaaS) provider Opside has announced that it’s rebranding to “Lumoz” in a move that’s designed to reflect the project’s expansion and avoid any confusion over its purpose."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T08:17:15.000Z",
    "title": "Have you considered using tarot cards and divine signals to predict the crypto market? Thai investors do",
    "url": "https://www.cryptopolitan.com/thai-crypto-investors-turn-to-tarot-cards/",
    "description": "All hail magic, wait, no, tarot cards, and the heavens for a volatile market. The crypto environment in Thailand teaches the extent to which investors will go to make a living. The crypto world has been a volatile space since its inception, and investors have always looked for ways of predicting the market.&#160; Major focuses ... <a title=\"Have you considered using tarot cards and divine signals to predict the crypto market? Thai investors do\" class=\"read-more\" href=\"https://www.cryptopolitan.com/thai-crypto-investors-turn-to-tarot-cards/\" aria-label=\"More on Have you considered using tarot cards and divine signals to predict the crypto market? Thai investors do\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-23T08:14:29.000Z",
    "title": "Shiba Inu Lead Dev Kusama Breaks Silence With Major Updates",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-kusama-breaks-silence-major-updates/",
    "description": "The pseudonymous lead developer of Shiba Inu (SHIB), Shytoshi Kusama, has broken his silence and has re-engaged with the community via Telegram, offering insights into the project&#8217;s developmental trajectory and responding to pressing queries regarding its future. In a flurry of messages, Kusama unveiled his enthusiasm and strategic engagements aimed at bolstering Shiba Inu’s ecosystem. “Excited to see ALL the incredible projects on Shibarium. Finally, get to come out of quiet mode for all the amazing projects out there,” he said, delineating the ongoing work and collaborations undertaken during his period of silence. He further revealed dialogues with pivotal figures in the ecosystem, saying, &#8220;I&#8217;ve been talking to VERY important individuals and some top [people] in [the] community for the next phase. Now I can return and support in any way I can as we keep building.&#8221; Kusama&#8217;s remarks suggest a phase of introspection and strategic alignments, as he mentioned, &#8220;We have also been busy with platforms to support the community and begin this network state. Sometimes silence is the best weapon.&#8221; Major Progress For Shiba Inu, Leash, Shibarium One of the most significant updates provided was regarding the LEASH token. Kusama outlined a vision where the community is more involved and informed. &#8220;Yes. My plan is to build a framework that expresses to the community what YOUR plans, products, and platforms that use leash are&#8230; so we all can DOOR. (DYOR) Good plan huh?&#8221; he commented, emphasizing the essence of decentralization. &#8220;This is the quiet before the typhoon and I can&#8217;t wait to learn about all the fantastic projects building with Leash, Shib, Bone or launching on Shibarium.&#8221; Related Reading: New SHIB-Based Token On The Way? Shiba Inu Team Member Shares Important Update On the matter of Shibarium’s low usage, Kusama imparted his perspective on broader market trends and token utility. Explaining the relationship between token &#8220;burns&#8221; and utility, he noted, &#8220;Please understand the &#8216;burn&#8217; increases as the use of Shibarium and Shib (and all tokens in the ecosystem) increase. So I&#8217;ve been looking for ways at a zoomed-out level to increase usage with others in our decentralized community.&#8221; Kusama also addressed the community&#8217;s queries about specific timelines for key developments, advocating for a broader, philosophical perspective on time, indicating that rigid timelines might not be the most effective approach in a complex and evolving ecosystem. He stated, &#8220;Because time is infinite. It cannot be framed. BUT if you&#8217;re into watches the waves of the world then you know what time it is.&#8221; Related Reading: Shiba Inu Revival? Here’s Why A Resurgence May Be Imminent A question regarding Shiba Inu’s integration into mainstream payment systems like McDonald&#8217;s and Burger King was met with a pragmatic response, acknowledging the existing challenges in such integrations. &#8220;It is available in tens of thousands of retailers but payment systems require deeper thought and integration,&#8221; Kusama elucidated, hinting at ongoing strategic deliberations. A noteworthy exchange occurred when a user mentioned the necessity for the Shibarium key for integration with Hoichi, highlighting the importance of community-driven initiatives. The Shiba Inu-based project stated that they &#8220;have 30 blockchains active already waiting to connect with Shibarium,&#8221; but the key is missing. &#8220;I think the Shibarium team reached out and there was confusion on what was needed. Please reach out a second time,&#8221; Kusama advised. At press time, SHIB traded at $0.00000722. Remarkably, SHIB managed to close above the neckline of the descending triangle on the weekly chart, which could create a new bullish momentum. The next target could be the descending trend line of the triangle. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-23T08:20:21.000Z",
    "title": "Breaking Down XRP Dominance: Is a Parabolic Price Rally Coming With New All-Time High?",
    "url": "https://www.crypto-news-flash.com/breaking-down-xrp-dominance-is-a-parabolic-price-rally-coming-with-new-all-time-high/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-down-xrp-dominance-is-a-parabolic-price-rally-coming-with-new-all-time-high",
    "description": "<img width=\"1038\" height=\"584\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-24x14.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-48x27.png 48w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />Crypto analyst Jaydee examines XRP&#8217;s past and current data, revealing a crucial point where trend lines meet. Historical performance shows XRP&#8217;s surges and dips, often halted at a significant trend line. Crypto analyst Jaydee has comprehensively analyzed XRP&#8217;s historical data, shedding light on potential future price movements for the cryptocurrency. In a recent update on [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-23T08:18:48.000Z",
    "title": "Elon Musk’s Wikimedia Challenge Sparks Acquisition Buzz: Can Dogecoin (DOGE)  Profit?",
    "url": "https://www.crypto-news-flash.com/elon-musks-wikimedia-challenge-sparks-acquisition-buzz-can-dogecoin-doge-profit/?utm_source=rss&utm_medium=rss&utm_campaign=elon-musks-wikimedia-challenge-sparks-acquisition-buzz-can-dogecoin-doge-profit",
    "description": "<img width=\"1502\" height=\"1000\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Doge-dogecoin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Doge-dogecoin.jpg 1502w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Doge-dogecoin-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Doge-dogecoin-1024x682.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Doge-dogecoin-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Doge-dogecoin-104x69.jpg 104w\" sizes=\"(max-width: 1502px) 100vw, 1502px\" />Elon Musk questions Wikimedia Foundation&#8217;s fundraising efforts for Wikipedia. Musk&#8217;s interest in media outlets raises acquisition speculations. In many of our previous articles, we&#8217;ve observed that Elon Musk often shares a connection with Dogecoin, such as in the article titled &#8220;Elon Musk To Go Public with Twitter (X) in New Cooperation – Can it Push [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-23T08:16:06.000Z",
    "title": "FTX Creditor Claims Heating Up: Values Soar Past 50 Cents on the Dollar",
    "url": "https://www.crypto-news-flash.com/ftx-creditor-claims-heating-up-values-soar-past-50-cents-on-the-dollar/?utm_source=rss&utm_medium=rss&utm_campaign=ftx-creditor-claims-heating-up-values-soar-past-50-cents-on-the-dollar",
    "description": "<img width=\"1000\" height=\"623\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-300x187.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-768x478.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-163x102.png 163w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-24x15.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-36x22.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-48x30.png 48w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />FTX creditor claims have soared after reports that FTX debtors plan to repay creditors up to 90 percent of their locked funds. The trial against Sam Bankman-Fried is edging closer to completion with the prosecution set to rest its case on October 26. The market for FTX creditor claims has witnessed an unprecedented surge. According [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-23T08:39:48.000Z",
    "title": "LINK’s Price Continues to Rise as Staking v0.2 Upgrades Revealed",
    "url": "https://coinedition.com/links-price-continues-to-rise-as-staking-v0-2-upgrades-revealed/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/LINK-7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/LINK-7.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/LINK-7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/LINK-7-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/LINK-7-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/LINK-7-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/LINK-7-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In an X post this morning, Wu Blockchain revealed the new functions that will be introduced within the Chainlink (LINK) ecosystem in the Staking v0.2 upgrade launch later this year. According to the post, an unbonding mechanism, liquid rewards, stake slashing, modular architecture, dynamic rewards and priority migration will all be included in the upgrade. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/links-price-continues-to-rise-as-staking-v0-2-upgrades-revealed/\">LINK’s Price Continues to Rise as Staking v0.2 Upgrades Revealed</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-23T08:30:10.000Z",
    "title": "KuCoin X Coin Edition Interview with Alicia Kao Inside: A Conversation with Managing Director Alicia Kao",
    "url": "https://coinedition.com/kucoin-x-coin-edition-interview-with-alicia-kao-inside-a-conversation-with-managing-director-alicia-kao/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange.jpg 730w, https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/10/CE_Interview_Alicia_Kao__Managing_Director_of_KuCoin_Exchange-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Alicia Kao is a Managing Director and Head of Strategic Partner Development at the cryptocurrency exchange KuCoin. Since joining in 2019, Alicia has been responsible for  KuCoin’s marketing and managing institution and  VIP client interaction. Moreover, she’s a strategist with more than 10 years of digital marketing experience. In this exclusive Coin Edition interview, we [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/kucoin-x-coin-edition-interview-with-alicia-kao-inside-a-conversation-with-managing-director-alicia-kao/\">KuCoin X Coin Edition Interview with Alicia Kao Inside: A Conversation with Managing Director Alicia Kao</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]