[
  {
    "source": "CryptoGlobe",
    "date": "2023-10-21T00:59:00.000Z",
    "title": "$XRP Sees Largest Single-Day Surge in Months as SEC Drops Charges Against Ripple Executives and ‘Smart Money’ Buys In",
    "url": "https://www.cryptoglobe.com/latest/2023/10/xrp-sees-largest-single-day-surge-in-months-as-sec-drops-charges-against-ripple-executives-and-smart-money-buys-in/",
    "description": "The price of the native token of the XRP Ledger, $XRP, has seen its best daily percentage gain in three months after the U.S. Securities and Exchange Commission (SEC) dropped securities violations charges against Ripple’s executives, and as smart money moves in. Market data shows that XRP, the world’s fifth-largest cryptocurrency by market capitalization, jumped […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-21T01:00:55.000Z",
    "title": "Coinbase Bullish: Bitcoin ETF Approval Expected After SEC’s Defeat",
    "url": "https://www.newsbtc.com/bitcoin-news/coinbase-bullish-bitcoin-etf-approval-expected-after-secs-defeat/",
    "description": "In a recent CNBC report, Coinbase, the largest cryptocurrency exchange in the United States, expressed confidence in the approval of a US-based Bitcoin (BTC)  exchange-traded fund (ETF) by the Securities and Exchange Commission (SEC).  Paul Grewal, Coinbase&#8217;s Chief Legal Officer, highlighted that the SEC&#8217;s recent court setback in the case of Grayscale&#8217;s proposed Bitcoin ETF has paved the way for a potential approval in the coming months. Coinbase Eyes Bitcoin ETF Approval  Grewal emphasized that Coinbase is hopeful about the approval of ETF applications due to their compliance with existing laws governing financial services. Grewal noted that prominent financial institutions have submitted robust proposals, indicating progress in the regulatory landscape. The recent court ruling against the SEC stated that the regulator lacked a valid basis to deny Grayscale&#8217;s request to convert its GBTC Bitcoin fund into an ETF.  Related Reading: xDay 2023: Elon Musk’s X Competitor? xPortal Unveils Rival Features The SEC chose not to appeal the ruling within the specified deadline, further increasing the likelihood of a BTC-related ETF gaining approval shortly. However, Grewal acknowledged that the ultimate decision rests with the SEC, and he refrained from providing a specific timeline for the approval process.  Nevertheless, Grewal expressed confidence in the SEC&#8217;s obligation to fulfill its responsibilities, particularly in light of the court&#8217;s decision and the requirement to apply the law impartially. The introduction of a Bitcoin ETF would offer investors an alternative means to gain exposure to BTC without directly purchasing the cryptocurrency from an exchange.  This could be particularly attractive to retail investors seeking Bitcoin exposure without the complexities of owning the underlying asset. Per the report, Coinbase, being the largest crypto exchange in the United States, stands to benefit from the potential approval of a BTC ETF. The company&#8217;s common stock is held in portfolios designed to provide investors with crypto exposure. Legal Troubles Mount For Grayscale&#8217;s Parent Company While the recent court ruling has bolstered prospects for a BTC ETF, it is important to note that Grayscale&#8217;s bid to convert GBTC into an ETF is not without its challenges.  Digital Currency Group (DCG), Grayscale&#8217;s parent company, along with crypto exchange Gemini and DCG subsidiary Genesis, face a lawsuit from the New York Attorney General, accusing them of defrauding investors of over $1 billion. Related Reading: Bulls Thrust Solana To $25 – What Traders Should Expect Next Despite the ongoing legal issues, Grewal remained positive about the approval of additional Bitcoin ETFs in the future as the SEC adheres to the law and evaluates pending applications neutrally. The report also touched upon the recent performance of BTC, which has experienced a resurgence in 2023. With a 72% year-to-date increase, Bitcoin has rebounded from significant declines in 2022.  Factors such as anticipation surrounding the upcoming BTC halving event and investor reactions to the Federal Reserve&#8217;s potential interest rate policy changes have contributed to increased demand for the digital currency. Ultimately while trading volumes have declined recently, attributed partly to retail investors&#8217; reduced engagement in response to low volatility and industry players&#8217; challenges, Grewal expressed optimism that various developments, including criminal trials and rigorous regulatory actions, will restore investor and consumer interest in the crypto market. As the landscape for Bitcoin ETFs evolves, market participants will closely monitor the SEC&#8217;s stance and any potential regulatory developments that shape the future of cryptocurrency investment products. Featured image from Shutterstock, chart from TradingView.com "
  }
]