[
  {
    "source": "Cointelegraph",
    "date": "2023-11-04T19:54:51.000Z",
    "title": "Aave pauses several markets after reports of feature issue ",
    "url": "http://cointelegraph.com/news/aave-pauses-several-markets-feature-issue",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/c0addbf2-d8ef-422e-9ffa-d6dd06091e82.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The pause affects multiple markets, including Aave V2 Ethereum Market and certain assets on Aave V2 on Avalanche. In addition, certain assets on Polygon, Arbitrum, and Optimism have been frozen.</p>\n                    <p><p>Decentralized finance (DeFi) protocol Aave paused a number of markets on Nov. 4 after receiving reports of an issue affecting “a certain feature,” according to a post on X (formerly Twitter). </p><p>The pause affects multiple networks, including Aave V2 Ethereum Market and certain assets on Aave V2 on Avalanche. In addition, certain assets on Polygon, Arbitrum, and Optimism have been frozen.</p><p>\"Today we received a report of an issue on a certain feature of the Aave Protocol,\" Aave announced, adding that After validation by community developers, the guardian has taken the following temporary prevention measure (no funds are at risk).\"</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today we received a report of an issue on a certain feature of the Aave Protocol. After validation by community developers, the guardian has taken the following temporary prevention measure (no funds are at risk):</p>&mdash; Aave (@aave) <a href=\"https://twitter.com/aave/status/1720868368331219100?ref_src=twsrc%5Etfw\">November 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Aave did not specify what problem or feature caused the issue, or which assets were affected. Aave's post also stressed that no funds were at risk on any of its markets.</p><p>According to the protocol, Aave V3 markets on Ethereum, Base, and Metis are not impacted by the issue. Additionally, Aave V2 markets on Polygon and Avalanche have not been affected. </p><p>\"A governance proposal to restore the normal operation of the protocols will be submitted shortly. Detailed postmortem will be released once the issue is fully resolved,\" the protocol noted in the thread. </p><p>Users supplying or borrowing from frozen assets can still withdraw and repay positions, but can't supply or borrow further assets until the issue is resolved, Aave noted. No action can be taken on paused assets.</p><p>There is no indication that the issue has affected the price of Aave’s native token, AAVE. At the time of writing, the token is trading at $89.10, down 1.54%, according to CoinMarketCap. </p><p><strong><em>Magazine:</em></strong> <a href=\"https://cointelegraph.com/magazine/crypto-zero-knowledge-voting-finance/\"><strong><em>Beyond crypto — Zero-knowledge proofs show potential from voting to finance</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-04T19:53:54.000Z",
    "title": "Are Solana (SOL) and Avalanche (AVAX) About to Make a Shocking Market U-turn?",
    "url": "https://cryptodaily.co.uk/2023/11/are-solana-sol-and-avalanche-avax-about-to-make-a-shocking-market-u-turn",
    "description": "Dive into the dynamic realms of Solana (SOL) and Avalanche (AVAX), examining their market technicalities and price trajectories. Our article provides a balanced forecast, exploring both optimistic and cautious outlooks for these prominent digital assets."
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-04T20:00:20.000Z",
    "title": "Analyst Says Bitcoin Structure Bullish, Predicts Parabolic Rally for ‘Impulsive’ BTC – Here Are His Targets",
    "url": "https://dailyhodl.com/2023/11/04/analyst-says-bitcoin-structure-bullish-predicts-parabolic-rally-for-impulsive-btc-here-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/btc-very-much-here.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/btc-very-much-here.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/btc-very-much-here.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/btc-very-much-here.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/btc-very-much-here.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/btc-very-much-here.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/btc-very-much-here.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is predicting a parabolic rally for Bitcoin (BTC) as its structure is displaying bullish signs. In a new strategy session, pseudonymous crypto trader Bluntz says that the slight pullback the king crypto experienced overnight is likely going to serve as its low as its price continues to surge. “I would [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/04/analyst-says-bitcoin-structure-bullish-predicts-parabolic-rally-for-impulsive-btc-here-are-his-targets/\">Analyst Says Bitcoin Structure Bullish, Predicts Parabolic Rally for ‘Impulsive’ BTC – Here Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]