[
  {
    "source": "Cointelegraph",
    "date": "2023-07-17T21:51:00.000Z",
    "title": "Chair Gensler says SEC reaction to Ripple decision is mixed, still under consideration",
    "url": "https://cointelegraph.com/news/sec-chair-gary-gensler-reaction-to-ripple-decision-is-mixed-still-under-consideration",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/d4caa0b4-3035-4c5a-881e-b5f719fa3650.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Gensler was asked about the Ripple decision twice shortly after the ruling, and his main message was that he would rather not talk about it.</p>\n                    <p><p>United States Securities and Exchange Commission (SEC) chair Gary Gensler has commented publicly about the last week’s ruling on the agency’s suit against Ripple. </p><p>Gensler gave a talk on artificial intelligence at the National Press Club on July 17 and <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">was asked about the ruling</a> during the questions and answers afterward. Does the ruling affect his stance on cryptocurrency, and does it “inject urgency into the need for federal legislation to clarify regulatory oversight of this industry,” he was asked. He <a href=\"https://twitter.com/WhaleChart/status/1681003204924809217\" target=\"_blank\" rel=\"noopener nofollow\">replied</a>:</p><blockquote>“We are pleased from that decision recognizing the importance of protecting investors – institutional investors – and the court movement in regard to fair notice, and while disappointed [by] what they said about retail investors, we are still looking at it and assessing that opinion.”</blockquote><p>Unsurprisingly, the topic arose later in the day when Gensler <a href=\"https://finance.yahoo.com/video/sec-chair-warns-ais-potential-201110024.html\" target=\"_blank\" rel=\"noopener nofollow\">spoke</a> to Yahoo Finance. Gensler largely repeated himself, saying, “We are pleased that the court addressed […] that a token for institutional investors is a security […] disappointed in  the other aspect about retail investors. We are still taking a look at that and considering it.”</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ripple-court-ruling-regulation-more-compelling-more-urgent-former-cftc-chair\">Ripple court ruling makes call for regulation 'more compelling and more urgent' — former CFTC chair</a></em></strong></p><p>A lot of crypto exchanges “feel like this was a real win for them” and are relisting XRP, interviewer Jennifer Schonberger told him. Could the decision set a precedent? “You’re asking good questions,” Gensler replied, before declining to answer, citing ongoing litigation. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">JUST IN:<br><br>SEC Chair Gary Gensler speaks about Ripple XRP ruling for first time, since last weeks court ruling <a href=\"https://t.co/0lOzJEDs1e\">pic.twitter.com/0lOzJEDs1e</a></p>&mdash; whalechart (@WhaleChart) <a href=\"https://twitter.com/WhaleChart/status/1681003204924809217?ref_src=twsrc%5Etfw\">July 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>But he did say that “these crypto platforms are commingling a number of services that […] we would not allow in any other parts of our capital markets.”</p><p>Does it make him reconsider writing customized rules for crypto, he was asked. “It’s too early. This was, like, three business days ago.” He added, “But I would note the agency has rules on the books right now […] about what it means to be a securities exchange.”</p><p>Gensler was asked about proposed Republican legislation that would create a decentralization test for crypto assets. He replied:</p><blockquote>“I’m gonna save our comment on any draft legislation for members [of Congress] who ask us directly.” </blockquote><p>Gensler said Satoshi Nakamoto (“whoever she was”) wrote a paper about moving value around on the internet without intermediaries, but the industry shows centralization in many places. “This is not a field that is immune to the economics of finance,” he concluded. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\">Crypto regulation: Does SEC Chair Gary Gensler have the final say?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-17T21:43:06.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting the Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Crypto exchange Binance has completed the integration of the Bitcoin Lightning Network on its platform, a response to a surge in transaction fees in May that caused a backlog of pending transactions. Meanwhile, the crypto exchange has reportedly laid off 1,000 staff, and the trading volume of XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) on the South Korean crypto exchange Upbit recently surpassed that of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). XRP’s momentum could extend into cross-border payments once again after a United States federal judge ruled in favor of Ripple Labs in its ongoing legal battle with the Securities and Exchange Commission (SEC).</p><h2>Ripple Labs exec says court ruling could boost XRP adoption</h2><p>With Ripple Labs scoring a partial victory in its legal battle with the SEC, the XRP token could be <a href=\"https://cointelegraph.com/news/ripple-clo-court-ruling-encourage-banks-adopt-xrp\">poised for wider adoption</a> in cross-border transactions, according to Stu Alderoty, Ripple Labs’ chief legal officer.</p><p>“I think we’re hopeful that this decision would give financial institution customers or potential customers comfort to at least come in and start having the conversation about what problems they are experiencing in their business, real-world problems in terms of moving value across borders without incurring obscene fees,” Alderoty said, according to CNBC. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/NEW?src=hash&amp;ref_src=twsrc%5Etfw\">#NEW</a>: Chairmen <a href=\"https://twitter.com/PatrickMcHenry?ref_src=twsrc%5Etfw\">@PatrickMcHenry</a> and <a href=\"https://twitter.com/CongressmanGT?ref_src=twsrc%5Etfw\">@CongressmanGT</a> issue a statement regarding the court ruling in SEC v. Ripple and the need for legislative clarity in the digital asset ecosystem to prevent further uncertainty in our financial markets.<br><br> Read more <a href=\"https://t.co/y1nITVmHvh\">https://t.co/y1nITVmHvh</a> <a href=\"https://t.co/tn0dn0BDHd\">pic.twitter.com/tn0dn0BDHd</a></p>&mdash; Financial Services GOP (@FinancialCmte) <a href=\"https://twitter.com/FinancialCmte/status/1679978225055985665?ref_src=twsrc%5Etfw\">July 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Alderoty said the third quarter would be especially pivotal in driving conversations with customers about XRP’s utility, which could generate meaningful business for the company.</p><p>Judge Analisa Torres of the U.S. District Court for the Southern District of New York <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">ruled partially in favor of Ripple Labs</a> on July 13 by determining that XRP was not necessarily a security. The favorable judgment prompted several U.S. crypto exchanges <a href=\"https://cointelegraph.com/news/us-crypto-exchanges-second-chance-xrp-listings-after-court-ruling\">to relist XRP</a>.</p><h3>National Australia Bank joins crypto exchange boycott, cites ‘scams’</h3><p>Another major bank in Australia has said it will block certain cryptocurrency platforms, citing high levels of scam risk in the industry.</p><p>On July 17, National Australia Bank (NAB) <a href=\"https://news.nab.com.au/news/scam-strategy-update/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> a set of new measures to protect customers from fraud as part of its “bank-wide scam strategy.”</p><p>Alongside halting millions in payments between March and July 2023, NAB will also introduce blocks on “some cryptocurrency platforms” to help protect customers from scams.</p><p>NAB did not specify the names of the cryptocurrency exchanges expected to face blocks from the bank. NAB’s executive for group investigations and fraud Chris Sheehan only mentioned that the new blocks will affect “high-risk” platforms where “scams are more prevalent.”</p><p>Sheehan stated:</p><blockquote>“These scammers are part of organized, transnational crime groups. Increasingly, we’re seeing them use cryptocurrency platforms to send stolen funds quickly and often overseas.”</blockquote><p>According to local reports, Sheehan hinted that NAB’s crypto blocks could affect the Binance crypto exchange. “Our approach is going to be consistent with the rest of the industry,” the executive reportedly said. Over the past few months, other large Australian banks, including Westpac and Commonwealth Bank of Australia, have also reportedly blocked payments to Binance.</p><p>NAB and Binance didn’t immediately respond to Cointelegraph’s request to comment. This article will be updated pending new information.</p><h3>Binance completes integration of Bitcoin Lightning Network</h3><p>Cryptocurrency exchange Binance has finally completed the integration of the Bitcoin Lightning Network, allowing users to use it for BTC withdrawals and deposits.</p><p>When users now choose to withdraw or deposit Bitcoin, they will be able to select “LIGHTNING” as an option. Other options include BNB Smart Chain (BEP-20), Bitcoin, BNB Beacon Chain (BEP2), BTC (SegWit) and Ethereum (ERC-20). </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Binance?src=hash&amp;ref_src=twsrc%5Etfw\">#Binance</a> has completed the integration of Bitcoin ( <a href=\"https://twitter.com/hashtag/BTC?src=hash&amp;ref_src=twsrc%5Etfw\">#BTC</a> ) on the Lightning Network and deposits and withdrawals are now open. <br><br>More details here <a href=\"https://t.co/aIofPdtAGY\">https://t.co/aIofPdtAGY</a></p>&mdash; Binance (@binance) <a href=\"https://twitter.com/binance/status/1680777249090576385?ref_src=twsrc%5Etfw\">July 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Binance first hinted at the integration of the Lightning Network in May after it had to temporarily pause BTC withdrawals due to a <a href=\"https://cointelegraph.com/news/bitcoin-fee-spike-spurs-shift-to-lightning-network-binance-and-coinbase-line-up\">flood of pending transactions</a> caused by “the recent surge in BTC network gas fees.”</p><p>The explosion in transaction fees has largely been attributed to the <a href=\"https://cointelegraph.com/news/bitcoin-brc-20-token-standard-becomes-a-new-destination-for-meme-tokens\">creation of memecoins on Bitcoin</a> in the form of BRC-20 tokens — a new token standard on the network.</p><p>Binance joins Bitfinex, River Financial, OKX, Kraken and CoinCorner as the other prominent exchanges to have embraced the Lightning Network.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-17T22:01:12.000Z",
    "title": "Man Faces Charges for Allegedly Helping To Kidnap ‘Crypto King’ After Falling Victim to Scheme: Report",
    "url": "https://dailyhodl.com/2023/07/17/man-faces-charges-for-allegedly-helping-to-kidnap-crypto-king-after-falling-victim-to-scheme-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/co-founder-scheme-faces.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/co-founder-scheme-faces.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/co-founder-scheme-faces.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/co-founder-scheme-faces.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/co-founder-scheme-faces.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/co-founder-scheme-faces.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/co-founder-scheme-faces.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A Toronto investor who allegedly helped kidnap Ontario&#8217;s &#8220;Crypto King&#8221; last December after losing thousands in a scam is facing kidnapping charges in Canada. According to a new CBC report, Akil Heywood is facing kidnapping, confinement, and assault charges for allegedly kidnapping &#8220;Crypto King&#8221; Aiden Pleterski last December. Says the fraud recovery lawyer representing some of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/17/man-faces-charges-for-allegedly-helping-to-kidnap-crypto-king-after-falling-victim-to-scheme-report/\">Man Faces Charges for Allegedly Helping To Kidnap ‘Crypto King’ After Falling Victim to Scheme: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]