[
  {
    "source": "CoinDesk",
    "date": "2023-07-04T08:40:08.000Z",
    "title": "Pepecoin Knockoffs Turn Dollars to Fortunes in Strange New ‘2.0’ Play",
    "url": "https://www.coindesk.com/markets/2023/07/04/pepecoin-knockoffs-turn-dollars-to-fortunes-in-strange-new-20-play/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Offshoots of several meme coins have popped across the board in a trend that’s likely to die out within weeks."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-04T08:53:18.000Z",
    "title": "Circle targets APAC’s 74% USD trade invoicing for digital dollar growth",
    "url": "https://cryptoslate.com/circle-targets-apacs-74-trade-invoicing-for-digital-dollar-growth/",
    "description": "<p>Circle, the USDC stablecoin provider, appears to be targeting the 74% of Asia Pacific (APAC) trade invoicing processed in US dollars between 1999 and 2019, as per FED estimates. In a recent blog post, Circle&#8217;s executives underscored the potential role of the digital dollar, specifically USDC, in the APAC financial landscape, given the persistent use [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/circle-targets-apacs-74-trade-invoicing-for-digital-dollar-growth/\">Circle targets APAC&#8217;s 74% USD trade invoicing for digital dollar growth</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-04T08:50:00.000Z",
    "title": "TON Blockchain Introduces On-Chain Encrypted Messaging Feature",
    "url": "https://cryptodaily.co.uk/2023/07/ton-blockchain-introduces-on-chain-encrypted-messaging-feature",
    "description": "<p>The Open Network (TON) has announced the release of an on-chain encrypted messaging feature, allowing private messages between TON users.&nbsp;</p>\n<p>Previously, users could post on-chain messages. However, these were unencrypted and available to the public.&nbsp;</p>\nEncrypted Transaction Messages&nbsp;\n<p>The announcement was made on the 3rd of July by the TON Foundation. The TON blockchain network was forked from code that was created by the team behind the Telegram instant messaging app. However, the project was abandoned in 2020, but not before the team open-sourced TON&rsquo;s code. This allowed others to pick up from where the original team left off. The current network was created by the TON Foundation, a non-profit organization that seeks to promote TON among developers and users. According to the TON Foundation, the network gives users far greater scalability and transaction throughput than other options available in the Web3 ecosystem while also offering a high level of decentralization.&nbsp;</p>\n<p>TON has always allowed users to send personalized messages when conducting transactions or sending NFTs to each other. However, these messages were completely public. With the introduction of the new feature, users can encrypt the messages end-to-end, meaning only the intended recipient will be able to view the message. The feature is a welcome addition to TON&rsquo;s already highly secure platform. Furthermore, to increase the availability of the new service, the charge to send an encrypted message through the TON blockchain has been set at 0.006 Toncoin (TON) per transaction. Core developer at the TON Foundation, Anatoly Makosov, stated,&nbsp;</p>\n\n<p>&ldquo;When sending Toncoin, Jettons, or NFTs on TON, you have always been able to include a text for the recipient such as &lsquo;for coffee&rsquo; or &lsquo;happy birthday,&rsquo; thereby personalizing the interaction. Now this popular feature [...] is available with full encryption.&rdquo;</p>\n\n<p>He further added&nbsp;</p>\n\n<p>&ldquo;Even in the event of an apocalypse and the failure of conventional messenger servers, you will retain the ability to send messages via the decentralized TON blockchain.&rdquo;</p>\n\n<p>In such a scenario, TON could serve as a reliable and secure method of communication.&nbsp;</p>\nTON Working Towards Accelerating Ecosystem&nbsp;\n<p>The TON Foundation has been at the heart of rebuilding the TON ecosystem and attracting Web 3.0 developers and builders. In April 2022, TON users collectively donated $1 billion to the foundation and its efforts to advance the TON ecosystem. The donations in question were made over a ten-day window starting on the 7th of April, 2022. In total, around 527 million TON, equalling just over $1 billion, were donated by users, primarily TON whales.&nbsp;</p>\n<p>In May 2023, the TON Foundation enlisted the blockchain data platform Chainalysis with plans to utilize its Crypto Incident Response Service to provide round-the-clock support in the event of a hack or exploit. By partnering with Chainalysys, TON can access a robust and proven way to combat hacks or other unauthorized intrusions.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-04T08:40:05.000Z",
    "title": "TRON Unveils HackaTRON S5 and Developer Community Event TRON Builder Tour",
    "url": "https://cryptodaily.co.uk/2023/07/tron-unveils-hackatron-s5-and-developer-community-event-tron-builder-tour",
    "description": "<p>Geneva, Switzerland, July 4th, 2023, Chainwire</p><p>TRON DAO, BitTorrent Chain (BTTC), and Huobi Ventures proudly present HackaTRON Season 5 (S5), an incredible showcase of talent in the fast-paced world of blockchain technology. In tandem with the much-anticipated TRON Builder Tour, we invite innovative minds to take part in this year's event, powered by an exceptional prize pool of up to 500,000*. It's time to set the stage for the next big thing in the blockchain universe!</p><p>This season, HackaTRON S5 is ready to unravel the five distinctive tracks: Web3, DeFi, Artistry (featuring NFTs, GameFi, and Metaverse projects), Builder for our esteemed past participants, and the eagerly awaited AI track. Embark on this extraordinary journey to create, innovate, and inspire!</p><p>Join the Journey with TRON Builder Tour</p><p>Alongside the thrilling launch of HackaTRON Season 5, we're taking the energy and innovation on the road with our TRON Builder Tour. This tour represents our commitment to fostering a robust, hands-on relationship with our vibrant community of developers. Participants will get a unique opportunity to engage with the TRON team directly, network with fellow developers, participate in Tron workshops, and immerse themselves in the world of blockchain.&nbsp;</p><p>Our Tron Builder Tour will touch down at the following destinations:</p><p>1. New York City: Stepping off on July 16, 2023</p><p>2. Los Angeles: Lighting up LA on July 27, 2023</p><p>3. Miami: Making waves on August 25, 2023</p><p>4. Berkeley: Energizing innovation on September 9, 2023</p><p>5. Princeton: Wrapping up our journey on September 23, 2023</p><p>Mark your calendars, and prepare for a unique blend of learning, innovation, and community building.</p><p>Unleash Your Potential in HackaTRON Season 5</p><p>Taking part in HackaTRON Season 5 means more than the chance to compete for prizes. It's an invitation to delve into the future of blockchain technology, collaborate with the best in the industry, and translate your innovative ideas into reality.&nbsp;</p><p>Here's why HackaTRON S5 is an opportunity you don't want to miss:</p><p>Exposure: Take center stage and let your talents shine before a global audience of blockchain enthusiasts and experts.</p><p>Collaboration: Harness the power of diverse minds. Working with fellow participants opens doors to shared learning and potential partnerships.</p><p>Impact: Your contribution can redefine the future landscape of blockchain technology. Our event is tailored to the most current and critical issues in the industry.</p><p>Opportunities: Beyond the competitive prize pool, participants could secure job offers, internships, or catch the eye of venture capitalists.</p><p>Community: Immerse yourself in the dynamic TRON, BTTC, and Huobi Ventures communities. Together, we cultivate an environment of innovation, growth, and camaraderie.</p><p>Ignite the Flame of Competition with Our Prize Pool</p><p>We're fueling your journey to success with a stellar prize pool of 500,000*, divided as follows:</p><p>Judge-Selected Qualifiers (per track)</p><p>- 1st Place: 25,000</p><p>- 2nd Place: 15,000</p><p>- 3rd Place: 10,000</p><p>- 4th Place: 8,000</p><p>- 5th Place: 6,000</p><p>Community-Selected Winners</p><p>- 1st Place: 7,000</p><p>- 2nd Place: 6,000</p><p>- 3rd Place: 5,000</p><p>- 4th Place: 4,000</p><p>- 5th Place: 3,000</p><p>Note: All prizes are issued in USDD, not USD</p><p>*Qualifying HackaTRON Season 5 participants are eligible to receive issuance of awards in USDD.</p><p>For this season, we've teamed up with Huobi Ventures to ramp up the stakes. They'll award an extra 5,000 to each first-place winner and sponsor a 2,500 bug bounty in the TRON Builder Tour, totaling an additional 27,500.</p><p></p><p>Note: All grant prizes are in USDD, not USD</p><p>HackerEarth, a global developer network with 7.6M+ developers and 1000+ recruiters, will be the official hackathon platform partner for HackaTRON Season 5. This collaboration provides the tools and resources for participants to sharpen their skills and exhibit their talents.</p><p>Join us on this trailblazing journey at HackaTRON Season 5, where we converge ambition, creativity, and the power of blockchain to create an unforgettable hackathon experience. Get ready to leave your footprints on the sands of the blockchain world. Stay tuned for more updates here.</p><p></p><p>About TRON DAO</p><p>TRON DAO is a community-governed DAO dedicated to accelerating the decentralization of the internet via blockchain technology and dApps.</p><p>Founded in September 2017 by H.E. Justin Sun, the TRON network has continued to deliver impressive achievements since MainNet launch in May 2018. July 2018 also marked the ecosystem integration of BitTorrent, a pioneer in decentralized Web3 services boasting over 100 million monthly active users. The TRON network has gained incredible traction in recent years. As of July 2023, it has over 170.5 million total user accounts on the blockchain, more than 6.05 billion total transactions, and over $12.74 billion in total value locked (TVL), as reported on TRONSCAN.&nbsp;</p><p>In addition, TRON hosts the largest circulating supply of USD Tether (USDT) stablecoin across the globe, overtaking USDT on Ethereum since April 2021. The TRON network completed full decentralization in December 2021 and is now a community-governed DAO. Most recently in October 2022, TRON was designated as the national blockchain for the Commonwealth of Dominica, which marks the first time a major public blockchain partnered with a sovereign nation to develop its national blockchain infrastructure. On top of the government&rsquo;s endorsement to issue Dominica Coin (&ldquo;DMC&rdquo;), a blockchain-based fan token to help promote Dominica&rsquo;s global fanfare, seven existing TRON-based tokens - TRX, BTT, NFT, JST, USDD, USDT, TUSD, have been granted statutory status as authorized digital currency and medium of exchange in the country.</p><p>TRONNetwork | TRONDAO | Twitter | YouTube | Telegram | Discord | Reddit | GitHub | Medium | Forum</p><p></p><p>About BitTorrent Chain</p><p>BitTorrent Chain (BTTC) is the world&rsquo;s first heterogeneous cross-chain interoperability protocol, which adopts the PoS (Proof-of-Stake) mechanism and leverages sidechains for the scaling of smart contracts. It now enables interoperability with the public chains of Ethereum, TRON, and BNB Chain. Fully compatible with EVM, BitTorrent Chain facilitates the seamless transfer of assets across mainstream public chains. The governance token BTT, also known as BTTOLD on TRON Protocol was granted statutory status as authorized digital currency and medium of exchange in the Commonwealth of Dominica on October 7th 2022.</p><p>Website | Telegram | Medium | Github | Docs</p><p>About Huobi Ventures</p><p>Huobi Ventures, the global investment arm of Huobi, integrates investment, incubation, and research to identify the best and brightest teams in the world.</p><p>As a 10 year pioneer in the industry, we explore, unveil and assist the industry's cutting-edge technologies and emerging business models, providing financing, resources and advisory to projects to grow the blockchain ecosystem together.</p><p></p>ContactHayward Wongpress.hackathon@trondao.org"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T09:04:47.000Z",
    "title": "Voyager creditors billed $5.1 million for March-May legal services",
    "url": "https://www.cryptopolitan.com/voyager-creditors-billed-5-1-million/",
    "description": "McDermott Will &#38; Emery, the law firm representing Voyager&#8217;s committee of unsecured creditors, has invoiced the group $5.1 million, in a filing, for services rendered between March and May. The group has now been charged a total of $16.4 million in compensation, more than the $11.2 million anticipated as part of its restructuring process. Of ... <a title=\"Voyager creditors billed $5.1 million for March-May legal services\" class=\"read-more\" href=\"https://www.cryptopolitan.com/voyager-creditors-billed-5-1-million/\" aria-label=\"More on Voyager creditors billed $5.1 million for March-May legal services\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T08:52:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-04T08:50:17.000Z",
    "title": "PEPE Breaches Local Highs With 20% Leap In Surprise Comeback",
    "url": "https://www.newsbtc.com/news/pepe-surpasses-local-highs/",
    "description": "PEPE has recently made a stunning comeback by surpassing its local highs with a remarkable 20% weekly surge. This unexpected turn of events have provided some relief to investors who thought the frog-themed coin will never be able to get back on its feet again.  What has propelled this sudden comeback, and what does it signify for the future of this meme coin? Related Reading: Litecoin $100 Milestone Indicates Promising Bullish Trends – Here’s Why PEPE Maintains Bullish Pace As Open Interest Rises PEPE, currently priced at $0.00000185 according to CoinGecko, has recently experienced a remarkable surge in its value. Over the course of 24 hours, the asset witnessed a notable rally of 16%, and within the span of just seven days, it soared by an impressive 20%. Source: Coingecko Upon analyzing the OI (Open Interest) chart from Coinglass, it becomes evident that the surge in PEPE prices was accompanied by a simultaneous increase in Open Interest. This indicates that speculators in the Futures market were not only convinced of a bullish move but were also willing to bid on the asset, expressing their confidence in its potential. The Open Interest chart indicated that speculator sentiment continued to be robust. Source: Coinglass Furthermore, a PEPE price report revealed that the Relative Strength Index (RSI) displayed bullish momentum. Prior to the rally, PEPE came close to testing the 50% retracement level at $0.00000135. This observation suggests that the asset is likely to approach and potentially surpass the 23.6% and 61.8% extension levels at $0.000002 and $0.00000233, respectively.  Such indications further fuel the optimism surrounding PEPE&#8217;s recent surge and raise questions about the asset&#8217;s future growth potential. BTC&#8217;s Role Remains Key The recent surge in PEPE, accompanied by positive indicators and price action, has bolstered expectations of continued gains for the asset. However, it is important to consider the potential impact of Bitcoin&#8217;s price movement, as a rejection from the $30.8k-zone could potentially shift market sentiment toward the sellers. The influence of Bitcoin, as the leading cryptocurrency, cannot be overlooked. Bitcoin often sets the tone for the overall cryptocurrency market sentiment. Bitcoin breaches the $31K territory. Chart: TradingView.com Should Bitcoin face a rejection near the $30.8k-zone, it could create a cautious atmosphere and shift sentiment toward sellers in the market. This scenario would likely impact PEPE and other altcoins, potentially hindering their upward momentum. Related Reading: Solana Firedancer: 15% Rally Fueled By Ongoing Network Improvements As traders and investors continue to monitor PEPE&#8217;s performance, keeping a close eye on the Bitcoin price movements becomes crucial. The interplay between these two assets could play a significant role in shaping the market sentiment and determining the future trajectory of PEPE&#8217;s price. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Answers in Genesis"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T09:00:29.000Z",
    "title": "TMS Network (TMSN): A Huge Juggernaut Bulldozing Through Litecoin (LTC) and Filecoin (FIL)",
    "url": "https://www.crypto-news-flash.com/tms-network-tmsn-a-huge-juggernaut-bulldozing-through-litecoin-ltc-and-filecoin-fil/?utm_source=rss&utm_medium=rss&utm_campaign=tms-network-tmsn-a-huge-juggernaut-bulldozing-through-litecoin-ltc-and-filecoin-fil",
    "description": "TMS Network (TMSN) is rapidly solidifying its place in the NFT industry, swiftly surpassing established names such as Litecoin (LTC) and Filecoin (FIL). This upcoming decentralized exchange hopes to make profiting from different asset classes more effortless by providing an all-in-one trading solution. This report will examine the explosive growth of TMS Network (TMSN) and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T08:56:35.000Z",
    "title": "Ethereum Starts New Token Standard ERC223 to Reduce Supply – Can ETH Price Profit and Rise to $3,000? All You Need to Know as an Investor",
    "url": "https://www.crypto-news-flash.com/ethereum-starts-new-token-standard-erc223-to-reduce-supply-can-eth-price-profit-and-rise-to-3000-all-you-need-to-know-as-an-investor/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-starts-new-token-standard-erc223-to-reduce-supply-can-eth-price-profit-and-rise-to-3000-all-you-need-to-know-as-an-investor",
    "description": "Ethereum introduces the ERC-223 token standard as a subset of ERC-20 to address known flaws and improve security. The new standard promotes universal acceptance and compatibility with other protocols, ensuring a smooth transition without impacting the supply of Ethereum. Ethereum, the prominent blockchain platform, is set to revolutionize its token standards with the introduction of [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-04T08:56:00.000Z",
    "title": "MATIC Breaks Above $0.7 Mark After Long-Term Retracement",
    "url": "https://coinedition.com/matic-breaks-above-0-7-mark-after-long-term-retracement/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/094.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/094.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/094-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/094-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/094-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/094-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/094-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/094-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/094-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/094-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/094-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/094-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/094-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/094-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/094-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/094-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/094-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Today, a crypto analyst under the pseudonym of ‘KALEO’ observed that MATIC’s price reached the solid higher-time frame (HTF) support in the MATIC/BTC 1-Day chart. The crypto analyst further mentioned that the solid HTF support was determined from the base of the range that dates back to mid-2021. Moreover, the crypto analyst insisted that Polygon [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/matic-breaks-above-0-7-mark-after-long-term-retracement/\">MATIC Breaks Above $0.7 Mark After Long-Term Retracement</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]