[
  {
    "source": "CoinDesk",
    "date": "2024-02-15T21:43:12.000Z",
    "title": "Did Elizabeth Warren Just Endorse Bitcoin? Not So Fast",
    "url": "https://www.coindesk.com/policy/2024/02/15/did-elizabeth-warren-just-endorse-bitcoin-not-so-fast/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A stunt from Bitcoin supporters led to the appearance that the U.S. senator and staunch cryptocurrency opponent Elizabeth Warren signed an order for a flag to be flown over the U.S. capitol commemorating Satoshi Nakamoto."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-15T21:59:22.000Z",
    "title": " Elizabeth Warren’s bill ‘wouldn’t do anything’ to stop terrorist financing in crypto — US lawmaker ",
    "url": "https://cointelegraph.com/news/crypto-bill-terrorist-financing-congress",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMmQ0ZmExOTItZjM1NS00MmJjLWJjOTAtMGY3MzViYmE5YTg2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Representative French Hill challenged aspects of a bill amending the Bank Secrecy Act, implying requirements be impossible to apply to crypto miners and validators.</p>\n                    <p><p>United States Representative French Hill, chair of the House Financial Services Subcommittee on Digital Assets, Financial Technology and Inclusion, has challenged an aspect of Senator Elizabeth Warren’s proposed bill on digital assets.</p><p>In a Feb. 15 hearing focusing on “Crypto Crime in Context,” Representative Hill and other U.S. lawmakers <a href=\"https://financialservices.house.gov/calendar/eventsingle.aspx?EventID=409142\" target=\"_blank\" rel=\"noopener nofollow\">questioned</a> experts from the crypto space on making digital asset miners and validators subject to similar regulations currently applied to financial institutions. Senator Warren’s bill, the Digital Asset Anti-Money Laundering Act, proposes modifying the Bank Secrecy Act to apply new standards to crypto providers to combat the financing of terrorist organizations.</p><p>Representative Hill implied that changing the requirements for miners and validators “wouldn’t do anything” to stop terrorist organizations’ use of crypto. He did not explicitly mention the Massachusetts enator's bill. According to Arktouros co-founder Michael Mosier, also a former acting director for the Financial Crimes Enforcement Network, the overwhelming majority of illicit financing in crypto goes through centralized exchanges.</p><p><a href=\"https://cointelegraph.com/news/crypto-bill-terrorist-financing-congress\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-15T21:38:22.000Z",
    "title": " Ethiopia makes data center deal with Hong Kong company, may start mining ",
    "url": "https://cointelegraph.com/news/ethiopia-makes-data-center-deal-hong-kong-company-mining",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZmY2ZGY2ZDgtNjY4My00YjlkLTk3ZWItYmE5ZjhhYTlmODZkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Ethiopian government investment fund has signed an MoU with Data Center Service on a $250-million data mining and AI training deal.</p>\n                    <p><p>The Ethiopian government has entered into a partnership with a Hong Kong data center operator. According to reports, Bitcoin mining will be among the activities the sides develop together.</p><p>State-owned Ethiopian Investment Holdings has signed a Memorandum of Understanding with Data Center Service, a subsidiary of Hong Kong’s West Data Group, according to an announcement <a href=\"https://www.linkedin.com/posts/ethiopian-investment-holdings_ethiopia-datamining-partnerships-ugcPost-7163867573023928320-Juer/\" target=\"_blank\" rel=\"noopener nofollow\">released</a> on Feb. 5. Ethiopia and West Data will cooperate on a $250-million project “dedicated to establishing cutting-edge infrastructure for data mining and artificial intelligence training operations in Ethiopia.”</p><p>Kal Kassa, CEO for Ethiopia at Hashlabs Mining, stated in an X post that: </p><p><a href=\"https://cointelegraph.com/news/ethiopia-makes-data-center-deal-hong-kong-company-mining\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-15T21:33:06.000Z",
    "title": " VC Roundup: Blockchain infrastructure, data analytics and BTC for DeFi catching investors&#039; attention  ",
    "url": "https://cointelegraph.com/news/vc-roundup-blockchain-infrastructure-data-analytics-btc-defi-catching-investors-attention",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYTU0YTE1ZmQtYzllYy00ZDE5LThkNjgtODFkOGNmNDRlODQxLkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Lava Protocol, Analog, Helika, Truflation, and Omega are among the startups securing funding in the first half of February.</p>\n                    <p><p>The second month of 2024 has offered solid prospects for crypto venture capital. The start of February witnessed $16 million in funding <a href=\"https://cointelegraph.com/news/analog-16m-funding-cross-chain-communication-tools\">secured by the cross-chain protocol Analog</a>, alongside another $15 million in capital allocated to the Lava Protocol.</p><p>Also making headlines in the alternative investment space are private equity firms Deus X Capital and Bridgetower Capital. The companies <a href=\"https://cointelegraph.com/news/deus-x-bridgetower-debuts-250m-digital-asset-venture-middle-east\">are launching a new $250 million</a> crypto infrastructure platform dedicated to institutional investors in the Middle East.</p><p>Venture capitalists are also seeking direct exposure to cryptocurrencies. Peter Thiel’s Founders Fund reportedly <a href=\"https://cointelegraph.com/news/founders-fund-bought-200-m-btc-eth\">pumped $200 million into Bitcoin and Ether in 2023</a>, as speculation of a pending approval for spot Bitcoin exchange-traded funds (ETFs) ramped in the United States over the past year.</p><p><a href=\"https://cointelegraph.com/news/vc-roundup-blockchain-infrastructure-data-analytics-btc-defi-catching-investors-attention\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-15T21:22:30.000Z",
    "title": " Starknet populated by airdrop hunters ahead of token launch: Report ",
    "url": "https://cointelegraph.com/news/starknet-populated-airdrop-hunters-ahead-token-launch-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMTc0ZDYwZjgtNWQwZC00YTI3LTg4ZTEtZDUxMjI1MGU3MmEzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Like many other airdrops, the much anticipated Ethereum L2 STRK airdrop has allegedly captured the attention of token farmers. </p>\n                    <p><p>A much-anticipated airdrop from Ethereum layer-2 scaling solution Starknet may be dominated by airdrop farmers.</p><p>According to a February 15 <a href=\"https://twitter.com/bantg/status/1758112220901187713\" target=\"_blank\" rel=\"noopener nofollow\">report</a> by Yearn Finance developer banteg, 1,854 individuals allegedly renamed or deleted their accounts after a blockchain snapshot was taken for the basis of the Starknet airdrop next Monday. The Starknet Foundation will <a href=\"https://medium.com/@StarknetFoundation/introducing-the-starknet-provisions-program-05d03ce13970\" target=\"_blank\" rel=\"noopener nofollow\">allocate</a> 700 million STRK tokens out of a total of 1.8 billion to 1.3 million eligible wallet addresses on February 20, with 50% of the tokens going to protocol users. </p><p>However, citing GitHub data, banteg <a href=\"https://github.com/starknet-io/provisions-data/pull/19\" target=\"_blank\" rel=\"noopener nofollow\">claims</a> that 1,175 out of the alleged 1,854 renamed accounts have identical historical GitHub IDs, and that excluding such accounts from the airdrop snapshot would reduce the number of eligible wallets by 701,544. </p><p><a href=\"https://cointelegraph.com/news/starknet-populated-airdrop-hunters-ahead-token-launch-report\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-15T22:01:59.000Z",
    "title": "VanEck slashes spot Bitcoin ETF fee to 0.20%; Fidelity cuts EU ETP fee to 0.35%",
    "url": "https://cryptoslate.com/vaneck-slashes-spot-bitcoin-etf-fee-to-0-20-fidelity-cuts-eu-etp-fee-to-0-35/",
    "description": "<p>VanEck will reduce fees on its spot Bitcoin ETF later this month, according to a filing with the US Securities and Exchange Commission (SEC) on Feb. 15. The firm said that its VanEck Bitcoin Trust (HODL) will include a unified sponsor fee of 0.20% when trading begins on Feb. 21. Currently, that fee is 0.25%. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/vaneck-slashes-spot-bitcoin-etf-fee-to-0-20-fidelity-cuts-eu-etp-fee-to-0-35/\">VanEck slashes spot Bitcoin ETF fee to 0.20%; Fidelity cuts EU ETP fee to 0.35%</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-15T21:30:02.000Z",
    "title": "Pro-Crypto US Attorney Considers Challenging Elizabeth Warren in Massachusetts Senate Race",
    "url": "https://news.bitcoin.com/pro-crypto-us-attorney-considers-challenging-elizabeth-warren-in-massachusetts-senate-race/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_443974348-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_443974348-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_443974348-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_443974348-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_443974348-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_443974348-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_443974348-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_443974348.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />John Deaton, a U.S. lawyer known for his pro-crypto stance, is reportedly considering a run against Massachusetts Senator Elizabeth Warren. The Republicans are eager to nominate a formidable candidate against Warren. This strategy could compel her to concentrate on her political survival, potentially diverting her focus from supporting other Democrats. Pro-Crypto U.S. Lawyer to Decide [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T21:55:36.000Z",
    "title": "WEEKLY CRYPTO PRICE ANALYSIS: BTC, ETH, BNB, SOL, XRP, ADA, And DOGE",
    "url": "https://www.cryptopolitan.com/weekly-crypto-price-analysis-2024-15-02/",
    "description": "Weekly crypto price analysis indicates a robust resurgence in the cryptocurrency market, with a significant uptick in values across the board over the recent week. The bullish momentum has firmly reestablished its dominance, with most digital currencies showcasing positive trends and trading in the green. A notable observation is the tendency of these cryptocurrencies to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T21:49:31.000Z",
    "title": "Polygon co-founder discusses advancements in layer-2 solutions",
    "url": "https://www.cryptopolitan.com/polygon-co-founder-advancements-layer-2/",
    "description": "In recent discussions, Brendan Farmer, co-founder of Polygon, shared insights into the current state of layer-2 networks and highlighted the firm’s significant advancements over the past six months. Notably, Polygon unveiled its aggregation layer, AggLayer, alongside the introduction of a groundbreaking feature known as the “Type 1 prover.” Polygon co-founder details the advancement in layer-2 [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T21:43:59.000Z",
    "title": "UK’s economy plunges into recession",
    "url": "https://www.cryptopolitan.com/uks-economy-plunges-into-recession/",
    "description": "Well, slap my face and call me shocked—the UK’s economy didn’t just stumble on a pebble; it apparently face-planted right into recession territory as of the tail end of 2023. With all the grace of a bull in a china shop, the UK managed to clock in a GDP shrinkage of 0.3% in the last [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T21:14:26.000Z",
    "title": "Valour Inc launches an ICP ETP with physical backing",
    "url": "https://www.cryptopolitan.com/valour-inc-icp-etp-with-physical-backing/",
    "description": "Valour Inc has rolled out a new spectacle in the financial circus – a physically backed Exchange Traded Product (ETP) for the Internet Computer Protocol (ICP) token. This isn&#8217;t just another day in the office for Valour; it&#8217;s a bold statement in a world where the traditional and digital finance realms are colliding with the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-15T21:51:41.000Z",
    "title": "Galaxy analysts: 20% drop in Bitcoin’s hash rate coming following halving",
    "url": "https://crypto.news/galaxy-drop-bitcoin-hash-rate-halving/",
    "description": "Galaxy Digital analysts forecast a potential reduction of 20% in network hash rate due to the impending Bitcoin halving in April."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-15T21:46:30.000Z",
    "title": "Finance groups urge SEC to revise crypto custody accounting rules",
    "url": "https://crypto.news/sec-revise-crypto-accounting-rules/",
    "description": "Financial advocacy organizations are urging the SEC to amend current accounting rules that increase the financial burden on American banks managing crypto assets for clients."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-15T21:39:38.000Z",
    "title": "Bitcoin sees $1.6b disappears from exchanges; here’s what it means for BTC’s price",
    "url": "https://crypto.news/1-6b-bitcoin-disappears-from-exchanges-heres-what-it-means-for-btc-price/",
    "description": "Bitcoin worth $1.6 billion has disappeared from crypto exchange-hosted wallets. Here's how BTC price could react."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-15T22:00:03.000Z",
    "title": "Can VeChain Reach New Heights? Analyst Predicts Potential Bull Run",
    "url": "https://www.newsbtc.com/crypto/can-vechain-reach-new-heights-analyst-predicts-potential-bull-run/",
    "description": "Bitcoin’s bullish momentum has fueled the crypto market to an upward trend. As the flagship cryptocurrency rises to the $52,000 level, several other cryptocurrencies follow its steps closely and exhibit signals of a possible bull run. Accordingly, a renowned crypto analyst has predicted a potential bull run for VeChain (VET) that could lead the token to a new all-time high (ATH). Related Reading: Bitcoin Price Rally To $75,000 Imminent Due To Massive Cup And Handle Pattern Will VeChain Repeat History? Crypto analyst Ali Martinez has shared his prediction for VET this week. The analyst believes history could repeat itself, and the cryptocurrency may see its biggest week in years. According to Martinez, VET seems to be repeating historical patterns that preceded the 2021 bull run and saw the token’s price rise to its all-time high price. In the X (former Twitter) post, the crypto analyst predicted that VET could surge to the $0.054 price range, a level it has not reached since April 2022. The chart below shows the 595-day consolidation period that preceded the 2021 bull run. The cryptocurrency moved sideways during this period before eventually breaking out and reaching its ATH of $0.281. It feels like it will be a big week for #VeChain! If history repeats itself, $VET could be looking at a move to $0.054 this week, a brief correction until June, and then a bull run to $0.70 by November! pic.twitter.com/wTdPW34NNH &#8212; Ali (@ali_charts) February 14, 2024 Similarly, the chart indicates the current 644-day consolidation period in 2022. If history repeats this week, Martinez believes VET&#8217;s pattern could follow the 2021 trend and drive the token’s price upwards to $0.054. The analyst also predicted a potential price correction that would last until June. After the correction, Martinez predicts a bull run that would skyrocket the cryptocurrency price to $0.70 by November of this year. This long-term prediction would triple VET’s previously established ATH. VET Price Action As previously reported, VET’s price broke above a significant resistance level in December 2023 before suffering a pullback. In January 2024, the cryptocurrency faced another rejection following an attempt to break out of the same $0.03 price resistance. Following the recent Bitcoin rally, VET has been tracking its movements, mirroring a trend similar to that of the flagship cryptocurrency, as the chart below shows. VET's price movement follows a similar trend to BTC during the last 7 days. Source: CoinGecko At writing time, VET is trading at $0.04625, a 5.1% surge in the last hour and a 32.3% surge in the previous 24 hours. According to CoinGecko data, cryptocurrency takes the 34th spot in market capitalization. VeChain has a daily trading volume of $195 million, representing a 68.5% increase in one day. These metrics suggest a rise in market activity for the cryptocurrency and hint at a positive sentiment among investors. However, despite Martinez’s prediction, VET’s price has a long road ahead as it is still 85.33% lower than the all-time high price achieved three years ago. Related Reading: Ethereum Bulls Keep Pushing, Why ETH Could Soon Test $3K VET price action in the 1-day chat. Source: VETUSDT on TradingView.com Featured image from Unsplash.com, Chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-15T21:28:00.000Z",
    "title": "Binance Tops In Volume and Liquidity Ahead of OKX and Other Crypto Exchanges",
    "url": "https://coinedition.com/binance-tops-in-volume-and-liquidity-ahead-of-okx-and-other-crypto-exchanges/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/OKX-to-Offer-Crypto-Trading-Signals-to-Retail-Traders-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto market research platform Kaiko has provided comparative details about two leading crypto exchanges, Binance and OKX. The details from Kaiko enable crypto users to determine that Binance, among the two crypto exchanges, has higher liquidity. Kaiko’s website showed “Market Share of Volume” as a significant metric for measuring relative volume and liquidity among multiple [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/binance-tops-in-volume-and-liquidity-ahead-of-okx-and-other-crypto-exchanges/\">Binance Tops In Volume and Liquidity Ahead of OKX and Other Crypto Exchanges</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]