[
  {
    "source": "NewsBTC",
    "date": "2023-11-01T01:00:06.000Z",
    "title": "A Chat With Dave Weisberger: Why Bitcoin Entered A “Perfect Storm”",
    "url": "https://www.newsbtc.com/bitcoin-news/a-chat-with-dave-weisberger-why-bitcoin-entered-a-perfect-storm/",
    "description": "The price of Bitcoin might be losing bullish momentum in the short term, but on higher timeframes, the cryptocurrency is likely to extend its current rally. At least, this is part of what we spoke with Dave Weisberger, co-founder and co-CEO at CoinRoutes, a liquidity and algorithmic trading tool provider for the crypto market. Related Reading: Trader Who Bought Dogecoin In 2017 Maps Out Meteoric 37500% Rise To $26 As of this writing, Bitcoin trades at $34,200 with a 2% loss in the last 24 hours. As the bullish momentum seems to fade, some analysts expect BTC to return to the critical support area of around $33,000. This area must hold if BTC bulls want to prevent a more extensive correction. Bitcoin Becoming Digital Gold, Low Selling, And The Potential For 20x Profits On the back of the current macroeconomic landscape, Bitcoin has become more relevant as a global financial asset, a store-of-value, and “gold 2.0,” according to CoinRoutes’ co-founder. Weisberger has been sharing his bullish thesis on cryptocurrency and the impact of the spot market on the current rally. During our conversation, we spoke about the Israel conflict, the current market structure, and the reasons brewing a perfect storm for BTC. This is what he told us: Q: With a delicate situation in Israel, high inflation, and talks about a potential economic recession, How is the current macroeconomic landscape impacting the Bitcoin price? A: I think that the easiest way to look at it is to understand the famous quote from Ram Emanuel when you&#8217;re in the government, never let a good emergency go to waste. The fact is I don&#8217;t believe the Federal Reserve and the treasury have a whole lot of choice anymore. There&#8217;s really only one way out of the current macro environment in a real sense. They effectively have two choices. Door number one is to deregulate like crazy, cut taxes like crazy and hope to grow your way out of it. Choice number two is choose the Japanese approach, which is to manage the yield curve to allow the government to continue to function and kick the can down the road so it&#8217;s somebody else&#8217;s problem later. I actually, I think that there are a couple of candidates that talk about doing door number one, but none of them are in power and none of them are likely to win. And even if they did win, they&#8217;re unlikely to have the congressional support to do the massive amount of deregulation it would take to lean into AI and digital assets and all the new technologies that will allow for a growth rate to be able to grow tax receipts while cutting spending on government programs and government bureaucracy. That seems highly, highly, highly unlikely. It&#8217;s what I would do, but I don&#8217;t think it&#8217;s going to be done. So then you&#8217;re stuck in a situation where you have a current administration that is continuing to add spending. James Lavish quotes, I think $1.6 trillion in new debt. It&#8217;s a $2 trillion yearly deficit. At the same time that debt service is approaching a trillion dollars and that&#8217;s at sub 5%. What happens if we get a normal yield curve with a 2% upward slope to 7% at that point, debt service would literally be debt service plus even a cut defense department would literally be the entire amount of tax receipts. So if you think about that, there is no escaping the debt spiral that we&#8217;re in. The fact is all roads lead to monetary debasement. Now whether rates are high or low, that&#8217;s an interesting question. Maybe they&#8217;ll keep short rates high to try to put the genie back in the bottle. But the fact is the Bitcoin prices is responsive to the overall amount of money, monetary aggregates and debt. And Bitcoin is quite literally growing into digital gold. And digital gold. If you look at the monetary aggregates or monetary value of gold would imply a Bitcoin price. That&#8217;s 15 to 20 times where it currently is. So when you look at Bitcoin at 34,000, it&#8217;s like, okay, it&#8217;s well bid there and we&#8217;ve seen it over the last few days. When Larry Fink started making this case a few months ago, a couple months ago, it triggered a massive rally. Well now we have Mohamed El-Erian making this case one of the most widely respected bond analysts and just yesterday, Stanley Druckenmiller making this case. So you&#8217;re starting to get a shift in the opinion leaders of the economy to say this (BTC) is a hedge against a looming fiscal disaster debt disaster. At some point, Bitcoin will reach a tipping point. Now your question was about the Israel situation. The fact of the matter is ever since Napoleon, the world knows entering a two front war is probably not going to go well for your fiscal policy. &#160; Q: From a broader perspective, how do the dynamics between spot buying and derivatives trading impact the overall health and sustainability of a potential crypto bull run? Do you think BTC is poised for further profits? A: Look at CoinRoutes. Our client volumes almost doubled in October compared to September when there&#8217;s any interest in this market, liquidity comes out. There&#8217;s an old expression in trading; order flow begets order flow, liquidity begets liquidity. The fact is the crypto markets function extraordinarily well. The fact of the matter is sometimes the volatility in crypto happens because there&#8217;s too much speculation around the edges because perpetual swaps are a much more efficient way of getting leverage than option markets are, for example, and the US people in equities use options to get leverage. It&#8217;s much more expensive than perpetual swaps. So the crypto market has this dynamic of a small percentage of the actual liquidity speculating in perpetual swaps around the edges and moves. Things like what we saw this (past weeks) when there was the (Bitcoin ETF) fake news event. It&#8217;s kind of funny, the fake news event took Bitcoin from $28,000 to $31,000 in a blink all in the perpetual swaps markets. The spot market moved, but it wasn&#8217;t a lot of trading going on because it went up and came right back down. But a funny thing happened, people who were short realized, “oh my god, if this news does come out, I&#8217;m going to get carried out in a body bag. I better not short it.” So the natural spot buying that was going on became relentless and pushed the price to now we&#8217;re well beyond what are we, 25% above where it was before that fake news story came out. (…) it basically proves that it was spot buying, not derivative buying because when derivative buying or derivative selling creates a market move, you see gaps in where the perpetual swap gets to be too expensive or much cheaper. When we saw that, if you remember the move down from $29,000 to $26,000 a few months ago, that was a fast five-minute move that move featured perpetual swap prices over a thousand dollars per Bitcoin below the bid on spot markets. And so that was obviously a single de-leveraging event, and that happens and you see it. But what happened last Monday was clearly spot-led because the premium never moved. I mean, it literally never moved. It was moved. The spot actually market led the derivative markets higher. And so there are clearly spot buyers and what&#8217;s going on is something that I&#8217;ve been chronicling for about eight months, which is we&#8217;ve had patient spot accumulation and you can see that in two ways. If you look at the way things lined up over the last few weeks, the speculators got carried out and saw that in a rally there were no sellers. Well, that&#8217;s really scary. If you&#8217;re short, you have the condition for what some people would call a God candle. I don&#8217;t know about a God candle or otherwise. I think that the most bullish thing Bitcoin can do is stabilize at this level for another few weeks (…). We had seven months of no volatility in that period of time. People levered up on the short side and that&#8217;s why this move was so strong. &#160; Q: You mentioned this earlier in your analysis, but can you tell us why Bitcoin entered a “Perfect Storm” scenario? A: I wouldn&#8217;t call it a perfect storm because US regulators are still trying to shut down crypto because crypto is ultimately, it&#8217;s not really crypto, it&#8217;s digital assets. They&#8217;re trying to shut it down, slow it down, and stop it from overtaking the incumbents in finance. The fact is the US has the number one capital markets in the world. 50% of investible assets are here despite being what 4% of the world&#8217;s population that is on the back of having the most efficient analog financial system. So the incumbents would love to delay digitalization or co-opt it. So that&#8217;s the one thing that&#8217;s going on that&#8217;s not perfect. But the perfect storm aspects of it are overseas. So yesterday the UK came out and basically said, listen, “if you&#8217;re going to let us be the global hub for digital finance, we&#8217;re going to be (…).” And that is more or less exactly what happened and why the London became the big financial center. It is because of the Eurodollar market, because US regulators pushed the Eurodollar market out of the US and of course it became headquartered in London. So history may not often repeat, but it does rhyme and we see that. But take the regulation to the side, the perfect storm is very simple. It&#8217;s burgeoning deficits and monetary debasement on a global scale (…). (…) fiat currencies have never in financial history ended with anything other than debasement ever, because governments who have the ability to print money out of thin air will do so until the market stops them. It is becoming more and more evident to anybody that the fiat experiment of Bretton Woods, which started in 1971, which isn&#8217;t very long in monetary epoch, is coming to an end. Now, will it come to an end now or could we extend it for another 10 to 15 years? Maybe 20? Yeah, maybe. But if you do that, then what&#8217;s going to happen (…). Related Reading: XRP Price Confirms Breakout Above Multi-Month Resistance: Next Targets So if you think about a perfect storm, we have an emerging digital society that&#8217;s more and more global every day. We need a store of value that people can save in. They want to spend in dollars. And that&#8217;s why Tether and stable coins are so important, but they want to save in something that&#8217;s a store of value. Bitcoin solves the part of the equation that&#8217;s saving not spending. That&#8217;s why, yeah, at some point you need the scaffolding to be able to spend the bits or lightning or whatever to be able to spend Bitcoin, but not at these levels. If you&#8217;re a Bitcoin holder, why are you buying a cup of coffee with Bitcoin? You want to be made fun of, like the pizza guy, doesn&#8217;t make sense because you think it&#8217;s going to go up 20, 30 or more times. That makes it a very expensive cup of coffee. So, Bitcoin is a savings vehicle and stable coins are a spending vehicle, and Ethereum is a technology platform to allow the world to go more and more digital. And so all of these things are happening and the meta trends are all for them. The macro trends in the economy are all for monetary debasement and trying to get out of a debt spiral. And the more geopolitical instability, the more likely that debt spiral is to materialize. Cover image from Unsplash, chart from Tradingview"
  }
]