[
  {
    "source": "Decrypt",
    "date": "2023-06-19T11:56:14.000Z",
    "title": "Binance Issues Cease and Desist to Nigerian ‘Scammer Entity’",
    "url": "https://decrypt.co/145223/binance-issues-cease-and-desist-to-nigerian-scammer-entity",
    "description": "Binance CEO Changpeng Zhao denounced \"Binance Nigeria Limited\" as a fraudulent company in a post on Twitter."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-19T12:00:00.000Z",
    "title": "CertiK receives $500K bounty after Sui blockchain threat discovery",
    "url": "https://cointelegraph.com/news/certik-bounty-sui-blockchain-threat-discovery",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/7d2aef21-6826-490d-ad05-faf18d8c25c1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The vulnerability dubbed “HamsterWheel” traps nodes in an endless loop similar to hamsters jogging on a wheel. </p>\n                    <p><p>Blockchain security firm CertiK has received a bounty of $500,000 from the Sui network after flagging a threat that had the potential to disrupt Sui's entire layer-1 blockchain.</p><p>In an announcement sent to Cointelegraph, the CertiK team highlighted that the vulnerability dubbed \"HamsterWheel\" was different from traditional attacks which focus on shutting down blockchains by crashing nodes. </p><p>This attack traps nodes, letting them perform operations without processing new transactions, similar to hamsters jogging on a wheel. The attack has the capability to cripple networks and make them unable to operate. </p><p>The security firm discovered the vulnerability and reported it to Sui ahead of its mainnet launch. Responding to the security threat, the Sui network implemented fixes to prevent the potential damages that an attack could inflict on the blockchain. </p><p>To appreciate CertiK’s efforts, Sui awarded a $500,000 bounty to the security firm. According to CertiK, this highlights the importance of bug bounty programs and proactive security efforts. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/hackers-use-mining-pools-as-mixers-chainalysis-report\"><strong><em>Here’s how hackers are using mining pools as mixers: Chainalysis</em></strong></a></p><p>Kang Li, chief security officer at CertiK, said that threats to blockchain networks are constantly evolving. \"The discovery of the HamsterWheel attack demonstrates the evolving sophistication of threats to blockchain networks,” Li explained. </p><p>According to the announcement, more technical details will be published and made available soon. Moreover, full reports will be announced once all mitigations have been deployed and thoroughly tested. </p><p>Meanwhile, in the <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> space, a crypto trading bot has <a href=\"https://cointelegraph.com/news/crypto-trading-bot-borrows-200m-for-a-3-gain\">taken a $200 million loan</a> to secure a $3 profit. On June 14, an arbitrage bot performed a series of complicated transactions, including borrowing 200 million DAI (<a href=\"https://cointelegraph.com/dai-price-index\">DAI</a>) in MakerDAO and ended up with a total gain of $3.24. A community member praised the bot’s efforts and said “profit is profit” while another said that this was a sign of how bad the crypto bear market is. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethics-101-crypto-projects-negotiate-hackers/\"><strong><em>Should crypto projects ever negotiate with hackers? Probably</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-19T12:00:00.000Z",
    "title": "Hawkish Fed, stocks market rally, and crypto falling behind",
    "url": "https://cointelegraph.com/news/hawkish-fed-stocks-market-rally-and-crypto-falling-behind",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/55e1d685-3733-4dc1-8729-bbb197b9b20d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cointelegraph analyst and writer Marcel Pechman explains why the cryptocurrency market has been falling behind the stock market after the Fed’s hawkish stance.</p>\n                    <p><p><em>Macro Markets, hosted by crypto analyst Marcel Pechman, airs every Friday on the Cointelegraph Markets &amp; Research YouTube channel and explains complex concepts in layperson’s terms, focusing on the cause and effect of traditional financial events on day-to-day crypto activity.</em></p><p>Episode 13 of Cointelegraph’s Macro Markets begins by exploring why the United States Federal Reserve’s latest move has been pinned on the stock market rally. According to Cointelegraph analyst Marcel Pechman, part of the market was doubtful that the Fed would continue to sustain interest rates above 5% for the remainder of 2023 as the risks of an economic recession increase, but apparently, they were wrong.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/NrfdKHSSOkQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Pechman states that the U.S. government signaled it is not afraid of unemployment and weaker corporate earnings as long as inflation is controlled. Therefore, the most probable reasons for the U.S. stock market rally were the risk of the Fed raising interest rates — which did not materialize — and the recent macroeconomic data, which came in at 4% inflation and 1.6% retail sales growth.</p><p>Meanwhile, according to Pechman, the crypto regulatory environment is definitively unfavorable, and the two biggest risks for the U.S. dollar have dissipated: the debt ceiling and out-of-control inflation. Thus, considering the weak real estate sector, investors seem correct to pick the stock market as their preferred instrument in the coming months.</p><p>The next part of the show discusses the European Central Bank (ECB) raising interest rates for the eighth successive time. For Pechman, it became clear that the ECB hasn’t been as hawkish as the U.S. Federal Reserve and is now playing catch-up on its 3.5% basic interest rate.</p><p>Pechman explains how credit default swaps work and shows the distortion between U.S. and European countries’ risk according to markets’ pricing. His conclusion? Perhaps the U.S. dollar will hold its dominant reserve status for longer than expected. However, the odds are not looking great for the euro, as the region has already entered a technical recession after two successive quarters of negative growth.</p><p>If you want exclusive and valuable content from leading crypto analysts and experts, subscribe to the <a href=\"https://www.youtube.com/@cointelegraphmarketresearch\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets &amp; Research YouTube channel</a>, and join us on Macro Markets every Friday.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-19T11:47:15.000Z",
    "title": "Binance CEO says Netherlands remains “progressive” despite failure to secure critical license",
    "url": "https://cryptoslate.com/binance-ceo-says-netherlands-remains-progressive-despite-failure-to-secure-critical-license/",
    "description": "<p>Binance CEO Changpeng &#8216;CZ&#8217; Zhao said Netherlands&#8217; posture towards crypto remains &#8220;pretty progressive&#8221; despite his exchange&#8217;s failed registration as a virtual asset service provider (VASP), according to a June 19 tweet. CZ&#8217;s statement was in response to a user who criticized Netherlands&#8217; Central Bank, De Nederlandsche Bank (DNB), for refusing to grant foreign entities licenses [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-ceo-says-netherlands-remains-progressive-despite-failure-to-secure-critical-license/\">Binance CEO says Netherlands remains &#8220;progressive&#8221; despite failure to secure critical license</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-19T12:00:00.000Z",
    "title": "'Ethscriptions' Ordinals Arrive On Ethereum",
    "url": "https://cryptodaily.co.uk/2023/06/ethscriptions-ordinals-arrive-on-ethereum",
    "description": "<p class=\"md-end-block md-p\">Ethereum users are being given a fresh way to create nonfungible tokens (NFTs) and other digital assets on the blockchain following the launch of a new protocol called \"Ethscriptions.\"</p>\n<p class=\"md-end-block md-p\">Launched on June 17 by music website Genius.com's co-founder Tom Lehman, Ethscriptions aims to revolutionize Ethereum-based digital asset creation and was quickly met with a high degree of enthusiasm, generating almost 30,000 Ethscriptions within the first 18 hours.</p>\n<p class=\"md-end-block md-p\">Taking inspiration from the popular Bitcoin (BTC) Ordinals protocol &mdash; where assets are known as &ldquo;inscriptions&rdquo; &mdash; Ethscriptions promises to enhance the way digital assets are minted on the Ethereum network. </p>\nThe Protocol: Leveraging Ethereum's Calldata for Improved Minting\n<p class=\"md-end-block md-p\">Lehman, who is also known by the pseudonym Middlemarch on Twitter, declared the project a \"huge success.\" Ethscriptions employs Ethereum's \"calldata,\" which refers to the data held within a smart contract, to allow for a \"cheaper\" and \"more decentralized\" minting process compared to conventional smart contract-based methods.</p>\n<p class=\"md-end-block md-p\">At present, the protocol limits users to image-only inscriptions, but Lehman assures that Ethscriptions will accommodate different file types in the future. Current protocol specifications permit users to \"ethscribe\" any image provided it's less than 96 kilobytes in size.</p>\n<p class=\"md-end-block md-p\">Lehman&rsquo;s first project on the Ethscriptions protocol, the \"Ethereum Punks,\" witnessed a significantly positive response from the community. All 10,000 assets were claimed almost instantaneously, reinforcing the positive acceptance of the protocol by the community.</p>\nChallenges and Potential: Navigating the Ethereum Ecosystem\n<p class=\"md-end-block md-p\">Despite the initial success, the project's launch caused so much user activity that the API interface for the official Ethscriptions website temporarily crashed, indicating possible infrastructure challenges.</p>\n<p class=\"md-end-block md-p\">Given the existing infrastructure that enables the creation of NFTs and other digital assets on the Ethereum network, it remains uncertain whether Ethscriptions will achieve the same level of popularity as Bitcoin Ordinals. Within six months, the total number of Ordinals inscribed on Bitcoin skyrocketed from zero to 10 million, driven primarily by users' fascination with minting assets and the novelty of minting entirely new tokens through the BRC-20 token standard on the Bitcoin network.</p>\n<p class=\"md-end-block md-p\">The launch of the Ethscriptions protocol on Ethereum presents a significant development for digital asset creation on the blockchain. The Ethereum ecosystem continues to evolve and innovate, and it becomes clearer over this period that initiatives like Ethscriptions could potentially introduce new dynamics and possibilities. While the immediate impact is promising, the long-term success of this novel approach to asset creation remains to be seen.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T11:53:29.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "NullTX",
    "date": "2023-06-19T11:43:27.000Z",
    "title": "Cryptocurrency Derivatives: An Introduction To Futures, Options, And Trading Strategies",
    "url": "https://nulltx.com/cryptocurrency-derivatives-an-introduction-to-futures-options-and-trading-strategies/",
    "description": "The world of cryptocurrencies has gained immense popularity over the years, with Bitcoin and other digital assets becoming familiar names. While this concept may seem complex at first, understanding cryptocurrency derivatives is crucial for anyone looking to delve into the world of crypto trading. Definitions Cryptocurrency derivatives are financial contracts that derive their value from [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-19T12:00:00.000Z",
    "title": "Chainlink vs. InQubeta: comparing growth potential",
    "url": "https://crypto.news/chainlink-vs-inqubeta-comparing-growth-potential/",
    "description": "InQubeta aims to leverage AI technology in crypto fundraising while Chainlink is a decentralized oracle provider. Both stand to gain in 2023"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-19T11:50:50.000Z",
    "title": "ZachXBT Legal Fight Turns Into Funding Success, Over $1 Million Raised",
    "url": "https://www.newsbtc.com/news/zachxbt-legal-fight-turns-into-funding-success-over-1-million-raised/",
    "description": "ZachXBT, a highly respected blockchain sleuth, has sparked an outpouring of support from the cryptocurrency community after revealing a defamation lawsuit stemming from one of his previous investigations.  In a remarkable show of solidarity, donations exceeding $1 million have flooded in from crypto enthusiasts across the globe, rallying to fund his legal defense. Taking to Twitter, ZachXBT shared a digital wallet address on Friday, accompanied by commentary detailing the lawsuit filed by Jeffrey Huang, known online as &#8220;Machi Big Brother.&#8221; Huang&#8217;s claim centers on an article published by ZachXBT a year ago, wherein he accuses Huang of embezzling millions of dollars&#8217; worth of Ethereum from Formosa Financial, a defunct crypto treasury management platform co-founded by Huang. A year ago, @zachxbt published a Medium article about me that damaged my reputation. Today, I have filed a defamation lawsuit against him in the United States District Court for the Western District of Texas. — Machi Big Brother (@machibigbrother) June 16, 2023 Crypto Community Rallies For ZachXBT ZachXBT has expressed that his legal defense could potentially exceed the staggering sum of $1 million. Notably, the digital assets amassed in the wallet shared by ZachXBT have already surpassed this target, consisting mostly of stablecoins, as revealed by Nansen Portfolio. Highlighting the financial dynamics at play, ZachXBT remarked: &#8220;My understanding is that Machi is very wealthy. I am not. He is using his money to try to silence me.&#8221;  In a remarkable show of support, numerous crypto executives have stepped up to contribute to ZachXBT&#8217;s cause, commending his invaluable contributions to the crypto and Web3 industries.  Jesse Powell, the co-founder of Kraken, extended his gratitude, acknowledging ZachXBT&#8217;s impactful work and pledging a donation of 10 Ether (ETH), equivalent to approximately $17,000. In for 10 ETH. Thanks for all that you do. Good luck. — Jesse Powell (@jespow) June 18, 2023 Similarly, Changpeng &#8220;CZ&#8221; Zhao, the CEO of Binance, lauded ZachXBT in a tweet, urging him to continue fostering transparency within the industry, while pledging a generous $50,000 contribution from Binance towards his legal fees. #Binance will contribute $50k. Keep up the fight. Keep the industry transparent. 💪 — CZ 🔶 Binance (@cz_binance) June 17, 2023 Meanwhile, Sandeep Nailwal, the founder of Polygon, joined the ranks of supporters by pledging a donation of 5 ETH, valued at approximately $8,600 at the time of writing. ZachXBT&#8217;s Commitment To Transparency Throughout the years, ZachXBT has maintained a vigilant and critical approach when examining diverse crypto projects and on-chain occurrences. His unwavering dedication has involved unmasking fraudulent entities, cautioning against possible scams, and fearlessly delving into hacks to elucidate the underlying causes of exploits, all of which he fearlessly shares with his Twitter followers. Bitcoin reclaims the $26K level on the daily chart: TradingView.com In a demonstration of his integrity and commitment to transparency, ZachXBT made a commitment on Friday. He pledged that any remaining funds donated to support his legal defense would be promptly returned to the contributors in a pro-rata fashion. This approach ensures that individuals will receive back their respective portion of the funds based on the proportion they initially contributed compared to the total sum. Featured image from Yahoo/The Defiant"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T12:00:35.000Z",
    "title": "91% of Shiba Inu holders are losing money, Tradecurve holders already received 80% Up",
    "url": "https://www.crypto-news-flash.com/91-of-shiba-inu-holders-are-losing-money-tradecurve-holders-already-received-80-up/?utm_source=rss&utm_medium=rss&utm_campaign=91-of-shiba-inu-holders-are-losing-money-tradecurve-holders-already-received-80-up",
    "description": "The cryptocurrency market is an unpredictable space where investors strive to find profitable opportunities. Recently, Shiba Inu, a popular meme-based token, has gained significant attention but has left many holders facing losses.  On the other hand, Tradecurve, a rising star in the crypto exchange realm, has been providing its token holders with remarkable returns on [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T11:42:54.000Z",
    "title": "Breaking Development News: IOTA’s Core Node Progress Surges, Decentralization Milestones Reached",
    "url": "https://www.crypto-news-flash.com/breaking-development-news-iotas-core-node-progress-surges-decentralization-milestones-reached/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-development-news-iotas-core-node-progress-surges-decentralization-milestones-reached",
    "description": "The IOTA core development team has made advancements in key areas including accounts and mana, tips and reference selection, and engine switching. The IOTA core node is now able to process Stardust transactions in a fully decentralized environment. The IOTA Foundation continues to make progress with respect to new developments for the IOTA core along [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-19T12:08:00.000Z",
    "title": "Binance CEO Breaks Silence on Dutch Market Exit, Denies Beef with DNB",
    "url": "https://coinedition.com/binance-ceo-breaks-silence-on-dutch-market-exit-denies-beef-with-dnb/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/06/Changpeng-Zhao-5-1.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In response to recent speculations surrounding Binance&#8217;s decision to exit the Dutch market, CEO Changpeng Zhao has shed light on the matter, urging caution not to read too much into the situation. Emphasizing the intricacies of Binance as a large and complex platform, Zhao hinted at the existence of simpler alternatives for Dutch investors through [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-ceo-breaks-silence-on-dutch-market-exit-denies-beef-with-dnb/\">Binance CEO Breaks Silence on Dutch Market Exit, Denies Beef with DNB</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-19T11:49:00.000Z",
    "title": "Binance Donation in ZachXBT Defamation Lawsuit Sparks Controversy",
    "url": "https://coinedition.com/binance-donation-in-zachxbt-defamation-lawsuit-sparks-controversy/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/binance8-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/binance8-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/binance8-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/binance8-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/binance8-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/binance8-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/binance8-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/binance8-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/binance8-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/binance8-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/binance8-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/binance8-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/binance8-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/binance8-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/binance8-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/binance8-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/06/binance8.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a surprising turn of events, the CEO of Binance, Changpeng Zhao (CZ), has found himself amid controversy as his exchange provided financial support to ZachXBT in his defamation lawsuit filed by Jeffrey Huang, also known as Machi Big Brother. Binance’s support of $50,000 to ZachXBT came shortly after Machi sent his Bored Ape Yacht [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-donation-in-zachxbt-defamation-lawsuit-sparks-controversy/\">Binance Donation in ZachXBT Defamation Lawsuit Sparks Controversy</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-19T11:45:59.000Z",
    "title": "Crypto Strategist Predicts Parabolic Bitcoin Move, Says BTC Could Catch Fire With Single Spark",
    "url": "https://dailyhodl.com/2023/06/19/crypto-strategist-predicts-parabolic-bitcoin-move-says-btc-could-catch-fire-with-single-spark/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/Mike-McGlone-on-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/Mike-McGlone-on-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/Mike-McGlone-on-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/Mike-McGlone-on-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/Mike-McGlone-on-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/Mike-McGlone-on-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/Mike-McGlone-on-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed analyst believes that Bitcoin&#8217;s (BTC) latest correction is setting up the crypto king for a parabolic surge. Pseudonymous analyst Credible Crypto tells his 340,800 Twitter followers that Bitcoin&#8217;s retracement from above $30,000 is part and parcel of an uptrend that could push BTC to fresh yearly highs. The crypto strategist predicts a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/19/crypto-strategist-predicts-parabolic-bitcoin-move-says-btc-could-catch-fire-with-single-spark/\">Crypto Strategist Predicts Parabolic Bitcoin Move, Says BTC Could Catch Fire With Single Spark</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-06-19T11:52:12.000Z",
    "title": "Bitfinex Pay Merchant Dashboard – Release V0.4",
    "url": "https://blog.bitfinex.com/bitfinex-pay/bitfinex-pay-merchant-dashboard-release-v0-4/",
    "description": "<p>The Bitfinex Pay Merchant Dashboard is an internal tool designed to provide our Merchants with powerful reports and features to manage their Merchant crypto gateway. We’re pleased to share the latest updates to Bitfinex Pay. For more on Bitfinex Pay, please refer to https://blog.bitfinex.com/category/bitfinex-pay/. Merchant...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/bitfinex-pay/bitfinex-pay-merchant-dashboard-release-v0-4/\">Bitfinex Pay Merchant Dashboard &#8211; Release V0.4</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]