[
  {
    "source": "Crypto Briefing",
    "date": "2024-01-29T09:27:45.000Z",
    "title": "Stellar Development Foundation delays Protocol 20 upgrade following bug discovery",
    "url": "https://cryptobriefing.com/stellar-development-foundation-delays-protocol-20-upgrade-following-bug-discovery/?utm_source=feed&utm_medium=rss",
    "description": "The bug, discovered on January 25th, relates to fee-bump transactions for Soroban smart contracts on the Stellar blockchain."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-29T09:30:16.000Z",
    "title": "Birdeye refutes airdrop plans in latest announcement",
    "url": "https://crypto.news/birdeye-refutes-airdrop-plans-in-latest-announcement/",
    "description": "Crypto trading aggregator Birdeye has unveiled a new feature to customize the data pool, while also addressing speculations surrounding a potential airdrop. In an X post on Jan. 27, Birdeye unveiled a tool called &#8220;Terminal,&#8221; designed to empower users to&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-29T09:20:01.000Z",
    "title": "Bitcoin Eyes $45,000 Amid Anticipation Of FOMC Decision",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-eyes-45000-amid-anticipation-of-fomc-decision/",
    "description": "After a challenging two weeks resulting in a 21% drop, the Bitcoin (BTC) price rebounded emphatically, closing last week on a strong note. The premier cryptocurrency witnessed a surge that saw it end with a Doji Hammer candle on its weekly chart, signaling a potential bullish reversal. Notably, this uptick has propelled Bitcoin&#8217;s value back into its previous range of $41,300 to $45,000. Keith Alan, the co-founder of Material Indicators, highlighted the significance of this pattern, stating, “Looks like we have a Doji Hammer candle forming on the BTC Weekly chart. That typically indicates a bullish reversal is coming. [&#8230;] If we do indeed print a Hammer, Bitcoin bulls will need to overcome resistance at the bottom range of the Golden Pocket to have a chance at a meaningful move to retest the $44k &#8211; $45k range.” Bitcoin has also reclaimed its position above the 20- and 50-day Exponential Moving Averages (EMAs), hinting at the potential for further gains. However, the anticipation surrounding the first Federal Open Market Committee (FOMC) meeting of 2024 adds a layer of complexity to Bitcoin&#8217;s trajectory. FOMC Preview The upcoming Federal Open Market Committee (FOMC) meeting, is anticipated to be a major determinant in the short-term movement of Bitcoin&#8217;s price, as it could signal significant shifts in the United States Federal Reserve&#8217;s monetary policy approach. Macro analyst @tedtalksmacro provided an in-depth perspective: “This week&#8217;s FOMC meeting is pivotal.” Currently, the market is expecting the Fed to maintain the status quo, with a 97% probability against any policy change. Related Reading: Bitcoin Whales Increase Their Holdings By $3 Billion – Is A Price Surge Imminent? “However, there&#8217;s a 46% chance of a rate cut by the March meeting. Investors should closely monitor for signs of the Fed moving towards a data-dependent approach, any recognition of inflation nearing their 2% target, and potential adjustments to Quantitative Tightening (QT) policies,” Ted remarked. After this week, the Committee will meet again on March 19-20. Thus, this week’s FOMC meeting could lay the foundation for the critical decisions in March, which could have immediate and pronounced effects on market dynamics. The Federal Reserve has forecasted that it will reduce interest rates three times this year. The market anticipates a possibility of five or more cuts. There is a general agreement that the initial reduction in rates might occur in the second quarter, though there is substantial support for the possibility of it happening at the March meeting. Goldman Sachs has been consistently predicting a rate cut by the Fed in March. Their analysis is grounded in the significant progress observed in inflation control. Related Reading: Analyst Predicts Bitcoin Consolidation, Eyes Long-Term Price Target Of $500,000 The post-FOMC meeting press conference will be a focal point, as investors seek clarity on the collective view of the FOMC members, including the newly rotated regional Fed bank presidents. These officials, known for their cautious approach towards rate cuts, will play a significant role in shaping the committee&#8217;s decision-making process. December&#8217;s inflation report indicated a 3.4% year-on-year increase, with core prices rising more rapidly than many economists had projected. However, the Department of Commerce’s personal consumption expenditures (PCE) index, the Fed&#8217;s preferred inflation measure, showed more promising signs of inflation cooling down to 2.9%, aligning closer to the Fed&#8217;s target. Implications For The Bitcoin Price Renowned crypto analyst @ColdBloodShill drew attention to the historical inverse correlation between the DXY (Dollar Index) and Bitcoin. He shared the following chart and stated: “Heard you needed some hopium. The last two FOMC events have marked the pico top of the DXY. Next one on Wednesday.” A potential drop in the DXY following the FOMC meeting could act as a catalyst for Bitcoin to rise towards the $45,000 mark. In addition, there are possible changes in QT policy that could indicate an increase in the supply of money. Such developments could serve as a major catalyst for the Bitcoin price as the hardest asset of the world. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-29T09:19:50.000Z",
    "title": "Over 600K Claims for $WEN with Hours to Deadline",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/over-600k-claims-for-wen-with-hours-to-deadline/",
    "description": "<p>With less than 7 hours remaining before the claim window closes, this unprecedented rush highlights the growing interest in WEN. WEN has captured the attention of both seasoned investors and newcomers to the crypto world. WEN&#8217;s Popularity Soars as Claim Window Nears Closure WEN is a very early coin with $149M in marketcap in just [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/over-600k-claims-for-wen-with-hours-to-deadline/\">Over 600K Claims for $WEN with Hours to Deadline</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-29T09:18:00.000Z",
    "title": "Breaking: Hong Kong Will Launch Its Spot Bitcoin ETF Post Spring Festival",
    "url": "https://coinedition.com/breaking-hong-kong-will-launch-its-spot-bitcoin-etf-post-spring-festival/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Harvest Hong’s SFC Promotes ETFs; Harvest Applies for BTC ETF\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1.jpg 730w, https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/01/BTC-ETF-1-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bitcoin ETFs have been largely garnering attention since their launch on January 11, with more and more ETF issuers stepping forward. Recent reports unearthed that one of China’s largest fund companies, Harvest Hong Kong, applied for a Spot Bitcoin ETF launch on January 26. According to the report, Harvest Hong Kong, the first company to [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/breaking-hong-kong-will-launch-its-spot-bitcoin-etf-post-spring-festival/\">Breaking: Hong Kong Will Launch Its Spot Bitcoin ETF Post Spring Festival</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]