[
  {
    "source": "CoinDesk",
    "date": "2023-08-04T10:21:52.000Z",
    "title": "Bitcoin Miners Are Adding Significant Capacity: Bernstein",
    "url": "https://www.coindesk.com/business/2023/08/04/bitcoin-miners-are-adding-significant-capacity-bernstein/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Larger miners with a low cost of production and low debt are likely to be the big beneficiaries of increased capacity, the report said."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-04T10:34:57.000Z",
    "title": "Worldcoin Bug Allowed Anyone to Become Orb Operator: CertiK",
    "url": "https://decrypt.co/151279/worldcoin-bug-allowed-anyone-become-orb-operator-certik",
    "description": "The Worldcoin team has reportedly confirmed the security vulnerability and issued the required fix to the issue. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T10:21:32.000Z",
    "title": "Massachusetts launches probe into AI in securities industry",
    "url": "https://cointelegraph.com/news/massachusetts-launches-probe-into-ai-in-securities-industry",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/19bb12ab-ec41-4c35-b508-b1b72e074318.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Massachusetts securities regulators are seeking to ensure that AI applications in the securities industry wouldn't harm the interests of their users.</p>\n                    <p><p>Massachusetts securities regulators have started a new investigation into the use of artificial intelligence (AI) in the securities industry, after becoming increasingly concerned about the implications.</p><p>On Aug. 3, Massachusetts Secretary of the Commonwealth William Galvin officially <a href=\"https://www.sec.state.ma.us/divisions/news/left-story.htm\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> an investigation into the ways in which firms may be using AI in their interactions with Massachusetts investors.</p><p>Galvin’s securities division on Aug. 2 sent letters of inquiry to a number of registered and unregistered firms known to be using or developing the use of AI for business purposes in the securities industry. The authority sought data on the matter in which companies may be using AI in their activities and operations.</p><p>The firms included in the investigatory sweep have been given until Aug. 16, 2023 to respond to the regulator’s inquiries.</p><p>“Of particular interest to Galvin are the supervisory procedures that firms have in place regarding artificial intelligence, and whether those systems ensure that the AI will not put the interests of the firm ahead of the interests of their clients,” the regulator said. For those firms that have already deployed AI, the securities division will also be assessing the disclosure policies.</p><p>According to Galvin, United States securities regulators have a crucial role to play when it comes to AI and its possible implications for investor protection. He added:</p><blockquote>“If deployed without the guardrails necessary to ensure proper disclosure and consideration of conflicts, I am concerned that this technology could result in harm to investors.”</blockquote><p>Additionally, Massachusetts securities regulators are also questioning certain companies about any marketing materials provided to investors that may have been created using AI.</p><p>The Massachusetts securities division did not immediately respond to Cointelegraph’s request for comment.</p><p>AI has been increasingly becoming a subject of global regulatory concerns in recent years, which comes naturally with the rapid growth of the technology. In the second fiscal quarter of 2023, <a href=\"https://cointelegraph.com/news/ai-mentions-skyrocket-in-major-tech-q2-calls\">mentions of AI in earnings calls for major tech companies skyrocketed</a>. For example companies like Intel mentioned nearly 300% more in Q2 2023 than during its first-quarter call.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-gary-gensler-ripple-ai-strengthen-enforcement-regime\"><strong><em>SEC’s Gary Gensler believes AI can strengthen its enforcement regime</em></strong></a></p><p>But some major regulators have alarmed potential risks coming with AI years before. For example, the Financial Stability Board <a href=\"https://www.fsb.org/wp-content/uploads/P011117.pdf\" target=\"_blank\" rel=\"noopener nofollow\">raised</a> concerns about AI and machine learning in financial services back in 2017.</p><p>The FSB specifically argued that AI and machine learning services were increasingly being offered by a small handful of large technology firms. “There is the potential for natural monopolies or oligopolies,” the FSB wrote, adding that competition issues could be translated into financial stability risks.</p><p>“If one of them were to face major disruption or insolvency, there would be major repercussions in the world of finance,” the regulators argued at the time.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-ai-content-cannibalization-problem-threads-a-loss-leader-for-ai-data/\"><strong><em>AI Eye: AI’s trained on AI content go MAD, is Threads a loss leader for AI data?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-04T10:10:41.000Z",
    "title": "DOJ pushes for jail for ex-FTX CEO for ‘improperly discrediting’ witness",
    "url": "https://cryptoslate.com/doj-pushes-for-jail-for-ex-ftx-ceo-for-improperly-discrediting-witness/",
    "description": "<p>The U.S. Department of Justice (DOJ) is still insisting Sam Bankman-Fried, the disgraced FTX founder, be jailed pending trial after his counsels conceded that he shared Caroline Ellison&#8217;s diary with the New York Times, according to an Aug. 3 court filing. The DOJ claimed the action of the former FTX CEO in sharing the diary [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/doj-pushes-for-jail-for-ex-ftx-ceo-for-improperly-discrediting-witness/\">DOJ pushes for jail for ex-FTX CEO for &#8216;improperly discrediting&#8217; witness</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T10:34:16.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here&#8217;s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T10:29:51.000Z",
    "title": "Binance expands loan services with Shiba Inu as a collateral asset",
    "url": "https://www.cryptopolitan.com/binance-expands-loan-services-with-shiba-inu-as-a-collateral-asset/",
    "description": "August 4th marked a milestone for the crypto community as Binance, the world&#8217;s leading cryptocurrency exchange, unleashed its latest move in decentralized finance. In a strategic expansion, Binance&#8217;s Flexible and VIP Loan services now include 22 additional loanable and collateral assets. Among the newly revealed collateral assets, Shiba Inu, Compound, and Theta Network have caught ... <a title=\"Binance expands loan services with Shiba Inu as a collateral asset\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-expands-loan-services-with-shiba-inu-as-a-collateral-asset/\" aria-label=\"More on Binance expands loan services with Shiba Inu as a collateral asset\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T10:19:47.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices considering investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it brings. For ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-04T10:35:48.000Z",
    "title": "Bitcoin And Crypto Alert: The Implications Of Bill Ackman’s 30-Year T-Bills Short",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-crypto-implications-bill-ackman-30-y-t-bills-short/",
    "description": "What does this mean for Bitcoin and the broader crypto market? In a surprising move that has sent ripples through the financial world, billionaire hedge fund manager Bill Ackman recently announced that he is shorting 30-year Treasury bills. Ackman predicts that yields could soon skyrocket to 5.5%, a move he is positioning as a hedge against the impact of long-term rates on stocks in a world he believes will be characterized by persistent 3% inflation. &#8220;I have been surprised how low US long-term rates have remained in light of structural changes that are likely to lead to higher levels of long-term inflation,&#8221; Ackman wrote on Twitter. He cited factors such as de-globalization, higher defense costs, the energy transition, growing entitlements, and the greater bargaining power of workers as potential drivers of this inflation. Ackman also pointed to the overbought nature of long-term Treasurys and the increasing supply of these securities due to the U.S.&#8217;s $32 trillion debt and large deficits. &#8220;When you couple new issuance with QT, it is hard to imagine how the market absorbs such a large increase in supply without materially higher rates,&#8221; he added. Remarkably, the 30 year yield climbed to 4.28% yesterday. However, not everyone agrees with Ackman&#8217;s perspective. Ram Ahluwalia, CEO of Lumida Wealth, suggested that Ackman&#8217;s views might already be priced into the market. &#8220;When someone has an idea, especially a hedge fund manager, it’s good mental habit to assume the idea is Consensus,&#8221; Ahluwalia wrote on Twitter. He even suggested taking the opposite view, advocating for buying 10-year bonds in the 4.1 to 4.25% range and mortgage bonds at 6.5 to 7%. Related Reading: Bitcoin Breakout Or Breakdown? Ark Invest’s David Puell Shares His Prediction Meanwhile, Lisa Abramowicz, a Bloomberg analyst, noted that the U.S. Treasury selloff has been driven by long-dated notes, not those most sensitive to Fed policy. &#8220;This suggests two things: traders expect inflation to stay higher for longer and they question whether the Fed is truly going to raise rates high enough to achieve 2% inflation,&#8221; she said. Implications For Bitcoin And The Crypto Market? Since the opinions are divergent and, moreover, Bitcoin and bond yields are linked in several ways, there are several potential scenarios. Scenario 1: Yields Rise Significantly If Bill Ackman&#8217;s prediction comes true and the yield on 30-year Treasury bills rises significantly to around 5.5%, this could have several implications for Bitcoin. Increased Risk Appetite: Higher bond yields could indicate a greater risk appetite among investors. If investors are willing to accept higher risk for higher returns, they might also be more inclined to invest in Bitcoin, which is often seen as a riskier asset. This could potentially drive up the price of Bitcoin. Inflation Hedge: If the rise in bond yields is driven by increased inflation expectations, Bitcoin could attract more investment as a potential store of value. Bitcoin, often referred to as &#8216;digital gold&#8217;, has been seen by some investors as a hedge against inflation. If inflation continues to rise and erodes the value of fiat currencies, more investors might turn to Bitcoin, pushing its price higher. However, that&#8217;s a narrative that still needs to be proven over time. Furthermore, it&#8217;s important to note that if yields rise too quickly or too high, it could lead to a sell-off in risk assets, including Bitcoin, as investors move to safer assets. This could potentially put downward pressure on Bitcoin&#8217;s price. Scenario 2: Yields Remain Stable Or Fall If, contrary to Ackman&#8217;s prediction, yields remain stable or fall, this could also impact Bitcoin. Risk Aversion: Lower yields could suggest that investors are moving towards safer assets, which could negatively impact Bitcoin prices. If investors are less willing to take on risk, they might move away from Bitcoin towards safer assets like bonds. Related Reading: DOJ Action Against Binance: A Hidden Blessing For Bitcoin And Crypto Markets? Liquidity Conditions: Bond yields can reflect liquidity conditions in the market. If yields fall, it could suggest that liquidity is high. In such a scenario, there could be more capital available for investment in assets like Bitcoin, potentially supporting its price. Scenario 3: Market Uncertainty Increases If market uncertainty increases, for example due to concerns about U.S. fiscal policy or rapid repricing in the bond market, Bitcoin could potentially serve as a hedge. Hedge Against Uncertainty: In times of market uncertainty, like in the banking crisis in March, some investors might turn to Bitcoin as a potential hedge. If Bitcoin&#8217;s perceived status as a &#8216;digital gold&#8217; or safe haven asset strengthens, this could potentially attract more investment and drive up its price. However, it&#8217;s important to note that Bitcoin&#8217;s reaction to market uncertainty can be unpredictable and can depend on a variety of factors, including investor sentiment and broader market conditions. In conclusion, the potential impact of bond yield movements on Bitcoin&#8217;s price is complex and can depend on a variety of factors. Investors should remain vigilant and consider a range of potential scenarios. Otherwise, Bitcoin and crypto intrinsic factors like the approval of a Bitcoin spot ETF, a Ether futures ETF or any actions by the US Department of Justice (DOJ) against Binance, among others, have the potential to cause an increased volatility. &#160; Featured image from CNBC, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-04T10:20:55.000Z",
    "title": "Leading Crypto Exchange Bitstamp Teases Big XRP Announcement – Community Ecstatic",
    "url": "https://www.crypto-news-flash.com/leading-crypto-exchange-bitstamp-teases-big-xrp-announcement-community-ecstatic/?utm_source=rss&utm_medium=rss&utm_campaign=leading-crypto-exchange-bitstamp-teases-big-xrp-announcement-community-ecstatic",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-1536x1022.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Crypto exchange Bitstamp has tweeted a short video clip with the caption &#8220;Tomorrow&#8221; and XRP-related hashtags.  Some members of the XRP community have made guesses about what the announcement could be.  Luxembourg-based cryptocurrency exchange Bitstamp has dropped a teaser concerning plans to drop a major XRP announcement today. On August 2, this exchange posted a [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-04T10:20:08.000Z",
    "title": "How to Avoid the Hacking of Your Crypto Keys",
    "url": "https://www.altcoinbuzz.io/top-article/how-to-avoid-the-hacking-of-your-crypto-keys/",
    "description": "<p>Not your keys, not your coins. This phrase must sound familiar to crypto users. So, you got yourself a non-custodial wallet and are ready to rock the crypto world. Does this mean that you can carry on risk-free now? No, unfortunately not. In 2022, private key hacks were among the most lucrative hacks. So, how can [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/top-article/how-to-avoid-the-hacking-of-your-crypto-keys/\">How to Avoid the Hacking of Your Crypto Keys</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-04T10:17:10.000Z",
    "title": "The Sandbox to Unlock Millions of SAND Soon: Price Drop to Come?",
    "url": "https://coinedition.com/the-sandbox-to-unlock-millions-of-sand-soon-price-drop-to-come/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/The_Sandbox_to_Unlock_332_55M_SAND_Will_This_Cause_a_Price_Dump-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Lookonchain, an on-chain tracking firm, revealed in a tweet earlier today that 127M The Sandbox (SAND) tokens were transferred from wallets belonging to The Sandbox team during the past 12 hours. Meanwhile, the tokenomics monitoring platform Token Unlocks noted that 332.55 million SAND, which is 16.16% of the circulating supply, will be unlocked after 10 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/the-sandbox-to-unlock-millions-of-sand-soon-price-drop-to-come/\">The Sandbox to Unlock Millions of SAND Soon: Price Drop to Come?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]