[
  {
    "source": "CoinDesk",
    "date": "2023-06-09T12:23:29.000Z",
    "title": "First Mover Americas: Binance.US Suspends Dollar Deposits",
    "url": "https://www.coindesk.com/markets/2023/06/09/first-mover-americas-sec-targeted-tokens-tumble/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for June 8, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-09T12:24:24.000Z",
    "title": "SEC Chair Gensler Says Crypto Is Rife With ‘Hucksters, Fraudsters, Scam Artists’",
    "url": "https://decrypt.co/143940/sec-chair-gensler-says-crypto-is-rife-hucksters-fraudsters-scam-artists",
    "description": "Gary Gensler is stepping up his language amid a wider crackdown on the crypto industry which intensified last week with a pair of fresh lawsuits."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-09T12:30:38.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Moves Higher, as Traders Prepare for Next Week’s Fed Meeting",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-moves-higher-as-traders-prepare-for-next-weeks-fed-meeting/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146701713-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC Moves Higher, as Traders Prepare for Next Week&#039;s Fed Meeting\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146701713-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146701713-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146701713-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146701713-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146701713-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146701713-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146701713.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin edged marginally higher on Friday, as traders began to shift their attention to next week&#x2019;s Fed meeting. Many are expecting that the Federal Reserve will keep rates unchanged for the first time in over a year. Ethereum remains above a floor at $1,830. Bitcoin Bitcoin (BTC) moved marginally higher during Friday&#x2019;s session, as the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T12:37:14.000Z",
    "title": "Credit Suisse’s China brokerage hits the market",
    "url": "https://www.cryptopolitan.com/credit-suisse-china-brokerage-hit-the-market/",
    "description": "It has come to light that Credit Suisse, the Swiss banking giant, is making moves to divest its securities brokerage operations in China. This decision has been precipitated by the impending takeover by UBS, a fellow Swiss financial behemoth. As the unfolding situation unfolds, industry insiders reveal a keen interest from potential buyers. Eyeing the ... <a title=\"Credit Suisse&#8217;s China brokerage hits the market\" class=\"read-more\" href=\"https://www.cryptopolitan.com/credit-suisse-china-brokerage-hit-the-market/\" aria-label=\"More on Credit Suisse&#8217;s China brokerage hits the market\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T12:27:12.000Z",
    "title": "U.S. lawmakers unveil new bill to push for AI transparency",
    "url": "https://www.cryptopolitan.com/us-lawmakers-bill-for-ai-transparency/",
    "description": "Lawmakers in the U.S. are addressing concerns surrounding artificial intelligence (AI) through the introduction of two bipartisan bills aimed at transparency and innovation. The first bill, introduced on June 8, is spearheaded by Democratic Senator Gary Peters, along with Republican Senators Mike Braun and James Lankford. It focuses on ensuring transparency in the government&#8217;s use ... <a title=\"U.S. lawmakers unveil new bill to push for AI transparency\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-lawmakers-bill-for-ai-transparency/\" aria-label=\"More on U.S. lawmakers unveil new bill to push for AI transparency\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T12:10:12.000Z",
    "title": "OKX steals the spotlight from Binance amid SEC debacle",
    "url": "https://www.cryptopolitan.com/okx-steals-the-spotlight-from-binance/",
    "description": "Amid the turmoil unfolding in the cryptocurrency industry, OKX, one of the top global crypto exchanges, is seizing the moment to snatch the limelight from Binance, which currently grapples with legal entanglements involving the U.S. Securities and Exchange Commission (SEC). While Binance finds itself under intense scrutiny, OKX is thriving, grabbing the attention of the ... <a title=\"OKX steals the spotlight from Binance amid SEC debacle\" class=\"read-more\" href=\"https://www.cryptopolitan.com/okx-steals-the-spotlight-from-binance/\" aria-label=\"More on OKX steals the spotlight from Binance amid SEC debacle\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-09T12:35:43.000Z",
    "title": "BinanceUS suspends USD deposits and withdrawals",
    "url": "https://crypto.news/binanceus-suspends-usd-deposits-and-withdrawals/",
    "description": "BinanceUS has announced the suspension of USD deposits and fiat withdrawal channel pauses amid the ongoing legal battle with the US SEC. The move aims to protect customers and maintain operational efficiency as the exchange transitions to a crypto-only platform.&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-09T12:26:22.000Z",
    "title": "Community warned of fraudsters exploiting vulnerabilities in сrypto Twitter",
    "url": "https://crypto.news/community-warned-of-fraudsters-exploiting-vulnerabilities-in-%d1%81rypto-twitter/",
    "description": "A disturbing trend has emerged recently, as swindlers have confiscated at least eight Twitter accounts associated with cryptocurrencies. The syndicate has obtained approximately $700,000 by employing intricate phishing maneuvers via compromised accounts. Once gaining control, they promptly dispatch deceitful tweets&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-09T12:30:31.000Z",
    "title": "Tether (USDT) Sharks & Whales Rapidly Accumulate, Why This Is Bullish For Bitcoin",
    "url": "https://www.newsbtc.com/stablecoin/tether-usdt-sharks-whales-accumulate-bullish-bitcoin/",
    "description": "On-chain data shows that Tether (USDT) sharks and whales have been rapidly growing their holdings since Bitcoin&#8217;s volatility started. Tether Sharks &#38; Whales Grow Holdings As USDT Exchange Supply Plunges According to data from the on-chain analytics firm Santiment, these large Tether holders are now carrying a total of $16 billion worth of the stablecoin. The relevant indicator here is the &#8220;USDT Supply Distribution,&#8221; which tells us how the Tether supply is distributed among the various holder groups in the market currently. Investors or addresses are divided into these holder groups based on the total number of coins that they are holding right now. In the context of the current discussion, the key &#8220;shark&#8221; and &#8220;whale&#8221; cohorts are of interest, the combined coin range of which can be defined as $100,000-$10 million. Naturally, this holder group would include all addresses on the blockchain that are carrying at least $100,000 and at most $10 million worth of USDT in their balances. Now, here is a chart that shows the trend in the Tether Supply Distribution specifically for the sharks and whales over the last six months: The value of the metric seems to have sharply gone up in recent days &#124; Source: Santiment on Twitter As displayed in the above graph, the Tether addresses holding between $100,000-$10 million have seen their combined supply shoot up recently. Interestingly, this rise has coincided with Bitcoin observing some high volatility due to Binance being sued by the SEC over alleged fraud. Generally, investors use stablecoins like USDT whenever they want to exit volatile coins like BTC. Thus, investors exchanging their assets for stables can be a sign of selling. It&#8217;s possible that the latest rise in the supply of sharks and whales has come because of these humongous holders ditching cryptocurrencies like Bitcoin in these uncertain times. Related Reading: Bitcoin Bearish Signal: Dormant 1,433 BTC Moves After 10+ Years However, usually, whenever holders opt for stablecoins instead of exiting through fiat or other means, it means that they are possibly looking to eventually return back into the volatile markets. When such investors finally feel that the prices are right to step back into the other coins, they shift their USDT into their desired asset, thus providing buying pressure on its price. Because of this reason, the stablecoin supply may be looked at as the available buying power for assets like Bitcoin. As the sharks and whales have loaded up on Tether and have taken their supply to a new all-time high of $16 billion, the potential dry powder for BTC has also gone up. It&#8217;s unknown when these humongous holders may finally shift back into the cryptocurrency, but when they do, it&#8217;s probable that its price would feel a bullish boost. Related Reading: Bitcoin Bollinger Bands Herald Higher Volatility, What’s Next For BTC? The data for the exchange supply (that is, the amount sitting in exchange wallets) of Tether is also shown as rising in the chart. It looks like this metric has gone up while the sharks and whales have been buying, implying that the coins exiting from these platforms are being picked up by these cohorts. BTC Price At the time of writing, Bitcoin is trading around $26,600, down 2% in the last week. Looks like the value of the asset has been moving sideways recently &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T12:30:37.000Z",
    "title": "Top 3 Crypto to Invest in Right Now",
    "url": "https://www.crypto-news-flash.com/top-3-crypto-to-invest-in-right-now/?utm_source=rss&utm_medium=rss&utm_campaign=top-3-crypto-to-invest-in-right-now",
    "description": "<p>Right now, experts and analysts are looking at three distinct crypto coins as the best projects to invest in. Those three are Tradecurve (TCRV), Cardano (ADA), and Ripple (XRP). But which of the three is the best? Well, the absolute best is Tradecurve (TCRV), which is currently in Stage 3 of its presale and is [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/top-3-crypto-to-invest-in-right-now/\">Top 3 Crypto to Invest in Right Now</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T12:29:42.000Z",
    "title": "Kraken NFT Marketplace Takes Off: Ethereum, Solana, and Polygon Collections Join the Exciting Array of Over 250 NFTs",
    "url": "https://www.crypto-news-flash.com/kraken-nft-marketplace-takes-off-ethereum-solana-and-polygon-collections-join-the-exciting-array-of-over-250-nfts/?utm_source=rss&utm_medium=rss&utm_campaign=kraken-nft-marketplace-takes-off-ethereum-solana-and-polygon-collections-join-the-exciting-array-of-over-250-nfts",
    "description": "<p>Kraken has announced the official launch of its NFT marketplace after completing the beta testing phase. The marketplace will enable the trading of over 250 non-fungible tokens (NFTs) across multiple blockchain networks. The U.S.-based cryptocurrency exchange, Kraken, has announced the official launch of its NFT marketplace after completing the beta testing phase. The company is [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/kraken-nft-marketplace-takes-off-ethereum-solana-and-polygon-collections-join-the-exciting-array-of-over-250-nfts/\">Kraken NFT Marketplace Takes Off: Ethereum, Solana, and Polygon Collections Join the Exciting Array of Over 250 NFTs</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-09T12:35:00.000Z",
    "title": "US Crisis: $100B Emergency Loan Usage Highlights Crypto Scrutiny",
    "url": "https://coinedition.com/us-crisis-100b-emergency-loan-usage-highlights-crypto-scrutiny/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/For_the_fifth_consecutive_week_Fed_lending_to_banks_through_the-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/For_the_fifth_consecutive_week_Fed_lending_to_banks_through_the-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/For_the_fifth_consecutive_week_Fed_lending_to_banks_through_the-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/For_the_fifth_consecutive_week_Fed_lending_to_banks_through_the.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Recent data reveals that the Federal Reserve&#8217;s Bank Term Funding Program (BTFP) has reached a milestone of $100 billion in usage, indicating continued financial assistance to banks and highlighting the persistent nature of the U.S. banking crisis. The program has consistently experienced high utilization for five consecutive weeks, reinforcing its significance in providing vital support [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/us-crisis-100b-emergency-loan-usage-highlights-crypto-scrutiny/\">US Crisis: $100B Emergency Loan Usage Highlights Crypto Scrutiny</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-09T12:12:00.000Z",
    "title": "Influencer Predicts BEN Coin Will Reach the Top 20 Crypto List Soon",
    "url": "https://coinedition.com/influencer-predicts-ben-coin-will-reach-the-top-20-crypto-list-soon/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Ben_Armstrong_who_has_faced_a_vast_amount_of_backlash_over_the-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Ben_Armstrong_who_has_faced_a_vast_amount_of_backlash_over_the-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Ben_Armstrong_who_has_faced_a_vast_amount_of_backlash_over_the-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Ben_Armstrong_who_has_faced_a_vast_amount_of_backlash_over_the.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The crypto influencer Ben Armstrong, who has faced a vast amount of backlash over the past few weeks for joining BEN Coin (BEN), was recently interviewed by Altcoin Daily. In the interview, he shared his enthusiasm for BEN, which has been labeled by many as a scam project. The controversial influencer also explained the project’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/influencer-predicts-ben-coin-will-reach-the-top-20-crypto-list-soon/\">Influencer Predicts BEN Coin Will Reach the Top 20 Crypto List Soon</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]