[
  {
    "source": "Cointelegraph",
    "date": "2024-01-20T08:14:25.000Z",
    "title": " OpenAI CEO Sam Altman eyes global chip venture funding ",
    "url": "https://cointelegraph.com/news/openai-ceo-sam-altman-eyes-global-chip-venture-funding",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNjYxMDA4NWMtNGE1Yi00ZTA0LWE1NzYtZDRjMGJkMzhhYjZlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>According to the report, G42 in Abu Dhabi and Japan’s SoftBank Group are in early discussions with OpenAI CEO Sam Altman.</p>\n                    <p><p>OpenAI CEO Sam Altman aims to utilize the funds raised for a chip venture to establish a series of semiconductor manufacturing facilities, sources familiar with the plans reported on Jan 19.</p><p>As per the Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2024-01-19/altman-seeks-to-raise-billions-for-network-of-ai-chip-factories\" target=\"_blank\" rel=\"noopener nofollow\">report</a>, Altman engaged in discussions with various significant potential investors to secure the substantial funds required for the establishment of chip fabrication plants, commonly referred to as fabs. The initiative would entail collaboration with leading chip producers, and the network of fabrication plants would have a worldwide reach.</p><p>G42 in Abu Dhabi and Japan’s SoftBank Group are in early discussions with OpenAI CEO Sam Altman. According to the report, a comprehensive list of partners and funders has yet to be finalized. Since October, OpenAI’s discussions with its partner, G42, have primarily been aimed at raising $8 billion to $10 billion. </p><p><a href=\"https://cointelegraph.com/news/openai-ceo-sam-altman-eyes-global-chip-venture-funding\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-20T08:14:40.000Z",
    "title": "Bitcoin’s Hash Rate Soars to Record Heights, ARK Invest Researcher Explains What This Means",
    "url": "https://www.cryptoglobe.com/latest/2024/01/bitcoins-hash-rate-soars-to-record-heights-ark-invest-researcher-explains-what-this-means/",
    "description": "In the crypto space, the term “hash rate” refers to the total computational power being used to process transactions and secure the blockchain. It is a measure of the performance of the miners (computers or nodes) participating in the Bitcoin network. Specifically, the hash rate quantifies the number of times the network can attempt to […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-20T08:27:21.000Z",
    "title": "ERC-3643 Association Introduces  UI Tool for Integrating Regulated Assets with DeFi Platforms",
    "url": "https://www.cryptopolitan.com/erc-3643-association-ui-tool-regulated-asset/",
    "description": "The ERC3643 Association, a consortium committed to advancing blockchain innovation and compliance, has proudly announced the launch of a groundbreaking open-source User Interface (UI) component.&#160; The pioneering plug-in, developed for the ERC-3643 standard, is set to change the DeFi space by seamlessly integrating compliance checks and actionable alert notifications for ERC-3643 tokens, thereby bridging the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-20T08:20:14.000Z",
    "title": "Bitcoin Whale Addresses Hit 15-Month High – A Sign Of Growing Accumulation?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-whale-addresses-hit-15-month-high-a-sign-of-growing-accumulation/",
    "description": "The story has not been much different for the price of Bitcoin this week, as the premier cryptocurrency has struggled to capitalize on its recent advancements. According to data from CoinGecko, BTC is down by more than 3% in the past week, putting doubts over the continuation of the bull run. However, the latest on-chain revelation has offered some relief, suggesting that the value of Bitcoin might be up for substantial recovery over the next few weeks.  Can Whale Accumulation Trigger Continuation Of Bull Cycle? Popular crypto analyst Ali Martinez revealed &#8211; via a post on the X platform &#8211; that the number of Bitcoin whales has witnessed a significant increase over the past few days. This is based on the “Number of Entities With At Least 1,000 BTC Balance” metric from the on-chain analytics firm Glassnode. Related Reading: Algorand (ALGO) Stuns In Q4: Market Cap Soars, TVL Doubles, And User Base Skyrockets According to the latest Glassnode data, the number of addresses holding at least 1,000 BTC surpassed 1,510 on Thursday, January 18. This figure represents the metric’s highest level in over 15 months (since August 2022).  Chart showing the number of entities with at least 1,000 BTC &#124; Source: Ali_charts/X Large holders, commonly known as “whales,” are considered relevant entities in the cryptocurrency market due to their ability to influence prices and market sentiment. Hence, a notable uptick in the number of whales often suggests growing confidence in a cryptocurrency &#8211; in this case, Bitcoin. Furthermore, this surge in whale addresses signals potential accumulation amongst large investors and institutions. Acquisition of large Bitcoin amounts is a positive sign for the market leader, especially in terms of price performance. A recent Santiment report adds strength to this argument, saying that increased whale accumulation of Bitcoin would be a “key” factor to help trigger another bull run for the flagship cryptocurrency and the entire sector.  The blockchain analytics firm also highlighted the accumulation of the Tether and USDC stablecoins as a vital signal for the cryptocurrency market’s return to its recent high. Bitcoin Price Overview As of this writing, the price of Bitcoin stands at $41,593, reflecting a 1.1% increase in the past 24 hours. This doesn&#8217;t fully tell the story of the coin’s performance in the past day, though, as it briefly fell below $41,000. Related Reading: Bloodbath For Bitcoin: Grayscale’s $529 Million BTC Move To Coinbase Pushes Price Below $41,000 According to data from CoinGecko, BTC is down by more than 5% in the last 14 days. The cryptocurrency has reversed all its gains and more from the recent launch of spot exchange-traded funds in the United States. Nevertheless, Bitcoin maintains its spot as the largest cryptocurrency in the sector, with a market cap of over $814 billion. Bitcoin's price reclaims $41,000 on the daily timeframe &#124; Source: BTCUSDT chart on TradingView Featured image from iStock, chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-20T08:27:01.000Z",
    "title": "Messari Analysts Bullish on Celestia; Says it has no Close Comparables",
    "url": "https://coinedition.com/messari-analysts-bullish-on-celestia-says-it-has-no-close-comparables/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Celestia\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments.jpg 730w, https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/12/Why-Celestia-TIA-May-Hit-a-New-High-After-Recent-Developments-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Messari analysts highlight strides on Celestia and potential growth drivers.  Rollup blockchains on the network are expected to be the primary fee drivers.  The analysts said the market is pricing Celestia for high growth, and it may deliver on its expectations.   Amidst a sporadic rise that sent TIA to a new all-time high, analysts at [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/messari-analysts-bullish-on-celestia-says-it-has-no-close-comparables/\">Messari Analysts Bullish on Celestia; Says it has no Close Comparables</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]