[
  {
    "source": "Decrypt",
    "date": "2023-07-20T22:58:31.000Z",
    "title": "You Can Now Bet Crypto on Hamster Races. What Could Go Wrong?",
    "url": "https://decrypt.co/149448/you-can-now-bet-crypto-hamster-races-what-could-go-wrong",
    "description": "A new site is gripping crypto gamblers by letting them bet cryptocurrency on streamed races between members of the fluffy rodent breed."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-20T22:40:00.000Z",
    "title": "$125M CoinDesk deal may be in final stages",
    "url": "https://cryptoslate.com/125m-coindesk-deal-may-be-in-final-stages/",
    "description": "<p>A partial sale of the crypto news site CoinDesk valued at $125 million could soon be completed, the Wall Street Journal reported on July 20. The investor group reportedly involved in the sale is said to be headed by Peter Vessenes of Capital6 and Matthew Roszak of Tally Capital, the latter of which is focused [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/125m-coindesk-deal-may-be-in-final-stages/\">$125M CoinDesk deal may be in final stages</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-20T22:46:00.000Z",
    "title": "$XRP Price Analysis Points to Potential 2,400% Surge to $18 Based on Historical Pattern",
    "url": "https://www.cryptoglobe.com/latest/2023/07/xrp-price-analysis-points-to-potential-2400-surge-to-18-based-on-historical-pattern/",
    "description": "In the midst of adversity and the recent 22% drop from its peak of $0.93, $XRP has become the center of a number of bold price predictions, with a popular technical crypto analyst recently suggesting the cryptocurrency could see a sharp increase to the $18 mark if a unique historical pattern holds its course. This […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-20T23:00:15.000Z",
    "title": "Bullish Signal: Whales Accumulate Massive Amounts Of ARB",
    "url": "https://www.newsbtc.com/analysis/arb/bullish-signal-whales-accumulate-massive-amounts-of-arb/",
    "description": "Through the bear market, Arbitrum (ARB) has been one of the tokens that have managed to hold on to a significant amount of its all-time high value. Along these same lines, the digital asset is one of the few tokens currently flashing a green bullish flag, and accumulation has ramped up as a result of this. ARB Whale Accumulation Ramps Up Transactions on the Arbitrum blockchain on Thursday, July 20, point to massive accumulation among large investors. These transactions were flagged by on-chain data tracker Lookonchain, going as far back as July 17 when the accumulation trend seemed to have begun. Related Reading: Why This Upcoming Event Is Bearish For Axie Infinity (AXS) On Monday, Lookonchain reported three transactions carrying 3.76 million ARB worth $5 million at the time from the Binance exchange to known whale wallets. While these transactions were significant, they did not stop there. The following day, July 18, the tracker spotted another transaction carrying 4 million ARB. The source of the transaction was the same, with the coins which were worth $5 million at the time being moved from Binance to a private wallet. The most recent whale accumulation happened on Wednesday, July 19, with the largest ARB withdrawals of the bunch. This time around, a whale identified as “0x6950” withdrew 4.6 million ARB worth $5.84 million at the time of the transaction, from Binance. Whale&#8221;0x6950&#8243; withdrew 4.6M $ARB ($5.84M) from #Binance again just now. The whale has withdrawn a total of 9M $ARB ($11.4M) from #Binance in the past 2 days.https://t.co/E9GCmJ7ftc pic.twitter.com/FNI1gBbxrd — Lookonchain (@lookonchain) July 19, 2023 All of these transactions point to a consistent accumulation trend among these large holders, which could suggest that they expect a price recovery to happen soon. Their withdrawals have also reduced the amount of selling pressure on the digital asset and this could also lend support to any rally from here on out. Arbitrum Continues To Dominate Layer 2 Blockchains Arbitrum has seen much success in the market and this contributes to the bullishness around its native ARB token. Arbitrum currently boasts the largest Total Value Locked (TVL) of all the Ethereum Layer 2 blockchains, including Polygon and Optimism. Related Reading: Back In The Game: Ripple Joins $54 Million Funding Round For Metaverse Startup While Polygon and Optimism TVLs are sitting at $1.027 billion and $926 million, respectively, the TVL of the Arbitrum network is at $2.68 billion. This figure makes the L2 the fourth-largest by TVL across all blockchains, coming up behind heavy hitters such as Ethereum, Tron, and BSC. With Arbitrum controlling a significant portion of the L2 TVL, expectations are that its native token will also surge alongside it. Currently, ARB is trading at $1.29 with a 3.33% price gain in the last 24 hours. However, the price could easily surge toward $1.5 if whale accumulations continue and sell pressure continues to decline. ARB price retests $1.3 resistance &#124; Source: ARBUSD on Tradingview.com Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from IQ.Wiki, chart from TradingView.com"
  }
]