[
  {
    "source": "Crypto Daily",
    "date": "2023-06-27T05:00:00.000Z",
    "title": "Robinhood to Lay Off 7% of Its Workforce",
    "url": "https://cryptodaily.co.uk/2023/06/robinhood-to-lay-off-7percent-of-its-workforce",
    "description": "<p class=\"md-end-block md-p md-focus\">In a recently leaked internal announcement, Robinhood Markets, the popular online brokerage firm, reportedly plans to lay off approximately 150 full-time employees, equating to about 7% of its total workforce.</p>\n<p class=\"md-end-block md-p\">This move signifies the third wave of job cuts the company has undertaken in just over a year, reflecting its ongoing adjustments to fluctuating market conditions.</p>\nAligning to Volumes and Team Structures\n<p class=\"md-end-block md-p\">As per an internal message obtained by The Wall Street Journal, Robinhood CFO, Jason Warnick, stated that the layoffs were part of a plan to \"adjust to volumes and to better align team structures.\" The company's spokesperson has not issued any statement to confirm or deny the layoffs, but asserted that the firm continually strives for \"operational excellence.\"</p>\n<p class=\"md-end-block md-p\">The representative's statement read:</p>\n\n<p class=\"md-end-block md-p\">\"We&rsquo;re ensuring operational excellence in how we work together on an ongoing basis. In some cases, this may mean teams make changes based on volume, workload, org design, and more.\"</p>\n\nPossible Reaction to Recent Acquisition and Decreasing Margins\n<p class=\"md-end-block md-p\">News of the layoffs follows shortly after Robinhood's acquisition of credit card company X1 for $95 million, which took place just five days prior. It's worth noting that the company had already conducted two rounds of significant job cuts in 2022, reducing its total headcount by 9% in April and by a further 23% in August.</p>\n<p class=\"md-end-block md-p\">The move was seen as a response to dwindling trading activity and decreased prices of equities and cryptocurrencies, both of which considerably squeezed the firm's profit margins. Together, these layoffs accounted for a loss of more than 1,000 staff members.</p>\n<p class=\"md-end-block md-p\">Three weeks ago, the firm mulled the delisting of a number of tokens due to an SEC citation. It later went on to delist Solana, Cardano, and Polygon. </p>\nDwindling User Base and Revenue Decline\n<p class=\"md-end-block md-p\">At its peak in Q2 2021, Robinhood boasted a user base of 21.3 million active users, generating more than $565 million in revenue. However, recent financial figures paint a less rosy picture. The firm's Q1 2023 results indicated a stark 44% decline in monthly active users and a 30% year-over-year decrease in revenue.</p>\n<p class=\"md-end-block md-p\">Despite the turbulence, Robinhood shares have seen some positivity, trading at $9.63 per share, representing an 18% increase year-to-date. However, this is significantly down from its August 2021 all-time-high, having fallen more than 82% since then.</p>\n<p class=\"md-end-block md-p\">The latest layoffs at Robinhood underline the shifting dynamics in the financial technology sector, illustrating the necessity for firms to adapt rapidly to the ever-changing market environment.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-27T05:00:02.000Z",
    "title": "Injective (INJ) Continues To Build Momentum, Jumps Nearly 27% In A Single Week",
    "url": "https://www.newsbtc.com/altcoin/injective-inj-jumps-nearly-27-in-a-single-week/",
    "description": "Injective (INJ) has been positive in 2023, racking up a nearly 500% price increase since the turn of the year. This significant rise ranks the cryptocurrency as one of the year&#8217;s best-performing assets. Over the past week, the INJ token has been on an upward trend, adding more than 26% to its value. Related Reading: Cardano (ADA) Soars 10% In The Last Week, More Rallies Ahead? Injective Price Records Daily 8% Gain &#8211; Price Action INJ, the native token of the Injective ecosystem, has maintained its recent bullish momentum, registering an 8.3% increase in the last 24 hours. As of this writing, the token is valued at $7.53, according to data from CoinGecko. However, a broader look at the market reveals that the Injective price has been range-bound for the past few weeks. Since reaching a yearly peak of $9.32, the INJ price has moved mostly sideways, albeit 19.2% from its 2023 high. With the choppy market condition, it is quite difficult to determine which overall trend is forming. The on-chain indicators seem quite indecisive at the moment. The token rebounds at the $6 price point, acting as a support zone.  INJUSD trading at $7.513 &#124; Source: INJUSD chart from TradingView The INJ token boasts a market capitalization of nearly $600 million, ranking it the 73rd biggest cryptocurrency. Additionally, the coin has a 24-hour trading volume of roughly $75 million, representing an increase of 131.2% in the past day. According to the price prediction site CoinCodex, the general sentiment surrounding INJ is currently bullish. The team expects this token to maintain its bullish run and gain a further 13.08% in the next five days to trade at $8.59.  In addition, CoinCodex makes a bold prediction of INJ reaching a market price of $16.72 in the next 30 days, indicating a plausible 126.25% price on the token’s current price.  Injective Protocol Continues To Make Positive Waves The decentralized Injective protocol has been on an ascent since the start of 2023, evolving in innovation and adoption. These developments have been crucial to the positive sentiment surrounding its token (INJ), contributing to its price growth and the enhanced activity on the Injective blockchain. On June 23, Injective announced that it had reached its network&#8217;s 240 million transaction mark. This is perhaps the most significant evidence of the decentralized blockchain&#8217;s growing popularity. Another of Injective’s recent developments is the Open Liquidity Program (OLP), which launched on the 13th of June. This program allows Injective users to provide liquidity on the protocol’s on-chain orderbook infrastructure while earning INJ rewards. Eligible participants can earn 60,000 INJ tokens within 28 days.  Related Reading: Lightning Network Hits Record Highs In Bitcoin And US Dollar Capacity Featured image from Shutterstock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T04:49:36.000Z",
    "title": "Ethereum Signals Bullish Rebound as On-Chain Metrics Improve: Santiment Sets $2,500 Price Target Amid Market Recovery",
    "url": "https://www.crypto-news-flash.com/ethereum-signals-bullish-rebound-as-on-chain-metrics-improve-santiment-sets-2500-price-target-amid-market-recovery/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-signals-bullish-rebound-as-on-chain-metrics-improve-santiment-sets-2500-price-target-amid-market-recovery",
    "description": "According to key players and on-chain metrics from a leading analytics platform, Ethereum (ETH) is currently showing bullish signs.  Ether losses momentum around the $1,900 price level as bears force a handful of leading altcoins into the red zone.  Ethereum (ETH), the second most valued cryptocurrency by market cap, is flashing positive green signals. Santiment [...]"
  }
]