[
  {
    "source": "Decrypt",
    "date": "2024-03-04T23:45:47.000Z",
    "title": "Bitcoin Ordinals Are Reshaping the NFT Marketplace Landscape",
    "url": "https://decrypt.co/220154/bitcoin-ordinals-reshaping-nft-marketplace-landscape",
    "description": "With Bitcoin inches away from setting a new all-time high price, rising Ordinals sales have flung one NFT marketplace on top."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-04T23:55:21.000Z",
    "title": " Bitcoin just hit a record in open interest — expect imminent volatility ",
    "url": "https://cointelegraph.com/news/bitcoin-record-open-interest-imminent-volatility",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOTY2NWI2MGMtYmMxYS00ZGI0LTljZTQtZDExNzlmMTViNjQ0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Stay calm and avoid getting carried away by the possibly imminent all-time highs for Bitcoin and Ethereum. Open interest needs to get wiped out sooner or later. </p>\n                    <p><p>As the Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) rally has gained pace over recent weeks, we have seen open interest in both assets nearing record-high levels reminiscent of the feverish days of the 2021 rally. This frantic increase in trading activity is a sure sign that the bull market is finally in full swing. However, the parallels with 2021 are also a more worrying indicator that the market is overheating, with further volatility for BTC and ETH prices likely around the corner. </p><p>That isn’t to say we are anywhere near the all-time highs we will see later in the cycle, but overzealous investors would be wise to exercise a certain amount of caution at these lofty prices. Indeed, Bitcoin has risen more than 50% over the past 30 days and is closing in on its ATH, while Ethereum is shooting the lights out with a 50% rise over the same time period. </p><p>But it’s not just this rapid price appreciation that foreshadows imminent volatility in the two biggest crypto assets. Technical indicators like open interest and Bitcoin funding rates — a reliable forecasting tool when taken in aggregate — paint a picture of a rather frothy market.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-record-open-interest-imminent-volatility\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-04T23:53:10.000Z",
    "title": " SEC pushes back BlackRock, Fidelity spot Ethereum ETF proposals ",
    "url": "https://cointelegraph.com/news/sec-delays-ethereum-etf-applications-blackrock-fidelity",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZGEzMWY1YWYtN2MxNi00ZWU1LThhZTEtMDFjMjdiNGNmNWNjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The SEC has again delayed its decision on spot Ethereum ETF applications from BlackRock and Fidelity as analysts continue to tip May as the month to watch.</p>\n                    <p><p>The United States Securities and Exchange Commission (SEC) has delayed its decision to approve or reject BlackRock and Fidelity’s spot Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) exchange-traded funds (ETFs). </p><p>In separate March 4 <a href=\"https://www.sec.gov/files/rules/sro/nasdaq/2024/34-99665.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filings</a>, the SEC announced that its decision on applications from BlackRock for its iShares Ethereum Trust and Fidelity for its Ethereum Fund will be delayed.</p><p>The SEC first delayed its decision on BlackRock’s and Fiedlity’s Ether ETF applications in January, shortly <a href=\"https://cointelegraph.com/news/sec-spot-bitcoin-etf-approvals\">after it approved</a> a roster of spot Bitcoin (BTC) ETFs to go live. The SEC can delay its decision up to three times before making a final decision.</p><p><a href=\"https://cointelegraph.com/news/sec-delays-ethereum-etf-applications-blackrock-fidelity\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-05T00:00:38.000Z",
    "title": "Telegram CEO Responds To Concerns, Offers Solution To Restrict Company’s TON Stake To 10%",
    "url": "https://www.newsbtc.com/toncoin-ton/telegram-ceo-responds-to-concerns-offers-solution-to-restrict-companys-ton-stake-to-10/",
    "description": "The popular messaging platform Telegram has revealed its plans to sell its surplus holdings of The Open Network (TON) tokens at below-market prices. This move comes after concerns were raised about the potential centralization of TON supply due to ad payments being exclusively accepted in TON tokens.  Telegram Addresses Concentration Concerns As NewsBTC reported on February 28, starting in March, channel owners will have the opportunity to receive financial compensation for their content. All transactions, including payments and withdrawals, will be handled on the TON blockchain. Telegram&#8217;s advertising platform will be available to advertisers in nearly one hundred new countries. With this expansion, channel owners will receive 50% of the revenue generated from ads displayed on their channels. Related Reading: Shiba Inu Blasts Into Top 10 Crypto Following 175% Price Surge In response to concerns about the concentration of TON tokens with this new feature, Telegram CEO Pavel Durov announced plans to sell the company&#8217;s surplus holdings.  With ad payments in TON tokens potentially accounting for more than 10% of the TON supply at Telegram, Durov acknowledged the need for a solution to avoid centralization.  Telegram aims to limit its share of TON by selling the surplus holdings to long-term investors, ensuring a “healthier distribution” and a decentralized ecosystem. The tokens sold will be subject to a lockup and vesting plan ranging from 1 to 4 years. To ensure a streamlined process for selling TON tokens, Telegram has set up a dedicated email address where interested large investors (with investments of $1 million or more) can express their interest, aiming to maintain stability and decentralization within the TON ecosystem.  TON Ecosystem Thrives Despite the growing concerns, the TON ecosystem is showing encouraging signs of growth, as evidenced by recent data provided by Token Terminal. Market capitalization, trading volume, fees, and revenue have all increased significantly over the past 30 days. Additionally, active users have consistently grown daily, weekly, and monthly.  Over the past 30 days, the fully diluted market capitalization of the TON ecosystem has reached $13.83 billion, marking a significant 31.0% increase. Moreover, the token’s trading volume has seen a modest but steady 1.4% rise, reaching $1.21 billion.  Fees generated within the ecosystem have also experienced substantial growth, with an 80.9% increase over the past 30 days, totaling $860,490. The annualized fees have also surged, reaching $10.47 million, reflecting a 45.3% growth rate. Furthermore, revenue generated within the ecosystem has followed a similar trajectory, with a significant 80.9% increase over the past month, amounting to $430,250. The annualized revenue stands at $5.23 million, indicating a promising revenue stream for the ecosystem. Related Reading: Bitcoin Will Reach A New All-Time High This Week, Matrixport Head Of Research Says Last but not least, the TON ecosystem has seen consistent growth in its user base over different periods. Daily active users have increased by 1.5%, reaching 33.66k, while weekly active users have experienced a growth rate of 19.6%, reaching 178.62k. Monthly active users also showed a positive trend, with a growth rate of 10.3%, reaching 412.39k.  TON is trading at $2,735, up 3% over the past 24 hours and extending its 34% rise over the past 30 days. Featured image from Shutterstock, chart from TradingView.com "
  }
]