[
  {
    "source": "CryptoGlobe",
    "date": "2023-07-23T12:19:56.000Z",
    "title": "$ADA: Cardano’s Ecosystem Set for Major Boost as Mithril Nears Mainnet Release",
    "url": "https://www.cryptoglobe.com/latest/2023/07/ada-cardanos-ecosystem-set-for-major-boost-as-mithril-nears-mainnet-release/",
    "description": "Mithril, is on the brink of its mainnet release. Developed by IO Global (IOG), the tech firm behind much of Cardano’s research, Mithril is set to tackle some of the biggest challenges in blockchain applications. Think of Cardano as a two-story building. The first floor, the Cardano Settlement Layer (CSL), is where the cryptocurrency ADA […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-23T12:21:49.000Z",
    "title": "Ripple Eyes UK Expansion Following Recent XRP Win",
    "url": "https://cryptodaily.co.uk/2023/07/ripple-eyes-uk-expansion-following-recent-xrp-win",
    "description": "<p>After securing a partial win in its case involving the SEC, Ripple&rsquo;s Managing Director for the UK and Europe revealed the firm recently applied for registration in the UK and Ireland. </p>\n<p>Ripple&rsquo;s recent landmark victory in its case involving the SEC has spurred a renewed interest in the firm and its native token XRP. The firm is riding the wave of its current popularity and is setting its sights on expanding to the UK and the Republic of Ireland.</p>\nRipple Looks to Expand Operations to UK and Ireland\n<p>Ripple&rsquo;s European Managing Director, Sendi Young, told DL News in an interview the firm is in the process of obtaining approval in the UK and Ireland.</p>\n<p>While the company still sees the US as its global hub, Sendi said, &ldquo;We are going to continue growing exponentially&rdquo; in the UK and Europe. To that end, Young said Ripple &ldquo;very recently&rdquo; applied for crypto asset firm registration with the UK&rsquo;s Financial Conduct Authority (FCA) and a payment institution license in the Republic of Ireland. &nbsp;</p>\n<p>During the interview, Ms Young stated:</p>\n\n<p>&ldquo;We are in the process of applying for our crypto asset registration in the UK and our payments licence in Ireland. These are all massive investments with a view that we are going to continue growing exponentially in this region.&rdquo;</p>\n\n<p>She, however, declined to provide a numerical target for the company&rsquo;s UK and European growth plans but confirmed the company is increasing hiring in the region.</p>\nCourt Ruling is a &ldquo;Huge Win&rdquo; for Ripple\n<p>Ripple secured a partial win against the SEC when Judge Analise Torres ruled Ripple&rsquo;s XRP token is &ldquo;not necessarily a security on its face.&rdquo; Ripple has been engaged in a three-year battle with the SEC after the agency alleged the firm breached US securities laws.</p>\n\n<p dir=\"ltr\" lang=\"en\">XRP is not a security.This victory for @Ripple is a win for the entire industry and a step toward regulatory clarity in the U.S.A huge thank you to @bgarlinghouse, @chrislarsensf, and @s_alderoty for their leadership and the #XRPCommunity for their continued support.</p>\n&mdash; Ripple (@Ripple) July 13, 2023\n<p>\n\n</p>\n<p>Based on the SEC&rsquo;s lawsuit, crypto exchanges such as Coinbase and Kraken were forced to delist XRP offerings but have since indicated they would relist the token.</p>\n<p>Young commented on Judge Torres&rsquo; decision and said it is a &ldquo;huge win&rdquo; and &ldquo;positive for [the company&rsquo;s] growth in the US.&rdquo;</p>\n\n<p>She added the company&rsquo;s position on the US as its global hub &ldquo;has not changed&rdquo; but noted since the lawsuit, the majority of Ripple&rsquo;s expansion &ldquo;has happened outside the US. I would only expect that the US will pick up and grow a lot more now.</p>\n<p>Having said that, we are global, we have over 15 offices around the world.&rdquo;</p>\n\nRipple Secures an In-Principle MPI License in Singapore\n<p>CNCB reported weeks before Judge Torres&rsquo; decision the firm received in-principle approval of a Major Payment Institution (MPI) License from the country&rsquo;s central bank &ndash; the Monetary Authority of Singapore (MAS).</p>\n<p>In a press release announcing MAS approval, Ripple said:</p>\n\n<p>&ldquo;Ripple, the leader in enterprise blockchain and crypto solutions, today announced that its Singapore subsidiary Ripple Markets APAC Pte Ltd, has obtained In-Principle Approval of the Major Payments Institution License application from the Monetary Authority of Singapore (MAS).</p>\n<p>This license will allow Ripple to offer regulated digital payment token products and services in the city-state, and further scale its customers&rsquo; use of its crypto-enabled&nbsp;On-Demand Liquidity&nbsp;(ODL) service.&rdquo;</p>\n\n<p>Ripple has long held a strong presence in Singapore since opening its Asia Pacific headquarters in 2017.</p>\n<p>Brad Garlinghouse, Ripple&rsquo;s Chief Executive Officer, said in a statement released soon after announcing the company&rsquo;s MPI approval:</p>\n\n<p>&ldquo;Singapore is a leading global financial center, and a prominent gateway to business in Asia Pacific. We&rsquo;re incredibly proud to receive an in-principle license from the MAS, reaffirming our commitment to the region and ongoing proactive engagement with regulators globally.&rdquo;</p>\n\n<p>Stu Alderoty, Ripple&rsquo;s Chief Legal Officer, also commented:</p>\n\n<p>&ldquo;As more countries develop regulatory frameworks for crypto, many are looking to Singapore&rsquo;s early leadership in developing a clear taxonomy and licensing framework. This in-principle regulatory approval from the MAS will enable us to better support our forward-looking customers looking to hone in on blockchain and crypto technologies to build a more inclusive and borderless financial system.&rdquo;</p>\n\n<p>Ripple reportedly doubled its headcount in Singapore over the past year and continues to seize every advantage the city holds for it.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-23T12:30:08.000Z",
    "title": "Blackrock’s Bitcoin ETF Application Update, Warnings of Possible Reversal in XRP Ruling, and More — Week in Review",
    "url": "https://news.bitcoin.com/blackrocks-bitcoin-etf-application-update-warnings-of-possible-reversal-in-xrp-ruling-and-more-week-in-review/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1074308084-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Blackrock&#039;s Bitcoin ETF Application Update, Warnings of Possible Reversal in XRP Ruling, and More — Week in Review\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1074308084-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1074308084-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1074308084-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1074308084-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1074308084-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1074308084-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1074308084.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Financial megalith Blackrock&#x2019;s bitcoin exchange-traded fund (ETF) application has now been accepted by the U.S. Securities and Exchange Commission, and added to the regulator&#x2019;s docket. In related news, a former official from the SEC has said the recent ruling on XRP from the SEC v. Ripple case &#x201C;resides on shaky ground&#x201D; and is likely to [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-23T12:22:01.000Z",
    "title": "Hidden Crypto Gems to Buy Before August 2023: FLOW, APE, and $ROE",
    "url": "https://www.crypto-news-flash.com/hidden-crypto-gems-to-buy-before-august-2023-flow-ape-and-roe/?utm_source=rss&utm_medium=rss&utm_campaign=hidden-crypto-gems-to-buy-before-august-2023-flow-ape-and-roe",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-22T114717.069.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-22T114717.069.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-22T114717.069-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-22T114717.069-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-22T114717.069-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-22T114717.069-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />FLOW recorded high volatility in the past week, while ApeCoin (APE) has been relatively stable. ApeCoin (APE) represents an opportunity for long-term investors waiting for a major bullish breakout, and FLOW presents a chance for day traders to make profits. However, Borroe&#8217;s ($ROE) investment potential dwarfs both tokens. This hot new crypto platform combines AI [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-23T12:10:40.000Z",
    "title": "Transforming the Crypto Market: Ripple and Stellar Lead SWIFT Integration Drive",
    "url": "https://www.crypto-news-flash.com/transforming-the-crypto-market-ripple-and-stellar-lead-swift-integration-drive/?utm_source=rss&utm_medium=rss&utm_campaign=transforming-the-crypto-market-ripple-and-stellar-lead-swift-integration-drive",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Swift integration\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Habiba-Tahir-Ch-Stellar-Lumens-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Integrating with SWIFT opens up the potential for almost instantaneous cross-border transactions. The recent success of Ripple (XRP) appears to have acted as a catalyst, propelling the price of Stellar (XLM) from $0.096 to $0.161 on July 13. Blockchain pioneers Ripple, Stellar, and IOTA are disrupting the traditional SWIFT payment system with groundbreaking solutions. With [...]"
  }
]