[
  {
    "source": "CoinDesk",
    "date": "2023-06-29T21:39:28.000Z",
    "title": "U.S. Investors Are Driving Bitcoin’s Price Surge as Institutional Demand Rises ",
    "url": "https://www.coindesk.com/markets/2023/06/29/us-investors-are-driving-bitcoins-price-surge-as-institutional-demand-rises/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BTC price gains and trading activity have mostly concentrated during U.S. market hours, according to K33 Research."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-29T21:53:58.000Z",
    "title": "U.S. House committee chairs, Blockchain Association turn up heat on SEC head Gensler",
    "url": "https://cointelegraph.com/news/u-s-house-committee-chairs-blockchain-association-turn-up-heat-on-sec-head-gensler",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/bb43ba3c-f861-4ad1-b28d-37e0bbb3ab8a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Three House chairs sent a letter regarding recordkeeping and FOIA, and the industry advocacy group suggested Wells notice recipients ask for his recusal from their cases. </p>\n                    <p><p>Three committee chairs in United States House of Representatives have sent a letter to U.S. Securities and Exchange Commission (SEC) chair Gary Gensler demanding a more satisfactory response to their November 1 letter regarding the SEC chairman’s and the agency’s compliance with recordkeeping requirements. </p><p>Judiciary Committee chair Jim Jordan, Oversight Committee chair James Comer and Financial Services Committee chair Patrick McHenry <a href=\"https://financialservices.house.gov/uploadedfiles/2023-06-28_jordan_comer_mchenry_follow-up_letter_to_gensler_final.pdf\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> that the response they received from Gensler to their inquiry did not address direct requests made in their letter. Specifically, they asked for certification that the SEC follows federal recordkeeping and transparency rules and that Gensler and his subordinates have not used private email accounts to conduct official business, as well as explanations of the agency’s definition and use of “off-channel communications.” </p><p>The congressmen, along with Representative Tom Emmer, were <a href=\"https://judiciary.house.gov/sites/evo-subsites/republicans-judiciary.house.gov/files/legacy_files/wp-content/uploads/2022/11/2022-11-01-JDJ-JC-PM-TE-to-Gensler-re-Recordkeeping-Laws-1.pdf\" target=\"_blank\" rel=\"noopener nofollow\">responding</a> to a Wall Street Journal report <a href=\"https://www.wsj.com/articles/transparency-securities-exchange-commission-sec-ferc-foia-fra-records-keeping-transparency-biden-white-house-11665440298\" target=\"_blank\" rel=\"noopener nofollow\">criticizing</a> the SEC and other agencies for shoddy recordkeeping. “Government officials routinely engage in the same sort of record-keeping shenanigans for which Wall Street groups were recently fined [by the SEC],” the report concluded. Specifically, the article noted the use of chats by officials for government business, which are not searched to fulfil subsequent Freedom of Information Act (FOIA) requests.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ SEC Chair Gary Gensler has wrongly prejudged that all digital assets are securities.<br><br>As a result, federal law requires that he recuse himself from all enforcement decisions related to digital assets.<a href=\"https://twitter.com/MTCoppel?ref_src=twsrc%5Etfw\">@MTCoppel</a> and I wrote a paper explaining why <a href=\"https://t.co/xgJ09o4SPS\">https://t.co/xgJ09o4SPS</a></p>&mdash; Jake Chervinsky (@jchervinsky) <a href=\"https://twitter.com/jchervinsky/status/1674464911714398229?ref_src=twsrc%5Etfw\">June 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The new letter reiterates the original requests and adds, “If you do not intend to comply with any or all of the above requests #1-5, describe the factual and legal basis for your noncompliance.” The letter, dated June 28, cited inconsistencies in Gensler’s publicly accessible meeting schedules in 2021. Crypto is mentioned. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/coinbase-sec-seeks-dismissal-of-sec-suit-claims-extraordinary-abuse-of-process\">Coinbase seeks dismissal of SEC suit, claims extraordinary abuse of process</a></em></strong></p><p>Gensler was the object of specifically crypto-related criticism the following day, when the Blockchain Association <a href=\"https://theblockchainassociation.org/chair-gensler-must-recuse-himself/\" target=\"_blank\" rel=\"noopener nofollow\">released</a> a paper arguing that Gensler should recuse himself from digital asset enforcement decisions. The paper claimed:</p><blockquote>“In the digital asset space, the SEC has all but abandoned its role as a rulemaking body. Key issues of existential importance to the digital asset industry remain unresolved, chief among them the question of whether and when a digital asset represents a ‘security.’”</blockquote><p>Gensler “has clearly stated his view” that all digital assets other than Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) are unregistered securities and all digital asset trading platforms are unregistered securities exchanges, the paper said, citing numerous statements made by the SEC chairman. Those statements show that Gensler has prejudged “everything other than bitcoin,” it continued, and:</p><blockquote>“Due process requires not only that agency decisionmakers act without bias, but also that they avoid even the appearance of bias.”</blockquote><p>Wells notice recipients can seek Gensler’s recusal through the SEC or in federal court, the paper reminded. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\">Crypto regulation: Does SEC Chair Gary Gensler have the final say?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-29T21:45:05.000Z",
    "title": "Revolut delists Cardano, Polygon, and Solana in US market",
    "url": "https://cryptoslate.com/revolut-delists-cardano-polygon-and-solana-in-us-market/",
    "description": "<p>in an email sent to U.S.-based users on June 28, U.K. fintech firm Revolut announced that it is ending support for three major cryptocurrencies. The company stated that U.S. users will not be able to buy Cardano (ADA), Polygon (MATIC), and Solana (SOL) through its app, effective immediately. At a later, unspecified date, users will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/revolut-delists-cardano-polygon-and-solana-in-us-market/\">Revolut delists Cardano, Polygon, and Solana in US market</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-29T22:01:35.000Z",
    "title": "Plaintiff Lawyers in Elon Musk Dogecoin (DOGE) Lawsuit Seek To Remove Musk’s Legal Counsel Over Leaked Letter",
    "url": "https://dailyhodl.com/2023/06/29/plaintiff-lawyers-in-elon-musk-dogecoin-doge-lawsuit-seek-to-remove-musks-legal-counsel-over-leaked-letter/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/musk-integrate-crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/musk-integrate-crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/musk-integrate-crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/musk-integrate-crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/musk-integrate-crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/musk-integrate-crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/musk-integrate-crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The attorneys of those accusing Elon Musk and his company Tesla of defrauding investors are seeking to remove the billionaire’s legal counsel over a leaked letter. According to a new report by Reuters, a motion has been filed by the plaintiffs’ lawyer, Evan Spencer, to disqualify the legal representatives of Musk and the electric car [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/29/plaintiff-lawyers-in-elon-musk-dogecoin-doge-lawsuit-seek-to-remove-musks-legal-counsel-over-leaked-letter/\">Plaintiff Lawyers in Elon Musk Dogecoin (DOGE) Lawsuit Seek To Remove Musk’s Legal Counsel Over Leaked Letter</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]