[
  {
    "source": "Cointelegraph",
    "date": "2023-10-31T04:55:10.000Z",
    "title": "Bitcoin ETFs may be headed for one epic Gensler ‘rugpull,’ say analysts",
    "url": "http://cointelegraph.com/news/bitcoin-spot-etf-deny-rug-pull-gary-gensler-sec-bloomberg-analysts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/5aadc397-e488-4314-8226-f5d44bb62d9f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>While unlikely, Bloomberg’s ETF analysts conceded that there’s always a possibility that SEC Chair Gary Gensler could be waiting until the last moment to deny the flurry of pending spot Bitcoin ETF applications.</p>\n                    <p><p>There’s a slim chance the United States Securities and Exchange chief Gary Gensler could pull the plug on spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds in one “amazingly sadistic” move, according to Bloomberg ETF analysts. </p><p>In an Oct. 31 tweet directed at senior Bloomberg ETF analysts James Seyffart and Eric Balchunas, ETF commentator Dave Nadig posed whether Gensler may be allowing for spot Bitcoin ETF applications to pile up just to deny them all at once in a “semi-comedic rug-pull.”</p><p>“I'm sure it will be much more boring than this -- but sometimes it does feel like this is all a setup for a giant Gensler semi-comedic rug-pull,” said Nadig.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I&#39;m sure it will be much more boring than this -- but sometimes it does feel like this is all a setup for a giant Gensler semi-comedic rug-pull.</p>&mdash; Dave Nadig (@DaveNadig) <a href=\"https://twitter.com/DaveNadig/status/1719104845322264728?ref_src=twsrc%5Etfw\">October 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Responding to the comment, Seyffart admitted that the thought of such a scenario has “lingered” in the back of his mind for weeks if not months. “Would be absolutely epic on his part though,” added Seyffart. </p><p>Balchunas also piped in, describing a potential rug pull as “amazingly sadistic” and noted that it would probably “trigger [a] wave of lawsuits,” in response.</p><p>However, while both analysts argued the scenario was unlikely, Balchunas conceded that a last-minute denial wasn’t entirely off the cards, and is why he and Seyffart won’t raise the odds of an approval to anything above 90%. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/first-bitcoin-etf-trades-gbtc-discount-69k-btc-price\"><strong><em>First Bitcoin ETF trades $1.5B as GBTC ‘discount’ echoes $69K BTC price</em></strong></a></p><p>Gensler’s own thoughts on a spot Bitcoin ETF have recently made their way into the spotlight, with a video from 2019 showing <a href=\"https://cointelegraph.com/news/sec-bitcoin-etf-position-inconsistent-gary-gensler-mit\">Gensler describing the SEC’s position on spot ETF products</a> at the time as “inconsistent.”</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/dLRL1bEpI0c\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Meanwhile, the SEC has a long and storied history of <a href=\"https://cointelegraph.com/news/us-sec-to-review-rejection-of-nine-bitcoin-etf-applications\">denying spot Bitcoin ETF applications</a>, a trend which began as far back as 2017. </p><p>This legacy has been carried on by Gensler since he was appointed head of the SEC in 2021. Since then Gensler has <a href=\"https://cointelegraph.com/news/sec-delays-decisions-on-crypto-et-fs-law-decoded-sept-25-oct-2\">delayed and pushed back</a> recent spot Bitcoin ETF applications, citing concerns with investor protections. </p><p>In June 2022, the Gensler-led SEC was sued by crypto asset manager Grayscale for rejecting its bid to convert its existing Bitcoin trust into a spot ETF, with a <a href=\"https://cointelegraph.com/news/court-mandate-grayscale-sec-spot-bitcoin-etf\">court ruling that the SEC</a> the SEC was “arbitrary and capricious” to reject the application. The SEC <a href=\"https://cointelegraph.com/news/sec-wont-appeal-court-decision-on-grayscale-bitcoin-etf\">did not appeal</a> the decision.</p><p>To date, the SEC has only approved ETF applications for Bitcoin and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) futures products, as it claims that spot products do not have the sufficient safeguards to protect investors from market manipulation. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-zero-knowledge-voting-finance/\"><strong><em>Beyond crypto — Zero-knowledge proofs show potential from voting to finance</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-31T05:08:59.000Z",
    "title": "SOL Price (Solana) Momentum Reignites: Indicators Signal Surge To $38",
    "url": "https://www.newsbtc.com/analysis/sol-price-solana-momentum-reignites-38/",
    "description": "Solana is gaining pace above the $35 resistance against the US Dollar. SOL price remains supported and might aim for a fresh rally toward $38. SOL price started a major rally above the $32 resistance against the US Dollar. The price is now trading above $35 and the 100 simple moving average (4 hours). There is a key bullish trend line forming with support near $33.30 on the 4-hour chart of the SOL/USD pair (data source from Kraken). The pair is up nearly 10% and might surge further toward the $38 resistance. Solana Price Rallies 10% After a decent upward move, Solana settled above the $30 pivot level. SOL gained bullish momentum after it formed a base above the $30 and $32 levels. It is now outperforming Bitcoin and Ethereum. There was a clear move above the $35 resistance zone. A new multi-week high is formed near $36.48 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $32.34 swing low to the $36.48 high. SOL is now trading above $35 and the 100 simple moving average (4 hours). There is also a key bullish trend line forming with support near $33.30 on the 4-hour chart of the SOL/USD pair. Source: SOLUSD on TradingView.com On the upside, immediate resistance is near the $36.50 level. The first major resistance is near the $36.80 level. A successful close above the $36.80 resistance could set the pace for a larger increase. The next key resistance is near $38.00. Any more gains might send the price toward the $40.00 level. Are Dips Limited in SOL? If SOL fails to recover above the $36.50 resistance, it could start a downside correction. Initial support on the downside is near the $34.40 level. The first major support is near the $33.30 level, the trend line zone, and the 76.4% Fib retracement level of the upward move from the $32.34 swing low to the $36.48 high. If there is a close below the $33.30 support, the price could decline toward the $32.00 support in the near term. Technical Indicators 4-Hours MACD – The MACD for SOL/USD is gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $34.40, and $33.30. Major Resistance Levels – $36.50, $36.80, and $38.00."
  }
]