[
  {
    "source": "Decrypt",
    "date": "2023-07-12T14:01:09.000Z",
    "title": "Get Protocol Raises $4.5 Million to Take on Ticketmaster With NFT Tickets",
    "url": "https://decrypt.co/148254/get-protocol-raises-4-5-million-take-ticketmaster-nft-tickets",
    "description": "With seed funding led by Flow Ventures and the Tezos Foundation in the mix, Get Protocol emphasizes a “Web 2.5” approach to ticketing."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-12T13:23:31.000Z",
    "title": "Bitcoin, Ethereum Trade Flat as June CPI Report Clocks in at 3%",
    "url": "https://decrypt.co/148273/bitcoin-trades-flat-as-june-cpi-clocks-3",
    "description": "Leading cryptocurrencies rose slightly following the latest CPI figures, which indicate that inflation in the U.S. continues to cool. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T14:00:50.000Z",
    "title": "AI in healthcare: New tech in diagnosis and patient care ",
    "url": "https://cointelegraph.com/news/ai-in-healthcare-new-tech-in-diagnosis-and-patient-care",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/09e0408d-1dd9-4ecb-be09-2cb9be386d2b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>From enhancing disease diagnosis to personalizing patient care, here’s how AI can reshape the future of healthcare. </p>\n                    <p><p>Artificial intelligence (AI) is no longer a concept confined to science fiction; instead, it has become a part of our everyday lives, driving advancements in various sectors, from finance to transportation. However, one of the most profound impacts of AI is being felt in the healthcare industry. </p><p>AI’s ability to learn from vast amounts of data and make predictions is changing healthcare by enhancing patient care and medical research. From diagnosing diseases with remarkable accuracy to managing patient care and pioneering personalized medicine, AI is not just an auxiliary tool for medical professionals but a game-changer in the healthcare landscape.</p><p>Moreover, the ongoing integration of AI in healthcare is not merely a trend but a significant shift toward more efficient, patient-centric care. It is transforming how we understand diseases, develop treatments and deliver care, thus reshaping the future of healthcare.</p><h3>A new frontier in disease detection</h3><p>AI has shown immense potential in disease diagnosis, particularly in radiology. <a href=\"https://www.nature.com/articles/s41591-018-0107-6\" target=\"_blank\" rel=\"noopener nofollow\">Studies</a> have demonstrated that AI systems can now match or even outperform radiologists in diagnosing certain conditions using chest X-rays. </p><p>Once trained using a large data set of X-rays, AI models can identify a range of diseases — including lung cancer and tuberculosis — with a high degree of accuracy. Speaking on the subject of AI-based disease detection, Dimitry Mihaylov, co-founder and chief science officer for AI-based medical diagnosis platform Acoustery, said:</p><blockquote>“AI algorithms can analyze medical images such as X-rays, MRIs, and CT scans to detect abnormalities and assist in diagnosis. Another huge domain is drug discovery and development. AI is revolutionizing the process of drug discovery by analyzing vast amounts of biological and chemical data.”</blockquote><p>Moreover, AI has been <a href=\"https://www.nature.com/articles/s41591-020-0931-3\" target=\"_blank\" rel=\"noopener nofollow\">instrumental</a> in the ongoing fight against COVID-19. AI algorithms formulated after 2020 have been deployed to predict the likelihood of a patient developing severe symptoms, helping doctors prioritize care for those most at risk. AI models have also been used to <a href=\"https://pubs.rsna.org/doi/10.1148/radiol.2020200905\" target=\"_blank\" rel=\"noopener nofollow\">analyze</a> CT scans and identify signs of COVID-19 infections at their onset, providing a valuable diagnostic tool — especially in regions where testing capacities remain limited.</p><p>AI’s potential extends beyond radiology and infectious diseases. For example, in the field of ophthalmology, a branch of medicine concerned with studying and treating eye disorders and diseases, AI technology has been used to diagnose diabetic retinopathy, a common cause of blindness. In this regard, a <a href=\"https://www.nature.com/articles/s41591-018-0107-6\" target=\"_blank\" rel=\"noopener nofollow\">study</a> demonstrated that AI systems could diagnose diseases simply by evaluating retinal scans with an accuracy comparable to human experts. </p><p>In cardiology, AI has been used to predict heart attacks and strokes. Experts have <a href=\"https://www.nature.com/articles/s41467-020-15432-4\" target=\"_blank\" rel=\"noopener nofollow\">shown</a> that AI diagnostic platforms can now detect life-altering medical events up to five years in advance, outperforming traditional prediction models. </p><h3>Is the dawn of personalized healthcare upon us?</h3><p>Over the last half-decade, AI has also started to revolutionize patient management. In this regard, machine learning (ML) algorithms — a prominent application of AI — can analyze vast amounts of patient data to predict individual health risks and suggest personalized treatment plans. </p><p>This approach can lead to effective and efficient care, improving patient outcomes while reducing healthcare costs. There is <a href=\"https://www.nature.com/articles/s41591-020-0824-5\" target=\"_blank\" rel=\"noopener nofollow\">data</a> demonstrating that ML models can predict patient mortality, re-admission rates and length of stay, among other outcomes, with high accuracy. </p><p><strong><em>Source: <a href=\"https://cointelegraph.com/news/animoca-still-bullish-on-blockchain-games-awaits-license-for-metaverse-fund\">Animoca still bullish on blockchain games, awaits license for metaverse fund</a></em></strong></p><p>AI is also helping <a href=\"https://www.healthcarefinancenews.com/news/himsscast-how-ai-reducing-physician-burden-one-new-jersey-health-system\" target=\"_blank\" rel=\"noopener nofollow\">reduce</a> the administrative burden on physicians, freeing them to spend more time on patient care. To this point, the technology can streamline the process of clinical note-taking, reducing physician burnout and improving patient outcomes.</p><p>Personalized medicine, which tailors treatment to the individual patient, is another area where AI has the potential to make a significant impact. By analyzing genetic data and other patient information, AI can help identify the most effective treatments for each patient, improving outcomes and reducing side effects. </p><p>Mihaylov claimed that AI is a key driver for personalized medicine: As AI algorithms can analyze individual patient data — including genetic information, medical history and lifestyle factors — they can provide personalized treatment recommendations to improve treatment efficacy, minimize adverse effects and optimize patient outcomes. </p><p>“As an example, proper asthma treatment is efficient only if we make treatment and traction personalized. That could not be done before everybody had a mobile device, and since AI is powerful enough to process all of an individual’s data, such individualistic treatment is now becoming a living reality,” he said.</p><h3>Supervising AI in healthcare</h3><p>As AI continues to permeate the healthcare sector, it’s becoming increasingly crucial for healthcare providers to comprehend the risks associated with AI and the subsequent need for oversight. </p><p><a href=\"https://www.healthcareitnews.com/news/fast-growing-need-oversight-ai-healthcare\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to Thomas O’Neil, managing director at Berkeley Research Group and ex-Cigna chief compliance officer, AI-based medical reimbursement models are being designed to leverage large volumes of data to predict expected payments. However, this approach raises several ethical considerations, including informed consent to use data, safety and transparency, algorithmic fairness and biases, and data privacy.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/abadd774-ec24-42e7-a41f-cbaebee9941f.jpg\"  /></figure><p>O’Neill also pointed out that while AI can streamline claims processing and reimbursements — thus improving accuracy, enhancing workflow quality and mitigating the risk of errors in patient information entry or pre-authorization claims — these areas require careful oversight. In his view, a board or governing body responsible for overseeing such strategic initiatives needs to be deployed.</p><p>Mihaylov believes that some of the most pressing challenges when it comes to supervising AI systems in healthcare are data privacy and security. “Healthcare data contains sensitive patient information, so it is essential to work with lawyers to ensure that everything is done in the correct manner,” he noted.</p><p>He added that integrating AI into healthcare systems presents multiple challenges, many of which extend beyond the realm of pure governance alone. </p><p><strong><em>Source: <a href=\"https://cointelegraph.com/news/google-cloud-bitcoin-lightning-voltage-partnership\">Google Cloud furthers Bitcoin Lightning ambitions with Voltage partnership</a></em></strong></p><p>For starters, sourcing high-quality data is a big challenge for medical organizations since AI models require large amounts of information for training and validation. And because healthcare data is often fragmented, unstructured and stored in different formats across various systems, this issue must be examined more carefully. </p><h3>The future of AI in healthcare</h3><p>While the potential of AI in healthcare is immense, there are also certain challenges to overcome. However, with ongoing research and development, and appropriate regulation, AI stands to play an increasingly important role in the global healthcare sector. Therefore, as more and more people transition toward using decentralized technologies, it stands to reason that the influence of AI — from disease diagnosis to patient management and personalized medicine — will only continue to increase.</p><p>Moreover, as the technological landscape continues to evolve, we can expect AI to deliver even more innovative solutions to the challenges facing the healthcare market, thereby improving patient care and outcomes.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T14:00:00.000Z",
    "title": "Bitcoin’s pre-halving rally may start soon — Here’s why",
    "url": "https://cointelegraph.com/news/bitcoin-s-pre-halving-rally-may-start-soon-here-s-why",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/4cea4ea1-b829-477e-aefa-3b2fc58aa790.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>On this week’s episode of The Market Report, Cointelegraph’s resident expert discusses if this is your last chance to buy Bitcoin on the cheap as the Bitcoin pre-halving rally may be right around the corner.</p>\n                    <p><p>In the latest episode of <em>The Market Report</em>, Cointelegraph analyst and writer Marcel Pechman discusses <a href=\"https://cointelegraph.com/news/bitcoin-supply-shock-btc-price-120k-standard-chartered\">Standard Chartered bank’s $120,000 Bitcoin price expectation</a> based on the halving impact. According to the report, increased miner profitability due to a pre-halving rally would “reduce the net BTC supply.”</p><p>Pechman, on the other hand, doesn’t acknowledge the thesis, given that the mining difficulty will continue to increase and the news confirming Riot Platform’s <a href=\"https://cointelegraph.com/news/riot-platforms-add-bitcoin-miners-ahead-of-2024-halving\">investment in new ASIC equipment</a>. In fact, the mining difficulty increased by 73% in the last 12 months, while the Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price increased by 58%.</p><p>Regarding the $50,000 Bitcoin year-end price prediction, Pechman believes the number is too optimistic, given the low odds of a spot Bitcoin exchange-traded fund (ETF) approval by then. However, if the ETF is approved within the next six months, an estimated $5 billion potential inflow could catapult Bitcoin’s price above $70,000.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/S2f9dI5WrfI\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>For 2024, Pechman increases his odds of a spot Bitcoin ETF approval to 30%, while Bloomberg analysts expect even higher chances at 50%. Given the sheer size of BlackRock and Fidelity, Pechman believes a $10 billion inflow in the first couple of months following the ETF launch is feasible, suggesting Standard Chartered’s $120,000 expectation could be on the conservative side.</p><p>The expectation of an ETF approval may impact the <a href=\"https://cointelegraph.com/news/bitcoin-halving-bullish-microstrategy-michael-saylor\">pre-halving rally</a>, according to Pechman, who also explains why investors may be anticipating the movement. Consequently, the pre-halving effect may get longer or shorter if investors dump before the event happens. Pechman’s recommendation is to avoid the fear of missing out or FOMO. If you missed an entry spot, traders should either wait for the dollar cost average or sit and wait.</p><p>Lastly, Pechman analyzes the latest Glassnode on-chain analysis report on <a href=\"https://cointelegraph.com/news/bitcoin-fakeout-repeats-btc-price-spikes-31k\"></a><a href=\"https://cointelegraph.com/news/bitcoin-fakeout-repeats-btc-price-spikes-31k\">re-accumulation at $30,000</a>. According to Pechman, “return to mean” is also widespread in traditional markets. When investors are lost without the necessary conviction to move the price, they will refer to the previous two-year or three-year average levels.</p><p>To hear more about Pechman’s strategy for the Bitcoin halving and the impact of a spot Bitcoin ETF approval, listen to <em>The Market Report, </em>exclusively on the new <a href=\"https://www.youtube.com/@cointelegraphmarketresearch\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets &amp; Research YouTube channel</a>.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-12T13:39:10.000Z",
    "title": "EU’s Financial Watchdog Publishes Proactive Stablecoin Standards",
    "url": "https://cryptobriefing.com/125135-2/?utm_source=feed&utm_medium=rss",
    "description": "Staying one step ahead of regulatory mandates, the European Banking Authority (EBA), the financial regulator of the European Union, has requested that stablecoin issuers adopt proposed guiding principles concerning risk..."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-12T13:55:44.000Z",
    "title": "Navigating the Virtual Frontier: Decoding the EU’s Strategy for Web 4.0",
    "url": "https://www.cryptoglobe.com/latest/2023/07/navigating-the-virtual-frontier-decoding-the-eus-strategy-for-web-4-0/",
    "description": "On 11 July 2023, the European Commission unveiled an ambitious strategy for the future of the internet and digital interaction, positioning the EU to spearhead the next technological transition: the shift from Web 3.0 to Web 4.0 and the rise of virtual worlds. In the vision laid out by the Commission, Web 4.0 is more […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-12T13:16:31.000Z",
    "title": "MarketAcross and Chainlink Labs Establish Channel Partnership To Support Chainlink BUILD Members",
    "url": "https://www.cryptoglobe.com/latest/2023/07/marketacross-and-chainlink-labs-establish-channel-partnership-to-support-chainlink-build-members/",
    "description": "Tel Aviv, Israel, July 12th, 2023, Chainwire MarketAcross, the world’s leading PR and content marketing solution for blockchain startups, today announced that it has entered into a channel partnership with Chainlink Labs, a developer of Chainlink, the industry-leading Web3 services platform. This channel partnership will help support startups in the Chainlink BUILD program and give them access to […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-12T14:01:21.000Z",
    "title": "Validation Cloud Marks Three Months as #1 Performing Global Infrastructure Provider",
    "url": "https://cryptodaily.co.uk/2023/07/validation-cloud-marks-three-months-as-1-performing-global-infrastructure-provider",
    "description": "<p>Zug, Switzerland, July 12th, 2023, Chainwire</p><p>The node infrastructure provider also consistently ranks #1 regionally in North America, Europe, and Asia on CompareNodes</p><p>Validation Cloud, the leading Web3 infrastructure platform, celebrates its third month as the fastest RPC node provider in the world. According to third-party ranking CompareNodes, Validation Cloud has maintained its #1 position as a global RPC node provider, reaffirming its commitment to delivering superior blockchain connectivity. This groundbreaking achievement solidifies Validation Cloud's status as the go-to provider of Web3 infrastructure&nbsp;to enterprises and developers seeking unparalleled speed, scale, and resilience.</p><p>In addition to its global dominance, Validation Cloud also consistently ranks #1 regionally in North America, Europe, and Asia. This widespread recognition further showcases the platform's commitment to excellence and delivering exceptional performance at a global scale.&nbsp;</p><p>Validation Cloud's dedication to performance is evident in its ability to provide the fastest way to connect to a blockchain, as validated by CompareNodes. With an impressive low global latency, Validation Cloud's node API enables developers to seamlessly access blockchain networks from anywhere in the world. By eliminating latency and delivering unmatched speed, Validation Cloud empowers developers to create reliable and innovative applications on the blockchain without any restraints.&nbsp;</p>&ldquo;This accomplishment reflects our relentless dedication to providing enterprises and developers with the most efficient and reliable infrastructure for building transformative blockchain applications,&rdquo; says Alex Nwaka, Chief Strategy Officer. \"We are proud to set a new standard for Web3 infrastructure and contribute to the innovative future of the Web3 ecosystem.\"&nbsp;<p>Validation Cloud&rsquo;s next-generation technology stack was purpose-built for the needs of commercial applications, with global low latency, high throughput, and compliance in mind. Validation Cloud's infrastructure is built to withstand and adapt to the most demanding conditions, providing developers with unmatched reliability and resilience. With elastic infrastructure, self-healing and global smart-routing will maintain your connectivity to Web3. Validation Cloud is on track to achieve SOC2 Type 1 and Type 2 compliance to ensure the highest standards of data security, prioritizing three TSCs (Trust Service Criteria): availability, confidentiality, and security.&nbsp;</p><p>To explore Validation Cloud's unmatched performance and to experience the fastest way to connect to a blockchain, users can visit: app.validationcloud.io. Users can sign up for free to get started and enjoy limitless scalability with the Scale Plan.&nbsp;</p><p>With our Free Tier, developers can get started with up to 50 million compute units (CUs) per month. The Scale Plan offers unlimited CUs for even more scalability.&nbsp;As usage increases, the marginal cost per CU decreases, providing economies of scale for your project. Validation Cloud&rsquo;s platform encourages and incentivizes users to interact more with leading networks such as Ethereum, Aptos, and Polygon.</p><p>About Validation Cloud</p><p>Validation Cloud is a Web3 data streaming and infrastructure company that connects organizations into Web3 through a fast, scalable, and intelligent platform. Headquartered in Zug, Switzerland, Validation Cloud offers highly performant and customizable products in staking, node, and data-as-a-service. Learn more at validationcloud.io| LinkedIn | Twitter | Medium</p>ContactDirector of CommunicationsKelly ClarkValidation Cloudpress@validationcloud.io"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-12T14:00:00.000Z",
    "title": "PrimeXBT copy trading tips: Five ways to reach more followers",
    "url": "https://cryptodaily.co.uk/2023/07/primexbt-copy-trading-tips-five-ways-to-reach-more-followers",
    "description": "\n<p>Copy trading has revolutionized the way traders approach the financial markets, providing an opportunity to quickly and easily copy the strategies of successful traders and potentially generate consistent profits.&nbsp;</p>\n<p>PrimeXBT copy trading allows users to automatically follow and replicate the trades of experienced traders, known as strategy managers. As a strategy manager on PrimeXBT, growing your followers is essential to increase your potential earnings, as strategy managers earn a profit share of follower's success fees.&nbsp;</p>\n<p>In this article, we will explore five effective ways to attract more followers and expand your reach.</p>\nWhat is PrimeXBT copy trading?\n<p>PrimeXBT copy trading is a feature that enables users to follow and automatically copy the trades of strategy managers on the platform.&nbsp;</p>\n<p>This service provides several primary benefits:</p>\n<ul>\n<li>\n<p>Access to experienced traders: Copy trading allows novice users to gain exposure to the trading strategies of seasoned professionals, even if they lack the time or knowledge to trade independently.</p>\n</li>\n<li>\n<p>Wall of fame-worthy results: PrimeXBT copy trading features a Wall of Fame with several traders with well over 10,000% ROI, and one incredible trader with over 100,000% ROI. Even unskilled copy traders can follow a class-act performance that eventually earns a spot in the Wall of Fame.</p>\n</li>\n<li>\n<p>Diversification: Following multiple strategy managers with different approaches enables users to diversify their portfolio and reduce risk.</p>\n</li>\n<li>\n<p>Learning opportunities: Copy trading allows users to learn from experienced traders, observe their decision-making process, and improve their own trading skills.</p>\n</li>\n<li>\n<p>Passive income potential: Strategy managers earn a profit share of success fees from their followers' trades, providing an opportunity for additional income.</p>\n</li>\n</ul>\nFive ways to expand your follower reach\n<p>As you can see, more followers mean more passive income potential, encouraging strategy managers to boost their follower counts. Now, let's explore five effective ways to attract more followers on PrimeXBT:</p>\n<p>&nbsp;</p>\n<p></p>\nCreate informative YouTube videos\n<p>YouTube is a powerful platform for sharing knowledge and building a following. As a strategy manager, creating YouTube videos that discuss your trading strategies, provide market insights, and offer educational content can help attract new followers. By sharing valuable information and showcasing your expertise, you can further establish yourself as a trusted authority in the trading community.</p>\n<p></p>\nShare trade ROI screenshots on social media\n<p>Social media platforms like Twitter or the new Threads by Meta are excellent channels for showcasing your trading performance and attracting followers. Using the PrimeXBT trade share tool located in the history section of the dashboard, it's possible to easily share screenshots of your successful trades, highlighting impressive return on investment. This transparency and evidence of your trading prowess can pique the interest of potential followers and demonstrate the profitability of your strategies.</p>\n<p>&nbsp;</p>\n<p></p>\nUtilize TikTok to showcase trading success and insights\n<p>TikTok has gained significant popularity as a platform for sharing short, engaging videos. As a strategy manager, you can leverage TikTok to create captivating videos that showcase your winning trades or offer insights into the trading process. Consider sharing snippets of your trading desk setup, explaining different trading concepts, or demonstrating the emotional aspects of trading. By providing unique content, you can captivate and engage a broader audience.</p>\n<p>&nbsp;</p>\n<p></p>\nEngage in the PrimeXBT copy trading Telegram channel\n<p>The PrimeXBT copy trading Telegram channel serves as a community hub for both followers and strategy managers alike. Actively participating in discussions, sharing your knowledge, and answering questions can help establish your credibility and attract followers. Engaging with existing community members allows you to network, build relationships, and expand your follower base.</p>\n<p>&nbsp;</p>\n<p></p>\nImprove rating performance and rise the leaderboards\n<p>Consistently improving your trading performance is crucial to gaining more followers. By focusing on enhancing your trading strategies, implementing effective risk management techniques, and consistently delivering positive results, you can rise to the top of the leaderboards on PrimeXBT copy trading. Furthermore, skilled traders can improve their rating up to five-stars. Traders are more likely to follow strategy managers with a proven track record of success and safe trading practices.</p>\nConclusion\n<p>PrimeXBT copy trading offers an exciting opportunity for strategy managers to earn additional income while helping others achieve trading success. By implementing these five strategies, you can attract more followers, expand your reach, and increase your potential earnings on the platform.&nbsp;</p>\n<p>Whether it's creating informative YouTube videos, sharing trade ROI screenshots on social media, utilizing TikTok for engaging content, actively participating in the Telegram community, or continuously improving your trading performance, each method contributes to building a strong following.&nbsp;</p>\n<p>As a strategy manager on PrimeXBT copy trading, you have the chance to make a positive impact on others' investments while simultaneously achieving your own financial goals. Consider trying copy trading and start growing your follower base on PrimeXBT today.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-12T14:00:00.000Z",
    "title": "Join Doge Uprising $DUP: The Next Big Wave in Crypto",
    "url": "https://cryptodaily.co.uk/2023/07/join-doge-uprising-dup-the-next-big-wave-in-crypto",
    "description": "\n\n<p>Today marks the official launch of the Doge Uprising signup, a revolutionary movement in the crypto-meme world. Born out of a fusion of blockchain technology, rebellious spirit, and internet humor, Doge Uprising is poised to redefine the crypto landscape, challenging the norms of the digital world.</p>\n<p>Doge Uprising is an initiative led by Akira.eth, the spiritual successor of the original Dogecoin creator. A formidable blend of coders, digital nomads, meme maestros, and everyday crypto enthusiasts, Doge Uprising leverages the power of memes to inspire, unite, and drive change against the autocracy of existing regimes.</p>\n\n<p>\"Doge Uprising is about harnessing the power of internet humor and decentralization to create something that's truly by the people, for the people,\" said Akira.eth \"We're pushing the boundaries, showing the world that memes are not just about laughs; they're about unity, defiance, and revolution.\"</p>\n\n<p>The movement introduces Doge Mecha, towering digital entities symbolizing rebellion and powered by brave pilots like \"The One\". These Mechas will be represented as unique NFTs, granting exclusive access to the revolution's realm and acting as a status symbol within the community.</p>\n<p>Fueling the revolution is the $DUP token, based on Ethereum. The roadmap laid out by the Doge Uprising includes phases of genesis, community growth and engagement, utility expansion, decentralized governance, and scalability. As a key to these exciting features, the $DUP token is designed to empower the community and provide the tools necessary for the revolution's success.</p>\n<p>Doge Uprising is calling for early adopters to sign up and be part of the movement. By joining this initial phase, members will have an opportunity to shape the future of Doge Uprising, access ultra-rare Doge Mecha NFTs, and connect with like-minded visionaries.</p>\n<p>Get ready to embark on an extraordinary journey into the world of Doge Uprising. Sign up at https://dogeuprising.co/&nbsp;and join a collective effort that is much more than a meme. Be a part of the revolution that is making blockchain history. The uprising has begun!</p>\nAbout Doge Uprising\n<p>Doge Uprising is a revolutionary movement in the crypto-meme world. Powered by blockchain technology, memes, and the spirit of rebellion, it aims to challenge the norms of the digital world, driving change and redefining the crypto space.&nbsp;</p>\n\n\n\n\n<p>Website: https://dogeuprising.co/</p>\n<p>Telegram:&nbsp;https://t.me/+JfnjZpCD9b4wNTlk</p>\n<p>Twitter:&nbsp;https://twitter.com/Doge_Uprising</p>\n<p>&nbsp;Discord: https://discord.gg/pJWk3KSt</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n\n\n\n\n\n\n<p>&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-12T14:00:00.000Z",
    "title": "The Top 7 AML Tools For The Crypto Industry",
    "url": "https://cryptodaily.co.uk/2023/07/the-top-7-aml-tools-for-the-crypto-industry",
    "description": "<p>With industry-wide crackdowns from the likes of the SEC and exacting regulatory demands coming into force in Europe, it&rsquo;s never been more crucial to implement proper AML procedures.</p>\n<p>The crypto industry has received bad press from various mainstream media sources citing how crypto can be used for all kinds of nefarious practices, money laundering in particular. Be that as it may, cryptocurrencies use blockchain technology, and therefore transactions are inherently transparent, and the trail of a suspected wrongdoer can usually be followed.</p>\n<p>However, there are always ways and means that a bad actor, who wishes to circumvent anti-money laundering (AML) processes, can employ.&nbsp;</p>\n<p>One key aspect of AML compliance is the implementation of transaction monitoring systems, such as Know Your Transaction (KYT). KYT involves real-time monitoring of individual transactions to identify suspicious activities, while the verification of addresses helps assess the legitimacy of wallet addresses involved in cryptocurrency transactions, mitigating risks associated with high-risk entities.</p>\n<p>In a September 2022 article, the World Economic Forum (WEF) reported a 1,964% increase in cryptocurrencies that are laundered by way of decentralised finance (DeFi). This percentage was equivalent to around $900 million in laundered value.</p>\n<p>To combat this type of activity, blockchain analytics tools and experts have made their niche in the market and are being used by companies in their struggle to become and remain compliant. Companies that provide this kind of service normally also offer the ability for a client to be able to fully investigate blockchain transactions as part of their AML responsibilities.</p>\n<p>As the crypto sector seeks clarity in the regulatory environment in order to become a more accepted part of the financial system, complying with AML requirements will surely be a non-negotiable item on this path.</p>\nHow Does Funds Tracing Work On The Blockchain?\n<p>Blockchain analytics is a form of data science focused on the analysis, identification, and clustering of data on the blockchain, which is a digitally distributed public ledger. In other words, blockchain analytics is a method that companies use to investigate blockchain transactions and flag potentially fraudulent or illicit activities.</p>\n<p>Blockchain analytics involves scraping data from crypto transactions, analysing wallets, and clustering wallets with similar typologies. Analytics providers can create a database and group wallets with similar typologies into clusters. This is an integral step when discovering both the source and destination of illicit funds. Law enforcement agencies and businesses utilise blockchain analytics to combat fraud, enhance compliance, and make informed decisions.</p>\n<p>According to the US-based security website CSO Online a crucial part of the puzzle is identifying various addresses that might be linked to the same wallet, and then finding out who owns it.</p>\n\n<p>&ldquo;Knowing the exact entity behind a batch of addresses can be crucial, and blockchain intelligence companies have ways of finding that. They aggregate information from multiple sources, often using off-chain data to enrich their understanding of transactions. They look at dark web forums, social media posts, and court papers among others.&rdquo;</p>\n\nHow to Choose the Right Analytical and Business Protection Tools for Effective AML\n<p>When it comes to selecting analytical and business protection tools for effective anti-money laundering, 4 key parameters should guide your decision-making process.</p>\n<p>Firstly, prioritize a comprehensive and extensive database. The effectiveness of your AML or analytical solution relies on accurate risk identification and detection of suspicious activities.</p>\n<p>Secondly, accessibility is essential, ensuring that businesses of all sizes can easily integrate the solution. The onboarding process should be user-friendly and the pricing structure should be affordable. This allows businesses to leverage AML services without facing significant barriers or excessive costs.</p>\n<p>Thirdly, consider blockchain support. Your chosen provider should be compatible with a wide range of blockchains, including popular ones, enabling comprehensive monitoring and analysis across multiple networks.</p>\n<p>Lastly, visualisation and user-friendliness play a vital role in selecting an analytics tool. The system should provide clear and intuitive visualisations of checks and analysis results. This simplifies the interpretation of data and facilitates informed decision-making.</p>\n<p>Considering these 4 parameters when choosing analytical and business protection tools for effective AML will help businesses combat money laundering and maintain compliance with regulatory requirements.</p>\nA comparison of the top 7 AML tools\n<p>For crypto projects looking to become properly compliant as regards AML it behoves them to do their research into the leading proponents of blockchain investigation. To this end, the top 7 tools in this industry niche are compared below. Both compliance and analytics tools are considered.</p>\nChainalysis (https://www.chainalysis.com)\n<p>Probably the most prominent transaction monitoring and investigation tool out there is Chainalysis, used by government and private agencies to trace and understand blockchain activity.&nbsp;</p>\n<p>Chainalysis uses its Reactor investigation software that seeks to connect the transactions with the entity behind them. In its transaction monitoring product called &ldquo;KYT&rdquo;, Chainalysis puts its identifications through a rigorous process and offers an API to access this data.</p>\n<p>Accessibility for Different Businesses&nbsp;</p>\n<p>Expensive and inaccessible for small companies. Chainalysis is known to be costly, making it unaffordable for small businesses to access their services. The entry barrier for smaller companies is high, limiting their ability to utilize Chainalysis effectively.</p>\n<p>Database&nbsp;</p>\n<p>Chainalysis boasts one of the most extensive and top-tier databases among all AML providers. Their database is known for its completeness, enabling thorough analysis and investigation of transactions.</p>\n<p>Supported Blockchains&nbsp;</p>\n<p>Wide range, including popular blockchains.</p>\n<p>Chainalysis offers a broad set of cross-chain visibility, covering a diverse range of blockchains. They support and analyse some of the most popular and widely used blockchains, enhancing their ability to track transactions across different networks.</p>\n<p>The possible drawback of the Chainalysis offering is the lack of cross-chain visibility and an inability to view all address connections in EVM-compatible networks.</p>\n<p>Visualisation and User-Friendliness</p>\n<p>When it comes to visualisation and user-friendliness, Chainalysis falls within the average range. While their tools and interfaces are functional, they do not offer the highest level of user-friendliness compared to some other AML providers in the market.</p>\n<p>It's important to note that Chainalysis is primarily used for transactional AML/CFT checks (&ldquo;KYT&rdquo;) Chainalysis also offers address screening; however it only shows a direct* exposure (meaning that it analyzes only direct transactions of a wallet).&nbsp;</p>\n<p>*KYT transaction monitoring shows both direct and indirect exposure, while address verification is only for direct exposure.</p>\n<p>Advanced tracing techniques include automatic peel chain detection and cross-chain graphing, all of which provide a comprehensive solution for de-anonymising wallet addresses.</p>\nAMLBot (https://amlbot.com)\n<p>AMLBot&rsquo;s one-stop solution includes the screening of all a client&rsquo;s incoming and outgoing transactions, plus wallets screening for AML compliance through integration of its API, with developers on hand to make sure the setup is seamless and conduct blockchain investigations in the case of discovered theft.</p>\n<p>Add to this the easy signup and user-friendly interface, and you have an AML solution that is accessible for all businesses, including the medium and small enterprises.</p>\n<p>Accessibility for Different Businesses</p>\n<p>AMLBot offers accessibility to a wide range of businesses, including both B2B and B2C sectors. It provides an easy entry process and offers favourable conditions for businesses, making it accessible to all types of organisations.</p>\n<p>Database</p>\n<p>AMLBot boasts a broad database that integrates top databases from other AML providers, along with its own proprietary database. As a result, it has one of the most comprehensive and deep databases in the market, enabling thorough analysis and investigation.</p>\n<p>Supported Blockchains&nbsp;</p>\n<p>The company supports a wide range of popular blockchains and continuously adds new ones. This ensures that it stays up to date with emerging technologies and can effectively track transactions across various blockchain networks.</p>\n<p>Visualisation and User-Friendliness&nbsp;</p>\n<p>AMLBot prides itself on being highly user-friendly, providing clear and intuitive data visualisations. Users can easily interpret and analyse the data presented. Additionally, AMLBot has plans to release a new investigation visualisation tool, which will elevate its capabilities to the level of major companies in the industry.</p>\n<p>Overall, AMLBot offers accessible entry for businesses, a deep and comprehensive database, support for popular blockchains, and user-friendly interfaces with clear data visualisations.&nbsp;</p>\nCrystal (https://crystalblockchain.com)\n<p>Crystal offers simple but powerful visualisation tools and intuitive dashboards, helping a business to screen and monitor all transactions for AML compliance. Crystal also boasts that by using its services a crypto business can achieve compliance in only a matter of days.&nbsp;</p>\n<p>Accessibility for Different Businesses&nbsp;</p>\n<p>Not available for all types of businesses but more accessible than Chainalysis. Crystal offers limited accessibility when compared to some other AML providers.&nbsp;</p>\n<p>Database&nbsp;</p>\n<p>Crystal boasts a broad database that covers a wide range of information. Their database provides comprehensive data to support AML investigations and compliance efforts.</p>\n<p>Supported Blockchains&nbsp;</p>\n<p>Crystal supports the most popular blockchains in the industry. This enables users to track transactions and analyze data across multiple blockchain networks.</p>\n<p>Visualisation and User-Friendliness</p>\n<p>One of the best visualisations with average user-friendliness. Crystal stands out for its exceptional data visualisations, which are considered among the best in the industry. The platform provides visually appealing representations of data, aiding in the analysis and interpretation of information. However, in terms of user-friendliness, Crystal falls within the average range.</p>\n<p>The Crystal platform does offer EVM compatibility across multiple networks, although cross-chain visibility is not provided. In addition, real risk scores aren&rsquo;t always accurately reflected.</p>\n<p>Overall, Crystal offers a wide-ranging database, supports popular blockchains, and provides exceptional data visualisations. While it may not be as accessible for all types of businesses as some other providers, it offers a valuable toolset for AML investigations and compliance efforts.</p>\nOKLink (https://www.oklink.com)&nbsp;\n<p>OKLink says on its website that it is committed to making blockchain data accessible to everyone. It provides data analysis of the major blockchains and its OKLink KYA is a data-driven risk assessment tool that classifies address, and spot transaction risks.</p>\n<p>Accessibility for Different Businesses&nbsp;</p>\n<p>OKLink offers accessibility to businesses of all sizes. Whether it is a large corporation, a medium-sized company, or a small business, OKLink provides entry options for a wide range of organisations.</p>\n<p>Database&nbsp;</p>\n<p>The company has a relatively shallow database, which affects the accuracy of risk scores. Due to the limited depth of their database, the effectiveness of AML analysis and risk assessment may be compromised.</p>\n<p>Supported Blockchains</p>\n<p>OKLink supports a limited number of blockchains. While they may cover some popular blockchains, the range of supported networks is relatively small compared to other AML providers. This could potentially limit the coverage and effectiveness of their services.</p>\n<p>Visualisation and User-Friendliness</p>\n<p>OKLink stands out for its excellent data visualisations, which are considered among the best in the industry. Their platform offers visually appealing representations of data, enhancing the user experience and facilitating the interpretation of information. The user-friendliness of OKLink's interface is rated at a high level, making it easy for users to navigate and utilise their tools effectively.</p>\n<p>In summary, OKLink provides accessibility to businesses of all sizes, but their database is shallow, which can impact the accuracy of risk scores. They support a limited number of blockchains, potentially limiting their coverage. However, OKLink excels in data visualisation, offering excellent visual representations, and maintains a high level of user-friendliness on their platform.</p>\nMetasleuth (https://metasleuth.io)\n<p>The Metasleuth investigative tool is still in the Beta stage and accordingly it is free to the user. In fact it does appear to be a very user-driven tool given that user feedback and requests for added features are very much encouraged.</p>\n<p>In addition Metasleuth allows analysis results to be shared with others for further analysis, thereby encouraging the creation of a collaborative community.</p>\n<p>Accessibility for Different Businesses&nbsp;</p>\n<p>Metasleuth provides accessibility to businesses of all sizes and types, particularly it is useful for individuals.&nbsp;</p>\n<p>Supported Blockchains&nbsp;</p>\n<p>Metasleuth supports 9 major blockchains, allowing users to track and analyse transactions across multiple networks.&nbsp;</p>\n<p>The disadvantage of this tool is the impossibility to view all address connections in EVM-compatible networks.</p>\n<p>Visualisation and User-Friendliness&nbsp;</p>\n<p>Metasleuth excels in data visualisation, offering one of the best visual representations in the industry. The user-friendliness of Metasleuth's interface is rated at a high level.</p>\n<p>In summary, Metasleuth is a great B2C investigation tool. While it supports 9 major blockchains with cross-chain analysis capabilities, it lacks cross-chain visibility and the ability to view all address connections in EVM-compatible networks. However, Metasleuth provides excellent data visualisations and a highly user-friendly platform.</p>\nMisttrack (https://misttrack.io)\n<p>Misttrack is a tracking and compliance platform for all users. The SlowMist intelligence database is utilised for assigning AML risk scores to addresses based on their interactions on the blockchain. Address labels help a user distinguish between exchanges, crypto whales, MEV bots, and smart contracts.</p>\n<p>Addresses are profiled so that a user can see the various entities they have interacted with, whether that be exchanges, mixers, DeFi, or NFT platforms, together with any malicious events associated with any of them.</p>\n<p>Accessibility for Different Businesses</p>\n<p>Available for all types of businesses.</p>\n<p>Database&nbsp;</p>\n<p>Misttrack has a relatively shallow database, which may limit the depth and coverage of their AML analysis.&nbsp;</p>\n<p>Supported Blockchains</p>\n<p>Misttrack supports only a small number of blockchains. While they may cover some popular blockchains, the range of supported networks is relatively small compared to other AML providers.&nbsp;</p>\n<p>Visualisation and User-Friendliness</p>\n<p>Misttrack's data visualisation capabilities are rated at an average level. The user-friendliness of Misttrack's platform is also considered average, providing a functional but potentially less intuitive interface for users.</p>\n<p>In general, Misttrack offers accessibility to businesses of all types. However, their database is shallow, which may impact the depth of their analysis. They support a limited number of blockchains, limiting their coverage. The visualisation capabilities and user-friendliness of Misttrack's platform are rated at an average level.</p>\nCiphertrace (https://ciphertrace.com/solutions)\n<p>Among the Ciphertrace solutions is their Sentry anti-money laundering transaction monitor. This is generally an institutional service that can be integrated into existing compliance infrastructure via REST APIs that monitor transactions in real time.&nbsp;</p>\n<p>Accessibility for Different Businesses&nbsp;</p>\n<p>Available for all types of businesses.</p>\n<p>Database&nbsp;</p>\n<p>Ciphertrace maintains an average level of database depth. They boast an \"immense data lake\" that connects crypto addresses to real-world organisations. Their proprietary clustering and algorithms rapidly aggregate and correlate various indicators, adding millions of data points weekly.&nbsp;</p>\n<p>Supported Blockchains&nbsp;</p>\n<p>Ciphertrace supports Bitcoin, Ethereum, Bitcoin Cash, Litecoin, and ERC-20 tokens. While they cover several major blockchains, their support may be considered average compared to other AML providers.</p>\n<p>Visualisation and User-Friendliness&nbsp;</p>\n<p>Ciphertrace offers an intuitive user interface and powerful graph explorer for visualising the flow of funds over time and through blockchain entities. Their tools provide fast and easy investigation of cryptocurrency transaction IDs and addresses. However, the level of visualisation and user-friendliness is rated at an average level compared to some other AML providers.</p>\n<p>Ciphertrace Sentry profiles the risk of addresses based on their direct and indirect interactions with a wide variety of entities including exchanges, ATMs, mixers, and gambling services among others.</p>\n<p>Real time intervention is utilised to prevent withdrawals to high risk or suspicious addresses, and deposits from hacks, scams and ransomware are frozen.</p>\n<p>In summary, Ciphertrace offers an average level of accessibility for businesses, with a moderate depth of their database and support for multiple major blockchains. Their visualisation and user-friendliness are also rated at an average level.&nbsp;</p>\nConclusion\n<p>Individuals and businesses are very much encouraged to explore and evaluate for themselves the diverse solutions offered by the top AML tools presented here in order to find the most suitable one for their particular crypto AML requirements. Of course, the list mentioned here is not an exhaustive compilation. There are numerous similar tools available in the market.&nbsp;</p>\n<p>In today&rsquo;s world of fast-moving and highly intelligent entities in the crypto sector, not all of which are following the regulatory rules, the businesses that desire to make sure that they are fully compliant are the ones that are far more likely to succeed.</p>\n<p>It&rsquo;s been a long time in coming, but comprehensive regulations are going to be widely enforced across most global jurisdictions. It is incumbent upon all crypto businesses to ensure that their particular AML solution is sufficiently robust for their needs, as penalties for transgressors are likely to be harsh.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-12T14:00:55.000Z",
    "title": "Silk Road Advisor Sentenced to 20 Years in Prison While a Rogue Double-Agent Eludes Capture",
    "url": "https://news.bitcoin.com/silk-road-advisor-sentenced-to-20-years-in-prison-while-a-rogue-double-agent-eludes-capture/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/sr-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Silk Road Advisor Sentenced to 20 Years in Prison While a Rogue Double-Agent Eludes Capture\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/sr-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sr-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sr-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sr-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sr-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sr-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sr.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Tuesday, July 11, 2023, the U.S. Attorney&#8217;s Office for the Southern District of New York, led by attorney Damian Williams, announced a 20-year prison sentence for Roger Clark. Clark was allegedly the senior advisor to the original Silk Road, an infamous darknet marketplace that operated from 2011 until 2013. Prosecutors from the office reported [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T14:00:17.000Z",
    "title": "cheqd debuts Credential Service – an easy way for anyone to issue credentials",
    "url": "https://www.cryptopolitan.com/cheqd-debuts-credential-service-an-easy-way-for-anyone-to-issue-credentials/",
    "description": "London, England, July 12th, 2023, Chainwire cheqd, a startup that allows users and organizations to gain control and portability of their data, introduces Credential Service, empowering organizations with an easy-to-use, plug-and-play solution for issuing and managing digital credentials. cheqd’s Credential Service is a ready-made, software-as-a-service offering or &#8220;Credential-as-a-Service&#8221; that can easily be integrated into any ... <a title=\"cheqd debuts Credential Service – an easy way for anyone to issue credentials\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cheqd-debuts-credential-service-an-easy-way-for-anyone-to-issue-credentials/\" aria-label=\"More on cheqd debuts Credential Service – an easy way for anyone to issue credentials\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T13:36:33.000Z",
    "title": "Stanford Study Reports 97% Errors By GPT Detectors of AI-Generated Text",
    "url": "https://www.cryptopolitan.com/stanford-reports-97-errors-by-gpt-detectors/",
    "description": "Researchers from Stanford University have conducted a study shedding light on the reliability and limitations of GPT detectors, the tools designed to differentiate between human-written and AI-generated text. One particular detector flagged an overwhelming 97.8% of the TOEFL essays as AI-generated, attributing the misclassification to a lower &#8220;text perplexity&#8221; in non-native English writing. The detectors ... <a title=\"Stanford Study Reports 97% Errors By GPT Detectors of AI-Generated Text\" class=\"read-more\" href=\"https://www.cryptopolitan.com/stanford-reports-97-errors-by-gpt-detectors/\" aria-label=\"More on Stanford Study Reports 97% Errors By GPT Detectors of AI-Generated Text\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-12T14:00:15.000Z",
    "title": "Polygon Volume Registers Sharp Increase, What Does It Mean?",
    "url": "https://www.newsbtc.com/matic/polygon-volume-sharp-increase/",
    "description": "On-chain data shows the Polygon trading volume has seen a significant increase compared to the other altcoins. Here&#8217;s what this means for MATIC. Polygon Trading Volume Has Observed A Sharp Jump Recently According to data from the on-chain analytics firm Santiment, altcoins have observed an increase in trading volume during the last few days. The &#8220;trading volume&#8221; here is an indicator that measures the daily total amount of a given cryptocurrency that&#8217;s getting involved in transactions on the blockchain. When the value of this metric is high, it means that a large number of tokens are being shifted around on the network. Such a trend can be a sign that traders of the asset are actively participating in the market right now. On the other hand, low values imply that the cryptocurrency is observing a low amount of activity currently. This kind of trend can suggest that there isn&#8217;t much interest in the coin among general investors at the moment. Now, here is a chart that shows the trend in the trading volume of some of the largest assets in the sector over the past week: Looks like the alts across the board have seen a rise in this metric &#124; Source: Santiment on Twitter As displayed in the above graph, the trading volume of most of the altcoins had declined to relatively low values a few days back, implying that interest in them had dropped. Related Reading: This Bitcoin Rally Is Similar To Genesis Points Of Historical Uptrends: Glassnode However, during the last couple of days or so, the indicator&#8217;s value has bounced back for these assets, suggesting that investors are once again participating in trading. From the chart, it&#8217;s visible that two altcoins in particular have enjoyed the sharpest increase in the metric: Polygon and BNB. This would mean that these cryptocurrencies have a stronger interest backing them right now. Generally, high amounts of volume are needed to sustain any sharp moves in the price. This is because a high volume implies the presence of a large number of traders, who can provide fuel for building any such move. Thus, whenever the trading volume rises for any asset, the price of the coin becomes more likely to show volatility. Which direction such volatile price action might take the cryptocurrency in is hard to say from the volume alone, however. In the case of Polygon and BNB, though, a surge in their prices occurred in the same period as when their trading volumes jumped. This may imply that this fresh trading interest is leaning toward the buying side, at least for now. Related Reading: Bitcoin Market Braces For CPI Figures: Will BTC Rally Or Retreat Today? With this latest uptrend, MATIC&#8217;s price has gone up by almost 9%. Naturally, if the trading volume continues to remain high in the coming days, it&#8217;s possible that this fresh increase might continue into the near future. MATIC Price At the time of writing, Polygon is trading around $0.73, up 5% in the last week. Polygon has enjoyed some rise recently &#124; Source: MATICUSD on TradingView Featured image from GuerrillaBuzz on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T14:01:11.000Z",
    "title": "cheqd debuts Credential Service – an easy way for anyone to issue credentials",
    "url": "https://www.crypto-news-flash.com/cheqd-debuts-credential-service-an-easy-way-for-anyone-to-issue-credentials/?utm_source=rss&utm_medium=rss&utm_campaign=cheqd-debuts-credential-service-an-easy-way-for-anyone-to-issue-credentials",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Untitled_design_64_1689145898rbg5A8GqBL.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Untitled_design_64_1689145898rbg5A8GqBL.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Untitled_design_64_1689145898rbg5A8GqBL-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Untitled_design_64_1689145898rbg5A8GqBL-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Untitled_design_64_1689145898rbg5A8GqBL-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />London, England, July 12th, 2023, Chainwire cheqd, a startup that allows users and organizations to gain control and portability of their data, introduces Credential Service, empowering organizations with an easy-to-use, plug-and-play solution for issuing and managing digital credentials. cheqd’s Credential Service is a ready-made, software-as-a-service offering or &#8220;Credential-as-a-Service&#8221; that can easily be integrated into any [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T14:00:05.000Z",
    "title": "Is ApeMax the next Dogecoin? Exploring the newest trending Crypto Coin Presale",
    "url": "https://www.crypto-news-flash.com/is-apemax-the-next-dogecoin-exploring-the-newest-trending-crypto-coin-presale/?utm_source=rss&utm_medium=rss&utm_campaign=is-apemax-the-next-dogecoin-exploring-the-newest-trending-crypto-coin-presale",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-12T132846.074.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-12T132846.074.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-12T132846.074-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Today, we are thrilled to announce the latest developments surrounding ApeMax, a coin that could disrupt the status quo and capture the attention of the crypto community. With its strong and promising new tokenomics model, ApeMax has already ignited a frenzy of staking activity, demonstrating the enthusiasm and support it has garnered within a short [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T13:11:02.000Z",
    "title": "DOJ Exposes Mind-Blowing OpenSea Spoofing Scam: Man Charged with Stealing $450K in Cryptos and NFTs",
    "url": "https://www.crypto-news-flash.com/doj-exposes-mind-blowing-opensea-spoofing-scam-man-charged-with-stealing-450k-in-cryptos-and-nfts/?utm_source=rss&utm_medium=rss&utm_campaign=doj-exposes-mind-blowing-opensea-spoofing-scam-man-charged-with-stealing-450k-in-cryptos-and-nfts",
    "description": "<img width=\"2560\" height=\"1696\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/ransomware-2321110-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/ransomware-2321110-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/ransomware-2321110-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/ransomware-2321110-1024x678.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/ransomware-2321110-768x509.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/ransomware-2321110-1536x1017.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/ransomware-2321110-2048x1356.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/ransomware-2321110-104x69.jpg 104w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />The US Justice Department has exposed a 25-year-old man for stealing $450,000 from users by cloning the OpenSea marketplace. If found guilty of fraud, Soufiane Oulahyane could be sentenced to 20 years in prison.  OpenSea, one of the most popular Non-Fungible Tokens (NFT) marketplaces, has been cloned to steal hundreds of thousands from users. According [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-12T13:53:00.000Z",
    "title": "Crypto Analyst Believes Indicators Have Aligned for Bitcoin Rally",
    "url": "https://coinedition.com/crypto-analyst-believes-indicators-have-aligned-for-bitcoin-rally/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Top-Altcoins-For-The-Second-Half-Of-2023-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Everything seems to be working toward a continuing Bitcoin rally, according to Josh Moden, a host of the crypto YouTube channel, CryptoBusy. In a recently uploaded video, Moden explained that Bitcoin is obeying the classic technical indicators. He also noted that Ethereum co-founder Vitalik Buterin’s positive remarks for Bitcoin Ordinals support the positive sentiment toward [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-analyst-believes-indicators-have-aligned-for-bitcoin-rally/\">Crypto Analyst Believes Indicators Have Aligned for Bitcoin Rally</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-12T13:33:00.000Z",
    "title": "Analytics Platform Suspects Institutional Buying of CRV Tokens",
    "url": "https://coinedition.com/analytics-platform-suspects-institutional-buying-of-crv-tokens/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/There-may-be-some-institutions-buying-CRV-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Lookonchain, the onchain and smartmoney analytics platform, has spotted significant transactions involving Curve DAO (CRV) tokens. According to a recent tweet, Lookonchain noticed four fresh wallets that withdrew 10.2 million CRV, equivalent to $8.12 million from the Binance exchange in the past seven days. Lookonchain noted that all four wallets involved in the transaction were [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/analytics-platform-suspects-institutional-buying-of-crv-tokens/\">Analytics Platform Suspects Institutional Buying of CRV Tokens</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-12T13:18:00.000Z",
    "title": "$70M+ Worth Of APE, APT, IMX To Be Unlocked In Next 30 Days",
    "url": "https://coinedition.com/70m-worth-of-ape-apt-imx-to-be-unlocked-in-next-30-days/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Will_the_Top_3_Token_Unlocks_Worth_75_Million_This_Week_Affect-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Data from the tokenomics tracking platform Token Unlocks indicates that substantial amounts of ApeCoin (APE), Immutable (IMX), and Aptos (APT) will be unlocked within the next month. In total, just under $75 million worth of tokens will be unlocked within the next thirty days. Both APE and IMX will face their respective token unlocks within [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/70m-worth-of-ape-apt-imx-to-be-unlocked-in-next-30-days/\">$70M+ Worth Of APE, APT, IMX To Be Unlocked In Next 30 Days</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]