[
  {
    "source": "Cointelegraph",
    "date": "2023-12-25T12:05:00.000Z",
    "title": " Sotheby’s sold $35 million worth of digital art in 2023 ",
    "url": "https://cointelegraph.com/news/sothebys-sold-35-million-digital-art-2023",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNDUxMWM2YjQtMDM2Ni00OWVhLWE5OTMtOTg3ZTgyMmRkNjMwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The 279-year-old British-American auction house also recorded the highest fee for digital artwork yet in 2023. </p>\n                    <p><p>Fine arts auction house Sotheby’s made “close to $35 million” in digital art sales this year. The numbers were provided by Michael Bouhanna, the vice president of the company and its head for digital art, who called 2023 “one of the most exciting years for digital art.”</p><p>On Dec. 23, Bouhanna <a href=\"https://twitter.com/michaelbouhanna/status/1738580008182923542\" target=\"_blank\" rel=\"noopener nofollow\">concluded</a> Sotheby’s year results regarding digital art in his X (former Twitter) account. In 2023, Sotheby’s conducted its first live digital art auction with 300 attendees and $12 million in sales. It also recorded the highest fee for digital artwork yet, selling the non-fungible token (NFT) under the title “Ringers #879”, created by digital artist Dmitri Cherniak, for $6.2 million. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/nft-bored-ape-sotheby-s-and-yuga-labs-respond-to-lawsuit-from-bored-ape-investors\"><strong><em>Sotheby’s and Yuga Labs respond to lawsuit from Bored Ape investors</em></strong></a></p><p><a href=\"https://cointelegraph.com/news/sothebys-sold-35-million-digital-art-2023\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-25T11:45:20.000Z",
    "title": "Miners see increased revenue stream from inscriptions",
    "url": "https://cryptoslate.com/insights/miners-see-increased-revenue-stream-from-inscriptions/",
    "description": "<p>Quick Take The Bitcoin mining industry is experiencing a notable shift in its revenue structure. CryptoSlate&#8217;s analysis identified a significant increase in the fees miners earn from processing transactions. Last week, these fees exceeded the standard block reward of 6.25 BTC, suggesting a potential shift away from the traditional way miners generate their income. Typically, [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/miners-see-increased-revenue-stream-from-inscriptions/\">Miners see increased revenue stream from inscriptions</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-25T12:04:39.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-25T12:03:09.000Z",
    "title": "Front Mission 1st: Remake to Receive Expansive Free Update in 2024",
    "url": "https://www.cryptopolitan.com/front-mission-1st-remake-free-update-in-2024/",
    "description": "Forever Entertainment has just announced a substantial free expansion for Front Mission 1st: Remake, scheduled for release in 2024. Titled Mercenaries, this expansion is set to enrich the gaming experience for fans of the tactical RPG. The update boasts a host of exciting features, including new single-player scenarios, a local multiplayer hot-seat mode, fresh mercenaries, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-25T12:00:15.000Z",
    "title": "XRP In December 2023: Decoding An 800% Nostalgia And The Hope For $1",
    "url": "https://www.newsbtc.com/news/xrp-in-december-2023-decoding-an-800-nostalgia-and-the-hope-for-1/",
    "description": "XRP has been under a cold spell in December for years, with red charts and cold winds every year. Some buyers are still scared about the market because they remember the 66% drop in 2021. The sounds of 2018, a year with an amazing 800% rise, sound like a faraway Christmas carol. They remind the XRP community of a time when XRP believed in the magic of year-end wonders. Even though December charts used to be full of holiday cheer, XRP was stuck by the shadow of past trends, hoping that its luck would improve by the end of the year. Related Reading: ALGO Blows Up To 42-Week High, Delighting Algorand Fans Will This Month Be Different For XRP? While it&#8217;s cold outside in December 2023, there are hints of hope for change in the air. The big question is whether this month will be different, and whether XRP can finally break free from the Scrooge-like grip that has been limiting its year-end results. CryptoRank&#8217;s data, which is often like a Grinch to XRP&#8217;s holiday mood, still shows a sad picture of past December coming back. There is a cemetery of red bars across the chart (below). Source: CryptoRank Each one shows a year of loses at the end of the year. In the middle of this cold landscape, though, sits a defiant evergreen: 2017. Its shimmering 818% gains serve as a reminder of XRP&#8217;s hidden potential. The averages for XRP in December on the crypto market show two parts of the story. A 75% average return shines like a holiday ornament, a memory of times when the market was rising around this time of the year. A (minus) 4% median, on the other hand, forms a shadow, a lump of coal that shows how volatile XRP&#8217;s December performances have often been. Still, this December feels different. There&#8217;s a soft hint of change in the air, like a mistletoe of promise. XRP market cap currently at $34 billion. Chart: TradingView.com When you look at XRP&#8217;s past of chilly Decembers, even a small 2% rise that might not seem important in other situations feels like a big deal. Even though the wins in December might not last, the bigger picture shines with newfound warmth. With a respectable 20.4% quarterly gain, the fourth quarter of 2023 has been very good. It was the second-best quarter of the year and the first positive Q4 since 2017. But the rumors about December are more than just changes in prices. Technical indicators are pointing to a possible bull run, which would be very different from the normal drop at the end of the year. There will be some hard times ahead for XRP. XRP price action in the last year. Source: CoinMarketCap Related Reading: Polkadot Pops: Price Hits Fresh 2023 Peak, Breaking Through Doubts Hope Lingers For XRP Three important barrier levels—$0.63, $0.66, and $0.70—will stand in the way of its possible upward trend. For XRP to break free from its past limits, it needs to take over these points that were once battlegrounds between bulls and bears. Even though the road is steep, it&#8217;s not impossible. It&#8217;s still not clear what will cause such a change, but the technical signs and resistance seen this month are a sign of hope. If XRP can break through these levels of resistance, it could be on track for a big rise, possibly hitting the all-time high of $1 before the current year ends. This is more than just a story of numbers and charts; it&#8217;s a story of strength, going against the grain, and a glimmer of hope in the cold grip of December. In this story, XRP, which was dormant at one point, wakes up full of promise. The rumors from December make one thing clear: the winter blues might be melting away and a better future could be on the horizon. Only time will tell if 2024 is the spring of a new XRP. Featured image from Freepik"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-25T11:51:34.000Z",
    "title": "XRP Price Analysis for December 25: Is the Price Ready To Rise?",
    "url": "https://coinedition.com/xrp-price-analysis-for-december-25-is-the-price-ready-to-rise/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/XRP-analysis-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/XRP-analysis-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/XRP-analysis-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/XRP-analysis-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/XRP-analysis-2-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/XRP-analysis-2-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/XRP-analysis-2-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Despite Ripple’s (XRP) Head and Shoulder (H&#38;S) structure, the weekly close was below resistance, technical analyst Cryptoes revealed. The H&#38;S pattern is a chart formation that spots a bullish to bearish trend while indicating an upward movement is nearing its end. Cryptoes showed that XRP had initially closed above the daily diagonal support at $0.67. [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/xrp-price-analysis-for-december-25-is-the-price-ready-to-rise/\">XRP Price Analysis for December 25: Is the Price Ready To Rise?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]