[
  {
    "source": "Cointelegraph",
    "date": "2024-01-29T05:22:49.000Z",
    "title": " Unwanted emails from Patreon? Crypto users say it might be a phishing scam ",
    "url": "https://cointelegraph.com/news/crypto-users-report-patreon-phishing-scam-emails",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOGEzMTk2ZWMtOGVhZi00YzI1LWFlODctMDk2YmZiZGE3OTg0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Patreon Support said it has identified the problem and is working to address “affected accounts” as crypto users continue to receive unsolicited spam.</p>\n                    <p><p>Crypto users across social media have sounded the alarm over a new spate of crypto-themed phishing emails — seemingly sent from content creator platform Patreon.</p><p>According to reports on social media platforms X and Reddit, crypto users have been getting their email addresses signed up for Patreon by scammers who would then sign them up for malicious emails from fake crypto projects on the platform. </p><p>Reports of the attempted phishing attacks began to appear on Jan. 23, with users reporting that they’ve received fake airdrop offers from Patreon creators impersonating <a href=\"https://x.com/0xspynter/status/1749760167317541081\" target=\"_blank\" rel=\"noopener nofollow\">Chainlink</a> (LINK), <a href=\"https://x.com/0xspynter/status/1749760167317541081\" target=\"_blank\" rel=\"noopener nofollow\">Solana</a> (SOL), <a href=\"https://x.com/0xspynter/status/1749760167317541081\" target=\"_blank\" rel=\"noopener nofollow\">Manta Network</a> (MANTA) and <a href=\"https://x.com/0xspynter/status/1749760167317541081\" target=\"_blank\" rel=\"noopener nofollow\">Sui</a> (SUI).</p><p><a href=\"https://cointelegraph.com/news/crypto-users-report-patreon-phishing-scam-emails\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-29T05:30:50.000Z",
    "title": "Latam Insights: Argentina’s Milei States Dollarization Is Close, Bitfarms Expands In Paraguay",
    "url": "https://news.bitcoin.com/latam-insights-argentinas-milei-states-dollarization-is-close-bitfarms-expands-in-paraguay/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/394881ea-b1f9-4030-a727-70fc0cd695bd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Latam Insights: Argentina&#039;s Milei States Dollarization Is Close, Bitfarms Expands in Paraguay\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/394881ea-b1f9-4030-a727-70fc0cd695bd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/394881ea-b1f9-4030-a727-70fc0cd695bd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/394881ea-b1f9-4030-a727-70fc0cd695bd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/394881ea-b1f9-4030-a727-70fc0cd695bd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/394881ea-b1f9-4030-a727-70fc0cd695bd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/394881ea-b1f9-4030-a727-70fc0cd695bd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/394881ea-b1f9-4030-a727-70fc0cd695bd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Welcome to Latam Insights, a compendium of Latin America&#8217;s most relevant crypto and economic news during the last week. In this issue: Argentine President Javier Milei reiterates dollarization is near, Bitfarms announces a new site in Paraguay, and El Salvador approves a soy-backed token issuance. Argentina&#8217;s Milei Talks Dollarization Again Javier Milei, president of Argentina, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-29T05:28:44.000Z",
    "title": "DOT Price (Polkadot) Uptrend To Continue? These Could Be The Factors To Watch",
    "url": "https://www.newsbtc.com/analysis/dot/dot-price-polkadot-uptrend-8-50/",
    "description": "Polkadot (DOT) is gaining pace above the $6.80 resistance against the US Dollar. The price could gain bullish momentum if it clears the $7.28 resistance. DOT is trading in a positive zone from the $6.00 support against the US Dollar. The price is trading near the $7.00 zone and the 100 simple moving average (4 hours). There was a break above a key bearish trend line with resistance near $6.50 on the 4-hour chart of the DOT/USD pair (data source from Kraken). The pair could continue to rise unless the bears are able to defend the $7.28 resistance zone. Polkadot Price Restarts Increase After a steady decline, DOT price found support near the $6.00 zone. A low was formed at $5.97 and Polkadot recently started a fresh increase. The price was able to clear the $6.20 and $6.50 resistance levels to move into a positive zone, like Bitcoin and Ethereum. There was a break above a key bearish trend line with resistance near $6.50 on the 4-hour chart of the DOT/USD pair. The pair even surpassed the 23.6% Fib retracement level of the downward move from the $8.58 swing high to the $5.97 low. DOT is now trading near the $7.00 zone and the 100 simple moving average (4 hours). Immediate resistance is near the $7.20 level. The next major resistance is near $7.28 or the 50% Fib retracement level of the downward move from the $8.58 swing high to the $5.97 low. Source: DOTUSD on TradingView.com A successful break above $7.28 could start another strong rally. In the stated case, the price could easily rally toward $8.00 in the near term. The next major resistance is seen near the $8.50 zone. Are Dips Supported in DOT? If DOT price fails to start a fresh increase above $7.28, it could start a fresh decline. The first key support is near the $6.60 level. The next major support is near the $6.00 level, below which the price might decline to $5.65. Any more losses may perhaps open the doors for a move toward the $5.32 support zone. Technical Indicators 4-Hours MACD – The MACD for DOT/USD is now gaining momentum in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for DOT/USD is now above the 50 level. Major Support Levels – $6.60, $6.00 and $5.65. Major Resistance Levels – $7.28, $8.00, and $8.50."
  }
]