[
  {
    "source": "Decrypt",
    "date": "2023-10-13T21:49:17.000Z",
    "title": "SEC Won’t Appeal Grayscale Bitcoin ETF Ruling: Reports",
    "url": "https://decrypt.co/201493/sec-appeal-grayscale-bitcoin-etf",
    "description": "But that doesn't mean a spot market Bitcoin ETF is a lock."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-13T21:45:00.000Z",
    "title": "Caroline Ellison desired to step down but feared a bank run on FTX",
    "url": "https://cointelegraph.com/news/caroline-ellison-desired-step-down-feared-bank-run-ftx-sam-bankman-fried",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/d78a7347-0f02-44f3-a868-5b00f8b2be41.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Former Alameda CEO Caroline Ellison recognized she wasn't doing a good job months before the company filed for bankruptcy, but Sam Bankman-Fried persuaded her to stay.</p>\n                    <p><p>Ellison spent over ten hours testifying during Bankman-Fried's trial this week, notably entering through the front doors of the federal court in Manhattan, joined by her attorneys. According to Ellison, she had not seen Bankman-Fried since the crypto empire failed in November last year. But their communication eroded even months before. </p><p>In April 2022, their romantic relationship came to an end, and Caroline started avoiding meetings with Bankman-Fried, even though they still lived in the same luxurious apartment in the Bahamas. Alameda's growing liabilities with FTX and the breakup made her consider leaving Alameda.</p><p>\"I feel link neither Trabucco nor I have been doing a great job of pushing on stuff,\" she wrote in the document to Bankman-Fried, shared as evidence during her cross-examination by his defense counsel. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">One more Caroline Ellison courtroom sketch. <br><br>This one featuring SBF himself! <a href=\"https://t.co/q3O6xqxEhl\">https://t.co/q3O6xqxEhl</a> <a href=\"https://t.co/cQJbj5V1H7\">pic.twitter.com/cQJbj5V1H7</a></p>— Ariel Givner, Esq. (@GivnerAriel) <a href=\"https://twitter.com/GivnerAriel/status/1711915547074425195?ref_src=twsrc%5Etfw\">October 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Bankman-Fried asked her to stay, saying that her departure could create rumors about Alameda's financial health, thus harming FTX credibility. Ellison remained as CEO. </p><p>Ellison joined Alameda as a trader in 2018. By 2020, she was handling most of the company's operations, while Bankman-Fried was focused on his newly launched crypto exchange FTX. In August 2021, she became co-CEO alongside Sam Trabucco, who stepped down a few months later, leaving her in charge of the company. In August 2022, Trabucco officially resigned as co-CEO.</p><p>Ellison was against creating FTX, she revealed. “I didn't think of myself as ambitious before I started at Alameda, but I believe I became more ambitious” under Bankman-Fried's incentive, she said. </p><p>As CEO, Elisson was in charge of handling Alameda's crypto lenders. In mid-2022, after the Terra ecosystem failed, the company's open-term loans stood at $1.3 billion. The market downturn drained liquidity from crypto assets, leading Alameda's lenders to demand repayment on loans. </p><p>According to Ellison, Bankman-Fried instructed her to keep repaying creditors via Alameda's line of credit with FTX. In other words, Alameda would use FTX's customers' assets to repay crypto lenders. At the time, its line of credit with the exchange stood at $13 billion. </p><p>As lenders demanded repayment of loans and Alameda's balance sheets, Bankman-Fried suggested Ellison use \"alternative means\" for presenting the company's financials. In the following months, Ellison would create many additional versions of a balance sheet to deceive creditors.</p><p>Early in November, an alternative version of Alameda's balance sheet was leaked. At the time, Ellison was on vacation in Japan, but she had to travel to FTX Hong Kong's office to deal with the company's crisis.</p><p>While the balance sheet data didn't reflect the company's reality, it was enough to spread rumors and trigger a bank run on FTX a few days later, exposing an $8 billion gap between the companies.</p><p>Cooperating with the Department of Justice since December, Ellison will soon receive her sentence regarding the seven counts of fraud and conspiracy to commit fraud she was charged with. </p><p>Caroline Ellison wasn't doing a good job leading Alameda Research in 2022, and she did not hide it. Pieces of her personal notes shared as evidence by prosecutors on Sam Bankman-Fried's trial revealed details about the trading firm's struggles and its CEO's desire to resign weeks and months before the collapse of FTX. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-13T22:00:39.000Z",
    "title": "SEC will not appeal Grayscale decision, bringing spot Bitcoin ETFs closer to reality",
    "url": "https://cryptoslate.com/sec-will-not-appeal-grayscale-decision-bringing-spot-bitcoin-etfs-closer-to-reality/",
    "description": "<p>In a decisive development, the U.S. Securities and Exchange Commission (SEC) has decided not to appeal a recent court ruling that found it was unjust to reject an application from Grayscale Investments to create a spot bitcoin exchange-traded fund (ETF). The District of Columbia Court of Appeals in Washington had ruled in August that the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-will-not-appeal-grayscale-decision-bringing-spot-bitcoin-etfs-closer-to-reality/\">SEC will not appeal Grayscale decision, bringing spot Bitcoin ETFs closer to reality</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-13T22:00:12.000Z",
    "title": "This Trader Is On The Brink Of Losing Money, Will Selling WBTC On Aave V2 Help?",
    "url": "https://www.newsbtc.com/news/trader-brink-losing-money-selling-wbtc-aave/",
    "description": "A trader on Aave, a decentralized liquidity protocol operating on multiple platforms, including Ethereum and OP Mainnet, has begun selling wrapped Bitcoin (WBTC) to repay outstanding debt, records on October 13 reveal. WBTC is a tokenized version of Bitcoin issued on Ethereum that allows holders to engage in decentralized finance (DeFi) activities. Trader Selling WBTC To Repay Debt On Aave v2 According to Lookonchain data, the unidentified trader marked with address “0x47ab” borrowed roughly $8 million worth of multiple stablecoins, including USDC, USDT, and DAI, Maker&#8217;s stablecoin, on Aave v2 after depositing various assets, including WBTC, Maker (MKR), and Ethereum (ETH) worth approximately $11 million. Related Reading: Failed Bullish Pattern Could Send Ethereum Sub-$1000 When writing, the health factor of borrowed assets stands at 1.09, teetering close to liquidation. According to Aave’s documents, the health factor is a metric that compares the safety of collateral and borrowed loans to the underlying value. Technically, the higher it is, the safer the funds are from liquidation. If the health factor exceeds $1, deposited collateral will be liquidated to borrow outstanding loans.  Aave is a popular decentralized finance (DeFi) protocol where token holders can choose to supply liquidity and earn passive income. At the same time, users can deposit collateral and borrow overcollateralized loans, which they can repay at any time, provided the health factor is around 1. Since loans are overcollateralized, the collateral is usually higher than the borrowed amount. Volatile Bitcoin Prices To Blame? As it is, the trader, Lookonchain shows, has started selling WBTC to repay outstanding debt. A big chunk of what the trader supplied is in WBTC, standing at 366.56 WBTC, worth roughly $9.1 million at spot rates.  However, considering market prices have fluctuated recently, the contraction has impacted the health factor, increasing the risk of collateral liquidation. To counter this, the trader sold 3 WBTC for roughly $80,000.  The address still owes Aave V2 approximately $8.08 million, mostly in USDT, at around $5 million. There are $3 million of USDC and around $368,000 of DAI. It is unclear whether the trader will seek to borrow more, especially if Bitcoin prices increase. Related Reading: Have Traders Moved Past Dogecoin? Transactions Plunge 98% Since June The address remains long on MKR, the governance token of the MakerDAO protocol; Uniswap’s UNI; Chainlink’s LINK; and Ethereum. Besides WBTC, the trader’s second-largest holding is in ETH, while the smallest is MKR. Ironically, MKR has been one of the top-performing assets, rallying by over 160% in H2 2023 alone. The token peaked at $1,600 in early October before cooling off to spot rates. Feature image from Canva, chart from TradingView"
  }
]