[
  {
    "source": "Cointelegraph",
    "date": "2023-05-29T13:01:00.000Z",
    "title": "Ledger CEO says crypto key recovery service makes self-custody easier",
    "url": "https://cointelegraph.com/news/ledger-ceo-says-crypto-key-recovery-service-makes-self-custody-easier",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/20a90d21-b16d-479f-a299-f9f7160b23d6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ledger’s “Recover” service may be concerning, but some crypto industry participants think the feature may onboard new users while helping crypto natives.</p>\n                    <p><p>Hardware crypto wallet firm Ledger has faced harsh criticism from the crypto community after announcing its “Recover” service, which is an optional paid feature that will eventually allow users to back up and restore their <a href=\"https://cointelegraph.com/explained/what-is-a-seed-phrase-and-why-is-it-important\">private seed phrase.</a></p><p>Due to concerns expressed about the security elements of Ledger Recover, the hardware wallet manufacturer <a href=\"https://cointelegraph.com/news/ledger-recover-paused-code-will-open-source\">decided to postpone the launch of its service</a>. On May 23, Charles Guillemet, chief technology officer of Ledger, explained in a Twitter thread that Ledger will “accelerate our open-sourcing roadmap to bring more verifiability to everything we do.” </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Ledger’s mission is, and will always be, to provide our users with the right tools to own their digital value securely.<br><br>We have decided to accelerate our open-sourcing roadmap to bring more verifiability to everything we do.<br><br>A thread  <a href=\"https://t.co/Dv0jBCM4Ys\">pic.twitter.com/Dv0jBCM4Ys</a></p>&mdash; Charles Guillemet (@P3b7_) <a href=\"https://twitter.com/P3b7_/status/1661012196397305859?ref_src=twsrc%5Etfw\">May 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ledger CEO Pascal Gauthier told Cointelegraph that Ledger Recover would launch once the company can open-source the code behind the Recover protocol. He further stressed that the new service is optional:</p><blockquote>“Right now, the overwhelming majority of crypto users hold their funds on exchanges or software wallets, which are not secure. However, many people find managing their 24 words daunting or too complex. Ledger Recover — which again is completely optional — is designed for those people to make secure self custody easier, while not compromising on security.”</blockquote><p>According to Gauthier, the goal behind Ledger Recover is to onboard the next 100 million users to the crypto sector. Yet, to achieve this, he believes that “access to secure self-custody should be much easier.”</p><p>While this may be the case, the concept behind Ledger Recover has upset many of the company’s current users. Shahar Madar, head of security products at Fireblocks — an institutional digital asset custody platform — told Cointelegraph that Ledger Recover goes against the core ideals of Ledger’s customers:</p><blockquote>“If it indeed allows a user to recover the full private key into a brand new device with just a form of identification, then technically, if the providers wanted to collude and initiate the process without the proper identification and authorization, they could.”</blockquote><p>“In this case, the user is trusting the providers to follow the procedures, and there are inherent risks there,” he said.</p><h2>Ledger Recover may be needed</h2><p>Although Ledger Recover has created uproar in the crypto ecosystem, some industry participants believe this service could be useful for onboarding new users and helping current crypto holders keep track of their seed phrases. </p><p>For instance, Madar highlighted that one of the biggest challenges associated with cryptocurrency is that it’s too complex for many users. “Specifically, keeping track of your physical device and seed phrase for years is far from trivial for the average person. Every user should be able to back up their keys somewhere,” he said. </p><p>With this in mind, a service like Ledger Recover may be ideal for some individuals. Madar added that the good thing about Ledger Recover is that the feature is optional. “Users that are uncomfortable with this scenario can choose not to use the service, either forever or until Ledger is able to satisfy their concerns.” </p><p>Echoing this, Marvin Janssen, co-founder of hardware wallet provider Ryder, told Cointelegraph that Ledger Recover might appeal to mainstream customers. “It absolutely happens that people, especially those new to Web3, lose access to their wallet because of a faulty or complete lack of a backup. A feature like Ledger Recover can, therefore, definitely help,” he said. </p><p>However, Janssen added that it remains questionable if users would want to pay for such a service, given the current lack of clarity around the new feature. “Users still need to understand exactly what they are signing up for and how it can help them.”</p><p>While Gauthier mentioned that Ledger would soon make the code behind the Recover protocol open-source to help users better understand the technology, he explained that users who subscribe to the service would prove their identity through ID verification to ensure that only they have access to their backups. Once this is approved on their Ledger, their device creates an encrypted backup that’s split into three shards using Shamir’s secret sharing. He said:</p><blockquote>“These three shards are then sent via secure channels to three different companies in three different jurisdictions, where they’re secured on hardware security modules (not in the cloud). To restore, users must go through identity verification again through two different providers, after which two shards will be sent back to your new device and decrypted on the Ledger.”</blockquote><p>In other words, Ledger Recover uses <a href=\"https://cointelegraph.com/news/multi-party-computation-could-offer-increased-protection-for-crypto-wallets\">multiparty computation</a>: a cryptographic protocol that allows multiple parties to jointly compute a function over their inputs without revealing those inputs to each other. </p><p>Although this model may provide some form of security, Janssen noted that the challenge actually lies in the transport of the shards. “The nature of the algorithm used by Ledger Recover is such that the original secret information is recovered if enough shards are combined. Thus, an attacker might be more interested in intercepting them when they are transmitted instead of trying to attack the Ledger itself,” he said.</p><p>In addition, Janssen explained that if all shards are transported to the custodians at the same time, then there will be a moment when they all exist together on a single device, like a customer’s laptop. “Ledger has undoubtedly thought about this situation, so as more information becomes available, it might become clear that this isn’t an issue,” he said. </p><h2>Mixed sentiments around Ledger Recover</h2><p>Until more clarity around Ledger Recover is revealed, there will likely be mixed feelings about the service. </p><p>For instance, Margaret Rosenfeld, chief legal officer for crypto exchange Cube Exchange, told Cointelegraph that she believes non-crypto natives and many crypto users desire some recovery support they can trust. </p><p>“Complete self-management of digital assets is not what most people want. What they desire is a noncustodial solution that keeps them as the owner of their assets and allows them to interact with others and platforms to transact seamlessly with little effort and no additional cost,” she said. </p><p>On the flip side, security concerns will remain. John Woods, chief technology officer at the Algorand Foundation, told Cointelegraph that, in particular, he is concerned whether it’s possible for Ledger’s custodians to collude: </p><blockquote>“Ledger has said the keys that leave the Ledger device (the controversial bit) are ‘encrypted’ and sharded. The sharded bit is clear. But they’ve said, ‘The keys are first encrypted with a symmetric key.’ I’m asking, what is that symmetric cipher? And what randomness is used to generate the key? We are still awaiting answers.”</blockquote><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-29T13:00:41.000Z",
    "title": "AAG Launches TomoOne: An NFT-Based Game to Educate and Entertain MetaOne® Users",
    "url": "https://cryptodaily.co.uk/2023/05/aag-launches-tomoone-an-nft-based-game-to-educate-and-entertain-metaone-users",
    "description": "<p>Singapore, Singapore, May 29th, 2023, Chainwire</p><p>AAG is pleased to announce the launch of TomoOne, an innovative NFT-based game developed on Saakuru&rsquo;s gas-fee free blockchain with the aim of providing educational value and interactive engagement for MetaOne&reg; users in the realm of Web3. Early adopters of MetaOne&reg; will be able to mint the free Tomo NFT without having to pay for gas fees.&nbsp;</p><p>TomoOne serves as a virtual companion, taking the form of an endearing animal, guiding users through the dynamic world of Web3. The name \"Tomo\" derives from the Japanese word for \"friend,\" symbolizing the close bond users will form with their virtual companions. Beyond being a mere companion, TomoOne acts as a reliable guide, offering support and facilitating exploration within the Web3 ecosystem.</p><p>By nurturing and attending to their Tomo, players will gain insights into utilizing crypto wallets, discovering decentralized applications (dApps), and participating in the creation of NFTs, all within an immersive gaming environment. Furthermore, engaging with TomoOne provides users with access to the AAG Charity DAO, enabling them to actively contribute through voting for a monthly charitable donation recipient.</p><p>Additionally, users will accrue points based on their interactions with TomoOne, which can be redeemed for entry into weekly AAG partner giveaways and unlock higher tiers in the MetaOne&reg; Tier Program. Progressing through the tiers grants users enhanced benefits such as increased discounts for MetaOne&reg; swaps or on-ramps. The MetaOne&reg; Tier Program is designed to recognize and reward loyal users with exclusive advantages.</p><p>To embark on their journey with TomoOne, users simply need to download the MetaOne&reg; wallet (if not already done so) and follow AAG on Twitter to remain informed about the latest news and updates.</p><ul><li>Download MetaOne for iOS</li><li>Download MetaOne for Android</li></ul><p>Once downloaded and registered, follow the below steps to claim your TomoOne:</p><ol><li>On the homescreen, locate &ldquo;Claim Your Welcome Gift&rdquo; message</li><li>Click on &ldquo;Claim now&rdquo;</li><li>Once the egg appears on-screen, click &ldquo;See What&rsquo;s Inside!&rdquo;</li><li>Approve transaction with your Signature</li><li>You will now receive your TomoOne!&nbsp;</li></ol>&ldquo;At AAG, we firmly believe that education is pivotal to fostering widespread adoption. TomoOne represents our commitment to making Web3 accessible and fostering engagement for all users. We encourage individuals to embrace the TomoOne experience and embrace the opportunity for learning within the Web3 landscape.&rdquo; said Jack Vinijtrongjit, CEO at AAG.<p>AAG extends its sincere appreciation to the MetaOne&reg; community members for their invaluable support, and eagerly anticipates their feedback on TomoOne.</p><p></p><p>About AAG</p><p>AAG is a Web3 infrastructure company dedicated to providing software that simplifies interactions with blockchain applications and the Metaverse, catering to both mainstream users and traditional companies. AAG offers the secure, user-friendly and seedless MetaOne&reg; wallet, as well as infrastructure software such as a cross-chain search engine and the gas-fee-less Saakuru blockchain for enterprise companies. With the belief that education is pivotal in unlocking the potential of Web3, AAG also provides AAG Academy, a comprehensive knowledge bank, and TomoOne, a risk-free, gamified in-wallet experience to ease the transition. AAG's ultimate goal is to bring 1 billion people into the Web3 economy by 2030.</p><p>For more information about AAG, visit: AAG Linktree</p>ContactCEOJack Vinijtrongjitpartnership@aag.ventures"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-29T13:00:19.000Z",
    "title": "Huobi readies for Hong Kong’s crypto trading launch on June 1",
    "url": "https://cryptodaily.co.uk/2023/05/huobi-readies-for-hong-kong-s-crypto-trading-launch-on-june-1",
    "description": "<p>Crypto exchange Huobi has applied for a licence in Hong Kong to offer crypto trading to institutions as well as retail.</p>\n<p>Huobi HK has embarked on a journey to revolutionise the crypto trading landscape in Hong Kong. The company made a significant stride on May 29 by applying for a coveted regulated crypto exchange licence, demonstrating its commitment to providing a secure and compliant platform for investors.</p>\n<p>With the licence application underway, Huobi HK has rolled out its spot trading services to both retail and institutional clients throughout the region. This move is important for crypto enthusiasts seeking a reliable and trustworthy platform to engage in seamless transactions.</p>\n<p>As part of their dedication to transparency and regulatory compliance, Huobi HK revealed that they will collaborate closely with auditors to ensure the highest standards of accountability, striving to meet the rigorous requirements set forth by the Hong Kong Securities and Futures Commission (SFC).</p>\n<p>The introduction of a crypto licensing regime by Hong Kong reflects a desire to protect retail investors while fostering an environment conducive to innovation. According to an article on The Block, notable firms like BTSE, JPEX, and OKX have also expressed their intent to pursue a licence, illustrating the industry's recognition of Hong Kong as a leading hub for cryptocurrency.</p>\n<p>Operating seamlessly through the main Huobi website, Huobi HK offers a comprehensive selection of cryptocurrencies, including popular options like bitcoin and ether.&nbsp;</p>\n<p>Huobi has firmly established its presence in the market, with an impressive trading volume of $12.7 billion so far this month. This achievement speaks volumes about the trust placed in Huobi by traders worldwide, as the crypto exchange continues to deliver innovative solutions and expands its influence within the crypto landscape.</p>\n<p>As the journey continues, Huobi says that it remains committed to fostering collaboration with regulatory authorities in Hong Kong, and the development of a vibrant web3 hub could solidify Hong Kong's position as a pioneering force in the world of cryptocurrencies.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T12:49:53.000Z",
    "title": "The rise of BRICS and why it’s attracting more countries",
    "url": "https://www.cryptopolitan.com/rise-of-brics-why-attracting-more-countries/",
    "description": "The ascendency of BRICS, an acronym for the emerging economies of Brazil, Russia, India, China, and South Africa, has captured global attention. A concept once borne out of an investment bank&#8217;s observation has grown into a formidable alliance, leading a new direction for the world economy. This development has attracted interest from various nations, marking ... <a title=\"The rise of BRICS and why it&#8217;s attracting more countries\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rise-of-brics-why-attracting-more-countries/\" aria-label=\"More on The rise of BRICS and why it&#8217;s attracting more countries\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-29T12:55:40.000Z",
    "title": "Injective releases Avalon upgrade, INJ prices rally 14%",
    "url": "https://crypto.news/injective-releases-avalon-upgrade-inj-prices-rally-14/",
    "description": "Injective protocol, the decentralized derivatives trading exchange, has activated the Avalon upgrade on the mainnet"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-29T13:00:31.000Z",
    "title": "AAG Launches TomoOne: An NFT-Based Game to Educate and Entertain MetaOne® Users",
    "url": "https://www.crypto-news-flash.com/aag-launches-tomoone-an-nft-based-game-to-educate-and-entertain-metaone-users/?utm_source=rss&utm_medium=rss&utm_campaign=aag-launches-tomoone-an-nft-based-game-to-educate-and-entertain-metaone-users",
    "description": "<p>Singapore, Singapore, May 29th, 2023, Chainwire AAG is pleased to announce the launch of TomoOne, an innovative NFT-based game developed on Saakuru’s gas-fee free blockchain with the aim of providing educational value and interactive engagement for MetaOne® users in the realm of Web3. Early adopters of MetaOne® will be able to mint the free Tomo [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/aag-launches-tomoone-an-nft-based-game-to-educate-and-entertain-metaone-users/\">AAG Launches TomoOne: An NFT-Based Game to Educate and Entertain MetaOne® Users</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-29T12:55:10.000Z",
    "title": "Nasdaq Applauds Ripple-Metaco Acquisition, Fuels Speculation on Future IPO Plans ",
    "url": "https://www.crypto-news-flash.com/nasdaq-applauds-ripple-metaco-acquisition-fuels-speculation-on-future-ipo-plans/?utm_source=rss&utm_medium=rss&utm_campaign=nasdaq-applauds-ripple-metaco-acquisition-fuels-speculation-on-future-ipo-plans",
    "description": "<p>Ripple&#8217;s recent acquisition of Metaco has been applauded by NASDAQ. This reportedly hints at a possible IPO in the near future. Earlier this month, payment company Ripple Labs announced a $250 million acquisition of Switzerland-based crypto custody provider Metaco. This means Ripple is the sole shareholder of Metaco and would expand its offering to include [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/nasdaq-applauds-ripple-metaco-acquisition-fuels-speculation-on-future-ipo-plans/\">Nasdaq Applauds Ripple-Metaco Acquisition, Fuels Speculation on Future IPO Plans </a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-29T12:41:43.000Z",
    "title": "Breaking Ground: IOTA 2.0 Node Software Progresses, Unveiling May’s Technical Advances",
    "url": "https://www.crypto-news-flash.com/breaking-ground-iota-2-0-node-software-progresses-unveiling-mays-technical-advances/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-ground-iota-2-0-node-software-progresses-unveiling-mays-technical-advances",
    "description": "<p>IOTA presents its technical progress in its first monthly report. The team is currently working on the implementation of the Mempool.  The IOTA (MIOTA) team has released its first monthly update on the ongoing IOTA 2.0 node software. The report explains the cancellation of the Minimum Viable Product (MVP) released in January for the GoShimmer [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/breaking-ground-iota-2-0-node-software-progresses-unveiling-mays-technical-advances/\">Breaking Ground: IOTA 2.0 Node Software Progresses, Unveiling May&#8217;s Technical Advances</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-29T13:00:33.000Z",
    "title": "The Sandbox Price Prediction 2023-2030: Will SAND Price Hit $1.5 Soon?",
    "url": "https://coinedition.com/the-sandbox-sand-price-prediction/",
    "description": "<img width=\"150\" height=\"150\" src=\"https://coinedition.com/wp-content/uploads/2022/09/The-Sandbox-SAND-Price-Prediction-150x150.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"The-Sandbox-(SAND)-Price-Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" /><p>Bullish SAND price prediction ranges from $0.9864 to $1.0645. SAND price might also reach $1.5 this 2023. SAND’s bearish market price prediction for 2023 is $0.4434. Aside from Bitcoin (BTC) and Ethereum (ETH), there are other digital currencies worth considering for people looking to diversify their portfolios and get experience with new cryptocurrencies, The Sandbox [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/the-sandbox-sand-price-prediction/\">The Sandbox Price Prediction 2023-2030: Will SAND Price Hit $1.5 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-29T13:00:00.000Z",
    "title": "US Omits 30% Crypto Tax in New Debt Ceiling Bill; Crypto Twitter Celebrates",
    "url": "https://coinedition.com/us-omits-30-crypto-tax-in-new-debt-ceiling-bill-crypto-twitter-celebrates/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/one-of-the-victories-is-blocking-proposed-taxes-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/one-of-the-victories-is-blocking-proposed-taxes-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/one-of-the-victories-is-blocking-proposed-taxes-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/one-of-the-victories-is-blocking-proposed-taxes-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/one-of-the-victories-is-blocking-proposed-taxes-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/one-of-the-victories-is-blocking-proposed-taxes-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/one-of-the-victories-is-blocking-proposed-taxes.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a major victory for crypto miners in the United States, the Biden administration has decided against including the controversial Digital Asset Mining Energy (DAME) excise tax in its latest debt ceiling bill. This comes as good news for crypto mining firms as well as the broader crypto industry operating in the U.S. U.S. Congressman [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/us-omits-30-crypto-tax-in-new-debt-ceiling-bill-crypto-twitter-celebrates/\">US Omits 30% Crypto Tax in New Debt Ceiling Bill; Crypto Twitter Celebrates</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-29T12:40:38.000Z",
    "title": "BitMEX’s Former CEO Predicts Bitcoin’s Bullish Period in 2024-2025",
    "url": "https://coinedition.com/bitmexs-former-ceo-predicts-bitcoins-bullish-period-in-2024-2025/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/A-Debt-Jubilee-to-Save-the-Economy-with-Arthur-Hayes-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/A-Debt-Jubilee-to-Save-the-Economy-with-Arthur-Hayes-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/A-Debt-Jubilee-to-Save-the-Economy-with-Arthur-Hayes-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/A-Debt-Jubilee-to-Save-the-Economy-with-Arthur-Hayes-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/A-Debt-Jubilee-to-Save-the-Economy-with-Arthur-Hayes-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/A-Debt-Jubilee-to-Save-the-Economy-with-Arthur-Hayes-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/A-Debt-Jubilee-to-Save-the-Economy-with-Arthur-Hayes.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The American entrepreneur and former CEO of the crypto exchange BitMEX Arthur Hayes predicted the bullish tendency of the largest cryptocurrency by market cap Bitcoin (BTC) in the following years, though he is not bullish about 2023. In a podcast on the YouTube channel “What Bitcoin Did,” the entrepreneur commented that the high expectations for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitmexs-former-ceo-predicts-bitcoins-bullish-period-in-2024-2025/\">BitMEX’s Former CEO Predicts Bitcoin’s Bullish Period in 2024-2025</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-05-29T12:54:21.000Z",
    "title": "Bitfinex Alpha | US Economy Confounds Policy Makers, and Crypto Options Market Prices in Increased Volatility",
    "url": "https://blog.bitfinex.com/bitfinex-alpha/bitfinex-alpha-us-economy-confounds-policy-makers-and-crypto-options-market-prices-in-increased-volatility/",
    "description": "<p>The United States finds itself in an extraordinary economic environment, where recession indicators continue to flash red, interest rates are at their highest point in 16 years, inflation remains a persistent concern, yet the services sector of the economy and the job market continue to...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/bitfinex-alpha/bitfinex-alpha-us-economy-confounds-policy-makers-and-crypto-options-market-prices-in-increased-volatility/\">Bitfinex Alpha | US Economy Confounds Policy Makers, and Crypto Options Market Prices in Increased Volatility</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]