[
  {
    "source": "Cointelegraph",
    "date": "2023-12-09T21:17:53.000Z",
    "title": " DOJ unveils extensive monitorship over Binance operations  ",
    "url": "https://cointelegraph.com/news/doj-unveils-extensive-monitorship-over-binance-operations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMmMzZDc0MGUtN2M1Yi00Y2E3LTlhNDgtZmIxODA1N2YzOGI0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Binance’s new compliance obligations include cooperation to grant U.S. authorities access to all documents, records and resources upon request. </p>\n                    <p><p>Binance compliance commitments with the United States Department of Justice (DOJ) were <a href=\"https://www.courtlistener.com/docket/67474542/v-securities-and-exchange-commission/?page=2\" target=\"_blank\" rel=\"noopener nofollow\">unsealed</a> on Dec. 8, revealing a significant government oversight of the crypto exchange operation and business activities.</p><p>In an analysis shared on X (formerly Twitter), John Reed Stark, a former Securities and Exchange Commission (SEC) official, <a href=\"https://twitter.com/JohnReedStark/status/1733497674110767550\" target=\"_blank\" rel=\"noopener nofollow\">classified</a> the “exhaustive list” of Binance’s new compliance commitments as a “consulting firm’s wish list” that will likely shut down the platform.</p><p>Binance’s new obligations are described in an 11-page document and include cooperation to grant authorities access to documents, records and resources at their request, including access to information related to its “former employees, agents, intermediaries, consultants, representatives, distributors, licenses, contractors, suppliers, and joint venture partners,\" noted Stark. </p><p><a href=\"https://cointelegraph.com/news/doj-unveils-extensive-monitorship-over-binance-operations\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-12-09T21:39:02.000Z",
    "title": "CBDC: Palau satisfied with its Ripple-powered CBDC pilot program ",
    "url": "https://crypto.news/cbdc-palau-satisfied-with-its-ripple-powered-cbdc-pilot-program/",
    "description": "Palau is touting its pilot of a Central Bank Digital Currency (CBDC) based on Ripple technology. Despite minor challenges, the feedback from the pilot conducted on Ripple's CBDC platform has been positive, the nation claims."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-09T21:10:26.000Z",
    "title": "Curvance defi ‘everything app’ goes live following a $3.6m seed round",
    "url": "https://crypto.news/curvance-defi-everything-app-goes-live-3-6-million/",
    "description": "Positioned as the \"everything app\" for decentralized finance, lending, and borrowing, Curvance seeks to tackle fragmentation challenges across various chains and protocols."
  }
]