[
  {
    "source": "Cointelegraph",
    "date": "2023-09-13T01:58:48.000Z",
    "title": "SBF’s lawyers want to quiz jurors on crypto, altruism and ADHD",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-bids-to-ask-jurors-crypto-altruism-stance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/11a73857-33bd-45e6-98b0-b7f01d94d07d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>U.S. prosecutors, meanwhile, want to ask prospective jurors their beliefs on how cryptocurrency should be regulated.</p>\n                    <p><p>Potential jurors in the upcoming criminal trial of former FTX CEO Sam Bankman-Fried could be asked their thoughts on crypto, effective altruism and attention-deficit disorder as his lawyers want to weed out those they consider unsuitable.</p><p>In court filings on Sep.11, Bankman-Fried’s <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590940/gov.uscourts.nysd.590940.273.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">lawyers</a> and United States prosecutors separately <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590940/gov.uscourts.nysd.590940.274.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> their lists of proposed questions they wish to ask prospective jurors in the trial slated for Oct. 3.</p><p>Bankman-Fried wants to know if prospective jurors have invested in cryptocurrency, and if so, if they lost money or otherwise have a negative opinion on the industry.</p><p>In another question, the FTX co-founder is interested to know whether a juror would attribute a crypto firm’s failure to its owners, and if so, why.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/fbc26526-417a-4ad0-a6ea-c269e3e3d5aa.png\"  /><figcaption style=\"text-align: center;\"><em>Cryptocurrency-related questions proposed by Bankman-Fried’s lawyers to prospective jurors. Source: CourtListener</em></figcaption></figure><p>Bankman-Fried also wants prospective jurors' thoughts on “effective altruism” — a charitable philosophical movement which Bankman-Fried <a href=\"https://cointelegraph.com/magazine/sam-bankman-fried-the-crypto-whale-who-wants-to-give-billions-away/\">built his reputation on</a>.</p><p>Other questions concern if jurors think it’s “wrong” to donate large sums of <a href=\"https://cointelegraph.com/news/ftx-philanthropic-donations-have-created-a-complex-dilemma-for-recipients\">money to political candidates</a> and lobbyists to further their own interests along with detailing any personal or professional experience with an ADHD-medicated person.</p><p>As part of standard procedure, Bankman-Fried intends to ask if prospective jurors have read about him, have formed an opinion on his guilt or innocence or if they’ve expressed an opinion about Bankman-Fried, FTX or Alameda Research.</p><p>U.S. prosecutors wish to ask prospective jurors on their familiarity with FTX and its affiliates, whether they or a friend or family member have invested or worked in the crypto space and what role they believe the U.S. government should play in regulating the industry.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-jail-meds-peanut-butter-prison\"><strong><em>Sam Bankman-Fried is low on meds, living on $3 peanut butter in prison</em></strong></a></p><p>Prosecutors also want to ask whether jurors have ever lost money from an investment due to fraudulent conduct.</p><p>On Sept. 12, U.S. District Court Judge Lewis Kaplan <a href=\"https://cointelegraph.com/news/bankman-fried-request-temporary-release-denied-amid-upcoming-trial\">denied Bankman-Fried’s request for temporary release</a> ahead of his Oct. 3 trial, ruling that a poor internet connection inside the prison wasn’t a sufficient ground to grant his release.</p><p>Bankman-Fried <a href=\"https://cointelegraph.com/news/ftx-s-sam-bankman-fried-pleads-not-guilty-to-fraud-charges-report\">pleaded not guilty</a> to all seven fraud-related charges regarding his involvement in FTX’s collapse in November. He faces a separate criminal trial on additional charges in March next year.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-13T02:00:22.000Z",
    "title": "50 US Lawmakers Reintroduce ‘CBDC Anti-Surveillance State Act’ to Protect ‘the American Way of Life’",
    "url": "https://news.bitcoin.com/50-us-lawmakers-reintroduce-cbdc-anti-surveillance-state-act-to-protect-the-american-way-of-life/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/tom-emmer-cbdc-anti-surveillance-act-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"50 US Lawmakers Introduce &#039;CBDC Anti-Surveillance State Act&#039; to Prevent Biden Administration From Compromising Americans&#039; Right to Privacy\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/tom-emmer-cbdc-anti-surveillance-act-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/tom-emmer-cbdc-anti-surveillance-act-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/tom-emmer-cbdc-anti-surveillance-act-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/tom-emmer-cbdc-anti-surveillance-act-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/tom-emmer-cbdc-anti-surveillance-act-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/tom-emmer-cbdc-anti-surveillance-act-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/tom-emmer-cbdc-anti-surveillance-act.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Fifty U.S. lawmakers have reintroduced the CBDC Anti-Surveillance State Act to prohibit the Federal Reserve from issuing a retail central bank digital currency “while protecting innovation and any future development of true digital cash.” Congressman Tom Emmer stressed: “President Biden is willing to compromise the American people’s right to financial privacy for a surveillance-style CBDC. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-13T02:01:58.000Z",
    "title": "China says it wants to be better friends with Russia",
    "url": "https://www.cryptopolitan.com/china-wants-to-be-better-friends-with-russia/",
    "description": "In a world fraught with geopolitical shifts, China makes a resounding statement, setting its sights on fortifying its bond with Russia. While most nations follow the herd, Beijing marches to the beat of its own drum, willing to intertwine its fate with Moscow even further. The repercussions of such a move on the global stage ... <a title=\"China says it wants to be better friends with Russia\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-wants-to-be-better-friends-with-russia/\" aria-label=\"More on China says it wants to be better friends with Russia\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-13T01:47:31.000Z",
    "title": "Binance.US CEO Brian Shroder resigns — The full story",
    "url": "https://www.cryptopolitan.com/binance-us-ceo-shroder-resign-the-full-story/",
    "description": "The storm clouds hanging over Binance.US, the renowned American subsidiary of the global crypto behemoth, have darkened. The company has recently culled about a third of its workforce, equating to a staggering 100 jobs. Adding to this grim tally is the surprising exit of its President and CEO, Brian Shroder. Now, let&#8217;s pull back the ... <a title=\"Binance.US CEO Brian Shroder resigns — The full story\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-us-ceo-shroder-resign-the-full-story/\" aria-label=\"More on Binance.US CEO Brian Shroder resigns — The full story\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-13T01:40:34.000Z",
    "title": "ECB’s conundrum: To raise rates or not to raise rates?",
    "url": "https://www.cryptopolitan.com/ecbs-to-raise-rates-or-not-to-raise-rates/",
    "description": "The corridors of the European Central Bank (ECB) have been echoing with one critical debate recently: should they hike the interest rates yet again? It&#8217;s a double-edged sword, and the pressure is palpable. A Fractured Consensus Last year, the consensus was evident. The ECB, aiming to stifle inflation, had incrementally hiked rates by 4.25 percentage ... <a title=\"ECB&#8217;s conundrum: To raise rates or not to raise rates?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ecbs-to-raise-rates-or-not-to-raise-rates/\" aria-label=\"More on ECB&#8217;s conundrum: To raise rates or not to raise rates?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-13T02:00:33.000Z",
    "title": "Curve (CRV) Trading Volume Plunge 97% In 2 Months",
    "url": "https://www.newsbtc.com/news/defi/curve-exchange-trading-volumes-plunge-97-in-2-months/",
    "description": "Trading volumes associated with CRV, the governance token of Curve, a stablecoin decentralized exchange (DEX), is down 97% barely two months after it was hacked in late July 2023. According to Kaiko, CRV&#8217;s trading volume in centralized exchanges, especially Binance, where the token is actively traded, fell from nearly $300 million in late July to $7 million as of September 12.  Trackers show that CRV is available for trading in multiple centralized and decentralized exchanges, including Binance, Uniswap, and Curve. However, considering the popularity and liquidity standing of Binance, most CRV trading was concentrated on the world&#8217;s popular crypto exchange. To illustrate, Binance&#8217;s share of CRV trading is about 20% when writing, while Bitbox is next with a dominance of around 7%.  Curve&#8217;s TVL, Price, And Trading Volumes Collapse In crypto, a drop in trading volume often indicates waning interest in a digital asset or general caution practiced by investors. With falling volume, the asset&#8217;s liquidity takes a hit as traders or investors opt out, even liquidating the coin as they choose stability and refuge. Sometimes, they can adopt a wait-and-see approach, evaluating how the token will react in light of changing market conditions.  Related Reading: Stake’s Hacker Moves $328,000 Worth Of Crypto From Stolen Funds According to DeFiLlama, Curve has a total value locked (TVL) of approximately $2.17 billion, down from $3.25 billion when the protocol was hacked. The decline in TVL and trading volumes comes amid the general lull in the decentralized finance (DeFi) scene. The drop in CRV valuation and trading volumes was worsened by the July exploit, which saw the protocol lose over $50 million worth of assets. Although Curve recovered most of those funds, the effect of the exploit called into question the general state of security. The Hack And Erogov&#8217;s CRV Disposal In the July hack, malicious actors exploited various Curve stablecoin pools using older versions of Vyper, a programming language used to create smart contracts on Ethereum. All Curve&#8217;s pools are automated, and this feature allowed hackers to drain multiple pools through a re-entrancy attack.  CRV reacted to this hack by dropping, falling sharply on July 30 from around $0.74 to $0.48. It has since exceeded halved, crashing to $0.40, a new 2023 low.  During this time, Curve&#8217;s CEO, Michael Egorov, had to sell CRV holdings he had used to back his loans via over-the-counter (OTC) to entities and individuals such as Justin Sun when prices started falling. Egorov had taken out loans on Aave and Frax Finance secured by CRV.  Related Reading: BREAKING: Crypto Exchange CoinEX Reportedly Hit By Massive Hack, Losses Exceed $27 Million Feature image from Canva, chart from TradingView"
  }
]