[
  {
    "source": "CoinDesk",
    "date": "2024-01-16T15:01:10.000Z",
    "title": "Chainlink Teams Up With Circle to Allow Cross-Chain Stablecoin Transfers",
    "url": "https://www.coindesk.com/tech/2024/01/16/chainlink-teams-up-with-circle-to-allow-cross-chain-stablecoin-transfers/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The integration allows developers to build cross-chain use cases via Chainlink's CCIP that involve multichain transfers of Circle's USDC stablecoin."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-16T15:00:20.000Z",
    "title": "Another pro-crypto presidential candidate suspends campaign for office",
    "url": "https://cryptoslate.com/another-pro-crypto-presidential-candidate-suspends-campaign-for-office/",
    "description": "<p>Pro-crypto presidential hopeful Vivek Ramaswamy has suspended his campaign for office on Jan. 16. In a post on the social media platform X (formerly Twitter), Ramaswamy revealed he was suspending his campaign to support former President Donald Trump&#8217;s bid to return to the Oval Office, saying: &#8221; I am suspending my campaign and endorsing Donald [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/another-pro-crypto-presidential-candidate-suspends-campaign-for-office/\">Another pro-crypto presidential candidate suspends campaign for office</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-16T14:40:57.000Z",
    "title": "These Altcoins Can Outshine Bitcoin In 2024",
    "url": "https://cryptodaily.co.uk/2024/01/these-altcoins-can-outshine-bitcoin-in-2024-1",
    "description": "Dive into the latest trends in the cryptocurrency market with insightful analyses of Solana's surging DEX activity, Ripple's legal milestones, and VeChain's U.S. patent triumph. Explore potential price movements, key support and resistance levels, and the delicate balance between optimism and caution in this comprehensive overview. Stay informed on the dynamic landscape of Solana, Ripple, and VeChain, and make informed decisions in the ever-evolving world of digital assets."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-16T15:09:05.000Z",
    "title": "Anti-Defamation League (ADL) report unmasks how cryptocurrencies are secretly funding hate groups",
    "url": "https://www.cryptopolitan.com/ad-crypto-role-funding-supremacist-groups/",
    "description": "In a recent report by the Anti-Defamation League (ADL), a concerning trend has emerged within the realms of cryptocurrency and extremist funding. The ADL, a renowned New York-based organization dedicated to combating antisemitism and extremism, has highlighted how certain white supremacist groups in the U.S. are utilizing cryptocurrencies like Bitcoin for funding. This revelation comes [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-16T14:41:45.000Z",
    "title": "Klaytn and LINE’s Finschia Eye Merger: A Leap Towards Asia’s Largest Web3 Ecosystem",
    "url": "https://www.cryptopolitan.com/klaytn-lines-finschia-eye-merger-asia-web3/",
    "description": "Klaytn and Finschia have announced a proposal for a merger. The ambitious plan, backed by two technological powerhouses in South Korea and Japan, respectively, aims to integrate two of the region&#8217;s most prominent blockchain networks. The resulting entity is poised to establish itself as a behemoth in the burgeoning web3 ecosystem. A union of Klaytn [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-16T15:00:23.000Z",
    "title": "XRP Investors Become Fearful: Time To Buy?",
    "url": "https://www.newsbtc.com/xrp-news/xrp-investors-become-fearful-time-to-buy/",
    "description": "Data shows the sentiment around XRP has taken a plunge following the failed attempt at a Bitfinex attack using the &#8220;partial payments exploit.&#8221; XRP Weighted Sentiment Has Plunged To Negative Levels Recently As explained by the on-chain analytics firm Santiment in a new post on X, the sentiment around XRP has turned negative. The indicator of interest here is the &#8220;Weighted Sentiment,&#8221; which itself is based on two other metrics: the &#8220;Sentiment Balance&#8221; and &#8220;Social Volume.&#8221; Related Reading: Dogecoin To See 24% Rally To $0.100 If This Holds: Analyst The former of these basically keeps track of the sentiment currently present among social media users around any topic. The indicator calculates this score by going through social media posts and using a machine-learning model to separate between negative and positive sentiments. The other relevant metric here, the Social Volume, measures the amount of discussion related to any given topic that&#8217;s happening on the major social media platforms right now. The indicator measures this by counting the total number of unique posts or threads making at least one mention of the topic. Now, what the &#8220;Weighted Sentiment&#8221; does is that it takes the Sentiment Balance and weighs it against the Social Volume. What this means is that the Weighted Sentiment&#8217;s value would only register a spike when not only is the sentiment leaning towards one side, but the sample size of these posts is also large. The below chart shows the trend in this indicator for XRP over the last few months: Looks like the value of the metric has taken a plunge in recent days &#124; Source: Santiment on X When the Weighted Sentiment has a highly positive value, it means that there is a high amount of positive discussion happening related to the asset. From the graph, it&#8217;s visible that XRP saw such a bullish sentiment earlier in the month when its price made a recovery attempt. Since then, however, the indicator&#8217;s value has plummeted for the cryptocurrency and is now floating deep inside the negative zone. Naturally, this implies that social media users are now bearish about the coin. Santiment has noted that this sentiment, which is the most negative in years, has come for XRP as a failed Bitfinex hack attempt has taken place. During this attack, someone tried to make use of the &#8220;partial payments&#8221; system of the cryptocurrency to trick the exchange into thinking the transfer amount was greater than it actually was (equal to half the asset&#8217;s circulating supply, in fact). Bitfinex, however, had the correct configuration in place to read transactions of this type, so the platform never fell for the exploit. Even though nothing ended up happening, the initial confusion naturally worsened the sentiment around the asset. Related Reading: How Low Can Bitcoin Go? CryptoQuant Head Reveals Target This negative sentiment, though, can actually be a boon in disguise for XRP, as historically, the price has tended to move against the expectations of the majority. This might also be the reason that the recovery attempt earlier in the year failed, as traders got too hyped too quickly. Since the sentiment is completely opposite now, perhaps a price surge might have an easier time growing up. XRP Price Since the asset&#8217;s failed recovery attempt, XRP has been moving mostly sideways, as it currently trades around the $0.576 level. The price of the coin seems to have been stuck in consolidation recently &#124; Source: XRPUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-16T15:05:00.000Z",
    "title": "Polygon’s MATIC Token Controversy: What’s Behind the Suspicious Flows?",
    "url": "https://coinedition.com/polygons-matic-token-controversy-whats-behind-the-suspicious-flows/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/MATIC-Technical-Indicators.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon&#039;s MATIC Token Controversy: What&#039;s Behind the Suspicious Flows?\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/MATIC-Technical-Indicators.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/MATIC-Technical-Indicators-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/MATIC-Technical-Indicators-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Allocation disparities raise questions about Polygon&#8217;s $250 million Hermez Network acquisition. Collaboration between Polygon and Binance in token movements raises a billion-dollar concern for investors. Suspicious token flows and transparency concerns plague Polygon&#8217;s MATIC token and Hermez Network acquisition. The MATIC token from Polygon has attracted significant attention lately due to mounting apprehensions regarding the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/polygons-matic-token-controversy-whats-behind-the-suspicious-flows/\">Polygon&#8217;s MATIC Token Controversy: What&#8217;s Behind the Suspicious Flows?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]