[
  {
    "source": "Cointelegraph",
    "date": "2023-07-13T13:43:40.000Z",
    "title": "Exec shares process of setting up a business in Switzerland with Bitcoin",
    "url": "https://cointelegraph.com/news/bitcoin-swiss-exec-shares-process-of-setting-up-a-business-in-switzerland-with-bitcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/2c4813b9-3089-4723-8e4e-28f045b4452e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Pietro Poretti, the city of Lugano’s director of the economic development division, said that their goal is to allow people to live in the city using only Bitcoin.  </p>\n                    <p><p>While Switzerland has been popular among the wealthy for its prowess in banking, the country has also been slowly welcoming those who mainly want to use Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) as an alternative form of money. </p><p>Cointelegraph reporter Joseph Hall spoke with Pietro Poretti, the director of the economic development division of the city of Lugano. They discussed various topics including how to set up a company using Bitcoin in the city of Lugano, the state of crypto adoption in the city, and the possibility of getting a residence permit in the country through the use of BTC. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/ea3b148f-9c21-4411-89e0-bdc735bc32a6.png\"  /><figcaption style=\"text-align: center;\">Pietro Poretti sits down with Cointelegraph's Joseph Hall. Source: Cointelegraph </figcaption></figure><p>According to Poretti, Bitcoin can now be used as capital to set up companies in Lugano. The executive said that businesses can set up shop if they have a minimum of 100,000 Swiss Franc (CHF), about $116,000 USD in Bitcoin, to register a company. Firms would initially need to deposit the amount in Bitcoin to go through the process of having their companies established in the city. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/btc-prague-uncle-rockstar-bitcoin-interview\"><strong><em>Developer Uncle Rockstar shares the key to Bitcoin adoption: BTC Prague 2023</em></strong></a></p><p>The executive noted that companies are already registering their businesses in Bitcoin. According to the executive, there’s also been an increase in the shops, restaurants and service providers where people can purchase goods and services using Bitcoin throughout the city. He explained: </p><blockquote>“Ideally, what we would like to achieve is to offer an opportunity to whoever lives here or whoever visits Lugano to live without having to use fiat currency, without having to use Swiss francs.”</blockquote><p>Apart from purchasing goods and services, the executive also stressed that people residing in the city are able to pay taxes and contributions in BTC. “The city is open to accept Bitcoin for taxes and for a number of other fees and contributions that Lugano-based residents have to make,” he added. </p><p>When asked about the possibility of getting a residence permit to live in the city using Bitcoin, the executive noted that this matter is dealt with at the cantonal level in Switzerland and is not within the municipality’s jurisdiction. However, Poretti remains positive that with the precedent set by Lugano, other levels might soon be more open to Bitcoin. </p><p>“What we foresee going forward is, thanks to the example that Lugano is setting, that there might be also other levels, in the Swiss system who might be interested in being more open to Bitcoin,” Poretti said. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/bitcoin-swiss-exec-shares-process-of-setting-up-a-business-in-switzerland-with-bitcoin&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\"><strong><em>Bitcoin is on a collision course with ‘Net Zero’ promises</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-13T13:41:06.000Z",
    "title": "USB keystroke injectors still a threat to crypto users",
    "url": "https://cointelegraph.com/news/can-usb-keystroke-injectors-steal-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/7bf2a797-1f86-4bb6-bd26-db25d2cbaf1f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>USB keystroke injection devices like the Diabolic Drive still pose a threat to unsuspecting users by installing malware to take over systems.</p>\n                    <p><p>The Diabolic Drive’s name sounds as ominous as its potential payload. The recently developed USB wireless keystroke injection tool is intended to stress test networks, but could it potentially be used as a means to steal cryptocurrency from unwitting users?</p><p>The new gadget is set to be used by cybersecurity experts to test networks and business infrastructure against threats. As <a href=\"https://www.cnx-software.com/2023/07/06/diabolic-drive-penetration-testing-usb-key-with-64gb-storage-esp8266-and-atmega32u4-microcontrollers/\" target=\"_blank\" rel=\"noopener nofollow\">recent</a> reviews <a href=\"https://circuitdigest.com/news/diabolic-drive-the-ingenious-usb-tool-blending-deception-and-functionality\" target=\"_blank\" rel=\"noopener nofollow\">highlight</a>, the 64GB drive is Wi-Fi enabled once plugged into a system, allowing a user to access the connected device remotely.</p><p>According to a hardware review by <a href=\"https://www.geeky-gadgets.com/diabolic-drive-14-06-2023/\" target=\"_blank\" rel=\"noopener nofollow\">Geeky-gadgets</a>, the Diabolic Drive can fire a payload of a hypothetical malicious script remotely and can even be pre-programmed to execute commands as soon as it is plugged into a device. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">These devices are impressive and scary. Amazing what can be built so easily and dangerous for those who are careless and don’t understand them. | Diabolic Drive is a penetration testing USB key with 64GB storage, ESP8266 and ATmega32U4 microcontrollers <a href=\"https://t.co/dBI6TTFhjq\">https://t.co/dBI6TTFhjq</a></p>&mdash; Scott C. Lemon (@humancell) <a href=\"https://twitter.com/humancell/status/1677107700897837060?ref_src=twsrc%5Etfw\">July 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Consider the scenario. You attend your favourite cryptocurrency conference and receive a nifty new USB as a gift from promoters on the floor. Plugging the device in after you open your laptop, the device has already begun injecting malware onto the system that will allow an attacker to steal your cryptocurrency holdings from your go-to wallet browser extension.</p><p>It’s a nightmare hypothetical scenario that still warrants some exploring of the “what if’s”. Cointelegraph reached out to a handful of cybersecurity firms to unpack the threat of a USB injection tool and the potential for attackers to steal your coins.</p><p>Zeki Turedi, CrowdStrike’s field CTO for Europe, said that USB keystroke and wireless keyboard/HID devices have been part of a penetration tester’s arsenal for many years:</p><blockquote>“They simply allow, once the device has been plugged in, to run commands wirelessly or automatically into a victim’s machine. These devices themselves are not exactly malicious - it is the keystrokes that come after this that potentially could be.”</blockquote><p>Turedi said that a device could then download malicious software giving an attacker control of the system. From there, the possibilities are endless, including the ability to “steal a victim's crypto funds”.</p><p>A member of CertiK’s security team also told Cointelegraph that the Diabolic Drive could be used to steal cryptocurrency, while conceding that most devices would require physical access as well. </p><p><a href=\"https://cointelegraph.com/news/how-the-irs-seized-10b-worth-of-crypto-using-blockchain-analytics\"><strong><em>Related: How the IRS seized $10B worth of crypto using blockchain analytics</em></strong></a></p><p>CertiK also noted that while hardware-based attacks were less prevalent in general, they were more likely to target individuals or entities with significant cryptocurrency holdings, due to their high value:</p><blockquote>“The physical access these attacks require makes large crypto investors especially attractive targets for criminals.”</blockquote><p>Turedi also noted that hardware-based attacks are still common for the cybersecurity industry to see and are most prevalent in supply chain contexts:</p><blockquote>“A supply chain attack is a type of cyber event that targets a trusted third-party vendor who offers services or software vital to the supply chain. Hardware supply chain attacks compromise physical components for the same purpose.”</blockquote><p>As for the simplest solution to avoid falling prey to a malicious, incognito USB compromising your system? CrowdStrike recommend using Next Generation Antivirus (NGAV) software that is able to detect and control what type of USB’s can interact with a system:</p><blockquote>“Most of the keystroke tools appear to be a standard keyboard - this is why they are so difficult to block and why it is vital security teams deploy NGAV software. </blockquote><p>CertiK takes it back to basics. Update your antivirus and operating systems and avoid plugging in USB devices or cables that you don’t fully trust or received unexpectedly:</p><blockquote>“This applies even if the USB device seems to be from a reliable source or looks innocuous.”</blockquote><p>More secure systems and networks might require “air-gapping”, where a user keeps a computer or device disconnected from the internet and local networks.</p><p>As Cointelegraph recently <a href=\"https://cointelegraph.com/news/rug-pull-losses-beat-defi-exploits-in-may-beosin\">explored</a>, rug pulls still remain a lucrative means for scam artists to prey on unsuspecting cryptocurrency users. Over $45 million was stolen in May 2023 through rug pulls and exit scams. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/can-usb-keystroke-injectors-steal-crypto&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em><u>Magazine: <a href=\"https://cointelegraph.com/magazine/3-4-billion-bitcoin-popcorn-tin-silk-road-hacker/\">$3.4B of Bitcoin in a popcorn tin: The Silk Road hacker’s story</a></u></em></strong></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-13T13:49:09.000Z",
    "title": "Zero-Knowledge Proofs Go Open Source: Not Only Blockchain Apps Can Benefit",
    "url": "https://cryptobriefing.com/zero-knowledge-proofs-go-open-source-not-only-blockchain-apps-can-benefit/?utm_source=feed&utm_medium=rss",
    "description": "ZKM, a leading provider of open-source, chain-agnostic zero-knowledge proof (ZKP) technology, has officially transitioned from its incubation phase within the MetisDAO Foundation: Why do this? Blockchain has huge potential. But..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-13T14:04:34.000Z",
    "title": "Powering the Next Generation of Gaming: XBorg Sells Out $2 Million Seed Round Community Allocation",
    "url": "https://cryptodaily.co.uk/2023/07/powering-the-next-generation-of-gaming-xborg-sells-out-2-million-seed-round-community-allocation",
    "description": "<p>Dubai, United Arab Emirates, July 13th, 2023, Chainwire</p><p class=\"ql-align-justify\">XBorg, the Web3 company developing a collaborative credential infrastructure that allows players to create their digital identity and enjoy tailored user experiences within enhanced gaming applications, sold out their $2 million seed round community allocation in record time. The funds will facilitate the scaling and adoption efforts of XBorg's infrastructure and applications to reach millions of players and fans worldwide.</p><p class=\"ql-align-justify\">Ahead of the raise, XBorg collected interest from more than 8,300 investors totalling $7M in soft commitments but decided to cap the community allocation at $2 million and maintain the remaining $3 million for leading VCs, closing out the $5 million seed round. The $XBG token, expected to be launched towards the end of 2023, is now sitting at a $50m valuation.&nbsp;</p>XBorg Founder and CEO, Louis Regis reacted: &ldquo;Since day one, we have included our community in the development of XBorg as we believe that the future of gaming will be built by its players. Allocating a large part of our seed round to our community showcases our support for this notion. The widespread enthusiasm of our community in the current market conditions has exceeded all of our expectations and demonstrates their trust in our vision to disrupt the gaming and fan engagement industry.&rdquo;<p class=\"ql-align-justify\">In the coming months, XBorg is launching its first application in partnership with some of the most prominent esports teams in the industry. The current Rocket League world champions, Team BDS, were the first team to be announced, with many more in the pipeline. The XBorg app will enable players and fans to build their digital identity, meaningfully connect with their favourite gaming communities, and collect digital items with unique perks that unlock exclusive experiences. By the end of the year, XBorg aims to become the fastest-growing gaming credential infrastructure via its partnerships with tier-1 esports teams and popular gaming influencers.</p><p class=\"ql-align-justify\">Users can already create an XBorg account and get a taste of what their complete app will be like here. Users are rewarding early supporters of their ecosystem, so they should be sure to be active participants and refer their friends if they want to take advantage of this.</p><p class=\"ql-align-justify\">About XBorg</p><p class=\"ql-align-justify\">XBorg is developing a collaborative credential infrastructure that allows players to create their digital identity and enjoy tailored user experiences within enhanced gaming applications. XBorg is releasing its first application powered by its credential infrastructure, in partnership with the largest esports organisations in the world, to scale the adoption of its technology to millions of players and fans. XBorg is a spin-off of SwissBorg, a crypto wealth management application with over 750,000 users.</p><p class=\"ql-align-justify\">For more information about XBorg, visit their website, follow them on Twitter, or join their community on Discord.</p>ContactGrowth &amp; MarketingConnor KirstenXBorgconnor@xborg.com"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-13T14:00:43.000Z",
    "title": "Polygon $MATIC to become $POL",
    "url": "https://cryptodaily.co.uk/2023/07/polygon-matic-to-become-pol",
    "description": "<p>Polygon, the prominent Ethereum layer 2 scaling solution, is making strides towards a significant upgrade, changing its token from $MATIC to $POL.&nbsp;</p>\n$POL token to have increased functionality\n<p>The team behind Polygon has put forward a proposal that could change the game for its native token, $MATIC. This isn't just a minor tweak; it's part of the grand plan for Polygon 2.0., and if the community gives the green light, $MATIC tokens will transform into Polygon ($POL) tokens.&nbsp;</p>\n<p>But these aren't just any tokens. $POL tokens will have the power to be staked across multiple chains within the Polygon ecosystem. This isn't just about changing the name; it's about boosting the scalability of the ecosystem without putting security on the line. The new $POL token won't be confined to a single protocol. It's designed to be a jack-of-all-trades, operating across all Polygon protocols. That includes Proof of Stake (PoS), zkEVM, and Supernets.&nbsp;</p>\nWhat does this mean for Polygon validators?&nbsp;\n<p>They'll have the ability to secure transactions across different chains, making the ecosystem even more robust. If $MATIC token holders are wondering what this means for them. Well, the transition from $MATIC to $POL is designed to be one easy and smooth transaction. A holder would just need to send their $MATIC tokens to a specific smart contract in order to receive an equivalent number of $POL tokens.&nbsp;</p>\nAn upgrade to enhance Polygon ecosystem\n<p>In addition, in order for everyone to get adjusted to the new $POL token, the Polygon team is thinking of allocating a period of at least four years for token holders to complete the upgrade process, which is probably plenty of time to get used to the new token and its functionalities.&nbsp;</p>\n<p>The proposed upgrade is still to be signed off by the Polygon community, and if they give the thumbs up, the migration to $POL could happen in the near future.&nbsp;</p>\n<p>Polygon&rsquo;s proposed upgrade is an exciting development for the entire ecosystem. Should the upgrade be approved it has the potential to push Polygon further to the forefront of the Ethereum layer 2 race.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-13T14:00:46.000Z",
    "title": "BIS Report Cites ‘Inherent Limitations’ of Cryptocurrencies; Questions Their Role in Global Economy",
    "url": "https://news.bitcoin.com/bis-report-cites-inherent-limitations-of-cryptocurrencies-questions-their-role-in-global-economy/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/bis-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BIS Report Cites &#039;Inherent Limitations&#039; of Cryptocurrencies; Questions Their Role in Global Economy\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/bis-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bis-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bis-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bis-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bis-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bis-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bis.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Bank of International Settlements (BIS) has published a report on cryptocurrencies and explains that the technology has serious “flaws.” BIS researchers insist that permissionless blockchains have “inherent limitations” that lead to network congestion and high fees. BIS Report: ‘Crypto Has So Far Failed to Harness Innovation to the Benefit of Society’ In its latest [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-13T14:04:59.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-13T14:03:06.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-13T14:01:34.000Z",
    "title": "Powering the Next Generation of Gaming: XBorg Sells Out $2 Million Seed Round Community Allocation",
    "url": "https://www.cryptopolitan.com/powering-the-next-generation-of-gaming-xborg-sells-out-2-million-seed-round-community-allocation/",
    "description": "Dubai, United Arab Emirates, July 13th, 2023, Chainwire XBorg, the Web3 company developing a collaborative credential infrastructure that allows players to create their digital identity and enjoy tailored user experiences within enhanced gaming applications, sold out their $2 million seed round community allocation in record time. The funds will facilitate the scaling and adoption efforts ... <a title=\"Powering the Next Generation of Gaming: XBorg Sells Out $2 Million Seed Round Community Allocation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/powering-the-next-generation-of-gaming-xborg-sells-out-2-million-seed-round-community-allocation/\" aria-label=\"More on Powering the Next Generation of Gaming: XBorg Sells Out $2 Million Seed Round Community Allocation\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-13T13:52:00.000Z",
    "title": "Former Celsius CEO arrested in New York, SEC files lawsuit",
    "url": "https://crypto.news/former-celsius-ceo-arrested-in-new-york-sec-files-lawsuit/",
    "description": "Alex Mashinsky, the former CEO of Celsius Network, a bankrupt crypto lender, has been arrested in New York as SEC files lawsuit"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-13T14:00:25.000Z",
    "title": "Bitcoin MVRV At Critical Level: Will A Break Happen?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-mvrv-at-critical-level-will-a-break-happen/",
    "description": "On-chain data shows the Bitcoin &#8220;Market Value to Realized Value&#8221; (MVRV) is at a critical level currently. Will a bullish breakout take place? Bitcoin MVRV Ratio Is Retesting The 1.5 Level Right Now As pointed out by an analyst in a CryptoQuant post, the BTC MVRV ratio has been around a critical level recently. The &#8220;MVRV ratio&#8221; is an indicator that measures the ratio between the market cap of Bitcoin and its realized cap. The &#8220;realized cap&#8221; here refers to a capitalization model for the asset that assumes that the true value of each coin in the circulating supply is not the current spot price, but the price at which the coin was last transferred on the blockchain. This model aims to find a sort of &#8220;real value&#8221; for the coin, so its comparison with the market cap in the MVRV ratio can tell us how the current spot price (that is, the market cap) weighs up against this fair value. When the indicator has a value greater than one, it means that the market cap is more than the realized cap right now. In this situation, the investors are holding more value than they put in, so they become more likely to sell and harvest these profits. Thus, this kind of trend can suggest the asset is becoming overpriced and a correction may be on the horizon. On the other hand, low values imply the market cap of the cryptocurrency may be undervalued at the moment as the average investor is holding their coins at a loss. Now, here is a chart that shows the trend in the Bitcoin MVRV ratio over the last few years: Looks like the value of the metric has gone up recently &#124; Source: CryptoQuant As displayed in the above graph, the Bitcoin MVRV ratio had been below the one mark back during most of the second half of 2022. This isn&#8217;t an unusual trend, as bearish periods normally see investors going into deep losses, which naturally results in the indicator&#8217;s value plunging. Related Reading: Bitcoin Stuck In Tight Range: Will BTC Decompress With A Big Move? What&#8217;s interesting, though, is the metric&#8217;s interaction with the line where its value becomes 1. While bearish trends last, the level usually provides resistance to the asset. Examples of this happening during the past year&#8217;s bear market can be seen in the chart. With the rally this year, however, Bitcoin was able to break past this level, implying that a transition toward a bullish regime had occurred. The indicator briefly dropped to this level in March, but the line provided support to it, confirming that a bullish trend was indeed active. The MVRV ratio has now recently surged towards the 1.5 level, at which the market cap is 50% more than the realized cap. At these values, the asset naturally starts becoming overpriced and the risk of corrections goes up. From the graph, it&#8217;s visible that the coin found resistance at this 1.5 level when it was retested back in April. Since surging back toward it recently, the cryptocurrency has been moving sideways around this level so far. Related Reading: Polygon Volume Registers Sharp Increase, What Does It Mean? It now remains to be seen whether the Bitcoin MVRV ratio can break through this level with the current retest, or if it will end up facing another rejection. Naturally, if it&#8217;s the former, the rally might be able to continue. BTC Price At the time of writing, Bitcoin is trading around $30,500, down 2% in the last week. BTC's price action continues to be stale &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-13T14:05:52.000Z",
    "title": "Powering the Next Generation of Gaming: XBorg Sells Out $2 Million Seed Round Community Allocation",
    "url": "https://www.crypto-news-flash.com/powering-the-next-generation-of-gaming-xborg-sells-out-2-million-seed-round-community-allocation/?utm_source=rss&utm_medium=rss&utm_campaign=powering-the-next-generation-of-gaming-xborg-sells-out-2-million-seed-round-community-allocation",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/PR_Graphic_1689146399JrqtpbXCCD.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/PR_Graphic_1689146399JrqtpbXCCD.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/PR_Graphic_1689146399JrqtpbXCCD-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/PR_Graphic_1689146399JrqtpbXCCD-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/PR_Graphic_1689146399JrqtpbXCCD-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Dubai, United Arab Emirates, July 13th, 2023, Chainwire XBorg, the Web3 company developing a collaborative credential infrastructure that allows players to create their digital identity and enjoy tailored user experiences within enhanced gaming applications, sold out their $2 million seed round community allocation in record time. The funds will facilitate the scaling and adoption efforts [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-13T14:00:25.000Z",
    "title": "Top 10X Coins To Buy In 2023: Aptos, VeChain and Tradecurve",
    "url": "https://www.crypto-news-flash.com/top-10x-coins-to-buy-in-2023-aptos-vechain-and-tradecurve/?utm_source=rss&utm_medium=rss&utm_campaign=top-10x-coins-to-buy-in-2023-aptos-vechain-and-tradecurve",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T113144.336.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T113144.336.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T113144.336-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T113144.336-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />With thousands of altcoins available in the blockchain space, picking ones that can increase in value can be difficult. Analysts have predicted that these altcoins can climb by 10x: Aptos (APT), VeChain (VET), and Tradecurve (TCRV). Today, we will be going over all of them individually to see how far they can climb. Aptos (APT) [...]"
  }
]