[
  {
    "source": "CoinDesk",
    "date": "2023-09-27T18:25:50.000Z",
    "title": "Sam Bankman-Fried Can Use an 'Air-Gapped' Laptop in Court, Judge Rules",
    "url": "https://www.coindesk.com/policy/2023/09/27/sam-bankman-fried-can-use-an-air-gapped-laptop-in-court-judge-rules/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A federal judge signed off on a defense request to allow FTX founder Sam Bankman-Fried to use an \"air-gapped\" laptop while in court during his trial next month."
  },
  {
    "source": "CoinDesk",
    "date": "2023-09-27T18:14:53.000Z",
    "title": "Bitcoin Slides Back Towards $26K as Surging Interest Rates Trigger Macro Jitters",
    "url": "https://www.coindesk.com/markets/2023/09/27/bitcoin-slides-back-towards-26k-as-surging-interest-rates-trigger-macro-jitters/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. 10-year Treasury yield rose another nine basis points Wednesday to a new 16-year high of 4.63%."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-27T18:24:55.000Z",
    "title": "Xbox Goes Crypto? Leaked Microsoft Roadmap Includes Wallet Plans",
    "url": "https://decrypt.co/198961/xbox-goes-crypto-leaked-microsoft-roadmap-includes-wallet-plans",
    "description": "Documents published by Microsoft in the FTC case reveal plans for an Xbox crypto wallet. Will it still happen? Here's what we know."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-27T18:13:12.000Z",
    "title": "You Can Now Trade Bitcoin Mining Hashpower on Arbitrum",
    "url": "https://decrypt.co/198951/you-can-now-trade-bitcoin-mining-hashpower-on-arbitrum",
    "description": "The Lumerin Hashpower Marketplace creates a novel method for decentralizing Bitcoin's global hashrate and makes mining accessible to retail investors."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-27T18:30:00.000Z",
    "title": "IBM, Microsoft, others form post-quantum cryptography coalition",
    "url": "https://cointelegraph.com/news/ibm-microsoft-form-post-quantum-cryptography-coalition-encryption-computing-bitcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/076b2758-3645-4964-b3ec-f1be359e1a9d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The coalition includes Google sibling company SandboxAQ and the University of Waterloo. </p>\n                    <p><p>IBM Quantum and Microsoft have formed a coalition to tackle post-quantum cryptography alongside not-for-profit research tank MITRE, U.K.-based cryptography firm PQShield, Google sibling company SandboxAQ, and the University of Waterloo.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We’re proud to be a part of a new community of cybersecurity organizations to accelerate adoption of post-quantum cryptography in commercial & open-source technologies. <br><br>Learn more about the <a href=\"https://twitter.com/hashtag/PQC?src=hash&ref_src=twsrc%5Etfw\">#PQC</a> Coalition.  <br><br> <a href=\"https://t.co/pSrFX1qPPB\">https://t.co/pSrFX1qPPB</a> | <a href=\"https://twitter.com/hashtag/QWC2023?src=hash&ref_src=twsrc%5Etfw\">#QWC2023</a> <a href=\"https://twitter.com/hashtag/UWaterloo?src=hash&ref_src=twsrc%5Etfw\">#UWaterloo</a> <a href=\"https://t.co/vXG6CilQVx\">pic.twitter.com/vXG6CilQVx</a></p>— University of Waterloo (@UWaterloo) <a href=\"https://twitter.com/UWaterloo/status/1706680998476353794?ref_src=twsrc%5Etfw\">September 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Post-quantum cryptography (PQC) addresses the potential threat posed by quantum computers of the future. Current cryptography schemes rely on mathematical problems to stymie decryption attempts. </p><p>Cracking or bypassing such encryption with a classical computer would be close to impossible. Some experts <a href=\"https://arstechnica.com/information-technology/2023/01/fear-not-rsa-encryption-wont-fall-to-quantum-computing-anytime-soon/\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://arstechnica-com.cdn.ampproject.org/c/s/arstechnica.com/information-technology/2023/01/fear-not-rsa-encryption-wont-fall-to-quantum-computing-anytime-soon/amp/\">estimate</a> that it would take a binary computer system roughly 300 trillion years to break a 1,024-bit or 2,048-bit RSA key. </p><p>RSA, named for the computer scientists who first discussed it, is largely considered the standard for encryption. </p><p>Theoretically speaking, however, a quantum computer with sufficient hardware and architecture should be able to <a href=\"https://www.quintessencelabs.com/blog/breaking-rsa-encryption-update-state-art\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-quintessencelabs-com.cdn.ampproject.org/c/s/www.quintessencelabs.com/blog/breaking-rsa-encryption-update-state-art?hs_amp=true\">break</a> RSA and similar encryption schemes within a matter of weeks, days, or even hours. </p><p><a href=\"https://www.mitre.org/news-insights/news-release/post-quantum-cryptography-coalition-launches\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a press release from MITRE:</p><p>“Preparing for a PQC transition includes developing standards for the algorithms; creating secure, reliable, and efficient implementations of those algorithms; and integrating the new post-quantum algorithms into cryptographic libraries and protocols.”</p><p>Technologies such as blockchain and cryptocurrency, which rely on mathematical encryption, could be particularly vulnerable to decryption attacks by the theoretical quantum computers of the future. However it's currently unclear how long it could be before such threats could come to fruition.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/scientists-warn-the-quantum-revolution-may-stagnate-economic-growth\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/scientists-warn-the-quantum-revolution-may-stagnate-economic-growth/amp\"><strong><em>Scientists warn the ‘quantum revolution’ may stagnate economic growth</em></strong></a></p><p>One study, <a href=\"https://pubs.aip.org/avs/aqs/article/4/1/013801/2835275/The-impact-of-hardware-specifications-on-reaching\" target=\"_blank\" rel=\"noopener nofollow\">conducted</a> in 2022, determined that it would take a quantum computer with 300 million qubits (a very generalized measure of the potential processing power of a quantum system) to crack the Bitcoin blockchain fast enough to do any damage. By comparison, today’s most advanced quantum computers average a little over 100 qubits. </p><p>However, per the architecture described in that paper, it’s possible that more advanced qubit arrangements, chipsets, and optimization algorithms could significantly change the calculus involved and drop the theoretical 300-million-qubit requirement exponentially. For this reason, the global technology community is turning to quantum-safe encryption. </p><p>The National Institute of Standards and Technology <a href=\"https://research.ibm.com/projects/quantum-safe-cryptography\" target=\"_blank\" rel=\"noopener nofollow\">chose</a> four proposed post-quantum encryption algorithms in 2022, CRYSTALS-Kyber, CRYSTALS-Dilithium, SPHINCS+, and Falcon as candidates for a PQC-safe encryption standard.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/ecvCfTPRBrI\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>On Aug. 24, 2023, NIST <a href=\"https://www.nist.gov/news-events/news/2023/08/nist-standardize-encryption-algorithms-can-resist-attack-quantum-computers\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that three of the algorithms had been accepted for standardization with the fourth, Falcon, expected to follow suit in 2024. </p><p>Now that the algorithms have been accepted and (mostly) standardized, the coalition is set to begin its mission of using the deep knowledge and hands-on experience amassed by its members to ensure key institutions, such as government, banking, telecommunications, and transportation services are able to transition from current to post-quantum encryption. </p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-27T18:13:46.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Rep. Patrick McHenry has threatened to subpoena the United States Securities and Exchange Commission (SEC) over its handling of FTX documents. Binance has announced its exit from Russia by selling its Russian business to newly-launched exchange CommEx, though no financial details were disclosed. Meanwhile, the customers of crypto lender BlockFi may become one of the first among multiple bankruptcy proceedings to see crypto funds returned to them.</p><p>Rep. Patrick McHenry, who heads the United States House Financial Services Committee, has threatened the Securities and Exchange Commission with a subpoena <a href=\"https://cointelegraph.com/news/house-committee-threatens-subpoena-ftx-documents\">over documents related to Sam Bankman-Fried</a>. </p><p>In a Sept. 27 hearing, McHenry claimed that SEC Chair Gary Gensler has “choke[d] off the digital asset ecosystem” and has refused to be “transparent with Congress” about the commission’s connection with FTX and Bankman-Fried. McHenry claims his committee “made multiple requests” for documents about the timing of Bankman-Fried’s arrest. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/7tnv9MRh0GM\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>“Seven months later, the committee has not received a single non-public document that was not part of a [Freedom of Information Act] production,” he said.</p><p>Bankman-Fried was jailed in August after <a href=\"https://cointelegraph.com/news/sbf-jailed-ftx-partners-under-attack-law-decoded-aug-7-14\">a judge revoked his bail</a> amid reports that the former FTX CEO attempted to intimidate witnesses. Bankman-Fried faces 12 criminal charges, with his firs trial set to begin next month.</p><h3>US lawmakers threaten to subpoena SEC over FTX documents</h3><h3>Binance fully exits Russia with sale to CommEX</h3><p>Cryptocurrency exchange Binance has announced its full exit from Russia by selling its firm to a newly launched crypto exchange business known as CommEX.</p><p>Binance has entered into an agreement to sell the entirety of its Russia business to CommEX, the firm said in an announcement to Cointelegraph on Sept. 27. The exchange didn't disclose the financial details of the deal.</p><p>To ensure a smooth process for existing Russian users, the off-boarding process will take up to one year, the announcement reads. “All assets of existing Russian users are safe and securely protected,” Binance noted.</p><p>“As we look toward the future, we recognize that operating in Russia is not compatible with Binance’s compliance strategy,” Binance chief compliance officer Noah Perlman said, adding:</p><blockquote>“We remain confident in the long-term growth of the Web3 industry around the world and will focus our energy on the 100+ other countries in which we operate.”</blockquote><p>Binance will ensure to provide its customers with an orderly process for the migration of users. In cooperation with CommEX, Binance will inform users how to migrate their assets to the newly created exchange.</p><p>The user migration process will allow a portion of Russian users with completed Know Your Customer checks to be immediately redirected to CommEX. Binance will gradually sunset its platform in Russia over the next several months.</p><p>“Every effort will be made to maintain a smooth user experience during this transition,” Binance stated in the announcement.</p><p>Binance CEO Changpeng Zhao also noted that holders of Binance’s native token, BNB, will “continue to enjoy” a 25% trading discount on CommEX.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Everything will be done to ensure a smooth transition. All user funds are safe!<br><br>Also:<br><br>Among other things, <a href=\"https://twitter.com/hashtag/BNB?src=hash&amp;ref_src=twsrc%5Etfw\">#BNB</a> holders will continue to enjoy a 25% trading fee discount on <a href=\"https://twitter.com/CommEX_com?ref_src=twsrc%5Etfw\">@CommEX_com</a>. <a href=\"https://t.co/52pak53CqE\">https://t.co/52pak53CqE</a></p>&mdash; CZ  Binance (@cz_binance) <a href=\"https://twitter.com/cz_binance/status/1706948603233611858?ref_src=twsrc%5Etfw\">September 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The news comes just a day after CommEX announced its launch on Sept. 26. The platform is designed to provide cryptocurrency trading services, including spot, futures and peer-to-peer trading. The platform seems to be targeting mostly Russian users at launch, as its interface is only available in Russian and English at the time of writing.</p><h3>Crypto lender BlockFi gets court nod to repay customers</h3><p>The customers of bankrupt cryptocurrency lending platform BlockFi are <a href=\"https://cointelegraph.com/news/crypto-lender-block-fi-liquidation-plan-approval-repay-customer\">one step closer to being paid out</a> after a United States Bankruptcy Court in New Jersey approved the liquidation plan.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/celsiusbankruptcy?src=hash&amp;ref_src=twsrc%5Etfw\">#celsiusbankruptcy</a> <a href=\"https://twitter.com/hashtag/CelsiusNetwork?src=hash&amp;ref_src=twsrc%5Etfw\">#CelsiusNetwork</a> <a href=\"https://twitter.com/hashtag/Blockfi?src=hash&amp;ref_src=twsrc%5Etfw\">#Blockfi</a> <a href=\"https://twitter.com/hashtag/cryptocurrencies?src=hash&amp;ref_src=twsrc%5Etfw\">#cryptocurrencies</a> <a href=\"https://twitter.com/hashtag/crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#crypto</a> <br>Chief Judge Kaplan just indicated from the bench that he will confirm the Blockfi Third Amended Plan with some minor changes.</p>&mdash; David Adler (@DavidJAdler1991) <a href=\"https://twitter.com/DavidJAdler1991/status/1706774238399533355?ref_src=twsrc%5Etfw\">September 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Bankruptcy Judge Michael A. Kaplan <a href=\"https://restructuring.ra.kroll.com/blockfi/Home-DownloadPDF?id1=MjU0NTc0NQ==&amp;id2=-1\" target=\"_blank\" rel=\"noopener nofollow\">approved</a> BlockFi's third amended Chapter 11 plan in a Sept. 26 court hearing.</p><p>Estimates show <a href=\"https://cointelegraph.com/news/blockfi-says-ftx-three-arrows-capital-not-entitled-repayments\">BlockFi owes up to $10 billion</a> to over 100,000 creditors, including $1 billion to its three largest creditors and $220 million to bankrupt crypto hedge fund Three Arrows Capital.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-27T18:10:41.000Z",
    "title": "Kraken to launch stock trading services for U.S. and U.K. markets: Report",
    "url": "https://cryptoslate.com/kraken-to-launch-stock-trading-services-for-u-s-and-u-k-markets-report/",
    "description": "<p>U.S.-based crypto exchange Kraken plans to offer trading in US-listed stocks and exchange-traded funds, according to a source familiar with the matter as cited by Bloomberg. The initiative will be spearheaded by a newly established division, Kraken Securities. According to the reporting, Kraken has already obtained necessary regulatory permits in the U.K., and is in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/kraken-to-launch-stock-trading-services-for-u-s-and-u-k-markets-report/\">Kraken to launch stock trading services for U.S. and U.K. markets: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T18:23:06.000Z",
    "title": "Navigating the AI Revolution: A Strategic Roadmap for Businesses",
    "url": "https://www.cryptopolitan.com/navigating-the-ai-revolution-a-strategic/",
    "description": "In the latter part of 2022, the corporate landscape was taken by storm when ChatGPT, an advanced AI tool, burst onto the scene. While the emergence of AI was anticipated, the rapid evolution of this new technology caught many organizations off guard. Suddenly, businesses found themselves in a race to understand when, where, and how ... <a title=\"Navigating the AI Revolution: A Strategic Roadmap for Businesses\" class=\"read-more\" href=\"https://www.cryptopolitan.com/navigating-the-ai-revolution-a-strategic/\" aria-label=\"More on Navigating the AI Revolution: A Strategic Roadmap for Businesses\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T18:13:18.000Z",
    "title": "BIS Chief calls on countries to have a legal framework that supports CBDCs",
    "url": "https://www.cryptopolitan.com/cbdcs-to-have-legal-framework-bis-chief/",
    "description": "Agustin Carstens, the general manager of the Bank for International Settlements, a global bank, said on Wednesday that nations should establish legal frameworks that support the deployment of central bank digital currencies (CBDC). In a speech delivered on September 27 at the BISIH-FSI conference in Switzerland, Carstens emphasized the urgent need to resolve legal obstacles ... <a title=\"BIS Chief calls on countries to have a legal framework that supports CBDCs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cbdcs-to-have-legal-framework-bis-chief/\" aria-label=\"More on BIS Chief calls on countries to have a legal framework that supports CBDCs\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T18:12:12.000Z",
    "title": "Former bank CEO sinks company in crypto investment scam",
    "url": "https://www.cryptopolitan.com/former-bank-ceo-sinks-company-in-crypto-scam/",
    "description": "A recent Bloomberg report has unveiled a troubling financial scandal involving the former Chief Executive Officer of Heartland Tri-State Bank, Shan Hanes. Hanes, who once led the local bank in Kansas, USA, stands accused of sinking the institution by utilizing company funds for a cryptocurrency investment that ultimately turned out to be a scam. The ... <a title=\"Former bank CEO sinks company in crypto investment scam\" class=\"read-more\" href=\"https://www.cryptopolitan.com/former-bank-ceo-sinks-company-in-crypto-scam/\" aria-label=\"More on Former bank CEO sinks company in crypto investment scam\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-09-27T18:31:06.000Z",
    "title": "Bitcoin’s Whirlwind: Addresses Holding 1k+ Coins Surge Amid SEC Confrontation",
    "url": "https://nulltx.com/bitcoins-whirlwind-addresses-holding-1k-coins-surge-amid-sec-confrontation/",
    "description": "Recent data reveals a remarkable shift in the number of addresses holding 1,000 or more Bitcoins, with the count rising to 2,001. This significant milestone comes just 24 hours after Bitcoin&#8217;s Number of Addresses Holding 1k+ Coins hit a four-year low of 1,997. Congressmen Puts Pressure On SEC Chair Gary Gensler The timing of this [&#8230;]"
  }
]