[
  {
    "source": "CoinDesk",
    "date": "2023-09-26T06:26:36.000Z",
    "title": "Celsius' Bankruptcy Nears End as Creditors Approve Reorganization Plan",
    "url": "https://www.coindesk.com/policy/2023/09/26/celsius-bankruptcy-nears-end-as-creditors-approve-reorganization-plan/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bankrupt crypto lender Celsius' creditors have voted to approve a plan that would return 67%-85% of holdings back to them."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-26T06:19:05.000Z",
    "title": "SBF lawyers again plead for temporary release during trial with less than 1 week to go",
    "url": "https://cryptoslate.com/sbf-lawyers-again-plead-for-temporary-release-during-trial-with-less-than-1-week-to-go/",
    "description": "<p>According to a recent court filing, the defense team for FTX founder Sam Bankman-Fried has renewed their request for his temporary release during the upcoming trial, citing difficulties preparing an adequate defense under current restrictions. As the letter to Judge Kaplan explained, Bankman-Fried&#8217;s knowledge and participation are indispensable in reviewing the thousands of pages of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sbf-lawyers-again-plead-for-temporary-release-during-trial-with-less-than-1-week-to-go/\">SBF lawyers again plead for temporary release during trial with less than 1 week to go</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-26T06:33:21.000Z",
    "title": "Pantera Capital on Three Upcoming Catalysts That Could Revitalize the Digital Asset Market",
    "url": "https://www.cryptoglobe.com/latest/2023/09/pantera-capital-on-three-upcoming-catalysts-that-could-revitalize-the-digital-asset-market/",
    "description": "In its most recent “Blockchain Letter,” Pantera Capital outlines several major factors that the firm believes could significantly influence the digital asset market in the near future. According to Pantera Capital, although institutional interest in digital assets has diminished over the past year, upcoming events could reignite investor enthusiasm. One of the most noteworthy developments, […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T06:35:15.000Z",
    "title": "Europe’s geopolitical blunder is going to be its undoing",
    "url": "https://www.cryptopolitan.com/europe-geopolitical-blunder-be-its-undoing/",
    "description": "It&#8217;s baffling, really. Europe, with all its cultural heritage and centuries of geopolitics, seems to be edging closer to its own undoing. Let&#8217;s not kid ourselves. The continent, which has historically dictated the world&#8217;s tempo, is now caught in its own web of strategic miscalculations. Europe&#8217;s Mirage of Unity Poland&#8217;s recent rattling about withholding arms ... <a title=\"Europe&#8217;s geopolitical blunder is going to be its undoing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/europe-geopolitical-blunder-be-its-undoing/\" aria-label=\"More on Europe&#8217;s geopolitical blunder is going to be its undoing\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T06:29:08.000Z",
    "title": "India is a puzzle the U.S. and allies must solve",
    "url": "https://www.cryptopolitan.com/india-a-puzzle-the-us-and-allies-must-solve/",
    "description": "In the intricate web of international politics, India stands as a tantalizing enigma. With its booming economy, it&#8217;s perceived as the next big marketplace. Simultaneously, as Beijing&#8217;s influence surges, India&#8217;s strategic significance as a counterbalance to China hasn&#8217;t been lost on global powers like the U.S. But beneath this layer of geopolitical dynamics lies a ... <a title=\"India is a puzzle the U.S. and allies must solve\" class=\"read-more\" href=\"https://www.cryptopolitan.com/india-a-puzzle-the-us-and-allies-must-solve/\" aria-label=\"More on India is a puzzle the U.S. and allies must solve\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T06:21:58.000Z",
    "title": "China’s trade struggles back on world’s radar",
    "url": "https://www.cryptopolitan.com/chinas-trade-struggles-back-on-worlds-radar/",
    "description": "China&#8217;s ongoing trade complexities with global partners have once again caught international attention. With bold moves affecting top bankers and stern warnings from EU leaders, the world&#8217;s second-largest economy finds itself at a crossroads. As Western companies scramble to navigate these turbulent waters, China&#8217;s role in global trade has never been under more scrutiny. Business ... <a title=\"China&#8217;s trade struggles back on world&#8217;s radar\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chinas-trade-struggles-back-on-worlds-radar/\" aria-label=\"More on China&#8217;s trade struggles back on world&#8217;s radar\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T06:09:35.000Z",
    "title": "Moody’s explains how the govt shutdown will affect U.S. debt rating",
    "url": "https://www.cryptopolitan.com/how-govt-shutdown-will-affect-us-debt-rating/",
    "description": "The pulse of the U.S. financial landscape might be about to shift dramatically, as Moody&#8217;s delivers an unmistakable warning: the looming U.S. government shutdown threatens the coveted triple A credit rating. In an atmosphere rife with political wrangling, the risk of the federal government running out of funds grows larger by the day, making this ... <a title=\"Moody&#8217;s explains how the govt shutdown will affect U.S. debt rating\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-govt-shutdown-will-affect-us-debt-rating/\" aria-label=\"More on Moody&#8217;s explains how the govt shutdown will affect U.S. debt rating\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-26T06:35:49.000Z",
    "title": "Axie Infinity and Ethereum tumble while Pomerdoge rallies",
    "url": "https://crypto.news/axie-infinity-and-ethereum-tumble-while-pomerdoge-rallies/",
    "description": "Axie Infinity (AXS) and Ethereum (ETH) are struggling, while Pomerdoge (POMD) is firm in the ongoing presale"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-26T06:11:37.000Z",
    "title": "Litecoin Stuck In A Rut: Will Bullish Momentum Or Bearish Pressure Prevail?",
    "url": "https://www.newsbtc.com/analysis/ltc/litecoin-stuck-in-a-rut-bullish-or-bearish/",
    "description": "Litecoin (LTC) has spent the past week trading within a tight price range, with its value hovering steadily around the mid-range point of $64. The price action for LTC in September has remained primarily bearish, with sellers maintaining control over the market.  While LTC has a history of volatile price swings, recent times have seen it mirroring the sideways movement of the overall market, largely influenced by Bitcoin&#8217;s fluctuations, which rose from $25,000 to $27,000 before dropping to $26,000. As of the latest data from CoinGecko, Litecoin is currently trading at $64.63, with a 24-hour gain of 0.7%. However, over the past seven days, LTC has experienced a decline of 2.9%, reflecting the prevailing bearish sentiment in the market, according to a recent price report. Related Reading: Is Terra Classic Planning For USTC To Be Pegged To The Dollar Again? Chasing Litecoin Bulls and Avoiding The Bears For those looking for a bullish revival in Litecoin&#8217;s price,  a price report notes that the key level to watch is the 23.6% Fibonacci retracement level, which stands at $69. Breaking above this level could open the door for further gains, with potential targets lying at $78 and $80. On the other hand, if the flat trading volume persists, bears may exert further pressure, potentially leading to a drop in LTC&#8217;s price to the $60 mark. Source: Coinalyze Market speculators have not been particularly enthusiastic about Litecoin&#8217;s recent sideways movement. The Open Interest (OI) for LTC has continued to decline, with data from Coinalyze indicating a $9 million drop within the past 48 hours. This suggests that traders and investors are becoming increasingly cautious as they monitor the developments in the Litecoin market. Litecoin&#8217;s Investment Appeal in Q3/Q4 Despite the recent lackluster performance, some analysts believe that Litecoin remains an attractive investment opportunity in the third and fourth quarters of this year. Litecoin&#8217;s established reputation, solid ecosystem, and upcoming halving events are factors that contribute to its appeal. LTC market cap currently at $4.7 billion. Chart: TradingView.com Halving events have historically had a positive impact on Litecoin&#8217;s price, reducing the rate at which new LTC coins are mined and potentially increasing scarcity. Related Reading: Will Dogecoin Bounce Back To $0.07? Here’s What To Watch For Market participants are closely watching the 23.6% Fibonacci retracement level at $69 for signs of a bullish revival, while a continuation of flat trading volume could see LTC drop to $60. Despite recent market concerns, Litecoin&#8217;s strong fundamentals and upcoming halving events make it an investment opportunity worth considering as we move into the later part of the year. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Invest Right"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-26T06:39:57.000Z",
    "title": "Surge in international demand spurs GITEX GLOBAL, Expand North Star to take over the city of Dubai at two mega venues",
    "url": "https://coinedition.com/surge-in-international-demand-spurs-gitex-global-expand-north-star-to-take-over-the-city-of-dubai-at-two-mega-venues/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/PR1-12.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/PR1-12.png 730w, https://coinedition.com/wp-content/uploads/2023/09/PR1-12-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/09/PR1-12-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/09/PR1-12-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/09/PR1-12-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/09/PR1-12-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/09/PR1-12-313x175.png 313w, https://coinedition.com/wp-content/uploads/2023/09/PR1-12-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/09/PR1-12-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/09/PR1-12-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/09/PR1-12-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/09/PR1-12-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/09/PR1-12-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/09/PR1-12-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/09/PR1-12-129x73.png 129w, https://coinedition.com/wp-content/uploads/2023/09/PR1-12-355x200.png 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The surge in international demand has rallied the world’s largest tech and start-up event to scale even higher and bigger in 2023, spearheading a global tech takeover across two Dubai mega venues next month. The 43rd edition of GITEX GLOBAL will take place from 16-20 October 2023, the blockbuster tech showpiece once again reaching full [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/surge-in-international-demand-spurs-gitex-global-expand-north-star-to-take-over-the-city-of-dubai-at-two-mega-venues/\">Surge in international demand spurs GITEX GLOBAL, Expand North Star to take over the city of Dubai at two mega venues</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]