[
  {
    "source": "Cointelegraph",
    "date": "2023-12-13T10:41:34.000Z",
    "title": " Wikipedia co-founder says Bitcoin doesn’t work, BTC community snaps back ",
    "url": "https://cointelegraph.com/news/wikipedia-co-founder-bitcoin-doesnt-work-btc-community-claps-back",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYTQ1ODQ3MWMtNmQ1Ny00YmY4LTliZjQtNWE0NDY3ZDcxNGQzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>BTC proponents argued to Jimmy Wales that banks might work, but they’re not available to everyone and that storing BTC personally and storing fiat via banks are two different things.</p>\n                    <p><p data-ct-non-breakable=\"true\">Wikipedia co-founder Jimmy Wales took to X (formerly Twitter) on Dec. 11 to take a shot at Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), bragging that while many users have lost their Bitcoin because they forgot their wallet passwords, he’s never lost any money due to losing his bank password. </p><p>Wales’ comments didn’t resonate well with the wider Bitcoin and crypto community, who snapped back at the Wikipedia co-founder about its dependence on donations to run day-to-day operations.</p><p>In his X post, Wales sarcastically claimed that he forgot the password to his bank account and lost all his cash, only to then mock the BTC community by adding, “No, actually, that didn’t happen because banks work and Bitcoin doesn’t.”</p><p><a href=\"https://cointelegraph.com/news/wikipedia-co-founder-bitcoin-doesnt-work-btc-community-claps-back\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-13T11:00:40.000Z",
    "title": "Bitcoin miner revenue reshaped by Inscriptions, transaction fees hit $500M in 2023",
    "url": "https://cryptoslate.com/insights/bitcoin-miner-revenue-reshaped-by-inscriptions-transaction-fees-hit-500m-in-2023/",
    "description": "<p>Quick Take An examination of the dynamics of Bitcoin transaction fees over the last three years reveals notable trends. Miners, traditionally earning revenue through block rewards, have to be increasingly reliant on transaction fees due to the continued reduction of these rewards. The 2021 bull market saw transaction fees surpassing the $1 billion mark. In [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-miner-revenue-reshaped-by-inscriptions-transaction-fees-hit-500m-in-2023/\">Bitcoin miner revenue reshaped by Inscriptions, transaction fees hit $500M in 2023</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-13T11:00:22.000Z",
    "title": "Report: South African Financial Institutions Will Soon Offer Services Related to Cryptocurrencies",
    "url": "https://news.bitcoin.com/report-south-african-financial-institutions-will-soon-offer-services-related-to-cryptocurrencies/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2025404462-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Report: South African Financial Institutions Will Soon Offer Services Related to Cryptocurrencies\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2025404462-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2025404462-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2025404462-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2025404462-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2025404462-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2025404462-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2025404462.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />About 73 applicants who are seeking a license to offer crypto products in South Africa are already registered as accountable institutions with the Financial Intelligence Centre, an executive at the crypto exchange Luno has said. According to the Luno executive, this may be an indication that regulated financial institutions are planning to add crypto to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T10:59:16.000Z",
    "title": "Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?",
    "url": "https://www.cryptopolitan.com/rollbit-price-prediction/",
    "description": "Rollbit coin price prediction 2023-2032 Rollbit has quickly become one of the most popular crypto casinos and trading platforms. Launched in 2019, Rollbit offers a wide range of gaming, sports betting, futures trading, and NFT options for users. With no KYC requirements and support for numerous cryptocurrencies, Rollbit provides an easy entry into the world [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T10:55:16.000Z",
    "title": "Unplugged AI Technology Raises Concerns About Societal Alienation",
    "url": "https://www.cryptopolitan.com/unplugged-ai-technology-raises-concerns/",
    "description": "In a world increasingly driven by technological advancements, the race to develop artificial intelligence (AI) that can operate &#8220;unplugged&#8221; from the internet is gaining momentum. Intel, Apple, and Qualcomm are among the tech giants at the forefront of this endeavor, with their recent innovations aimed at providing users with a more personalized and private AI [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T10:49:45.000Z",
    "title": "Ethereum insider claims original ETH fees targeted $0.01-$0.02 range",
    "url": "https://www.cryptopolitan.com/ethereum-insider-original-fees-0-01-0-02/",
    "description": "Ethereum stands out as a pioneering network known for its smart contract capabilities. However, recent developments have sparked debate over its fee structure, with an early Ethereum Foundation advisor, Steven Nerayoff, raising concerns about the increasing cost of transactions, a significant shift from the network&#8217;s initial vision. Ethereum&#8217;s fee structure under scrutiny Nerayoff&#8217;s critique highlights [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-13T11:08:37.000Z",
    "title": "BINANCE COIN PRICE ANALYSIS & PREDICTION (December 13) – BNB Pushes Above $250 Amid Market Drawdown, Can It Sustain Buyin For Long?",
    "url": "https://nulltx.com/binance-coin-price-analysis-prediction-december-13-bnb-pushes-above-250-amid-market-drawdown-can-it-sustain-buyin-for-long/",
    "description": "Despite this week’s meltdown, Binance Coin (BNB) showed strength and continued to increase steadily. It is now forming a bullish pattern after charting a 10% gain in the past week. More gains lie ahead. BNB ended last week’s trading in a slightly bullish mode on the short-term after consolidating under [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-13T10:58:16.000Z",
    "title": "Analysts: Fetch.ai, Everlodge, and Injective can transform crypto",
    "url": "https://crypto.news/analysts-fetch-ai-everlodge-and-injective-can-transform-crypto/",
    "description": "Analysts say Fetch.ai (FET), Everlodge (ELDG), and Injective (INJ) are three coins at the forefront of transforming crypto"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-13T10:57:59.000Z",
    "title": "Crypto hacks volume fell 50% in 2023, TRM Labs reports",
    "url": "https://crypto.news/crypto-hacks-volume-fell-50-in-2023-trm-labs-reports/",
    "description": "Despite a near-constant number of hacks, the total amount of crypto stolen has been slashed by over half in 2023, TRM Labs reports. According to a report published by blockchain firm TRM Labs, hackers managed to pilfer $1.7 billion through&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-13T10:55:39.000Z",
    "title": "3AC co-founder Su Zhu probed in Singapore court over fund’s collapse",
    "url": "https://crypto.news/3ac-co-founder-su-zhu-probed-in-singapore-court-over-funds-collapse/",
    "description": "Su Zhu, co-founder of Three Arrows Capital (3AC), reportedly faced his first court questioning in Singapore court regarding the firm&#8217;s collapse. Su Zhu the co-founder of the defunct Three Arrow’s (3AC) capital has made a court appearance in Singapore spanning&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-13T10:49:00.000Z",
    "title": "Beyond Dogecoin and Bitcoin: investors scouting for next cryptocurrency sensation",
    "url": "https://crypto.news/beyond-dogecoin-and-bitcoin-investors-scouting-for-next-cryptocurrency-sensation/",
    "description": "Dogecoin and Bitcoin look solid. Amid this, investors have been exploring NuggetRush and NUGX in the ongoing presale"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-13T10:48:40.000Z",
    "title": "Trump releases new mug shot NFT as former President’s ongoing legal issues mount",
    "url": "https://crypto.news/trump-releases-new-mug-shot-nft-as-former-presidents-ongoing-legal-issues-mount/",
    "description": "Former President of the Donald Trump has unveiled a new NFT collection called the ‘Mugshot Edition,’ a play on the recent legal woes mounting against the leading Republican candidate. A new NFT collection by former President Donald Trump is taking the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-13T10:45:55.000Z",
    "title": "Bitcoin Price Gain Slows Down: Glassnode’s Fair Value Models Puts The Crypto At $36,000",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-fair-value-36000/",
    "description": "Bitcoin seems to be undergoing a period of consolidation and profit-taking after eight weeks of phenomenal price growth. The world&#8217;s largest crypto has had incredible growth this year, with a special surge starting in the middle of October.  However, after hitting a yearly high of $44,500 on December 8, the price of Bitcoin has pulled back about 6% as some investors look to be taking profits. According to on-chain data provider Glassnode, several of its on-chain pricing models suggest Bitcoin’s fair value is currently between $30,000 and $36,000. Bitcoin&#8217;s Price Rally Pauses As After A Resistance At $44,500 Bitcoin&#8217;s price appreciation this year led to a 150% gain which pushed it above $44,500, but on-chain data shows the hot streak has cooled off a bit after forming a resistance at this price level.  Related Reading: Shiba Inu Rally To $0.0001? Shibarium Transaction Count Breaches 90 Million Milestone This has led to many short-term investors taking profit from their holdings. According to data from Whale Alerts, there have also been various instances of large BTC transactions into crypto exchanges in the past few days, suggesting some whale addresses might also be participating in the selloff. 🚨 🚨 658 #BTC (26,893,152 USD) transferred from unknown wallet to #Binancehttps://t.co/QzyF0MRiHT — Whale Alert (@whale_alert) December 13, 2023 A short-term correction was inevitable, according to crypto data firm Glassnode&#8217;s fair value models. Their analysis based on the investor cost basis and network throughput suggests the fair price is lagging behind the current market spike. A metric cited was the Active Investor Realized Price, which monitors the degree of HODLing across the network. According to this model, Bitcoin&#8217;s spot prices are currently trading above its realized price (fair value).  Taking a look at historical trends shows it has taken between 14 to 20 months between the realized price and the creation of an all-time high. The path to the creation of a new ATH has also always involved major spot price fluctuations of ±50% around the Active Investors Realized Price. Source: Glassnode The crypto asset is now 11 months into the break, with spot prices fluctuating between -38% and 21% of the realized price. If history repeats itself, we could see another few months of movements around the current fair value of $36,000.  This price point correlates with a social media post by crypto analyst Ali Martinez. While noting IntoTheBlock data, the analyst noted strong support between $37,150 and $38,360, backed by 1.52 million addresses holding 534,000 BTC. In case of a deeper correction, #Bitcoin finds solid support between $37,150 and $38,360. This zone is backed by 1.52 million addresses holding 534,000 $BTC. Also, watch out for two resistance walls that could keep the #BTC uptrend at bay: one at $43,850 and another at $46,400. pic.twitter.com/NGm1XpMOLf — Ali (@ali_charts) December 11, 2023 BTC bulls try to recover losses &#124; Source: BTCUSD on Tradingview.com Another technical pricing model cited by Glassnode was the Mayer Multiple. The Mayer Multiple indicator is now at a value of 1.47, close to the 1.5 level which often forms a level of resistance in prior bull cycles.  Related Reading: Crypto Expert Explains Why The Bitcoin Price Crash To $40,000 Is Not A Bad Thing Glassnode’s report also looked at various other pricing models, including the NVT Premium indicator which evaluates the utility of the network throughput in terms of a USD value. According to the NVT Premium, the recent rally is one of the biggest spikes since Bitcoin’s all-time high in November 2021, suggesting an overvaluation in relation to the network throughput. What’s Next For Bitcoin? Bitcoin is trading at $40,963 at the time of writing. Although the crypto is now down by 6% in a 7-day timeframe, it is still monitoring gains of 8.5% from its December open of $37,731. The $44,500 level is now a crucial level for the asset, as the industry continues to wait for a bullish run after the approval of spot Bitcoin ETFs in the US.  The crypto market is still in bullish sentiment, with Coinmarket&#8217;s Fear &#38; Greed Index pointing to a 73 greed. A power through $44,500 would signal the resumption of the bullish trend for Bitcoin. Another resistance level to watch after the break would be the $46,400 level. Featured image from Chainalysis, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-13T11:04:02.000Z",
    "title": "Bitcoin Liquidity Expected to Stay Low Over the Holidays, Predicts Analyst",
    "url": "https://www.crypto-news-flash.com/bitcoin-liquidity-expected-to-stay-low-over-the-holidays-predicts-analyst/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-liquidity-expected-to-stay-low-over-the-holidays-predicts-analyst",
    "description": "<img width=\"2560\" height=\"1536\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/bitcoin-3406638-1-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/bitcoin-3406638-1-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/bitcoin-3406638-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/bitcoin-3406638-1-1024x614.jpg 1024w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Bitcoin market liquidity is projected to remain low during the holiday season. Bitcoin ETF and halving sentiments are still potential triggers for impending recovery. A recent prediction from Analyst Caroline Mauron of Orbital Markets suggests that despite the ongoing review of spot Bitcoin (BTC) Exchange-Traded Fund (ETF) applications by the US Securities and Exchange Commission [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-13T10:41:29.000Z",
    "title": "BlackRock Revises Bitcoin ETF Proposal and Implements Easier Access to Onboard Trillion-Dollar Banks JPMorgan, Bank of America, and Others",
    "url": "https://www.crypto-news-flash.com/blackrock-revises-bitcoin-etf-proposal-and-implements-easier-access-to-onboard-trillion-dollar-banks-jpmorgan-bank-of-america-and-others/?utm_source=rss&utm_medium=rss&utm_campaign=blackrock-revises-bitcoin-etf-proposal-and-implements-easier-access-to-onboard-trillion-dollar-banks-jpmorgan-bank-of-america-and-others",
    "description": "<img width=\"1000\" height=\"666\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BlackRock\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Regulatory changes now enable major financial institutions like JPMorgan and Goldman Sachs to enter the cryptocurrency market through Bitcoin ETFs, eliminating the necessity for direct cryptocurrency ownership. Anticipated SEC approval for trading spot ETFs by leading financial firms by January 2024. Leading Wall Street entities such as JPMorgan and Goldman Sachs are poised to delve [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-13T10:56:52.000Z",
    "title": "Trump Launches Mugshot NFT Collection — Bearish for His Previous NFTs?",
    "url": "https://coinedition.com/trump-launches-mugshot-nft-collection-bearish-for-his-previous-nfts/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/nft8.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Trump Cards Surge Amid The Former President’s Mugshot Release\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/nft8.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/nft8-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/nft8-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/nft8-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/nft8-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/nft8-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/nft8-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/nft8-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/nft8-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/nft8-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/nft8-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/nft8-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/nft8-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/nft8-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/nft8-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/nft8-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Former U.S. President Donald Trump has unveiled his third collection of non-fungible tokens (NFTs), known as Trump Digital Trading Cards MugShot Edition. Announced via Trump&#8217;s Truth Social account, the newest collection sets itself apart by offering not only digital collectibles but also physical versions of the cards. Collectors purchasing 47 NFTs in a single transaction [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/trump-launches-mugshot-nft-collection-bearish-for-his-previous-nfts/\">Trump Launches Mugshot NFT Collection — Bearish for His Previous NFTs?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]