[
  {
    "source": "Cointelegraph",
    "date": "2023-11-08T02:49:46.000Z",
    "title": "Stablecoin issuer Circle weighing up 2024 public launch: Report",
    "url": "http://cointelegraph.com/news/circle-mulling-public-launch-next-year-bloomberg",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/af3b0139-cbee-467d-81e4-459c39132030.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Circle initially agreed to go public as part of a $4.5 billion merger in July 2021 but that deal fizzled out.</p>\n                    <p><p>USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) issuer Circle is contemplating an initial public offering (IPO) in early 2024, according to Bloomberg.</p><p>A Nov. 7 Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2023-11-07/stablecoin-issuer-circle-internet-said-to-consider-2024-ipo#xj4y7vzkg\" target=\"_blank\" rel=\"noopener nofollow\">report</a> citing people with knowledge of the matter said the stablecoin issuer is talking to its advisers about the move but there’s no certainty the deliberations will result in a public listing.</p><p>Circle first agreed to go public in a <a href=\"https://cointelegraph.com/news/breaking-stablecoin-firm-circle-to-go-public-in-4-5b-blank-check-deal\">$4.5 billion merger with Concord Acquisition</a> in July 2021 but that deal fell through.</p><p>“Becoming a U.S.-listed public company has long been part of Circle’s strategic aspirations,” a Circle representative told Bloomberg. </p><p>Circle remains tight-lipped on the details. “We don’t comment on rumors,” the representatives added.</p><p>A potential IPO would see the now-privately owned Circle publicly offer shares for the first time.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/moodys-ai-service-stablecoin-depegging-index\"><strong><em>Moody’s unveils service that uses AI to predict stablecoin depeggings </em></strong></a></p><p>Circle was <a href=\"https://cointelegraph.com/news/circle-s-valuation-doubles-to-9b-following-revised-merger-agreement-with-concord\">valued at $9 billion</a> in February 2022 after the firm revised its merger deal with Concord. However, USDC’s market cap has fallen 56% from its $55.9 billion peak in June 2022 to $24.6 billion.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Our Chief Economist <a href=\"https://twitter.com/gordonliao?ref_src=twsrc%5Etfw\">@gordonliao</a> &amp; his co-authors were honored at <a href=\"https://twitter.com/hashtag/DCFintechWeek?src=hash&amp;ref_src=twsrc%5Etfw\">#DCFintechWeek</a> for their research showing how stablecoin use for speculative crypto trading has dropped 90% since 2019. More evidence that <a href=\"https://twitter.com/search?q=%24USDC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDC</a> utility era is here. Kudos! <a href=\"https://t.co/XTjxc4Sdjr\">https://t.co/XTjxc4Sdjr</a></p>&mdash; Circle (@circle) <a href=\"https://twitter.com/circle/status/1721909116044562484?ref_src=twsrc%5Etfw\">November 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Circle has received investment from <a href=\"https://cointelegraph.com/news/blackrock-joins-stablecoin-issuer-circle-s-400m-funding-round\">financial services firms BlackRock,</a> Fidelity Management, Goldman Sachs, General Catalyst Partners and Marshall Wace.</p><p>USDC temporarily depegged from the United States dollar in March due to its $3.3 billion exposure to the now-collapsed Silicon Valley Bank. It bottomed at $0.87 on March 11 before bouncing back to $1 on March 14, <a href=\"https://www.coingecko.com/en/coins/usdc\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to CoinGecko.</p><p><strong><em>Magazine:</em></strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em> </em></strong><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-08T03:00:00.000Z",
    "title": "Bitcoin (BTC) HODLers Stay Firm in Early Stages of Bull Market, Bitfinex Alpha Report Says",
    "url": "https://www.cryptoglobe.com/latest/2023/11/bitcoin-btc-hodlers-stay-firm-in-early-stages-of-bull-market-bitfinex-alpha-report-says/",
    "description": "Long-term Bitcoin holders remain steadfast in their investment, despite the recent market excitement that saw the price of BTC briefly touch the $35,000 mark after investors bought the cryptocurrency based on optimism surrounding the potential approval of a spot Bitcoin exchange-traded fund (ETF) in the US. Bitcoin’s price is up by over 110% so far […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-08T03:00:00.000Z",
    "title": "Cast AI Secures $35 Million to Revolutionize Cloud Spending with AI Solutions",
    "url": "https://www.cryptopolitan.com/cast-ai-secures-35-million-ai-solutions/",
    "description": "In a pioneering move harnessing AI solutions to tackle the escalating costs of cloud spending, Miami-based startup Cast AI has announced a triumphant $35 million injection in a series B funding round led by Vintage Investment Partners. This strategic investment is set to catapult Cast AI into the forefront of cloud optimization solutions, leveraging artificial ... <a title=\"Cast AI Secures $35 Million to Revolutionize Cloud Spending with AI Solutions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cast-ai-secures-35-million-ai-solutions/\" aria-label=\"More on Cast AI Secures $35 Million to Revolutionize Cloud Spending with AI Solutions\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-08T03:08:58.000Z",
    "title": "Bitcoin Price Rejects $36K: Why Dips In BTC Are Still Attractive",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-rejects-36k/",
    "description": "Bitcoin price made another attempt to clear the $36,000 resistance. BTC struggled again and is now correcting lower toward the $35,200 support. Bitcoin again failed to clear the key $36,000 resistance zone. The price is trading above $35,000 and the 100 hourly Simple moving average. There was a break above a major contracting triangle with resistance near $35,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair is correcting gains and might find support near $35,200 or $35,000. Bitcoin Price Faces Uphill Task Bitcoin price remained stable above the $34,000 support zone. BTC attempted a fresh increase above the $35,250 resistance zone. There was a break above a major contracting triangle with resistance near $35,000 on the hourly chart. It even cleared the $35,500 resistance, but the bears were active near the $36,000 zone. A high was formed near $35,900 and the price is again moving lower. There was a move below the $35,500 level. The price declined below the 23.6% Fib retracement level of the upward move from the $34,560 swing low to the $35,900 high. Bitcoin is now trading above $35,000 and the 100 hourly Simple moving average. It seems to be approaching the $35,200 support or the 50% Fib retracement level of the upward move from the $34,560 swing low to the $35,900 high. If it stays above $35,200, there might be a fresh increase. On the upside, immediate resistance is near the $35,560 level. The next key resistance could be near $35,900 or the recent high. The main resistance is still near $36,000. A clear move above the $36,000 resistance might open the doors for a move toward the $37,000 resistance. Source: BTCUSD on TradingView.com The next key resistance could be $37,500, above which the price could rise toward $38,000. Any more gains might send BTC toward the $38,800 level. More Downsides In BTC? If Bitcoin fails to rise above the $35,560 resistance zone, it could continue to move down. Immediate support on the downside is near the $35,200 low. The next major support is near the $35,000 zone or the 100 hourly SMA. If there is a move below $35,000, there is a risk of more downsides. In the stated case, the price could revisit the $34,000 support level in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $35,200, followed by $35,000. Major Resistance Levels – $35,560, $35,900, and $36,000."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-08T03:00:04.000Z",
    "title": "Bitcoin Throne Shaken? XRP And Emerging Tokens Steal The Spotlight",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-throne-shaken-xrp-and-emerging-tokens-steal-the-spotlight/",
    "description": "According to a recent Bloomberg report, the crypto market is experiencing a significant rally, with speculative demand expanding beyond the revival of Bitcoin (BTC).  In November, gauges tracking the performance of the bottom half and mid-tier tokens in MarketVector&#8217;s index of the largest 100 digital assets surged by 16% and 14%, respectively. This surpasses the broader market&#8217;s 4% gain and Bitcoin&#8217;s modest 1% rise. As a result, BTC’s dominance in the $1.38 trillion crypto market has decreased to around 49%, down from its peak of 51.5% in October, as per CoinGecko data. This decline is often perceived as a sign of growing risk appetite among digital asset investors. Optimism Spreads Beyond Bitcoin Richard Galvin, co-founder at Digital Asset Capital Management, noted that this rally is “more extensive and sustained” than any price action seen since January. Galvin mentioned to Bloomberg that in an environment still “relatively thin” in terms of liquidity, substantial upward movements are being witnessed. Bitcoin experienced a notable 28% surge last month, the largest since January, driven by expectations of the first US Bitcoin spot exchange-traded funds (ETFs) securing approval for direct investment in the token.  Related Reading: Analyzing ADA Solid 25% Gain: Signs Point To Cardano Rally Ahead Per the report, the general sense of optimism has extended beyond Bitcoin, fueled by speculations that the Federal Reserve (Fed) has concluded its interest-rate hikes. Furthermore, according to Bloomberg, the crypto rally is spreading to other areas, such as decentralized finance (DeFi), encompassing blockchain projects facilitating peer-to-peer transactions.  Interest rates to borrow stablecoins on major DeFi lender Aave have exceeded 10%, indicating investors&#8217; willingness to pay higher costs to fund trading positions. XRP Strength Shines Amid Ripple&#8217;s Legal Battle Among “smaller tokens,” XRP demonstrated strength in November by recording a 14% increase. This surge can be attributed to Ripple&#8217;s recent partial legal victory over the Securities and Exchange Commission (SEC). The lawsuit raised questions regarding whether XRP should be classified as a security falling under the regulatory purview of the SEC. As a result, XRP is currently trading at $0.6699, experiencing a notable decline of over 5% in the past 24 hours after failing to consolidate above current levels. Nonetheless, the token has generated significant profits, evidenced by its 11.4% surge over the past seven days. Related Reading: Self-Authentication System Of Shiba Inu Has Technical Issues, Developer Reveals Moreover, speculation regarding a potential settlement of the SEC lawsuit has been fueled by an upcoming November 9 deadline for a briefing schedule on remedies for pending issues in the case. While Bitcoin has experienced a significant rebound this year, with a 111% increase following the crypto rout in 2022, it is currently trading at 34,800, consolidating above this key level with sideways price action and a slight surge in the past seven days of 1%. Overall, the crypto market is experiencing a broader rally beyond Bitcoin, with its peers gaining momentum and decentralized finance gaining traction. Positive developments for Ripple have contributed to the surge in XRP, while Bitcoin&#8217;s rebound and growing investor sentiment indicate a potential shift in the overall market dynamics. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-08T02:46:13.000Z",
    "title": "AltSignals ICO Offers Revolutionary New Trading Signals AI Technology",
    "url": "https://www.crypto-news-flash.com/altsignals-ico-offers-revolutionary-new-trading-signals-ai-technology/?utm_source=rss&utm_medium=rss&utm_campaign=altsignals-ico-offers-revolutionary-new-trading-signals-ai-technology",
    "description": "<img width=\"1600\" height=\"800\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/NMB-L-Logo-6.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/NMB-L-Logo-6.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/NMB-L-Logo-6-300x150.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/NMB-L-Logo-6-1024x512.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/NMB-L-Logo-6-768x384.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/NMB-L-Logo-6-1536x768.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/NMB-L-Logo-6-1200x600.png 1200w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />As 2023 draws to a close, it’s an excellent time to take stock and reflect on the improvement in crypto markets this year after the choppy waters of 2022. This year has brought many exciting new projects and technological developments to the crypto marketplace, such as implementing AI technology within the crypto space. One of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-08T02:43:35.000Z",
    "title": "Crypto Presale Battle: Will Memeinator’s Meme Coin War Beat Wall Street Memes Growing Presence?",
    "url": "https://www.crypto-news-flash.com/crypto-presale-battle-will-memeinators-meme-coin-war-beat-wall-street-memes-growing-presence/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-presale-battle-will-memeinators-meme-coin-war-beat-wall-street-memes-growing-presence",
    "description": "<img width=\"1600\" height=\"800\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Memeinator-Content-Media-Bank-–-Small-Logo-4-min.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Memeinator-Content-Media-Bank-–-Small-Logo-4-min.jpg 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Memeinator-Content-Media-Bank-–-Small-Logo-4-min-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Memeinator-Content-Media-Bank-–-Small-Logo-4-min-1024x512.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Memeinator-Content-Media-Bank-–-Small-Logo-4-min-768x384.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Memeinator-Content-Media-Bank-–-Small-Logo-4-min-1536x768.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Memeinator-Content-Media-Bank-–-Small-Logo-4-min-1200x600.jpg 1200w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />It&#8217;s an action-packed showdown in the crypto arena! Picture this: Memeinator’s crypto presale is locked and loaded, ready to take on any challenger. Charging from the other corner, Wall Street Memes (WSM) is growing stronger and looking to stake its claim. It&#8217;s not just a battle; it&#8217;s a cinematic clash of titans. Will Memeinator&#8217;s firepower [...]"
  }
]