[
  {
    "source": "CoinDesk",
    "date": "2024-02-06T23:02:24.000Z",
    "title": "Taproot Wizards' New Bitcoin NFTs Already Trading at Twice the Initial Sale Price",
    "url": "https://www.coindesk.com/tech/2024/02/06/taproot-wizards-new-bitcoin-nfts-already-trading-at-twice-the-initial-sale-price/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "With almost two hours left for whitelisted buyers to claim the digital-art collectibles, at least 2,560 of the series of 3,000 had been claimed, at a fixed price of 0.1 BTC ($4,274 each)."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-06T23:01:02.000Z",
    "title": "Jack Dorsey-Backed COPA Wants Satoshi Nakamoto ‘False Narrative’ Put to Rest",
    "url": "https://decrypt.co/216170/jack-dorsey-backed-copa-wants-satoshi-nakamoto-false-narrative-put-to-rest",
    "description": "Lawyers argue Wright's claim of being Bitcoin’s inventor is supported by \"forgery on an industrial scale.”"
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-06T22:58:00.000Z",
    "title": "Congress should allow crypto to be regulated beyond securities laws: U.S. Secretary Treasury",
    "url": "https://cryptoslate.com/congress-should-allow-crypto-to-be-regulated-beyond-securities-laws-u-s-secretary-treasury/",
    "description": "<p>Janet Yellen, U.S. Secretary of the Treasury, affirmed the need to regulate the cryptocurrency sector beyond securities laws on Feb. 6. Yellen made those remarks during a hearing before the U.S. House of Representatives Committee on Financial Services. There, she said: &#8220;The [Treasury’s Financial Stability Oversight Council (FSOC)] is focused on digital assets and related [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/congress-should-allow-crypto-to-be-regulated-beyond-securities-laws-u-s-secretary-treasury/\">Congress should allow crypto to be regulated beyond securities laws: U.S. Secretary Treasury</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-06T23:00:02.000Z",
    "title": "Beijing Targets Cryptocurrency Mining Operations in New Energy Conservation Plan",
    "url": "https://news.bitcoin.com/beijing-targets-cryptocurrency-mining-operations-in-new-energy-conservation-plan/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/737f0bed-b3cb-494c-8bfb-8874d6517ef5-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Beijing Targets Cryptocurrency Mining Operations in New Energy Conservation Plan\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/737f0bed-b3cb-494c-8bfb-8874d6517ef5-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/737f0bed-b3cb-494c-8bfb-8874d6517ef5-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/737f0bed-b3cb-494c-8bfb-8874d6517ef5-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/737f0bed-b3cb-494c-8bfb-8874d6517ef5-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/737f0bed-b3cb-494c-8bfb-8874d6517ef5-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/737f0bed-b3cb-494c-8bfb-8874d6517ef5-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/737f0bed-b3cb-494c-8bfb-8874d6517ef5.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Beijing is prepared to apply a new policy to strengthen the actions to foster energy conservation in several aspects of the city&#8217;s operations, promoting carbon and pollution reduction. The plan proposes to increase the oversight level on Bitcoin mining activities, thwarting its remnants. Beijing to Thwart Cryptocurrency Mining Activities in Energy Conservation Plan The city [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-06T23:00:42.000Z",
    "title": "Here’s Why A Bitcoin Bull Run In 2024 Is Inevitable",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-bull-run-2024-inevitable/",
    "description": "The expectations of a Bitcoin bull run in the year 2024 continue to drive investment decisions across the space. A number of reasons have been given for the expected bull run, including the approval of Spot Bitcoin ETFs for trading as well as the upcoming BTC halving event. One analyst has echoed the latter, elaborating on why the halving will bring about a bull market. The Bitcoin Halving Event Will Send Market Higher Crypto analyst James van Straten took to X (formerly Twitter) to explain why the Bitcoin halving event is bullish for price. Now, the halving is an event that is programmed to take place approximately every four years, cutting the block rewards in half each time it happens. Related Reading: LUNC Price Rally Is Far From Over Following Falling Wedge Breakout, Analyst Says This means that the number of BTC that miners are awarded for mining a block is immediately slashed by 50%, thereby drastically reducing the number of new coins coming into circulation. Currently, the block reward is at 6.25 BTC and the next halving will slash it to 3.125. Straten points to this reduction, using the monthly issuance as the case study. He explains that over the past month, there have been a total of 61,000 BTC accumulated by miners and exchanges. However, after the halving, the monthly issuance is expected to drop to 13,500 BTC and it is this drop that is most significant. Past 30 days of all cohorts, miners and exchanges included have accumulated 61,000 #Bitcoin. When monthly issuance gets cut in half in April to 13,500 #Bitcoin. If demand stays the same, it outpaces issuance by a factor of 4. Market will find an equilibrium most likely… https://t.co/FZOWsa8AGR pic.twitter.com/yn4lsF3cPG — James Van Straten (@jvs_btc) February 6, 2024 As Straten points out, if the demand were to stay elevated at the same levels when the halving takes place, it would see demand exceed supply by a factor of four. This will cause a shift in the market, which will have to “find an equilibrium most likely higher.” In other words, prices would have to go up to keep up with the demand. BTC price recovers from crash &#124; Source: BTCUSD on Tradingview.com Targets For BTC Price In 2024 Another bullish factor for the Bitcoin price is that the halving year coincides with the United States presidential elections. As Markus Thielen, Head of Research at Matrixport, pointed out in an analysis, this coincidence has always been bullish for the price. Related Reading: Dogecoin Adoption Rate Touches New ATH, But Why Is This AI Bearish On DOGE Price? The report points back to the previous halving and election years, which show the price of Bitcoin ending on a high note. The last three halving years have seen BTC rise 152% in 2012, 121% in 2016, and 302% in 2020, showing a consistent trend. With the year 2024 being another halving and election year, the research analyst expects that the price of Bitcoin will finish out the year at $70,000. This would mean another 65% rally from the current price levels, and if the trends hold, the start of another bull market. “Supported by the macro environment, monetary tailwinds, the US election cycle, and gradually increasing demand from TradeFi investors allocating to Bitcoin ETFs, a Bitcoin rally to 70,000 appears plausible,” Thielen said. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Bitcoin News, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-06T23:01:03.000Z",
    "title": "MetaMask Users Can Now Get Crypto From Robinhood via New Integration Update",
    "url": "https://dailyhodl.com/2024/02/06/metamask-users-can-now-get-crypto-from-robinhood-via-new-integration-update/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/metamask-wallet-that-allows.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/metamask-wallet-that-allows.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/metamask-wallet-that-allows.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/metamask-wallet-that-allows.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/metamask-wallet-that-allows.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/metamask-wallet-that-allows.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/metamask-wallet-that-allows.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Blockchain software leader Consensys is partnering with trading platform Robinhood to integrate Robinhood Connect with MetaMask, the most popular web3 wallet. According to a new press release, the partnership allows MetaMask users to seamlessly purchase crypto assets directly within the wallet using Robinhood&#8217;s order engine. The announcement says that the collaboration represents MetaMask&#8217;s ongoing effort [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/06/metamask-users-can-now-get-crypto-from-robinhood-via-new-integration-update/\">MetaMask Users Can Now Get Crypto From Robinhood via New Integration Update</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]