[
  {
    "source": "Cointelegraph",
    "date": "2023-09-22T08:20:00.000Z",
    "title": "Bitcoin blasts past its 2021 all-time high in Argentina, but hyperinflation outpaces gains",
    "url": "https://cointelegraph.com/news/bitcoin-all-time-high-argentina-hyperinflation-outpaces-gains",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/aba7a719-8542-4a07-9cb0-81a80613f96c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin’s 150% gains over the last two years in Argentine pesos is no match for the country’s 300% inflation in the period.</p>\n                    <p><p>Argentina has grappled with hyperinflation for several decades due to failed policies that have led to budget deficits. As time marches on, the likelihood of Argentina — home to 47 million people — facing a full-scale currency collapse looms. But what are the prospects for increased adoption of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), given its outstanding track record when priced in the local Argentine peso currency?</p><p>Throughout its history, the Argentine government has frequently resorted to inflating the money supply through bank deposits or government bonds. Notably, Argentina’s aggregate money supply M1 — comprising currency, demand deposits and other checkable deposits — has surged from 2.81 trillion pesos in July 2019 to a staggering 10.66 trillion pesos, marking a 277% increase over three years.</p><h2>What happened to Bitcoin’s price in Argentine pesos?</h2><p>Bitcoin’s price on domestic exchanges has soared to 19.6 million Argentine pesos, up from 14.2 million when BTC reached its all-time high in United States dollars in November 2021. This means that despite a 61.5% drop from $69,000, investors in Argentina have still managed to accrue gains of 38% when measured in the local currency.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/0d65f95a-4f09-4ea2-beba-3d16fda2e575.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin price in pesos at Bitso exchange. Source: Bitso</em></figcaption></figure><p>However, one may encounter a different result when consulting Google or CoinMarketCap for Bitcoin’s price in pesos. The answer to this discrepancy lies in the official currency rate for the Argentine peso, which is more intricate than most investors are accustomed to. </p><p>To begin with, there is the official rate, known as the “dollar BNA,“ set by Argentina’s central bank and used for all government transactions, as well as for imports and exports.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/733673b4-704c-4660-a470-e53e9f7c753f.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin price in pesos on Sept. 21. Sources: Google, Ripio, Bitso.</em></figcaption></figure><p>Observe how the Bitcoin price in Argentine pesos, as effectively traded on cryptocurrency exchanges, is nearly double Google’s theoretical price. </p><p>This theoretical price is calculated by multiplying the BTC price on North American exchanges in U.S. dollars by the official Argentine peso rate provided by the local government. This phenomenon is not unique to cryptocurrencies; it also affects other highly liquid international assets, such as stocks, gold and oil futures.</p><p>By artificially strengthening the official rate in favor of the Argentine peso, the government aims to stabilize the economy, reduce capital flight, and curb speculative trading by making it more expensive to purchase foreign currency and store wealth in U.S. dollars. This measure may also increase the cost of imports while boosting exports, with the goal of improving the trade balance.</p><p><em><strong>Related: <a href=\"https://cointelegraph.com/news/bitcoin-hits-record-highs-in-argentina-as-javier-milei-wins-primary\">Bitcoin soars in Argentina as Javier Milei wins presidential primary</a></strong></em></p><p>However, manipulating the official foreign exchange rate, as seen in Argentina’s case, ultimately contributes to inflation and impedes economic growth. Firstly, it creates incentives for the existence of an unofficial and unregistered market, known as the “dollar blue,” which also fosters illegal activities, undermines financial transparency and discourages foreign investment.</p><p>This leads to varying exchange rates, depending on the market in which the transaction occurs and whether or not it involves the government and official banks.</p><h2>Is Bitcoin a reliable store of value for investors in Argentina?</h2><p>According to Bitso exchange prices in Argentine pesos, Bitcoin has gained 150% over the two years ending Sept. 21, moving from 7.84 million pesos to 16.6 million pesos. However, the accumulated official inflation rate during this period has exceeded 300%, making it incorrect to claim that Bitcoin has been a dependable store of value.</p><p>Notably, those who opted for U.S. dollars, whether in the traditional form or stablecoins, have seen their holdings increase by 297% during the same period, effectively matching the inflation rate. This analysis exclusively compares the two-year period between September 2021 and September 2023.</p><p>Nonetheless, the outcome is somewhat disappointing for BTC proponents, and is likely to favor the adoption of stablecoins in the region. </p><p>On a positive note, investors have had the opportunity to learn about the advantages of <a href=\"https://cointelegraph.com/innovation-circle/understanding-crypto-custody-what-different-solutions-entail-for-investors-and-businesses\">self-custody</a> and <a href=\"https://cointelegraph.com/learn/bitcoin-and-inflation-everything-you-need-to-know\">scarcity</a>, given that the local currency has been decimated by its continuously inflating supply.</p><p>In the end, for Argentinians, as long as the U.S. dollar maintains its purchasing power by keeping pace with local inflation, there is little room for Bitcoin to become the preferred store of value.</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-22T08:19:21.000Z",
    "title": "Bitcoin Has Potential To Create ‘Energy-Abundant Future’ New Report Concludes",
    "url": "https://cryptoslate.com/bitcoin-to-create-energy-abundant-future-new-report-indicates/",
    "description": "<p>The growing intersection of Bitcoin and the energy industry is unveiling various unexpected opportunities that could potentially facilitate global energy transition, according to a report by Dylan Campbell and Alexander Larsen of IRM Energy and Renewables Group (SIG). The authors of the new paper entitled &#8220;Bitcoin and the Energy Transition: From Risk to Opportunity&#8221; argue [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-to-create-energy-abundant-future-new-report-indicates/\">Bitcoin Has Potential To Create &#8216;Energy-Abundant Future&#8217; New Report Concludes</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-22T08:36:31.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-22T08:19:05.000Z",
    "title": "Venture capitalist: blockchain is not ready for mainstream gaming",
    "url": "https://crypto.news/venture-capitalist-blockchain-is-not-ready-for-mainstream-gaming/",
    "description": "Colleen Sullivan of Brevan Howard Asset Management underscores blockchain's current limitations in supporting large-scale, high-quality video games"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-22T08:20:38.000Z",
    "title": "ASO Bullish Cross Reveals Bull Run Start For XRP: Crypto Analyst",
    "url": "https://www.newsbtc.com/analysis/xrp/aso-bullish-cross-bull-run-start-xrp-crypto-analyst/",
    "description": "Renowned crypto analyst EGRAG Crypto has unveiled a fresh XRP price prediction, introducing the community to a less-known indicator, the &#8220;Average Sentiment Oscillator&#8221; or ASO. Commenting on its significance, EGRAG explained on Twitter today: &#8220;Exciting ASO Update Alert! Check out the post from September 9th to witness the impressive ascent and curve of the bullish trend! The momentum is ablaze, with an unstoppable surge toward that coveted bullish cross! #XRPArmy, HOLD STEADY! The imminent ASO bullish cross is the spark that will ignite the upcoming XRP bull run!&#8221; Here&#8217;s When The Next XRP Bull Run Could Start From the chart presented by EGRAG, the convergence of the blue line (representing bulls) and the red line (representing bears) is evident. By demarcating a yellow box on this chart, EGRAG anticipates the bullish crossover to manifest between the conclusion of 2023 and the commencement of the second half of 2024. Historical data reveals that XRP has already undergone this bullish crossover on two prior occasions. The first, in 2017, witnessed a meteoric 55,000% rise in XRP&#8217;s price. The subsequent occurrence, spanning late 2020 to April 2021, saw XRP appreciate by a commendable 1500%. EGRAG underscores the magnitude of the current situation by noting the presence of &#8220;the largest jaw&#8221; ever, leading to speculation that the ensuing XRP rally could dwarf previous ones. Related Reading: XRP Price Poised For A 250% Surge, Analyst Points To This Key Catalyst EGRAG&#8217;s September update brought substantial insights, underscoring the notable shift in the ASO and the build-up of undeniable momentum towards the bullish cross. In his words, &#8220;there&#8217;s an undeniable momentum building towards that coveted bullish cross.&#8221; First, EGRAG had outlined the oscillator&#8217;s remarkable potential in March, describing it as the harbinger of a monumental bullish setup, showcasing the depth of market volatility and the contrasting strength/weakness of an asset. He emphasized, &#8220;The Mother of all #Bullish Set-Ups is upon us,&#8221; pointing to the impressive setups building in both the 3 Weeks Time Frame (TF) and Monthly TF. A Deep Dive Into ASO The ASO serves as a momentum oscillator, providing averaged percentages of bull/bear sentiment. This tool is recommended for accurately gauging the sentiment during a specific candle period, aiding in trend filtering or determining entry/exit points. Related Reading: Ripple Stirs Debate By Shuffling $260 Million In XRP: What’s Behind The Move? Conceptualized by Benjamin Joshua Nash and adapted from the MT4 version, the ASO employs two algorithms. While the first algorithm evaluates the bullish/bearish nature of individual bars based on OHLC prices before averaging them, the second assesses the sentiment percentage by considering a group of bars as a single entity. The ASO displays Bulls % with a blue line and Bears % with a red line. The dominance of sentiment is represented by the elevated line. A crossover at the 50% centreline indicates a power shift between bulls and bears, offering potential entry or exit points. This is particularly efficacious when the average volume is significant. Further insights can be derived by observing the strength of trends or swings. For instance, a blue peak surpassing its preceding red one. Any divergence, like a second bullish peak registering reduced strength on the oscillator but ascending in the price chart, is clearly visible. By setting thresholds at the 70% and 30% marks, the oscillator can function similarly to Stochastic or RSI for trading overbought/oversold levels. As with many indicators, a shorter period provides advanced signals while a longer period reduces the likelihood of false alerts. At press time, XRP traded at $0.5097. Featured image from ShutterStock, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-22T08:28:43.000Z",
    "title": "This is the BIGGEST Crypto Narrative For BULLRUN",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/this-is-the-biggest-crypto-narrative-for-bullrun/",
    "description": "<p>Privacy and decentralization in Web3 are coming back in a big, big way. For some of us, it never left. But if you are coming back around to it, then welcome. We need you. To keep Web3 from unraveling into just a blockchain version of Web 2.0, we need privacy. And privacy matters. You should [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/this-is-the-biggest-crypto-narrative-for-bullrun/\">This is the BIGGEST Crypto Narrative For BULLRUN</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-22T08:33:25.000Z",
    "title": "Stop the SEC Now: Binance CEO CZ Runs to Court to Dismiss SEC Suit",
    "url": "https://coinedition.com/stop-the-sec-now-binance-ceo-cz-runs-to-court-to-dismiss-sec-suit/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Changpeng-Zhao-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Changpeng-Zhao-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Changpeng-Zhao-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Changpeng-Zhao-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Changpeng-Zhao-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Changpeng-Zhao-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Changpeng-Zhao-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto exchange Binance Holdings Limited and CEO and co-founder Changpeng Zhao approached the court on Thursday to dismiss the U.S Securities and Exchange Commission (SEC) lawsuit against them, a Bloomberg report reveals. The 60-page petition filed by Binance and Zhao accused the SEC of acting beyond its authority against the two. Likewise, the filing also [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/stop-the-sec-now-binance-ceo-cz-runs-to-court-to-dismiss-sec-suit/\">Stop the SEC Now: Binance CEO CZ Runs to Court to Dismiss SEC Suit</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]