[
  {
    "source": "Cointelegraph",
    "date": "2023-10-06T01:47:13.000Z",
    "title": "SBF was ‘very resistant’ to investors on FTX board: Paradigm co-founder ",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-board-directors-matt-huang-paradigm",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/5c10b3fb-8d7a-4a2a-81ca-09ccd51146bc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Matt Huang said he was led to believe that Alameda Research was not being provided any special treatment by FTX.</p>\n                    <p><p>Sam Bankman-Fried was “very resistant” to having investors join the board of directors at FTX, claims Matthew Huang, the co-founder and managing partner of crypto investment firm Paradigm.</p><p>The sudden collapse of FTX saw more than a few investors burned, with Paradigm joining a number of venture capital firms including Sequoia, Temasek and BlackRock in funding the rise of the now-bankrupt crypto exchange. </p><p>Testifying on the third day of Bankman-Fried’s trial in a New York Federal Court, Huang claimed Bankman-Fried believed having investors on FTX's board of directors wouldn’t bring much to the table.</p><p>Huang engaged in a handful of conversations with Bankman-Fried ahead of Paradigm making a $125 million investment in the exchange’s staggering $900 million Series B funding round it closed in July 2021. </p><p>Huang admitted to not conducting enough due diligence and that he relied too heavily on information supplied by Bankman-Fried. </p><p>Despite being concerned by the lack of formal structure at FTX and its potential entanglement with its sister hedge fund Alameda Research, Huang said investors were lured in by the rapid expansion of FTX's market share in the crypto industry.</p><p>Still, Huang noted he and other investors at Paradigm were concerned that Bankman-Fried may have been spending more time working on Alameda instead of FTX, a distraction that would have been at the expense of Paradigm’s investment. </p><p>Additionally, Huang noted there were concerns that Alameda may have been receiving preferential treatment from FTX. If these concerns turned out to be true Huang said he was fearful of the reputation damage it may inflict on the company. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/college-roommate-sam-bankman-fried-ftx-8b-hole\"><strong><em>College roommate talked to Sam Bankman-Fried about FTX’s $8B hole on a paddle tennis court: Trial</em></strong></a></p><p>Huang said he was led to believe by Bankman-Fried that Alameda was not being provided with any privileged treatment by FTX. The same day, FTX co-founder Gary Wang <a href=\"https://cointelegraph.com/news/alameda-research-withdraw-unlimited-funds-gary-wang\">testified that Alameda was given access to a near-unlimited flow of capital</a> from the exchange. </p><p>Additionally, Huang said he had no knowledge of the alleged commingling of funds between FTX and Alameda Research. </p><p>The prosecution asked Huang if his decision to invest in FTX would’ve changed if he’d been told the exchange was allegedly using customer deposits for investment purposes.</p><p>“Yes,” Huang replied. “It's generally understood that customer deposits are sacred.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-06T02:00:53.000Z",
    "title": "Singapore Grants Ripple Full License to Provide Crypto Services",
    "url": "https://news.bitcoin.com/singapore-grants-ripple-full-license-to-provide-crypto-services/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/ripple-singapore-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Singapore Grants Ripple Full License to Provide Crypto Services\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/ripple-singapore-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ripple-singapore-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ripple-singapore-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ripple-singapore-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ripple-singapore-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ripple-singapore-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ripple-singapore.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Monetary Authority of Singapore (MAS) has granted Ripple a full license to provide crypto services. &#x201C;This license underscores the real-world utility of crypto solutions for businesses and financial institutions alike, marking an important step towards wider adoption of digital assets,&#x201D; Ripple explained. Ripple Fully Licensed in Singapore Ripple announced Tuesday that it is now [&#8230;]"
  }
]