[
  {
    "source": "Crypto Daily",
    "date": "2023-12-17T14:20:24.000Z",
    "title": "Top Cryptos To Buy Before The Next Bull Run",
    "url": "https://cryptodaily.co.uk/2023/12/top-cryptos-to-buy-before-the-next-bull-run",
    "description": "Explore the most promising cryptocurrencies to invest in before the next bull run. Our in-depth analysis covers emerging coins, market trends, and investment strategies to help you capitalize on the next big crypto surge"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-17T14:38:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-17T14:32:07.000Z",
    "title": "Breakthrough “BrainGPT” Technology Transforms Thoughts into Text on Screen",
    "url": "https://www.cryptopolitan.com/breakthrough-braingpt-technology-transforms/",
    "description": "In a groundbreaking development, researchers at the University of Technology Sydney&#8217;s GrapheneX-UTS Human-centric Artificial Intelligence Centre have achieved a major milestone in the realm of mind-reading technology. Their pioneering effort involves the direct translation of raw EEG waves into language, leading to thoughts being transformed into words displayed on a screen. This remarkable achievement represents [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-17T14:25:52.000Z",
    "title": "AI Companies Forge Media Partnerships: What’s the Motive Behind It?",
    "url": "https://www.cryptopolitan.com/ai-companies-forge-media-partnerships/",
    "description": "In recent developments, AI firm OpenAI has signed a multiyear licensing deal with Axel Springer, a prominent German media conglomerate. This partnership, worth tens of millions of Euros, is set to enrich the user experience of OpenAI&#8217;s ChatGPT by providing authoritative content summaries from various global news sources. This collaboration is indicative of a trend [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-17T14:19:59.000Z",
    "title": "Meta Unveils Multimodal AI Upgrade for Ray-Ban Smart Glasses",
    "url": "https://www.cryptopolitan.com/meta-unveils-multimodal-ai-upgrade-for-ray-ban-smart-glasses/",
    "description": "Meta (NASDAQ: META) has announced a significant enhancement to their Ray-Ban smart glasses, introducing a suite of multimodal artificial intelligence features that aim to provide users with innovative ways to interact with and understand their surroundings. This upgrade leverages the glasses&#8217; capabilities to process environmental data through integrated cameras and microphones, offering users contextual information [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-17T14:30:00.000Z",
    "title": "PEPE and Dogecoin enthusiasts monitoring new crypto presale token",
    "url": "https://crypto.news/pepe-and-dogecoin-enthusiasts-monitoring-new-crypto-presale-token/",
    "description": "PEPE and Dogecoin enthusiasts have been looking at Rebel Satoshi, a crypto presale, that aims to reshape the meme coin scene"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-17T14:25:32.000Z",
    "title": "Top cryptocurrencies to watch this week: XRP, ADA, SHIB",
    "url": "https://crypto.news/top-cryptocurrencies-to-watch-this-week-xrp-ada-shib/",
    "description": "As the global market cap dropped in valuation, top cryptocurrencies XRP, Cardano (ADA) and Shiba Inu (SHIB) took center stage with mixed price actions."
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-17T14:24:00.000Z",
    "title": "Crypto Community Divided Over SEC Use of “Crypto Asset Securities”",
    "url": "https://coinedition.com/crypto-community-divided-over-sec-use-of-crypto-asset-securities/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/SEC-5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/SEC-5.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/SEC-5-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/SEC-5-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/SEC-5-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/SEC-5-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Prominent figures in the crypto community, like Ripple CTO and pro-crypto lawyer Bill Morgan, recently debated the U.S. SEC’s blanket usage of terms like &#8220;crypto asset securities&#8221; and &#8220;crypto securities markets.” Bill Morgan sparked the conversation, criticizing the SEC’s use of those terms, claiming it was agenda-driven propaganda. According to Morgan, the terms are not [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/crypto-community-divided-over-sec-use-of-crypto-asset-securities/\">Crypto Community Divided Over SEC Use of “Crypto Asset Securities”</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]