[
  {
    "source": "Cointelegraph",
    "date": "2023-11-22T14:30:00.000Z",
    "title": "This is your brain on crypto: Substance abuse grows among crypto traders",
    "url": "https://cointelegraph.com/magazine/crypto-substance-abuse-traders-trading/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/magazine-Mitch-Trader-mental-health-feature-scaled.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>What is it about crypto trading that can make some users susceptible to substance abuse, and how can they get help?</p>\n                    <p><p><br><strong>Although documented statistics about cryptocurrency trading and substance abuse are hard to come by, addiction experts are treating an increasing number of crypto traders. <br></strong><br>Abdullah Boulard, founder and CEO at The Balance Luxury Rehab, tells Magazine that a number of crypto traders struggle with substance abuse. Our client base is diverse, but this is a unique demographic that weve seen an increase in over the recent years, Boulard says. </p><p>According to Boulard, the high intensity of cryptocurrency trading combined with 24/7 accessibility encourages some to use stimulants to keep up the pace. Substances like amphetamines, cocaine and even excessive caffeine use are common among these individuals, says Boulard. </p><p>Caroline Ellison, the former CEO of Alameda Research, tweeted about the use of stimulants in April 2021.</p><figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\"><blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">nothing like regular amphetamine use to make you appreciate how dumb a lot of normal, non-medicated human experience is</p>— Caroline (@carolinecapital) <a href=\"https://twitter.com/carolinecapital/status/1379036346300305408?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >April 5, 2021</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></figure><p><br>New York Magazine subsequently <a href=\"https://nymag.com/intelligencer/2022/11/caroline-ellison-alameda-ftx.html\" target=\"_blank\" rel=\"nofollow\" >reported</a> that a successful trader who met with Ellison commented about her use of stimulants and their overall effects on members of the community. Crypto really fucked with a lot of peoples perceptions of money. A lot of stuff doesnt feel real. And if you add speed </p><p>Prior to that, in September 2019, the former CEO of disgraced cryptocurrency exchange FTX, Sam Bankman-Fried, tweeted about his use of stimulants and sleeping pills.</p><figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\"><blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">a) stimulants when you wake up, sleeping pills if you need them when you sleep.<br>b) be mindful of where your headspace is: I often nap in the office so that my mind doesn&#39;t leave work mode in between shifts.</p>— SBF (@SBF_FTX) <a href=\"https://twitter.com/SBF_FTX/status/1173351344159117312?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >September 15, 2019</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></figure><h2 class=\"wp-block-heading\" id=\"h-what-goes-up-must-come-down\"><strong>What goes up, must come down</strong></h2><p>Boulard also sees a lot of patients who use benzodiazepines. Street-named downers or benzos, benzodiazepines include commonly used drugs like Xanax, Valium and Ativan.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"http://cointelegraph.com/magazine/wp-content/uploads/2023/11/image4.jpg\" alt=\"\" class=\"wp-image-25792\" width=\"722\" height=\"470\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/image4.jpg 912w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/image4-300x195.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/image4-770x502.jpg 770w\" sizes=\"(max-width: 722px) 100vw, 722px\" /><figcaption class=\"wp-element-caption\"><em>5mg pills of Xanax. (U.S. DEA)</em></figcaption></figure><p>He believes that traders use these prescription drugs to cope with anxiety and insomnia, symptoms likely created by the highs and lows of trading and by the use of the stimulants. Boulard says that alcohol is used for the same purpose. </p><p>Dr. Lawrence Weinstein, chief medical officer at American Addiction Centers agrees. Weinstein tells Magazine, Alcohol use disorder is also common among those with a gambling disorder, of which cryptocurrency trading is a subtype.</p><p>Although some patients who have come through Weinsteins programs dont necessarily meet the clinical diagnostic criteria for a gambling disorder, they do have a history of cryptocurrency trading experience and typically present with an alcohol use disorder, stimulant use disorder or both.</p><h2 class=\"wp-block-heading\" id=\"h-what-s-the-link\"><strong>Whats the link?</strong></h2><p><a href=\"https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/\" target=\"_blank\" rel=\"nofollow\" >Cryptocurrency trading addiction</a> is increasingly becoming a problem for some members of the community. According to Weinstein, compulsive trading addiction and substance abuse can go hand in hand. Behavioral addictions and substance addictions have a lot of overlap in terms of risk factors, but especially from a neurobiological standpoint, Weinstein says. </p><p>A 2022 case study authored by Dr. Harun Olcay Sonkurt of Anadolu Hospital in Turkey <a href=\"https://hrcak.srce.hr/file/443600\" target=\"_blank\" rel=\"nofollow\" >presents</a> a 30-year-old research student addicted to cryptocurrency trading and alcohol. The student started out trading Bitcoin and soon added altcoins to his portfolio. After just a few months, he started to trade margins and subsequently lost more than two years worth of his salary. Unable to stop or control his trading, the student struggled with restlessness and anger. His mind was constantly focused on price fluctuations and trades. </p><p>Since he experiences intense anxiety in trades with high leverage, he drinks alcohol before the trade, Sonkurt writes. </p><h2 class=\"wp-block-heading\" id=\"h-what-happens-to-the-brain\"><strong>What happens to the brain? </strong></h2><p>Weinstein believes that behaviors like cryptocurrency trading can cause increases and decreases in the neurotransmitter dopamine, just like alcohol and some drugs. <a href=\"https://www.webmd.com/mental-health/what-is-dopamine\" target=\"_blank\" rel=\"nofollow\" >Dopamine</a> is a chemical messenger that the body produces and that the nervous system uses to send messages between cells. </p><p>The activation of the brains reward system by the neurotransmitter dopamine is a significant factor in the development of an addiction. A dopamine spike caused by the use of a substance (or performance of a behavior) helps reinforce that enjoyable feeling by creating a link between the thing that elicits that feeling with the desire to do it again, Weinstein says.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/who-takes-gold-in-crypto-blockchain-olympics/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Who takes gold in the crypto and blockchain Olympics?</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/defying-obsolescence-how-blockchain-tech-could-redefine-artistic-expression/\" class=\"article-suggest__subtitle display4\">                            <span>Art Week</span>                            <p>Defying Obsolescence: How Blockchain Tech Could Redefine Artistic Expression</p>                        </a>                    </div></div></div><p>According to Weinstein, a dopamine spike is followed by a crash. When this happens repeatedly, the extensive neurocircuitry involved with the brains reward system can be damaged, which eventually negatively affects other areas of the brain. </p><p>The brains habit-forming center and the area responsible for impulse control, as well as the section controlling feelings of uneasiness, irritability and anxiety, are all affected. These are also three regions of the brain that play a key role in the development of addiction, says Weinstein. </p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"http://cointelegraph.com/magazine/wp-content/uploads/2023/11/image1.jpg\" alt=\"\" class=\"wp-image-25794\" width=\"579\" height=\"570\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/image1.jpg 800w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/image1-300x295.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/11/image1-770x757.jpg 770w\" sizes=\"(max-width: 579px) 100vw, 579px\" /><figcaption class=\"wp-element-caption\"><em>Areas of the human brain that are especially important in addiction. (U.S. Department of Health and Human Services)</em></figcaption></figure><p>Chronic behaviors like addictive crypto trading and the use of substances alter brain circuitry and cause pathological changes. Weinstein says that at this point, individuals no longer have the element of choice. The brain has created new neural connections, and the individual requires the substance to function normally.</p><p>If someone with a severe alcohol use disorder were to suddenly cease consumption, they run the very real risk of dying because the body has become so dependent on the substance. Ive seen many patients compare their time in active addiction to starvation  its not a choice or a want; its a need. They arent waking up every day choosing to remain addicted to a substance, Weinstein says.</p><h2 class=\"wp-block-heading\" id=\"h-money-doesn-t-make-it-any-better\"><strong>Money doesnt make it any better</strong></h2><p>Although some cryptocurrency traders who struggle with substance abuse lose it all, some are very successful. Disciplined, experienced traders can make a lot of money very quickly. Even newbies can strike it rich for a little while if they bet on the right coin. </p><p>The student in Sonkurts study says that he finds it thrilling to earn the same amount of money as he earns by working for months with high leverage in minutes.</p><p>Boulard believes that access to vast financial resources can exacerbate substance abuse if it remains untreated, and Weinstein says that having the means to sustain an addiction indefinitely can make it worse and prolong it.<br><br>He suggests that being able to acquire a chosen substance with ease disincentivizes stopping, all the while mitigating many of the addictions negative consequences. </p><p>Aside from eliminating access to funds, and potentially access to the addictive substance or activity, there may be very few other avenues that would motivate the individual to seek help for their addiction, Weinstein says. The speedy acquisition of wealth can be disorienting, can lead to lifestyle changes and can create pressures that make them more prone to substance abuse, Boulard adds.</p><h2 class=\"wp-block-heading\" id=\"h-what-does-treatment-look-like\"><strong>What does treatment look like?</strong></h2><p>Boulard tailors treatment to the individual. Usually, this includes detoxification and psychotherapy. He integrates holistic therapies like mindfulness training, yoga and dietary adjustments. </p><p>We also incorporate financial counseling and educate our clients about healthier trading habits, Boulard says.</p><p>Weinstein tells Magzine that CBT or cognitive behavioral therapy is the most common form of therapy used in the treatment of process or behavioral addictions. This form of therapy helps individuals identify certain situations that can be triggering and utilize the coping skills theyve developed through therapy to prevent a relapse in the addictive behavior. </p><p>He feels that Its very likely that someone with a behavioral addiction has a co-occurring mental health condition. Properly and professionally treating both would yield the best outcomes.</p><p><a href=\"https://nida.nih.gov/sites/default/files/podat-3rdEd-508.pdf\" target=\"_blank\" rel=\"nofollow\" >According</a> to the National Institute of Health, people addicted to drugs often suffer from other health, legal, familial or social problems that must be addressed simultaneously. The NIH says that the best programs provide a combination of therapies and other services to meet an individual patients needs.</p><h2 class=\"wp-block-heading\" id=\"h-is-it-possible-to-treat-yourself\"><strong>Is it possible to treat yourself?</strong></h2><p>Boulard advises against it. Although its not impossible to beat an addiction on your own, long-term outcomes may be less likely.</p><p>While its theoretically possible to overcome addiction without formal treatment, professional help dramatically improves success rates and reduces the likelihood of relapse, Boulard says.</p><p><a href=\"https://nida.nih.gov/videos/why-are-drugs-so-hard-to-quit\" target=\"_blank\" rel=\"nofollow\" >According</a> to the National Institute on Drug Abuse, there are strong associations between drugs and related cues. When someone tries to stop using drugs, stressful experiences may lead to cravings and drug use again. Returning to use after stopping, or relapse, is not uncommon. And, like addiction itself, its not a sign of weakness, says NIDA.</p><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.7\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-22T14:24:49.000Z",
    "title": "Market reacts to Binance news as short-term Bitcoin holders cash out",
    "url": "https://cryptoslate.com/insights/market-reacts-to-binance-news-as-short-term-bitcoin-holders-cash-out/",
    "description": "<p>Quick Take The recent news about CZ and Binance triggered significant sell pressure on Bitcoin, marking a distinctive shift in the behavior of long-term and short-term Bitcoin holders. Long-term holders who have held Bitcoin for over 155 days sold approximately $100 million worth of Bitcoin to exchanges. This sale ranked among this cohort&#8217;s top 10 [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/market-reacts-to-binance-news-as-short-term-bitcoin-holders-cash-out/\">Market reacts to Binance news as short-term Bitcoin holders cash out</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-11-22T14:30:00.000Z",
    "title": "This is your brain on crypto: Substance abuse grows among crypto traders",
    "url": "https://cointelegraph.com/magazine/crypto-substance-abuse-traders-trading/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/11/magazine-Mitch-Trader-mental-health-feature-scaled.jpg\"></p><p>What is it about crypto trading that can make some users susceptible to substance abuse, and how can they get help?</p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-22T14:30:08.000Z",
    "title": "The SEC Calls Solana (SOL) a Security Once More – Celestia (TIA) and Everlodge (ELDG) Prices Moon",
    "url": "https://cryptodaily.co.uk/2023/11/the-sec-calls-solana-sol-a-security-once-more-celestia-tia-and-everlodge-eldg-prices-moon",
    "description": "Among the standout cryptocurrency players making headlines recently are Solana (SOL) and Celestia (TIA). However, one project in its presale run could outshine them both"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-22T14:40:35.000Z",
    "title": "Binance’s lax controls gave Hamas, ISIS, and Al-Qaida room to trade BTC – Here are the details",
    "url": "https://www.cryptopolitan.com/binance-gave-hamas-isis-room-to-trade-btc/",
    "description": "According to a Bloomberg report, Binance Holdings Ltd. has made top news in crypto trading as new developments, such as lax controls, have been witnessed over digital currency transactions.&#160; As the matter evolves, reports have it that crypto transactions between terrorists and hackers, and even sanction violators, have employed Binance for a long time and ... <a title=\"Binance&#8217;s lax controls gave Hamas, ISIS, and Al-Qaida room to trade BTC &#8211; Here are the details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-gave-hamas-isis-room-to-trade-btc/\" aria-label=\"More on Binance&#8217;s lax controls gave Hamas, ISIS, and Al-Qaida room to trade BTC &#8211; Here are the details\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-22T14:14:42.000Z",
    "title": "Steam Deck with a 2TB SSD for Just $152 Available on Black Friday Deal",
    "url": "https://www.cryptopolitan.com/steam-deck-with-a-2tb-ssd-for-just-152-available-on-black-friday-deal/",
    "description": "If you&#8217;ve recently purchased a Steam Deck and found yourself craving more storage space, this Black Friday deal is here to save the day. Team Group&#8217;s MP44S 2TB M.2 2230 SSD offers an affordable and convenient solution to boost your Steam Deck&#8217;s storage capacity. The Steam Deck Storage Challenge When Valve launched the Steam Deck, ... <a title=\"Steam Deck with a 2TB SSD for Just $152 Available on Black Friday Deal\" class=\"read-more\" href=\"https://www.cryptopolitan.com/steam-deck-with-a-2tb-ssd-for-just-152-available-on-black-friday-deal/\" aria-label=\"More on Steam Deck with a 2TB SSD for Just $152 Available on Black Friday Deal\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-22T14:18:32.000Z",
    "title": "Justin Sun’s cryptocurrency venture loses over $100m in recent hack",
    "url": "https://crypto.news/justin-suns-cryptocurrency-venture-loses-over-100m-in-recent-hack/",
    "description": "In a Nov. 22 post from the cybersecurity firm Cyvers Alerts, it was reported that a suspicious address received $12.4 million from HTX exchange. At the same time, another address accumulated approximately $85 million from HECO Chain bridge, both linked&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-22T14:18:13.000Z",
    "title": "Empowering Privacy: SEDIMARK Adopts IOTA Tangle DLT for User-Controlled Digital Identities",
    "url": "https://www.crypto-news-flash.com/empowering-privacy-sedimark-adopts-iota-tangle-dlt-for-user-controlled-digital-identities/?utm_source=rss&utm_medium=rss&utm_campaign=empowering-privacy-sedimark-adopts-iota-tangle-dlt-for-user-controlled-digital-identities",
    "description": "<img width=\"1000\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-IOTA-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-IOTA-2.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-IOTA-2-300x203.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-IOTA-2-768x518.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-IOTA-2-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />SEDIMARK has officially rolled out its decentralized data marketplace on the IOTA Tangle Distributed Ledger Technology, marking a significant advancement in the digital identity space. SEDIMARK&#8217;s adoption of the Self-Sovereign Identity (SSI) model represents a paradigm shift in digital identity management within the decentralized data marketplace. Full decentralized data Marketplace SEDIMARK recently went live with [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-22T14:35:00.000Z",
    "title": "Binance CEO Richard Teng Highlights Business Strength Amidst $4B Settlement",
    "url": "https://coinedition.com/binance-ceo-richard-teng-highlights-business-strength-amidst-4b-settlement/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/23_Binance_Coin_Forms_a_Bullish_Pennant_on_the_50_period_MA_a_Bullish-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/23_Binance_Coin_Forms_a_Bullish_Pennant_on_the_50_period_MA_a_Bullish-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/23_Binance_Coin_Forms_a_Bullish_Pennant_on_the_50_period_MA_a_Bullish-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/23_Binance_Coin_Forms_a_Bullish_Pennant_on_the_50_period_MA_a_Bullish-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/23_Binance_Coin_Forms_a_Bullish_Pennant_on_the_50_period_MA_a_Bullish-2-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/23_Binance_Coin_Forms_a_Bullish_Pennant_on_the_50_period_MA_a_Bullish-2-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/23_Binance_Coin_Forms_a_Bullish_Pennant_on_the_50_period_MA_a_Bullish-2-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In the wake of the recently unveiled $4.3 billion settlement between Binance and U.S. authorities, the newly appointed CEO, Richard Teng, took to Twitter to assert the cryptocurrency exchange&#8217;s financial standing. Teng&#8217;s comments were in response to a statement by Coinbase Director Conor Grogan, who had dissected Binance Corporate&#8217;s crypto holdings and suggested the company [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/binance-ceo-richard-teng-highlights-business-strength-amidst-4b-settlement/\">Binance CEO Richard Teng Highlights Business Strength Amidst $4B Settlement</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]