[
  {
    "source": "Cointelegraph",
    "date": "2023-10-19T21:22:07.000Z",
    "title": "SEC moves to dismiss lawsuit against Ripple's Brad Garlinghouse and Chris Larsen",
    "url": "https://cointelegraph.com/news/sec-dismiss-lawsuit-brad-garlinghouse-chris-larsen",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/cc4e7a8e-7b2c-4bff-854b-e81cca812dcb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The civil lawsuit against the Ripple executives had been ongoing since December 2020.</p>\n                    <p><p>Lawyers representing the United States Securities and Exchange Commission announced they will seek to dismiss all claims against Ripple CEO Brad Garlinghouse and co-founder Chris Larsen.</p><p>In an Oct. 19 filing in U.S. District Court for the Southern District of New York, the SEC notified the court the parties involved in its case against Ripple “have stipulated to the dismissal with prejudice”, suggesting there was no need to schedule an upcoming trial. The filing did not state that the SEC was dropping its civil case against Ripple itself, first filed in December 2020.</p><p>“The SEC and Ripple intend to meet and confer on a potential briefing schedule with respect to the pending issue in the case—what remedies are proper against Ripple for its Section 5 violations with respect to its Institutional Sales of XRP—and respectfully request until November 9, 2023 to propose such schedule to the Court or, if the parties cannot agree, to seek a briefing schedule from the Court on a contested basis,” said the filing.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-19T21:16:34.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Cryptocurrency mixers may soon be classified as money-laundering hubs in the United States. Meanwhile, New York's attorney general has filed a lawsuit against Gemini, Genesis, and DGC for allegedly defrauding investors through the Gemini Earn investment program, and Lightning Labs has released the mainnet alpha of Taproot Assets.</p><h3>U.S. Treasury to designate crypto mixers as money-laundering services</h3><p>The United States Treasury Department plans to <a href=\"https://cointelegraph.com/news/us-treasury-crypto-mixers-money-laundering\">expand its sanctions</a> against so-called cryptocurrency mixers, according to an Oct. 19 report by The Wall Street Journal. </p><p>The Treasury seeks to include cryptocurrency mixers under the broad umbrella of money-laundering hubs. Deputy Treasury Secretary Wally Adeyemo said this would enable the government to combat the use of digital assets for illicit purposes, including cyber warfare and terrorism.</p><p>Crypto was back in regulators’ crosshairs this week after Senator Warren and more than 100 other lawmakers signed a letter <a href=\"https://cointelegraph.com/news/sen-warren-100-legislators-write-white-house-treasury-crypto-terrorism\">urging the Biden administration</a> to “swiftly and categorically act to meaningfully curtail illicit crypto activity.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, Treasury imposed sanctions on ten key Hamas terrorist group members, operatives, and financial facilitators in Gaza and elsewhere as part of a continuous effort by the U.S. to root out Hamas’s sources of revenue. <a href=\"https://t.co/KZtF6K60id\">https://t.co/KZtF6K60id</a></p>&mdash; Treasury Department (@USTreasury) <a href=\"https://twitter.com/USTreasury/status/1714631536203440174?ref_src=twsrc%5Etfw\">October 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Earlier this week, the Treasury Departmnet also added <a href=\"https://cointelegraph.com/news/us-treasury-sanctions-crypto-operator-tied-hamas\">a Gaza-based crypto operator</a> to its list of Specialiy Designated Nationals.</p><h3>New York Attorney General sues Gemini, Genesis, DGC for allegedly defrauding investors</h3><p>New York’s attorney general has filed a lawsuit against cryptocurrency firms Gemini, Genesis and Digital Currency Group for allegedly defrauding investors through the Gemini Earn investment program.</p><p>An official statement from the office of attorney general Letitia James outlines the basis of the charges, claiming that the companies defrauded more than 23,000 investors, including 29,000 New York citizens of more than $1 billion.</p><p>An investigation carried out by James’ office claims that Gemini lied to investors about its Gemini Earn investment program which it ran in partnership with Genesis. It claims that while Gemini had assured investors that the program was a low-risk investment, investigations reveal that Genesis’ financials “were risky”:</p><blockquote><strong>“The lawsuit alleges that Gemini knew Genesis’ loans were undersecured and at one point highly concentrated with one entity, Sam Bankman-Fried’s Alameda, but did not reveal this information to investors.”</strong></blockquote><p>The lawsuit also charges Genesis as well as its former CEO Soichiro Moro, parent company DCG and its CEO Barry Silbert with defrauding investors by attempting to conceal more than $1.1 billion in losses.</p><p>The lawsuit looks to ban Gemini, Genesis and DCG from operating in the financial investment industry in New York as well as seeking restitution for investment and the return of “ill-gotten gains”.</p><h3>Lightning Labs releases Taproot Assets, bringing stablecoins to Bitcoin</h3><p>Bitcoin layer-2 infrastructure firm Lightning Labs has released the mainnet alpha of Taproot Assets, a protocol aimed at enabling stablecoins and real-world assets to be issued on the Bitcoin and Lightning Network.</p><p>The current version, Taproot Assets v0.3, will provide a “feature-complete developer experience” to issue, manage and explore stablecoins and other assets on the Bitcoin blockchain, <a href=\"https://lightning.engineering/posts/2023-10-18-taproot-assets-v0.3/\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Ryan Gentry, head of business development at Lightning Labs.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Announcing the first mainnet release of Taproot Assets , a protocol for assets on <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a> and Lightning.<br><br>With this release, developers can issue financial assets on-chain in a scalable manner. <br><br>Today marks a new era of multi-asset bitcoin. <a href=\"https://t.co/2cNvZSvv8v\">https://t.co/2cNvZSvv8v</a></p>&mdash; Lightning Labs⚡️ (@lightning) <a href=\"https://twitter.com/lightning/status/1714659264101253317?ref_src=twsrc%5Etfw\">October 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“With this release, developers can issue financial assets on-chain in a scalable manner,” Lightning Labs stated on Oct. 18 in a separate post. “Today marks a new era of multi-asset bitcoin.”</p><p>Gentry says the integration will extend Bitcoin’s network effects and move it one step closer toward “bitcoinizing the dollar.” He added:</p><p>“This is how we make bitcoin the global routing network for the internet of money. This is how we bitcoinize the dollar and the world's financial assets.”</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-19T21:19:10.000Z",
    "title": "Bitcoin’s 2024 Halving May Disappoint Bulls: Bloomberg Analyst",
    "url": "https://cryptobriefing.com/bitcoins-2024-halving-disappoint-bulls-bloomberg/?utm_source=feed&utm_medium=rss",
    "description": "Six months until Bitcoin's next supply halving, but a Bloomberg analyst argues the 2024 event may disappoint bulls expecting a surge."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-19T21:30:48.000Z",
    "title": "Fed’s Powell Hints at Continued Elevated Rates; Fedwatch Tool Indicates Near-Certain Hike Next Month",
    "url": "https://news.bitcoin.com/feds-powell-hints-at-continued-elevated-rates-fedwatch-tool-indicates-near-certain-hike-next-month/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/powell-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Fed&#039;s Powell Hints at Continued Elevated Rates; Fedwatch Tool Indicates Near-Certain Hike Next Month\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/powell-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/powell-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/powell-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/powell-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/powell-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/powell-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/powell-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Federal Reserve Chair Jerome Powell stressed on Thursday the U.S. central bank remains committed to bringing down inflation and will maintain restrictive monetary policy until prices cool. Speaking at the Economic Club of New York, Powell hinted that further interest rate hikes may be appropriate if price pressures persist. Powell Signals for More Monetary Tightening [&#8230;]"
  }
]