[
  {
    "source": "Cointelegraph",
    "date": "2024-02-23T21:58:55.000Z",
    "title": " Prosecutors request Changpeng Zhao surrender all passports ahead of sentencing ",
    "url": "https://cointelegraph.com/news/binance-changpeng-zhao-surrender-passports-sentencing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMjdlMjMzZTYtOWExMy00Y2NjLWE2YzUtMDBiMzc1N2ExOWY4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The government asked CZ to surrender his Canadian passport and “all other current and expired passports and travel documents” to his counsel, who was expected to oppose the motion.</p>\n                    <p><p>The United States Attorney’s Office has requested that a federal judge approve additional travel restrictions for former Binance CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/changpeng-zhao\">Changpeng “CZ” Zhao</a>. </p><p>In a Feb. 23 filing in U.S. District Court for the Western District of Washington, U.S. Attorney Tessa Gorman <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.wawd.328570/gov.uscourts.wawd.328570.63.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">requested</a> Magistrate Judge Brian Tsuchida approve a motion specifying the conditions for CZ to remain free on bail. Prosecutors asked Zhao to stay within the continental U.S. until his sentencing hearing on April 30 and give three days’ notice for any travel to allow the government to raise objections.</p><p>The U.S. Attorney’s Office asked that CZ surrender his Canadian passport and “all other current and expired passports and travel documents” to his legal team. Zhao also holds citizenship in the United Arab Emirates, where he had <a href=\"https://cointelegraph.com/news/changpeng-zhao-travel-uae-denied\">requested to travel</a> to visit family ahead of his sentencing — a motion the judge denied.</p><p><a href=\"https://cointelegraph.com/news/binance-changpeng-zhao-surrender-passports-sentencing\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2024-02-23T22:01:44.000Z",
    "title": "Pandora Token Sees Surge In Value Amidst Whales’ Accumulation",
    "url": "https://nulltx.com/pandora-token-sees-surge-in-value-amidst-whales-accumulation/",
    "description": "Pandora, an experimental token based on the ERC404 standard, has experienced a notable resurgence in trading volume and value over the past week, witnessing a remarkable 23% increase in value within the last 24 hours following a brief dip in its value. 🚨JUST IN: #PANDORA_ERC404&#39;S $PANDORA SKYROCKETS 62% WITHIN 24 [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-23T21:50:54.000Z",
    "title": "Ethereum Faces Volatility As Prices Fluctuate, Some Notable Whale Sell-off To Monitor ",
    "url": "https://nulltx.com/ethereum-faces-volatility-as-prices-fluctuate-some-notable-whale-sell-off-to-monitor/",
    "description": "Recent movements in Ethereum&#8217;s price have showcased a volatile trend, with the cryptocurrency dipping below key support levels of $3,000 and $2,920, and currently trading at $2,944. Insights from @intotheblock reveal that 1.38 million addresses collectively purchased 1.33 million ETH, amounting to $3.9 billion, at an average price of $2,984. [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-23T22:00:53.000Z",
    "title": "SingularityNET (AGIX) Rallies 128% As On-Chain Activity Heats Up",
    "url": "https://www.newsbtc.com/news/singularitynet-agix-rallies-128-on-chain-activity/",
    "description": "AI Token SingularityNET (AGIX) has recently observed a rally of 128% as on-chain data shows activity-related metrics have heated up for the coin. SingularityNET Has Seen Sharp Growth In Volume &#38; Whale Activity In a new post on X, the on-chain analytics firm Santiment has talked about how SingularityNET has fared in its underlying metrics, with its market cap more than doubling in its latest rally. In particular, the analytics firm has shared data for four of the AI token&#8217;s indicators. The chart below shows their trend over the past month. All of these metrics seem to have blown up in recent days &#124; Source: Santiment on X The first indicator on the chart is the &#8220;Transaction Volume,&#8221; which keeps track of the total amount of AGIX (in USD) involved in network transfers every day. Related Reading: Polygon Could See Bull Rally To $1.73 If This Happens: Analyst This metric tells us about the amount of activity the users on the blockchain are displaying currently. The graph shows that this metric has climbed as SingularityNET has gone through its rally. Generally, many traders must continue participating in the market for any rally to be sustainable. As the transaction volume has been rising, this is clearly what has been going on. If the volume shows any signs of cooling off, though, that&#8217;s when the coin might slow down. The second metric of interest here is the &#8220;Whale Transaction Count,&#8221; which measures the total number of transactions on the SingularityNET blockchain worth at least $1 million in value. Only the whales can make transfers so large, so this metric can provide hints about the current activity level of these humongous holders. As the chart shows, this metric has also been high recently, implying that the current transaction volume isn&#8217;t just because of smaller hands showing interest in the asset but also from these titans. AGIX&#8217;s adoption also appears to be proceeding swiftly as the &#8220;Total Amount of Holders&#8221; metric has also been climbing up recently. This indicator keeps track of the number of addresses on the network carrying a non-zero balance. Adoption is naturally a constructive sign for any cryptocurrency, as a large user base can provide a stronger foundation for sustainable moves to occur in the future. This constant influx of users would also contribute to the uptrend in the Transaction Volume. Related Reading: Ethereum Breaks Back Above $3,000, Will FOMO Lead To Top Again? Finally, Santiment has listed the &#8220;Social Dominance&#8221; in the chart, which, in short, tells us about the portion of social media talks around the top 100 cryptocurrencies that SingularityNET alone is contributing. It would appear that the coin&#8217;s mindshare on social media has also skyrocketed with its price surge. This metric may be one to keep an eye on, as excessive hype has historically been something that has led rallies to top out. AGIX Price SingularityNET is trading around the $0.76 level after its incredible run over the past week. Looks like the price of the asset has sharply gone up over the last few days &#124; Source: AGIXUSD on TradingView Featured image from Shutterstock.com, Santiment.net, chart from TradingView.com"
  }
]