[
  {
    "source": "Decrypt",
    "date": "2024-02-21T22:37:13.000Z",
    "title": "ChatGPT Went 'Off the Rails' With Wild Hallucinations, But OpenAI Says It's Fixed",
    "url": "https://decrypt.co/218434/chatgpt-off-rails-hallucinations-openai-fixed",
    "description": "Reddit and Twitter users highlighted ChatGPT’s “nonsensical” behavior Tuesday as OpenAI worked to resolve the issue."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-21T22:23:53.000Z",
    "title": " Why is Solana (SOL) price down today? ",
    "url": "https://cointelegraph.com/news/why-is-solana-sol-price-down-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTEvYTkwOWNjYWYtOTk0Ny00YTQ0LWE2NGQtYzliZmQ4MzU0MjEwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Solana price is down 13% for the week, raising concerns on whether SOL price can hold the $100 support.</p>\n                    <p><p>Solana’s native token, (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) is down 13% over the past 7 days and the drop to $101 has distanced Solana from the top 3 contenders in market capitalization. The steady decline in SOL price could lead investors to fear that the peak demand has passed for SOL as the <a href=\"https://cointelegraph.com/news/airdrop-season-protocols-offer-700m-token-airdrops-altlayer\">airdrop frenzy</a> subsides. Judging by Solana network’s activity relative to competing blockchains, the outlook favors bearish momentum.</p><p>Part of SOL’s price correction can be attributed to the negative performance of the Solana SPL tokens, including Jito (JTO), Jupiter (JUP) and Dogwifhat (WIF), respectively down by 17%, 16% and 18% since Feb. 19. Consequently, investors that were anticipating gains from potential airdrops are negatively impacted as future listings are often priced in relation to the existing alternatives.</p><p>The demand for SOL does not rely exclusively on airdrops as there are dozens of decentralized applications (DApps) already running in the network. For instance, the decentralized exchange Raydium had 172,440 active addresses in the past week alone. Similarly, the NFT marketplace Magic Eden attracted 167,930 addresses in the same period. </p><p><a href=\"https://cointelegraph.com/news/why-is-solana-sol-price-down-today\">Read more</a></p></p>\n                \n            "
  }
]