[
  {
    "source": "Cointelegraph",
    "date": "2024-01-02T17:25:00.000Z",
    "title": " OKX to enforce new FCA rules for UK users ",
    "url": "https://cointelegraph.com/news/okx-enforce-new-fca-rules-united-kingdom-users",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYzc2NTUxM2EtNDQzOC00ZDE0LWI3NTYtMzBlNTU2NmE5Njc2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Users are required to complete a series of risk assessment questionnaires before they can begin trading. </p>\n                    <p><p>Crypto exchange OKX is introducing rules for its United Kingdom-based users as part of new regulatory requirements by the country's Financial Conduct Authority (FCA).</p><p>According to the Jan. 2 <a href=\"https://www.okx.com/learn/new-fca-rules\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, starting next week, U.K. users will be required to complete an investor questionnaire to prove they understand the risks involved in buying and trading digital assets. In addition, users must complete a second questionnaire evaluating whether investing in crypto is appropriate for them. \"Those unable to complete the questionnaires or demonstrate a grasp of the risks will become ineligible to hold an OKX account,\" OKX wrote. </p><p>Cointelegraph <a href=\"https://cointelegraph.com/news/binance-okx-comply-crypto-finprom-rules-in-uk\">previously reported</a> that exchanges such as Binance and OKX have pledged to comply with new FCA rules set to take effect on Jan. 8, 2024. On Oct. 6, 2023, Binance said it launched a new domain for U.K. users and partnered with the local peer-to-peer lending platform Rebuildingsociety. </p><p><a href=\"https://cointelegraph.com/news/okx-enforce-new-fca-rules-united-kingdom-users\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-02T17:30:17.000Z",
    "title": "Long-term Bitcoin holders demonstrate market resilience with a large majority in profit",
    "url": "https://cryptoslate.com/insights/long-term-bitcoin-holders-demonstrate-market-resilience-with-a-large-majority-in-profit/",
    "description": "<p>Quick Take Bitcoin&#8217;s long-term holders, defined as those who have held the digital asset for more than 155 days, are currently experiencing overall healthy profits. According to recent data analysis, around 14.9 million Bitcoin are held by such long-term investors, roughly 76% of the circulating supply. Out of this figure, approximately 13.3 million BTC are [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/long-term-bitcoin-holders-demonstrate-market-resilience-with-a-large-majority-in-profit/\">Long-term Bitcoin holders demonstrate market resilience with a large majority in profit</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T17:37:27.000Z",
    "title": "Dollar’s decline? 25 countries gear up to join BRICS in 2024",
    "url": "https://www.cryptopolitan.com/25-countries-gear-up-to-join-brics-in-2024/",
    "description": "The BRICS alliance, comprising Brazil, Russia, India, China, and South Africa, is set to expand significantly in 2024. The anticipated 16th BRICS summit, slated for October in Russia&#8217;s Kazan region, is a pivotal moment in the world’s finance. This event may witness the induction of approximately 25 new member countries, signaling a major shift in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T17:20:23.000Z",
    "title": "Nest Wallet CEO Bill Lou Falls Victim to $125,000 LFG Token Phishing Scam",
    "url": "https://www.cryptopolitan.com/nest-wallet-bill-lou-125000-phishing-scam/",
    "description": "Bill Lou, CEO and co-founder of Nest Wallet has fallen victim to a sophisticated phishing scam. The incident involved a fake airdrop for the LFG token, purportedly aimed at Ethereum users with high transaction fees, resulting in Lou losing 52 stETH, equivalent to $125,000. The event has raised serious concerns about the safety and security [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T17:11:16.000Z",
    "title": "AI in Taxation: Transforming the Landscape",
    "url": "https://www.cryptopolitan.com/ai-in-taxation-transforming-the-landscape/",
    "description": "In the rapidly evolving world of technology, artificial intelligence (AI) is making profound strides in various sectors, including taxation. Renowned AI pioneer and strategist, Mark Minevich, asserts that AI has the potential to significantly impact jobs, particularly in fields like bookkeeping and accounting. However, while the rise of AI may raise concerns about job displacement, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-02T17:15:32.000Z",
    "title": "Top trending token Wagmi surges 84.5% in 24 hours",
    "url": "https://crypto.news/top-trending-token-wagmi-surges-84-5-in-24-hours/",
    "description": "CoinGecko, one of the largest global cryptocurrency data aggregators, lists Wagmi as the top trending token on Jan. 2, citing an 84.5% price surge."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-02T17:30:06.000Z",
    "title": "Bitcoin’s Road To Record Heights: Analysts Forecast Post-Halving Surge",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-road-to-record-heights-analysts-forecast-post-halving-surge/",
    "description": "Analysts have recently focused on Bitcoin&#8217;s potential trajectory after its anticipated halving event. Adrian Zduńczyk, a prominent crypto trader, has shared a bullish outlook, suggesting that Bitcoin could soar to new all-time highs post-halving. Zduńczyk&#8217;s projections shared on X, hinge on favorable market conditions and pivotal financial events. Related Reading: CryptoQuant Sound Alarm: Spot Bitcoin ETF Approval May Trigger Drop To $32,000, Here’s Why Bitcoin&#8217;s Bright Outlook The beginning of 2024 has already seen a positive trend for Bitcoin, reflecting a growing confidence among investors. Zduńczyk links this optimism to a parallel movement in traditional markets, particularly the S&#38;P 500, expected to deliver a 12.8% return in January. This positive trend in the stock market is seen as a potential catalyst by analysts for increased capital inflows into Bitcoin, reinforcing the correlation between the cryptocurrency and US stock markets. 3/ With an abnormally strong +12.8% est. S&#38;P return and strong correlation, BTC should get additional reinforcement from bullish stock market outlook. Besides, #BTC&#8216;s weekly chart shows support @ $30k, with rising 50-week and 200-week trends. Resistance @ $48k-50k. Also, &#8230; pic.twitter.com/Ffh8Mq74OS — Adrian Zduńczyk, CMT (@crypto_birb) January 1, 2024 The upcoming halving event in April, a significant occurrence in the Bitcoin ecosystem, is another factor fueling Zduńczyk&#8217;s bullish predictions. This event, which halves the reward for Bitcoin mining, historically triggers a surge in Bitcoin&#8217;s price by limiting the new supply entering circulation. Analysts like Zduńczyk view this as a key moment that could propel Bitcoin to unprecedented heights. Adding to this optimistic scenario is the mounting speculation surrounding the approval of a spot Bitcoin ETF in the United States. According to Zduńczyk, this approval could channel trillions of dollars into the crypto market, marking a significant milestone in institutional adoption. Experts anticipate that the US Securities and Exchange Commission (SEC) may greenlight such an ETF soon, which could have profound implications for Bitcoin’s valuation and market dynamics. Bitcoin 2024 Trajectory: Analysts Project Sky-High Valuations Forecasts for Bitcoin&#8217;s price in the wake of the upcoming halving and spot Bitcoin ETF approval in the US vary, with some analysts setting ambitious targets. James Butterfill of CoinShares predicts a potential increase to $80,000, while Antoni Trenchev of Nexo foresees a rise to $100,000. Venture capital firm CoinFund, through managing partner Seth Ginns, sets an even loftier expectation, projecting Bitcoin&#8217;s value to range between $250,000 and $500,000 in 2024. Ginns attributes this to a combination of factors, including the anticipated spot ETF approval in the US and a diminishing correlation with traditional economic indicators like the dollar and real yields. Related Reading: Bitcoin’s 2024 Forecast: From $60,000 To $500,000, Top Experts Share Bold Predictions Bitcoin is experiencing a bullish trend, surpassing a significant threshold by trading above $45,000 for the first time since April 2022. The asset has seen a 6% increase in the past 24 hours and a 6.1% rise over the past week. Notably, BTC trading volume has witnessed a substantial spike, escalating from $13 billion on Monday to over $33 billion today. Featured image from Unsplash, Chart from TradingView"
  }
]