[
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T22:03:15.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-07T22:00:29.000Z",
    "title": "Coinbase CEO Takes On SEC, Igniting Crypto Community’s Passion for Clarity",
    "url": "https://www.newsbtc.com/coinbase/coinbase-ceo-takes-on-sec-igniting-crypto-communitys-passion-for-clarity/",
    "description": "In a fiery showdown, Coinbase CEO Brian Armstrong confronts the Securities and Exchange Commission (SEC) lawsuit, igniting a passionate response from the crypto community. His unwavering defense not only stirs enthusiasm among supporters but also intensifies demands for clear regulations in the industry. Armstrong has welcomed the SEC lawsuit against his exchange, stating that a court battle will help establish much-needed clarity around crypto rules and regulations.  “Regarding the SEC complaint against us today, we’re proud to represent the industry in court to finally get some clarity around crypto rules. We’ll get the job done. In the meantime, let’s all keep moving forward and building as an industry. America will get this right in the end,” the CEO said. Taking The SEC Head On Armstrong expressed unwavering confidence in Coinbase&#8217;s legal team and the facts surrounding cryptocurrencies and the law. In a tweet, he stated that representing the industry in court against the SEC was essential to obtain the long-awaited clarity in the crypto space.  Related Reading: Bitcoin Realized Loss Remains Low Despite Volatility, What Does This Mean? He further emphasized that Coinbase underwent a rigorous review process by the SEC when it became a public company in 2021 and highlighted the regulatory inconsistencies between the SEC and the Commodity Futures Trading Commission (CFTC). Coinbase CEO&#8217;s Defense Spurs Enthusiasm And Demands For Regulatory Clarity Armstrong’s unflinching confidence reverberates through the crypto space as he takes a stand against the SEC. The SEC&#8217;s lawsuit against Coinbase alleges a violation of securities laws, claiming that the exchange offered unregistered securities and operated as an unregistered security broker. The inclusion of prominent tokens like Polygon (MATIC), Cardano (ADA), and Solana (SOL) in the lawsuit further amplifies the anger within the community.  COIN recovers to $52 after Tuesday crash &#124; Source: Coinbase Global, Inc on TradingView.com However, crypto enthusiasts feel the weight of the SEC&#8217;s regulatory overreach, demanding fair treatment and a clear delineation between securities and commodities.  Coinbase&#8217;s relationship with the SEC has been marred by contention and frustration. The exchange has long called for transparent rules and guidelines from the SEC, seeking clarity on which digital assets should be classified as securities.  In response to the SEC&#8217;s lack of action, Coinbase previously filed a lawsuit, highlighting the need for regulatory guidance. Now, the battle intensifies as the SEC counters Coinbase&#8217;s plea for clarity with legal action, fueling the community&#8217;s determination to fight for a just and equitable regulatory framework. Related Reading: Late Evidence In Criminal Trial Irks SBF, FTX Explores Options For AI Stock Sale Coinbase’s stock COIN has suffered following the lawsuit, falling from $66 to $45 in one day before recovering above $52 where it is currently trading at the time of this writing. It is left to see where the lawsuit leads but the crypto market seems to have moved forward as prices have begun to recover with Bitcoin rising over 3% in the last 24 hours. Featured image from The Cryptocurrency Post, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-07T22:01:13.000Z",
    "title": "Robinhood Says It’s Reviewing Its Crypto Offerings Following SEC Lawsuit Against Binance and Coinbase: Report",
    "url": "https://dailyhodl.com/2023/06/07/robinhood-says-its-reviewing-its-crypto-offerings-following-sec-lawsuit-against-binance-and-coinbase-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/09/rise-after-robinhood.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/09/rise-after-robinhood.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/09/rise-after-robinhood.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/09/rise-after-robinhood.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/09/rise-after-robinhood.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/09/rise-after-robinhood.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/09/rise-after-robinhood.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Retail trading giant Robinhood is reportedly reviewing its crypto offerings after the U.S. Securities and Exchange Commission (SEC) filed lawsuits this week against Binance and Coinbase. According to a new Bloomberg report, Robinhood’s legal chief Dan Gallagher says the company is combing through the SEC’s legal filings and deciding whether to modify the platform&#8217;s crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/07/robinhood-says-its-reviewing-its-crypto-offerings-following-sec-lawsuit-against-binance-and-coinbase-report/\">Robinhood Says It’s Reviewing Its Crypto Offerings Following SEC Lawsuit Against Binance and Coinbase: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]