[
  {
    "source": "CoinDesk",
    "date": "2023-09-11T08:53:21.000Z",
    "title": "Animoca Brands Raises $20M for Metaverse Project Mocaverse",
    "url": "https://www.coindesk.com/web3/2023/09/11/animoca-brands-raises-20m-for-metaverse-project-mocaverse/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The investment was led by CMCC Global and included contributions from Kingsway Capital, Liberty City Ventures and GameFi Ventures."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-11T08:41:22.000Z",
    "title": "Double top 'likely' confirmed — 5 things to know in Bitcoin this week",
    "url": "https://cointelegraph.com/news/double-top-5-things-to-know-bitcoin-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/e9378914-2510-44eb-8b7b-a353933ef295.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price weakness shows as Bitcoin analysts debate the likelihood of a return toward $20,000.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) begins a key macro week in a weak place as 2023 BTC action begins to look like a “double top.”</p><p>After a disappointing weekly close below $26,000, BTC/USD is struggling to catch a bid amid a return to low volatility.</p><p>Analysts, already predicting downside, continue to forecast new local lows, and liquidity conditions are increasingly supporting their argument.</p><p>Are there any silver linings on the horizon? One on-chain metric suggests that Bitcoin is “in the midst” of a major shakeout akin to March 2020. </p><p>A rebound to “fair value” may also come courtesy of Bitcoin’s relative strength index (RSI), which has almost fully retraced its year-to-date gains to reach its lowest levels since the first week of January.</p><p>Cointelegraph takes a look at these topics and more in the weekly rundown of key BTC price triggers.</p><h2>Weekly close makes BTC price double top a reality</h2><p>Bitcoin closing out the week below key trendlines was already expected, but the reality may be worse than many care to admit.</p><p>That is the conclusion of popular trader and analyst Rekt Capital, who warned that a close below $26,000 would “likely” validate a double top structure on the BTC weekly chart.</p><p>This currently takes the form of Bitcoin’s two 2023 local tops, both above $31,000, with a retracement to $26,000 inbetween, data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> shows.</p><p>BTC price weakness now risks continuation downhill thanks to the latest close.</p><p>“Weekly close below ~$26,000 likely confirms the Double Top breakdown,” Rekt Capital <a href=\"https://twitter.com/rektcapital/status/1700956258335969635\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in part of an X post.</p><p>Further analysis noted that $26,000 had formed support for three weeks running, and that finally deciding its fate was thus significant on weekly timeframes.</p><p>With BTC/USD nonetheless seeing its lowest weekly close since March, popular chartist JT <a href=\"https://twitter.com/JTheretohelp1/status/1701032867935953285\" target=\"_blank\" rel=\"noopener nofollow\">told</a> X followers that there was still room for optimism. This, he argued, was in the form of the 200-week exponential moving average (EMA) near $25,600.</p><p>“This week candle was a spinning top doji, which is a candle that indicates indecision,” he wrote. </p><blockquote>“What’s quite remarkable though is that the past three weekly closes have closed within $400 of each other! Talk about boring and flat price action! The good news is we closed well above our weekly 200EMA ($25.6K).”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/4ba348ff-c41c-4b0c-97b7-4fa6a4bb2831.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-week chart with 200EMA. Source: TradingView</em></figcaption></figure><p>Cointelegraph previously covered the <a href=\"https://cointelegraph.com/news/bitcoin-price-200-week-us-dollar-hits-6-month-high\">significance of the 200-week EMA</a> within the current BTC price environment.</p><h2>$20,000 futures gap next?</h2><p>Bitcoin slowly heading lower has refueled a debate over its ability to repeat classic chart behavior.</p><p>This focuses on the largest cryptocurrency’s habit of “filling gaps” on CME futures markets, which appear on weekends and holidays.</p><p>Here, the difference in price between one week’s close and the next week’s open often forms a magnet for BTC price action in future — but not always immediately.</p><p>BTC/USD often “fills” gaps within days or even hours of futures markets resuming, but over time, some have been left behind. A major gap on the radar currently lurks at $20,000.</p><p>“That’s the only real CME gap that we have in terms of downside movement from current price levels,” Rekt Capital explained in his latest <a href=\"https://www.youtube.com/watch?v=BlpXnyejid0\" target=\"_blank\" rel=\"noopener nofollow\">YouTube update</a> on Sep. 6.</p><p>He continued by noting a now-filled gap from June 2022 was now acting as resistance after functioning as support and resistance at various points since its creation.</p><p>“This CME gap has been filled multiple times already and it’s been flipped into a new resistance,” he said, noting that the aforementioned double top completing would likewise feed into a return to the $20,000 zone.</p><p>Under such circumstances, a potential BTC price range would form, with the $20,000 gap and previously-filled gap functioning as support and resistance, respectively.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/ab7d8be6-c65d-4f85-a928-b07728ed7644.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD chart with CME gaps highlighted (screenshot). Source: Rekt Capital/YouTube</em></figcaption></figure><p>Others, however, were undecided about the probability of such a far-off gap being revisited.</p><p>“Bitcoin has a long history with CME futures Gaps. These Gaps tend to get filled sooner or later. But there's no guarantee they will,” popular trader Titan of Crypto <a href=\"https://twitter.com/Washigorira/status/1700890928477618303\" target=\"_blank\" rel=\"noopener nofollow\">argued</a>. </p><p>Uploading a chart of historical gaps, he referenced another which is yet to fill, this time below $10,000.</p><p>“For some of you who are in crypto for quite some time, you may recall the $9.6k gap from September 2020. Back then everyone was expecting this gap to get filled so they can finally buy Bitcoin again. Guess what? It remains unfilled to this day and many got back in at $20k+, fomoing like crazy,” he wrote. </p><blockquote>“There is a gap that is still unfilled at $20k-$21k. Will it get filled? Well everything is possible. Yet until the market structure is broken, it's just wishful thinking.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/20216fa4-1dee-4119-970a-cc9bc8a40173.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Titan of Crypto/X</em></figcaption></figure><h2>Liquidity increases at March levels</h2><p>Also feeding into bearish BTC price predictions is the general state of liquidity on BTC/USD markets.</p><p>Liquidity heatmaps are a common feature in crypto trading circles, helping to see where bid and ask concentrations lie and how these are manipulated by their owners.</p><p>Currently, a large block of bid liquidity is congregating around $24,000 — as Cointelegraph reported, the <a href=\"https://cointelegraph.com/news/bitcoin-bids-lowest-since-march-btc-price-dips\">lowest such concentration</a> since March.</p><p>“A a dip into that liquidity below looks a decent probability,” pseudonymous X user Honeybadger thus <a href=\"https://twitter.com/HoneybadgerC/status/1700951034300871069/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">predicted</a>, uploading one such heatmap.</p><p>In its latest heatmap release for largest-volume global exchange Binance, meanwhile, on-chain monitoring resource Material Indicators continued to flag $24,750 as a key level for bulls to retain.</p><p>“Whatever the case, bulls must defend the LL at $24,750 to hang on to any hopium of seeing another pump. Printing a new LL buys a ticket to Bearadise,” part of accompanying commentary stated.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Here&#39;s how the <a href=\"https://twitter.com/hashtag/BTC?src=hash&amp;ref_src=twsrc%5Etfw\">#BTC</a> order book on <a href=\"https://twitter.com/binance?ref_src=twsrc%5Etfw\">@Binance</a> is set up for the weekend.  <br><br>I&#39;ve pushed the Volume Percentile filter in <a href=\"https://twitter.com/hashtag/FireCharts?src=hash&amp;ref_src=twsrc%5Etfw\">#FireCharts</a> a bit to highlight where liquidity is, as well as the dark zones of illiquidity that are at risk of being exploited. Not sure we&#39;ll see much volatility… <a href=\"https://t.co/5liaqi22q7\">pic.twitter.com/5liaqi22q7</a></p>&mdash; Material Indicators (@MI_Algos) <a href=\"https://twitter.com/MI_Algos/status/1700291371003781547?ref_src=twsrc%5Etfw\">September 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>CPI leads “huge” pre-FOMC week</h2><p>After a quiet start to September, the macroeconomic landscape is returning as a potential source of risk asset volatility.</p><p>This week, the United States Consumer Price Index (CPI) August print forms the focus ahead of a key interest rate decision by the Federal Reserve.</p><p>“Huge last week before the September Fed meeting,” financial commentary resource The Kobeissi Letter wrote in part of preliminary commentary, noting that “lots of volatility” lies ahead.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This is the last batch of inflation data before the Fed meeting.<br><br>Expect to see lots of volatility this week.<br><br>We&#39;re publishing our trades for the week shortly.<br><br>In 2022, our calls made 86%.<br><br>Subscribe to access our analysis and see what we&#39;re trading:<a href=\"https://t.co/SJRZ4FrfLE\">https://t.co/SJRZ4FrfLE</a></p>&mdash; The Kobeissi Letter (@KobeissiLetter) <a href=\"https://twitter.com/KobeissiLetter/status/1700864441141567642?ref_src=twsrc%5Etfw\">September 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Due on Sep. 14, CPI is well known as a volatility catalyst for BTC price action, but recent prints have failed to alter the status quo for long. </p><p>Crypto market participants nonetheless include its release in their roadmaps, while the figures are apt to impact market expectations of what the Fed will do to benchmark interest rates.</p><p>Its next decision will come on Sep. 20, and according to CME Group’s <a href=\"https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html\" target=\"_blank\" rel=\"noopener nofollow\">FedWatch Tool</a>, confidence is high that rates will remain unchanged — a potential boon to risk assets, including crypto.</p><p>As of Sep. 11, the odds of a pause in hikes were over 90%.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/e787e367-79cb-49aa-bdac-d271c7946d3e.png\"  /><figcaption style=\"text-align: center;\"><em>Fed target rate probabilities chart. Source: CME Group</em></figcaption></figure><h2>Back to March 2020</h2><p>As Cointelegraph reported at the weekend, <a href=\"https://cointelegraph.com/news/bitcoin-utxo-march-2020-crash-new-research\">one on-chain metric</a> is signaling that current BTC price action may be more significant than traders believe.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-all-time-high-2025-btc-price-idea\">Bitcoin all-time high in 2025? BTC price idea reveals ‘bull run launch’</a></em></strong></p><p>UTXOs in Loss, which measures the number of unspent transaction outputs (UTXOs) from on-chain transactions worth less than they were at the time of purchase, are at their highest since March 2020.</p><p>As <a href=\"https://academy.glassnode.com/utxo/profit-loss-utxo/utxos-in-loss\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> by on-chain analytics firm Glassnode, UTXOs in Loss does not measure the amount of BTC in loss, but rather the number of UTXOs involved.</p><p>A <a href=\"https://cryptoquant.com/insights/quicktake/64f9adf378b98c08bc934a32-UTXOs-in-Loss-A-Precursor-to-the-Next-Black-Swan-Event\" target=\"_blank\" rel=\"noopener nofollow\">research update</a> from on-chain analytics platform CryptoQuant nonetheless warned that Bitcoin may be dealing with a “black swan” event similar to that which sent BTC price down 60% over three years ago.</p><p>“Given that the current level of the ‘UTXOs in loss’ indicator mirrors that of the Black Swan event between March and April 2020 (due to the Coronavirus), those anticipating another Black Swan event might want to consider whether we are already in the midst of the event they are waiting for,” its author, CryptoQuant contributor Woominkyu, wrote.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/88d7562f-a61e-4210-a62b-109f79e551b5.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin UTXOs in Loss chart. Source: CryptoQuant</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-11T08:54:18.000Z",
    "title": "Bitcoin user’s costly error leads to record transaction fee of $510,000",
    "url": "https://cryptoslate.com/bitcoin-users-costly-error-leads-to-record-transaction-fee-of-510000/",
    "description": "<p>According to on-chain data, a Bitcoin user spent a staggering 19 BTC, around $510,000, in transaction fees for transferring a mere 0.074 BTC, valued at less than $2,000, on Sept. 10. The average transaction fee on the blockchain network was $2.176 as of press time, per data from ycharts.com. This means the user overpaid more [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-users-costly-error-leads-to-record-transaction-fee-of-510000/\">Bitcoin user&#8217;s costly error leads to record transaction fee of $510,000</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-11T08:59:19.000Z",
    "title": "China Unveils Comprehensive Three-Year Action Plan to Advance Metaverse Industry",
    "url": "https://www.cryptoglobe.com/latest/2023/09/china-unveils-comprehensive-three-year-action-plan-to-advance-metaverse-industry/",
    "description": "According to the latest reports by China Global Television Network (CGTN) and the South China Morning Post (SCMP), China has officially launched a three-year action plan to spur the innovative development of the metaverse industry. The plan, which will be in effect from 2023 to 2025, was jointly announced by five Chinese ministries, including the […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-11T08:50:40.000Z",
    "title": "Vitalik Buterin’s X Account Compromised, Nearly $700,000 Drained",
    "url": "https://cryptodaily.co.uk/2023/09/vitalik-buterins-x-account-compromised-nearly-700000-drained",
    "description": "The hacker posted a malicious link on the profile, tricking users into connecting their wallets and minting exclusive NFTs."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T08:59:44.000Z",
    "title": "Dell Collaborates with the University of Limerick to Pave the Way for Advanced Cancer Treatment with AI",
    "url": "https://www.cryptopolitan.com/dell-collaborates-with-limerick-university/",
    "description": "Dell, the global technology giant, has joined forces with the University of Limerick&#8217;s Digital Cancer Research Centre in a groundbreaking collaboration to leverage artificial intelligence (AI) to advance cancer research and treatment. This initiative is poised to significantly enhance cancer care, focusing on patients diagnosed with B-cell lymphoma. The cornerstone of this partnership is developing ... <a title=\"Dell Collaborates with the University of Limerick to Pave the Way for Advanced Cancer Treatment with AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dell-collaborates-with-limerick-university/\" aria-label=\"More on Dell Collaborates with the University of Limerick to Pave the Way for Advanced Cancer Treatment with AI\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T08:56:06.000Z",
    "title": "U.S. and Vietnam Firms Forge Partnerships in Semiconductors, Tech, and Aviation during Biden’s Visit",
    "url": "https://www.cryptopolitan.com/u-s-and-vietnam-firms-forge-partnerships/",
    "description": "During US President Joe Biden&#8217;s visit to Hanoi, top executives from leading US and Vietnamese companies in the semiconductor, technology, and aviation sectors gathered to explore new business opportunities. The summit focused on strengthening ties between the two nations and unveiling exciting new deals in artificial intelligence (AI). The Vietnam-US Innovation &#38; Investment Summit saw ... <a title=\"U.S. and Vietnam Firms Forge Partnerships in Semiconductors, Tech, and Aviation during Biden&#8217;s Visit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/u-s-and-vietnam-firms-forge-partnerships/\" aria-label=\"More on U.S. and Vietnam Firms Forge Partnerships in Semiconductors, Tech, and Aviation during Biden&#8217;s Visit\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-11T09:03:57.000Z",
    "title": "Sui and Compound bearish, Tradecurve Markets bullish signals strengthen",
    "url": "https://crypto.news/sui-and-compound-bearish-tradecurve-markets-bullish-signals-strengthen/",
    "description": "Learn about the future of Sui and Compound after their recent bearish pressure and why Tradecurve Markets’s bullish pattern has strengthened"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-11T08:46:17.000Z",
    "title": "PEPE lost 15% in one week despite surge in exchange inflows and whale activity",
    "url": "https://crypto.news/pepe-lost-15-in-one-week-despite-surge-in-exchange-inflows-and-whale-activity/",
    "description": "Pepe’s (PEPE) price has struggled over the past month after allegations of insider trading and rug pull emerged.  According to data from Santiment, the meme coin registered an almost 50% decline since Aug. 13. Its price plunged by 15% over&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-11T08:45:30.000Z",
    "title": "Boosting Optimism Protocol: Can Incentives Drive OP Prices Higher?",
    "url": "https://www.newsbtc.com/all/boosting-optimism-protocol-can-incentives-drive-op-prices-higher/",
    "description": "Optimism (OP) has been at the forefront of the blockchain industry with its incentive program, which recently led to the protocol&#8217;s cumulative trading volume exceeding an impressive $3.8 billion. Analyst Ryan Holloway has shed light on the remarkable impact of Optimism&#8217;s incentive program. The availability of OP trading rewards and incentives on various platforms, including Polynomial, played a pivotal role in this surge in usage metrics. Related Reading: Shiba Inu Tallies 77% Accumulation By Major Investors – Good For SHIB Price? The incentivization strategy employed by Optimism has proven wildly successful, resulting in an astounding 23-fold increase in trading volume for the protocol. This achievement, however, comes with a caveat, as it raises questions about the composition of this newfound trading activity. Just dropped an analysis with @t__norm on the impact of @PolynomialFi&#8216;s OP incentive program that ultimately led to the protocol&#8217;s cumulative trading volume surpassing $3.8B 🧵 👇 pic.twitter.com/UahucTcVJ0 — Ryan Holloway (@raholloway) September 9, 2023 Rise In Trading Volume Masks Optimism’s Growth In Daily Traders While the surge in trading volume is undoubtedly impressive, a deep analysis reveals a more nuanced picture. The growth in daily traders has been relatively modest, suggesting the possibility of a significant rise in power users or, in a less favorable scenario, potential wash trading activities. But what exactly is wash trading? Wash trading involves artificially inflating trading volumes by executing simultaneous buy and sell orders for the same asset, giving the illusion of increased demand and activity. This practice is illegal in traditional financial markets and is viewed negatively in the cryptocurrency space due to its potential to mislead investors. Optimism market cap currently at $1 billion. Chart: TradingView.com Optimism Faces DeFi Sector Headwinds Optimism has faced its fair share of challenges in gaining a foothold in the competitive DeFi sector. Recent reports indicate a notable decrease in total value locked and decentralized exchange volumes on the network in recent weeks. This decline in activity is reflected in the network&#8217;s financials, with revenue plummeting by 37.5% in the last month, accompanied by an overall activity decrease of 19.7% over the same period. Despite these setbacks, Optimism&#8217;s native token, OP, currently holds a price of $1.26 according to CoinGecko, with a 0.9% gain in the last 24 hours. However, it has seen a 6.2% decline over the past week. Related Reading: Massive PEPE Token Dump: Whale Unloads 762 Billion At Loss As Price Wobbles Sustainability And Challenges In Optimism&#8217;s Post-Incentive Era The sustainability of Polynomial&#8217;s retention rates after the conclusion of the incentive program will be a crucial factor in determining its long-term impact on Optimism. As the network navigates the challenges posed by wash trading concerns and its struggles to establish a firm presence in DeFi, the cryptocurrency community will be closely watching for signs of resilience and adaptability. While Optimism&#8217;s incentive program has undeniably driven an astonishing surge in trading volume, the sustainability of this growth and the resolution of its challenges will determine the protocol&#8217;s long-term success in the highly competitive world of cryptocurrency. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Insperity"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-11T09:05:59.000Z",
    "title": "Chainlink Whales Accumulate Millions of LINK Following Successful SWIFT Test",
    "url": "https://www.crypto-news-flash.com/chainlink-whales-accumulate-millions-of-link-following-successful-swift-test/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-whales-accumulate-millions-of-link-following-successful-swift-test",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink X SWIFT\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-300x158.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-1024x538.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-768x403.jpeg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-351x185.jpeg 351w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-24x13.jpeg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-36x19.jpeg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-48x25.jpeg 48w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Chainlink is currently down by 1.2 percent in the last seven days and 1.8 percent in the last 24 hours.  According to Santiment data, whales are aggressively purchasing the asset at its current price following the recent achievement from its partnership with SWIFT.  It was recently reported that SWIFT is demonstrating how it can provide [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-11T08:44:12.000Z",
    "title": "Bitcoin ETF Hopes: Analyst Predicts $42,000 Price Surge",
    "url": "https://www.crypto-news-flash.com/bitcoin-etf-hopes-analyst-predicts-42000-price-surge/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-etf-hopes-analyst-predicts-42000-price-surge",
    "description": "<img width=\"1280\" height=\"890\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280-300x209.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280-1024x712.png 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />K33 research analyst believes that a spot Bitcoin ETF could lead to major inflows pushing the Bitcoin price above $42,000 in the first 100 days. The analyst also added that the spot Bitcoin ETFs could trigger major outflows from the futures-based ETFs. The world&#8217;s largest cryptocurrency Bitcoin (BTC) continues to face selling pressure and is [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-11T09:03:49.000Z",
    "title": "These 3 Altcoins will Pump HARD within 30 days of Bitcoin’s Rally",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/these-3-altcoins-will-pump-hard-within-30-days-of-bitcoins-rally/",
    "description": "<p>We are getting set for what will be an unprecedented rally. And as usual, the spotlight is on Bitcoin. Don’t take my word for it. Financial research firm Bernstein recently revealed an incoming Bitcoin rally, slow but steady. And when that happens. We’ll see prices go through the roof. Unlike previous rallies, which were led [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/these-3-altcoins-will-pump-hard-within-30-days-of-bitcoins-rally/\">These 3 Altcoins will Pump HARD within 30 days of Bitcoin&#8217;s Rally</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-11T08:49:00.000Z",
    "title": "Coinbase’s Indian Standoff: Will the Company Stay or Go?",
    "url": "https://coinedition.com/coinbases-indian-standoff-will-the-company-stay-or-go/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month.png 730w, https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/09/Coinbase-to-discontinue-services-in-India-later-this-month-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In response to recent reports suggesting a complete cessation of operations for its Indian customers, Coinbase has issued a clarification. In a since-revised article, the prominent tech news outlet TechCrunch circulated a claim that that all Coinbase services would be inaccessible to Indians from September 25. The article urged Indians to withdraw any remaining funds [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbases-indian-standoff-will-the-company-stay-or-go/\">Coinbase&#8217;s Indian Standoff: Will the Company Stay or Go?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]