[
  {
    "source": "CoinDesk",
    "date": "2023-06-22T09:18:57.000Z",
    "title": "Bitcoin Options Volume Jumps to $3.3B as Price Rallies to Two-Month High",
    "url": "https://www.coindesk.com/markets/2023/06/22/bitcoin-options-volume-jumps-to-33b-as-price-rallies-to-two-month-high/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Traders are scrambling for bitcoin calls or bullish bets after the cryptocurrency's sudden rally to nearly $31,000."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-22T09:32:56.000Z",
    "title": "Atomic wallet identifies 4 possible but unconfirmed causes of recent breach",
    "url": "https://cryptoslate.com/atomic-wallet-identifies-4-possible-but-unconfirmed-causes-of-recent-breach/",
    "description": "<p>Atomic Wallet, which suffered from a hack on June 3, has narrowed down the possible causes of the breach according to a recent statement. In the statement, the non-custodial platform said the breach could have been caused by viruses on local user devices, malware code injection, infrastructure breach, or a man-in-the-middle attack. In a man-in-the-middle attack, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/atomic-wallet-identifies-4-possible-but-unconfirmed-causes-of-recent-breach/\">Atomic wallet identifies 4 possible but unconfirmed causes of recent breach</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-22T09:15:43.000Z",
    "title": "Kraken sees second-largest outflow with $225M Bitcoin withdrawn",
    "url": "https://cryptoslate.com/insights/kraken-sees-second-largest-outflow-with-225m-bitcoin-withdrawn/",
    "description": "<p>Quick Take Bitcoin soars Bitcoin surged 15% from June 20&#8217;s opening price of $26,750 to a peak of $30,820 the following day. Several factors contributed to this &#8211; an escalation in leveraged trading and significant spot buying &#8211; with the spot volume on Coinbase hitting late April highs. Exchange movement Bitcoin leaving exchanges reached 17,000 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/kraken-sees-second-largest-outflow-with-225m-bitcoin-withdrawn/\">Kraken sees second-largest outflow with $225M Bitcoin withdrawn</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-22T09:28:59.000Z",
    "title": "Bitcoin pause then breakout of $30,000?",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-pause-then-breakout-of-30-000",
    "description": "<p>Bitcoin&rsquo;s huge surge over the last two days has come to a halt at resistance. Is this just the calm before the real storm?</p>\nBitcoin has work still to be done\n<p>The tsunami called Bitcoin is building momentum and there is a real possibility that a breakthrough of the $30,000 resistance is on the cards. Many traders will have their short stops just above this level and therefore a short squeeze could be likely.</p>\n<p>Bitcoin really motored both Tuesday and Wednesday putting on as much as 14.6% in the process. Not a bad couple of day&rsquo;s work. However, the main task is still to be accomplished, and this is facing the king of the cryptocurrencies like Everest, for a trepidatious climber.</p>\nThe reality of the situation\n<p>So much bad press has hit the crypto market over the last few months that for the market to be going up is pretty miraculous. That is until you think of the fundamentals.&nbsp;</p>\n<p>On the one hand you have a pristine asset that is ridiculously scarce, more secure than any other asset, unreachable by government intervention, and able to be held, bought, and sent to anyone on the planet.</p>\n<p>On the other hand there is fiat currency, being printed to oblivion, in an unfair system, and being weaponised against the people. On top of this government agencies are doing their level best to stop citizens buying cryptocurrencies by bringing enforcement actions against all and sundry in the crypto sector.</p>\nBanking is obsolete\n<p>The banks that help to control the currency provide almost no interest to depositors, probably minus value when inflation is taken into account, and they control their customers by enforcing who they can send their currency to.</p>\n<p>Banking is utterly obsolete and it has taken the wildly innovative crypto sector to bust this banking facade wide open. These monoliths of antiquity are no longer fit for purpose. People can now hold their own value and wealth so there is no need for a middleman. Therefore the banks&rsquo; days are numbered.</p>\nBitcoin is for the people\n<p>Bitcoin is likely to keep rising given its pure fundamentals, providing a store of value in the face of the rapidly diminishing purchasing power of fiat currencies like the dollar. The regulatory agencies might stop the majority of the institutions from getting onboard, but it needs to be remembered that Bitcoin is for the people. There is still time.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-22T09:25:15.000Z",
    "title": "Radius Raises $1.7M in Pre-Seed Funding to Pioneer Trustless Shared Sequencing Layer",
    "url": "https://cryptodaily.co.uk/2023/06/radius-raises-17m-in-pre-seed-funding-to-pioneer-trustless-shared-sequencing-layer",
    "description": "<p>San Francisco, CA, June 22nd, 2023, Chainwire</p><p>Cutting-edge blockchain company, Radius, which is pioneering the trustless shared sequencing layer, has announced that it has raised a pre-seed investment of $1.7M. The funding round was led by Hashed, with participation from Superscrypt, Lambdaclass (Ergodic Fund), and Crypto.com.</p><p>As rollups become more popular choices for many applications including defi due to its scalability, properly decentralising its operation and structuring economical design has become the next major point for rollup-centric ecosystem; Shared Sequencing Layer has arisen as the ultimate solution.</p><p>Radius is dedicated to providing an economical and sustainable solution for Rollups, thereby protecting their users from harmful Miner Extractable Value (MEV). This is achieved through a groundbreaking zk scheme known as Practical Verifiable Delay Encryption (PVDE), developed by Radius. The shared sequencing layer with PVDE ensures that users are protected from harmful MEV in a truly trustless way, while still maximizing revenue for Rollups.</p>\"Radius is committed to setting the standard for a trustless shared sequencing layer that not only maximizes revenue for Rollups but also safeguards users from the harmful effects of MEV,\" says AJ Ji Hoon Park. \"This funding will propel us forward in achieving our goals and redefining the boundaries of what is possible in the blockchain sphere.\"<p>Radius has also recently announced a partnership with Saga, the Rollup-as-a-Service, and has joined the Celestia Ecosystem. This partnership will drive further advancements in the rollup technology and enhance the security of the blockchain ecosystem.</p><p>In addition to these achievements, Radius is in the process of building an MEV-Resistant Decentralized Exchange, known as 360. Enabled by Radius' shared sequencing layer, this new DEX is expected to significantly enhance the user experience and security in the DeFi space.</p><p>Continuing its engagement with the broader blockchain community, Radius recently hosted a conference called \"Scaling 2023: The Renaissance\". The event featured renowned speakers from companies such as Starkware, Flashbots and Osmosis, further solidifying Radius' position as a thought pioneer in the industry.</p><p></p><p>About Radius:</p><p>Radius is a blockchain technology company pioneering a trustless shared sequencing layer that offers an economical and sustainable solution for Rollups and protects their users from harmful MEV. With its novel approach, Radius aims to revolutionize the Rollup space and contribute to the broader adoption of blockchain technology. Radius will launch an alpha version of its sequencing layer in Q1 of 2024.&nbsp;</p><p></p>ContactDavid Seomedia@theradius.xyz"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-22T09:30:07.000Z",
    "title": "Binance US Market Share Shrinks Amid Legal Battle With SEC",
    "url": "https://news.bitcoin.com/binance-us-market-share-shrinks-amid-legal-battle-with-sec/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2313368769-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance US Market Share Shrinks Amid Legal Battle With SEC\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2313368769-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2313368769-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2313368769-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2313368769-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2313368769-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2313368769-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2313368769-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The market share of the U.S. subsidiary of Binance has declined amid an ongoing crackdown by America’s securities regulator. According to new data, leading U.S. crypto exchange Coinbase, also sued by the Securities and Exchange Commission (SEC), is taking a hit, too. Binance US Market Share Drops to 1.5%, According to Kaiko The litigation with [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T09:36:05.000Z",
    "title": "Uwerx (WERX) Shows Potential To Surpass Axie Infinity & XRP",
    "url": "https://www.cryptopolitan.com/uwerx-werx-shows-potential-to-surpass-axie-infinity-xrp/",
    "description": "As of last year, Play-to-Earn tokens like Axie Infinity (AXS) and DeFi tokens like XRP (XRP) ruled the day. But these cryptocurrencies have taken a back seat since 2023. This year allowed only tokens with strong viability to thrive.&#160; This is why the emerging Uwerx project could become a blue-chip crypto asset in the near ... <a title=\"Uwerx (WERX) Shows Potential To Surpass Axie Infinity &#38; XRP\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uwerx-werx-shows-potential-to-surpass-axie-infinity-xrp/\" aria-label=\"More on Uwerx (WERX) Shows Potential To Surpass Axie Infinity &#38; XRP\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T09:32:26.000Z",
    "title": "You Could Earn $100 A Day In Passive Income! Get The Lion’s Share With Caged Beasts: Presale Begins With An Enticing Offer",
    "url": "https://www.cryptopolitan.com/you-could-earn-100-a-day-in-passive-income-get-the-lions-share-with-caged-beasts-presale-begins-with-an-enticing-offer/",
    "description": "Since the inception of Dogecoin in 2013, the world of meme coins has been dominated by domestic pet animals like dogs, cats, and toads, or tamed animals like apes. But what will happen if Caged Beasts (BEASTS) is unleashed into the world of meme coins? Will it be just another ordinary meme-themed cryptocurrency that entertains ... <a title=\"You Could Earn $100 A Day In Passive Income! Get The Lion&#8217;s Share With Caged Beasts: Presale Begins With An Enticing Offer\" class=\"read-more\" href=\"https://www.cryptopolitan.com/you-could-earn-100-a-day-in-passive-income-get-the-lions-share-with-caged-beasts-presale-begins-with-an-enticing-offer/\" aria-label=\"More on You Could Earn $100 A Day In Passive Income! Get The Lion&#8217;s Share With Caged Beasts: Presale Begins With An Enticing Offer\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T09:30:58.000Z",
    "title": "Crypto News: Solana’s Ambitions, Cardano’s Strengths, and Caged Beasts’ Unique Referral Programme",
    "url": "https://www.cryptopolitan.com/crypto-news-solanas-ambitions-cardanos-strengths-and-caged-beasts-unique-referral-programme/",
    "description": "Innovation is the only factor that can guarantee continued community engagement and success in the crypto world. Solana, the network with the fastest blockchain, illustrates a history of constant innovation to climb up in the crypto order of power. Cardano, too, relies on innovation to maintain its lead in the market. This article will delve ... <a title=\"Crypto News: Solana’s Ambitions, Cardano’s Strengths, and Caged Beasts’ Unique Referral Programme\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-news-solanas-ambitions-cardanos-strengths-and-caged-beasts-unique-referral-programme/\" aria-label=\"More on Crypto News: Solana’s Ambitions, Cardano’s Strengths, and Caged Beasts’ Unique Referral Programme\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T09:19:12.000Z",
    "title": "Why is the Bitcoin price up today?",
    "url": "https://www.cryptopolitan.com/why-is-the-bitcoin-price-up-today/",
    "description": "On June 21, the Bitcoin price rose to a 14-day high of $30,122. The recent positive news from BTC markets comes in the wake of the SEC cracking down on Binance and Coinbase, and bullish traders are presumably hoping that BTC can end its 10-week losing streak.  According to crypto market analysts, crypto has been ... <a title=\"Why is the Bitcoin price up today?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-is-the-bitcoin-price-up-today/\" aria-label=\"More on Why is the Bitcoin price up today?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-22T09:15:37.000Z",
    "title": "Bitcoin Ordinals NFT sold for $7m as the market recovers",
    "url": "https://crypto.news/bitcoin-ordinals-nft-sold-for-7m-as-the-market-recovers/",
    "description": "The global non-fungible token (NFT) sales have plunged significantly since early 2022 when the crypto market entered the bear zone. However, with the current bull run, sales have risen from the ashes, with a $7 million deal in the past&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-22T09:10:01.000Z",
    "title": "Raoul Pal predicts ‘exponential age’ for crypto amid recent bull market",
    "url": "https://crypto.news/raoul-pal-predicts-exponential-age-for-crypto-amid-recent-bull-market/",
    "description": "A captivating forecast for the cryptocurrency market from respected former Goldman Sachs executive, Raoul Pal, is creating a stir in the financial world. According to Pal, a bullish phase is on the horizon, with bitcoin (BTC) at the helm, marking&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-22T09:10:58.000Z",
    "title": "AVAX Breaches $13 Barrier With 16% Rally – What’s The Next Price Level To Watch?",
    "url": "https://www.newsbtc.com/all/avax-breaches-13-barrier-with-16-rally-whats-the-next-price-level-to-watch/",
    "description": "Avalanche&#8217;s native cryptocurrency, AVAX, experienced a significant breakthrough when it successfully surpassed a crucial barrier at $13. This obstacle had proven to be a significant challenge for AVAX bulls in the previous weeks, hindering their upward momentum.  However, drawing inspiration from Bitcoin&#8217;s impressive surge past the $30,000 mark, AVAX followed suit and decisively shattered this barrier. This remarkable achievement injected renewed optimism into the AVAX community and set the stage for potential further gains.  As the cryptocurrency world buzzes with anticipation, one cannot help but wonder: Will Avalanche&#8217;s AVAX continue its upward trajectory, surpassing even loftier milestones? Indicators Suggest Potential Resistance For AVAX AVAX registered a notable 6.3% surge within a 24-hour period, propelling its price to $13.19 according to CoinGecko.  AVAX price all glowing in green today. Source: Coingecko Additionally, the crypto exhibited an impressive 16% surge over the past seven days, signaling growing momentum. However, despite these positive developments, AVAX still faces potential hurdles in its upward trajectory. According to the latest AVAX price report, the Relative Strength Index (RSI), a widely used indicator that tracks the balance between buying and selling pressure, has consistently remained below the 50-mark since April. AVAX market cap currently at $4.5 billion. Chart: TradingView.com This suggests that selling pressure has dominated the market during this period. While Avalanche managed to overcome the earlier roadblock, the lingering presence of the RSI below 50 may indicate the potential for resistance as bullish trends encounter selling pressure. Related Reading: Shiba Inu Breaks Through Crucial Resistance Point With 10% Climb On the other hand, the coin&#8217;s On Balance Volume (OBV) indicator initially experienced a decline but has since shown signs of recovery. The OBV measures the cumulative volume of AVAX traded over a given period, providing insights into the demand for the cryptocurrency. AVAX price maintaining an upward trajectory in the last week. Source: CoinMarketCap Related Reading: Dogecoin Price Jumps By 23% – Meme Coin Hype Back In Full Swing? The recovery in OBV indicates an improvement in demand for AVAX, which is a positive sign for its future performance. However, it is important to note that as the RSI approaches the 50-mark, it may act as a crucial resistance level for AVAX bulls. The RSI&#8217;s proximity to this threshold suggests that a significant increase in buying pressure will be necessary to overcome potential selling pressure and sustain AVAX&#8217;s upward momentum. Bitcoin&#8217;s Resilience And Its Influence On The Altcoin Market While Avalanche&#8217;s AVAX has been making noteworthy strides, the broader cryptocurrency market has been closely watching Bitcoin&#8217;s performance as it defies expectations and regulatory pressures. Bitcoin has displayed remarkable resilience in the face of ongoing regulatory challenges and has continued to captivate investors with its surprising rally.  Source: Coingecko Bitcoin&#8217;s performance often sets the tone for the overall market sentiment. When Bitcoin experiences significant price movements, it tends to impact the value of altcoins, including AVAX. Positive movements in Bitcoin often lead to increased investor confidence, which in turn fuels the demand for altcoins. Conversely, negative price movements or regulatory concerns surrounding Bitcoin can have a spillover effect on altcoins, dampening investor sentiment and leading to a broader market correction. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Conserve Energy Future"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-22T09:34:49.000Z",
    "title": "VeChain Leads the Charge Against Billion Dollar Counterfeit Markets with Unparalleled Transparency and Industry-Leading Security",
    "url": "https://www.crypto-news-flash.com/vechain-leads-the-charge-against-billion-dollar-counterfeit-markets-with-unparalleled-transparency-and-industry-leading-security/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-leads-the-charge-against-billion-dollar-counterfeit-markets-with-unparalleled-transparency-and-industry-leading-security",
    "description": "VeChain remains one of the top blockchains aiming to help drive sustainability and product traceability. Blockchain can come in handy in helping bodies like the EU in the fight against counterfeit products. The VeChain blockchain platform has been touted as the most suitable available tool to fight against counterfeit goods in the market to protect [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-22T09:32:16.000Z",
    "title": "Best Crypto Presales to Invest in Now for 100x Potential Gains in 2023 – How to Buy a Coin Before it Launches",
    "url": "https://www.crypto-news-flash.com/best-crypto-presales-to-invest-in-now-for-100x-potential-gains-in-2023-how-to-buy-a-coin-before-it-launches/?utm_source=rss&utm_medium=rss&utm_campaign=best-crypto-presales-to-invest-in-now-for-100x-potential-gains-in-2023-how-to-buy-a-coin-before-it-launches",
    "description": "The crypto presale market has been bubbling over the past few months as investors, buyers, and crypto fans have renewed their interest in new crypto presales. While crypto presales offer the chance to find out about new promising tokens early on, they can also be risky. Some buyers have nonetheless managed to collect massive gains [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-22T09:25:23.000Z",
    "title": "3 Must-Have Cryptocurrencies In The Market Right Now",
    "url": "https://www.crypto-news-flash.com/3-must-have-cryptocurrencies-in-the-market-right-now/?utm_source=rss&utm_medium=rss&utm_campaign=3-must-have-cryptocurrencies-in-the-market-right-now",
    "description": "Short-term investment options in the crypto market all have something in common. That is, they die down early once the hype runs out. This has been the case for numerous projects this year, with SUI and PEPE being practical examples of such performances. Uwerx, Polygon (MATIC), and Cardano (ADA) are three major projects that have [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-22T09:25:12.000Z",
    "title": "Radius Raises $1.7M in Pre-Seed Funding to Pioneer Trustless Shared Sequencing Layer",
    "url": "https://www.crypto-news-flash.com/radius-raises-1-7m-in-pre-seed-funding-to-pioneer-trustless-shared-sequencing-layer/?utm_source=rss&utm_medium=rss&utm_campaign=radius-raises-1-7m-in-pre-seed-funding-to-pioneer-trustless-shared-sequencing-layer",
    "description": "San Francisco, CA, June 22nd, 2023, Chainwire Cutting-edge blockchain company, Radius, which is pioneering the trustless shared sequencing layer, has announced that it has raised a pre-seed investment of $1.7M. The funding round was led by Hashed, with participation from Superscrypt, Lambdaclass (Ergodic Fund), and Crypto.com. As rollups become more popular choices for many applications [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-22T09:15:55.000Z",
    "title": "Top Crypto Analyst Issues Bullish Alert, Says One Ethereum Rival Could Explode by 100%",
    "url": "https://dailyhodl.com/2023/06/22/top-crypto-analyst-issues-bullish-alert-says-one-ethereum-rival-could-explode-by-100/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/issues-Bullish-Alert-says.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/issues-Bullish-Alert-says.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/issues-Bullish-Alert-says.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/issues-Bullish-Alert-says.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/issues-Bullish-Alert-says.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/issues-Bullish-Alert-says.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/issues-Bullish-Alert-says.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader believes that one top-10 altcoin could double in price amid a crypto market bounce. Pseudonymous crypto analyst Bluntz tells his 223,000 Twitter followers that he is “liking” Solana (SOL) after the Ethereum (ETH) competitor completed an Elliot Wave Theory three-wave correction pattern as well as bounced from a major support [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/22/top-crypto-analyst-issues-bullish-alert-says-one-ethereum-rival-could-explode-by-100/\">Top Crypto Analyst Issues Bullish Alert, Says One Ethereum Rival Could Explode by 100%</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]