[
  {
    "source": "Cointelegraph",
    "date": "2023-05-28T06:11:18.000Z",
    "title": "The Hong Kong Police Force launch new metaverse platform, ‘CyberDefender’",
    "url": "https://cointelegraph.com/news/the-hong-kong-police-force-launch-metaverse-platform-cyberdefender",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/49b0e101-37da-43d5-bc04-017a7d59f5f1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The platform was launched to promote crime prevention in the metaverse as “all crimes in the cyberspace could also happen in the metaverse.\"</p>\n                    <p><p>The cyber security unit of the Hong Kong Police Force have launched CyberDefender, a new metaverse platform designed to educate the public of the potential dangers associated with Web3 and the metaverse.</p><p>According to a May 27 <a href=\"https://www.info.gov.hk/gia/general/202305/27/P2023052700671.htm\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, the Cyber Security and Technology Crime Bureau (CSTCB) of the Hong Kong Police Force unveiled a new metaverse platform, CyberDefender, in an effort to prepare its citizens for the “challenges ahead in the digital age” with a focus on technology crime prevention.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/0c530b54-46a4-44a2-b99d-c98192fc169c.png\"  /><figcaption style=\"text-align: center;\"><em>\"Exploring the Metaverse\" event in the CyberDefender metaverse on May 27. Source: Government of the Hong Kong Special Administrative Region.</em></figcaption></figure><p>On the same day that it launched, an online event was held “Exploring the Metaverse,\" spanning across three virtual venues, with the aim of discussing crime prevention strategies within the metaverse.</p><p>During the event, chief inspector of CSTCB, Mr Ip Cheuk-yu emphasized the importance of exercising caution in the metaverse, urging attendees to apply the same level of vigilance they practise while using the internet. He stated:</p><blockquote>“All crimes in the cyberspace could also happen in the metaverse, such as investment frauds, unauthorized access to systems, theft and sexual offenses.”</blockquote><p>He further explained that <a href=\"https://cointelegraph.com/news/7-defi-protocol-hacks-in-feb-sees-21-million-in-funds-pilfered-defillama\">decentralization could potentially</a> raise the risk of asset theft.</p><p>“The decentralized nature of virtual assets in Web3 may also increase the likelihood of cyber criminals targeting end point devices, virtual asset wallets and smart contracts” he said.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/32b82da6-6b97-41e6-ad7d-aff1fcf37805.png\"  /><figcaption style=\"text-align: center;\"><em>\"Exploring the Metaverse\" event in the CyberDefender metaverse on May 27. Source: Government of the Hong Kong Special Administrative Region.</em></figcaption></figure><p>The Hong Kong Police Force plans to ramp up its educational initiatives regarding technology crime, especially for \"the younger generation,\" after a significant rise in virtual asset crime was reported in Hong Kong.</p><p>It was revealed that 663 cases <a href=\"https://cointelegraph.com/news/hong-kong-s-losses-to-crypto-scams-doubled-to-217m-last-year-report\">involving virtual assets</a> was reported during Q1 2023, representing a total loss of $570 million – a 75% increase compared to Q1 2022. </p><blockquote>Police will continue to organize public educational initiatives on different themes through the \"CyberDefender Metaverse\" platform, raise the awareness among teenagers regarding the latest advancements in information technology, potential pitfalls and the importance of preventing technology crimes.</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/top-metaverse-property-investments-suffer-massive-losses-report\"><strong><em>Top metaverse property investments suffer massive losses: Report</em></strong></a></p><p>This comes after it was reported on May 22, that Nanjing, the capital city of China’s eastern Jiangsu province, launched the China Metaverse Technology and <a href=\"https://cointelegraph.com/news/chinese-city-launches-govt-backed-metaverse-platform\">Application Innovation Platform</a> to advance metaverse research and development across the country.</p><p>The innovaiton platform is being led by the Nanjing University of Information Science and Technology (NUIST).</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/forget-2022-how-metaverse-bounce-back-2023/\"><strong><em>How to resurrect the ‘Metaverse dream’ in 2023</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-05-28T06:38:32.000Z",
    "title": "Top 3 DeFi Protocols on Secret Network",
    "url": "https://www.altcoinbuzz.io/reviews/top-3-defi-protocols-on-secret-network/",
    "description": "<p>It&#8217;s no secret that we, at Altcoin Buzz, are big fans of Secret Network. Indeed, we believe that it&#8217;s one of the most promising privacy projects today. With its encryption technology, developers can control how we, as users, share our information. Aside from that, Secret is part of the thriving Cosmos ecosystem. This makes it [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/reviews/top-3-defi-protocols-on-secret-network/\">Top 3 DeFi Protocols on Secret Network</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]