[
  {
    "source": "Cointelegraph",
    "date": "2023-08-16T02:23:55.000Z",
    "title": "Caroline Ellison’s list of ‘Things Sam Is Freaking Out About’ could be used in trial",
    "url": "https://cointelegraph.com/news/things-sam-is-freaking-out-about-caroline-ellison-diary",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/4e542dcf-23bd-45e8-8a86-d22a46dca1df.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The prosecution intends to use Caroline Ellison's personal memos alongside a trove of other evidence against Sam Bankman-Fried at his criminal trial.</p>\n                    <p><p>Prosecutors intend to use personal notes and diary entries from Alameda Research CEO Caroline Ellison as evidence against FTX co-founder Sam Bankman-Fried at his criminal trial.</p><p>In an Aug. 14 <a href=\"https://www.courtlistener.com/docket/66631291/204/united-states-v-bankman-fried/\" target=\"_blank\" rel=\"noopener nofollow\">filing</a>, prosecutors said they would bring forward a collection of Ellison’s personal to-do lists and notes including one titled “Things Sam is Freaking Out About.”</p><p>The note summarizes conversations between Bankman-Fried and Ellison over his business concerns, fundraising, Alameda’s trading hedges and bad press about the hedge fund and FTX’s ties.</p><p>Other entries provide key insights into the day-to-day running of what prosecutors allege were fraudulent operations at FTX. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/9fbe3897-dc25-4d6a-beb4-8ce55a4035b0.png\"  /><figcaption style=\"text-align: center;\"><em>Highlighted excerpt of the prosecution's intent to introduce Ellison’s diaries and ledgers to trial. Source: CourtListener</em></figcaption></figure><p>The trove of evidence includes a recording of Ellison taken from an all-hands meeting on Nov. 9, 2022 — two days before FTX and Alameda <a href=\"https://cointelegraph.com/news/ftx-ftx-us-and-alameda-file-for-chapter-11-bankruptcy-in-us-sbf-resigns#:~:text=The%20collapse%20of%20a%20major,additional%20regulations%20for%20crypto%20firms.\">filed for bankruptcy</a>.</p><p>In a meeting, an Alameda employee reportedly asked Ellison who else had been aware of the shortfall in FTX user funds, to which Ellison answered: “Yeah, I mean, I guess I talked about it with, like, Sam, Nishad, and Gary.”</p><p>Gary Wang is a co-founder of FTX while Nishad Singh was the exchange's director of engineering. Both have pleaded guilty to fraud charges and are reportedly cooperating with prosecutors. </p><p>An employee pressed Ellisonon who made the decision to using FTXuser deposits to which Ellison reportedly answered: </p><blockquote>“Um . . . Sam, I guess.”</blockquote><p>Notably, the prosecution explained the horde of evidence including Ellison’s other diaries and personal notes doesn't constitute hearsay as Ellison took notes to memorialize information and help carry out her role in the conspiracy. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/former-ftx-ryan-salame-wont-testify-in-campaign-donation-case\"><strong><em>Ex-FTX exec Salame won’t testify in alleged illegal campaign donation case</em></strong></a></p><p>The prosecution also added that evidence concerning Bankman-Fried’s other alleged activities should also be admitted.</p><p>This includes allegedly falsified statements to an unnamed bank, the <a href=\"https://cointelegraph.com/news/sam-bankman-fried-charged-with-bribing-chinese-officials-court-docs\">bribery of Chinese officials</a> concerning frozen Alameda accounts, the <a href=\"https://cointelegraph.com/news/ftx-fallout-sbf-trial-could-set-precedent-for-the-crypto-industry\">manipulation of the exchange’s native FTX</a> token (<a href=\"https://cointelegraph.com/ftx-token-ftt-price-index\">FTT</a>) as well as selective prioritization of payments to creditors.</p><p>Bankman-Fried’s lawyers responded to the prosecution's motion in an Aug. 14 <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590940/gov.uscourts.nysd.590940.207.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> where they moved to exclude any evidence procured after July 1.</p><p>They argued prosecutors failed to produce specific information in a timely manner, including the contents of Wang’s laptop and Ellison’s encrypted Telegram chats. The defense claimed these delays had prevented them from adequately preparing for trial.</p><p>Bankman-Fried currently <a href=\"https://cointelegraph.com/news/us-prosecutors-say-sbf-will-be-tried-on-original-8-criminal-charges-for-now\">awaits his October trial</a> in Brooklyn’s Metropolitan Detention Centre <a href=\"https://cointelegraph.com/news/judge-orders-sam-bankman-fried-bail-revoked-following-allegations-witness-intimidation\">after the court revoked his bail</a> over allegations he leaked some of Ellison's diary entries to The New York Times.</p><p><strong><em>Big Questions: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-did-the-nsa-create-bitcoin/\"><strong><em>Did the NSA create Bitcoin?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]