[
  {
    "source": "Cointelegraph",
    "date": "2024-02-07T08:44:44.000Z",
    "title": " European Commission proposes criminalizing AI-powered child abuse ",
    "url": "https://cointelegraph.com/news/eu-commission-proposes-criminalizing-ai-child-sexual-abuse",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMzVhM2ExOTAtMjk4OS00YjMzLTgzNDctMGNmNmQ4MzE1OTViLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The widespread growth of generative AI has provided lawmakers with a clear motivation to review the regulations to facilitate crime reporting for child sexual abuse victims and provide relevant support.</p>\n                    <p><p data-ct-non-breakable=\"true\">The European Commission has announced that it is considering criminalizing artificial intelligence (AI)-generated imagery and deepfakes portraying child sexual abuse (CSA) to update laws in response to technological advancements.</p><p>The proposal <a href=\"https://home-affairs.ec.europa.eu/document/download/16f3c528-8e06-4ffb-9232-78aba198b43d_en?filename=Child%20Sexual%20Abuse%20recast%20Directive_en.pdf\" target=\"_blank\" rel=\"noopener nofollow\">includes</a> introducing a new criminal offense for live-streaming child sexual abuse. It also seeks to criminalize the possession and exchange of “pedophile manuals.” The proposal also mentions AI chatbots used for child abuse. </p><p>The commission aims to update 2011 rules with the proposal, suggesting changes to mandatory reporting of offenses. These measures are part of a broader package aimed at preventing child sexual abuse, enhancing online risk awareness, facilitating crime reporting for victims and providing support, including the right to financial compensation.</p><p><a href=\"https://cointelegraph.com/news/eu-commission-proposes-criminalizing-ai-child-sexual-abuse\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-07T08:49:30.000Z",
    "title": "Michael Saylor’s MicroStrategy Snaps Up 850 More Bitcoin For $37M",
    "url": "https://cryptodaily.co.uk/2024/02/michael-saylors-microstrategy-snaps-up-850-more-bitcoin-for-37m",
    "description": "Leading business intelligence and software company, MicroStrategy has added to its Bitcoin holdings, purchasing an additional 850 BTC for around $37.2 million."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T09:07:51.000Z",
    "title": "BlackRock’s Bitcoin ETF climbs to top ranks in US market",
    "url": "https://www.cryptopolitan.com/blackrocks-bitcoin-etf-climbs-to-top-ranks/",
    "description": "BlackRock&#8217;s iShares Bitcoin Trust exchange-traded fund (ETF) has rapidly ascended to the upper echelons of the United States ETF market, ranking among the top performers with significant inflows. The ETF, alongside Fidelity&#8217;s Bitcoin Fund, has demonstrated remarkable growth, attracting substantial investments since its recent approval for trading. Rapid ascent in the US ETF market BlackRock&#8217;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T09:05:36.000Z",
    "title": "Co-op Supermarkets Ramp Up Security Measures Amidst Soaring Crime Rates",
    "url": "https://www.cryptopolitan.com/co-op-supermarkets-ramp-up-security-measures/",
    "description": "Amidst a concerning surge in retail crime, the Co-op supermarkets have announced the installation of over 200 secure till kiosks and locked cabinets for spirits across its UK supermarkets. Additionally, the grocery giant is leveraging AI technology to monitor self-checkouts, aiming to curb the increasing incidents of theft and violence within its stores. Alarming rise [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T08:59:26.000Z",
    "title": "Binance delists Monero (XMR) amid regulatory concerns",
    "url": "https://www.cryptopolitan.com/binance-delists-monero-xmr-amid-regulatory/",
    "description": "In a move that sent shockwaves through the cryptocurrency community, Binance, one of the leading crypto exchanges, announced the delisting of Monero (XMR), a popular privacy-focused coin. Shortly after Treasury Secretary Janet Yellen&#8217;s call for cryptocurrency regulations, the decision sparked widespread speculation and criticism. Reasons for delisting and market impact The main reason for delisting [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T08:50:48.000Z",
    "title": "AI-Powered Trading Platform Redefining Portfolio Diversification Strategies",
    "url": "https://www.cryptopolitan.com/ai-trading-platform-redefining-portfolio/",
    "description": "In today&#8217;s ever-evolving financial landscape, investors are increasingly turning to cutting-edge technologies to optimize their portfolios. Among these innovations, the integration of artificial intelligence (AI) stands out as a game-changer, offering unparalleled opportunities for diversification while also posing unique risks. Unlocking portfolio diversification with AI AI-powered portfolio diversification is rapidly gaining traction among investors seeking [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T08:50:37.000Z",
    "title": "Are AI Companies the Casualties of National Security Reevaluation?",
    "url": "https://www.cryptopolitan.com/ai-companies-casualties-national-security/",
    "description": "In the ongoing saga of technological competition and geopolitical tensions, the U.S. Department of Defense has once again brandished the banner of &#8220;national security&#8221; to target Chinese semiconductors and other AI companies. This recurrent invocation of national security has broader implications, raising concerns about the politicization and securitization of economic and technological issues.&#160; This trend [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-07T08:40:08.000Z",
    "title": "Nigeria Analyst Debunks Crypto Blame for Forex Crunch",
    "url": "https://www.cryptopolitan.com/nigeria-analyst-debunks-blame-for-forex-crunch/",
    "description": "Abuja&#8217;s Bureau De Change operators have hit a snag, suspending their services amid a pronounced scarcity of U.S. dollars. This move has rippled through the capital&#8217;s economy, sparking speculations around the potential culprits behind this forex famine.&#160; Among the swirling theories, the role of cryptocurrency, particularly the peer-to-peer (P2P) market, has come under scrutiny. Yet, [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-07T08:59:44.000Z",
    "title": "Bitcoin Wallets Continues Declining Despite Growing ETF Interest, MicroStrategy Buys 850 More $BTC, Now Holding 190,000 BTC",
    "url": "https://nulltx.com/bitcoin-wallets-continues-declining-despite-growing-etf-interest-microstrategy-buys-850-more-btc-now-holding-190000-btc/",
    "description": "In the wake of the SEC&#8217;s approval of 11 Spot ETFs just four weeks ago, the number of wallets holding Bitcoin continues to dwindle. This trend is attributed to the prevailing fear, uncertainty, and doubt (FUD) among investors, alongside the increasing array of alternative investment options competing for attention. 📉 [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-07T08:51:19.000Z",
    "title": "Ethereum Witnesses Massive Withdrawals From Exchanges Amid ETF Speculation",
    "url": "https://nulltx.com/ethereum-witnesses-massive-withdrawals-from-exchanges-amid-etf-speculation/",
    "description": "Ethereum stakers and holders received encouraging news this week as reports surfaced of significant Ethereum withdrawals from crypto exchanges.  Over the past week alone, approximately $500 million worth of Ethereum was withdrawn from exchanges, contributing to a total outflow of $1.2 billion in Ethereum over the past month. Notably, around [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-07T08:45:55.000Z",
    "title": "Ticking Time Bomb: Bitcoin Mega Squeeze Predicted In The Next 10 Days",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-mega-squeeze-ticking-time-bomb-10-days/",
    "description": "Bitcoin has been moving sideways since mid-January, when the price broke out of a parallel upward channel to the downside. The BTC price is currently around the same price as on January 13. However, the time of dullness could soon be over, as the Bollinger Band Width (BBW) indicator signals. The BBW is derived from the Bollinger Bands themselves, which consist of a middle line (typically a simple moving average) surrounded by an upper and lower band. These bands expand and contract based on the standard deviation of the price from the mean, which is a measure of volatility. The BBW quantifies the degree of these bands&#8217; divergence or convergence by calculating the ratio of the difference between the upper and lower bands to the middle band. Bitcoin Mega Squeeze Incoming In an analysis on X (formerly Twitter), crypto analyst HornHairs has drawn attention to the BBW which currently shows a reading close to 0.11. This number is significant because it suggests that the bands are very close together, indicating a period of low volatility or a &#8216;squeeze.&#8217; He remarked: BTC MEGA VOL SQUEEZE: We probably have 10 days MAX before a huge move on BTC. Now&#8217;s the time to get your plan ready for either direction, don&#8217;t want to be stuck in a frozen panic with no plan if things launch upwards or nuke lower. It&#8217;s coming very soon. Historically, such a squeeze is often followed by a period of high volatility, as the market moves to find a new price equilibrium. The key takeaway from the BBW&#8217;s current low reading is that the market should prepare for a sharp increase in volatility, leading to a strong upward or downward movement in Bitcoin&#8217;s price. Related Reading: ARK Invest CEO Cathie Wood Believes Bitcoin Will Overtake Gold, Here’s Why The term &#8220;Mega Squeeze&#8221; used by HornHairs points to the unusually tight convergence of the Bollinger Bands, implying that the subsequent market move could be more pronounced than what is typically observed following a BBW contraction. The last few times the BBW approached such low levels, Bitcoin experienced significant price swings shortly thereafter. These historical precedents serve as a guide to what might occur in the days ahead. The last instance of the BBW reaching its current low was observed on October 13 last year. Subsequent to this indicator, BTC experienced a significant rally, ascending over 30% in a mere 10 days. In a contrasting scenario, mid-August 2023 saw the BTC value decline by 15% in just 8 days. Additionally, at the outset of January 2023, Bitcoin showcased a remarkable surge, escalating by 40% within a span of 17 days. Related Reading: Bitcoin Price Will Skyrocket To $280,000 Next Year: Hedge Fund Manager As of press time, Bitcoin was hovering around $42,900, with a recent peak at $49,000 and a local low at $38,600. These price points will be crucial to watch as the market navigates through this period of constricted volatility. The BBW suggests that the breakout, whether bullish or bearish, will likely drive the price towards or even beyond these levels, marking a new phase of market activity. Renowned crypto analyst CrediBULL commented on the emergence of the indicator: “Volatility soon. Big move coming. My bet is UP and the start of our next impulsive leg that we have been anticipating. Place your bets and pack your bags frens.” The next key resistance on the 1-day chart of BTC/USD is at $43,340 (0.236 Fibonacci retracement level), while the region at $39,800 (0.386 Fibonacci level) provides key support. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-07T08:44:12.000Z",
    "title": "Shimmer’s Roadmap Illuminates IOTA’s Evolution: From EVM Compatibility to Sustainable Tokenomics",
    "url": "https://www.crypto-news-flash.com/shimmers-roadmap-illuminates-iotas-evolution-from-evm-compatibility-to-sustainable-tokenomics/?utm_source=rss&utm_medium=rss&utm_campaign=shimmers-roadmap-illuminates-iotas-evolution-from-evm-compatibility-to-sustainable-tokenomics",
    "description": "<img width=\"1792\" height=\"1024\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-07-09.26.34-Visualize-a-roadmap-stretching-across-a-landscape-transitioning-from-a-high-tech-blockchain-like-environment-representing-EVM-compatibility-to-a-lu.webp\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-07-09.26.34-Visualize-a-roadmap-stretching-across-a-landscape-transitioning-from-a-high-tech-blockchain-like-environment-representing-EVM-compatibility-to-a-lu.webp 1792w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-07-09.26.34-Visualize-a-roadmap-stretching-across-a-landscape-transitioning-from-a-high-tech-blockchain-like-environment-representing-EVM-compatibility-to-a-lu-300x171.webp 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-07-09.26.34-Visualize-a-roadmap-stretching-across-a-landscape-transitioning-from-a-high-tech-blockchain-like-environment-representing-EVM-compatibility-to-a-lu-1200x686.webp 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-07-09.26.34-Visualize-a-roadmap-stretching-across-a-landscape-transitioning-from-a-high-tech-blockchain-like-environment-representing-EVM-compatibility-to-a-lu-768x439.webp 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-07-09.26.34-Visualize-a-roadmap-stretching-across-a-landscape-transitioning-from-a-high-tech-blockchain-like-environment-representing-EVM-compatibility-to-a-lu-1536x878.webp 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-07-09.26.34-Visualize-a-roadmap-stretching-across-a-landscape-transitioning-from-a-high-tech-blockchain-like-environment-representing-EVM-compatibility-to-a-lu-150x86.webp 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-07-09.26.34-Visualize-a-roadmap-stretching-across-a-landscape-transitioning-from-a-high-tech-blockchain-like-environment-representing-EVM-compatibility-to-a-lu-450x257.webp 450w\" sizes=\"(max-width: 1792px) 100vw, 1792px\" />Shimmer serves as a crucial development platform within the IOTA ecosystem, introducing significant technological advancements. The transition towards IOTA 2.0 marks a shift to sustainable tokenomics and enhanced programmability, reinforcing Shimmer&#8217;s role in the evolving Web3 domain. Shimmer emerges as a foundational pillar within the IOTA ecosystem, acting as a critical testbed for essential protocol [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-07T08:59:09.000Z",
    "title": "SEC Proposes New Regulations for DEXs Over $50M",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/sec-proposes-new-regulations-for-dexs-over-50m/",
    "description": "<p>Under the proposed regulations, any liquidity position exceeding $50 million on DEXs would require registration with the SEC. Decentralized exchanges have been at the forefront of the DeFi revolution. They offer users the ability to trade cryptocurrencies without the need for a centralized intermediary. SEC Aims for DeFi Market Integrity and Investor Protection By leveraging [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/sec-proposes-new-regulations-for-dexs-over-50m/\">SEC Proposes New Regulations for DEXs Over $50M</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]