[
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T03:21:37.000Z",
    "title": "Binance.US solves USD withdrawal issues but warns it won't last long",
    "url": "https://cointelegraph.com/news/binance-us-solves-usd-withdrawal-issues-warns-it-wont-last",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/e43a0a9a-98d1-4a14-8a7f-a202952b6aa8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>“While USD withdrawal remains fully operational on the platform today, we expect our banking partners to discontinue that service in the near future,” said Binance.US.</p>\n                    <p><p>U.S. crypto exchange Binance.US has informed customers it has resolved its U.S. dollar withdrawal issues after working with its banking partners but warns the relief may not last.</p><p>The reportedly independent subsidiary of crypto exchange Binance told customers in a June 22 update that its system remains fully operational and that USD withdrawal requests are expected to go back to their normal five-business-day turnaround. </p><p>On June 9, the exchange <a href=\"https://cointelegraph.com/news/binance-us-suspends-usd-deposits-warns-withdrawal-pause-incoming\">suspended dollar deposits</a> and notified its customers of an incoming pause to fiat withdrawal channels amid its ongoing battle with the Securities and Exchange Commission.</p><p>At the time, it also warned customers that its banking partners were preparing to pause fiat (USD) withdrawal channels as early as June 13, however, that didn't end up coming to pass as yet.</p><p>In its most recent statement, Binance.US has encouraged any customers that have a failed withdrawal attempt to resubmit their requests “as our systems remain fully operational,” but <a href=\"https://support.binance.us/hc/en-us/articles/15507453489943\" target=\"_blank\" rel=\"noopener nofollow\">cautioned</a> that the relief may not be permanent.</p><blockquote>“While USD withdrawal remains fully operational on the platform today, we expect our banking partners to discontinue that service in the near future.”</blockquote><p>Binance.US is also encouraging its users “use, withdraw, or convert your USD to a stablecoin to continue crypto-to-crypto trading,” as it transitions to a crypto-only exchange.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Reminder: As we transition to a crypto-only exchange, <a href=\"https://t.co/gM6e3xb9BX\">https://t.co/gM6e3xb9BX</a> will remove select USD Advanced Trading pairs from our platform on 6/26 at 8 p.m. PDT / 11 p.m. EDT.<br><br>While USD withdrawals remain fully operational, we encourage you to use, withdraw, or convert your… <a href=\"https://t.co/LWDWVvwtoq\">pic.twitter.com/LWDWVvwtoq</a></p>&mdash; Binance.US Customer Support (@BinanceUShelp) <a href=\"https://twitter.com/BinanceUShelp/status/1671981637276409859?ref_src=twsrc%5Etfw\">June 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Any remaining USD balances held in customer accounts could be converted into Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) at a future date, it noted.</p><p>The announcement also included details of more USDT trading pairs with ANKR, DAI, DASH, HBAR, ICX, IOTA, RVN, WAVES, XNO, XTZ, and ZIL being added on June 26.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-us-coins-trade-at-premium-amid-litigation-fears-fiat-gateway-issues\"><strong><em>Binance​.US coins trade at premium amid litigation fears, fiat gateway issues</em></strong></a></p><p>However, it noted that it will remove most “USD Advanced Trading pairs” from the platform on the same date. Of the 150 crypto assets that Binance.US supports, only BTC, ETH, ADA, BNB, LTC, MATIC, SOL, VET, USDC, and USDT will be tradable against the dollar. </p><p>The company has also had problems with banking partners in Australia. In May, Bitcoin prices <a href=\"https://cointelegraph.com/news/bitcoin-is-selling-for-5k-cheaper-on-binance-australia\">fell to a 20% discount</a> on the Australian branch of Binance when local banking and payments partners suspended their services causing a rush to sell and cash out. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/us-and-china-try-to-crush-binance-sbfs-40m-bribe-claim-asia-express/\">US and China try to crush Binance, SBF’s $40M bribe claim</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T03:14:30.000Z",
    "title": "Ethereum Price Consolidates Below $1,920: What Could Trigger A Fresh Increase?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-consolidates-1920/",
    "description": "Ethereum price is correcting gains from $1,930 against the US Dollar. ETH could start a fresh increase unless there is an extended decline toward $1,820. Ethereum is currently correcting lower from the $1,930 resistance. The price is trading above $1,850 and the 100-hourly Simple Moving Average. There was a break below a connecting bullish trend line with support near $1,900 on the hourly chart of ETH/USD (data feed via Kraken). The pair could rise further above the $1,900 and $1,930 resistance levels. Ethereum Price Is Stable Above $1,850 Ethereum’s price rallied above the $1,850 resistance zone. ETH even spiked above $1,900 before the bears appeared. A high is formed near $1,930 and the price is now correcting gains, similar to Bitcoin. There was a move below the $1,900 and $1,880 levels. The price traded below the 23.6% Fib retracement level of the upward move from the $1,715 swing low to the $1,930 high. Besides, there was a break below a connecting bullish trend line with support near $1,900 on the hourly chart of ETH/USD. Ether is still trading above $1,850 and the 100-hourly Simple Moving Average. Immediate resistance is near the $1,900 level. The next major resistance is near the $1,930 level. Source: ETHUSD on TradingView.com If the bulls manage to pump Ethereum above the recent high, the price might even surpass $1,950. The next resistance sits near $2,000, above which the bulls could aim a move toward the $2,050 level. Any more gains above the $2,050 resistance zone might send the price toward the $2,120 resistance. Are Dips Limited in ETH? If Ethereum fails to clear the $1,930 resistance, it could continue to move down. Initial support on the downside is near the $1,865 level. The next major support is near the $1,820 level and the 100-hourly Simple Moving Average. It is close to the 50% Fib retracement level of the upward move from the $1,715 swing low to the $1,930 high. If there is a break below the $1,820 support, the price could test $1,800. Any more losses may perhaps send the price toward the $1,750 zone or even $1,720 in the coming days. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now near the 50 level. Major Support Level – $1,820 Major Resistance Level – $1,930"
  }
]