[
  {
    "source": "BTCManager",
    "date": "2023-10-08T11:32:54.000Z",
    "title": "New research reveals the most common crypto scams in 2023",
    "url": "https://crypto.news/new-research-reveals-the-most-common-crypto-scams-in-2023/",
    "description": "Blackmail and ransomware are the most common crypto scams, a new research shows. Explore how to protect your funds."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-08T11:28:28.000Z",
    "title": "Dogecoin In A Dire Position As Daily Active Addresses Drop Drastically",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-in-a-dire-position-as-daily-active-addresses-drop-drastically/",
    "description": "Dogecoin, which began as a meme cryptocurrency, has demonstrated that it can compete successfully in the crypto market. Although Dogecoin is still the biggest meme crypto, on-chain data points to the crypto losing steam among whale investors. According to data from IntoTheBlock, the number of Dogecoin transactions valued at $100,000 or more has declined sharply over the past few months. Data also shows that the number of daily transactions has been on a steady decline since May. Related Reading: Here’s How Sam Bankman-Fried Allegedly Used Customer Funds On Alameda Research Dogecoin Whale Transactions  Dogecoin seems to be losing interest from whale traders. A deep dive into on-chain data from IntoTheBlock has shown Dogecoin witnessed only 651 whale transactions in the past 24 hours and 4.85k whale transactions throughout the week. This metric follows transactions above $100,000, but its current level is a pale reflection of Dogecoin&#8217;s past performance. At the height of the Dogecoin hype in 2021, whale transactions made up a sizable portion of all Dogecoin transfers, reaching as high as 39.3k transactions in one week.  A metric following the number of overall transactions has shown similar results of low volume. Dogecoin recorded a staggering increase of 8,220% in daily transactions to reach 2.08 million on May 27, but this count has since fallen to just 38,000 transactions in the past 24 hours. When daily active addresses decline this rapidly, it’s usually a sign that interest in the crypto asset is waning. DOGE market cap currently at $8.6 billion. Chart: TradingView.com Dogecoin has been on a downtrend for quite some time, although it is still the 9th largest crypto in terms of market cap. At the time of writing, Doge is trading at $0.06133, down by 3.59% in a monthly timeframe. The crypto has also witnessed a 22.24% drop in trading volume in the past 24 hours. Declining Interest In Dogecoin And Other Meme Coins The value of meme cryptocurrencies is highly dependent on hype and popularity rather than real-world utility. So, declining interest and activity among users and investors can be an issue. Related Reading: Binance Immense XRP Holdings Exposed In Detailed Proof of Reserves Report Shiba Inu has taken the attention of the crypto industry in the past few months, as it looks to elevate itself from being just a meme crypto. Other meme coins like Dogecoin and Dogelon Mars have struggled to receive interest from investors. According to on-chain analytics firm Santiment, social media talks about meme coins are now at their lowest level since 2020. Though the drop in transaction count is worrying, Dogecoin has defied the odds before. There’s a good chance that X (formerly Twitter) could incorporate Dogecoin payments into its platform. If this is implemented, it could serve as the next catalyst for Dogecoin&#8217;s growth. Featured image from Getty Images "
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-08T11:12:27.000Z",
    "title": "Cardano, Avalanche, and Polkadot: Are They Poised to Explode?",
    "url": "https://coinedition.com/cardano-avalanche-and-polkadot-are-they-poised-to-explode/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-3-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cardano recently climbed into the top 10 category of cryptocurrencies registered on CoinmarketCap, the popular crypto aggregation platform. As of the time of writing, the famous Proof-of-Stake blockchain ranked 8th among the 8,981 active cryptocurrencies listed on CoinmarketCap. Cardano’s native cryptocurrency, ADA, showed signs of strength while entering the final quarter of 2023. ADA  climbed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/cardano-avalanche-and-polkadot-are-they-poised-to-explode/\">Cardano, Avalanche, and Polkadot: Are They Poised to Explode?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]