[
  {
    "source": "Decrypt",
    "date": "2023-06-17T13:01:02.000Z",
    "title": "Elon Musk Denies Owning Dogecoin Stash Linked to Insider Trading",
    "url": "https://decrypt.co/145043/elon-musk-dogecoin-wallets-insider-trading",
    "description": "Musk’s lawyer says the claim that the Tesla CEO is secretly a DOGE whale is “without basis.”"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-17T13:06:37.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 BREAKING: Twitter to enable #crypto trading in partnership with eToro. Users searching using a $Cashtag symbol currently see live charts for a select few financial assets, like $LTC. Users will soon be able to click through to eToro &#38; have the option to invest in #Litecoin. Is Litecoin silver to Bitcoin&#8217;s ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-17T13:00:00.000Z",
    "title": "DigiToads P2E game is what Axie Infinity players have been waiting",
    "url": "https://crypto.news/digitoads-p2e-game-is-what-axie-infinity-players-have-been-waiting/",
    "description": "DigiToads is emerging as another crypto alternative for investors to consider amid falling AXS prices. TOADS presale has raised over $4.8 million"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-17T13:00:02.000Z",
    "title": "ZachXBT Slapped With Defamation Lawsuit For MachiBigBrother Exposé",
    "url": "https://www.newsbtc.com/crypto/zachxbt-slapped-with-defamation-lawsuit-for-machibigbrother-expose/",
    "description": "A throwback article just came back to haunt one of the crypto industry&#8217;s favorite crypto investigators. ZachXBT, a popular crypto on-chain sleuth recently got slapped with a defamatory lawsuit over an article he published last year.  The Controversial Article That Started It All Around a year ago, ZachXBT published an article accusing Jeffrey Huang aka MachiBigBrother, of embezzling crypto assets using various methods ranging from failed pump and dump tokens to NFT projects. The article quickly gained widespread attention at the time, but it has been largely forgotten up until this point.  Related Reading: Shiba Inu (SHIB) Positive Social Sentiment Sparks Bullish Speculation Jeffrey Huang, known online as Machi Big Brother, is a former Taiwanese-American musician and tech entrepreneur.  Huang has now filed a defamation lawsuit against ZachXBT, claiming the year-old article has damaged his reputation. Huang has insisted, at least according to a post that he published on Twitter, that ZachXBT&#8217;s charges are false and defamatory. As a result, he has decided to sue for defamation of character. A cursory reading of the article, on the other hand, reveals that it is an investigational piece that goes into considerable detail. In the article, ZachXBT provided on-chain data to back up his claims. The crypto sleuth initially accused Machi Big Brother of embezzling 22,000 ETH from Formosa Financial, a treasury management platform built for blockchain companies in 2018. Furthermore, ZachXBT then provided a list of other projects like Machi X and Wifey Finance. Total market cap still sitting above $1 trillion &#124; Source: Crypto Total Market Cap on TradingView.com How ZachXBT Is Fighting Back Against The Lawsuit ZachXBT is not taking this lawsuit lying down as he’s come out swinging against what he calls a baseless lawsuit with &#8220;an attempt to chill free speech.&#8221; ZachXBT has asked his followers and subscribers to support him against censorship and cancel culture, ensuring the truth survives.  He termed the whole situation as a &#8220;classic David &#38; Goliath story,” and many have spoken out on social media defending his right to express his opinions. Brown Rudnick, a law firm with its headquarters in Boston famous for defending Johnny Depp in his case against his ex-wife Amber Heard, has agreed to represent ZachXBT in the lawsuit. Related Reading: PEPE Jumps Nearly 10% In 24 Hours, Sparking Speculation Of A New Rally While lawsuits can be expensive to defend, ZachXBT says he will rely on donations from his followers to mount a proper defense. In this case, he says legal costs associated with the defense of this matter could easily exceed $1 million while providing a donation address. Donations have started to troop in. At the time of this writing, the address now contains more than $290,000.  The outcome of this case could have significant implications for crypto media and regulations around defamation and libel for public figures in the crypto industry.  Featured image from Legacy Design Strategies, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-17T13:00:31.000Z",
    "title": "Litecoin price to recover Ethereum and Tradecurve price predictions",
    "url": "https://www.crypto-news-flash.com/litecoin-price-to-recover-ethereum-and-tradecurve-price-predictions/?utm_source=rss&utm_medium=rss&utm_campaign=litecoin-price-to-recover-ethereum-and-tradecurve-price-predictions",
    "description": "Recently, Litecoin has faced challenges as its price experienced a downward trend. However, market analysts and experts now see a possible recovery in Litecoin&#8217;s price, taking into account price forecasts for Ethereum and Tradecurve. Read on to find out if Litecoin can experience a price recovery and check out the price forecasts for Ethereum and [...]"
  }
]