[
  {
    "source": "CoinDesk",
    "date": "2023-12-18T16:23:57.000Z",
    "title": "2024: The Year of Regulatory Compromises",
    "url": "https://www.coindesk.com/consensus-magazine/2023/12/18/2024-the-year-of-regulatory-compromises/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "After a year of conflict between crypto companies and agencies like the SEC and CFTC, we can expect to see greater dialogue and progress on regulation in 2024, says Michael Selig, of Willkie Farr & Gallagher."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-18T16:22:42.000Z",
    "title": "Revolut to Suspend UK Crypto Services Citing FCA's New Ad Rules: CityAM",
    "url": "https://www.coindesk.com/policy/2023/12/18/revolut-to-suspend-uk-crypto-services-citing-fcas-new-ad-rules-cityam/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Many crypto firms have had to withdraw their services to adjust to the FCA's promotions rules, which came into effect in October."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-18T16:20:07.000Z",
    "title": "Bitcoin ETF Ad War Officially Underway With Bitwise Campaign",
    "url": "https://www.coindesk.com/business/2023/12/18/bitcoin-etf-ad-war-officially-underway-with-bitwise-campaign/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The short video advertisement featured the actor known for portraying the \"Most Interesting Man in the World.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-18T16:30:56.000Z",
    "title": " EU Commission targets X over ‘dissemination of illegal content’ ",
    "url": "https://cointelegraph.com/news/eu-commission-twitter-dissemination-illegal-content",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNGM5MWUxMDMtOTM3YS00ZTUyLTk4MDItY2ViMmRjZDAzMzUxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>X owner Elon Musk told advertisers to “go fuck yourself” on Nov. 29 after many left the social media platform in response to antisemitic content and a report on hate speech. </p>\n                    <p><p>The European Commission said it had opened formal proceedings to investigate X — formerly Twitter — over content related to the terrorist group Hamas’ attacks against Israel.</p><p>In a Dec. 18 notice, the commission <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/IP_23_6709\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it planned to assess whether X violated the Digital Services Act for its response to misinformation and illegal content on the platform. According to the government body, X was under investigation for the effectiveness of its Community Notes — comments added to specific tweets aimed at providing context — as well as policies “mitigating risks to civic discourse and electoral processes.”</p><p>“The opening of formal proceedings empowers the Commission to take further enforcement steps, such as interim measures, and non-compliance decisions,” said the notice. “The Commission is also empowered to accept any commitment made by X to remedy on the matters subject to the proceeding.”</p><p><a href=\"https://cointelegraph.com/news/eu-commission-twitter-dissemination-illegal-content\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-18T16:10:58.000Z",
    "title": "Beyond JPEGs: Exploring the types of Bitcoin inscriptions",
    "url": "https://cryptoslate.com/beyond-jpegs-exploring-the-types-of-bitcoin-inscriptions/",
    "description": "<p>Introduced as a means to embed data within Bitcoin transactions, inscriptions—data or information embedded in a transaction that extends beyond the basic financial transaction details—extend the blockchain&#8217;s utility beyond financial exchanges. As of Dec. 18, the Bitcoin blockchain has witnessed the addition of approximately 47.36 million inscriptions, marking a notable development in its use. Inscriptions [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/beyond-jpegs-exploring-the-types-of-bitcoin-inscriptions/\">Beyond JPEGs: Exploring the types of Bitcoin inscriptions</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-18T16:30:25.000Z",
    "title": "Market Week in Review: Crypto’s Highs and Lows With ICP and SNX Leading the Charge and Retreat",
    "url": "https://news.bitcoin.com/market-week-in-review-cryptos-highs-and-lows-with-icp-and-snx-leading-the-charge-and-retreat/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/ggsg-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Week in Review: Crypto&#039;s Highs and Lows With ICP and SNX Leading the Charge and Retreat\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/ggsg-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/ggsg-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/ggsg-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/ggsg-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/ggsg-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/ggsg-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/ggsg.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Over the past week, bitcoin and ethereum experienced modest declines, ranging from 1.8% to 3.6%, when compared to the U.S. dollar. Concurrently, several crypto assets showcased impressive double-digit growth, with ICP, HNT, BONK, and WOO leading the surge throughout these seven days. 16 Crypto Assets Record Double-Digit Gains, 8 Witness Double-Digit Losses Commencing on Monday, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T16:34:37.000Z",
    "title": "Miner profits surge as Bitcoin transaction fees hit 20-month high",
    "url": "https://www.cryptopolitan.com/miner-profits-surge-as-bitcoin-transaction-fees-hit-20-month-high/",
    "description": "Bitcoin&#8217;s transaction fees have reached their highest levels in over 20 months, with an average fee of nearly $40, benefiting miners significantly.&#160; Despite some frustration among users, many industry figures argue that high fees are here to stay, pushing for the adoption of layer-2 solutions. Bitcoin&#8217;s Rising Transaction Fees As of December 2023, the average [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T16:30:46.000Z",
    "title": "Masa’s ZK-Data Network and Marketplace: Empowering Data Sovereignty",
    "url": "https://www.cryptopolitan.com/masas-zk-data-marketplace-data-sovereignty/",
    "description": "Masa, a company in the realm of personal data management, is poised to revolutionize how personal data is handled and monetized with the launch of its Zero-Knowledge (ZK) data network and marketplace. Slated for release in Q1 2024, the innovative platform is designed to empower individuals to take back control of their data, ensuring privacy [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T16:39:42.000Z",
    "title": "Bitcoin’s ranging price could trigger dip below $40k",
    "url": "https://crypto.news/bitcoins-ranging-price-could-trigger-dip-below-40k/",
    "description": "The decline in BTC price coincided with a significant supply zone, where some 1.8 million addresses scooped crypto's largest token by market cap."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T16:29:59.000Z",
    "title": "Zilliqa blockchain halts transactions due to block production issue",
    "url": "https://crypto.news/zilliqa-blockchain-halts-transactions-due-to-block-production-issue/",
    "description": "The Zilliqa blockchain network today encountered a significant technical disruption, impacting its block production. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-18T16:30:35.000Z",
    "title": "XRP Gets Rejected Down: Analyst Predicts Bottom Target",
    "url": "https://www.newsbtc.com/xrp-news/xrp-rejected-analyst-predicts-bottom-target/",
    "description": "An analyst has revealed the level of XRP might observe a pullback following the latest rejection in the cryptocurrency&#8217;s price. XRP Has Seen Rejection At Mid-line Of An Ascending Parallel Channel As explained by analyst Ali in a new post on X, XRP has appeared to have been moving inside an Ascending Parallel Channel recently. An &#8220;Ascending Parallel Channel&#8221; refers to a pattern in technical analysis that&#8217;s used for identifying uptrends and potential reversal points for any asset&#8217;s price. As the name already suggests, the pattern involves two parallel lines that make up the &#8220;channel&#8221; within which the price action is mostly contained. The upper line is made by connecting higher highs, while the lower one strings together higher lows. Related Reading: Analyst Rates Bitcoin As Most Promising Asset For 2024, Predicts Price Potential Of $120,000 At the upper line, the asset might be more likely to feel some resistance and get rejected back inside the channel, while the lower line could provide support to it. In the scenario that the price makes a breach of these channel lines, a sustained break might take place. Naturally, a breakout above the upper line would be a bullish one, while that below the lower one could signal the continuation of the bearish trend. Like the Ascending Parallel Channel, there is also the &#8220;Descending Parallel Channel,&#8221; which is obviously a pattern used whenever the market is showing a clear trend towards the downside. Now, here is the chart shared by Ali that shows an Ascending Parallel Channel that XRP has been stuck inside for quite some time now: The parallel channel that the asset has been moving inside recently &#124; Source: @ali_charts on X As is visible in the graph, XRP&#8217;s price top back in July of this year coincided with a temporary break above the upper line of this Ascending Parallel Channel pattern. Since this rejection, the asset hasn&#8217;t yet been able to revisit the level. In the chart, the analyst has also drawn a third line: the mid-point between the two parallel trend lines of the pattern. This line has also appeared to have acted as resistance for XRP during the duration it has traveled inside the channel, as it has often hit local tops on interactions with it. Recently, after bottoming out at the lower level following the earlier rejection, the asset climbed towards this middle line and made a retest of it. The coin appears to have been rejected from it, however, as it has been sliding down since then. &#8220;After facing rejection at the channel&#8217;s mid-line, XRP might see a pullback toward the lower boundary, around $0.55,&#8221; explains Ali. At the time the analyst had posted the chart, the asset had been trading around $0.618, but since then, it has observed a further 5% drawdown. Related Reading: Bitwise Reveals Two Major Triggers That Will Send Bitcoin Price To $80,000 With the coin continuing to show decline, it would appear possible that it might go all the way to the $0.55 level Ali has pointed out, before finding a potential reversal. From the current price, such a drop would suggest a decrease of over 6%. XRP Price XRP has plunged towards $0.585 today as the cryptocurrency market as a whole has seen red returns. Looks like the price of the asset has seen a sharp decline during the past day &#124; Source: XRPUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-18T16:35:36.000Z",
    "title": "Ethereum’s NFT Revolution: Casio Launches Virtual G-Shock Watches",
    "url": "https://www.crypto-news-flash.com/ethereums-nft-revolution-casio-launches-virtual-g-shock-watches/?utm_source=rss&utm_medium=rss&utm_campaign=ethereums-nft-revolution-casio-launches-virtual-g-shock-watches",
    "description": "<img width=\"1280\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/nft-g2bda71314_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Casio\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/nft-g2bda71314_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/nft-g2bda71314_1280-300x300.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/nft-g2bda71314_1280-1024x1024.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/nft-g2bda71314_1280-150x150.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/nft-g2bda71314_1280-768x768.png 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Casio introduces 2,000 limited edition G-Shock NFTs, blending art and durable watch tradition, starting at 0.1 ETH. NFT owners enjoy exclusive perks, including G-Shock lab tours and design discussions, fostering community engagement. Casio, the renowned Japanese electronics company, has unveiled an exciting new venture at the intersection of technology and horology. The company has launched [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-18T16:18:29.000Z",
    "title": "Shiba Inu Price Skyrockets: Will it Surpass BONK and DOGE After Binance’s Game-Changing Move?",
    "url": "https://www.crypto-news-flash.com/shiba-inu-price-skyrockets-will-it-surpass-bonk-and-doge-after-binances-game-changing-move/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-price-skyrockets-will-it-surpass-bonk-and-doge-after-binances-game-changing-move",
    "description": "<img width=\"1200\" height=\"600\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/shiba-6763358_1920-1200x600-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shiba Inu Holding a $GOLDEN Token\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/shiba-6763358_1920-1200x600-1.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/shiba-6763358_1920-1200x600-1-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/shiba-6763358_1920-1200x600-1-1024x512.jpg 1024w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Shiba Inu experiences a significant price surge, reaching a new peak for 2023 at over $0.000012, propelled by Binance&#8217;s recent introduction of a SHIB/FDUSD trading pair with zero maker fees. Binance&#8217;s decision to waive maker fees on the SHIB/FDUSD trading pair acts as a strategic catalyst, fostering increased trading activity. Shiba Inu (SHIB) witnessed a [...]"
  }
]