[
  {
    "source": "CryptoSlate",
    "date": "2024-03-13T00:30:57.000Z",
    "title": "TRON Network integrated with Token Terminal",
    "url": "https://cryptoslate.com/tron-network-integrated-with-token-terminal/",
    "description": "<p>Zürich, Switzerland, March 12, 2024 &#8211; TRON DAO has collaborated with Token Terminal, integrating the TRON network’s data into Token Terminal’s sophisticated suite of data analytics tools. This collaboration promises to transform the way investors and analysts access and leverage TRON’s data. Token Terminal&#8217;s Data Partnership is a comprehensive on-chain data analytics service for L1s, [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/tron-network-integrated-with-token-terminal/\">TRON Network integrated with Token Terminal</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-13T00:30:35.000Z",
    "title": "Shiba Inu Whales Are Accumulating SHIB, Do They Know Something You Don’t?",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-whales-shib/",
    "description": "Shiba Inu (SHIB) whales have been busy in the market lately, as on-chain data suggests that they are positioning themselves for more moves to the upside from the meme coin. This development comes as the crypto token inches close to its all-time high (ATH).  Shiba Inu Whale Accumulates 332 Billion SHIB Tokens On-chain data shows that over 332 billion SHIB was sent from the trading firm Cumberland to a wallet linked with the crypto trading platform Robinhood. While the nature of the transaction remains unclear, further data from Etherscan shows that the Robinhood-linked wallet has been accumulating SHIB on a large scale these past few days.  Related Reading: Crypto Expert Reveals Why Bitcoin Could Hit $200,000 By April Besides the single transaction of 332 billion SHIB, the wallet has also seen millions of SHIB tokens flow into it. A plausible explanation is the fact that the trading platform is seeing increased interest in the meme coin from its customers and has had to stack up on its SHIB holdings. Data from Arkham Intelligence shows that Robinhood holds almost 40 trillion SHIB tokens.   Meanwhile, Robinhood looks to be just one of many platforms on which SHIB trading has heightened. On-chain data shows that crypto exchange Crypto.com has significantly increased its SHIB holdings in the last 24 hours. Notably, there was an inflow of 2 trillion SHIB tokens sent from one of the crypto exchange’s hot wallets to another.  NewsBTC had recently reported that SHIB had seen a 20 times increase in March from its February average of daily new addresses. Therefore, it is not surprising that there is an increase in SHIB trading on these platforms.  This explosion in SHIB’s adoption is believed to be due to the parabolic surge in the meme coin’s price this month, with investors looking to position themselves ahead of more potential price surges.  Shiba Inu’s Price Expected To Keep Rising Crypto analyst Ali Martinez recently laid out a scenario where SHIB’s price could rise to as high as $0.000052. Moreover, the crypto token looks to be reclaiming the support level of $0.000033, which the analyst highlighted as critical. SHIB’s bullish momentum is buoyed by the fact that meme coins are gaining traction as one of the leading narratives in this bull cycle. Related Reading: 94 Million XRP Exits Binance As Bulls Reclaim Control, What’s Going On? Crypto analyst Michaël van de Poppe also mentioned that altcoins like SHIB are still undervalued, meaning there is still room for a further upward trend. The analyst expects these crypto tokens to break their ATH or move close to it when they make their next run.  At the time of writing, SHIB is trading at around $0.00003256, up in the last 24 hours according to data from CoinMarketCap. SHIB price at $0.000032 &#124; Source: SHIBUSDT on Tradingview.com Featured image from Binance, chart from Tradingview.com"
  }
]