[
  {
    "source": "CoinDesk",
    "date": "2023-09-25T20:14:25.000Z",
    "title": "U.S. Shutdown, Assuming It Doesn’t Run Long, Will Slow, Not Cripple Crypto Efforts",
    "url": "https://www.coindesk.com/policy/2023/09/25/us-shutdown-assuming-it-doesnt-run-long-will-slow-not-cripple-crypto-efforts/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The crypto industry’s business in Washington is coming to a head just as a looming congressional budget impasse could shut down an array of federal services next week. But the digital assets sector can expect its most important matters won’t go entirely dark, experts suggest, even if they’re dragged out longer than crypto firms had hoped."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-25T20:19:59.000Z",
    "title": "mBridge CBDC project preparing for new members, launch of minimum viable product",
    "url": "https://cointelegraph.com/news/mbridge-cbdc-project-preparing-new-members-minimum-viable-product",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/0eec1509-7074-4e59-99ac-7370451f3967.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The project now includes central and commercial banks of China, Hong Kong, Thailand and the UAE. Future new members were not identified. </p>\n                    <p><p>Project mBridge may soon see significant expansion, according to Hong Kong Monetary Authority (HKMA) CEO Eddie Yue. He <a href=\"https://www.bis.org/review/r230925d.htm\" target=\"_blank\" rel=\"noopener nofollow\">outlined</a> the plans for the central bank digital currency (CBDC) project in a speech in Shanghai.</p><p>Yue said tests have shown mBridge to provide faster, cheaper and more transparent cross-border payments. The project was initiated in 2021 with the participation of the HKMA, and the central banks of China, Thailand and the United Arab Emirates, as well as commercial banks from each of those jurisdictions and the Bank for International Settlements Innovation Hub (BISIH). </p><p>Now mBridge will expand and be commercialized. Yue said:</p><blockquote>“We are expecting to welcome more fellow central banks to join this open platform. And very soon we will launch what we call a minimum viable product, with the aim of paving the way for the gradual commercialisation of mBridge.”</blockquote><p>Central banking officials connected with the project have said previously that a central bank does not have to have its own CBDC to participate in it. All of the current participants have CBDCs at the stage of pilot projects. The only countries that have launched CBDCs are the Bahamas, Jamaica and Nigeria, according to the website <a href=\"https://cbdctracker.org/\" target=\"_blank\" rel=\"noopener nofollow\">cbdctracker.org</a>.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/digital-yuan-app-adds-prepaid-mastercard-visa-payments-tourists\">Digital yuan app adds prepaid Mastercard, Visa top-ups for tourists</a></em></strong></p><p>mBridge’s progress has already been noticed in the United States Congress. Ranking member of the House Financial Services Committee Maxine Waters <a href=\"https://cointelegraph.com/news/dems-speak-up-global-leadership-us-cbdc-republicans-fear-dark-side\">expressed her concern</a> during the markup of Representative Tom Emmer’s CBDC Anti-Surveillance State Act on Sept. 20 that the project could be leveraged to evade economic sanctions. The key to effective sanctions <a href=\"https://cointelegraph.com/news/crypto-s-impact-on-sanctions-are-regulators-concerns-justified\">evasion by CBDCs is adoption</a>, experts say.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/56550a57-9f11-4e02-a47a-00e8f292a9c4.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Commercial banks participating in Project mBridge. Source: BISIH</em></figcaption></figure><p>mBridge is the only international CBDC project China has taken part in. Its digital yuan is by far the world’s largest CBDC pilot, and the People’s Bank of China has made several deals with international companies and commercial banks to further the adoption of the digital yuan. Thus, <a href=\"https://cointelegraph.com/news/bnp-paribas-teams-up-with-bank-of-china-to-promote-digital-yuan-usage\">BNP Paribas China</a> and <a href=\"https://cointelegraph.com/news/crypto-friendly-dbs-bank-launches-digital-yuan-payment-tool\">DBS Bank China have made</a> integrations with the digital yuan available to their corporate clients in 2023. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Eddie Yue Wai-man, chief executive of the Hong Kong Monetary Authority, was appointed to a key post at the Bank for International Settlements, a top international financial institution backed by most of the world’s central bank  <a href=\"https://t.co/ZY7a78gFBL\">https://t.co/ZY7a78gFBL</a></p>&mdash; Caixin Global (@caixin) <a href=\"https://twitter.com/caixin/status/1702440454556356775?ref_src=twsrc%5Etfw\">September 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/real-reason-chinas-war-on-crypto-3ac-judges-embarrassing-mistake-asia-express/\">Real reason for China’s war on crypto, 3AC judge’s embarrassing mistake: Asia Express</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-25T20:30:46.000Z",
    "title": "Global trade nosedives: Fastest fall since COVID",
    "url": "https://www.cryptopolitan.com/global-trade-fastest-fall-since-covid/",
    "description": "Echoes from the past are resounding in the present. Global trade, the powerhouse of the world&#8217;s economy, is experiencing its most rapid descent since the early tumultuous days of the COVID-19 pandemic. The figures, freshly unveiled, paint a concerning portrait of the world&#8217;s economic health, with the pulse of commerce and industry weakening unmistakably. A ... <a title=\"Global trade nosedives: Fastest fall since COVID\" class=\"read-more\" href=\"https://www.cryptopolitan.com/global-trade-fastest-fall-since-covid/\" aria-label=\"More on Global trade nosedives: Fastest fall since COVID\">Read more</a>"
  }
]