[
  {
    "source": "Decrypt",
    "date": "2023-08-07T09:59:17.000Z",
    "title": "$1.8M Bounty Now Open to Public as Curve Finance Hacker Misses Deadline",
    "url": "https://decrypt.co/151555/1-8m-bounty-now-open-public-curve-finance-hacker-misses-deadline",
    "description": "The Curve bounty sits at 10% of the stolen funds, roughly $1.85 million, and was announced via an on-chain Ethereum message. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-07T09:54:35.000Z",
    "title": "Singapore Red Cross starts accepting crypto donations",
    "url": "https://cointelegraph.com/news/singapore-red-cross-accept-crypto-donation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/85db6722-8ef4-470d-9719-3397b06f13a7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Humanitarian aid and community services charity, Red Cross Singapore, included cryptocurrency as a newly-accepted form of donation. </p>\n                    <p><p>Humanitarian aid and community services charity, Singapore Red Cross, included cryptocurrency as a newly-accepted form of donation. The organization will accept Bitcoin, Ether, Tether and USD Coin donations. </p><p>On August 7, Singapore Red Cross <a href=\"https://ffnews.com/newsarticle/cryptocurrency/singapore-red-cross-partners-with-triple-a-to-accept-cryptocurrency-donations/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> its partnership with the first crypto payment gateway licensed by the Monetary Authority of Singapore, Triple-A, to enable the option of anonymous donations in crypto. All donations will be converted into fiat currency and settled via bank transfer within one business day. </p><p>Benjamin William, Secretary General and CEO of the Singapore Red Cross shared his enthusiasm toward the new segment of tech-savvy donors: </p><blockquote>“By accepting digital currencies, we open our doors to a new segment of donors who are tech-savvy and wish to make a difference through their digital assets.”</blockquote><p>\"Enabling cryptocurrency donations also opens more opportunities for the new generation of donors who are au fait with digital currencies to consider philanthropy and helping the vulnerable,\" William further explained. </p><p>The crypto payment option is already <a href=\"https://redcross.sg/donate-crypto-currency\" target=\"_blank\" rel=\"noopener nofollow\">available</a> on the Singapore Red Cross website. Along with four popular digital currencies the payment gateway offers a separate solution for donating from Binance digital wallet. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/singapore-to-require-crypto-firms-to-put-user-assets-into-trusts-by-year-end\"><strong><em>Singapore to require crypto firms to put user assets into trusts by year-end</em></strong></a></p><p>In July, the High Court of Singapore <a href=\"https://cointelegraph.com/news/crypto-singapore-high-court-rules-crypto-personal-property-compares-it-to-fiat-money\">declared crypto a private property</a>, which doesn’t differ in principle from fiat money and could be classified in the category of “things in action.” In British common law, that means a type of property over which personal rights could be claimed or enforced by legal action, not by taking physical possession.</p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk. What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-07T09:57:17.000Z",
    "title": "UK Resident Looking For Job? NCA Ramps Up Recruitment for Crypto Crime Division",
    "url": "https://cryptobriefing.com/nca-ramps-up-recruitment-crypto-crime-division/?utm_source=feed&utm_medium=rss",
    "description": "The UK's National Crime Agency expands efforts to counter crypto crimes, announcing key positions for its Complex Financial Crime Team."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-07T09:49:33.000Z",
    "title": "Chancer Announces BitMart Exchange Listing as Presale Races Past $1m Mark",
    "url": "https://www.cryptoglobe.com/latest/2023/08/chancer-announces-bitmart-exchange-listing-as-presale-races-past-1m-mark/",
    "description": "London, United Kingdom, August 7th, 2023, Chainwire Chancer, one of the most exciting new crypto projects in 2023, has raced past the significant $1 million fundraising milestone. This coincides with the announcement that their first exchange listing will take place on BitMart – a hugely popular exchange with users in over 180 countries with a trading […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-07T09:39:47.000Z",
    "title": "$XRP: Top Crypto Analyst on the Two Primary Reasons for XRP’s Retracement",
    "url": "https://www.cryptoglobe.com/latest/2023/08/xrp-top-crypto-analyst-on-the-two-primary-reasons-for-xrps-retracement/",
    "description": "XRP has recently experienced a significant retracement, causing ripples of concern among some investors. This downward trend follows a rally triggered by a favorable ruling in the Ripple case. However, the U.S. Securities and Exchange Commission’s (SEC) contemplation of an appeal against the verdict has led to a decline in investor confidence and a subsequent […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-07T09:54:30.000Z",
    "title": "Indian government uses G20 presidency to tout coordinated crypto rules",
    "url": "https://cryptodaily.co.uk/2023/08/indian-government-uses-g20-presidency-to-tout-coordinated-crypto-rules",
    "description": "<p>The Indian government is using its time as president of the G20 nations to drum up support for globally coordinated regulation of crypto assets.</p>\nGetting tough on digital assets\n<p>The Indian government, along with its central bank, has been a harsh critic of cryptocurrencies for some time now. Therefore, it comes as little surprise that India is using its time as president of the G20 nations to try to implement coordinated regulations that will get tough on digital assets.</p>\n<p>As India uses its influence to suppress cryptocurrencies, ably assisted by global financial institutions such as the International Monetary Fund (IMF) and the Financial Stability Board (FSB) among others, it often resorts to claims that it is doing so in order to ensure monetary stability, and it continually refers back to the FTX collapse as a reason for doing so.</p>\nProtecting the banking system?\n<p>Ensuring monetary stability might well mean protecting a banking system that is on the verge of collapse - only able to support itself by printed money out of the magician&rsquo;s hat wielded by the US Federal Reserve. This &lsquo;money&rsquo; out of thin air is claimed to &ldquo;cost nothing&rdquo;, and for the Federal Reserve this may well be the case. However, for the vast majority of the world&rsquo;s citizens this means more currency flooding the economy and &lsquo;debasement&rsquo; of their purchasing power.&nbsp;</p>\n<p>As for the FTX debacle, which is used by those doing the bidding of the bankers to tarnish the entire crypto industry, there are many unanswered questions as to how Sam Bankman&rsquo;s empire grew out of nothing, and how such fraud was allowed to take place right under the nose of the SEC.</p>\nRisks\n<p>Be that as it may, India will go ahead and promote a &ldquo;Synthesis Paper&rdquo; which is being produced by the IMF and the FSB that will enable the perceived &lsquo;risks&rsquo; of cryptocurrencies to be dealt with.</p>\n<p>These &lsquo;risks&rsquo; might include that the people use their fiat currencies to buy such assets as bitcoin (God forbid) in order to protect themselves from the crushing debasement that is taking place.&nbsp;</p>\n<p>The risks do include the possibility of a &ldquo;spillover&rdquo; from crypto into the traditional financial system. But how a fledgling ecosystem of around $1.2 trillion is going to affect the traditional financial system of $hundreds of trillions remains to be seen.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T10:09:00.000Z",
    "title": "HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?",
    "url": "https://www.cryptopolitan.com/hbar-price-prediction/",
    "description": "HBAR Price Prediction 2023-2032 Hedera Hashgraph is a trending cryptocurrency focused on providing a sustainable, enterprise-grade blockchain.&#160; The asset has been performing extremely well recently, prompting investors everywhere to search for a Hedera Hashgraph price prediction. So that is a heads-up in crypto winter despite the doom which tends to pull everyone else connected to ... <a title=\"HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hbar-price-prediction/\" aria-label=\"More on HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T09:52:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. BNB prices have dropped by 23.95% since April 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-07T10:00:52.000Z",
    "title": "Behind The Quiet: Low Bitcoin Volatility Masks Underlying Market Dynamics",
    "url": "https://www.newsbtc.com/news/bitcoin/low-bitcoin-volatility-masks-underlying-dynamics/",
    "description": "In the world of Bitcoin, silence is not always golden. The recent weeks have seen Bitcoin&#8217;s price volatility drop to historical lows, with the BTC price trading mostly between $29,000 and $30,000. However, beneath this placid surface, a number of intriguing market dynamics are at play. &#8220;Realized volatility for Bitcoin has collapsed to historical lows. Across 1-month to 1yr timeframes, this is the quietest we have seen the corn since after March 2020. Historically, such low volatility aligns with the post-bear-market hangover periods (re-accumulation phase),&#8221; stated Checkmate, lead on-chain analyst at Glassnode. The chart shared by Checkmate shows that annualized realized volatility resembles the post-bear era for Bitcoin from March 2020 when volatility was at 47%. Currently, 1-year volatility sits at 49.1%, 3-month volatility at 35.5%, and 1-month volatility at 22.9%. Quit Before The Storm For Bitcoin However, the low volatility is not the only story. Checkmate also highlighted a new all-time high for Bitcoin&#8217;s long-term holder supply, now at 14.59M BTC, which accounts for 75% of the circulating supply. This shows that an increasingly high number of Bitcoin investors are convinced of a future rally, leading to a supply shortage, while high risk traders are washed out of the market due to lacking volatility. Related Reading: Crypto Analyst Points To Bitcoin Price History Repeating Itself – Are The Signs Bullish? Simultaneously, there&#8217;s a surge in institutional positioning; volume and open interest of the CME Bitcoin futures have reached a 20-month high in July. Despite the Bitcoin spot markets recording low volumes, the CME futures saw the highest volume since January 2022, with $55.8 billion in July. The CTFC data reveals a fascinating slugfest between two investor groups. Asset managers are $1.2 billion net long, while hedge funds are net short by -$980 million. This standoff suggests an imminent breakout in Bitcoin&#8217;s price, potentially leaving one of these groups with burnt fingers. On-chain analyst Ali Martinez provided further insight: &#8220;Even as Bitcoin dropped from $32,000 to $29,000, the number of new BTC addresses steadily rose! This bullish divergence between price and network growth hints at a stable long-term BTC uptrend. Buy the dip!&#8221; Indeed, the current low volatility phase is not without precedent or predictive power. Renowned analyst @CryptoCon provides a compelling perspective on this, stating that such periods of sideways price action are not only normal but potentially bullish. &#8220;Bitcoin sideways price action at this point in the cycle is completely normal! The 2 Week Mass Index crosses into the golden pocket at the most stagnant cycle points, just before massive bullish moves. Data everywhere points to the same conclusion: Low volatility is bullish,&#8221; CryptoCon tweeted. Chris Burniske, partner at Placeholder VC, also shared his perspective on the current market dynamics. &#8220;Currently, tourists are inactive while residents are accumulating swiftly, owning 74.8% of all supply. That&#8217;s consistent with an early-stage bull market. Thirty percent of BTC has left for cold storage since 2020, leaving exchanges with 2.26 million. Bitcoin seems fairly valued relative to the number of active entities on the network.&#8221; Related Reading: Tether May Now Be 11th Largest Bitcoin Holder, Analyst Says Burniske&#8217;s simplified price/cycle model projects Bitcoin to reach near $39,000 by the fourth quarter of 2023 and $92,000 (base scenario) by Q4 2025 with entities above 600,000. In conclusion, the current low volatility phase of Bitcoin may seem uneventful on the surface, but the underlying market dynamics suggest a different story. The tug-of-war between asset managers and hedge funds, the steady rise in new BTC addresses, and the swift accumulation by long-term holders all hint at a brewing storm. At press time, the Bitcoin price was at $29,076. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-07T10:00:22.000Z",
    "title": "Ripple (XRP) Price Prediction – Hedera Eyes Revival As Pomerdoge Presale Ignites Bullish Sentiments",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-price-prediction-hedera-eyes-revival-as-pomerdoge-presale-ignites-bullish-sentiments/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-xrp-price-prediction-hedera-eyes-revival-as-pomerdoge-presale-ignites-bullish-sentiments",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T085717.280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T085717.280.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T085717.280-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-07T085717.280-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Although 2023 began on a bullish note, the second half of the year has its own set of challenges. Several major cryptocurrencies like Ripple (XRP) and Hedera (HBAR) have been struggling to post positive growth. But, amidst this chaos, a new P2E gaming cryptocurrency, Pomerdoge, is likely to post exceptional growth during its ongoing presale. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-07T09:42:49.000Z",
    "title": "Pundits Sound Alarm as Australia Goes Cashless, Millions Reject CBDCs Seek Monero, ZCash and Dash for Financial Freedom",
    "url": "https://www.crypto-news-flash.com/pundits-sound-alarm-as-australia-goes-cashless-millions-reject-cbdcs-seek-monero-zcash-and-dash-for-financial-freedom/?utm_source=rss&utm_medium=rss&utm_campaign=pundits-sound-alarm-as-australia-goes-cashless-millions-reject-cbdcs-seek-monero-zcash-and-dash-for-financial-freedom",
    "description": "<img width=\"1280\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/australia-ga40491315_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/australia-ga40491315_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/australia-ga40491315_1280-300x300.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/australia-ga40491315_1280-1024x1024.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/australia-ga40491315_1280-150x150.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/australia-ga40491315_1280-768x768.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/australia-ga40491315_1280-24x24.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/australia-ga40491315_1280-36x36.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/australia-ga40491315_1280-48x48.png 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Australia&#8217;s transition to a cash-free society is amplifying the role of cryptocurrencies, including Monero, ZCash, and Dash, as alternative payment methods. The rejection of CBDCs and embrace of decentralized currencies mark a critical shift, with user base and decentralized exchange volume growing significantly. Following update to our previous post on the Bank of England Closing [...]"
  }
]