[
  {
    "source": "CoinDesk",
    "date": "2023-06-02T17:31:17.000Z",
    "title": "Bridge Exploits Cost $2B in 2022, Here’s How They Could Have Been Averted",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/02/bridge-exploits-cost-2b-in-2022-heres-how-they-could-have-been-averted/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The bridges that are essential to our multi-chain cryptoverse are vulnerable to hacks. But an analysis of some of the biggest exploits of the past year reveals that applying multiple security measures in combination could have blocked the attacks, writes Gnosis co-founder Martin Koppelmann."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-02T17:24:17.000Z",
    "title": "Stablecoins are a critical countermeasure to Operation Chokepoint",
    "url": "https://cointelegraph.com/news/stablecoins-countermeasure-operation-chokepoint",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a7f0bc14-fda7-469d-8c29-1ecdb8bfa59d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Stablecoins could help crypto firms to remove themselves from the banking system — and prevent the U.S. government from cutting off their financial lifelines.</p>\n                    <p><p>Boosting financial inclusion is one of crypto’s strongest value propositions. Yet, ironically, the banking crisis has effectively de-banked the crypto industry itself, at least in the United States.</p><p>How things panned out with Silvergate, Silicon Valley Bank and Signature — the three crypto-friendly U.S. banks — reeks of what Nic Carter called “Operation Chokepoint 2.0.” There’s good merit to this claim, though naysayers peddle conspiracy theory allegations with much harshness.</p><p>Signature, for one, did not face a bank run. The Federal Deposit Insurance Corporation still took the bank over in a jiffy. Anonymous sources even alleged <a href=\"https://cointelegraph.com/news/fdic-asked-signature-buyers-to-stop-all-crypto-business-report\">the FDIC had asserted</a> that any purchaser “must agree to give up all the crypto business,” though the agency walked back those claims.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I don&#39;t want to alarm, but since the turn of the year, a new Operation Choke Point type operation began targeting the crypto space in the US. it is a well-coordinated effort to marginalize the industry and cut of its connectivity to the banking system - and it&#39;s working</p>&mdash; nic  carter (@nic__carter) <a href=\"https://twitter.com/nic__carter/status/1622973966360133634?ref_src=twsrc%5Etfw\">February 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Crypto not only has the resilience but also the tools to fight back — by leveraging stablecoins to minimize bank dependence. Besides solving an immediate crisis, it can also provide the ground to establish crypto as a self-sufficient and parallel financial system. That was Satoshi’s vision, after all. </p><h2>U.S. regulators are shooting themselves in the foot</h2><p>There’s a reason why most regulatory authorities — except in some progressive jurisdictions — have their guns blazing for crypto. Their power rests on the toxic relationship between governments, money printers, big corporations and oligopolies disguised as banking systems. The non-intermediated, permissionless and autonomous systems that crypto enables threatens this anti-individual nexus to its very core.</p><p>Our journey toward a more equitable, individual-centric world of crypto was never meant to be easy. The hyper-aggressive response from regulators is also pretty much in line with the expectations. But somehow the authorities, especially in the U.S., don’t seem to realize that their actions are self-destructive.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/do-bank-failures-amount-to-intentional-regulatory-demolition\"><strong><em>Did regulators intentionally cause a run on banks?</em></strong></a></p><p>Technological progress has been crucial in taking the U.S. to its current position of dominance in global geopolitics. Emerging crypto-based technologies enabled the next <em>giant leap</em> in this direction. And if only the regulators could overcome their greed for short-term power and control, they would see how stifling innovation isn’t in their best interest. </p><p>For instance, the ongoing banking crisis, which is very much due to <a href=\"https://cointelegraph.com/news/do-bank-failures-amount-to-intentional-regulatory-demolition\">misguided policy action and selective enforcement</a>, ultimately hurts financial stability in the United States. Moreover, if it’s indeed a coordinated effort to de-bank the crypto industry, the average U.S. taxpayer is bearing most of the brunt, despite staying within legal limits.</p><p>Some projects have found a scalable way to assist crypto firms in becoming regulated institutions — such as Archblock, which onboards U.S.-based community banks to expand on-chain “real-world asset” financing for regulated entities. </p><p>While this approach might eventually resolve some regulatory tussles, a sizeable section of the global crypto community is rooting for more radical solutions. </p><h2>Crypto firms don’t need banks when they have stablecoins</h2><p>Stablecoins have been under much scrutiny since Terra’s “algorithmic” coin, TerraUSD (renamed to TerraClassicUSD, <a href=\"https://cointelegraph.com/news/why-did-terra-luna-and-ust-crash-find-out-on-the-market-report\">crashed</a> last year, setting off a chain of events that partly led to the FTX fiasco. The crash wiped out an ecosystem worth $40 billion, but it also <a href=\"https://cointelegraph.com/news/terra-luna-crash-anniversary-community-reflects-on-the-lessons-learned\">served valuable lessons</a> in due diligence, overexposure and risk management.</p><p>Something like Operation Chokepoint 2.0, actual or hypothetical, is possible because crypto companies and investors use banks as on-ramps or off-ramps. There are practical reasons for this choice: One can’t buy crypto with cash, for example, and must pay with U.S. dollars from their bank account. Even while using an exchange, they need bank transfers to deposit fiat.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/the-world-could-be-facing-a-dark-future-thanks-to-cbdcs\"><strong><em>The world could be facing a dark future thanks to CBDCs</em></strong></a></p><p>Involving banks so much isn’t necessary, though. Stablecoins can offer the fiat tokenization services for which crypto companies depend on banks with much risk and despair. The process isn’t decentralized, but neither is banking for that matter. It’s not about decentralization here since the goal is to connect centralized and decentralized finance while minimizing counterparty risks.</p><p>Former BitMEX CEO Arthur Hayes published a richly informative <a href=\"https://entrepreneurshandbook.co/dust-on-crust-300d4b5cf3ec\" target=\"_blank\" rel=\"noopener nofollow\">blog</a> on the subject in March in which he presented a detailed case for choosing stablecoins over banks. Most importantly, he proposed an innovative stablecoin model, which he called the Satoshi Nakamoto Dollar or NakaDollar (NUSD). The idea is to leverage Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and inverse perpetual swaps such that NUSD doesn’t involve banks in the issuance or redemption process. </p><p>Proposals like NUSD are signs of our collective willingness to fight back in the face of regulatory uncertainty and aggressive onslaughts. As crypto evolves, there will be lesser attack surfaces for regulators, and we’ll have more robust alternatives to legacy systems. </p><p>Innovation isn’t merely a business model — it’s our biggest strength. And it is through innovation that crypto will overcome all hurdles. The show must go on since future generations deserve a better world.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Sarah Austin</strong> is the co-founder of QGlobe Games, a Steam-modeled gaming platform for crypto. She was the founding CMO of Kava Labs, the founding CEO of Pop17.com and the original community builder for Twitch. She graduated from the Dominican University of California before obtaining a certified data science certification from John Hopkins University.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-02T17:16:50.000Z",
    "title": "Taurus deploys on Polygon blockchain for asset tokenization and custody",
    "url": "https://cointelegraph.com/news/taurus-deploys-on-polygon-blockchain-for-asset-tokenization-and-custody",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/8fc29625-6faf-40b0-8a04-a27d7a74c00a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Taurus raised $65 million in a funding round three months ago. Its clients can now issue digital securities automatically. </p>\n                    <p><p>Digital asset infrastructure provider Taurus is stepping up its tokenization efforts in Europe through a full integration with the Polygon blockchain, the company announced on June 2. </p><p>The move comes three months after Taurus <a href=\"https://cointelegraph.com/news/digital-asset-provider-raises-65m-in-series-b-led-by-credit-suisse\">raised $65 million in a funding round</a>, and will allow its clients to automatically issue digital securities. Taurus claims to have over 25 clients across nine countries, including Arab Bank Switzerland, CACEIS Bank, Crédit Agricole, Credit Suisse, Deutsche Bank, Pictet, Swissquote, Vontobel.</p><p>A Taurus spokesperson told Cointelegraph that debt, funds, and structured products are among the most popular assets for tokenization, though the demand varies depending on local regulations. Picking Polygon was a \"natural choice to benefit from the Ethereum network,\" it continued. </p><p>“The tokenization of real-world assets is a no-brainer at the root of the idea. The challenge is and always has been to build sufficiently advanced infrastructure to enable it,” Colin Butler, global head of institutional capital at Polygon Labs, said in a statement.</p><p>A tokenization process involves converting something tangible or intangible into a digital token. Tokenizing tangible assets such as real estate, stocks, or art is possible. It is also possible to tokenize intangible assets such as loyalty points and voting rights, as previously <a href=\"https://cointelegraph.com/news/what-is-tokenization-and-how-are-banks-tapping-into-its-design-principles\">reported by Cointelegraph</a>. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Enabling banks and brands to issue and custody any tokenized asset using <a href=\"https://twitter.com/0xPolygon?ref_src=twsrc%5Etfw\">@0xpolygon</a><a href=\"https://twitter.com/taurus_hq?ref_src=twsrc%5Etfw\">@taurus_hq</a>, the European digital asset infrastructure leader is now fully integrated and automated <a href=\"https://twitter.com/hashtag/onPolygon?src=hash&amp;ref_src=twsrc%5Etfw\">#onPolygon</a> <br><br>More: <a href=\"https://t.co/U2tT0azjkG\">https://t.co/U2tT0azjkG</a> <a href=\"https://t.co/urFCzXN8eg\">pic.twitter.com/urFCzXN8eg</a></p>&mdash; Polygon (Labs) (@0xPolygonLabs) <a href=\"https://twitter.com/0xPolygonLabs/status/1664664420046319618?ref_src=twsrc%5Etfw\">June 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Asset tokenization is one of the trends driving the blending of traditional finance with Web3 solutions across Europe. The United Kingdom's central bank is exploring ways in which <a href=\"https://cointelegraph.com/news/bank-of-england-preparing-for-greater-role-of-tokenization-in-finance-official-says\">tokenized assets will interact</a> with bank money, non-bank money, and central bank money, according to its deputy governor Sir Jon Cunliffe in February. It may also be possible in the near future for tokenized transactions to be synchronized with the British central bank's real-time payment system, Cunliffe said. In Germany, <a href=\"https://cointelegraph.com/news/german-banks-slowly-adopt-crypto-mostly-for-institutional-investors\">banks are slowly embracing crypto solutions</a>, mostly through tokenization-related products and services for institutional investors. </p><p>Taurus <a href=\"https://cointelegraph.com/news/digital-asset-provider-raises-65m-in-series-b-led-by-credit-suisse\">secured a $65 million Series B fund led by Credit Suisse</a> in February, joined by several other institutional investors, including Deutsche Bank, Pictet Group, Cedar Mundi Ventures, Arab Bank Switzerland, and Investis. </p><p>At the time, the company said the capital would be used for growth strategy in three primary areas: recruiting engineering talent, security and compliance, as well as expanding sales in Europe, the United Arab Emirates, Americas and Southeast Asia. </p><p><a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\"><strong><em>Magazine:</em></strong><strong> </strong><strong><em>Best and worst countries for crypto taxes — Plus crypto tax tips</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-02T17:30:51.000Z",
    "title": "Nigerian Central Bank Blasts Naira Devaluation Report — Publication Stands by Its Story",
    "url": "https://news.bitcoin.com/nigerian-central-bank-blasts-naira-devaluation-report-publication-stands-by-its-story/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbn20-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Nigerian Central Bank Blasts Naira Devaluation Report — Publication Stands by Its Story\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbn20-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbn20-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbn20-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbn20-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbn20-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbn20-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbn20.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Central Bank of Nigeria (CBN) said on June 1 that the report claiming it had devalued the local currency to N631 per dollar &#8220;is replete with outright falsehoods and destabilising innuendos.&#8221; The Nigerian publication Daily Trust has said it stands by its story and called on the central bank to provide facts to disprove [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-02T17:14:09.000Z",
    "title": "INJ rockets higher, up 24.12% this week",
    "url": "https://crypto.news/inj-rockets-higher-up-24-12-this-week/",
    "description": "The price of injective (INJ) saw a 24.12% in the last seven days, outperforming bitcoin (BTC) and other established tokens as it tears higher. The recent activation of the Avalon upgrade on the mainnet has played a crucial role in propelling INJ to new heights."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-02T17:30:26.000Z",
    "title": "Here Are The Pricing Models Bitcoin Must Stay Above For Rally To Go On",
    "url": "https://www.newsbtc.com/bitcoin-news/pricing-models-bitcoin-stay-above-rally-continue/",
    "description": "Here are the pricing model lines that Bitcoin might have to stay above if the bullish momentum of the cryptocurrency has to continue. These Bitcoin Pricing Models Are Currently Near The Spot Price In a new tweet, the on-chain analytics firm Glassnode has pointed out how the three pricing models, the adjusted realized price, the short-term holder cost basis, and the 200-week MA, are all close to the asset&#8217;s value right now. To understand the first and second models here, the &#8220;realized price&#8221; needs to be looked at first. The realized price is a pricing model derived from the realized cap, which is a capitalization model that assumes that the &#8220;real&#8221; value of each coin in the circulating supply is not the spot price, but the price at which it was last moved. When this cap is divided by the total number of coins in circulation, the average cost basis or acquisition price in the market is obtained. This value, which the average holder on the network bought their coins at, is known as the realized price. Now, the first pricing model, the &#8220;adjusted realized price,&#8221; is a modification of this indicator that drops from the data all holders who haven&#8217;t moved their coins since more than seven years ago. Related Reading: Why This Is The Most Important Bitcoin Chart You’ll See This Week Such old supply usually consists mostly of the coins that have been lost (perhaps due to the wallet keys no longer being accessible), which means that this part of the supply wouldn&#8217;t be relevant to the current market, hence why the indicator cuts it out. As for the second model of interest here, the &#8220;short-term holder (STH) cost basis,&#8221; this metric keeps track of the realized price of specifically the investors who have been holding their coins since less than 155 days. Here is a chart that shows how these Bitcoin pricing models have compared with the spot price during the past year: The price seems to be just above these models at the moment &#124; Source: Glassnode on Twitter As displayed in the above graph, the Bitcoin adjusted realized price currently has a value of $25,300, while the short-term holder cost basis has a value of $26,000. Historically, these models have acted as both resistance and support for the price, depending on the wider trend. In bullish periods, they usually act as support so it&#8217;s possible that if the price drops deep enough to hit them, a rebound may happen. The third line on the chart, the 200-week moving average (MA), is a model that aims to find the baseline momentum of the four year Bitcoin cycle. This line has also had some similar interactions with the price as the other two models. The 200-week MA has a value of $26,300 right now, implying that it&#8217;s currently the closest line to the spot price. It now remains to be seen how the price interacts with these lines, starting with the 200-week MA, if a drawdown extended enough happens. Related Reading: Litecoin Breaks $95 As Whale Transactions Spike A successful retest of these lines would naturally be a positive sign for the rally, but a drop under them may be a signal that a transition back towards a bearish regime has occurred. BTC Price At the time of writing, Bitcoin is trading around $27,000, up 1% in the last week. Looks like BTC hasn't moved much recently &#124; Source: BTCUSD on TradingView Featured image from Maxim Hopman on Unsplash.com, charts from TradingView.com, Glassnode.com"
  }
]