[
  {
    "source": "CoinDesk",
    "date": "2023-10-03T13:00:00.000Z",
    "title": "Galaxy's Head of Mining Amanda Fabiano Departed to Start Consulting Company",
    "url": "https://www.coindesk.com/business/2023/10/03/galaxys-head-of-mining-amanda-fabiano-departed-to-start-consulting-company/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Fabiano’s new company will work with Compass Mining and Giga Energy, among others."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-03T13:01:03.000Z",
    "title": "Ledger and Sotheby's Team Up for Digital Art Exclusives",
    "url": "https://decrypt.co/199870/ledger-sothebys-team-digital-art-exclusives",
    "description": "Sotheby’s collectors will be provided with exclusive hardware wallets from Ledger as part of this collaboration."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-03T12:50:18.000Z",
    "title": "Dirham stablecoin DRAM hits Uniswap, developed by relaunched Distributed Technologies Research",
    "url": "https://cointelegraph.com/news/abu-dhabi-firm-launches-dirham-backed-stablecoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/155fc30a-9f06-4287-b6b9-694b6aa74b86.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Distributed Technologies Research has launched DRAM, a Dirham-backed stablecoin that aims to tap into the performance of the United Arab Emirates fiat currency. </p>\n                    <p><p>A former MIT alumnus and SoftBank executive has launched a Dirham-backed stablecoin that aims to give countries plagued by high inflation environments exposure to assets linked to the United Arab Emirates’ native currency.</p><p>Cointelegraph reached out to Akshay Naheta, founder and CEO of Distributed Technologies Research (DTR) following the <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7114463707258060800/\" target=\"_blank\" rel=\"noopener nofollow\">announcement </a>of DRAM stablecoin that was listed on Decentralized Finance protocols Uniswap and PancakeSwap on Oct. 3.</p><p>The Abu Dhabi based- company has been developing the technology for a Dirham-backed stablecoin since Oct. 2022. Naheta has essentially rebooted DTR in the jurisdiction, which he had helped co-found in Switzerland in 2019.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/51d65564-f9ce-4114-9f05-0a9dcc653012.png\"  /><figcaption style=\"text-align: center;\">The DRAM contract listed on Uniswap on Oct. 3. Source: Uniswap.</figcaption></figure><p>DRAM is an Ethereum ERC-20 token that is issued by DRAM Trust. The organization is a Hong Kong law governed trust while an independent trustee responsible for approving token mints and burns is reportedly licensed and regulated under the Hong Kong Monetary Authority.</p><p>As it stands, DTR cannot offer DRAM in Hong Kong or within the United Arab Emirates but Naheta indicates that conversations are ongoing to provide token liquidity for listing on centralized exchanges outside of those two jurisdictions.</p><p>Regulatory parameters require that Dirham fiat reserves must be deposited before any DRAM tokens can be minted, with reserves reportedly held by regulated financial institutions. </p><p>The DRAM website also provides links to the stablecoin’s smart contract addresses for <a href=\"https://etherscan.io/token/0x5216409e5266cf520868545d6674d1f0046fdd9e\" target=\"_blank\" rel=\"noopener nofollow\">Ethereum</a>, <a href=\"https://bscscan.com/token/0x36de0f01b7806ab72541f34d86b4033262ebfc62\" target=\"_blank\" rel=\"noopener nofollow\">BNB</a> and <a href=\"https://arbiscan.io/token/0x5216409e5266cf520868545d6674d1f0046fdd9e\" target=\"_blank\" rel=\"noopener nofollow\">Arbitrum</a>. The ETH token contract reflects a max total supply of 2 million DRAM at the time of publication, while the ARB contract reflects 499,999 DRAM and the BNB contract holds 2.5 million DRAM.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/3d1909d6-f726-46ae-be78-d87a076c2d3b.png\"  /></figure><p>A background search carried out by Cointelegraph uncovered the <a href=\"https://cointelegraph.com/news/tipping-the-scales-could-unit-e-finally-break-blockchains-scalability-impasse\">previous launch</a> of Distributed Technologies Research in Switzerland four years ago. </p><p>The foundation went on to <a href=\"https://cointelegraph.com/news/tipping-the-scales-could-unit-e-finally-break-blockchains-scalability-impasse\">develop</a> a decentralized payments system <a href=\"https://medium.com/dtr-blog/distributed-technologies-research-launches-alpha-testnet-for-unit-e-eb194edbaeff\" target=\"_blank\" rel=\"noopener nofollow\">called Unit-e</a>, which was designed and <a href=\"https://github.com/dtr-org/unit-e\" target=\"_blank\" rel=\"noopener nofollow\">built </a>by a host of academics and developers through partnerships and grants with high-profile academic institutions including Stanford, MIT and University of Illinois.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/cd80631d-7529-49f4-beb2-03d520b7cc39.png\"  /><figcaption style=\"text-align: center;\">The code repository of Unit-e, last reflecting commits in 2019. Source: Github.</figcaption></figure><p>Cointelegraph has established that Naheta was involved in founding DTR during his tenure at SoftBank. DTR’s Unit-e project was a scalable decentralized payments network <a href=\"https://medium.com/dtr-blog/distributed-technologies-research-launches-alpha-testnet-for-unit-e-eb194edbaeff\" target=\"_blank\" rel=\"noopener nofollow\">built by a Berlin-based</a> development team.</p><blockquote>“The original ambition back in 2019 was also to disrupt payments and to create a protocol that would have very high throughput with significant cost efficiency.”</blockquote><p>Naheta shared details of the company’s efforts in “its previous incarnation” in a complete <a href=\"https://pramodv.ece.illinois.edu/pubs/Decentralized-Payment-Systems-Principles-and-Design.pdf\" target=\"_blank\" rel=\"noopener nofollow\">summary</a> of the Unit-e protocol reviewed by University of Illinois researchers. The team now building the DRAM stablecoin features a team of around 30 permanent staff and contractors. </p><p>Naheta said that while DTR would not be able to market DRAM in the UAE, the firm expects demand from companies in the region that are grappling with high inflation and currency issues:</p><blockquote>“The link to AED (Dirham) was driven by the strong performance and attractiveness of the UAE economy and the desire for stable, digital asset investment options around this region.”</blockquote><p>The UAE is <a href=\"https://cointelegraph.com/news/crypto-to-play-major-role-in-uae-trade-foreign-trade-minister\">emerging as hub</a> for the nascent cryptocurrency and wider Web3 space due to a favorable regulatory frameworks that aim to foster financial innovation and adoption of digital assets.</p><p>The likes of Coinbase and other major exchanges have been <a href=\"https://cointelegraph.com/news/coinbase-execs-visit-uae-to-test-potential-of-strategic-hub-for-international-operations\">openly talking about future operations</a> within the jurisdiction while industry heavyweight Binance is <a href=\"https://cointelegraph.com/news/it-s-official-binance-secures-a-license-to-operate-in-dubai\">already operational</a> in Dubai.</p><p><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Magazine: Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-03T12:48:30.000Z",
    "title": "ATPBot Introduces Advanced AI-Driven Trading Solutions for Binance and Kraken Users",
    "url": "https://www.cryptoglobe.com/latest/2023/10/atpbot-introduces-advanced-ai-driven-trading-solutions-for-binance-and-kraken-users/",
    "description": "Singapore, Singapore, October 3rd, 2023, Chainwire Recently, ATPBot announced its support for Binance and Kraken users to implement AI-automated trading through API. As an advanced intelligent AI quantitative trading strategy development and service platform, ATPBot has launched one of the most powerful AI-automatic trading bots on the market. Leveraging cutting-edge supercomputers and artificial intelligence algorithms, it provides […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-03T13:02:30.000Z",
    "title": "DVT Is Taking Ethereum Staking to the Next Level",
    "url": "https://cryptodaily.co.uk/2023/10/dvt-is-taking-ethereum-staking-to-the-next-level",
    "description": "In 2023, few crypto narratives have been as persistent as Ethereum staking. With new DeFi use cases in short supply, and a spate of hacks dampening enthusiasm for untested smart contracts,"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-03T12:48:31.000Z",
    "title": "BTG Pactual expands digital strategy with Orama acquisition",
    "url": "https://www.cryptopolitan.com/btg-pactual-expands-digital-strategy-with-orama-acquisition/",
    "description": "BTG Pactual, a major Brazilian investment bank, has taken a significant step forward in its digital strategy. The bank recently inked a deal to fully acquire Orama, a cryptocurrency-friendly brokerage, for 500 million Brazilian reais ($98.7 million). This acquisition aims to extend BTG Pactual&#8217;s digital footprints and bring diverse investment avenues to the fore. Established ... <a title=\"BTG Pactual expands digital strategy with Orama acquisition\" class=\"read-more\" href=\"https://www.cryptopolitan.com/btg-pactual-expands-digital-strategy-with-orama-acquisition/\" aria-label=\"More on BTG Pactual expands digital strategy with Orama acquisition\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-03T13:00:15.000Z",
    "title": "Bitcoin And Gold Poised For Growth Amidst US Fiscal Troubles, Top Macro Investor Says",
    "url": "https://www.newsbtc.com/news/bitcoin-and-gold-poised-for-growth-amidst-us-fiscal-troubles-top-macro-investor-says/",
    "description": "Bitcoin (BTC) and gold, two seemingly divergent assets, find common ground in the eyes of veteran macro investor Luke Gromen. In a recent interview, Gromen posits that these assets could flourish as the fiscal challenges in the United States continue to mount. Gromen&#8217;s argument hinges on the idea that both gold and Bitcoin are &#8220;duration assets&#8221; with fixed supplies and the potential for their face values to rise. In times of fiscal distress, these assets tend to shine. Related Reading: Crypto Era Looms: BIS Innovations Chief Calls On Central Banks To Prepare As the US grapples with fiscal issues exacerbated by relentless quantitative easing and potential shifts in Federal Reserve policies, Gromen believes that this environment will create a fertile ground for gold, oil, and Bitcoin. &#8220;[Gold and BTC will do well] because they are simply duration assets with a more fixed supply and a face value that can rise,” he stated. “They do well when a nation has a fiscal problem, and when the reserve currency issue of the world and her allies all have fiscal problems, and hers is at least as bad or probably worse than the others – even Europe – then it&#8217;s really good for gold and Bitcoin.&#8221; BRICS And The Dollar&#8217;s Reshaping Gromen also delved into the potential ramifications of the BRICS nations (Brazil, Russia, India, China, and South Africa) launching a gold-backed currency. Such a move could undermine the US dollar&#8217;s longstanding position as the world&#8217;s reserve currency. The prospect of a gold-backed currency gaining traction among these major economies could weaken the dollar&#8217;s dominance in international trade and finance. Meanwhile, the cryptocurrency sector is experiencing a bullish surge, with Bitcoin leading the charge. It has surpassed the critical psychological threshold of $28,000, sparking optimism among investors. Notably, Cryptoinsightuk, a pseudonymous crypto trading analyst, has conducted a revealing analysis of Bitcoin&#8217;s relative strength index (RSI) indicator. Bitcoin moving halfway to the $28K region. Chart: TradingView.com Bitcoin&#8217;s Bullish Momentum Cryptoinsightuk&#8217;s analysis tracks the instances when Bitcoin&#8217;s weekly RSI crossed above the 50 mark (green) and then dropped below this level (red). The expert found that, on average, these events led to a remarkable 1,100% price increase for Bitcoin. Such a surge could become a reality in the right circumstances, including a supply squeeze and the introduction of a spot Bitcoin exchange-traded fund (ETF). Related Reading: Solana Outperforms 2 Top Altcoins – Its Ripple Effect On Prices As Bitcoin&#8217;s price currently hovers around $27,539 with a 1.2% decline over the past 24 hours but a 4.9% gain over the last seven days, investors are closely monitoring these developments, eagerly awaiting signs of whether Bitcoin&#8217;s bullish momentum will persist in the coming weeks and months. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-03T13:00:36.000Z",
    "title": "FTX Golden Boy Sam Bankman-Fried Might Be in Jail For A Decade, Amid Bitcoin Spark ICO Frenzy",
    "url": "https://www.crypto-news-flash.com/ftx-golden-boy-sam-bankman-fried-might-be-in-jail-for-a-decade-amid-bitcoin-spark-ico-frenzy/?utm_source=rss&utm_medium=rss&utm_campaign=ftx-golden-boy-sam-bankman-fried-might-be-in-jail-for-a-decade-amid-bitcoin-spark-ico-frenzy",
    "description": "<img width=\"1772\" height=\"1179\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/uu.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/uu.png 1772w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/uu-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/uu-1024x681.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/uu-768x511.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/uu-1536x1022.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/uu-104x69.png 104w\" sizes=\"(max-width: 1772px) 100vw, 1772px\" />Amidst the obsession with the Golden Boy Sam Bankman-Fried and the possibility of a decade-long sentence, the spotlight now shines on Bitcoin Spark’s exciting ICO, currently making waves in phase six. What is a Crypto ICO? A Crypto Initial Coin Offering (ICO) is a fundraising method for cryptocurrency projects to obtain capital for their ventures. [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-03T12:48:00.000Z",
    "title": "LUNC To Die Unless Something Significant Happens: Crypto Influencer",
    "url": "https://coinedition.com/lunc-to-die-unless-something-significant-happens-crypto-influencer/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"LUNC Coin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/7.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/7-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/7-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/7-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Classy Crypto, a renowned crypto influencer, has said that the Terra Luna Classic project would die unless something significant happened. According to the influencer, there is no question about that, and he provided his reasons for coming up with such a conclusion. In a recently uploaded video, Classy Crypto said that the number one thing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/lunc-to-die-unless-something-significant-happens-crypto-influencer/\">LUNC To Die Unless Something Significant Happens: Crypto Influencer</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]