[
  {
    "source": "CoinDesk",
    "date": "2023-10-09T11:02:15.000Z",
    "title": "Ether Slides as Ethereum Foundation Swaps $2.7M ETH on Uniswap",
    "url": "https://www.coindesk.com/markets/2023/10/09/ether-slides-as-ethereum-foundation-swaps-27m-eth-on-uniswap/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Foundation periodically sells tokens to cover costs, creating a temporary sell-off event in markets."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-09T11:00:00.000Z",
    "title": "Protocol Village: VitaDAO, a ‘DeSci DAO,’ Launches Matrix Biosciences",
    "url": "https://www.coindesk.com/tech/2023/10/09/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the week of Oct. 9-15, with live updates throughout."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-09T10:40:55.000Z",
    "title": "Here's How Crypto Firms Are Bracing for New Rules in the UK",
    "url": "https://decrypt.co/200651/heres-how-crypto-firms-are-bracing-new-rules-uk",
    "description": "While some crypto exchanges are rushing to comply with newly updated rules, a few others have decided to suspend operations in the region."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-09T10:53:07.000Z",
    "title": "Sam Bankman-Fried Trial: DOJ forbids SBF from highlighting Anthropic investment in defense",
    "url": "https://cryptoslate.com/sam-bankman-fried-trial-doj-forbids-sbf-from-highlighting-anthropic-investment-in-defense/",
    "description": "<p>The U.S. Department of Justice (DOJ) wants the Court to preclude the disgraced FTX founder Sam Bankman-Fried from introducing evidence about the current value of certain investments like artificial intelligence (AI)-focused startup Anthropic. In an Oct. 8 letter to Judge Lewis Kaplan, the prosecutors said the defense might want to introduce the investment as part [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sam-bankman-fried-trial-doj-forbids-sbf-from-highlighting-anthropic-investment-in-defense/\">Sam Bankman-Fried Trial: DOJ forbids SBF from highlighting Anthropic investment in defense</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-09T10:40:56.000Z",
    "title": "PM Unveils Ambitious Plan to Globalize Hangeul’s Value in the AI Age",
    "url": "https://www.cryptopolitan.com/globalize-hangeuls-value-in-the-ai-age/",
    "description": "In a significant revelation at the Sejong Arts Center, Prime Minister Han Duck-soo, through Interior Minister Lee Sang-min, disclosed the government&#8217;s proactive stance in gearing up for the artificial intelligence era. The focus is on disseminating the value of Hangeul, with Han expressing his ambition for the Korean alphabet to play a pivotal role in ... <a title=\"PM Unveils Ambitious Plan to Globalize Hangeul&#8217;s Value in the AI Age\" class=\"read-more\" href=\"https://www.cryptopolitan.com/globalize-hangeuls-value-in-the-ai-age/\" aria-label=\"More on PM Unveils Ambitious Plan to Globalize Hangeul&#8217;s Value in the AI Age\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-09T10:58:34.000Z",
    "title": "Crypto exchange Deribit aims at brokerage license in EU",
    "url": "https://crypto.news/crypto-exchange-deribit-aims-at-brokerage-license-in-eu/",
    "description": "The crypto trading platform plans to add options for SOL, XRP, and MATIC starting January 2024. Crypto derivatives exchange Deribit is seeking to apply for a brokerage license in the European Union roughly a year after the platform suffered a&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-09T11:00:23.000Z",
    "title": "Shiba Inu Stagnation: What’s Causing Meme Coin’s Recent Sluggishness?",
    "url": "https://www.newsbtc.com/news/shiba-inu-stagnation-whats-causing-meme-coins-recent-sluggishness/",
    "description": "Shiba Inu (SHIB) investors have been caught in a whirlwind of uncertainty for the past month as the cryptocurrency&#8217;s price has stubbornly clung to a narrow range between $0.0000075 and $0.000007. This protracted period of stagnation has left traders and enthusiasts alike scratching their heads, wondering when the next significant move might occur. The current SHIB price, as reported by CoinGecko, hovers at $0.00000715, representing a modest 1.4% decline over the last 24 hours. Over the span of seven days, the meme coin has dipped by nearly 6%, indicating a gradual erosion of value.  This pattern of price fluctuations within such a confined range underscores a lack of decisive action from both buyers and sellers, painting a picture of market ambivalence. Related Reading: XRP Journey To $0.55: Is A Breakthrough Imminent In The Coming Days? Implications Of A Range-Bound Market For Shiba Inu One can&#8217;t help but wonder about the implications of this seemingly stuck range. Given the broader crypto market&#8217;s recent slump, it wouldn&#8217;t be surprising to see SHIB test the lower echelon of this range, potentially signaling an extension of its bearish undertones. With the larger market sentiment in a state of flux, SHIB&#8217;s fate remains intertwined with the broader crypto landscape. SHIB market cap hitting $4.17 billion today. Chart: TradingView.com The ongoing downtrend in SHIB&#8217;s price can be visually traced to the formation of a falling wedge pattern on the weekly chart. This pattern is characterized by two converging trendlines that serve as dynamic resistances and supports. While such patterns can sometimes hint at an impending bullish breakout, the prevailing market sentiment suggests that investors should remain cautious and prepared for any outcome. Declining Whale Activity: What Does It Mean? Another noteworthy development in the SHIB ecosystem is the decline in large network transactions. The number of significant transactions on the SHIB network has dwindled to a mere 20, marking one of the most inactive periods for the meme coin, especially concerning the activity of its large holders. Several factors could be contributing to this sudden drop in whale activity. Related Reading: Bitcoin Price Ready For Blast-Off As Key Metrics Signal A Bull Run: Top Analyst One of the potential reasons might be the waning interest in highly volatile assets like SHIB, particularly as Bitcoin&#8217;s dominance continues to rise within the crypto sphere. As the flagship cryptocurrency asserts its dominance, many investors appear to be realigning their portfolios, moving away from riskier assets to more established ones. This shift in investor sentiment could explain the reduction in significant SHIB transactions as market participants seek more stability in their cryptocurrency holdings. The formation of a falling wedge pattern and the decline in large network transactions underscore the challenges facing SHIB&#8217;s price trajectory. SHIB holders and enthusiasts must remain vigilant and adaptable to navigate the ever-changing tides of the digital asset market. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-09T10:46:00.000Z",
    "title": "Altcoin Bulls Historical Pattern for Post-Bitcoin Halving Reemerges",
    "url": "https://coinedition.com/altcoin-bulls-historical-pattern-for-post-bitcoin-halving-reemerges/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/10/0311.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/10/0311.jpg 730w, https://coinedition.com/wp-content/uploads/2023/10/0311-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/10/0311-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/10/0311-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/10/0311-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/10/0311-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/10/0311-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/10/0311-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/10/0311-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/10/0311-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/10/0311-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/10/0311-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/10/0311-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/10/0311-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/10/0311-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/10/0311-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>While significant altcoins like Ethereum (ETH), XRP, and Solana (SOL) are wallowing in substantial losses, expert figures in the crypto community now see a potential trend reversal amid the looming Bitcoin halving. In a recent post on X (formerly Twitter), Stockmoney Lizards, a prominent pro-Bitcoin analyst, asserted that a familiar pattern is emerging within the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/altcoin-bulls-historical-pattern-for-post-bitcoin-halving-reemerges/\">Altcoin Bulls Historical Pattern for Post-Bitcoin Halving Reemerges</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]