[
  {
    "source": "CoinDesk",
    "date": "2023-09-28T15:45:00.000Z",
    "title": "Crypto for Advisors: AI - Friend or Foe to the Advisor?",
    "url": "https://www.coindesk.com/business/2023/09/28/crypto-for-advisors-ai-friend-or-foe-to-the-advisor/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Jordi Visser from Weiss Multi-Strategy Advisers discusses the impact AI could have on investing and what to watch out for."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-28T16:01:07.000Z",
    "title": "IYK Raises $16.8 Million to Power Token-Enabled Fashion With NFTs",
    "url": "https://decrypt.co/199165/iyk-raises-16-8-million-power-token-enabled-fashion-nfts",
    "description": "After working with Adidas, 9dcc, and more, IYK has launched a self-serve platform for creating NFC-chipped products."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-28T16:00:00.000Z",
    "title": "TradFi: 11 things to do when considering adding digital assets",
    "url": "https://cointelegraph.com/innovation-circle/tradfi-11-things-to-do-when-considering-adding-digital-assets",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/576c1565-7576-45c8-884e-ed15789f6ada.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Digital assets can present expansive and valuable opportunities for a TradFi institution that’s prepared to lay the necessary foundation.</p>\n                    <p><p>As digital asset options continue to gain attention and acceptance from investors, traditional financial institutions may be considering adding digital assets to their offerings and/or portfolios. As with any other industry, “standing still” isn’t an option in the financial sector, and tapping into the potential of digital assets can help TradFi organizations tap into an enthusiastic and growing new customer base. Further, adding digital assets can diversify a traditional portfolio, offering a hedge against market downturns.</p> <p>However, any upside achieved from being viewed as an innovative early adopter can quickly be erased if a TradFi institution isn’t thoroughly prepared for the unique opportunities, challenges and risks that come with digital assets. Below, 11 members of <a href=\"https://circle.cointelegraph.com/?_ga=2.198681135.1484442309.1667485998-1927108766.1652715111\">Cointelegraph Innovation Circle</a> share essential things any TradFi organization must be prepared to do if it’s considering digital assets and why these steps shouldn’t be skipped.</p> <h2>Focus on robust risk management</h2> <p>One essential thing to remember is the need for robust risk management. Given the high volatility and unique regulatory environment of digital assets, TradFi institutions should have comprehensive risk assessment and management strategies in place. This includes understanding the technology behind these assets, their market behavior and potential legal implications. –<a href=\"https://circle.cointelegraph.com/u/0d167285-44f8-41a6-9001-72aab6b4058d\"> Tomer Warschauer Nuni</a>,<a href=\"http://www.kryptomon.co\"> Kryptomon</a></p> <h2>Understand how verification and approval works on the blockchain</h2> <p>With the possible exception of real world assets — like expensive watches, jewelry and other items that are attached to digital ownership tokens to verify ownership and its transfer — the concept of verification and approval is different with blockchains. In terms of record-keeping, the blockchain itself is the constantly updated and verified record. Every transaction is checked and recorded on the chain. –<a href=\"https://circle.cointelegraph.com/u/008ee5ae-3d26-4c82-a558-db3e57e4c769\"> Zain Jaffer</a>,<a href=\"http://www.zain-ventures.com\"> Zain Ventures</a></p> <h2>Implement thorough cybersecurity protocols</h2> <p>Custody is an important factor to consider. The events of the last year prove that “not your keys, not your coins” is as relevant as ever. Since insured institutional crypto custodians can be costly (and defeat the purpose of the aforementioned mantra), an institution needs to do its due diligence on its own staff and have robust cybersecurity protocols in place, including firewalls, two-factor authentication, multisignature, phishing training and so on. –<a href=\"https://circle.cointelegraph.com/u/313a59f1-efb9-465c-aee3-750eaa69f776\"> Timothy Enneking</a>,<a href=\"http://www.digital-capital-management.com/\"> Digital Capital Management</a></p> <h2>Adapt to crypto norms and principles</h2> <p>Digital assets must address “cultural liquidity” for TradFi institutions. It’s essential to understand and follow the crypto community’s principles, practices and expectations. Decentralization and transparency underpin digital asset markets. To maximize digital asset potential, institutions must adapt to these norms, which may differ greatly from those of traditional finance. –<a href=\"https://circle.cointelegraph.com/u/8179044f-5f09-469d-8c72-d17fd6274257\"> Arvin Khamseh</a>,<a href=\"http://soldoutnfts.io\"> SOLDOUT NFTs</a></p> <h2>Create accessible educational content</h2> <p>Education is the name of the game when it comes to digital assets. Much of a TradFi institution’s audience will likely be skeptical of or unfamiliar with digital assets like cryptocurrency. Beginner-friendly promotions, educational blogs, onsite explainers and videos couched in language the audience understands can make a world of difference. –<a href=\"https://circle.cointelegraph.com/u/bcb46b42-12ad-4937-8069-b741c596ef3c\"> Sheraz Ahmed</a>,<a href=\"http://storm.partners/\"> STORM Partners</a></p> <h2>Choose partners and technology carefully</h2> <p>For traditional businesses seeking to extend their services into the digital economy, it’s worth considering that, unlike people, not all entry points to the ecosystem are created equal. First-time retailers want a guide who knows the terrain and has time-tested experience delivering trusted solutions. As banks and crypto continue to co-evolve, partners and technology should be chosen carefully. –<a href=\"https://circle.cointelegraph.com/u/83c71aad-8be6-470a-aaf9-7f146821217c\"> Oleksandr Lutskevych</a>,<a href=\"http://cex.io\"> CEX.IO</a></p> <h2>Keep capital preservation top of mind</h2> <p>The most important thing traditional finance institutions should keep in mind when approaching digital assets is the concept of capital preservation, or ensuring that there are no losses resulting from avoidable situations. Even if a manager wants to invest in risky assets like crypto, they should do it with profits that were generated earlier, not with original capital. –<a href=\"https://circle.cointelegraph.com/u/1d9f8b61-2e77-4452-a837-4db4245d01ca\"> Abhishek Singh</a>,<a href=\"http://acknoledger.com/\"> Acknoledger</a></p> <h2>Clearly identify the asset class(es) you’re working with</h2> <p>Institutions should be steadfast in clearly identifying the asset classes they are working with, as “digital asset” can be vague. As various digital assets shape this emerging market, it will be paramount to educate your audience as well. There are many digital asset sectors that need to be understood, such as real world assets, cryptocurrencies, tokens, nonfungible tokens and many more. –<a href=\"https://circle.cointelegraph.com/u/84007b98-8c0e-4c02-8807-ff7876b7765d\"> Megan Nyvold</a>,<a href=\"http://bingx.com/en-us/\"> BingX</a></p> <h2>Be prepared for volatility</h2> <p>Digital assets, especially cryptocurrencies, are known for their price volatility. TradFi institutions interested in adding digital assets to their offerings should be prepared for the inherent risks associated with this volatility, which can lead to significant fluctuations in asset values. Rigorous risk management practices are essential. –<a href=\"https://circle.cointelegraph.com/u/5cae7f29-8588-4852-bb31-c66fd1d805c6\"> Anthony Georgiades</a>,<a href=\"https://pastel.network/\"> Pastel Network</a></p> <h2>Consider hybrid portfolios</h2> <p>TradFi institutions should consider hybrid portfolios. When integrating digital assets, they should blend traditional and emerging holdings. This caters to evolving client preferences, requires rigorous risk assessment and compliance and leverages institutional expertise. This approach empowers institutions to tap into the potential of digital assets while meeting modern investment demands. –<a href=\"https://circle.cointelegraph.com/u/a27b7ccb-dfb8-468f-83ae-4aac596f0a40\"> Vinita Rathi</a>,<a href=\"https://www.systango.com\"> Systango</a></p> <h2>Prioritize compliance</h2> <p>Web3 regulations around the world are evolving far more rapidly than their counterparts in traditional finance. TradFi institutions should work with blockchain compliance experts to not just stay on top of current legal requirements, but also to prepare for any upcoming changes. –<a href=\"https://circle.cointelegraph.com/u/abc0e9e1-b580-49da-b9fb-105caa752b79\"> Wolfgang Rückerl</a>,<a href=\"https://entity.global\"> ENT Technologies AG</a></p> <hr class=\"wp-block-separator\" /> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-28T15:27:12.000Z",
    "title": "Bitcoin to $27K next? One-week BTC price highs precede Fed's Powell",
    "url": "https://cointelegraph.com/news/bitcoin-27k-one-week-btc-price-highs-fed-powell",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/c7e345a3-5bc1-4f8e-ae36-db646bdb2d64.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin clinches a BTC price boost as the latest U.S. macro data flows in, with all eyes on Powell next.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) hit new weekly highs after the Sep. 28 Wall Street open as markets awaited fresh cues from the United States Federal Reserve.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/90c859f0-a36f-4740-9892-78d748872921.png\"><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><h2>Bitcoin summons volatility ahead of Powell speech</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed BTC price strength staging a comeback on the day, having delivered what <a href=\"https://twitter.com/DrProfitCrypto/status/1707079629326938458\" target=\"_blank\" rel=\"noopener nofollow\">some referred to</a> as a classic “pump and dump” 24 hours prior.</p><p>During that performance, <a href=\"https://cointelegraph.com/news/bitcoin-price-30k-october-analyst-btc-climbs\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-price-30k-october-analyst-btc-climbs/amp\">highs of $26,823 appeared</a> on Bitstamp as the result of 2% daily gains before Bitcoin retraced all of its progress.</p><p>A slower grind higher then took hold, with bulls edging closer to $27,000 at the time of writing.</p><p>Bitcoin appeared to react well to the latest U.S. macroeconomic data prints. </p><p>GDP for Q2 grew by 1.7% year on year — below the projected 2.0% — while Personal Consumption Expenditures (PCE) index data for August came in in line with expectations.</p><p>“Bring on the volatility,” Keith Alan, co-founder of monitoring resource Material Indicators, <a href=\"https://twitter.com/KAProductions/status/1707353095456337929\" target=\"_blank\" rel=\"noopener nofollow\">told</a> X subscribers beforehand.</p><p>Data from the Binance BTC/USD order book uploaded by Alan showed little by way of resistance standing in the way of spot price under the $27,000 mark.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Marked up <a href=\"https://twitter.com/hashtag/FireCharts?src=hash&ref_src=twsrc%5Etfw\">#FireCharts</a> to help you see the Weekly/Monthly range for <a href=\"https://twitter.com/hashtag/BTC?src=hash&ref_src=twsrc%5Etfw\">#BTC</a>. <a href=\"https://t.co/LQs8i2rZcV\">pic.twitter.com/LQs8i2rZcV</a></p>— Keith Alan (@KAProductions) <a href=\"https://twitter.com/KAProductions/status/1707370330270974176?ref_src=twsrc%5Etfw\">September 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The macro data constituted just the prelude to the day’s main event, meanwhile, with Jerome Powell, Chair of the Federal Reserve, due to comment later on.</p><p>Powell, whose recent words <a href=\"https://cointelegraph.com/news/bitcoin-fails-recoup-post-fed-losses-20k-btc-price\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-fails-recoup-post-fed-losses-20k-btc-price/amp\">failed to deliver noticeable volatility</a> to crypto markets, was <a href=\"https://www.federalreserve.gov/conferences/chair-powell-teacher-town-hall-2023.htm\" target=\"_blank\" rel=\"noopener nofollow\">due to speak</a> at the Fed’s “Conversation with the Chair: A Teacher Town Hall Meeting\" event in Washington, D.C. at 4pm Eastern time.</p><h2>BTC price not out of the woods</h2><p>Commenting on the state of play on Bitcoin markets, popular trader and analyst Daan Crypto Trades was more optimistic around the strength of the day’s move compared to Sep. 27.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-halving-efficient-btc-mining-costs-30k\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-halving-efficient-btc-mining-costs-30k/amp\">Bitcoin halving to raise ‘efficient’ BTC mining costs to $30K</a></em></strong></p><p>“Back to yesterday's highs but with considerably less Open Interest,” he <a href=\"https://twitter.com/DaanCrypto/status/1707409829227036847/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">noted</a>. </p><blockquote>“No doubt there's longs chasing here but it's less frothy than it was yesterday. Would still like to see longs chill out to not get a full retrace later on.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/d2ced5da-9bfd-4532-9172-c1443ae06308.png\"><figcaption style=\"text-align: center;\"><em>BTC/USD chart with open interest data. Source: Daan Crypto Trades/X</em></figcaption></figure><p>An accompanying chart tracked open interest as BTC/USD headed higher.</p><p>Fellow trader and analyst Rekt Capital meanwhile flagged key resistance trend lines now in play, with Bitcoin required to overcome them to effect a more substantial trend change.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/BTC?src=hash&ref_src=twsrc%5Etfw\">#BTC</a> is right back at the Bull Market Support Band cluster of moving averages, challenging to breakout beyond them<a href=\"https://twitter.com/search?q=%24BTC&src=ctag&ref_src=twsrc%5Etfw\">$BTC</a> <a href=\"https://twitter.com/hashtag/Crypto?src=hash&ref_src=twsrc%5Etfw\">#Crypto</a> <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&ref_src=twsrc%5Etfw\">#Bitcoin</a> <a href=\"https://t.co/c32BiQOwJ5\">pic.twitter.com/c32BiQOwJ5</a></p>— Rekt Capital (@rektcapital) <a href=\"https://twitter.com/rektcapital/status/1707409671764480485?ref_src=twsrc%5Etfw\">September 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Elsewhere in the day’s analysis, Rekt Capital acknowledged that $29,000 could make a reappearance and still form <a href=\"https://cointelegraph.com/news/us-govt-shutdown-looms-5-things-bitcoin-this-week\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-govt-shutdown-looms-5-things-bitcoin-this-week/amp\">part of a broader comedown</a> for Bitcoin.</p><p>“It's important to remember that Bitcoin could technically rally to even as high as ~$29,000 to form a new Lower High (Phase A-B),” he <a href=\"https://twitter.com/rektcapital/status/1707410804193079536\" target=\"_blank\" rel=\"noopener nofollow\">explained</a> alongside a chart.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-28T15:40:41.000Z",
    "title": "Coinbase approved to offer perpetual futures trading to non-U.S. residents by Bermuda Monetary Authority",
    "url": "https://cryptoslate.com/coinbase-approved-to-offer-perpetual-futures-trading-to-non-u-s-residents-by-bermuda-monetary-authority/",
    "description": "<p>Crypto exchange Coinbase has announced its international exchange has received regulatory approval from the Bermuda Monetary Authority (BMA) to offer perpetual futures to non-U.S. retail customers. As per Coinbase, users can verify their eligibility for this offering on the platform, with those meeting the criteria gaining access to the product in the following weeks. Earlier [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinbase-approved-to-offer-perpetual-futures-trading-to-non-u-s-residents-by-bermuda-monetary-authority/\">Coinbase approved to offer perpetual futures trading to non-U.S. residents by Bermuda Monetary Authority</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-28T15:57:29.000Z",
    "title": "Binance Halts Euro Trading as Banking Partner Halts Services",
    "url": "https://cryptodaily.co.uk/2023/09/binance-halts-euro-trading-as-banking-partner-halts-services",
    "description": "Deposits, buying and selling crypto with EUR, and spot trading were some of the operations that have been temporarily interrupted."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-28T16:00:57.000Z",
    "title": "Do Kwon’s Defense Declares SEC’s Deposition Request ‘Impossible’ Amid Ongoing Detention Saga",
    "url": "https://news.bitcoin.com/do-kwons-defense-declares-secs-deposition-request-impossible-amid-ongoing-detention-saga/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/yy7899900-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Do Kwon&#039;s Defense Declares SEC&#039;s Deposition Request &#039;Impossible&#039; Amid Ongoing Detention Saga\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/yy7899900-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/yy7899900-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/yy7899900-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/yy7899900-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/yy7899900-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/yy7899900-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/yy7899900.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The legal team defending Do Kwon, the co-founder and former CEO of Terraform Labs, argues that the U.S. Securities and Exchange Commission (SEC) lacks the capacity to depose Kwon, deeming it an “impossible” feat. Kwon’s legal counsel additionally maintains that the SEC’s bid for a preclusion order is premature, given that no summary judgment motion [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-28T15:30:15.000Z",
    "title": "Biggest Movers: SHIB, DOGE Snap Recent Losing Streaks",
    "url": "https://news.bitcoin.com/biggest-movers-shib-doge-snap-recent-losing-streaks/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2150927057-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: SHIB, DOGE Snap Recent Losing Streaks\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2150927057-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2150927057-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2150927057-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2150927057-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2150927057-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2150927057-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2150927057.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Shiba inu snapped a recent four-day losing streak on Thursday, as bulls rejected a breakout below a key level of support. The slight rebound in price came as the global crypto market cap was marginally higher, climbing 0.25% as of writing. Dogecoin was also in the green. Shiba Inu (SHIB) Shiba inu (SHIB) ended a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T16:09:13.000Z",
    "title": "Concerns Mount as Pentagon’s Push for Autonomous Weapons Accelerates",
    "url": "https://www.cryptopolitan.com/pentagons-push-for-autonomous-weapons/",
    "description": "The Pentagon&#8217;s aggressive pursuit of fully autonomous drones and weapons systems has sparked significant concerns among experts, activists, and human rights groups. The Replicator initiative, a groundbreaking endeavor, aims to deploy fully autonomous systems across various military platforms, from drones to defense systems. While the Defense Department insists that ethical guidelines will guide their use, ... <a title=\"Concerns Mount as Pentagon&#8217;s Push for Autonomous Weapons Accelerates\" class=\"read-more\" href=\"https://www.cryptopolitan.com/pentagons-push-for-autonomous-weapons/\" aria-label=\"More on Concerns Mount as Pentagon&#8217;s Push for Autonomous Weapons Accelerates\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T16:03:25.000Z",
    "title": "DappRadar Price Prediction 2023-2032: How High Can RADAR Rise?",
    "url": "https://www.cryptopolitan.com/dappradar-price-prediction-2023-2032-how-high-can-radar-rise/",
    "description": "DappRadar Price Prediction 2023-2032 DappRadar price prediction 2023- $0.007 DappRadar price prediction 2026- $0.024 DappRadar price prediction 2029- $0.076 DappRadar price prediction 2032- $0.22 The cryptocurrency market&#8217;s popularity has soared, but it&#8217;s also brought potential losses for some. This has led traders and investors to seek precise future price insights for DappRadar (RADAR) and answer ... <a title=\"DappRadar Price Prediction 2023-2032: How High Can RADAR Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dappradar-price-prediction-2023-2032-how-high-can-radar-rise/\" aria-label=\"More on DappRadar Price Prediction 2023-2032: How High Can RADAR Rise?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T15:55:46.000Z",
    "title": "Central Banks in France, Singapore, and Switzerland successfully test cross-border CBDCs",
    "url": "https://www.cryptopolitan.com/central-banks-bis-test-cross-border-cbdcs/",
    "description": "The Bank for International Settlements (BIS) and the central banks of France, Singapore, and Switzerland concluded a joint test of the cross-border trading and settlement of central bank digital currencies (CBDCs) for wholesale transactions. The Banque de France released a report on September 28. The so-called Project Mariana was conceived by the Banque de France, ... <a title=\"Central Banks in France, Singapore, and Switzerland successfully test cross-border CBDCs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/central-banks-bis-test-cross-border-cbdcs/\" aria-label=\"More on Central Banks in France, Singapore, and Switzerland successfully test cross-border CBDCs\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T15:29:26.000Z",
    "title": "The Democratic Deficit in AI Decision-Making: Who Holds the Power?",
    "url": "https://www.cryptopolitan.com/democratic-deficit-in-ai-decision-making/",
    "description": "In a world increasingly shaped by artificial intelligence (AI), many are left wondering who decided to usher in this era of disruption. Did you, like so many others, miss the memo on AI&#8217;s grand entrance into our lives? The truth is, the pivotal decisions regarding AI development and deployment have been largely orchestrated by a ... <a title=\"The Democratic Deficit in AI Decision-Making: Who Holds the Power?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/democratic-deficit-in-ai-decision-making/\" aria-label=\"More on The Democratic Deficit in AI Decision-Making: Who Holds the Power?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-28T15:49:31.000Z",
    "title": "Coinbase launches campaign for balanced crypto regulations in US",
    "url": "https://crypto.news/coinbase-launches-campaign-for-balanced-crypto-regulations-in-us/",
    "description": "Coinbase visited Washington D.C. to advocate for clearer crypto regulations"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-28T15:42:48.000Z",
    "title": "Coinbase launches perpetual futures trading to non-US retailers",
    "url": "https://crypto.news/coinbase-launches-perpetual-futures-trading-to-non-us-retailers/",
    "description": "Coinbase has announced the expansion of its perpetual futures trading service to non-US retail clients"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-28T15:33:21.000Z",
    "title": "Binance Russia employees may join CommEx following acquisition",
    "url": "https://crypto.news/binance-russia-employees-may-join-commex-following-acquisition/",
    "description": "Binance CEO Changpeng Zhao has said some former Binance Russia employees and the Commonwealth of Independent States might be integrated into the CommEx team"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-28T15:17:13.000Z",
    "title": "BIS and central banks of France, Singapore, and Switzerland wrap up CBDC project",
    "url": "https://crypto.news/bis-and-central-banks-of-france-singapore-and-switzerland-wrap-up-cbdc-project/",
    "description": "The Bank for International Settlements (BIS) and the central banks of France, Singapore, and Switzerland have completed Project Mariana"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-28T15:50:38.000Z",
    "title": "Bitcoin, XRP Price Receive Boost Following This Coinbase Announcement",
    "url": "https://www.newsbtc.com/analysis/xrp/bitcoin-xrp-price-receive-boost-following-this-coinbase-announcement/",
    "description": "The Bitcoin and XRP price are showing some green on low-timeframes as certain narratives around the crypto space gain momentum. The cryptocurrencies stayed about two critical levels and could be poised to extend the trend in the coming days. Related Reading: XRP Price Set To Skyrocket: Crypto Analyst Predicts 1160% Surge Ahead As of this writing, the XRP price trades at $0.50 with a 1% profit in the last 24 hours. In the meantime, Bitcoin recorded a 2.4% profit over a similar period, but the number one cryptocurrency by market cap could underperform XRP and other altcoins. Coinbase To Launch Crypto Futures Trading Worldwide Crypto exchange Coinbase recently announced the launch of a derivatives platform for its international clients. The US company has been trying to increase its presence overseas as the Securities and Exchange Commission (SEC) tightens regulatory conditions in the country. In that sense, the crypto trading venue launched an international arm to grow revenue as spot trading volumes decline with the crypto market. Today, the exchange is confirmed to have secured a license with the Bermuda Monetary Authority (BMA) to allow institutions to trade perpetual futures outside the US. The company said in an official statement: Today, we are excited to announce that Coinbase International Exchange has received additional regulatory approval from the BMA to extend perpetual futures trading to non-US retail customers. In the coming weeks, we will begin to offer eligible customers access to regulated perpetual futures contracts on Coinbase Advanced. This announcement could onboard more traders to the crypto ecosystem to benefit Bitcoin, the XRP price, and the entire market. XRP has been among the most popular coins in the past few months following a critical legal victory in the US. XRP Price Ready For A Surprise Soon? While the legal scenario in the US is still uncertain for the nascent sector, analyst Brett Hill believes that XRP is one of the coins that will benefit due to its victory against the SEC. The analyst claims that the “Far West,” the era where everything was allowed, is “virtually over” for the nascent industry. If this scenario plays out, tokens with legal support will thrive, and XRP and Bitcoin seem the two likely winners in this new era. Just yesterday, SEC Chair Gensler reiterated that Bitcoin is not a security, according to US law, and a court did the same for XRP. Related Reading: Tellor (TRB) Is Up 640% In 2023, Back To 2021 Highs Ahead of Bitcoin, XRP? In that sense, the analyst says that the XRP could “take you all by surprise” in the coming 48 hours while adding: The golden age of cryptocurrency in the far west is virtually over; coming forward, everything will be regulated by white hats. Cover image from Unsplash, Chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T16:07:24.000Z",
    "title": "Shibarium Tech Suite: NOWNodes Powers Shiba Inu’s DeFi Revolution",
    "url": "https://www.crypto-news-flash.com/shibarium-tech-suite-nownodes-powers-shiba-inus-defi-revolution/?utm_source=rss&utm_medium=rss&utm_campaign=shibarium-tech-suite-nownodes-powers-shiba-inus-defi-revolution",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/shiba-gf0bba8f48_1920-48x27.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />NowNodes, a leading Blockchain-as-a-Service NowNodes takes to X, to announce a new integration with Shibarium.  The integration will allow NowNodes to host Shib the Tech Shibarium Tech Suite bots going forward.  The Shibarium takeover is ongoing, and NowNodes has continued to spearhead this movement. In a recent announcement, it was announced that Shib Tech Shibarium [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T16:00:07.000Z",
    "title": "What’s In Store For SHIB, APE & $ROE?",
    "url": "https://www.crypto-news-flash.com/whats-in-store-for-shib-ape-roe/?utm_source=rss&utm_medium=rss&utm_campaign=whats-in-store-for-shib-ape-roe",
    "description": "<img width=\"512\" height=\"271\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-166.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-166.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-166-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-166-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Taking a closer look at three cryptocurrencies that have been making waves recently: Shiba Inu (SHIB), ApeCoin (APE), and Borroe.Finance ($ROE). As these choice  cryptocurrency for beginners  and seasoned experts continue to gain traction, Web3 market participants are paying attention to these digital assets and what sets them apart. &#62;&#62;BUY $ROE TOKENS NOW&#60;&#60; Shiba Inu [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T15:30:03.000Z",
    "title": "Coinbase’s Layer-2 Base Integrates Chainlink’s Pioneering CCIP Technology",
    "url": "https://www.crypto-news-flash.com/coinbases-layer-2-base-integrates-chainlinks-pioneering-ccip-technology/?utm_source=rss&utm_medium=rss&utm_campaign=coinbases-layer-2-base-integrates-chainlinks-pioneering-ccip-technology",
    "description": "<img width=\"1038\" height=\"612\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Airchains has joined Chainlink&#039;s BUILD program, aiming to accelerate appchains and rollup technology adoption. \" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-300x177.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-1024x604.png 1024w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />Chainlink’s Cross-Chain Interoperability Protocol (CCIP) goes live on the Ethereum Layer-2 network, Base, facilitating enhanced cross-chain applications and services. This integration follows Chainlink’s Price Feeds activation on Base last month, further extending the capabilities accessible to developers on this platform. In an event that underscores the relentless march towards seamless blockchain interoperability, Chainlink&#8216;s Cross-Chain Interoperability [...]"
  }
]