[
  {
    "source": "CoinDesk",
    "date": "2023-06-26T15:13:25.000Z",
    "title": "Bitcoin Miner Hut 8 Secures Up to $50M in Loans From Coinbase",
    "url": "https://www.coindesk.com/business/2023/06/26/bitcoin-miner-hut-8-secures-up-to-50m-in-loans-from-coinbase/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The first $15 million will be drawn shortly after closing the deal, while another $15 million is conditional on closing a merger with peer USBTC."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-26T15:30:26.000Z",
    "title": "Hut 8 nabs $50M Coinbase credit facility ahead of merger with US Bitcoin",
    "url": "https://cryptoslate.com/hut-8-nabs-50m-coinbase-credit-facility-ahead-of-merger-with-us-bitcoin/",
    "description": "<p>Bitcoin (BTC) miner Hut 8 said on June 26 that its subsidiary, Hut 8 Holdings, entered into a $50 million credit facility agreement with Coinbase Credit for general corporate purposes. Hut 8 stated that the credit facility offers a $15 million term loan that would be funded at or shortly after closing. The facility also [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/hut-8-nabs-50m-coinbase-credit-facility-ahead-of-merger-with-us-bitcoin/\">Hut 8 nabs $50M Coinbase credit facility ahead of merger with US Bitcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-26T15:33:05.000Z",
    "title": "Biggest Movers: DOGE, SHIB Slip on Monday, as Traders Capture Recent Gains",
    "url": "https://news.bitcoin.com/biggest-movers-doge-shib-slip-on-monday-as-traders-capture-recent-gains/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2072469590-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"DOGE, SHIB Slips on Monday, as Traders Capture Recent Gains\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2072469590-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2072469590-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2072469590-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2072469590-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2072469590-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2072469590-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2072469590-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Dogecoin dropped by nearly 3% on Monday, as traders began to take profits following last week’s gains. Cryptocurrency largely consolidated to start the week, with the global market cap down 0.64% as of writing. Shiba inu was another coin to move lower today. Dogecoin (DOGE) Dogecoin (DOGE) was in the red to start the week, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T15:30:02.000Z",
    "title": "Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices considering investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand&#8217;s price prediction from 2023 to 2032, its expected minimum price, and what it brings. For ... <a title=\"Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T15:18:56.000Z",
    "title": "South Korea bans Haru Invest executives travel amid crypto fraud investigation",
    "url": "https://www.cryptopolitan.com/haru-invest-executives-travel-ban-by-skorea/",
    "description": "In a significant turn of events for the crypto sector, South Korea has banned the management of notable crypto business Haru Invest from leaving the country. Concerns about investor safety and regulatory compliance in digital assets prompted this action following a fraud probe against the company. This decision sends a solid message to would-be wrongdoers ... <a title=\"South Korea bans Haru Invest executives travel amid crypto fraud investigation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/haru-invest-executives-travel-ban-by-skorea/\" aria-label=\"More on South Korea bans Haru Invest executives travel amid crypto fraud investigation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T15:14:25.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-26T15:27:54.000Z",
    "title": "Bomb threats targeting US retailers demand bitcoin payments, FBI involved",
    "url": "https://crypto.news/bomb-threats-targeting-us-retailers-demand-bitcoin-payments-fbi-involved/",
    "description": "Law enforcement authorities in the US are intensifying efforts to investigate a series of bomb threats targeting major retail chains, with the culprits demanding payments in bitcoin, according to a WSJ report."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-26T15:30:30.000Z",
    "title": "Bybit Expands Global Presence With Cyprus Crypto License",
    "url": "https://www.newsbtc.com/crypto/bybit-expands-global-presence-with-cyprus-crypto-license/",
    "description": "Bybit, the third biggest crypto exchange in the world, is expanding its global presence. Today, the exchange announced that it has been granted a license to operate a cryptocurrency exchange in Cyprus and provide custody services for digital assets.  Expanding The Crypto Exchange&#8217;s Global Footprint Bybit obtaining a license to operate in Cyprus is a strategic move to expand its global footprint. With this license, Bybit can now offer crypto exchange and custody services to customers in Cyprus and throughout the European Union. Related Reading: Lightning Network Hits Record Highs In Bitcoin And US Dollar Capacity These include trading between crypto pairs and fiat currency pairs, financial services related to crypto assets, and custody solutions tailored to clients in Cyprus. The company said in a statement: Cyprus is recognized as a burgeoning hub for cryptocurrency activities, with a growing community of crypto enthusiasts and a favorable regulatory environment. Bybit recognizes the immense potential of the Cyprus market and is excited to bring its next-level reliability and opportunities to the local digital asset community. Bybit now has operations and licenses in several major regions, including North America, Asia-Pacific, and now Europe Growth For ByBit Over the past few months, the exchange has been steadily experiencing growth and expanding its service offerings. Bybit’s user base has also skyrocketed. Last month, the company announced a 50% increase in its global user base, growing from 10 million users in Q3, 2022 to 15 million this year.  Bybit recently moved its headquarters to Dubai on April 18th as part of its mission to invest in the Middle East and North Africa (MENA) region, which is more welcoming of the crypto industry. Not long after, Bybit joined Binance and OKX in exiting the Canadian market, citing recent changes in regulatory policy.  Related Reading: Bitcoin Bullish Signal: Exchange Whale Ratio Plunges The new headquarters is the latest in a series of milestones for Bybit as it cements its position as a leading crypto exchange. Dubai has become a hub for crypto and blockchain technology, so it’s an ideal location for a fast-growing crypto exchange like Bybit.  Bybit operations in Cyprus are going to be subject to the newly introduced Markets in Crypto Assets Regulation (MiCA) in the European Union.  However, Binance, a close crypto exchange peer of Bybit, recently a shocking move to deregister in Cyprus. Binance claims that it is exiting the Cyprus market in order to reevaluate its business strategy and ensure that it will be in full compliance with MiCA when it is eventually put into place within the next 18 months. Total crypto market reaches $1.144 trillion as positive sentiment ramps up &#124; Source: Total Crypto Market Cap on TradingView.com Featured image from Yahoo Finance, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T15:36:36.000Z",
    "title": "Cardano’s DEXes Making Waves: SundaeSwap Hits Milestone as ADA Sees Growth Despite Price Decline",
    "url": "https://www.crypto-news-flash.com/cardanos-dexes-making-waves-sundaeswap-hits-milestone-as-ada-sees-growth-despite-price-decline/?utm_source=rss&utm_medium=rss&utm_campaign=cardanos-dexes-making-waves-sundaeswap-hits-milestone-as-ada-sees-growth-despite-price-decline",
    "description": "Cardano is reported to have recorded an incredible surge of network activities as decentralized exchanges hit milestones.  The price is, however, struggling in the last 24 hours as ADA falls by 4 percent to trade at $0.28. Cardano (ADA) has seen increased activity on its network over the past few months with its decentralized exchanges [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T15:30:02.000Z",
    "title": "Former Bartender whose Early Dogecoin Investment Made Him a Millionaire is Going ALL IN on a New Memecoin. He Swore it is the Best Move",
    "url": "https://www.crypto-news-flash.com/former-bartender-whose-early-dogecoin-investment-made-him-a-millionaire-is-going-all-in-on-a-new-memecoin-he-swore-it-is-the-best-move-2/?utm_source=rss&utm_medium=rss&utm_campaign=former-bartender-whose-early-dogecoin-investment-made-him-a-millionaire-is-going-all-in-on-a-new-memecoin-he-swore-it-is-the-best-move-2",
    "description": "Dogecoin has been the sauce of meme coins since its launch in 2013, when its developers decided to throw some humour into an already tense crypto market. The memecoin has gone on to prove its place as one of the big dogs (pun intended) among meme coins. Dogecoin has enjoyed the meme spotlight for over [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T15:25:18.000Z",
    "title": "Samsung Heavy Industries Adopts VeChainThor Blockchain for Secure Intelligent Ship Data Applications, Supported by DNV Certification",
    "url": "https://www.crypto-news-flash.com/samsung-heavy-industries-adopts-vechainthor-blockchain-for-secure-intelligent-ship-data-applications-supported-by-dnv-certification/?utm_source=rss&utm_medium=rss&utm_campaign=samsung-heavy-industries-adopts-vechainthor-blockchain-for-secure-intelligent-ship-data-applications-supported-by-dnv-certification",
    "description": "Samsung Heavy Industries becomes the first in the country to offer blockchain-based security solutions in the autonomous shipping sector. VeChain ToolChain actively supports DNV in developing blockchain solutions and applications that meet market demands, etc. VeChian, the enterprise-grade Layer-1 smart contract platform, continues to be part of industry-leading applications. In the latest development, DNV, the [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-26T15:20:00.000Z",
    "title": "HSBC Enables BTC and ETH ETF Investment for Customers in Hong Kong",
    "url": "https://coinedition.com/hsbc-enables-btc-and-eth-etf-investment-for-customers-in-hong-kong/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Hong_Kongs_Crypto_Hub_Ambitions_Win_Quiet_Backing_From_Beijing.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Hong_Kongs_Crypto_Hub_Ambitions_Win_Quiet_Backing_From_Beijing.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Hong_Kongs_Crypto_Hub_Ambitions_Win_Quiet_Backing_From_Beijing-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Hong_Kongs_Crypto_Hub_Ambitions_Win_Quiet_Backing_From_Beijing-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Hong_Kongs_Crypto_Hub_Ambitions_Win_Quiet_Backing_From_Beijing-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Hong_Kongs_Crypto_Hub_Ambitions_Win_Quiet_Backing_From_Beijing-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Hong_Kongs_Crypto_Hub_Ambitions_Win_Quiet_Backing_From_Beijing-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>London-based HSBC has become the first bank in Hong Kong to enable crypto investment for its customers. As the largest bank in Hong Kong, HSBC is now allowing its customers to buy and sell Bitcoin and Ethereum exchange-traded funds (ETFs). The move aims to expand the exposure of Hong Kong customers to crypto products. Crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/hsbc-enables-btc-and-eth-etf-investment-for-customers-in-hong-kong/\">HSBC Enables BTC and ETH ETF Investment for Customers in Hong Kong</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]