[
  {
    "source": "NewsBTC",
    "date": "2023-08-03T01:00:42.000Z",
    "title": "Litecoin Completes Halving, But Price Plunges 6%",
    "url": "https://www.newsbtc.com/news/litecoin/litecoin-completes-halving-but-price-plunges-6/",
    "description": "Litecoin has completed its much-anticipated halving event today, but it seems the investors have reacted by participating in a selloff. Litecoin Has Completed Its Third Halving, Block Rewards Now Down To 6.25 LTC The &#8220;halving&#8221; event is where LTC&#8217;s block rewards are permanently cut in half. This event is periodic, occurring approximately every four years or roughly every 840,000 blocks miners hash. Today&#8217;s halving was Litecoin&#8217;s third, meaning its block rewards have been cut three times since its genesis. In the first halving, the cryptocurrency saw its block rewards go from an initial 50 LTC to 25 LTC, and with the second, the tips dropped further to 12.5 LTC. With the latest halving event, miners&#8217; rewards for solving blocks have been cut down further to 6.25 LTC. The reason that halvings even exist is because they serve as a measure for controlling the asset&#8217;s inflation. These block rewards that miners receive are the only way to introduce fresh tokens into the circulating supply, so cutting them down repeatedly makes sure that the cryptocurrency&#8217;s supply goes up slower and slower. Eventually, when the halvings would keep on happening, the block rewards would approach zero. This would occur approximately in 2142. After this point, the asset&#8217;s supply will hit the maximum cap, and the miners will have to rely on transaction fees to pay off their running costs. As halvings are important events, it&#8217;s natural that there has been a lot of discussion around this latest event as it has approached. During the start of July, the asset had observed a sharp rally towards the $114 mark, as the market had perhaps become hopeful for the halving, which was only one month away. Related Reading: Bitcoin Funding Rates Most Positive Since Feb, Long Squeeze Soon? This rally, however, ran out of steam soon enough, and since then, LTC has struggled to put together any significant bullish momentum. LTC has plunged during the past day &#124; Source: LTCUSD on TradingView Today&#8217;s halving hasn&#8217;t been able to change anything in this matter, either, as Litecoin has only plummeted further instead. It would appear that the event has indeed been a buy the rumor, sell the news type of scenario. Following the latest plummet, Litecoin has gone below the $87 level and is down almost 7% during the past 24 hours. These high losses mean that LTC has been the poorest-performing coin out of the top cryptocurrencies by market cap in this period. Related Reading: BlackRock CEO Larry Fink Is The Best Thing To Happen To Bitcoin, Mike Novogratz Says While the price performance of the asset might have been poor, LTC supporters may take solace in the fact that the asset has come forward a lot in terms of other network-related metrics since the previous halving, as data from IntoTheBlock shows: The growth of the LTC network &#124; Source: IntoTheBlock on X Interestingly, the price at which both halvings happened was approximately the same. The cryptocurrency seems to have done well in terms of userbase and utility-related growth. This impressive rise in adoption may be because Litecoin offers cheap and fast transactions compared to some other networks like Bitcoin. LTC investors can only hope, however, that this growth may also show up in the price. Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, IntoTheBlock.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-03T01:00:00.000Z",
    "title": "Crypto’s Bullish Surge — Would There be a ‘Soft Landing’ to Expect?",
    "url": "https://coinedition.com/cryptos-bullish-surge-would-there-be-a-soft-landing-to-expect/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Crypto Bullish Surge\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Bullish-Surge-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The crypto industry is currently experiencing a boost from technological advancements and increasingly favorable legal and legislative factors. However, the biggest risk to crypto valuations lies in the macroeconomic outlook, particularly the possibility of a &#8220;soft landing&#8221; for the US economy. In the latest report of Grayscale Investments, Zach Pandl, Managing Director of Research, emphasized [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/cryptos-bullish-surge-would-there-be-a-soft-landing-to-expect/\">Crypto&#8217;s Bullish Surge — Would There be a ‘Soft Landing’ to Expect?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]