[
  {
    "source": "CryptoSlate",
    "date": "2023-06-02T16:34:53.000Z",
    "title": "Tron’s TRX now live on Ethereum via BitTorrent bridge, boosting DeFi access",
    "url": "https://cryptoslate.com/trons-trx-now-live-on-ethereum-via-bittorrent-bridge-boosting-defi-access/",
    "description": "<p>Tron&#8217;s TRX is available on Ethereum (ETH) after leveraging BitTorrent (BTT) Bridge to gain access to the largest decentralized finance (DeFi) ecosystem in the industry. In a May 2 tweet, Tron Network founder Justin Sun said TRX was &#8220;fully accessible within the Ethereum ecosystem&#8221; and included the contract address for the token. TRX is Tron&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/trons-trx-now-live-on-ethereum-via-bittorrent-bridge-boosting-defi-access/\">Tron&#8217;s TRX now live on Ethereum via BitTorrent bridge, boosting DeFi access</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-02T16:15:00.000Z",
    "title": "Momentous Surge for Sparklo (SPRK) Amid Bearish Runs for Near Protocol (NEAR) and XRP (XRP)",
    "url": "https://cryptodaily.co.uk/2023/06/momentous-surge-for-sparklo-sprk-amid-bearish-runs-for-near-protocol-near-and-xrp-xrp",
    "description": "<p>The market trends in the crypto industry have yet again sprung up new development that is forcing the hands of investors. As it stands, Sparklo has continued its meteoric rise in price and reputation among crypto investors because of the project's outstanding potential. However, the market price of coins like Near Protocol (NEAR) and XRP (XRP) has continued to struggle in the crypto market.</p>\n<p class=\"s7\">Investors are joyful as Sparklo (SPRK) keeps its consistent growth</p>\n<p>The stability that the Sparklo project has shown in the past weeks is bringing smiles to early investors of the token. More investors have joined the Sparklo project in a bid to position themselves for potential moon-bound growth. Sparklo is an innovative blockchain-based investment platform that allows users to invest in profitable solid treasures like Gold, Silver and Platinum. Investors can also passively trade these assets using fractionalized NFTs as digital placeholders.</p>\n<p>It is safe to say that the Sparklo token (SPRK) is one of the hottest tokens in the crypto market at the moment. Crypto experts have already projected a 1,000% rise in price value for the token before the end of Q4 of 2023. Currently, the SPRK token goes at the price of only $0.030 per token. Investors that purchase the SPRK token now will be given a 100% bonus for their purchase which will end in the next 48 hours. This means you have limited time to benefit from this bonus. Experienced investors will recognize that now is the best time to invest in the SPRK tokens for significant gains in the near future.</p>\n<p>The safety and security of the Sparklo project have been vetted and approved through the Interfi Network. Moreso, BlockAudit Report Team has verified the project's KYC certification. The SPRK token will be locked for 100 years to avoid an event of a rug pull. Do not hesitate to invest in the Sparklo project, as we believe in the promising potential of the token. Click the link below to invest.</p>\n<p>&gt;&gt;&gt;&gt; PURCHASE HERE &lt;&lt;&lt;</p>\n<p class=\"s7\">Near Protocol (NEAR) sees a crab-like price movement</p>\n<p>Near Protocol (NEAR) is a community-driven cloud computing protocol that operates on the layer 1 blockchain to enhance the overall activities on the blockchain. Within the last 24 hours, Near Protocol (NEAR) saw an insignificant -0.18% loss in price value. This development pegs the price of the Near Protocol (NEAR) token at $1.56 at the time of writing. The trading volume of Near Protocol (NEAR) went down by -20.31% and currently stands at $40,745,164.</p>\n<p>In the last few days, the Near Protocol (NEAR) price has not seen any upward price movement. The Near Protocol (NEAR) price chart shows that the coin is struggling to overcome the bear market. Despite all these, crypto experts still think that the price of Near Protocol (NEAR) will surge in the coming days despite the current price trajectory and the stats suggesting the contrary. Near Protocol (NEAR) coin holders have already joined the ongoing Sparklo project, which has proven to be a more viable investment option.</p>\n<p class=\"s7\">XRP (XRP) declines in price value amid fresh token released from escrow</p>\n<p>XRP (XRP) is a decentralized open-source ledger that executes transactions in the blockchain network at a low-cost price alongside speed and scalability. In a fresh development, XRP (XRP) now has an additional 1 billion tokens added to its circulating supply in another monthly token released by the network. This development was executed through the escrow system which has 55 billion XRP (XRP) tokens locked in from December 17, 2021. These tokens have since then been released at 1 billion per month. However, the escrow system has seen divided opinions among experts as to whether it affects the price of the XRP (XRP) token negatively.</p>\n<p>XRP (XRP) in the last 24 hours lost &nbsp;1.08% in price value. As a result, the price of XRP (XRP) is $0.50 at present time. The coin has made significant progress in the last few days and has gained over 5%. However, with the last 24 hours' price of XRP (XRP) not showing signs of a rally, the XRP (XRP) investors have moved over to the trending Sparklo project, where significant gains will be made. The Sparklo project is already giving a bonus for token purchase, which makes it one of the best crypto projects for now. </p>\n<p class=\"s10\">Find out more about the Sparklo presale:</p>\n<p>Website: https://sparklo.finance</p>\n<p class=\"s10\">Presale: https://invest.sparklo.finance</p>\n<p class=\"s10\">Twitter: https://twitter.com/sparklo_finance</p>\n<p class=\"s10\">Telegram: https://t.me/sparklofinance</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T16:38:50.000Z",
    "title": "U.S. unemployment rate is surging – Details",
    "url": "https://www.cryptopolitan.com/us-unemployment-rate-is-surging-details/",
    "description": "The rising tide of unemployment in the U.S. has raised eyebrows in economic circles, as a seven-month high of 3.7% in May suggests that labor market conditions are easing. This development could potentially allow the Federal Reserve a reprieve from initiating an interest rate hike this month. Delving into the factors behind the surge The ... <a title=\"U.S. unemployment rate is surging &#8211; Details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-unemployment-rate-is-surging-details/\" aria-label=\"More on U.S. unemployment rate is surging &#8211; Details\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T16:27:09.000Z",
    "title": "Uniswap DAO votes against charging LP fees",
    "url": "https://www.cryptopolitan.com/uniswap-dao-votes-against-charging-lp-fees/",
    "description": "The recent proposal to introduce protocol fees for the Uniswap decentralized exchange did not pass on June 1, leading to the continued opportunity for liquidity providers (LPs) to earn all revenue from swaps. According to the official webpage of the proposal, the “no fee” camp narrowly won with 45.32% of the votes, while 42.34% favored ... <a title=\"Uniswap DAO votes against charging LP fees\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-dao-votes-against-charging-lp-fees/\" aria-label=\"More on Uniswap DAO votes against charging LP fees\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T16:23:51.000Z",
    "title": "Russia claims the U.S. is using iPhones to spy",
    "url": "https://www.cryptopolitan.com/russia-claims-the-us-is-using-iphones-to-spy/",
    "description": "In an unforeseen development, the Federal Security Service (FSB) in Russia ignited a fresh diplomatic controversy by accusing the U.S. of deploying an advanced surveillance system that compromised thousands of iPhones. The FSB, a contemporary incarnation of the Soviet-era KGB, has emphasized that the alleged espionage operation targeted not just native Russians but also numerous ... <a title=\"Russia claims the U.S. is using iPhones to spy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/russia-claims-the-us-is-using-iphones-to-spy/\" aria-label=\"More on Russia claims the U.S. is using iPhones to spy\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T16:14:21.000Z",
    "title": "AI craze brings massive rally to American tech stocks",
    "url": "https://www.cryptopolitan.com/ai-craze-massive-rally-american-tech-stocks/",
    "description": "The ongoing fascination with Artificial Intelligence (AI) has catalyzed an investment frenzy that has set records tumbling on Wall Street. The technology sector, leading the vanguard, has experienced an extraordinary inflow of capital. In the week leading up to Wednesday, tech equity funds were inundated with an unprecedented volume of investments, according to BofA Global ... <a title=\"AI craze brings massive rally to American tech stocks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-craze-massive-rally-american-tech-stocks/\" aria-label=\"More on AI craze brings massive rally to American tech stocks\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T16:11:36.000Z",
    "title": "AI-powered military drone fail simulation tests",
    "url": "https://www.cryptopolitan.com/ai-powered-drone-fail-simulation-tests/",
    "description": "The United States Air Force (USAF) encountered an unexpected setback during simulated tests of an AI-powered military drone. Colonel Tucker “Cinco” Hamilton, the AI test and operations chief for the USAF, revealed the peculiar behavior of the drone during a defense conference held in London on May 23 and 24. The AI-powered drone was eliminating ... <a title=\"AI-powered military drone fail simulation tests\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-powered-drone-fail-simulation-tests/\" aria-label=\"More on AI-powered military drone fail simulation tests\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-02T16:30:37.000Z",
    "title": "Ripple CTO Schwartz Reveals Insights Into AMM Trading Strategy",
    "url": "https://www.newsbtc.com/news/ripple/ripple-cto-schwartz-reveals-insights-into-amm-trading-strategy/",
    "description": "In a recent post, Ripple CTO, David Schwartz, explained Automated Market Makers (AMMs) &#8211; a vital component in the decentralized finance (DeFi) framework, and their trading strategies for profit. Related Reading: Litecoin Breaks $95 As Whale Transactions Spike Schwartz states that AMMs thrive when an asset is volatile but does not change its price direction much. Schwartz explained further that an asset whose volatility exceeds its long-term trend would have a positive average percentage movement. However, if the long-term trend is negative, it will reduce the average slightly and vice-versa.  It’s Not Difficult to Create A Trading Strategy, Ripple CTO According to the Ripple CTO, it is not difficult to create a trading strategy to track the average percentage movement of an asset.  He further explained that the trading strategy of an AMM is advanced compared to a simple trading strategy and focuses on price volatility. Related Reading: Galaxy Digital CEO Mike Novogratz Says This Will Kickstart The Bitcoin Bull Market Schwartz, however, added a disclaimer at the end of his analysis. He stated that the AMM trading strategy only works for an AMM between an asset with a fixed price and one whose price is volatile enough to overcome its long-term trend.  Also, he believes that although AMM works even when the assets don&#8217;t meet the stated conditions, their behavior is different. From his analysis, a notable deviation will only occur with a long-term negative price movement that exceeds the volatility. Crypto Enthusiast Reacts To Analysis Reacting to Schwartz&#8217;s AMM analysis, Molly Elmore asked if XRP would be the asset with a fixed price paired with every other asset on the XRP ledger (XRPL). In response, Schwartz stated that the AMM is not exclusive to XRP and can function between any asset pair. However, the trading strategies will differ mathematically if both assets are volatile.  Citing the BTC/XRP pair as a reference, Schwartz stated that although both assets are volatile, the pairing is still great. Additionally, he stated that if you are bullish on XRP and BTC, investing in an XRP/USD AMM implies holding much USD that can go up. Notably, holding shares of an XRP/BTC AMM captures more of the upward price movement of XRP and BTC if the bullish sentiment is correct. Schwartz continued his analysis, stating that if XRP and BTC&#8217;s price doubles, an XRP/USD AMM has a worst-case (no volatility and no market making) yield of around 40%. In comparison, an XRP/BTC AMM has a worst-case yield of 100%. On the flip side, Schwartz noted that the outcome is worse if your bullish sentiment is wrong.  If both XRP and BTC reduce by 50%, the worst case loss is 50%, while for an XRP/USD AMM, the worst case loss is about 30%. So he believes XRP USD is safer while XRP/BTC is volatile. Schwartz noted that his analysis seemed complex and explained further in a tweet.  He stated that AMMs charges trading fees, and volatility causes people to trade with AMMs. Therefore, AMMs turn volatility into fees. Featured image from Pixabay and chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-02T16:35:35.000Z",
    "title": "OKX Proposes Industry-First BRC-30 Token Standard To Enable Bitcoin and BRC-20 Token Staking",
    "url": "https://dailyhodl.com/2023/06/02/okx-proposes-industry-first-brc-30-token-standard-to-enable-bitcoin-and-brc-20-token-staking/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>June 1, 2023 – San Francisco, California With BRC-30, OKX Wallet users will soon be able to stake BRC-20 tokens and Bitcoin to earn passive income on their digital assets. OKX, a leading Web 3.0 company, today introduced its proposal for a new open-source BRC-30 protocol that enables staking of BRC-20 tokens and Bitcoin in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/02/okx-proposes-industry-first-brc-30-token-standard-to-enable-bitcoin-and-brc-20-token-staking/\">OKX Proposes Industry-First BRC-30 Token Standard To Enable Bitcoin and BRC-20 Token Staking</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]