[
  {
    "source": "CryptoSlate",
    "date": "2023-06-13T16:29:41.000Z",
    "title": "Hodlers keep accumulating Bitcoin in wake of US regulation onslaught",
    "url": "https://cryptoslate.com/hodlers-keep-accumulating-bitcoin-in-wake-of-us-regulation-onslaught/",
    "description": "<p>Amidst market uncertainty and regulatory crackdowns, Bitcoin's long-term holders have been unfazed, steadily accumulating the digital asset. As a key market sentiment indicator, these investors showcase resilience in the face of chaos. But what happens when we dive into the data, uncovering a dramatic accumulation spike in early May and its correlation with the Coin Days Destroyed 90 metric? Unravel the enigmatic relationship between these metrics and the unwavering faith in Bitcoin's future held by long-term investors...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/hodlers-keep-accumulating-bitcoin-in-wake-of-us-regulation-onslaught/\">Hodlers keep accumulating Bitcoin in wake of US regulation onslaught</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-13T16:30:00.000Z",
    "title": "From Gamer to Crypto Pro: How Cosmic FOMO Transforms Players into Savvy Traders",
    "url": "https://cryptodaily.co.uk/2023/06/from-gamer-to-crypto-pro-how-cosmic-fomo-transforms-players-into-savvy-traders",
    "description": "<p class=\"s3\">We've all come across captivating tales of traders who struck it rich in the world of cryptocurrencies. These stories, where a fortunate individual invested a mere $100 and reaped a staggering $100,000 in a single day, never fail to captivate readers. They simultaneously allure and intimidate us because we are well aware of the timeless axiom: high returns always come hand in hand with high risks. Nevertheless, have you ever wondered how to learn crypto trading in the least risky manner?</p>\n<p class=\"s3\">Cosmic FOMO, a product inside the MarsDAO ecosystem masterminded and launched by Vlad Utushkin, is an app that teaches cryptocurrency trading and is focused on beginners who make their first steps in the crypto world. Cosmic FOMO imparts crypto trading skills through an engaging gaming experience, allowing users to earn without risking their actual assets. With Cosmic FOMO, users can take their initial strides into the realm of secure cryptocurrency management, comprehending the intricacies of trading and mastering the mechanics of the cryptocurrency market, all in a delightful game format. The primary focus of Cosmic FOMO lies in empowering gamers to make informed choices and accurate predictions. It's like a cryptocurrency trading course but fun and engaging.&nbsp;</p>\n<p class=\"s3\">The team behind this project released 20+ successful out-of-the-box products. This time their mission is proclaimed to be the simplification of the transition into the world of digital assets, drawing mass adoption ever closer.</p>\nHow to start a Cosmic FOMO journey\n<p class=\"s3\">Gameplay unfolds in the following manner: users must select a playable character known as a pilot, which exists as a non-fungible token (NFT) within the BNB Smart Chain. These pilots require backpacks to be filled with cryptocurrencies (currently offering 15 available assets) that players believe will appreciate in value within the next 60 minutes. Once prepared, the pilot embarks on a thrilling space race. It is crucial to note that the app provides a simulation of asset acquisition, eliminating the need for users to purchase any actual assets. Each flight lasts between 10 minutes to an hour, during which the quotes of the selected assets may fluctuate. Ultimately, the income received hinges upon these fluctuations. All asset quotes are streamed directly from Binance, ensuring real-time accuracy. If players wish to secure their profits mid-flight, they have the option to terminate the race prematurely. The greater the growth of the selected assets, the higher the profits received. Those players whose predictions prove right win COSMIC, in-game tokens that can be used to upgrade pilot's stats. This unique approach enables users to learn the art of trading, comprehend the workings of the cryptocurrency market, and safeguard their tangible assets.</p>\n<p class=\"s3\">Energy replenishment occurs every six hours. For users with a single pilot, one flight per day is available, equating to 2 units of fuel. Owning a second pilot grants access to 3 units of fuel, with each subsequent pilot providing an additional unit. Accounts can accommodate a maximum of 50 pilots, but only a maximum of 17 fuels can be obtained.</p>\n<p class=\"s3\">The main feature of Cosmic FOMO is that there are no losers in this game. Even if a gamer lacks in-depth knowledge of cryptocurrencies or is unfamiliar with fundamental indicators that indicate future growth or decline, and even if their predictions turn out to be incorrect, they still receive in-game tokens regardless of the outcome of their gaming session. The only difference is that their reward will be comparatively smaller compared to more experienced players. This unique feature serves as one of Cosmic FOMO's primary advantages. The game was primarily designed for individuals embarking on their cryptocurrency journey. The project team aimed to create gameplay that is not only non-intimidating but also an exciting exploration into the world of cryptocurrencies, allowing future crypto owners to familiarize themselves with digital assets in a playful manner. Cosmic FOMO caters to all individuals, irrespective of their knowledge or skill level.&nbsp;</p>\nPilot Minting Bonus\n<p class=\"s3\">The game mechanics also feature the ability to independently mint pilots. In order to mint a new pilot, users need to cross two pilots that have attained a specific level known as a mint point. Each pilot can partake in minting up to 3 times, achievable at levels #11, #21, and #25. It is noteworthy that minting can transpire between pilots of varying classes and rarity levels. However, the likelihood of acquiring a rare or legendary pilot is contingent on these particular characteristics. For instance, crossing two common pilots will solely yield a common or uncommon pilot, while crossing a common pilot with a rare pilot offers a 40% chance of obtaining a rare pilot. NFTs produced via this method can be sold on the secondary market. Depending on the level and class of the newly minted pilot, owners have the potential to earn hundreds or even thousands of dollars through a single transaction. To engage in minting, players must possess COSMIC and MDAO tokens.</p>\n<p class=\"s3\">Thus, Cosmic FOMO offers a multitude of benefits that contribute to its popularity, including a balanced gameplay experience, a user-friendly interface that captivates the eye, and the incorporation of five deflationary tools that positively impact the game's equilibrium. Moreover, the game boasts straightforward mechanics that ensure accessibility for players of all backgrounds and skill levels.</p>\n<p class=\"s3\">Embrace Cosmic FOMO today, embark on an exhilarating crypto trading journey, and unlock the gateway to vast financial opportunities. This immersive game experience presents an unmatched avenue to acquire knowledge, refine trading skills, and potentially prosper in the exciting world of cryptocurrencies. Don't miss your chance to become the next trading prodigy!</p>\n<p class=\"s10\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-13T16:30:31.000Z",
    "title": "US Inflation Cools to 4% Annual Rate, Setting Stage for Fed’s Decision on Interest Rates",
    "url": "https://news.bitcoin.com/us-inflation-cools-to-4-annual-rate-setting-stage-for-feds-decision-on-interest-rates/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/inflat-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Inflation Cools to 4% Annual Rate, Setting Stage for Fed&#039;s Decision on Interest Rates\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/inflat-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/inflat-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/inflat-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/inflat-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/inflat-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/inflat-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/inflat.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Bureau of Labor Statistics&#8217; consumer price index (CPI) report, released on Tuesday, reveals that inflation in the United States has eased to a yearly rate of 4%. The latest development arrives just ahead of the upcoming Federal Open Market Committee (FOMC) meeting scheduled for June 14. The prevailing market sentiment leans towards the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T16:32:48.000Z",
    "title": "Apple threatens decentralized social media app Damus over Bitcoin tipping feature",
    "url": "https://www.cryptopolitan.com/apple-threatens-decentralized-social-media-app-damus/",
    "description": "Decentralized social networking app Damus has received a warning from Apple&#8217;s App Store, stating that it has 14 days to bring its tipping feature into compliance or face removal from the platform. The feature, called &#8220;zaps,&#8221; enables users to send Bitcoin tips to content creators via the Lightning Network. However, Apple claims the feature violates ... <a title=\"Apple threatens decentralized social media app Damus over Bitcoin tipping feature\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apple-threatens-decentralized-social-media-app-damus/\" aria-label=\"More on Apple threatens decentralized social media app Damus over Bitcoin tipping feature\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T16:31:57.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution that has gained popularity recently among Ethereum users for ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T16:29:54.000Z",
    "title": "Massive BLUR unlocking tomorrow: 196m tokens to be released",
    "url": "https://www.cryptopolitan.com/blur-unlocking-196m-tokens-to-be-released/",
    "description": "In the whirlwind of the global crypto market, one significant event looms on the horizon for BLUR, a thriving digital token. A colossal 196 million BLUR, equivalent to approximately $62.3 million, is slated for release tomorrow, accounting for roughly 40% of its circulating supply. This event carries with it the potential to fundamentally shake up ... <a title=\"Massive BLUR unlocking tomorrow: 196m tokens to be released\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blur-unlocking-196m-tokens-to-be-released/\" aria-label=\"More on Massive BLUR unlocking tomorrow: 196m tokens to be released\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T16:10:55.000Z",
    "title": "How China’s central bank is boosting liquidity",
    "url": "https://www.cryptopolitan.com/how-china-central-bank-is-boosting-liquidity/",
    "description": "As China&#8217;s economic dynamics shift, its central bank has ushered in a strategy to boost liquidity and stimulate economic growth. In an ambitious move to navigate the currents of economic pressures, China is taking definitive steps to ease the margin strain on banks and pour more liquidity into its real economy. Streamlining liquidity through interest ... <a title=\"How China&#8217;s central bank is boosting liquidity\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-china-central-bank-is-boosting-liquidity/\" aria-label=\"More on How China&#8217;s central bank is boosting liquidity\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-13T16:24:09.000Z",
    "title": "Uniswap v4 code now available on GitHub",
    "url": "https://crypto.news/uniswap-v4-code-now-available-on-github/",
    "description": "Uniswap v4's core code is now available on GitHub. It has new features including open-source hooks and a singleton factory."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T16:30:42.000Z",
    "title": "Can the price of SHIB reach $0.001 with Shibarium success? TCRV set for a price rise",
    "url": "https://www.crypto-news-flash.com/can-the-price-of-shib-reach-0-001-with-shibarium-success-tcrv-set-for-a-price-rise-2/?utm_source=rss&utm_medium=rss&utm_campaign=can-the-price-of-shib-reach-0-001-with-shibarium-success-tcrv-set-for-a-price-rise-2",
    "description": "The upcoming Shibarium could have a significant impact on Shiba Inu&#8217;s price, but the question remains: can it bring SHIB to $0.001? The Shiba Inu community strongly believes that Shibarium has the potential to be a game-changer.  The same optimism surrounds Tradecurve&#8217;s exciting new hybrid trading platform, which aims to bring together forex, stocks, and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T16:26:17.000Z",
    "title": "Algorand and Seracle Join Forces to Drive Blockchain Adoption with One-Click Node Setup",
    "url": "https://www.crypto-news-flash.com/algorand-and-seracle-join-forces-to-drive-blockchain-adoption-with-one-click-node-setup/?utm_source=rss&utm_medium=rss&utm_campaign=algorand-and-seracle-join-forces-to-drive-blockchain-adoption-with-one-click-node-setup",
    "description": "Two notable blockchain firms have recently struck a major partnership that is poised to revolutionize the blockchain and Web3 industry in the long term.  Seracle and Algorand are coming together to increase the adoption of blockchain for Web3 companies across the globe.  Over the years, the adoption of digital currencies and blockchains has skyrocketed significantly. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T16:10:16.000Z",
    "title": "Explosive Move: US Lawmakers Introduce ‘SEC Stabilization Act’ to Oust Gary Gensler – Will This Mark the Final Victory for Binance, Coinbase, and Ripple?",
    "url": "https://www.crypto-news-flash.com/explosive-move-us-lawmakers-introduce-sec-stabilization-act-to-oust-gary-gensler-will-this-mark-the-final-victory-for-binance-coinbase-and-ripple/?utm_source=rss&utm_medium=rss&utm_campaign=explosive-move-us-lawmakers-introduce-sec-stabilization-act-to-oust-gary-gensler-will-this-mark-the-final-victory-for-binance-coinbase-and-ripple",
    "description": "Republican lawmakers have introduced the &#8220;SEC Stabilization Act&#8221; to curb the perceived overreach of the SEC and remove Chair Gary Gensler. Rep. Warren Davidson and Rep. Tom Emmer have co-signed the bill calling Gensler a tyrannical chairman. The Republican lawmakers have finally stepped in to contain the aggressive and high-handed action of the U.S. Securities [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-13T16:35:00.000Z",
    "title": "XRP Price Grows As Community Awaits Hinman Documents’ Impact",
    "url": "https://coinedition.com/xrp-price-grows-as-community-awaits-hinman-documents-impact/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Should-investors-hope-for-more-after-XRP-takes-the-lead-4-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Should-investors-hope-for-more-after-XRP-takes-the-lead-4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Should-investors-hope-for-more-after-XRP-takes-the-lead-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Should-investors-hope-for-more-after-XRP-takes-the-lead-4.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The upcoming release of the Hinman documents has created a sense of anticipation within the XRP community. Many speculate that these documents could significantly impact Ripple&#8217;s legal battle with the SEC. However, its effect already reflects in XRP&#8217;s price. According to TradingView data, XRP has experienced a 5.9% increase in price over the past 24 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-price-grows-as-community-awaits-hinman-documents-impact/\">XRP Price Grows As Community Awaits Hinman Documents&#8217; Impact</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]