[
  {
    "source": "CoinDesk",
    "date": "2024-02-29T19:19:41.000Z",
    "title": "Bank of America, Wells Fargo to Offer Spot Bitcoin ETFs to Clients: Bloomberg",
    "url": "https://www.coindesk.com/business/2024/02/29/bank-of-america-wells-fargo-to-offer-spot-bitcoin-etfs-to-clients-bloomberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Two Wall Street wealth management giants, Bank of America’s Merrill Lynch and Wells Fargo, are adding spot bitcoin exchange-traded funds to their brokerage platforms, Bloomberg reported, citing people familiar with the matter."
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-29T19:12:18.000Z",
    "title": "Bitcoin ETF Trading Frenzy Continues After Record $673M Net Inflow as BTC Price Nears Record",
    "url": "https://www.coindesk.com/markets/2024/02/29/bitcoin-etf-trading-frenzy-continues-after-record-673m-net-inflow-as-btc-price-nears-record/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BlackRock's bitcoin ETF (IBIT) surpassed $1 billion in trading volume Thursday for the fourth consecutive day."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-29T19:16:19.000Z",
    "title": "Merrill, Wells Fargo Offering Bitcoin ETFs to Top Clients: Report",
    "url": "https://decrypt.co/219724/merrill-wells-fargo-bank-of-america-bitcoin-etf-retail",
    "description": "The question of whether retail investors are getting into the action may soon be definitively answered."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-29T19:25:00.000Z",
    "title": " Despite 23% gains, Bitcoin options traders still not bullish ",
    "url": "https://cointelegraph.com/news/despite-23-percent-gains-bitcoin-options-traders-still-not-bullish",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMjlkYzc5YjgtMzg4Zi00M2FiLWFkNzQtZDNiNWZjNGFjZjFjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Demand for Bitcoin options has been balanced between bulls and bears, meaning whales remain unconviced.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) experienced a 23% gain in the five days ending Feb. 28, but BTC options traders are reluctant to adopt a bullish stance. This is partly due to the fact that the last time Bitcoin incurred a 5% weekly loss was more than five weeks ago, leading to a demand for downside protection. </p><p>Concerns arise among investors about the potential decline in the heavy inflow into spot Bitcoin exchange-traded funds (ETF), which could trigger a price correction. This suggests that these traders are either unconvinced by the current bull run or perceive no need for leverage in the face of macroeconomic uncertainty.</p><p>On Feb. 28 alone, U.S. Bitcoin ETFs <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-inflow-ath-680-m\">saw a net inflow</a> of $673 million, accumulating a total of $7.4 billion in net deposits since their launch on Jan. 11. Bloomberg's senior ETF analyst, James Seyffart, reported this information, highlighting that <a href=\"https://twitter.com/NateGeraci/status/1763211191734714873\" target=\"_blank\" rel=\"noopener nofollow\">only</a> 150 ETFs have ever surpassed the $10 billion mark in assets under management. Notably, BlackRock's iShares Bitcoin ETF already boasts over $9 billion in assets, according to Nate Geraci, co-founder of the ETF Institute.</p><p><a href=\"https://cointelegraph.com/news/despite-23-percent-gains-bitcoin-options-traders-still-not-bullish\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-29T19:12:08.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">An investment firm founded by a prominent Wall Street trader wants to short Coinbase stock. Meanwhile, the United States government sold off nearly $1 billion of the Bitcoin it seized from Bitfinex in 2016, and spot Bitcoin exchange-traded funds (ETFs) had a massive day with record trading volume and net inflows. </p><p>Citron, an investment research firm founded by a prominent <a href=\"https://cointelegraph.com/news/prominent-short-seller-citron-targets-coinbase-stock-after-exchange-outage\">Wall Street short-seller</a>, has Coinbase’s stock in its sights after the crypto exchange ran into technical difficulties during Bitcoin’s volatile price movements earlier in the week.</p><p>\"The recent $COIN site malfunction makes the long Bitcoin/Short Coinbase trade one of the most compelling trades in the crypto market,\" Citron wrote on Feb. 29, adding: \"This means going LONG bitcoin through an ETF and short the bloated Coinbase exchange.”</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-29T19:15:59.000Z",
    "title": "SOL breaks ascending triangle pattern and is poised to soar higher, trader weights in",
    "url": "https://cryptobriefing.com/sol-breaks-ascending-triangle-pattern-poised-soar-higher/",
    "description": "SOL's thriving momentum is having a positive effect on Solanas ecosystem meme coins, such as WIF and BONK."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-29T19:18:40.000Z",
    "title": "Unveiling the Potential: How Bitgert Coin Surpasses Ethereum in Delivering Higher Returns",
    "url": "https://cryptodaily.co.uk/2024/02/unveiling-the-potential-how-bitgert-coin-surpasses-ethereum-in-delivering-higher-returns",
    "description": "In the ever changing world of cryptocurrencies, investors are always looking for assets with a high performance and returns. One more cryptocurrency contender – Bitgert has been gaining recognition due to its potential to generate better price  returns for investors than Ethereum’s pierce which has so far been the long-standing preference. Developers can make decentralized applications (dApps) on Ethereum."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-29T19:30:08.000Z",
    "title": "10 Bitcoin ETFs Smash Inflow and Trading Volume Records",
    "url": "https://news.bitcoin.com/10-bitcoin-etfs-smash-inflow-and-trading-volume-records/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/bitcoin-etfs-smash-records-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"10 Bitcoin ETFs Smash Inflow and Trading Volume Records\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/bitcoin-etfs-smash-records-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bitcoin-etfs-smash-records-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bitcoin-etfs-smash-records-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bitcoin-etfs-smash-records-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bitcoin-etfs-smash-records-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bitcoin-etfs-smash-records-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/bitcoin-etfs-smash-records.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Ten new U.S. spot bitcoin exchange-traded funds (ETFs) have shattered both inflow and trading volume records. The 10 funds took in $673.4 million, with Blackrock&#x2019;s Ishares Bitcoin Trust (IBIT) accounting for $612.1 million of the total inflow. The 10 bitcoin ETFs also set a new record for total trading volume. Spot Bitcoin ETFs Set New [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T19:35:52.000Z",
    "title": "Crypto hacks and rug pulls increase rapidly in Q1 2024",
    "url": "https://www.cryptopolitan.com/crypto-hacks-rug-pulls-increase-in-q1-2024/",
    "description": "In 2024, the cryptocurrency market has seen a significant increase in losses due to hacks and rug pulls, amounting to over $200 million across 32 incidents, according to a recent report by blockchain security firm Immunefi. This represents a notable uptick of 15.4% compared to the same period in 2023 when losses totaled $173 million. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T19:35:49.000Z",
    "title": "Bitcoin miners maintain stable holdings despite halving anticipation",
    "url": "https://www.cryptopolitan.com/bitcoin-miners-maintain-stable-holdings/",
    "description": "Amidst significant price fluctuations, Bitcoin miners have managed to maintain stable holdings throughout February. Despite recent sales triggered by BTC price surges, miners&#8217; reserves remained consistent at around 1.82 million BTC, according to data from CryptoQuant.&#160; This stability is notable given the considerable outflows from mining pools to crypto exchanges, amounting to approximately $40 billion. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T19:22:39.000Z",
    "title": "Crypto.com partners with BTG Pactual to foster crypto accessibility",
    "url": "https://www.cryptopolitan.com/crypto-btg-pactual-crypto-accessibility/",
    "description": "Crypto.com, a Singapore-based cryptocurrency exchange, has forged a strategic partnership with BTG Pactual, Latin America’s largest investment bank, in a bid to broaden the accessibility of cryptocurrency services to traditional customers in the region. Crypto.com inks collaboration with BTG Pactual This collaboration marks a significant milestone as it involves the listing of BTG Dol, BTG [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T19:15:55.000Z",
    "title": "Robinhood announces integration of Arbitrum swaps in Robinhood wallet",
    "url": "https://www.cryptopolitan.com/robinhood-announces-integration-of-arbitrum/",
    "description": "In a groundbreaking move within the crypto trading sphere, Robinhood, a leading stock and cryptocurrency trading platform, unveiled plans to incorporate Arbitrum swaps into its Robinhood Wallet.&#160; This announcement was made at ETHDenver, signifying a significant leap forward in providing users with enhanced access to decentralized finance (DeFi) opportunities. Integration of Arbitrum swaps Robinhood users [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T19:15:30.000Z",
    "title": "AI-Enabled Study Reveals Alarming Decline in North Pacific Humpback Whale Population",
    "url": "https://www.cryptopolitan.com/ai-and-decline-in-whale-population/",
    "description": "A recent study published in Royal Society Open Science has shed light on a concerning trend in the humpback whale population of the North Pacific Ocean. Utilizing a groundbreaking combination of marine biology and artificial intelligence (AI) technology, researchers have uncovered a significant decline in humpback whale numbers attributed to the devastating effects of a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T19:11:56.000Z",
    "title": "Floki devs announce plans to burn $11 million worth of tokens",
    "url": "https://www.cryptopolitan.com/floki-plans-burn-11-million-worth-of-tokens/",
    "description": "Floki (FLOKI) developers are considering a proposal to burn 2% of the token’s circulating supply. The aim is to enhance scarcity and bolster network security for the dog-themed crypto platform. Lead developer B revealed that they plan to burn approximately 190,918,585,431.84 $FLOKI tokens, amounting to around 2% of the current circulating supply. At current market [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-29T19:24:02.000Z",
    "title": "Dogecoin is bullish but DeeStream presale soars as Tron whale doubles down",
    "url": "https://crypto.news/dogecoin-is-bullish-but-deestream-presale-soars-as-tron-whale-doubles-down/",
    "description": "DeeStream is garnering attention in the ongoing presale amid the current Dogecoin frenzy"
  }
]