[
  {
    "source": "Cointelegraph",
    "date": "2024-01-17T01:05:43.000Z",
    "title": " Sam Bankman-Fried’s parents seek dismissal of FTX clawback lawsuit ",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-parents-seek-dismissal-ftx-clawback-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNjU2MjM4NGQtMzVjOS00NDU1LTljNjEtZWI0ZmVlN2ViODVhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Joseph Bankman and Barbara Fried said the lawsuit seeks to “capitalize on the sheer fact” they were the parents of the former FTX CEO. </p>\n                    <p><p>The parents of former FTX CEO Sam Bankman-Fried are seeking to have FTX’s lawsuit against them dismissed, rejecting claims they knew about the problems at the crypto exchange and benefitted from misconduct at the firm.</p><p>According to a Jan. 15 court filing, lawyers representing Joseph Bankman and Barbara Fried <a href=\"https://www.courtlistener.com/docket/67806768/20/ftx-trading-ltd-adversary-proceeding/\" target=\"_blank\" rel=\"noopener nofollow\">argued</a> that FTX’s lawsuit sought to “capitalize on the sheer fact” that they were the parents of the former FTX CEO. </p><p>The FTX lawsuit alleges that Bankman and Fried exploited their access and influence within the FTX empire to <a href=\"https://cointelegraph.com/news/sam-bankman-fried-father-dragged-mother-ftx-salary-dispute\">enrich themselves at the expense</a> of the debtors in the FTX bankruptcy estate.</p><p><a href=\"https://cointelegraph.com/news/sam-bankman-fried-parents-seek-dismissal-ftx-clawback-lawsuit\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-17T01:00:38.000Z",
    "title": "Crypto Think Tank Rebels Against This US Senator, Here’s Why",
    "url": "https://www.newsbtc.com/crypto/coin-center-rebels-against-this-us-senator-heres-why/",
    "description": "On December 18, 2023, US Senator Elizabeth Warren sent three letters to the Coin Center Director Jerry Brito, Blockchain Association CEO Kristin Smith, and crypto exchange Coinbase. The senator set January 14, 2024, as the deadline for a response to her inquiries. Related Reading: Crypto-Terrorism Concerns? Senator Warren And 100 Lawmakers Push Biden For Swift Response In the letter addressed to Brito, Senator Warren voiced her concern over reports that his organization and “other crypto interests” were “flexing a not-so-secret weapon” by amassing what she considers a “small army” of former ex-government officials. A “Patriotic” Response To “Unconstitutional” Demands, Crypto Think Tank Firesback Coin Center, a non-profit think tank focusing on the policy issues faced by the crypto industry, sent the US Senator a response letter on January 15. The organization stated: With respect, we have no obligation to answer these questions beyond the public disclosures we make under the law. Coin Center affirms that it takes constitutional rights seriously and considers that “free speech and petitioning the government are fundamental rights protected by our constitution,” Warren’s letter “discourages participation in important public policy debates and chills these rights.” Regarding its opposition to legislative proposals, such as the CANSEE Act and the Digital Asset Anti-Money Laundering Act, the letter cited Coin Center’s belief that they are “unfair, unworkable, and most importantly, unconstitutional” efforts, as well as a “waste” of time and energy that could be spent on reinforcing existing laws. The organization believes that its “proper” and “patriotic” opposition to these legislative efforts for “unconstitutional and draconian” surveillance is being mistaken as “political bias” by the US Senator. Coin Center: “The Abuse Of The Revolving Door” Warren’s letter highlighted the “gaps” that allow former government officials to leave their positions and “cash in and go to work as lobbyists or advisers for private-sector industries with a keen interest in federal policy.” The Senator inquired Coin Center’s Head about this gap, asking Brito to provide a list of former government officials employed by the crypto think tank and details about their responsibilities, economic compensation, and whether they had been contacted about employment before leaving their former position. Per the list and details of former government officials currently employed by Coin Center, the organization “politely declines” to offer further answers but is open to a conversation with Senator Warren. We welcome honest, respectful policy discussions and are happy to meet with you or your staff to discuss further. Coin Center criticizes the senator for the existence of said gap, noting that “if a gap exists, it is in enforcement”, and calls out the lack of effort on “securing more funding for FinCEN, the FBI and DOJ&#8217;s crypto enforcement units, and the like.” The organization affirms that its efforts to find solutions and support sound regulation for cryptocurrency businesses will continue, including Congress’ effort to address the role that cryptocurrencies play in financing terrorist organizations, as Coin Center believes that sound policymaking is only possible when &#8220;diverse voices and perspectives are welcome and engaged.&#8221; The Coin Center Executive Director concluded: As for bipartisanship, we are proud of the work we have done to find solutions that advance sound regulation for cryptocurrency businesses while preserving the freedom to innovate. Related Reading: Arkansas Senator Calls For Reversal Of Controversial New Crypto Mining Law Bitcoin is trading at $ on the daily chart. Source: BTCUSDT on TradingView.com Featured image from Unsplash.com, Chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-17T01:00:31.000Z",
    "title": "Analyst Predicts Ethereum (ETH) Rally, Says Dogecoin (DOGE) Flashing Signs of Rebound – Here Are His Targets",
    "url": "https://dailyhodl.com/2024/01/16/analyst-predicts-ethereum-eth-rally-says-dogecoin-doge-flashing-signs-of-rebound-here-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/rallies-signs-revound.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/rallies-signs-revound.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/rallies-signs-revound.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/rallies-signs-revound.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/rallies-signs-revound.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/rallies-signs-revound.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/rallies-signs-revound.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed analyst thinks Ethereum (ETH) is on the verge of a rally after the second-largest crypto asset flashed a bullish signal on the high time frame chart. Ali Martinez tells his 40,700 followers on the social media platform X that ETH broke out from an ascending triangle on its weekly chart and continues [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/16/analyst-predicts-ethereum-eth-rally-says-dogecoin-doge-flashing-signs-of-rebound-here-are-his-targets/\">Analyst Predicts Ethereum (ETH) Rally, Says Dogecoin (DOGE) Flashing Signs of Rebound – Here Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]