[
  {
    "source": "Decrypt",
    "date": "2023-10-05T20:01:04.000Z",
    "title": "Bored Ape Creator Yuga Labs Invests in Spatial Computing Startup to Power 'Otherside'",
    "url": "https://decrypt.co/200313/bored-ape-maker-invests-spatial-computing-startup-power-otherside",
    "description": "Hadean will establish a U.S. team to help Yuga Labs build out tech for the Bored Ape Yacht Club-themed Otherside metaverse game."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-05T19:43:58.000Z",
    "title": "Sam Bankman-Fried Trial: All the Names You Need to Know",
    "url": "https://decrypt.co/198989/sam-bankman-fried-trial-all-the-names-you-need-to-know",
    "description": "These are the big players you should know before tuning into Sam Bankman-Fried's trial next week. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-05T19:49:26.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Sam Bankman-Fried's college roommate testified in court about FTX's $8 billion deficit before it filed for bankruptcy. Meanwhile, the FTX exploiter, who initially held 175,496 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), worth roughly $294 million, has suddenly started transferring funds, while another four Friend.tech users have reportedly been SIM-swap attacked.</p><h3>Yedidia testifies in SBF criminal case</h3><p>Adam Yedidia, a former FTX developer and roommate of Sam Bankman-Fried, <a href=\"https://cointelegraph.com/news/college-roommate-sam-bankman-fried-ftx-8b-hole\">testified in court</a> about the financial connection between the crypto exchange and sister company Alameda Research.</p><p>The connection between the two companies is one of the key pieces in <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\">Bankman-Fried's alleged fraud</a>. According to Yedidia, he informed Bankman-Fried about a bug in FTX's code that ensured \"Alameda's liabilities did not decrease,\" which ultimately resulted in an $8 billion error. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">And now, Mark Cohen and his assistant - <a href=\"https://twitter.com/hashtag/SBF?src=hash&amp;ref_src=twsrc%5Etfw\">#SBF</a>&#39;s defense counsel. <a href=\"https://t.co/c3Xh8PHbYB\">pic.twitter.com/c3Xh8PHbYB</a></p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1709917634915975214?ref_src=twsrc%5Etfw\">October 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>\"[H]ow long until we're bullet proof again?\" Yedida asked Bankman-Fried while still employed atht ecompany. \"[He said] six months to three years. He looked nervous.\"</p><p>Yedidia said he resigned from FTX once he found out that \"Alameda had used customer deposits to pay its loans.\" </p><h3>FTX exploiter moves $36.8 million in Ether as Sam Bankman-Fried’s trial starts</h3><p>The crypto wallet address linked to the FTX exploiter moved roughly $36.8 million worth of Ether in the last 24 hours amid the ongoing court trials of the defunct crypto exchange’s ex-CEO, Sam “SBF” Bankman-Fried.</p><p>Accounts linked to FTX and FTX US were drained of $600 million on Nov. 11, 2022, hours after the crypto exchange had filed for Chapter 11 bankruptcy.</p><p>After nearly 10 months of silence, the FTX exploiter began siphoning out the stolen funds, starting with a transfer of 10,250 ETH worth $17.1 million via four addresses between Sept. 30 and Oct. 1, confirms data from Spot On Chain.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/60caf612-2b4e-43fd-b513-173fb88d8e3e.png\"  /></figure><p>Since Sept. 30, a total of 67,500 ETH has been transferred out of five out of the 15 wallet addresses linked to the FTX exploiter.</p><p>Out of the lot, 64,948 ETH ($108 million) was transferred through the THORchain router and 52 ETH (worth $84,000) to the Railgun contract. The remaining 2,500 ETH ($4.19 million) was swapped for Bitcoin (tBTC).</p><p>The trial of SBF in connection with the collapse of FTX began on Oct. 3. The entrepreneur has pleaded not guilty to all seven counts of fraud and money laundering charges.</p><h3>Friend.tech SIM-swap scourge continues</h3><p>A single scammer has reportedly <a href=\"https://cointelegraph.com/news/friend-tech-sim-swap-attacks-continue-four-targeted\">managed to steal around $385,000</a> worth of Ether in less than 24 hours amid a scourge of SIM-swap hacks seemingly targeting Friend.tech users.</p><p>On Oct. 5, blockchain sleuth ZachXBT reported the same scammer had pilfered 234 ETH over the past 24 hours by SIM-swapping four different Friend.tech users.</p><p>The on-chain movement of crypto assets was traced back to the same hacker who drained the accounts of the four victims.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The same scammer profited $385K (234 ETH) in the past 24 hours off SIM swapping four different FriendTech users. <a href=\"https://t.co/03BoBEqGax\">pic.twitter.com/03BoBEqGax</a></p>&mdash; ZachXBT (@zachxbt) <a href=\"https://twitter.com/zachxbt/status/1709697295464141208?ref_src=twsrc%5Etfw\">October 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>One of the reported victims of the most recent chain of SIM-swap attacks <a href=\"https://twitter.com/sumfattytuna/status/1709697238316769642\" target=\"_blank\" rel=\"noopener nofollow\">posted</a> to X (formerly Twitter) following the attack:</p><p>“Got sim swapped. Apparently, dude was able to do it from an Apple store and switched it to an iPhone SE. Don’t buy my keys, that wallet is compromised.”</p><p>Earlier this week, a further four Friend.tech users claimed to have their <a href=\"https://cointelegraph.com/news/friendtech-sim-swap-attack-string-of-hacks\">accounts drained due to a SIM-swap</a> or phishing attack, totaling around 109 ETH stolen.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-05T19:40:58.000Z",
    "title": "New images of Block’s Bitcoin wallet leak as beta version begins to ship",
    "url": "https://cryptoslate.com/new-images-of-blocks-bitcoin-wallet-leak-as-beta-shipments-are-set-to-begin/",
    "description": "<p>New images have surfaced of a Bitcoin wallet, BitKey, currently being developed by Jack Dorsey&#8217;s company, Block Inc, as reports suggest that the product&#8217;s beta is nearing its distribution stage. Several sources have shared an identical photograph of the product, called BitKey. The first known instance was shared by Bitcoin Magazine contributor Alex McShane, who [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/new-images-of-blocks-bitcoin-wallet-leak-as-beta-shipments-are-set-to-begin/\">New images of Block&#8217;s Bitcoin wallet leak as beta version begins to ship</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-05T20:00:19.000Z",
    "title": "Against the Odds: Bitcoin Sees Fewest Obituaries in Ten Years",
    "url": "https://news.bitcoin.com/against-the-odds-bitcoin-sees-fewest-obituaries-in-ten-years/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/bobits-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Against the Odds: Bitcoin Sees Fewest Obituaries in Ten Years\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/bobits-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bobits-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bobits-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bobits-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bobits-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bobits-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/bobits.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />With two-thirds of the year done, the Bitcoin Obituaries list has recorded a decline in memorials compared to the last ten years, tallying just seven so-called bitcoin death announcements in 2023. The last sentiment of demise was voiced by tech magnate Chamath Palihapitiya, who proclaimed &#x201C;crypto is dead in America&#x201D; last April. Bitcoin&#x2019;s Steady 2023: [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-05T20:03:10.000Z",
    "title": "Catching up with SBF’s trial – has he been lying the whole time?",
    "url": "https://www.cryptopolitan.com/catching-up-with-sbf-trial-has-he-been-lying/",
    "description": "SBF has cast a peculiar spotlight on the crypto industry. For an year now, there have been conspiracies, contradictions and significant revelations on SBF and the collapse of FTX. Crypto investors will be able to put that to rest in the next 6 weeks. However, as the case progresses many of SBF’s statements in the ... <a title=\"Catching up with SBF&#8217;s trial &#8211; has he been lying the whole time?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/catching-up-with-sbf-trial-has-he-been-lying/\" aria-label=\"More on Catching up with SBF&#8217;s trial &#8211; has he been lying the whole time?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-05T20:00:42.000Z",
    "title": "Bitcoin Investment Strategy: Analyst Sets Hefty Exit Price",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-investment-exit-price/",
    "description": "A crypto YouTuber has revealed his Bitcoin exit plans to the public, stating that he would only withdraw from the cryptocurrency once BTC reaches a staggering $142,000.  It is important to note that Bitcoin is presently trading below the $30,000 mark. Hence the popular YouTuber may have to wait a few years before leaving the market for good.  Crypto YouTuber Sets Price For Bitcoin Exit A crypto investor and YouTuber, ‘InvestAnswers’ recently published a YouTube video that featured a question-and-answer session with his subscribers. In the video, the YouTuber discussed various topics including AI, Meta, Google, and others.  Related Reading: Pro-Bitcoin Presidential Candidate Wants To Save BTC From The White House Focusing on crypto, he described his Bitcoin exit plan in detail, stating his desire to leave the cryptocurrency once it has attained a hefty market value of $142,000. The digital asset investor explained that he had high hopes for BTC&#8217;s price and was expecting the cryptocurrency to reach a price value of at least $89,000. Currently, the price of Bitcoin is approximately $27,693, miles below the price cap InvestAnswers has set for an exit. The cryptocurrency has also experienced a significant amount of losses this year due to unfavorable market conditions and volatility. Bitcoin also had a minor price slip-up last week, declining to about $27,500 after reports revealed a significant inflow of BTC in Kraken.  According to reports, Bitcoin’s September performance this year has been one of the strongest since 2012. InvestAnswers has stated a few of the market metrics and developments including Blackrock’s Bitcoin ETF have influenced the recent positive trend in Bitcoin. Analysts Relay Positive Outlook On BTC&#8217;s Price With the Bitcoin spot ETF potentially launching in the crypto space and other major innovative crypto developments advancing the ecosystems, many investors believe that BTC is on the verge of a bull run. Several analysts have made compelling predictions for the price of BTC in the last few months, stating that the cryptocurrency could enter a bullish position once it pushes past the $30,000 mark.  These predictions match up with InvestAnswers&#8217; hopes for Bitcoin’s price rise to fuel his exit plans. The crypto investor has stated plans to sell out his equity to invest in several cryptocurrencies.  Related Reading: Will Bitcoin Price Crash To $10,000? Bloomberg Expert Reveals When BitMex founder and former CEO Arthur Hayes is one of those who remain convinced the Bitcoin price is headed for a six-figure price. Hayes believes that the price of BTC will reach $70,000 before the end of 2024. Going further, the crypto millionaire believes the cryptocurrency will rise as high as $1 million in 2026. Bitcoin is currently trading at $28,010 after struggling to hold support at $28,000. Nevertheless, the asset continues to hold 5% gains on the weekly chart. Featured image from Alphachain, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-05T20:00:31.000Z",
    "title": "This Ethereum Competitor Is the Institutional Investors’ Favorite This Year, According to CoinShares",
    "url": "https://dailyhodl.com/2023/10/05/this-ethereum-competitor-is-the-institutional-investors-favorite-this-year-according-to-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/most-loved-altcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/most-loved-altcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/most-loved-altcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/most-loved-altcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/most-loved-altcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/most-loved-altcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/most-loved-altcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto assets manager CoinShares says that one Ethereum (ETH) rival continues to be the favorite altcoin of institutional investors. CoinShares says in the newest Digital Asset Fund Flows Weekly Report that Solana (SOL) has recorded inflows of $31 million this year. The crypto assets manager says that the positive trend for Solana continued during the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/05/this-ethereum-competitor-is-the-institutional-investors-favorite-this-year-according-to-coinshares/\">This Ethereum Competitor Is the Institutional Investors’ Favorite This Year, According to CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-05T19:55:07.000Z",
    "title": "Crypto Analyst Says Bitcoin (BTC) Ready To Target New Highs, Warns of Chainlink’s (LINK) ‘Final Correction’",
    "url": "https://dailyhodl.com/2023/10/05/crypto-analyst-says-bitcoin-btc-ready-to-target-new-highs-warns-of-chainlinks-link-final-correction/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/02/bitcoin-height.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/02/bitcoin-height.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/02/bitcoin-height.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/02/bitcoin-height.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/02/bitcoin-height.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/02/bitcoin-height.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/02/bitcoin-height.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader says Bitcoin (BTC) is on the verge of reaching new heights while plotting out Chainlink&#8217;s (LINK) final corrective moves. Crypto analyst Michaël van de Poppe tells his 668,000 followers on the social media platform X that BTC is ready to target new highs. &#8220;Bitcoin is very much ready to reclaim $29,000-30,000 and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/05/crypto-analyst-says-bitcoin-btc-ready-to-target-new-highs-warns-of-chainlinks-link-final-correction/\">Crypto Analyst Says Bitcoin (BTC) Ready To Target New Highs, Warns of Chainlink’s (LINK) ‘Final Correction’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]