[
  {
    "source": "CoinDesk",
    "date": "2023-11-08T23:58:20.000Z",
    "title": "U.S. House's Spending Bill Aims to Hamstring SEC's Gensler Amid His Crypto Crackdown",
    "url": "https://www.coindesk.com/policy/2023/11/08/us-houses-spending-bill-aims-to-hamstring-secs-gensler-amid-his-crypto-crackdown/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "As the U.S. House of Representatives weighs legislation on next year's spending, a provision was added on Wednesday that would deprive funding from U.S. Securities and Exchange Commission (SEC) enforcement actions against crypto businesses."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-08T23:58:15.000Z",
    "title": "‘Shameless’: CZ Slams Bitcoin Hater Nouriel Roubini's New Token",
    "url": "https://decrypt.co/205158/cz-calls-nouriel-roubini-shameless-atlas-capital-token",
    "description": "“Dr. Doom” used Binance’s brand recognition to promote his new blockchain venture, just months after calling CZ a \"ticking time bomb.\""
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-08T23:40:35.000Z",
    "title": "Grayscale inches closer to spot Bitcoin ETF with ‘constructive’ SEC dialogue",
    "url": "https://cryptoslate.com/grayscale-inches-closer-to-spot-bitcoin-etf-with-constructive-sec-dialogue/",
    "description": "<p>Grayscale CEO Michael Sonnenshein provided an update on his company&#8217;s proposed spot Bitcoin ETF in conversation with Bloomberg on Nov. 8. Grayscale intends to convert its existing Grayscale BTC (GBTC) fund to an ETF. Sonnenshein commented on current interactions with regulators, stating: &#8220;&#8230; What you&#8217;ve seen now over the last few weeks is our team [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/grayscale-inches-closer-to-spot-bitcoin-etf-with-constructive-sec-dialogue/\">Grayscale inches closer to spot Bitcoin ETF with &#8216;constructive&#8217; SEC dialogue</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-09T00:00:10.000Z",
    "title": "Bitcoin’s Grip Strengthens: Record High In Long-Term Holdings Signals Bullish Horizon",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-grip-strengthens-record-highs-in-long-term/",
    "description": "Amid fluctuating markets and economic uncertainty, Bitcoin long-term investors hold their coins tighter than ever. Data from blockchain analysis firm Glassnode reveals a notable trend: a significant portion of Bitcoin&#8217;s circulating supply is firmly in the hands of long-term holders, with figures reaching record heights. Notably, the trend of Bitcoin being tightly held is not a new phenomenon, but the level of accumulation we&#8217;re witnessing today appears unprecedented. Glassnode&#8217;s research points out that the community of long-term Bitcoin holders is not just growing but doing so at an &#8220;impressive rate of accumulation.&#8221; This cohort&#8217;s commitment is evidenced by the historical highs in key supply metrics—illiquid supply, coins held (HODLed), and long-term holder supply—are all at their peak, according to shared Glassnode insights. Related Reading: Bitcoin On The Brink? Analyst Predicts Soaring Open Interest May Signal 20% Price Correction A Dive into Bitcoin&#8217;s Illiquid Supply  Glassnode&#8217;s briefing depicted the Bitcoin market&#8217;s current state. The data illustrates that 68% of Bitcoin&#8217;s circulating supply has not moved for more than a year, indicating a decision by investors to hold through volatility and market dips. The metric for coins held for over five years is even more telling, constituting nearly a third of all Bitcoin in circulation. In terms of Bitcoin&#8217;s illiquid supply—coins held in wallets with little to no spending history—the figures are also at an all-time high, with over 15.4 million BTC firmly held. This illiquidity is not a static condition as it is growing monthly at 71,000 Bitcoin, according to Glassnode&#8217;s analysis. According to a Glassnode analyst, this accumulation has coincided with a notable pattern of investors pulling their Bitcoin from exchanges into private custody, further solidifying the trend of long-term holding. The analyst disclosed: The data suggests investors are continuing to withdraw their coins into custody, with over 1.7 million bitcoin doing so since May 2021. Bitcoin: Divergence In Holders And Latest Price Action Glassnode&#8217;s report also highlights a significant divergence between the behaviors of long-term and short-term Bitcoin holders. While long-term supply is seeing historic highs, short-term holder supply is at record lows, indicating a change in spending habits after the currency&#8217;s surge above the pivotal $30,000 benchmark.  Glassnode&#8217;s analysis suggests this price point is a crucial battleground for bullish sentiment, marking a potential inflection point in the market&#8217;s trajectory. Related Reading: Crypto Forecast: Analyst Predicts ‘Santa Claus Squeeze’ May Deliver Year-End Gains Meanwhile, over the past week, Bitcoin has continued its bullishness, recording a gain of 2.9%. The asset currently trades for $35,216 at the time of writing, up by 1.5% in the past 24 hours. Featured image from iStock, chart from TradingView"
  }
]