[
  {
    "source": "CoinDesk",
    "date": "2023-07-20T20:52:48.000Z",
    "title": "Chainlink’s LINK Pops 15%, XRP Loses Steam as Bitcoin Revisits $29.6K Range Lows",
    "url": "https://www.coindesk.com/markets/2023/07/20/chainlinks-link-pops-15-xrp-loses-steam-as-bitcoin-revisits-296k-range-lows/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Tech stocks such as Tesla and Netflix, which crypto prices tend to correlate with, sold off during the day as investors shied away from risk assets."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-20T21:00:00.000Z",
    "title": "Trader Joe Goes All-In On Auto-Pools: Can this Make Joe (JOE) Match Up to the Blazing Uwerx (WERX) Presale?",
    "url": "https://cryptodaily.co.uk/2023/07/trader-joe-goes-all-in-on-auto-pools-can-this-make-joe-joe-match-up-to-the-blazing-uwerx-werx-presale",
    "description": "<p class=\"s4\">Joe (JOE) and Uwerx are two emerging crypto platforms fastly approaching their launch date. </p>\n<p class=\"s4\">As both roll out exciting features ahead of their launch, it is crucial to understand what exactly they are and how their innovative approaches may be the revolution their respective industry needs at this time.</p>\n<p class=\"s4\">In this article, we have carefully examined these two significant potential tokens, understanding their use cases, price predictions, and how beneficial they could be for investors. </p>\nJoe (JOE) Price Prediction\n<p class=\"s4\">Trader Joe is an innovative DeFi platform looking to offer an automated yield farming strategy for Liquidity Providers, consequently eliminating the traditional strenuous position management system. </p>\n<p class=\"s4\">Joe (JOE), the native token of the Trader Joe platform, is currently preparing to launch an exciting feature to augment its current value proposition, the Auto Pool. </p>\n<p class=\"s4\">Auto Pool is set to provide the best user experience and capital efficiency for DeFi users, ultimately helping the protocol generate more liquidity. This is a largely untapped area in the DeFi market, and with Joe (JOE) pioneering this aspect, you can be sure its adoption would be massive. </p>\n<p class=\"s4\">Joe&rsquo;s (JOE) first offering, The General, will be launched soon, making the token&rsquo;s future growth worth keeping an eye on. </p>\nUwerx (WERX): Championing a New Era for Freelancers\n<p class=\"s4\">Like Joe (JOE) is doing in the world of DeFi, Uwerx is also set to revolutionize the freelancing industry, serving as a threat to the progression of existing freelancing platforms. </p>\n<p class=\"s4\">While &ldquo;threat&rdquo; may sound somewhat exaggerated, it is actually the reality, considering the multiple advantages Uwerx has over these existing platforms, especially the incredibly lower transaction commission. </p>\n<p class=\"s4\">Unlike Fiverr, which charges 20%, and Upwork, which charges 10% per transaction, Uwerx will only deduct a flat fee of 1% as commission, allowing freelancers to enjoy their money while fostering a healthy client-freelancer relationship. </p>\n<p class=\"s4\">Beyond their transaction fee, the Uwerx team has also unveiled the &ldquo;Uwerx Vault,&rdquo; a central hub where users can stake (store their token for as long as they want while getting rewarded for it). </p>\n<p class=\"s4\">SolidProof and InterFi Network have audited the platform to confirm its credibility and have also been listed by CoinSniper and awaiting Uniswap listing on Tuesday, August 1, 2023. The team has also promised to renounce all contracts and reduce taxes to zero before launching the project on centralized exchanges.</p>\n<p class=\"s4\">The Uwerx platform currently boasts 1,600+ subscribers on Telegram, 1,600+ Twitter followers, and 5,500 sign-ups on the platform. </p>\nUwerx (WERX) is Enjoying an Incredible Presale Run\n<p class=\"s4\">The WERX token is enjoying an unbelievable adoption rate, with the token&rsquo;s stage 1 to stage 4 presales getting completed in record time. Although currently at stage 5 of the presale at $0.041 per token with a 15% bonus.</p>\n<p class=\"s4\">Thanks to this high demand, the Uwerx team has modified WERX token allocations and will lock liquidity before all presales end on Monday, July 31, 2023. </p>\n<p class=\"s4\">In a more recent update, the team has also disclosed their plans to send tokens to holders immediately after the end of the presale in a 6-week vesting period. This vesting period will follow a defined vesting schedule: 8% on week 1, 10% on week 2, 14% on week 3, 18% on week 4, 22% on week 5, and 28% on week 6. Similarly, after the presale ends, they also plan to host a Test Airdrop, as voted by the community. </p>\n<p class=\"s4\">Beyond the Uwerx platform enjoying a brilliant presale run, the Uwerx team has also released the first version of the Alpha platform as a PDF while waiting to transition from Alpha into Beta in the coming weeks. The published PDF features ten (10) pages, including but not limited to the Sign in Page, Log In Page, Forgot Password Page, Hiring Dashboard Page, My Activity Page, Client or Freelancer Initiation Page, etc. </p>\n<p class=\"s4\">In a bid to create an inclusive community, the team has also created a dedicated feedback email, feedback@uwerx.network, to receive comments and suggestions about the published PDF pages. </p>\n<p class=\"s4\">Tokens in the fifth stage of the presale are currently available at a favorable price of $0.05245, accompanied by an appealing 15% bonus. This creates a highly advantageous opportunity for potential participants. However, it is important to be aware that the price will rise to $0.06294 on Tuesday, February 25th, 2023, at 18:00 UTC.</p>\n<p class=\"s4\">Presale: &nbsp;invest.uwerx.network</p>\n<p class=\"s4\">Telegram: https://t.me/uwerx_network</p>\n<p class=\"s4\">Twitter: https://twitter.com/uwerx_network</p>\n<p class=\"s4\">Website: https://www.uwerx.network/</p>\n<p class=\"s4\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T21:08:01.000Z",
    "title": "The secret to successfully integrating crypto as a payment method",
    "url": "https://www.cryptopolitan.com/successfully-integrate-crypto-payment-method/",
    "description": "When it comes to financial innovation, Deloitte, a global leader in professional services, recently delivered insights on a hot topic—cryptocurrency. As they put it, the integration of crypto into your business isn&#8217;t simply a matter of riding the wave of modernity. It is about strategic alignment, meticulous planning, and, above all, transparency. So, what is ... <a title=\"The secret to successfully integrating crypto as a payment method\" class=\"read-more\" href=\"https://www.cryptopolitan.com/successfully-integrate-crypto-payment-method/\" aria-label=\"More on The secret to successfully integrating crypto as a payment method\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-20T20:54:38.000Z",
    "title": "US Federal Reserve’s launches FedNow for instant payments",
    "url": "https://crypto.news/us-federal-reserves-launches-fednow-for-instant-payments/",
    "description": "The US Federal Reserve has launched FedNow, an instant payment service with round-the-clock transactions and settlements"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-20T20:46:02.000Z",
    "title": "Did Justin Sun Use Fake Balance? Tron Founder’s $62 Million TUSD Minting Raises Eyebrows",
    "url": "https://www.newsbtc.com/analysis/trx/did-justin-sun-use-fake-balance-tron-founders-62-million-tusd-minting-raises-eyebrows/",
    "description": "Crypto analyst Adam Cochran recently caused a stir in the cryptocurrency community when he called attention to a series of TrueUSD (TUSD) transactions made by Tron founder Justin Sun.  Cochran highlighted a series of transactions made by Sun&#8217;s address on the Tron blockchain, including minting $62 million worth of TUSD, withdrawing $50 million in USDT from Huobi, and depositing $50 million in USDT on Bitfinex. Justin Sun&#8217;s Dubious TUSD Transactions Perhaps most concerning, however, was Sun&#8217;s apparent burning of $50 million TUSD, which Cochran suggested could be an attempt to temporarily “snapshot or unwind” debt using a “fake” balance that was “unbacked”.  Cochran also pointed out that Sun appeared to be using Poloniex and Huobi as his own “piggy” banks to borrow against, with large amounts of Huobi assets being plowed into JustLend &#8211; an official lending platform on the TRON blockchain &#8211; for him to borrow against shitcoins. Related Reading: Bitcoin Bulls Rejoice: Blofin Forecasts $49,000 Price High With Potential Spot ETF Launch These transactions have raised questions about Sun&#8217;s motivations and the potential impact of his actions on the broader cryptocurrency market. In particular, Cochran expressed concern that Sun&#8217;s apparent “manipulation” of TUSD could create the appearance of greater liquidity in the market and potentially lead to price manipulation. Compounding these concerns is that Changpeng Zhao, the CEO of Binance, one of the world&#8217;s largest cryptocurrency exchanges, has reportedly offered voluntary termination packages to employees in multiple departments.  This move has raised questions about the financial stability of Binance and its potential exposure to Sun&#8217;s actions. Cochran concluded: CZ offered multiple departments &#8220;voluntary termination&#8221; offers where any staff member could apply to resign today, sign a new NDA and get a 3 month severance to quit. Totally normal thing to do after already big cuts&#8230;. The Uncertainty Of Justin Sun&#8217;s Cryptocurrency Moves The potential risks of Justin Sun&#8217;s transactions are unclear, as his motivations for these actions are unknown. However, several possible concerns have been raised in the crypto community.  One potential risk is the possibility of price manipulation. If Sun was attempting to manipulate the price of specific cryptocurrencies by creating the appearance of greater liquidity in the market, this could lead to price distortions that could harm investors and destabilize the market. Another risk is the possibility of a liquidity crisis. If Sun&#8217;s actions caused a sudden influx of TUSD or USDT into the market, this could lead to a sudden drop in the value of these cryptocurrencies, potentially causing a liquidity crisis and harming investors. There is also a risk that Sun&#8217;s actions could ripple throughout the broader cryptocurrency market, potentially causing other investors to panic or leading to a broader sell-off. Related Reading: SEC Allegedly Delays Assistance For US Crypto Market Bill Finally, there is a risk that Sun&#8217;s actions could trigger regulatory scrutiny or legal action, mainly if he is found to have engaged in illegal or unethical behavior. This could harm the reputation of the cryptocurrency industry as a whole and lead to increased regulatory oversight. Despite these concerns, it remains unclear precisely what Sun&#8217;s intentions were with the transactions highlighted by Cochran. Featured image from Unsplash, chart from TradingView.com"
  }
]