[
  {
    "source": "Decrypt",
    "date": "2024-01-08T21:20:36.000Z",
    "title": "VanEck, Bitwise Prep Over $200 Million in Advance of Bitcoin ETF Approval",
    "url": "https://decrypt.co/212037/vaneck-bitwise-prep-over-200-million-in-advance-of-bitcoin-etf-approval",
    "description": "With Bitcoin spot ETFs imminent, the financial firms are poised to inject millions into the new investment vehicle."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-08T21:30:00.000Z",
    "title": " Hashdex spot Bitcoin ETF left out of amended S-1 filings — what does this mean? ",
    "url": "https://cointelegraph.com/news/hashdex-spot-bitcoin-etf-s1-filings",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZjhiMDlmZDktNzYyMC00Zjk5LTljMTktYTZjOWZlYzIyNjg1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Unlike spot Bitcoin ETFs proposed by other asset managers, Hashdex applied to convert an existing crypto futures ETF to hold spot Bitcoin.</p>\n                    <p><p>Multiple asset managers filed S-1 form amendments on Jan. 8 as part of the process to receive approval for listing shares of a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund on United States-based exchanges. Notably, of the many firms that applied, crypto asset management company Hashdex didn’t issue an amended form in the early morning filings. </p><p>On Jan. 8, asset management firms including Valkyrie, WisdomTree, BlackRock, VanEck, Invesco and Galaxy, Grayscale and ARK Invest and 21Shares <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-issuers-file-s1-filings-as-expected\">filed their amended S-1 forms</a> with the U.S. Securities and Exchange Commission (SEC), a key move toward potential approval of a spot BTC ETF. While Hashdex <a href=\"https://cointelegraph.com/news/sec-closer-spot-bitcoin-etf-approval\">filed a 19b-4 amendment form</a> alongside the aforementioned firms on Jan. 5, it was not included in the Jan. 8 filing round, leading to speculation about the status of its spot Bitcoin investment vehicle.</p><p>According to a Jan. 8 X (formerly Twitter) post from Bloomberg ETF analyst Jeff Seyffart, Hashdex’s Bitcoin ETF application <a href=\"https://twitter.com/JSeyff/status/1744353063593209868\" target=\"_blank\" rel=\"noopener nofollow\">differed</a> from those of other firms in that it was applying to convert an existing crypto futures ETF. Hashdex submitted its application to the SEC in August, <a href=\"https://cointelegraph.com/news/hashdex-joins-race-for-spot-bitcoin-etf-with-unique-strategy\">proposing a Bitcoin futures investment vehicle</a> that could also hold spot Bitcoin.</p><p><a href=\"https://cointelegraph.com/news/hashdex-spot-bitcoin-etf-s1-filings\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-08T21:10:00.000Z",
    "title": " SEC may approve spot Bitcoin ETF in a couple of days now: Law Decoded   ",
    "url": "https://cointelegraph.com/news/sec-may-approve-spot-bitcoin-etf-law-decoded",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZjFlZDgwNWUtMjViYS00OTNiLTlmYTQtMWMzY2JlZmU2MjkzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The United States Securities and Exchange Commission has begun receiving S-1 amendments from potential ETF issuers.  </p>\n                    <p><p>The United States Securities and Exchange Commission has begun accepting filings by exchanges in <a href=\"https://cointelegraph.com/news/sec-closer-spot-bitcoin-etf-approval\">a step toward approval</a> of spot Bitcoin exchange-traded funds (ETF). 19b-4 amendments were filed for spot BTC ETF applications from asset managers BlackRock, Valkyrie, Grayscale, Bitwise, Hashdex, ARK 21Shares, Invesco Galaxy, Fidelity, Franklin Templeton, VanEck and WisdomTree. Most companies have now also filed the S-1 amendments with the SEC, including Valkyrie, WisdomTree, BlackRock, VanEck, Invesco and Grayscale, ARK Invest and 21Shares. Some experts have speculated that final approval for the spot Bitcoin ETFs will drop before Jan. 10 — the deadline for an offering from ARK Invest and 21Shares.</p><p>However, according to a survey from ETF issuer Bitwise, <a href=\"https://cointelegraph.com/news/only-39-percent-financial-advisers-believe-2024-bitcoin-etf-approved-bitwise\">only 39% of U.S.-based financial advisers</a> believe a Bitcoin ETF will be approved this year. Despite this pessimism, most surveyed advisers do expect a Bitcoin ETF to be approved eventually. 22% said approval would come in 2025, and 24% answered “after 2025.” Another 2% stated that the approval would come in 2023, although this prediction didn’t materialize. When added together, this implies that a full 87% believe that an ETF will be approved eventually. 12% answered “never” when asked this question.</p><p>Some even consider the potential approval a “historic mistake.” Dennis Kelleher, CEO of the nonprofit organization Better Markets, has urged the SEC not to approve a spot Bitcoin ETF, arguing that it <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-mistake-better-markets\">goes against the core principles of the regulatory body</a>. Kelleher emphasized that if the SEC were to approve a spot Bitcoin ETF, it could lead to investors facing significant risks of potential fraud. “The approval of these spot Bitcoin ETPs would not only expose investors to a market thoroughly contaminated with fraud and manipulation,” he stated.</p><p><a href=\"https://cointelegraph.com/news/sec-may-approve-spot-bitcoin-etf-law-decoded\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-08T21:33:29.000Z",
    "title": "Binance stablecoin BUSD falls and loses top five spot",
    "url": "https://cryptobriefing.com/binance-stablecoin-busd-falls-and-loses-top-five-spot/?utm_source=feed&utm_medium=rss",
    "description": "Binance stablecoin has dropped from the top five stablecoins globally."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-08T21:33:19.000Z",
    "title": "Satoshi’s wallet receives $1 million in Bitcoin as ETF approval nears",
    "url": "https://cryptobriefing.com/satoshis-wallet-receives-1-million-bitcoin-etf-approval-nears/?utm_source=feed&utm_medium=rss",
    "description": "The wallet now has nearly 100 BTC, worth roughly $4.3 million, a total that includes the original 50 BTC mined for the Genesis Block."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-08T21:30:23.000Z",
    "title": "Gold Rush Continues – Central Banks Purchased 44 Tonnes in November",
    "url": "https://news.bitcoin.com/gold-rush-continues-central-banks-purchased-44-tonnes-in-november/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/e7ceefa5-0b91-497d-80b9-6856ac9a5485-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Gold Rush Continues - Central Banks Purchased 44t in November\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/e7ceefa5-0b91-497d-80b9-6856ac9a5485-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/e7ceefa5-0b91-497d-80b9-6856ac9a5485-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/e7ceefa5-0b91-497d-80b9-6856ac9a5485-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/e7ceefa5-0b91-497d-80b9-6856ac9a5485-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/e7ceefa5-0b91-497d-80b9-6856ac9a5485-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/e7ceefa5-0b91-497d-80b9-6856ac9a5485-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/e7ceefa5-0b91-497d-80b9-6856ac9a5485.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Krishan Gopaul, senior analyst of the World Gold Council, revealed that central banks kept adding gold to their reserves during November. According to public records and reports from the International Monetary Fund (IMF), central banks added 44t of gold to their coffers, with the Central Bank of Turkey leading the charge by purchasing 25 tonnes. [&#8230;]"
  }
]