[
  {
    "source": "Cryptopolitan",
    "date": "2024-03-05T04:59:06.000Z",
    "title": "How Are AI-Driven Probes Revolutionizing Quantum Material Manufacturing?",
    "url": "https://www.cryptopolitan.com/ai-driven-probe-quantum-material/",
    "description": "In a groundbreaking advancement, scientists from the National University of Singapore (NUS) have unveiled a pioneering AI-driven methodology to fabricate carbon-based quantum materials at the atomic scale. This revolutionary approach, termed the chemist-intuited atomic robotic probe (CARP), integrates scanning probe microscopy techniques and deep neural networks to usher in a new era of atomic manufacturing. [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-05T04:48:28.000Z",
    "title": "Dogecoin Price Pumps To $0.20, Can DOGE Bulls Send It To $0.25",
    "url": "https://www.newsbtc.com/analysis/doge/dogecoin-price-pumps-to-0-20/",
    "description": "Dogecoin is up over 100% against the US Dollar. DOGE rallied toward the $0.20 resistance and might continue to rise toward the $0.225 resistance. DOGE extended its rally above the $0.150 resistance against the US dollar. The price is trading above the $0.180 level and the 100 simple moving average (4 hours). There is a connecting bullish trend line forming with support at $0.1620 on the 4-hour chart of the DOGE/USD pair (data source from Kraken). The price could extend its rally above the $0.200 and $0.2120 resistance levels. Dogecoin Price Surges Over 100% In the past few sessions, Dogecoin price started a strong increase above the $0.10 resistance. DOGE cleared many hurdles near $0.1250 to enter a positive zone. It even broke the $0.150 resistance and outperformed Bitcoin and Ethereum. It is up over 100% in a few sessions and traded close to the $0.20 resistance. A new multi-week high was formed near $0.992 and the price is now correcting gains. The price is well above the 23.6% Fib retracement level of the recent rally from the $0.1250 swing low to the $0.1992 high. DOGE is also trading above the $0.180 level and the 100 simple moving average (4 hours). There is also a connecting bullish trend line forming with support at $0.1620 on the 4-hour chart of the DOGE/USD pair. The trend line is near the 50% Fib retracement level of the recent rally from the $0.1250 swing low to the $0.1992 high. Source: DOGEUSD on TradingView.com On the upside, the price is facing resistance near the $0.1980 level. The next major resistance is near the $0.20 level. A close above the $0.20 resistance might send the price toward the $0.2250 resistance. The next major resistance is near $0.2320. Any more gains might send the price toward the $0.250 level. Downside Correction in DOGE? If DOGE’s price fails to gain pace above the $0.20 level, it could start a downside correction. Initial support on the downside is near the $0.182 level. The next major support is near the $0.1620 level or the trend line. If there is a downside break below the $0.1620 support, the price could decline further. In the stated case, the price might decline toward the $0.1350 level. Technical Indicators 4 Hours MACD – The MACD for DOGE/USD is now gaining momentum in the bullish zone. 4 Hours RSI (Relative Strength Index) – The RSI for DOGE/USD is now in the overbought zone. Major Support Levels – $0.1820, $0.1620 and $0.1350. Major Resistance Levels – $0.1980, $0.20, and $0.2250."
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-05T04:40:48.000Z",
    "title": "Charting the Bitcoin Course for Crypto Traders – Where Will 2024 Take Us",
    "url": "https://dailyhodl.com/2024/03/04/charting-the-bitcoin-course-for-crypto-traders-where-will-2024-take-us/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/btc-Remains-Rock-Solid.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/btc-Remains-Rock-Solid.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/btc-Remains-Rock-Solid.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/btc-Remains-Rock-Solid.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/btc-Remains-Rock-Solid.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/btc-Remains-Rock-Solid.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/btc-Remains-Rock-Solid.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>From its earliest days, Bitcoin has been demonstrating price patterns that repeat over and over again throughout its history. It appears they are centered around the halving – an event happening in the Bitcoin network every four years. As another halving approaches in 2024, a few other factors may affect the BTC price this year. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/04/charting-the-bitcoin-course-for-crypto-traders-where-will-2024-take-us/\">Charting the Bitcoin Course for Crypto Traders – Where Will 2024 Take Us</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]