[
  {
    "source": "Decrypt",
    "date": "2024-01-23T23:31:13.000Z",
    "title": "Jupiter Launching Solana Meme Coin With An Airdrop Even Bigger Than JUP",
    "url": "https://decrypt.co/213983/jupiter-solana-meme-coin-airdrop-bigger-than-jup",
    "description": "Waiting for the Jupiter airdrop? Jupiter’s launchpad will deploy a Solana meme coin to even more wallets this week."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-23T23:12:23.000Z",
    "title": "IRS adds cryptocurrency income tax question to four more tax forms",
    "url": "https://cryptoslate.com/irs-adds-cryptocurrency-income-tax-question-to-four-more-tax-forms/",
    "description": "<p>The IRS on Jan. 22 reminded all taxpayers to answer a question about digital assets and report all digital asset-related income. The question asks taxpayers: &#8220;At any time during 2023, did you: (a) receive (as a reward, award or payment for property or services); or (b) sell, exchange, or otherwise dispose of a digital asset [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/irs-adds-cryptocurrency-income-tax-question-to-four-more-tax-forms/\">IRS adds cryptocurrency income tax question to four more tax forms</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-23T23:37:12.000Z",
    "title": "Ethereum Evening Star Could Mean Lights Out On Bull Run",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-evening-star-could-mean-lights-out-on-bull-run/",
    "description": "Ethereum over the last several weeks finally began to gain some strength against Bitcoin and other top performing cryptocurrencies. But in the past few weeks, the upside has since been almost entirely erased. The up – then right back down – price action has formed a potential bearish Japanese candlestick reversal signal. Will ETHUSD continue down further, or surge back into an uptrend? We&#8217;ll explore the technical signals to watch for. Ethereum ETHUSD Possible Reversal Signal The two top cryptocurrencies by market cap, Bitcoin and Ethereum, have had an unusual divergence between the two assets in terms of price action. While Ethereum bottomed early in 2022, Bitcoin found its bottom later in November of the same year. But in 2023, BTC outperformed ETH by a wide margin. Related Reading: Bearish Sell Signal Triggers As Bitcoin Falls Below $39,000 All this started to change recently as spot BTC ETF news began to cool down, and ETH ETF rumors began to swirl. Post-approval selling of BTC, among other factors, have caused an over 20% correction in Bitcoin and Ether. Price action in ETHUSD, however, has formed what appears to be an evening star candlestick pattern. In Japanese candlestick analysis, an evening star pattern is a possible bearish reversal pattern, with enough potential to change a bull market to a bear market. Is this an evening star pattern? &#124; ETHUSD on TradingView.com All About The Evening Star Pattern An evening star is a three-candlestick pattern consisting of a tall white candle, a doji, and a large black candle that wipes out at least 50% of the first white candle. The more of the white candle that is engulfed, the stronger the evening star signal can potentially be. The pattern helps reveal the underlying market sentiment. The large white candle shows increased enthusiasm and strength by bulls, which is met with resistance and confusion. Selling eventually kicks in, as bears regain control and show surprise strength against bulls. Related Reading: A Golden Opportunity For Ethereum? 600% Buy Signal Returns With any Japanese candlestick pattern, context is important. The reversal signal appearing at the top of a rally and with bearish technical indicators firing gives it more possible significance. The same signal appeared at the peak of the 2021 bull market, kicking off an 82% drawdown. The candlestick pattern is only confirmed after a weekly close. It also requires follow through by bears, pushing ETHUSD to new 2024 lows. If bulls can make a stand and take back 50% or more of the candle, this signal could be invalidated. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  }
]