[
  {
    "source": "CoinDesk",
    "date": "2024-03-11T20:15:54.000Z",
    "title": "XRP Jumps 20% After Mysterious Binance Transfers as Crypto Rally Expands to Laggards",
    "url": "https://www.coindesk.com/markets/2024/03/11/xrp-jumps-20-after-mysterious-binance-transfers-as-crypto-rally-expands-to-laggards/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The rally could be a sign of traders rotating some of their capital to tokens that haven't moved yet."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-11T19:46:26.000Z",
    "title": "You Can Now Earn Bitcoin for Playing Sudoku—Here's How Much",
    "url": "https://decrypt.co/221229/you-can-earn-bitcoin-playing-sudoku-heres-how-much",
    "description": "Bling Financial’s free-to-play Bitcoin Sudoku on iOS and Android lets you earn BTC or Ethereum by solving puzzles."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-11T19:17:51.000Z",
    "title": "VanEck Lowers Bitcoin ETF Fees to Zero, Undercutting BlackRock",
    "url": "https://decrypt.co/221204/bitcoin-etf-fees-vaneck-blackrock-zero-waived",
    "description": "Looking for a competitive edge, VanEck is temporarily eliminating fees for its Bitcoin ETF offering."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-11T20:18:26.000Z",
    "title": " Israel announces plans for interest-bearing Shekel CBDC ",
    "url": "https://cointelegraph.com/news/israel-announces-plans-interest-bearing-shekel-cbdc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMjRiYmMyMDEtYTg1NC00Zjg1LTg2MjEtMzljZDE0NjA0NTM4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Although plans for an ILA CBDC have been in place since 2021, no pilot tests have since carried forward. </p>\n                    <p><p>Israel's central bank will support a New Israeli Shekel (ILA) central bank digital currency (CBDC) that has the optionality of bearing interest.</p><p>According to the March 11 <a href=\"https://boi.org.il/media/lumjpcuy/%D7%90%D7%A8%D7%9B%D7%99%D7%98%D7%A7%D7%98%D7%95%D7%A8%D7%94-%D7%9C%D7%95%D7%92%D7%99%D7%AA-%D7%90%D7%A0%D7%92%D7%9C%D7%99%D7%AA.pdf\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, the Bank of Israel outlined that its ILA CBDC will be implemented in a two-tier model, with instant, 24/7 payments, multi-payment support, offline use, limitations on balances and an option for the CBDC to become interest-bearing. The central bank wrote: </p><p>Currently, commercial banks in Israel pay 4.86% interest on customers’ fiat ILA deposits and savings. Under the central bank’s plans, banks would be able to hold the ILA CBDC as part of their short-term liquidity buffer, which would be non-interest bearing. </p><p><a href=\"https://cointelegraph.com/news/israel-announces-plans-interest-bearing-shekel-cbdc\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-11T20:00:00.000Z",
    "title": " Binance suffers ‘near-mortal blow’ after SEC and class-action lawsuits: Law Decoded ",
    "url": "https://cointelegraph.com/news/binance-mortal-blow-sec-lawsuits-law-decoded",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMTBiNDEwNTgtNTVhYy00NjIzLWE0MTYtOTg3ZGE4MjRhZjg0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The world’s largest crypto exchange continues to grapple with ongoing legal challenges, particularly in the United States.</p>\n                    <p><p data-ct-non-breakable=\"true\">Binance continues to grapple with ongoing legal challenges, particularly in the United States. The exchange has already <a href=\"https://cointelegraph.com/news/binance-us-sec-lawsuit-choking-business-layoff-revenue\">had a “near-mortal blow”</a> after a June 2023 lawsuit from the United States Securities and Exchange Commission (SEC), forcing it to terminate over 200 staff as revenues “imploded,” according to its chief operating officer Christopher Blodgett. Now, the SEC alleges the company is “unable or unwilling” to answer requests for information concerning the custody of customer assets. The regulator has <a href=\"https://cointelegraph.com/news/sec-binance-us-unwilling-to-cooperate-lawsuit-investigation\">asked the court to intervene</a> to speed up the discovery process.</p><p>Central to the SEC’s investigation is whether employees of the non-U.S. arm of Binance maintained access to Binance.US customer assets. The SEC claimed Binance.US has failed to prove that it didn’t have access to private keys or other forms of access to customer assets. In the report, Binance.US pushed back on the SEC’s allegations, saying it had complied with the regulator’s “exceptionally broad” requests for information and asked the court to end the expedited discovery process.</p><p>Meanwhile, a U.S. appeals court <a href=\"https://cointelegraph.com/news/appeals-court-united-states-crypto-exbinance-dismiss-class-action-lawsuit\">overturned a ruling</a> that dismissed a class-action lawsuit led by investors against Binance. Chase Williams filed the lawsuit in April 2020 on behalf of investors in a similar situation, arguing that Binance allegedly contracted to sell securities without being registered as a securities exchange or broker-dealer. The district court dismissed the lawsuit, citing the investors’ claims as untimely according to the relevant statute of limitations. However, the appeals court agrees with the plaintiffs’ claims that Binance is subject to domestic securities laws and that their initial filing was timely.</p><p><a href=\"https://cointelegraph.com/news/binance-mortal-blow-sec-lawsuits-law-decoded\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-11T19:56:35.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Bitcoin miner Bitfarms has exercised the option to purchase an additional 51,908 ASIC miners roughly five weeks out from the next halving event. Michael Saylor’s MicroStrategy bought another 12,000 Bitcoin using the proceeds of an $800 million convertible note offering. Meanwhile, crypto investors should expect to see the first significant inflows from major wirehouses, institutional consultants and large consultants into Bitcoin exchange-traded funds (ETFs) in the next quarter. </p><p>Bitcoin miner Bitfarms has purchased an additional <a href=\"https://cointelegraph.com/news/bitcoin-miner-bitfarms-purchases-additional-51908-asics-amid-bull-market\">51,908 ASIC miners</a> as it increases mining capacity ahead of the halving event, which is expected to occur sometime next month.</p><p>The purchase includes 28,000 Bitmain T21 ASIC miners, 19,280 Bitmain T21 miners, 3,888 Bitmain S21 miners and 740 Bitmain S21 hydro miners.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-11T19:42:51.000Z",
    "title": " VanEck slashes Bitcoin spot ETF fees to zero amid ATH inflows ",
    "url": "https://cointelegraph.com/news/vaneck-slashes-bitcoin-spot-etf-fees-zero-amid-ath-inflows",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNmI4N2ZkMDktNmE2NS00OWVkLTg4YjEtMjU2OWZlYjk2NTg0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Since their inception in January, U.S. spot Bitcoin ETFs have attracted billions in inflows. </p>\n                    <p><p>Asset manager VanEck will reduce all sponsor fees to zero for the first $1.5 billion of funds in its Bitcoin Trust ETF until March 31, 2025.</p><p>According to the March 11 <a href=\"https://twitter.com/vaneck_us/status/1767227350108794991\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, the sponsor fee is levied at 0.20% of net assets under management for funds exceeding $1.5 billion. \"Because we believe in #bitcoin so much, starting tomorrow, you can invest in VanEck Bitcoin Trust (HODL) with no fees until March 31, 2025,\" the asset manager wrote.</p><p>The VanEck Bitcoin Trust ETF was approved by the U.S. Securities and Exchange Commission (SEC) on Jan. 4 and <a href=\"https://www.vaneck.com/us/en/investments/bitcoin-trust-hodl/overview/\" target=\"_blank\" rel=\"noopener nofollow\">currently</a> has $297.86 million in assets under management, with 4,299 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) in its holdings. Tracking the performance of Bitcoin, the exchange-traded fund (ETF) has returned 87.7% since its inception two months ago.</p><p><a href=\"https://cointelegraph.com/news/vaneck-slashes-bitcoin-spot-etf-fees-zero-amid-ath-inflows\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-11T19:52:14.000Z",
    "title": "Analysts lower odds of Ethereum ETF approval to 35%",
    "url": "https://cryptoslate.com/analysts-lower-odds-of-ethereum-etf-approval-to-35/",
    "description": "<p>In a recent shift of perspective, Bloomberg analysts have significantly lowered the forecast for the approval of a spot Ethereum exchange-traded fund (ETF) by May — setting the probability at a mere 35%. According to Eric Balchunas, the odds are down sharply from previous estimates, which ranged between 60% and 70%. The revision reflects growing [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/analysts-lower-odds-of-ethereum-etf-approval-to-35/\">Analysts lower odds of Ethereum ETF approval to 35%</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-11T19:41:23.000Z",
    "title": "Revolutionizing Memory Care: Sensay Unveils AI-Powered Digital Replicas for Dementia Support and Beyond",
    "url": "https://cryptodaily.co.uk/2024/03/revolutionizing-memory-care-sensay-unveils-ai-powered-digital-replicas-for-dementia-support-and-beyond",
    "description": "Revolutionizing Memory Care: Sensay Unveils AI-Powered Digital Replicas for Dementia Support and Beyond"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-11T20:00:32.000Z",
    "title": "Developing a Keyless Crypto Wallet Utilizing Biometrics – KeychainX CEO Robert Rhodin",
    "url": "https://news.bitcoin.com/developing-a-keyless-crypto-wallet-utilizing-biometrics-keychainx-ceo-robert-rhodin/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/biometrics-dna-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Developing a Keyless Crypto Wallet Utilizing Biometrics – KeychainX CEO Robert Rhodin\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/biometrics-dna-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/biometrics-dna-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/biometrics-dna-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/biometrics-dna-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/biometrics-dna-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/biometrics-dna-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/biometrics-dna.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />KeychainX AG, a Swiss-based crypto recovery company, has been assisting people in accessing their lost crypto since 2017. The company also holds patents around the world for a keyless crypto wallet that utilizes biometrics, such as fingerprints or even DNA. Robert Rhodin is the CEO of KeychainX. He recently joined the Bitcoin.com News Podcast to [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-11T19:30:55.000Z",
    "title": "From RBN to FLOKI: This Week’s Crypto Winners and Losers",
    "url": "https://news.bitcoin.com/from-rbn-to-floki-this-weeks-crypto-winners-and-losers/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/foo-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"From RBN to FLOKI: This Week’s Crypto Winners and Losers\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/foo-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/foo-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/foo-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/foo-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/foo-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/foo-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/foo.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />While bitcoin and ethereum have gathered 8.9% and 13.5% gains against the U.S. dollar this week, a large handful of crypto assets recorded double-digit rises. At present, the crypto economy is now valued at $2.72 trillion, up 3.62% over the past day. Crypto Economy Swells to $2.72 Trillion On Monday, over two dozen crypto assets [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-11T19:42:18.000Z",
    "title": "Revolutionizing Memory Care: Sensay Unveils AI-Powered Digital Replicas for Dementia Support and Beyond",
    "url": "https://www.cryptopolitan.com/revolutionizing-memory-care-sensay-unveils-ai-powered-digital-replicas-for-dementia-support-and-beyond/",
    "description": "London, UK, March 11th, 2024, Chainwire Sensay, a pioneering technology company at the intersection of AI and blockchain, today announced the imminent launch of its innovative platform designed to create autonomous lifelike AI Digital Replicas on-chain, marking a significant leap towards digital immortality. Leveraging cutting-edge technology, Sensay offers limitless potential in the digital age, empowering [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-11T20:10:50.000Z",
    "title": "FDIC Vice Chair advocates for more flexible approach to digital assets",
    "url": "https://crypto.news/fdic-digital-assets-proposal-vice-chair/",
    "description": "Travis Hill, vice chairman of the FDIC, criticized the U.S. banking restrictions on handling digital assets for clients."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-11T19:58:26.000Z",
    "title": "Bitcoin’s rally creating millionaire wallets each day ",
    "url": "https://crypto.news/bitcoin-rally-millionaire-wallets/",
    "description": "Bitcoin’s recent all-time high is reportedly generating approximately 1,500 'millionaire wallets' each day."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-11T19:51:45.000Z",
    "title": "ISIS leveraging stablecoins for funding operations in Africa",
    "url": "https://crypto.news/isis-stablecoins-funding-africa/",
    "description": "The terrorist group ISIS is leveraging stablecoins such as Tether for fundraising and global financial transactions, including operations in Africa. "
  },
  {
    "source": "BTCManager",
    "date": "2024-03-11T19:44:37.000Z",
    "title": "Kickstarter received secret $100m investment to become web3 company",
    "url": "https://crypto.news/kickstarter-secret-investment-web3/",
    "description": "In early December 2021, a Kickstarter crowdfunding startup received an investment offer in exchange for transforming into a web3 company."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-11T19:22:24.000Z",
    "title": "Bloomberg analyst: 35% chance of spot Ethereum ETF approval by May",
    "url": "https://crypto.news/bloomberg-ethereum-etf-approval-may/",
    "description": "Experts are unsure whether spot Ethereum ETFs will be approved by May. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-11T20:30:08.000Z",
    "title": "MicroStrategy Increases Bitcoin Bet With $822M Purchase, Adds 12,000 BTC To Treasury",
    "url": "https://www.newsbtc.com/bitcoin-news/microstrategy-increases-bitcoin-bet-with-822m-purchase-adds-12000-btc-to-treasury/",
    "description": "As Bitcoin (BTC) continues its unprecedented uptrend, surging to a new all-time high (ATH) of $72,300, software company MicroStrategy remains steadfast in its vision. It is reaping substantial rewards from its strategic investment in the largest cryptocurrency in the market.  MicroStrategy, led by renowned Bitcoin supporter and former CEO Michael Saylor, recently made a major acquisition, further solidifying its position in the digital asset market. MicroStrategy Bitcoin Investment Pays Off According to a filing with the US Securities and Exchange Commission (SEC), MicroStrategy acquired approximately 12,000 BTC between February 26, 2024, and March 10, 2024, for approximately $821.7 million in cash. The average purchase price per Bitcoin was $68,400.  Additionally, MicroStrategy recently completed an offering of convertible senior notes due 2030, raising $800 million in funds. With this latest acquisition, MicroStrategy&#8217;s Bitcoin holdings now stand at a staggering 205,000 BTC, acquired for $6.9 billion. Related Reading: Record $1 Billion In Shorts Risk Liquidation If Bitcoin Hits This Price MicroStrategy&#8217;s stock trades at $1,557, representing a remarkable 9% gain within 24 hours. The company&#8217;s shares have demonstrated a sustained and continuous upward trajectory since February 26, coinciding with Bitcoin&#8217;s $50,000 consolidation phase breakthrough.  Over two weeks, Bitcoin surged to its present trading price, establishing a notable correlation between the leading cryptocurrency and MicroStrategy. This correlation has further solidified the company&#8217;s strategy and contributed to its stock&#8217;s performance. MicroStrategy&#8217;s strategic investment in Bitcoin has yielded remarkable results. The company now boasts a profit of $7.7 billion on its Bitcoin holdings, which translates to a remarkable return of 112% so far as Bitcoin breaks new all-time highs. ETF Expert Astounded By Bitcoin ETF Success The rapid rise of Bitcoin Exchange-Traded Funds (ETFs) has surpassed even the most optimistic projections. Bloomberg ETF expert Eric Balchunas highlighted the growth of these funds in a recent post on social media site X (formerly Twitter). The expert noted that assets under management (AUM) surpassed $55 billion, and trading volume reached an impressive $110 billion.  Balchunas acknowledged that achieving such numbers in just two months was nothing short of “absurd,” far exceeding what would normally be considered successful even at the end of a full year. Related Reading: Crypto Analyst Unveils 7 Memecoins To Turn $1,000 Into $1 Million In addition, in a surprising turn of events for the ETF expert, Blackrock&#8217;s IBIT ETF and Fidelity&#8217;s FBTC have emerged as the leaders among all ETFs in terms of year-to-date (YTD) flows through the middle of March. This unexpected feat positions these Bitcoin ETF offerings as major players in the ETF market, attracting the attention and interest of investors seeking exposure to the digital asset. Currently, BTC continues its uptrend, aiming to solidify and consolidate above the $70,000 threshold, which would put the cryptocurrency in a good position to reach the $100,000 mark in the rest of the year.  Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-11T19:39:30.000Z",
    "title": "Revolutionizing Memory Care: Sensay Unveils AI-Powered Digital Replicas for Dementia Support and Beyond",
    "url": "https://www.crypto-news-flash.com/revolutionizing-memory-care-sensay-unveils-ai-powered-digital-replicas-for-dementia-support-and-beyond/?utm_source=rss&utm_medium=rss&utm_campaign=revolutionizing-memory-care-sensay-unveils-ai-powered-digital-replicas-for-dementia-support-and-beyond",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />London, UK, March 11th, 2024, Chainwire Sensay, a pioneering technology company at the intersection of AI and blockchain, today announced the imminent launch of its innovative platform designed to create autonomous lifelike AI Digital Replicas on-chain, marking a significant leap towards digital immortality. Leveraging cutting-edge technology, Sensay offers limitless potential in the digital age, empowering [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-11T19:42:12.000Z",
    "title": "Revolutionizing Memory Care: Sensay Unveils AI-Powered Digital Replicas for Dementia Support and Beyond",
    "url": "https://coinedition.com/revolutionizing-memory-care-sensay-unveils-ai-powered-digital-replicas-for-dementia-support-and-beyond/",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://coinedition.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb.jpg 1200w, https://coinedition.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb-300x180.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb-1024x614.jpg 1024w, https://coinedition.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb-380x228.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb-768x461.jpg 768w, https://coinedition.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb-148x89.jpg 148w, https://coinedition.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb-742x445.jpg 742w, https://coinedition.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb-412x247.jpg 412w, https://coinedition.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb-400x240.jpg 400w, https://coinedition.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb-275x165.jpg 275w, https://coinedition.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb-352x211.jpg 352w, https://coinedition.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb-117x70.jpg 117w, https://coinedition.com/wp-content/uploads/2024/03/Sensay_Launch_1710180129S06KVPpxWb-125x75.jpg 125w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" /><p>London, UK, March 11th, 2024, Chainwire Sensay, a pioneering technology company at the intersection of AI and blockchain, today announced the imminent launch of its innovative platform designed to create autonomous lifelike AI Digital Replicas on-chain, marking a significant leap towards digital immortality. Leveraging cutting-edge technology, Sensay offers limitless potential in the digital age, empowering [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/revolutionizing-memory-care-sensay-unveils-ai-powered-digital-replicas-for-dementia-support-and-beyond/\">Revolutionizing Memory Care: Sensay Unveils AI-Powered Digital Replicas for Dementia Support and Beyond</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-11T20:00:30.000Z",
    "title": "New Whales Begin Accumulating Massive Amounts of Chainlink (LINK) From Binance: Lookonchain",
    "url": "https://dailyhodl.com/2024/03/11/new-whales-begin-accumulating-massive-amounts-of-chainlink-link-from-binance-lookonchain/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Predicts-Breakout-for-Chainlink.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Predicts-Breakout-for-Chainlink.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Predicts-Breakout-for-Chainlink.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Predicts-Breakout-for-Chainlink.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Predicts-Breakout-for-Chainlink.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Predicts-Breakout-for-Chainlink.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Predicts-Breakout-for-Chainlink.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New deep-pocketed entities have accumulated the native asset of the decentralized oracle provider Chainlink (LINK), according to blockchain tracking firm Lookonchain. Lookonchain says that eight different addresses withdrew $16.72 million worth of LINK tokens from Binance, the world&#8217;s largest crypto exchange. &#8220;It seems that whales are buying LINK! We noticed that eight fresh wallets withdrew [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/11/new-whales-begin-accumulating-massive-amounts-of-chainlink-link-from-binance-lookonchain/\">New Whales Begin Accumulating Massive Amounts of Chainlink (LINK) From Binance: Lookonchain</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-11T19:55:09.000Z",
    "title": "Donald Trump Comments on Bitcoin and NFTs, Says He Likely Wouldn’t ‘Take It Away’ if Elected President",
    "url": "https://dailyhodl.com/2024/03/11/donald-trump-comments-on-bitcoin-and-nfts-says-he-likely-wouldnt-take-it-away-if-elected-president/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/white-house-report.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/white-house-report.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/white-house-report.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/white-house-report.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/white-house-report.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/white-house-report.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/white-house-report.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Donald Trump, the former president and presumptive Republican nominee in 2024, is signaling his support of digital assets. In a new CNBC interview, Trump indicated if he were elected president again he would not crack down on the use of Bitcoin (BTC) and other cryptocurrencies through increased regulations. According to Trump, the use of digital [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/11/donald-trump-comments-on-bitcoin-and-nfts-says-he-likely-wouldnt-take-it-away-if-elected-president/\">Donald Trump Comments on Bitcoin and NFTs, Says He Likely Wouldn’t ‘Take It Away’ if Elected President</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]