[
  {
    "source": "CoinDesk",
    "date": "2024-02-07T22:53:47.000Z",
    "title": "Crypto Firm Bakkt Warns It Might Not Be Able to Remain in Business",
    "url": "https://www.coindesk.com/business/2024/02/07/crypto-firm-bakkt-warns-it-might-not-be-able-to-remain-in-business/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The company, backed by the owner of the NYSE, was introduced in 2018 with the initial goal of helping Starbucks customers buy coffee with bitcoin."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-07T23:05:00.000Z",
    "title": " Why is Ether (ETH) price up today? ",
    "url": "https://cointelegraph.com/news/why-is-ethereum-eth-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDEvNjJhOWU5MTEtNDNhMi00Y2M0LTkyYTEtZjQ4MTlkOGYwZGI1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ethereum price is up today as a fast-approaching network upgrade, expectations for an ETH ETF and technical factors paint a bullish outlook.</p>\n                    <p><p>Ether (ETH) price has gained 5.5% over the last three days and 2.5% over the last 24 hours, bringing the price above the $2,400 level. A bevy of technical and ecosystem-related factors appear responsible for the move, but will they be strong enough to send Ether price above its 20-month high at $2,717?<strong></strong></p><p>Ether’s price action since Feb. 5 has seen it flip key levels from resistance to support, including the 50-day exponential moving average (EMA) and the $2,400 level.</p><p>The most significant support level for ETH is currently the 50-day EMA, which is currently at $2,312. </p><p><a href=\"https://cointelegraph.com/news/why-is-ethereum-eth-price-up-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-07T22:45:00.000Z",
    "title": " Ethereum Name Service open to building own layer 2: ENS director ",
    "url": "https://cointelegraph.com/news/ethereum-name-service-open-building-in-house-layer-2-ens-director",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNzgzZmE1NGQtZjlmNy00YzAxLWEyZGEtNzhmNjAzOTFiOGUyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>ENS executive director Khori Whittaker says ENS is going “heavy” on research and development for Layer 2s, adding that much of the conversation between developers is focused on Optimism. </p>\n                    <p><p>Ethereum Name Service is “heavily” focused on researching ways to build its protocol on Ethereum layer-2 networks and may even consider launching an in-house layer 2 of its own, revealed ENS executive director Khori Whittaker. </p><p>In an interview with Cointelegraph, Whittaker remained tight-lipped on the specific details of its research and development process, but said the ENS team is currently debating if it should build its integration on a pre-existing Ethereum layer-2 network or release an in-house L2 it dubs “the identity layer.”</p><p>Whittaker revealed that the bulk of the conversations between ENS developers were focused largely on pursuing development on Optimism.</p><p><a href=\"https://cointelegraph.com/news/ethereum-name-service-open-building-in-house-layer-2-ens-director\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-07T22:44:11.000Z",
    "title": " TRON poised to lead stablecoin payments and RWA tokenization: Report  ",
    "url": "https://cointelegraph.com/news/tron-poised-leading-role-stablecoin-payments-tokenization",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNTM5OTdjZTMtNTk4YS00ZjgzLTliNTItOTRmM2QyNTAzNmEwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Cointelegraph Research dives into TRON’s emerging use cases and ecosystem in new research report.</p>\n                    <p><p>Among the myriad of blockchains introduced in the last decade, TRON has effectively catered to the rising demand for stablecoin products and services with its scalable and cost-efficient platform. This capability has garnered attention from leading stablecoin companies, including Tether and Circle, which issue Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) and Circle USD (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>), and has attracted significant interest in retail payment applications.</p><p>The latest report from Cointelegraph Research provides extensive analysis and detailed insights into the elements driving TRON’s ascent. This document delves into the key contributors to TRON’s success, covering its innovative technical features (such as the Tron Virtual Machine), its broad ecosystem, the dynamic community of decentralized applications (DApps) it supports, its token economy, the development of its real-world asset (RWA) protocol, and its strategic roadmap for future growth.</p><p class=\"post-content__accent post-content__accent_small \"><a href=\"https://research.cointelegraph.com/reports/trons-journey-the-evolution-of-a-blockchain-pioneer\">Access the full version of report on Cointelegraph Research for free</a></p><p><a href=\"https://cointelegraph.com/news/tron-poised-leading-role-stablecoin-payments-tokenization\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-07T22:46:11.000Z",
    "title": "Monero rebounds with 23% gain, marking recovery from news of Binance delisting",
    "url": "https://cryptoslate.com/monero-rebounds-with-20-gain-marking-recovery-from-news-of-binance-delisting/",
    "description": "<p>After losing much of its market price following news of an upcoming delisting, Monero (XMR) partially recovered its value on Feb. 7. XMR maintained a market value above $160 for several days before Binance announced plans to delist the asset on Feb. 6. The price of XMR plummeted to $100 alongside that news. Although initial [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/monero-rebounds-with-20-gain-marking-recovery-from-news-of-binance-delisting/\">Monero rebounds with 23% gain, marking recovery from news of Binance delisting</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-07T22:49:51.000Z",
    "title": "Tokens rise 34% on average after being unlocked for private investors: Report",
    "url": "https://cryptobriefing.com/tokens-rise-34-average-private-investors/?utm_source=feed&utm_medium=rss",
    "description": "Understand the 7-day slump in token prices before large private investor unlocks due to retail fear."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-07T23:00:39.000Z",
    "title": "Dogecoin Adoption Explodes In Stunning Move, Can DOGE Chart A Path To $0.2?",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-doge-path-to-0-2/",
    "description": "The Dogecoin adoption trend has taken the crypto market by surprise after the number of new wallets being created on the network skyrocketed. Last week, new wallet creations were the center of attention as more than 890,000 new DOGE wallets were added in a single week. This time around, a new Dogecoin metric is taking the stage. New Non-Zero Dogecoin Addresses Rise Rapidly In a new report, the on-chain data tracking platform Santiment has identified rapid growth in one Dogecoin metric and that is the number of new non-zero addresses. These addresses include those that were created in the last week and are holding more than 0.001 DOGE on their balances. Related Reading: LUNC Price Rally Is Far From Over Following Falling Wedge Breakout, Analyst Says The report shows that this category of addresses jumped more than 400,000 in the space of two weeks. More specifically, 413,800 new wallets have been added in the last week, with DOGE balances ranging from between 0.001 and 1 DOGE. This earns them the classification of non-zero balances. Interestingly, this rapid rise in adoption happened at a time when the DOGE price was struggling to hold up in the market. As Santiment notes in its post, the DOGE price is down more than 23%, while network adoption has been on a bullish run. However, this rise in adoption does not have a positive effect on the DOGE price, suggesting that there isn’t demand among the investors. More than likely, these new non-zero wallets are created by existing users who are looking to take advantage of and trade the newly introduced DRC-20 token standard on the network. DOGE price fails to move with network growth &#124; Source: DOGEUSDT on Tradingview.com DOGE Comes Under More Selling Pressure The Dogecoin price could be looking at more struggles ahead as more sell-offs could be looming on the horizon. Whale Alert, a platform that tracks the origin and destination of large crypto transactions, has flagged a large DOGE transaction that has sparked speculation in the community. Related Reading: Here’s Why A Bitcoin Bull Run In 2024 Is Inevitable According to the report, the whale sent a total of 100 million DOGE coins worth over $7.8 million to the Robinhood exchange. The destination of the transaction is important because usually when investors send coins to centralized exchanges such as Robinhood, the purposes are more than likely to sell. In this case, a $7.8 million sell-off could put further pressure on an already struggling DOGE price. For the DOGE price to climb as high as $0.2, there would need to be a catalyst, such as Elon Musk announcing Dogecoin payments for X (formerly Twitter). If the entire crypto market continues to perform poorly though, then the DOGE price could fall as low as $0.07 before bouncing back. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from CryptoRank, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-07T23:01:41.000Z",
    "title": "Ransomware Makes Comeback With Over $1,000,000,000 Extorted in 2023, According to Chainalysis",
    "url": "https://dailyhodl.com/2024/02/07/ransomware-makes-comeback-with-over-1000000000-extorted-in-2023-according-to-chainalysis/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/ftx-hacker-whales-flurry.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/ftx-hacker-whales-flurry.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-hacker-whales-flurry.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-hacker-whales-flurry.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-hacker-whales-flurry.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-hacker-whales-flurry.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-hacker-whales-flurry.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New data from market intelligence platform Chainalysis reveals that ransomware attacks resurfaced in 2023, extorting over $1 billion from investors throughout the year. In a new blog post, Chainalysis says that 2023 saw a rise in the number of ransomware attacks across the board – and the firm believes it&#8217;ll only increase. “Ransomware payments in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/07/ransomware-makes-comeback-with-over-1000000000-extorted-in-2023-according-to-chainalysis/\">Ransomware Makes Comeback With Over $1,000,000,000 Extorted in 2023, According to Chainalysis</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]