[
  {
    "source": "Decrypt",
    "date": "2023-11-20T16:12:08.000Z",
    "title": "Ubisoft Is Bringing Rayman, 'Captain Laserhawk' NFT Avatars to The Sandbox",
    "url": "https://decrypt.co/206688/ubisoft-bringing-rayman-captain-laserhawk-nft-avatars-sandbox",
    "description": "Rayman and characters from Beyond Good &#038; Evil are joining The Sandbox with a collection based on Ubisoft’s new Netflix series."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-20T16:30:40.000Z",
    "title": "Tether, OKX collaborate with DOJ to seize record $225M in illicit USDT funds",
    "url": "https://cryptoslate.com/tether-okx-collaborate-with-doj-to-seize-record-225m-in-illicit-usdt-funds/",
    "description": "<p>Tether, the issuer of the USDT stablecoin, and crypto exchange OKX have partnered with the U.S. Department of Justice to seize $225 million, the largest-ever freeze of USDT in history, according to a Nov. 20 statement. The frozen USDT was linked to an international human trafficking syndicate in Southeast Asia that orchestrated a global &#8220;pig [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/tether-okx-collaborate-with-doj-to-seize-record-225m-in-illicit-usdt-funds/\">Tether, OKX collaborate with DOJ to seize record $225M in illicit USDT funds</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-20T16:17:18.000Z",
    "title": "U.S. Treasury Secretary Warns of Persistent Inflation Despite Progress: A Challenging Economic Outlook",
    "url": "https://www.cryptoglobe.com/latest/2023/11/u-s-treasury-secretary-warns-of-persistent-inflation-despite-progress-a-challenging-economic-outlook/",
    "description": "On 20 November 2023, U.S. Treasury Secretary Janet Yellen appeared on CNBC’s “Squawk Box” to discuss various economic issues with co-anchor Andrew Ross Sorkin. The conversation covered the economic implications of the recent meeting between President Biden and Chinese President Xi Jinping, the state of the U.S. economy, the ongoing battle against inflation, and geopolitical […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-20T16:34:52.000Z",
    "title": "As Fall Brings Big Wins for Solana (SOL) and Kaspa (KAS), Investors Guess on Who Will Seal the Year with More Xs",
    "url": "https://cryptodaily.co.uk/2023/11/as-fall-brings-big-wins-for-solana-sol-and-kaspa-kas-investors-guess-on-who-will-seal-the-year-with-more-xs",
    "description": "Delve into the captivating journey of Solana (SOL) and Kaspa (KAS) as they each witness remarkable three-digit gains this fall. Our in-depth analysis explores the soaring trajectories of SOL and KAS, highlighting their recent market performances and the growing intrigue among investors. Discover the factors driving their ascent and the speculation surrounding which asset will emerge as the year-end victor."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-20T16:13:11.000Z",
    "title": "Toncoin and THORChain Rally Stalls, Everlodge Prepares for 20x Price Surge",
    "url": "https://cryptodaily.co.uk/2023/11/toncoin-and-thorchain-rally-stalls-everlodge-prepares-for-20x-price-surge",
    "description": "While the crypto market struggled in August and September, Toncoin and THORChain rallied. However, these cryptos have lost momentum,"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-20T16:10:18.000Z",
    "title": "UK Election Watchdog Warns of Powerlessness Against AI-Generated Deepfakes",
    "url": "https://www.cryptopolitan.com/uk-watchdog-warns-against-ai-deepfakes/",
    "description": "The UK&#8217;s election watchdog has sounded an alarm, expressing its inability to combat &#8216;deepfake&#8217; content, thereby leaving Britain susceptible to the disruptive influence of AI-generated fake videos of politicians in the upcoming elections. The UK&#8217;s election watchdog has issued a stark warning, revealing its lack of authority in dealing with the growing threat of &#8216;deepfake&#8217; ... <a title=\"UK Election Watchdog Warns of Powerlessness Against AI-Generated Deepfakes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-watchdog-warns-against-ai-deepfakes/\" aria-label=\"More on UK Election Watchdog Warns of Powerlessness Against AI-Generated Deepfakes\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-20T16:33:13.000Z",
    "title": "Santander Private Banking International diversifies into crypto trading for high net worth clients",
    "url": "https://crypto.news/santander-private-banking-international-diversifies-into-crypto-trading-for-high-net-worth-clients/",
    "description": "Santander Private Banking International, a division of Banco Santander, is now offering its wealthy clients the opportunity to trade and invest in prominent cryptocurrencies like Bitcoin and Ether, marking a significant shift in the bank's approach to digital asset management."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-20T16:24:46.000Z",
    "title": "Ethereum among major blockchains, dominating with 92.5% of total TVL",
    "url": "https://crypto.news/ethereum-among-major-blockchains-dominating-with-92-5-of-total-tvl/",
    "description": "In a Nov. 20 post on X, Coingecko, a leading cryptocurrency data aggregator reports Ethereum, Tron and Binance Smart Chain make up a total of 92.5% of total value locked (TVL) of the top Layer-1 blockchains."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-20T16:24:00.000Z",
    "title": "Floki and TokenFi form partnership with legendary Cricket teams",
    "url": "https://crypto.news/floki-and-tokenfi-form-partnership-with-legendary-cricket-teams/",
    "description": "In a Nov. 20 press release shared with crypto.news, Floki and TokenFi, the two sister tokens, announced their new marketing collaboration with two renowned cricket teams, the Manipal Tigers and the Bhilwara Kings."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-20T16:14:47.000Z",
    "title": "Empowering women in crypto: challenges and progress in 2023",
    "url": "https://crypto.news/empowering-women-in-crypto-challenges-and-progress-in-2023/",
    "description": "More women are investing, but few lead. Explore the industry's efforts to bridge this gender divide."
  }
]