[
  {
    "source": "CryptoSlate",
    "date": "2024-01-16T16:00:37.000Z",
    "title": "How ETFs affected BTC futures trading in the U.S.",
    "url": "https://cryptoslate.com/how-etfs-affected-btc-futures-trading-in-the-u-s/",
    "description": "<p>The launch of the spot Bitcoin ETFs in the U.S. marked a watershed moment in the crypto industry. While the impact it could have on the global Bitcoin market, like legitimizing it as an asset class or creating more demand, has been analyzed at length, few have focused on its effects on other regulated investment [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/how-etfs-affected-btc-futures-trading-in-the-u-s/\">How ETFs affected BTC futures trading in the U.S.</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-16T16:03:27.000Z",
    "title": "Analysts Named These Altcoins As \"Solana Killers\" for 2024",
    "url": "https://cryptodaily.co.uk/2024/01/analysts-named-these-altcoins-as-solana-killers-for-2024",
    "description": "2024 is set to be a groundbreaking year in the crypto world, with analysts eyeing a new breed of altcoins as potential 'Solana killers'. From Solana's anticipated tech upgrades boosting network efficiency to the rise of promising altcoins, the stage is set for a transformative crypto battle.  Join us in tracking the thrilling journey of these altcoins as they vie for a significant slice of the crypto pie."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-16T16:00:28.000Z",
    "title": "Pushd (PUSHD) Looks To Be Best Investment In 2024 Over Dogecoin (DOGE) And Shiba Inu (SHIB)",
    "url": "https://cryptodaily.co.uk/2024/01/pushd-pushd-looks-to-be-best-investment-in-2024-over-dogecoin-doge-and-shiba-inu-shib",
    "description": "2021 was the year of the memecoins. It was the year many investors and speculators made tons of money off of Dogecoin (DOGE) and Shiba Inu (SHIB)"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-16T16:00:01.000Z",
    "title": "Bitcoin’s Ordinal Inscriptions Soar Beyond 55 Million, Achieving Third Highest Daily Record",
    "url": "https://news.bitcoin.com/bitcoins-ordinal-inscriptions-soar-beyond-55-million-achieving-third-highest-daily-record/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/hop78-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin&#039;s Ordinal Inscriptions Soar Beyond 55 Million, Achieving Third Highest Daily Record\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/hop78-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/hop78-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/hop78-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/hop78-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/hop78-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/hop78-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/hop78.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Following the weekend, the tally of Ordinal inscriptions on the Bitcoin blockchain surpassed 55 million. Notably, on Jan. 13, 2024, the blockchain witnessed its third-highest day of inscriptions, settling an impressive 477,751 inscription-based transactions on Saturday. Additionally, from the inception of the first inscription in December 2022, bitcoin miners have amassed $246 million worth of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-16T16:09:36.000Z",
    "title": "Global Economic Prospects: Chief Economists Outlook Reveals Fragility Amidst Uncertainty",
    "url": "https://www.cryptopolitan.com/global-economic-prospects-chief-economists/",
    "description": "Amidst a backdrop of tight financial conditions, geopolitical tensions, and rapid advances in generative artificial intelligence (AI), the latest Chief Economists Outlook unveils a subdued global economic landscape. Over half of chief economists surveyed (56%) anticipate a weakening global economy in 2024, emphasizing the precarious nature of the current economic environment. Economic landscape and projections [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-16T16:00:38.000Z",
    "title": "Institutional Inflows Into XRP Surges 244% Amid ETF Speculation",
    "url": "https://www.newsbtc.com/analysis/xrp/institutional-inflows-xrp-244-etf/",
    "description": "XRP has reacted positively since the launch of spot Bitcoin ETFs in the US, both in its price and general market sentiment. At the same time, recent data from CoinShares on the weekly inflow into digital asset funds reveal that the positive sentiment flowed into XRP-based investment products, with institutional investors increasing interest amid speculations of whether a spot XRP ETF might soon hit the market. As a result, weekly net inflows into XRP jumped 244% last week, registering a total of $2.2 million.   Institutional Investors Look To XRP Amid Crypto ETF Hopes According to various reports, particularly one from on-chain analytics platform Santiment, social media mentions and popularity of XRP increased alongside Ethereum in the days after the SEC gave the green light on spot Bitcoin ETFs.  Related Reading: Ethereum Bloodbath Incoming? Celsius’ $125 Million Move Threatens ETH Price This isn&#8217;t surprising, as the approval of these ETFs signalled a change in the crypto investment landscape, leaving investors wondering whether we might see the US regulator approving an XRP spot ETF soon. For instance, Valkyrie&#8217;s Chief Investment Officer, Steve McClurg, noted that an XRP ETF could also be approved in the near future. According to CoinShares data, the speculation led to the crypto receiving a net inflow of $2.2 million last week, a dramatic 244% jump from $0.9 million recorded in the week before. Notably, this inflow is significantly more than the one recorded in the days following Ripple’s partial victory against the SEC in court. Consequently, this year&#8217;s total inflow into XRP-based products now sits behind only Cardano and Ethereum among altcoins.   Token price begins recovery &#124; Source: XRPUSD on Tradingview.com Inflow Into Asset Funds Post Bitcoin ETF Fail To Break Record  Digital asset funds recorded an enormous inflow of $1.18 billion last week. While this number represented a spike of 680% from the $151 million registered in the week before, it failed to break the $1.5 billion record set at the launch of the futures-based Bitcoin ETFs in October 2021. On the other hand, trading volume was $17.5 billion last week, the highest weekly volume on record.  Related Reading: Bitcoin To Reach $1 Million In Days To Weeks, Crypto Analyst As expected, the majority of last week&#8217;s inflow went to Bitcoin-based funds, with $1.14 billion. However, Bitcoin&#8217;s price has failed to meet expectations after spot Bitcoin ETFs hit the market. At the time of writing, the crypto is trading at $42,847 and is posting an 8% decline in a 7-day timeframe.  Ethereum came in second place with $25.47 million in inflows last week. In terms of geographical location, the United States dominated, seeing $1.24 billion of inflows last week, while Switzerland followed with a $21 million inflow.  Featured image from U.Today, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-16T16:04:04.000Z",
    "title": "Avalanche (AVAX) Defies Market Trends with 132% Surge Since Last Year",
    "url": "https://www.crypto-news-flash.com/avalanche-avax-defies-market-trends-with-132-surge-since-last-year/?utm_source=rss&utm_medium=rss&utm_campaign=avalanche-avax-defies-market-trends-with-132-surge-since-last-year",
    "description": "<img width=\"1200\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/33137.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/33137.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/33137-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/33137-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/33137-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/33137-450x253.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Avalanche has been on a tear, growing by 132% in the past year. The protocol is tilting positively toward memecoins with plans to invest in some residents on the network. Avalanche (AVAX) has emerged as a resilient protocol, boasting an impressive 132% price increase over the past year. This remarkable surge is even more noteworthy [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-16T16:02:00.000Z",
    "title": "Crypto Analyst Implores Users to Dump their ADA Tokens: Here is Why",
    "url": "https://coinedition.com/analyst-warns-ada-users-says-no-activity-on-cardano/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Crypto-Expert-Predicts-44-Surge-for-Cardano-ADA-to-Reach-0.60.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Analyst Warns ADA Users; Says No Activity on Cardano\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Crypto-Expert-Predicts-44-Surge-for-Cardano-ADA-to-Reach-0.60.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Crypto-Expert-Predicts-44-Surge-for-Cardano-ADA-to-Reach-0.60-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Crypto-Expert-Predicts-44-Surge-for-Cardano-ADA-to-Reach-0.60-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Crypto-Expert-Predicts-44-Surge-for-Cardano-ADA-to-Reach-0.60-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Crypto-Expert-Predicts-44-Surge-for-Cardano-ADA-to-Reach-0.60-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Crypto-Expert-Predicts-44-Surge-for-Cardano-ADA-to-Reach-0.60-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent post, Anders Helseth, head of research at K33 Research, asked cryptocurrency community members to stay clear of layer-1 blockchain Cardano (ADA). According to Helseth, “the Cardano network’s complete lack of meaningful activity will make the ADA token worthless over time.  Helseth based his arguments on several factors. Firstly, the analyst argued that [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/analyst-warns-ada-users-says-no-activity-on-cardano/\">Crypto Analyst Implores Users to Dump their ADA Tokens: Here is Why</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]