[
  {
    "source": "CoinDesk",
    "date": "2023-08-29T06:44:40.000Z",
    "title": "FTX Customers Hit By ‘Withdrawal' Phishing Mails After SIM Swap Attack",
    "url": "https://www.coindesk.com/business/2023/08/29/ftx-customers-hit-by-withdrawal-phishing-mails-after-sim-swap-attack/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Woes for users of the Sam Bankman-Fried-owned company show no signs of stopping."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-29T07:00:00.000Z",
    "title": "\n                        Hedera Sets Out for 1.15b Token Unlock\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/hedera-sets-out-for-115b-token-unlock",
    "description": "\n                        <p class=\"md-end-block md-p\">According to data from the Token Unlocks web app, the unlock will occur this coming September 1, 2023. These 1.15 billion tokens will be worth approximately $57.5 million as of writing, as HBAR is currently trading at $0.05 according data from CoinMarketCap.</p>\n<p class=\"md-end-block md-p\">Data also indicates that roughly 23.9% of the tokens will be allocated for ecosystem and open source development, 22.3% for purchase agreements, 14.8% on network governance and operations, and 7.7% for initial development costs and licensing.</p>\n<p class=\"md-end-block md-p\">Despite initial challenges towards the end of the Q1 2023 due to an exploit in the Hedera mainnet, HBAR has seen a surge over the past two months. This is due to the recent integration of Hedera&rsquo;s instant payment platform Dropp into the U.S. Federal Reserve&rsquo;s FedNow platform as a service provider.</p>\n<p class=\"md-end-block md-p\">FedNow introduced Dropp as an alternative to credit card payments, offering merchants the ability to accept small-value digital purchases without the burden of costly transaction fees. Dropp supports micropayments using HBAR, as well as the U.S. dollar and Circle's USDC, providing a pay-by-bank option for these transactions.</p>\n<p class=\"md-end-block md-p\">Hedera has prided itself as the only public ledger to use the hashgraph consensus, making it a decentralized, open-source, proof-of-stake, EVM-compatible public ledger, using a leaderless consensus algorithm. This confers the network with the highest level of security and performance theoretically possible. Recerntly, it has also integrated ChatGPT for a more streamlined asset management and monitoring.</p>\n<p class=\"md-end-block md-p\">It has also seen its userbase jump almost 300% from 3,500 to 13,500 by Q2 2023, year to-date, signalling . While the current metrics for the HBAR token warrant a cautious optimism, the potentialities latent in its integration of AI and the blockchain remain areas for speculation and enthusiasm. Investors and users should keep an eye on Hedera&rsquo;s future plans after the unlock.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T07:03:31.000Z",
    "title": "Tech Executives Set to Convene at Exclusive U.S. Senate AI Discussion",
    "url": "https://www.cryptopolitan.com/tech-executives-to-convene-at-u-s-senate/",
    "description": "A group of high-profile figures within the technology industry, including Elon Musk of Tesla, Mark Zuckerberg of Meta Platforms, and Sundar Pichai of Alphabet, are gearing up to partake in a forthcoming closed-door forum on artificial intelligence (AI) to be hosted by U.S. Senate Majority Leader Chuck Schumer.&#160; This closed-door dialogue, scheduled for September 13, ... <a title=\"Tech Executives Set to Convene at Exclusive U.S. Senate AI Discussion\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tech-executives-to-convene-at-u-s-senate/\" aria-label=\"More on Tech Executives Set to Convene at Exclusive U.S. Senate AI Discussion\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T06:52:11.000Z",
    "title": "Investors’ Exodus: Ditching XRP (XRP) & TRON (TRX) for the Promising Horizon of VC Spectra (SPCT)!",
    "url": "https://www.cryptopolitan.com/investors-exodus-ditching-xrp-xrp-tron-trx-for-the-promising-horizon-of-vc-spectra-spct/",
    "description": "By August 18, 2023, eight nations had initiated the development of CBDCs on the XRP network, signaling positive price development. Meanwhile, TRON (TRX) saw a temporary surge around August 10. Yet, VC Spectra (SPCT) ignited the interest of investors by amassing a significant $2.4 million in its private sale. But before we discuss VC Spectra ... <a title=\"Investors&#8217; Exodus: Ditching XRP (XRP) &#38; TRON (TRX) for the Promising Horizon of VC Spectra (SPCT)!\" class=\"read-more\" href=\"https://www.cryptopolitan.com/investors-exodus-ditching-xrp-xrp-tron-trx-for-the-promising-horizon-of-vc-spectra-spct/\" aria-label=\"More on Investors&#8217; Exodus: Ditching XRP (XRP) &#38; TRON (TRX) for the Promising Horizon of VC Spectra (SPCT)!\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T06:47:09.000Z",
    "title": "Hong Kong as a Fintech Leader with the Launch of HashKey Exchange",
    "url": "https://www.cryptopolitan.com/hong-kong-with-launch-of-hashkey-exchange/",
    "description": "Hong Kong, a city renowned for its financial prowess, has taken a monumental step in fortifying its standing in the cryptocurrency sector. The HashKey Exchange, one of the first platforms to receive a license from the city&#8217;s Securities and Futures Commission (SFC), began operations for retail investors this week. This move is part of a ... <a title=\"Hong Kong as a Fintech Leader with the Launch of HashKey Exchange\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hong-kong-with-launch-of-hashkey-exchange/\" aria-label=\"More on Hong Kong as a Fintech Leader with the Launch of HashKey Exchange\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T06:45:54.000Z",
    "title": "OpenAI Launches ChatGPT Enterprise: A Powerful AI Tool for Businesses",
    "url": "https://www.cryptopolitan.com/openai-launches-chatgpt-enterprise/",
    "description": "OpenAI has recently unveiled ChatGPT Enterprise, a specialized version crafted to address the specific communication needs of businesses. Following the intuitive interface of its public counterparts, ChatGPT Enterprise empowers users to input prompts and receive coherent written responses generated using OpenAI&#8217;s latest GPT-4 model. Innovative features for enhanced business interaction ChatGPT Enterprise boasts a range ... <a title=\"OpenAI Launches ChatGPT Enterprise: A Powerful AI Tool for Businesses\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openai-launches-chatgpt-enterprise/\" aria-label=\"More on OpenAI Launches ChatGPT Enterprise: A Powerful AI Tool for Businesses\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-29T07:05:28.000Z",
    "title": "Bitcoin Bull Market 2025: 3 Reasons Why It Won’t Be Like 2017 And 2021",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-bull-2025-3-reasons-why-wont-be-like-2017-2021/",
    "description": "In a recent tweet, Luke Mikic, a renowned podcaster and YouTuber, highlighted the distinct differences between the upcoming 2025 Bitcoin bull market and its predecessors in 2017 and 2021. Drawing from his insights and the data available, here&#8217;s a deep dive into the three reasons that set the 2025 bull market apart: 1. The Hash Rate Race: Nation States Enter the Fray &#8220;The Bitcoin hash rate is going absolutely parabolic, smashing through 400TH/s &#38; another ATH!&#8221; Mikic exclaimed. Indeed, the Bitcoin network hash rate recently achieved a record-breaking 414 EH/s, marking an 80% surge over the last 12 months. This growth is particularly astonishing given the energy challenges in Texas and the escalating global electricity costs. Related Reading: Bitcoin Bullish Uptrend Remains Unbroken, Here’s Why Mikic points out, &#8220;This is the 1st bear market where the hash rate is hitting new ATHs&#8230; Is this time different?&#8221; The answer seems to be a resounding yes. Nation states are now publicly (and maybe privately) mining Bitcoin. El Salvador and Bhutan were the pioneers, and recently, Oman joined the league. Oman&#8217;s strategic move to mine Bitcoin aims to diversify its economy from oil dependence and bolster renewable energy initiatives, including flare gas mitigation. Remarkably, it is yet unknown if not more countries are already mining BTC in stealth mode without official announcement. 2. Supply Suffocation Historically, bear markets have seen an influx of Bitcoin on exchanges. However, the current scenario paints a different picture. Mikic notes, &#8220;In every prior Bitcoin bear market we&#8217;ve seen an increase in the number of coins on exchanges. 2015 &#8211; Increase of 800K coins, 2018- Increase of 900K coins, 2022- DECREASE of 1 million since March 2020.&#8221; According to data from Santiment, a mere 5.8% of Bitcoin is now on exchanges, the lowest since December 17, 2017. Furthermore, Bitcoin&#8217;s Exchange Depositing Transactions (SMA 7-day) plummeted to a 5-year low, reaching 30,798 BTC per day, a figure reminiscent of December 11, 2016. On-chain analyst Axel Adler Jr.&#8217;s takeaway? &#8220;People do not want to sell BTC. The supply deficit will continue to stimulate growth.&#8221; 3. The Great Wall Street Accumulation The BlackRock Bitcoin spot ETF application stands as a watershed moment in Bitcoin&#8217;s journey towards mainstream adoption. Mikic emphasizes, &#8220;The Blackrock Bitcoin ETF application will be remembered as a pivotal moment for Bitcoin&#8217;s future mainstream adoption. TRILLIONS of capital has now been given the green light to invest in Bitcoin.&#8221; Related Reading: A Crash Like Amazon’s? This Scenario Could Push Bitcoin Back To $10,000 As the world&#8217;s largest asset manager, BlackRock&#8217;s entry could bestow unparalleled legitimacy upon the Bitcoin market. BlackRock will probably advertise Bitcoin and its new product in a big way, bringing new retail and institutional investors into BTC. Looking at the current price stagnation in Bitcoin, it should be noted that there are no new inflows at the moment, as evidenced by the decreasing amount of stablecoins in the ecosystem. In the midst of the longest of all bear markets, there is simply no reason for retailers to get back in at the moment. However, an event like the approval of a Bitcoin spot ETF can change this abruptly and be the trigger for a Bitcoin bull run (even before halving). In conclusion, the 2025 Bitcoin bull market is poised to be unlike any other. With nation states joining the mining race, a palpable supply shock, and Wall Street giants like BlackRock showing interest, Mikic&#8217;s final words resonate strongly: &#8220;Takeaway: NOBODY is bullish enough.&#8221; At press time, BTC traded at $26,058. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-29T07:00:04.000Z",
    "title": "Get Ready for the Boom: dYdX, Toncoin, and Borroe – The Ultimate Crypto Powerhouse!",
    "url": "https://www.crypto-news-flash.com/get-ready-for-the-boom-dydx-toncoin-and-borroe-the-ultimate-crypto-powerhouse/",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-152.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-152.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-152-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-152-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-152-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-152-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Toncoin (TON) seems to be gaining a bullish momentum after periods of decline recently, while dYdX (DYDX) is awaiting the next price action after introducing new developments. But, investors are turning to the next big thing in the cryptocurrency market. Borroe ($ROE) has already delivered 25% profits to early investors, and its price is set [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-29T07:04:38.000Z",
    "title": "Bitcoin Flashing Bullish Signal That Previously Preceded a 214% Rally, According to Macro Guru Raoul Pal",
    "url": "https://dailyhodl.com/2023/08/29/bitcoin-flashing-bullish-signal-that-previously-preceded-a-214-rally-according-to-macro-guru-raoul-pal/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Ignited-Up-to-214.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Ignited-Up-to-214.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Ignited-Up-to-214.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Ignited-Up-to-214.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Ignited-Up-to-214.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Ignited-Up-to-214.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Ignited-Up-to-214.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Former Goldman Sachs executive Raoul Pal says he&#8217;s looking at one signal that has preceded massive Bitcoin (BTC) rallies five times in the past. In a blog post, the macro guru says Bitcoin&#8217;s 30-day historical volatility just moved below 20 for the first time since the start of the year. Pal says hitting the 20 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/29/bitcoin-flashing-bullish-signal-that-previously-preceded-a-214-rally-according-to-macro-guru-raoul-pal/\">Bitcoin Flashing Bullish Signal That Previously Preceded a 214% Rally, According to Macro Guru Raoul Pal</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]