[
  {
    "source": "CoinDesk",
    "date": "2023-12-05T14:00:00.000Z",
    "title": "Flowdesk Picked by Forge to Become Marker Marker for Euro-Based Stablecoin",
    "url": "https://www.coindesk.com/markets/2023/12/05/flowdesk-picked-by-forge-to-become-marker-marker-for-euro-based-stablecoin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "EURCV isn't the first Euro stablecoin, but it has the institutional backing of Societe Generale, a major European financial institution."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-05T14:01:00.000Z",
    "title": " AI and pension funds: Is AI a safe bet for retirement investment? ",
    "url": "https://cointelegraph.com/news/ai-pension-funds-retirement-investment-adoption",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvY2EzMTY5MjMtNjRhZS00NzgzLTk5ZWItOWE4NmRmODgxNGMyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Some pensions funds that experimented with emerging assets like cryptocurrency have lost millions of dollars.</p>\n                    <p><p >Pension funds are in a perpetual crisis worldwide, with low demographic rates in many countries foreshadowing a dim future for such investments, combined with young people’s lack of faith in the continued existence of social security models.</p><p >In order to stay afloat, many pension funds have strived to remain apprised of new investment opportunities, including cryptocurrencies. According to a 2022 study <a href=\"https://trust.cfainstitute.org/report/\" target=\"_blank\" rel=\"noopener nofollow\">published</a> by the CFA Institute, “94% of state and government-sponsored pension funds are invested in one or more cryptocurrencies.”</p><p >But pension fund interest in volatile cryptocurrencies has not come without consequences.</p><p >In April 2023, Ontario Teachers’ Pension Plan (OTPP) backed off from investing in the cryptocurrency sector after <a href=\"https://cointelegraph.com/news/190b-ontario-pension-says-no-to-crypto-after-ftx-investment-collapse\">losing $95 million on its stake in FTX</a>. </p><p >Artificial intelligence (AI) and digital assets share a similar hype. </p><p >For better or for worse, this relationship could affect them. </p><p><a href=\"https://cointelegraph.com/news/ai-pension-funds-retirement-investment-adoption\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-05T14:00:00.000Z",
    "title": " Swiss city Lugano accepts Bitcoin and Tether for municipal taxes ",
    "url": "https://cointelegraph.com/news/bitcoin-accepted-taxes-swiss-lugano",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYTI1YzdjZDAtZDEyZS00NjYxLWI1OWUtMzZhMGVkOGI5NTIyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Swiss city of Lugano officially announced that it has started accepting Bitcoin and Tether as payment for taxes and all other community fees.</p>\n                    <p><p >The Swiss city of Lugano is enhancing the local adoption of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) by enabling citizens and companies to pay for municipal services and taxes with cryptocurrency.</p><p >The city of Lugano officially <a href=\"https://bitcoinsuisse.com/news/city-of-lugano-accepts-crypto-payments\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> on Dec. </p><p >Starting immediately, Lugano will accept Bitcoin and the major stablecoin, Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>), as a means of payment in an automated process through the Swiss institutional-grade cryptocurrency platform, Bitcoin Suisse.</p><p >According to the announcement, Lugano citizens and companies will be able to pay all local invoices — regardless of the nature of the service or the amount invoiced — with cryptocurrencies like Bitcoin.</p><p >Residents of Lugano are able to pay taxes or services with Bitocin through the Swiss QR-bill by scanning the code on the invoice and paying with the preferred mobile wallet and the selected cryptocurrency.</p><p >Lugano’s latest crypto move is part of <a href=\"https://cointelegraph.com/news/how-bitcoin-aligns-with-swiss-values\">Plan B, a collaborative effort with Tether</a> to use Bitcoin technology as the foundation for transforming the city’s financial system. </p><p ><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/swiss-crypto-bank-seba-amina-rebrand\"><strong><em>Swiss crypto bank Seba rebrands to Amina amid global expansion</em></strong></a></p><p >As previously reported, <a href=\"https://cointelegraph.com/news/swiss-city-of-lugano-to-pay-taxes-in-crypto-via-tether-partnership\">Lugano started adopting cryptocurrencies for tax payments</a> as part of a collaboration with Tether in March 2022. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-accepted-taxes-swiss-lugano\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-05T13:43:22.000Z",
    "title": " Italy and South Korea central banks agree on CBDC cooperation ",
    "url": "https://cointelegraph.com/news/italy-south-korea-central-banks-cbdc-cooperation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNzMxNTAyYWItZTU5Ni00OTFiLTg3NWUtNWI1MTBhOTg0MmFiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The central banks of Italy and South Korea announced a memorandum of understanding in the development and deployment of CBDCs.  </p>\n                    <p><p >Banca d’Italia — Italy’s central bank — <a href=\"https://www.bancaditalia.it/media/notizia/protocollo-d-intesa-tra-la-banca-d-italia-e-la-bank-of-korea-in-materia-di-it-e-sistemi-di-pagamento/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> on Dec. </p><p >According to the Italian central bank, the memorandum of understanding includes the “mutual sharing of knowledge and information” when it comes to information and communication technology (ICT) issues. </p><p >Specifically, it mentions ICT issues related to real-time settlement systems and <a href=\"https://cointelegraph.com/cryptocurrency-regulation-for-beginners/what-is-a-cbdc-why-central-banks-want-to-get-into-digital-currencies\">central bank digital currencies (CBDCs)</a>.</p><p >The announcement said the meeting was attended by the general manager of the Banca d’Italia, Luigi Federico Signorini, who signed off on the agreement.</p><p ><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/uk-house-of-commons-cbdc-tests-viability-risks\"><strong><em>UK House of Commons recommends further CBDC tests on viability, risks</em></strong></a></p><p >Throughout the last year, both countries have been exploring CBDCs, though with different approaches. </p><p >In Italy, the central bank has mainly been focusing on interoperability in its solutions for settling<a href=\"https://cointelegraph.com/news/bank-of-italy-selectively-encouraging-dlt-preparing-for-mica-governor-says\"> distributed ledger technology (DLT)-based transactions</a> via hash-linked contracts rather than a wholesale CBDC approach, as is the case with other European countries. </p><p >Meanwhile, South Korea started <a href=\"https://cointelegraph.com/news/cbdc-bank-of-korea-to-start-infrastructure-pilot\">piloting its CBDC infrastructure</a><a href=\"https://cointelegraph.com/news/cbdc-bank-of-korea-to-start-infrastructure-pilot\"></a> technology in October. </p><p><a href=\"https://cointelegraph.com/news/italy-south-korea-central-banks-cbdc-cooperation\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-05T13:48:23.000Z",
    "title": "Brazil’s Biggest Bank Itau Enters Cryptocurrency Trading",
    "url": "https://cryptobriefing.com/brazils-biggest-bank-itau-enters-cryptocurrency-trading/?utm_source=feed&utm_medium=rss",
    "description": "Itau the largest bank in Brazil, makes waves in the financial industry by entering the cryptocurrency market."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-05T14:06:18.000Z",
    "title": "TokenFi Set to Transform Crypto  with Multiple Mainnet Launches",
    "url": "https://www.cryptopolitan.com/tokenfi-crypto-multiple-mainnet-launches/",
    "description": "TokenFi, a notable entity in the digital asset domain, has announced a series of strategic launches that are poised to redefine user interaction with blockchain technology. The company is gearing up to introduce its staking system on two of the most prominent blockchain networks, Ethereum and BNB Chain. Scheduled to go live on December 8th, ... <a title=\"TokenFi Set to Transform Crypto  with Multiple Mainnet Launches\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tokenfi-crypto-multiple-mainnet-launches/\" aria-label=\"More on TokenFi Set to Transform Crypto  with Multiple Mainnet Launches\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-05T13:56:34.000Z",
    "title": "IBM foresees major quantum computing milestone in 2029",
    "url": "https://www.cryptopolitan.com/ibm-major-quantum-computing-milestone-2029/",
    "description": "IBM, a titan in the tech industry, has recently catapulted itself into the headlines with the revelation of its Condor quantum computing processor. Boasting an impressive 1,121 qubits, Condor emerges as not just IBM&#8217;s most substantial leap in the quantum realm but also stakes a claim as potentially the most sophisticated gate-based, superconducting quantum system ... <a title=\"IBM foresees major quantum computing milestone in 2029\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ibm-major-quantum-computing-milestone-2029/\" aria-label=\"More on IBM foresees major quantum computing milestone in 2029\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-05T13:48:06.000Z",
    "title": "ParaSpace rebrands to Parallel Finance, commits to NFT lending",
    "url": "https://www.cryptopolitan.com/paraspace-rebrands-commits-to-nft-lending/",
    "description": "In the dynamic world of decentralized finance (DeFi), change is the only constant. Embracing this, ParaSpace, a prominent player in the NFT lending arena, has announced its rebranding to Parallel Finance. This strategic shift is more than just a name change; it&#8217;s a commitment to diversifying its offerings in the DeFi ecosystem while maintaining its ... <a title=\"ParaSpace rebrands to Parallel Finance, commits to NFT lending\" class=\"read-more\" href=\"https://www.cryptopolitan.com/paraspace-rebrands-commits-to-nft-lending/\" aria-label=\"More on ParaSpace rebrands to Parallel Finance, commits to NFT lending\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-05T13:48:05.000Z",
    "title": "The IRS intensifies crypto tax investigations – How much trouble are you in?",
    "url": "https://www.cryptopolitan.com/irs-intensifies-crypto-tax-investigations/",
    "description": "The Internal Revenue Service (IRS) has significantly heightened its scrutiny of cryptocurrency transactions, leaving many individuals and businesses navigating the murky waters of potential tax liabilities. The surge in popularity of cryptocurrencies has not only caught the attention of investors and enthusiasts but has also become a focal point for tax authorities seeking to ensure ... <a title=\"The IRS intensifies crypto tax investigations &#8211; How much trouble are you in?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/irs-intensifies-crypto-tax-investigations/\" aria-label=\"More on The IRS intensifies crypto tax investigations &#8211; How much trouble are you in?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-05T13:41:24.000Z",
    "title": "How Some Asian Countries are Handling Data Privacy (Exclusive)",
    "url": "https://www.cryptopolitan.com/how-asian-countries-handling-data-privacy/",
    "description": "In today&#8217;s digital-first world, safeguarding personal data has become paramount. With the ever-growing digital footprint, nations globally are increasingly focusing on data privacy. Asia, a region known for its rapid economic growth and technological innovation, is at the front of this shift. Recent years have seen a significant surge in the development and implementation of ... <a title=\"How Some Asian Countries are Handling Data Privacy (Exclusive)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-asian-countries-handling-data-privacy/\" aria-label=\"More on How Some Asian Countries are Handling Data Privacy (Exclusive)\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-05T14:00:43.000Z",
    "title": "Shiba Inu Burn Rate Surges With Over 8 Billion SHIB Burned, Here’s The Trigger",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-8-billion-shib-burned/",
    "description": "The Shiba Inu community burn initiative may have just set a new record with the number of tokens burned in the last 24 hours. The community will undoubtedly be brimming with optimism as to the promising future of the meme coin and its ecosystem.  Over 8 Billion Shiba Inu Burned In The Last 24 Hours According to data from the burn tracking website Shibburn, over 8 billion Shiba Inu tokens have been burned in the last 24 hours. As a result of this record, the burn rate jumped by 7424294.41%. Interestingly, one transaction accounted for the bulk of the tokens burned, with 8,241,856,589 SHIB transferred to a dead wallet. Source: Shibburn This development continues a recent trend that has SHIB’s burn rate continuing to spike. Sometime last week, the token’s burn rate rose by 499,416% in a single day, with over 264.2 million SHIB tokens burned. This came after 2.7 million SHIB tokens had just been burned the previous day.  Related Reading: Bitcoin Cycle Analysis And Macro Factors Reveal When Price Will Reach $125,000 Meanwhile, the single transaction that led to 8.2 billion SHIB tokens being burned was due to the spike in network activity on Shibarium. Shiba Inu’s developer, Kaal Dhairya, noted in an X post that the layer-2 network experienced a continuous rise in gas fees, which led to exponential growth in the burn rate.  Shibarium’s Role In SHIB’s Burn Rate Shibarium’s significant role in the Shiba Inu burn rate has become evident. Notably, the Shibarium allocates a portion (70%) of the network’s base fees for SHIB burns. The spike in SHIB’s burn rate is expected to be on the rise even as Shibarium continues to enjoy greater adoption. Shiba Inu’s Marketing Lead, Lucie, had once urged the community to use Shibarium so that more SHIB could be burned.  SHIB community members seem to be now heeding her advice as the number of transactions on the network has skyrocketed recently. The layer-2 network is reported to have witnessed a transaction count spike of more than 47,000% in less than a week. In that period, Shibarium has surpassed the milestones of 5 million, 10 million, and 20 million in rapid succession. Related Reading: Crypto Analyst Predicts Bitcoin 400% Surge To $200,000, Here’s When Shibarium doesn’t seem to be slowing down anytime soon, as the total transaction count currently stands at over 35 million at the time of writing. The SHIB community will be hoping that this run continues as it is undoubtedly bullish for the meme coin’s price.  In an update posted on the Shib Blog, the correlation between Shibaroum’s transaction volume, gas fees, and Shiba Inu burns was resounded. The author noted that the burn rate would continue to grow exponentially as Shibarium experiences an increase in the number of transactions and a significant increase in gas fees.  SHIB price shows high level of volatility &#124; Source: SHIBUSD on Tradingview.com Featured image from Coinstats, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-05T14:05:38.000Z",
    "title": "Ripple’s XRP Holds Steady Amid SEC Drama and Simpson Thacher’s Role",
    "url": "https://www.crypto-news-flash.com/ripples-xrp-holds-steady-amid-sec-drama-and-simpson-thachers-role/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-xrp-holds-steady-amid-sec-drama-and-simpson-thachers-role",
    "description": "<img width=\"1280\" height=\"819\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-1024x655.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-768x491.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />XRP trades at $0.6133 and has held steady at this range for the past month, signalling accumulation among investors, despite all the uncertainty around the token and Ripple. The latest on the case is former SEC director Bill Hinman&#8217;s link to a US listing by Chinese company Weibo which was accused of financial crimes that [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-05T13:43:15.000Z",
    "title": "December’s Crypto Market Movers: Zcash, Rebel Satoshi, Polkadot Lead the Pack",
    "url": "https://www.crypto-news-flash.com/decembers-crypto-market-movers-zcash-rebel-satoshi-polkadot-lead-the-pack/?utm_source=rss&utm_medium=rss&utm_campaign=decembers-crypto-market-movers-zcash-rebel-satoshi-polkadot-lead-the-pack",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-33.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-33.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-33-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-33-343x215.jpg 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-33-326x205.jpg 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-33-163x102.jpg 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Zcash (ZEC) is predicted to rise above $31 in December, backed by ecosystem growth.  Rebel Satoshi sells more than $32 million $RBLZ during Rebels Round 1 as investors eye 150% profits.  Polkadot gears for DOT 2.0 as experts predict a price surge above $6.  With the rally witnessed by the market in November 2023, investors [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-05T13:47:20.000Z",
    "title": "BlackRock’s Strategic Bitcoin Accumulation Amid Bear Market",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/blackrocks-strategic-bitcoin-accumulation-amid-bear-market/",
    "description": "<p>Institutional investors have been cautiously exploring opportunities to enter the cryptocurrency market. BlackRock&#8217;s approach stands out as a case study in strategic accumulation. And a testament to the confidence some major players have in the long-term viability of Bitcoin. Let&#8217;s explore how this happened. BlackRock &#38; Coinbase Partnership to Buy Bitcoin BlackRock&#8217;s foray into the [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/blackrocks-strategic-bitcoin-accumulation-amid-bear-market/\">BlackRock&#8217;s Strategic Bitcoin Accumulation Amid Bear Market</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-05T13:58:00.000Z",
    "title": "Stacks (STX) Rises 40%, Becomes Top Gainer Out of Top 50 Coins",
    "url": "https://coinedition.com/stacks-stx-rises-40-becomes-top-gainer-out-of-top-50-coins/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Calling-the-bottom-here-on-STX.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"STX’s price\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Calling-the-bottom-here-on-STX.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Calling-the-bottom-here-on-STX-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Calling-the-bottom-here-on-STX-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Calling-the-bottom-here-on-STX-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Calling-the-bottom-here-on-STX-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Calling-the-bottom-here-on-STX-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The price of Stacks (STX) increased by 40.64% in the last 24 hours as the broader market rally continued to hold. STX’s price was $1.20 at the time of writing, CoinMarketCap data revealed. This value represents a 90.53% hike in the last seven days, making it the 43rd most valuable cryptocurrency per market cap and [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/stacks-stx-rises-40-becomes-top-gainer-out-of-top-50-coins/\">Stacks (STX) Rises 40%, Becomes Top Gainer Out of Top 50 Coins</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-05T13:40:36.000Z",
    "title": "Big Time (BIGTIME) Price Prediction 2023-2030: Will BIGTIME Price Hit $2 Soon?",
    "url": "https://coinedition.com/big-time-bigtime-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Big-Time-(BIGTIME)-PRICE-PREDICTION\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>What is Big Time (BIGTIME)? Big Time is a free-to-play action-adventure massive multiplayer online role-playing game (MMORPG) powered by “Openloot,” a provider of decentralized solutions for web3 games, offering marketplaces, NFT management platforms, and support services. The blockchain-based game offers players a chance to earn NFT rewards and BIGTIME tokens as they embark on their [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/big-time-bigtime-price-prediction/\">Big Time (BIGTIME) Price Prediction 2023-2030: Will BIGTIME Price Hit $2 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]