[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-19T23:00:03.000Z",
    "title": "Proof of Talk 2023: Restoring Trust in the Web3 Industry",
    "url": "https://news.bitcoin.com/proof-of-talk-2023-restoring-trust-in-the-web3-industry/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/21312e1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/21312e1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/21312e1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/21312e1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/21312e1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/21312e1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/21312e1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/21312e1-1280x720.jpg 1280w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/21312e1.jpg 1515w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Paris, June 19th 2023 – Over 1,500+ attendees, VCs, founders, start-ups, industry leaders, students, developers coming from Asia, Europe and the US gathered in Paris for the Proof of Talk Summit. In a rapidly evolving and challenging crypto landscape, they discussed the pressing issues and opportunities to shape a better future for the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T23:05:20.000Z",
    "title": "Binance Initiates BTC Wallet Migration, Triggers Significant On-Chain Transfers",
    "url": "https://www.cryptopolitan.com/binance-initiates-btc-wallet-migration/",
    "description": "Binance, one of the world&#8217;s largest cryptocurrency exchanges, has announced its intention to transfer funds from its previous Bitcoin (BTC) cold wallet to a new address, leading to notable on-chain BTC transfers. This move comes as part of Binance&#8217;s commitment to bolster the security and infrastructure of its BTC holdings, prompting significant attention from market ... <a title=\"Binance Initiates BTC Wallet Migration, Triggers Significant On-Chain Transfers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-initiates-btc-wallet-migration/\" aria-label=\"More on Binance Initiates BTC Wallet Migration, Triggers Significant On-Chain Transfers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T22:52:54.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T22:49:45.000Z",
    "title": "Slovakia Codifies Citizens’ Right to Cash Amidst Digital Euro Debate",
    "url": "https://www.cryptopolitan.com/slovakia-codifies-citizens-right-to-cash/",
    "description": "In a move to safeguard financial sovereignty and protect citizens&#8217; payment options, Slovakia&#8217;s parliament has passed a groundbreaking amendment to its constitution, officially codifying the right of its citizens to use cash as a method of payment. The legislation, sponsored by the &#8220;We Are Family&#8221; party, aims to counteract the potential implementation of a digital ... <a title=\"Slovakia Codifies Citizens&#8217; Right to Cash Amidst Digital Euro Debate\" class=\"read-more\" href=\"https://www.cryptopolitan.com/slovakia-codifies-citizens-right-to-cash/\" aria-label=\"More on Slovakia Codifies Citizens&#8217; Right to Cash Amidst Digital Euro Debate\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-19T23:00:38.000Z",
    "title": "Ethereum Eyes Dramatic Shift: Proposes Validator Limit Increase From 32 To 2048 ETH",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-eyes-dramatic-shift-proposes-validator-limit/",
    "description": "Ethereum, the second-largest blockchain by market capitalization, could be on the cusp of a significant operational shift. In the latest Ethereum core developer consensus meeting, a key agenda item under discussion was a proposed increase in the maximum validator limit. If implemented, this adjustment would see the limit skyrocket from the current 32 ETH to 2,048 ETH per validator. Currently, validators in Ethereum&#8217;s network maintain a balance cap set at both the minimum and maximum of 32 ETH. Those managing large-scale staking operations, consequently, must establish multiple validators to earn yield beyond this limit. As such, the result is a significant growth in the number of validators, with the current count reaching 600,000 active validators and an additional 90,000 on standby. Streamlining For Optimization Michael Neuder, an Ethereum Foundation researcher and a primary advocate of this change, argues that the proposed increase would alleviate the pressures caused by the expanding validator set size. Related Reading: Ethereum Cancun Upgrade: Why Arbitrum, Optimism Will Profit Massively Neuder highlighted that the current validator cap does support decentralization, but it simultaneously leads to an inflation of the validator set size. This increasing size eventually enhances the system&#8217;s performance by expediting the conclusion within a solitary Ethereum slot. In addition, Neuder pointed out the prospect of auto-compounding validator rewards brought on by this change. Given the current restrictions, any rewards earned beyond the 32 ETH cap must be averted to other places to generate any staking yield. With a raised cap, these rewards could be compounded instantaneously, enabling validators to reap greater benefits from their staked ETH. Impact On Large-Scale Operators And Associated Risks The proposal also aims to address the procedural challenges encountered by major node managers, such as exchanges like Coinbase, that presently supervise multitudes of validators due to the standing 32 ETH constraint per validator. If the cap were to be elevated, such operators could manage fewer validators with higher stakes, which could potentially simplify operations. However, Neuder cautioned about the risks tied to this proposed change. For instance, the increase could potentially lead to steeper penalties for inadvertent double attestations or proposals, also known as &#8220;slashing.&#8221; This highlights the importance of considering all possible implications in the path toward improving network efficiency and validator rewards. Notably, as Ethereum continues to evolve, this potential change in the validator limit serves as a critical discussion point in the broader conversation about the platform&#8217;s future. Related Reading: Ethereum Price Prints Bullish Technical Pattern, Why Close Above $1,780 Is Critical Meanwhile, Ethereum is down 1% in the past week amid the industry&#8217;s current condition. The second-largest crypto asset by market capitalization has recorded a downward movement, also falling by 1.1% in the past 24 hours. At the time of writing, ETH trades above $1,700 after moving below that price range to trade at the $1,600 region last week. ETH&#8217;s trading volume has plummeted over the past 7 days from above $7 billion last Monday to below $4 billion in the past 24 hours, indicating a decline in trading activity. Featured image from Shutterstock, chart from TradingView"
  }
]