[
  {
    "source": "CoinDesk",
    "date": "2023-07-31T09:33:24.000Z",
    "title": "HSBC-Owned Hang Seng Bank Limits Crypto Companies to ‘Simple’ Accounts: Report",
    "url": "https://www.coindesk.com/business/2023/07/31/hsbc-owned-hang-seng-bank-limits-crypto-companies-to-simple-accounts-report/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The report comes as Hong Kong’s Monetary Authority (HKMA) reminds banks that there is no ban on offering crypto companies accounts."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-31T09:25:19.000Z",
    "title": "Curve Finance's Token Surges 500% on Bithumb After Over $100M Exploit",
    "url": "https://www.coindesk.com/markets/2023/07/31/curve-finances-token-surges-500-on-bithumb-after-over-100m-exploit/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The CRV/KRW pair listed on South Korea's Bithumb exchange has decoupled from the CRV/USD pairs listed on Western exchanges that exhibit price weakness."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-31T09:18:04.000Z",
    "title": "Trader Turns $500 to Million-Dollar Fortune With BALD Memecoin on Coinbase’s Blockchain",
    "url": "https://www.coindesk.com/markets/2023/07/31/trader-turns-500-to-million-dollar-fortune-with-bald-memecoin-on-coinbases-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A meme coin frenzy has ensued on Coinbase’s layer 2 blockchain even as the network is not officially live yet."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-31T09:15:42.000Z",
    "title": "Binance's Activities Are Illegal in Nigeria, Securities Regulator Says",
    "url": "https://www.coindesk.com/policy/2023/07/31/binances-activities-are-illegal-in-nigeria-securities-regulator-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The regulator also ordered all crypto platform providers to stop reaching out to Nigerian investors."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-31T09:30:00.000Z",
    "title": "Borneo authorities seize illegal crypto miners running off stolen power",
    "url": "https://cointelegraph.com/news/malaysia-authorities-seize-illegal-crypto-miners",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/0c06d2da-f4c5-4de8-b785-8436e7564130.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A Malaysian energy supplier uncovered an illegal cryptocurrency mining operation that was stealing power from the local grid on the island nation of Borneo. </p>\n                    <p><p>Authorities in the town of Miri on the island of Borneo shut down an illegal cryptocurrency mining operation and seized equipment following a tip off from the public.</p><p>According to local news outlet <a href=\"https://www.theborneopost.com/2023/07/27/power-theft-operation-in-miri-uncovers-crypto-mining-activities/\" target=\"_blank\" rel=\"noopener nofollow\">Borneo Post</a>, Sarawak Energy discovered the operation, which included 34 cryptocurrency mining servers that were operating using stolen electricity through cable tapping.</p><p>Authorities seized all the equipment used in the operation, including servers and tapping cables, while local police are now investigating the latest mining operation to be taken down on the island.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/b291ba2d-fcc6-4195-8002-5824ac126a04.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Cryptocurrency mining servers found at a shophouse in Marina Square, Miri. Source: Borneo Post</em></figcaption></figure><p>Sarawak Energy estimated that the operation was utilizing around 6,000 ringgit a month ($1300) worth of stolen electricity. An announcement from the utility noted that although Sarawak offers some of the lowest energy prices in Malaysia, energy theft remains an issue.</p><p>Another public tip-off earlier in 2023 saw over 137 cryptocurrency mining servers seized by authorities in the state of Senadin, in which Miri is located. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-800000-block-mined\"><strong><em>Related: Bitcoin block 800,000 mined — What’s next?</em></strong></a></p><p>As Cointelegraph recently <a href=\"https://cointelegraph.com/news/bitcoin-miners-bullish-despite-bear-market-hut8-foundry-braiins\">explored</a>, Bitcoin (BTC) miners continue to weather a prolonged bear market that has put many operations under strain. This in turn has led to a number of mining firms and operators to <a href=\"https://cointelegraph.com/news/bitcoin-miners-send-record-inflows-to-exchanges\">sell BTC in record numbers</a> over the past couple of months.</p><p>The Bitcoin mining ecosystem has also recorded a number of important metrics, with the<a href=\"https://cointelegraph.com/news/bitcoin-hash-rate-taps-new-milestone-with-miner-hodling-at-1-year-low\"> network hash rate hitting all-time highs</a> in 2023 which has coincided with corresponding highs for network difficulty.</p><p>While this typically indicates that the Bitcoin network is at its most resilient with a record number of miners competing for block rewards while securing the network, it also places strain on smaller operators that do not have the economies of scale of larger operations.</p><p>Furthermore, operators that have lower electricity prices also stand to be more profitable, which is another driving factor behind the propensity for illegal mining operators to steal electricity from the grid. This removes the electricity running costs of mining, which means illegal operators can bank profits to pay off hardware.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/malaysia-authorities-seize-illegal-crypto-miners&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><em><a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\"><strong>Magazine: Bitcoin is on a collision course with ‘Net Zero’ promises</strong></a></em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-31T09:10:48.000Z",
    "title": "BTC price ‘fireworks’ after monthly close? 5 things to know in Bitcoin this week",
    "url": "https://cointelegraph.com/news/btc-price-monthly-close-5-things-bitcoin-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/cd566f5f-b380-4aa5-98c5-835d8920b613.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin may finally get a trend identity after the July monthly close is done, one trader suggests, with BTC price action wedged below $30,000.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) heads into a new week, with a new monthly close still stuck in one of its narrowest-ever ranges.</p><p>Acting in an area just below $30,000, BTC price performance has frustrated or simply bored traders over the past week — could a breakout come next?</p><p>This is the question on every market participant’s mind as the week begins with the July monthly close and the chance for associated volatility.</p><p>While some believe that Bitcoin is, in fact, overdue for a comedown, data suggests that buying pressure is returning at current levels. Add to that a potential long-term bull flag due to confirm on the monthly close, and all might not be so bad for Bitcoin bulls.</p><p>As a quiet macro week shifts the focus to other potential price triggers for crypto, Cointelegraph takes a look at the major topics for moving markets in the coming days and beyond.</p><h2>Sticky BTC price range could shift after July monthly close</h2><p>Bitcoin was infamously stable last week, with not even the United States interest rate hike and accompanying macroeconomic data <a href=\"https://cointelegraph.com/news/btc-price-pce-data-bitcoin-traders-28k\">managing to shift its tiny trading range</a>.</p><p>BTC price observers have had to console themselves with a corridor between $29,000 and $29,500 — one which is still in force at the time of writing, as per data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/66d086af-0f91-405f-9e98-293ffd3e6f6f.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><p>While the weekly close did offer some snap moves up and down, a short-term trend remains conspicuously lacking. </p><p>On the radar next is the monthly close, which is currently due to see BTC/USD lock in monthly losses of 3.5%.</p><p>“The market is going to try to shake you out as we move to and thru the Monthly close,” monitoring resource Material Indicators <a href=\"https://twitter.com/MI_Algos/status/1685760882830196738/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in part of its latest commentary.</p><p>An accompanying chart of the BTC/USD order book on the largest global crypto exchange Binance showed the current trading range clearly defined with bid and ask liquidity.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/c36d7819-387a-4379-b94e-63e4657c15bf.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD order book data on Binance. Source: Material Indicators/Twitter</em></figcaption></figure><p>On the topic of liquidity, popular trader Daan Crypto Trades delineated the significant levels to watch on low timeframes.</p><p>“The ~29K and ~29.6K levels correspond nicely with out current low timeframe range so good to keep watching those regions,” he <a href=\"https://twitter.com/DaanCrypto/status/1685682160936624128\" target=\"_blank\" rel=\"noopener nofollow\">told</a> Twitter followers prior to the weekly close alongside data from CoinGlass.</p><p>CoinGlass likewise <a href=\"https://www.coinglass.com/today\" target=\"_blank\" rel=\"noopener nofollow\">showed</a> that, historically, July had been a “green” month for Bitcoin for the past six years, with the exception of 6.6% losses in 2019.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/b32f16d6-bae3-44a8-837f-64ca8e829e63.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD monthly returns chart (screenshot). Source: CoinGlass</em></figcaption></figure><p>Fellow trader Jelle, meanwhile, predicted that the coming week would form the lull before the storm for markets.</p><p>“Expecting this week to be slow, but fireworks to start next week. Preparing accordingly,” he <a href=\"https://twitter.com/CryptoJelleNL/status/1685915355472920577/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a>, adding that he was already accumulating BTC.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/d53eae26-0a00-4a3f-857a-0a23d8150573.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Jelle/Twitter</em></figcaption></figure><h2>MACD signal forms key Bitcoin bull argument</h2><p>Despite being on course to close July at a loss, Bitcoin is exciting traders on monthly timeframes for another reason.</p><p>The moving average convergence/divergence (MACD) indicator is due to confirm a bullish crossover which traditionally precedes periods of protracted BTC price upside.</p><p>MACD uses exponential moving averages (EMAs) to plot two lines on an asset’s price chart, and their interplay can form useful advance buy and sell signals.</p><p>As various market participants noted over the past week, the monthly close is still due to lock in a bullish EMA cross on the one-month BTC/USD chart.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> is 1.5 days away from locking in a monthly bullish MACD cross  <a href=\"https://t.co/aV2vCmWOaJ\">pic.twitter.com/aV2vCmWOaJ</a></p>&mdash; Jelle (@CryptoJelleNL) <a href=\"https://twitter.com/CryptoJelleNL/status/1685633151022874624?ref_src=twsrc%5Etfw\">July 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As Cointelegraph <a href=\"https://cointelegraph.com/news/bitcoin-bull-flag-repeat-btc-price-freezes\">reported</a>, trading resource Stockmoney Lizards has already compared the potential impact of the upcoming cross to a similar event in late 2015, when Bitcoin was preparing the ground for its run to old all-time highs two years later.</p><p>Now, it is not just monthly, but also daily MACD improving prospects for bulls.</p><p>On one-day timeframes, analyst Kevin Svenson <a href=\"https://twitter.com/KevinSvenson_/status/1685273297720590336/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">described</a> both MACD and relative strength index (RSI) as being “in a peculiar position” due to the lack of momentum.</p><p>“We are entering the usual ‘completion zone’ where the market makes a move. Sentiment is extremely neutral right now,” he added in Twitter comments.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/98b127f3-89be-4bb2-9ab9-b6fa83ae26a5.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD chart with MACD and RSI data. Source: Kevin Svenson/Twitter</em></figcaption></figure><p>A <a href=\"https://cointelegraph.com/news/bitcoin-s-weekly-macd-just-crossed-bullish-for-the-first-time-in-11-months\">weekly MACD cross in August 2021</a> meanwhile came as Bitcoin headed to its current all-time highs of $69,000 which it saw just three months later.</p><h2>U.S. jobs data follows hectic macro week</h2><p>An altogether calmer week for macroeconomic data means less of a chance that risk assets, including crypto, will find something to react to.</p><p>Nonetheless, unemployment data will form the focus for the mood in the U.S., this following repeated signals that inflation is both abating and that the labor market has taken the inflationary cycle in its stride.</p><p>“A lot of important jobs data this week,” financial commentary resource The Kobeissi Letter summarized.</p><p>Kobeissi noted that around one quarter of S&amp;P 500 firms were due to report earnings over the week.</p><p>“Economic data remains incredibly important as the Fed determines what to do in Sept,” it added, referencing the impact of data on Federal Reserve interest rate decisions.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Key Events This Week:<br><br>1. ISM Manufacturing data - Tuesday<br><br>2. JOLTS Jobs data - Tuesday<br><br>3. ADP Payrolls data - Wednesday<br><br>4. Jobless Claims data - Thursday<br><br>5. July Jobs report - Friday<br><br>6. ~25% of S&amp;P 500 companies reporting earnings<br><br>A lot of important jobs data this week.</p>&mdash; The Kobeissi Letter (@KobeissiLetter) <a href=\"https://twitter.com/KobeissiLetter/status/1685666187730935808?ref_src=twsrc%5Etfw\">July 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Elsewhere, U.S. dollar strength was tipped to take a fresh downturn, having rebounded as the Fed hiked rates last week after a June pause.</p><p>For investor and trader Miles Johal, 102 formed formidable resistance for the U.S. dollar index (DXY), and Bitcoin should benefit as a result.</p><p>“Expect HTF bullish action from $BTC and other risk assets while the DXY continues this downtrend,” part of his latest social media analysis read.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">DXY at first key resistance of 102.<br><br>Roll over for another lower high here or the trendline above is still unbroken at this time.<br><br>Expect HTF bullish action from <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> and other risk assets while the DXY continues this downtrend. <a href=\"https://t.co/p45kPYxPvS\">https://t.co/p45kPYxPvS</a> <a href=\"https://t.co/nMlfPd4gqt\">pic.twitter.com/nMlfPd4gqt</a></p>&mdash; Miles (@JohalMiles) <a href=\"https://twitter.com/JohalMiles/status/1685603053884379136?ref_src=twsrc%5Etfw\">July 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Stablecoin investors \"load up\" with Bitcoin under $30,000</h2><p>Last week was all about the percentage of the BTC supply now in the hand of long-term holders — <a href=\"https://cointelegraph.com/news/bitcoin-mining-difficulty-drop-2023-5-things-this-week\">an all-time high of 75%</a>.</p><p>Now, investors appear to be anticipating new volatility by accumulating stablecoins into the monthly close.</p><p>As <a href=\"https://twitter.com/santimentfeed/status/1685895040558899200?s=12&amp;t=9Z7eZQ2MAn7cgruZycHUFw\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> by research firm Santiment, the trend is visible across multiple stablecoins, including the two largest — Tether (USDT) and USD Coin (USDC).</p><p>“Key whale &amp; shark stablecoin wallets appear to be loading up during Bitcoin's visit below $30k here at the end of the month. Tether, USDCoin, BinanceUSD, &amp; Dai are all seeing supply shifting into these key wallets,” it revealed alongside a chart showing the latest flows.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/363e0a6d-2693-4d58-a51e-d15f84638113.png\"  /><figcaption style=\"text-align: center;\"><em>Stablecoin accumulation annotated chart. Source: Santiment/Twitter</em></figcaption></figure><p>The move comes as stablecoin accumulation itself preempts a return to upside for BTC price. Last week, it was exchange Bitfinex in the spotlight.</p><p>“Bitfinex Bitcoin to stables ratio blows up in advance of every big bull move. A major leading indicator,” market cyclist and on-chain analyst Cole Garner <a href=\"https://cointelegraph.com/news/bitcoin-bull-next-bitfinex-stablecoin-ratio\">said</a> at the time.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/06c9ce1b-89a2-4fc2-85c7-5c51dd23cc5c.png\"  /><figcaption style=\"text-align: center;\"><em>Bitfinex stablecoin ratio annotated chart. Source: Cole Garner/Twitter</em></figcaption></figure><h2>Whale wallet numbers hit 4-month low</h2><p>At the same time, Cointelegraph has been reporting on interesting shifts in whales’ BTC exposure.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-interview-charles-edwards\">BlackRock ETF will be ‘big rubber yes stamp’ for Bitcoin — Charles Edwards</a></em></strong></p><p>The largest-volume investor cohort has been undergoing what on-chain analytics firm Glassnode called “noteworthy” changes, with <a href=\"https://cointelegraph.com/news/bitcoin-whale-exchange-inflow-1-year-high\">net exposure down 255,000 BTC</a> since May 30.</p><p>The number of wallets holding 1,000 BTC ($294 million) or more now bears this out, with Glassnode recording the lowest such wallet numbers in four months.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/4eaad255-bb18-4502-a422-7ebc3a93ba8c.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin wallets holding at least 1,000 BTC chart. Source: Glassnode/Twitter</em></figcaption></figure><p>As of July 31, there were 2,006 wallets with a balance of at least 1,000 BTC, down by around 35 since the start of July.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/cad9fa69-22d6-4bc6-80bc-0b4262b440fd.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin wallets holding at least 0.01 BTC chart. Source: Glassnode/Twitter</em></figcaption></figure><p>By contrast, wallets with at least 0.01 BTC ($294) hit new all-time highs of 12,214,918 on the same day.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/btc-price-monthly-close-5-things-bitcoin-this-week&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/tokenizing-music-royalties-nfts-taylor-swift-3lau-nas-the-weeknd/\">Tokenizing music royalties as NFTs could help the next Taylor Swift</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-31T09:24:32.000Z",
    "title": "Curve Finance TVL falls over $1B following Vyper vulnerability exploit",
    "url": "https://cryptoslate.com/curve-finance-tvl-halved-following-vyper-vulnerability-exploit/",
    "description": "<p>The total value of assets locked on decentralized finance protocol Curve Finance (CRV) plunged nearly 50% in the last 24 hours to $1.731 billion from $3.26 billion recorded on July 30, according to DeFiLlama data. The exodus can be attributed to an exploit of the protocol, which increased fears of liquidation and bad debt among [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/curve-finance-tvl-halved-following-vyper-vulnerability-exploit/\">Curve Finance TVL falls over $1B following Vyper vulnerability exploit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-31T09:29:14.000Z",
    "title": "$XRP: Wells Fargo Manager Says ‘My Price Prediction Is Anywhere From $100 – $500 Near Short Term’",
    "url": "https://www.cryptoglobe.com/latest/2023/07/xrp-wells-fargo-manager-says-my-price-prediction-is-anywhere-from-100-500-near-short-term/",
    "description": "On July 30, 2023, Shannon Thorpe, a Business Support Manager at Wells Fargo, shared her unique perspective on the future of XRP, the digital asset used in the Ripple payment protocol. Her insights, which she shared on social media, have sparked a lively debate among the XRP community, often referred to as the “XRP Army”. […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-31T09:30:34.000Z",
    "title": "Japan Blockchain Association Urges Tokyo to Overhaul Crypto Tax System",
    "url": "https://news.bitcoin.com/japan-blockchain-association-urges-tokyo-to-overhaul-crypto-tax-system/",
    "description": "<img width=\"768\" height=\"431\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1081483814-768x431.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Japan Blockchain Association Urges Tokyo to Overhaul Crypto Tax System\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1081483814-300x168.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1081483814-1024x575.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1081483814-768x431.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1081483814-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1081483814-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1081483814-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1081483814-1280x720.jpg 1280w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1081483814.jpg 1282w\" sizes=\"(max-width: 768px) 100vw, 768px\" />An industry organization in Japan has suggested that the government should reform taxation rules for crypto assets and transactions. Its members are convinced that the current tax regulations hinder growth of the Web3 economy in the country and discourage taxpayers from holding and using cryptocurrencies. Japan Government Asked to Amend Tax Laws for Crypto Gains [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T09:19:21.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? Today&#8217;s Aave price is $71.16, with a 24-hour trading volume of $86,293,738. Aave is down 3.77% in the last 24 hours. The current CoinMarketCap ranking is #43, with a live market cap of $1,032,533,351. It has a circulating supply of 14,490,869 AAVE coins and a ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T09:16:37.000Z",
    "title": "Robert Kiyosaki calls WSJ ‘numb nuts’ for claiming the US economy is strong",
    "url": "https://www.cryptopolitan.com/robert-kiyosaki-calls-wsj-numb-nuts/",
    "description": "Robert Kiyosaki, the Rich Dad Poor Dad author, has explained in a Twitter post that he disapproves of Wall Street Journal(WSJ) claims that the U.S. economy was strong. He explained that the stock market is only up due to Joe Biden, the U.S. president, raising the debt ceiling. Kiyosaki continued, calling them &#8216;numb nuts&#8217; for ... <a title=\"Robert Kiyosaki calls WSJ &#8216;numb nuts&#8217; for claiming the US economy is strong\" class=\"read-more\" href=\"https://www.cryptopolitan.com/robert-kiyosaki-calls-wsj-numb-nuts/\" aria-label=\"More on Robert Kiyosaki calls WSJ &#8216;numb nuts&#8217; for claiming the US economy is strong\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T09:16:02.000Z",
    "title": "Curve Finance hacker returns part of stolen funds",
    "url": "https://www.cryptopolitan.com/curve-finance-hacker-returns-part-of-stolen-funds/",
    "description": "On July 30, Curve Finance, a prominent stablecoin lending protocol, experienced a significant exploit on several stable pools. The exploit was traced back to vulnerabilities in specific versions of the Vyper compiler, a smart contract programming language for the Ethereum Virtual Machine (EVM), Cryptopolitan reported. However, the affected versions were 0.2.15, 0.2.16, and 0.3.0. The ... <a title=\"Curve Finance hacker returns part of stolen funds\" class=\"read-more\" href=\"https://www.cryptopolitan.com/curve-finance-hacker-returns-part-of-stolen-funds/\" aria-label=\"More on Curve Finance hacker returns part of stolen funds\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T09:14:53.000Z",
    "title": "Worldcoin Price Prediction 2023 – 2030: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, ... <a title=\"Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/worldcoin-price-prediction/\" aria-label=\"More on Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-31T09:19:03.000Z",
    "title": "DOJ Seeks Revocation of Sam Bankman-Fried’s Bail, Alleges Tampering with Witnesses and Leaking of Caroline Ellison’s Diary – Details",
    "url": "https://www.crypto-news-flash.com/doj-seeks-revocation-of-sam-bankman-frieds-bail-alleges-tampering-with-witnesses-and-leaking-of-caroline-ellisons-diary-details/?utm_source=rss&utm_medium=rss&utm_campaign=doj-seeks-revocation-of-sam-bankman-frieds-bail-alleges-tampering-with-witnesses-and-leaking-of-caroline-ellisons-diary-details",
    "description": "<img width=\"1280\" height=\"960\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/01/law-1063249_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"law lawsuit court\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/01/law-1063249_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2021/01/law-1063249_1280-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/01/law-1063249_1280-1024x768.jpg 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The US Department of Justice (DOJ) seeks to revoke Sam Bankman-Fried&#8217;s bail, accusing him of witness tampering and leaking Caroline Ellison&#8217;s diary. SBF&#8217;s use of encrypted messaging app Signal raises concerns about potential obstruction and intimidation of witnesses. In a recent court filing reported by Cointelegraph on July 28, 2023, the United States Department of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-31T09:15:33.000Z",
    "title": "Solana Turns Bearish – Price Projections for SOL, $ROE, and BCH in 2023",
    "url": "https://www.crypto-news-flash.com/solana-turns-bearish-price-projections-for-sol-roe-and-bch-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=solana-turns-bearish-price-projections-for-sol-roe-and-bch-in-2023",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T095307.739.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T095307.739.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T095307.739-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T095307.739-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T095307.739-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T095307.739-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The recent bearish performance of both Solana (SOL) and Bitcoin Cash (BCH) has prompted investors to look for more stable and profitable projects, looking to Borroe ($ROE) as the token with the highest growth potential. This crypto newcomer has managed to outshine even the most prominent players, offering unmatched real-world utility and up to 300% [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-31T09:26:17.000Z",
    "title": "Debunking the Top 3 Myths of the Crypto Industry",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/debunking-the-top-3-myths-of-the-crypto-industry/",
    "description": "<p>Alongside its rapid rise in popularity, the crypto industry has become a breeding ground for numerous myths and misconceptions. These myths often circulate in the media and are perpetuated by uninformed individuals, leading to confusion and skepticism among potential investors and enthusiasts. In this article, we will explore and debunk the three most popular myths [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/debunking-the-top-3-myths-of-the-crypto-industry/\">Debunking the Top 3 Myths of the Crypto Industry</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-31T09:15:44.000Z",
    "title": "Here’s How Altcoins Could Regain Bullish Momentum, According to Analyst Michaël van de Poppe",
    "url": "https://dailyhodl.com/2023/07/31/heres-how-altcoins-could-regain-bullish-momentum-according-to-analyst-michael-van-de-poppe/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/09/altcoins-surge-defiance.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/09/altcoins-surge-defiance.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/09/altcoins-surge-defiance.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/09/altcoins-surge-defiance.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/09/altcoins-surge-defiance.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/09/altcoins-surge-defiance.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/09/altcoins-surge-defiance.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist is outlining a scenario where the broader altcoin markets could escape their recent price doldrums. Analyst Michaël van de Poppe tells his 661,200 Twitter followers that altcoins could rally if Bitcoin (BTC) breaks above the psychological level of $30,000 and retests it as support. &#8220;Still basically the same gameplan on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/31/heres-how-altcoins-could-regain-bullish-momentum-according-to-analyst-michael-van-de-poppe/\">Here’s How Altcoins Could Regain Bullish Momentum, According to Analyst Michaël van de Poppe</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]