[
  {
    "source": "Crypto Daily",
    "date": "2023-08-01T07:45:00.000Z",
    "title": "Upbit Suspends CRV Transactions Following Curve Finance Exploit",
    "url": "https://cryptodaily.co.uk/2023/08/upbit-suspends-crv-transactions-following-curve-finance-exploit",
    "description": "<p>Upbit, the largest cryptocurrency exchange in South Korea, has temporarily suspended CRV withdrawals and deposits after Curve fell victim to a significant exploit.&nbsp;</p>\n<p>Other exchanges have been keeping track of the situation but have not initiated any action as of now.&nbsp;</p>\nThe Curve Finance Exploit&nbsp;\n<p>Curve Finance tweeted over the weekend that the protocol had fallen victim to an exploit. The protocol stated that over $100 million worth of cryptocurrency was at risk thanks to a reentrancy bug in Vyper, the programming language used to power parts of the larger Curve ecosystem. As a result, several stablecoin pools used in the pricing and liquidity of several DeFi projects were drained by hackers.&nbsp;</p>\n\n<p>&ldquo;A number of stablepools (alETH/msETH/pETH) using Vyper 0.2.15 have been exploited as a result of a malfunctioning reentrancy lock. We are assessing the situation and will update the community as things develop.&rdquo;</p>\n\n<p>In another tweet on Monday, the protocol listed out the hacked pools. It also stated that the Arbitrum trycrypto pool could also have been compromised during the hack.&nbsp;</p>\n\n<p>&ldquo;As a result of an issue in Vyper compiler in versions 0.2.15-0.3.0, the following pools were hacked: crv/eth aleth/eth mseth/eth peth/eth Another pool potentially affected is arbitrum&rsquo;s tricrypto. Auditors and Vyper devs could not find a profitable exploit, but please exit that one.&rdquo;</p>\n\n<p>Re-entrancy attacks are a fairly common exploit, allowing hackers to trick smart contracts by making repeated calls to the protocol and stealing user assets. A call is basically an authorization for a smart contract address to interact with a user&rsquo;s wallet address.&nbsp;</p>\nUpbit Suspends CRV Withdrawals And Deposits&nbsp;\n<p>Following the exploit, Upbit, the largest cryptocurrency exchange in South Korea, announced it was temporarily suspending the withdrawal and deposit of Curve Finance&rsquo;s native CRV token. The suspension was announced by Chinese crypto reporter Wu Blockchain on Twitter, who stated,&nbsp;</p>\n\n<p>&ldquo;South Korea&rsquo;s largest exchange, Upbit, announced that due to the attack on some of Curve&rsquo;s stablecoin pools, CRV volatility is high, and Curve (CRV) deposit and withdrawal services have been suspended.&rdquo;</p>\n\n<p>The Upbit exchange, in its announcement, stated it had detected several vulnerabilities in some stablecoin pools associated with Curve Finance, leading to the CRV token experiencing considerable volatility. It added that it was temporarily suspending CRV deposits and withdrawals.&nbsp;</p>\n\n<p>&ldquo;Today, certain vulnerabilities have been discovered in some of the stablecoin pools associated with Curve (CRV). As a result, CRV is currently experiencing significant volatility. We advise exercising caution when considering any investments related to CRV. To ensure the safety of digital asset transactions, we have temporarily suspended deposits and withdrawals for CRV.&rdquo;</p>\n\n<p>The hack has resulted in a loss of over $100 million for the protocol, with the CRV token down over 12%.&nbsp;</p>\nOther Exchanges Keeping Tabs\n<p>While Upbit has swung into action and suspended CRV deposits and withdrawals, other prominent exchanges have adopted a wait-and-watch approach. Upbit has also urged users to exercise caution when considering any investments related to CRV. OKX, another prominent exchange, issued a warning for users on the token&rsquo;s landing page, telling users the exchange would not be responsible for any losses incurred while trading the CRV token.&nbsp;</p>\n<p>Meanwhile, Binance head Changpeng Zhao stated that Binance users were unaffected by the exploit in Curve.&nbsp;</p>\n\n<p>&ldquo;CEX price feed saves DeFi. Binance users are not affected. Our team checked on the Vyper Reentrant Vulnerability. We only use version 0.3.7 or above.&rdquo;</p>\n\n<p>Zhao explained that Binance&rsquo;s use of a centralized price feed for DeFi tokens adds an extra layer of security. Zhao also insisted on updating applications, code libraries, and operating systems.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T07:59:26.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T07:53:18.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for decoupling on-chain and off-chain trading activity. There was evidence that, unlike traditional financial markets, cryptocurrency volatility is not associated with market downturns. Observers also noted that, after gaining widespread attention and with ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T07:41:27.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 How much is LTC worth? The current price of Litecoin stands at $90.5. Over the past 24 hours, it has experienced a trading volume of $1.72B and a market capitalization of $6.71B. Litecoin’s market dominance is at 0.55%. However, there has been a decrease in the LTC price by 1.94% within ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-01T07:45:41.000Z",
    "title": "Ethereum DeFi Coins Plunge As Curve Concerns Threaten Major Market Crash",
    "url": "https://www.newsbtc.com/news/ethereum-defi-coins-plunge-curve-concerns-crash/",
    "description": "The Ethereum DeFi space is currently experiencing a rough few hours. All major DeFi coins are posting deep red numbers in the last 24 hours: Compound (-18%), Aave (-10%), Curve (-10%), Frax (-6%), and Synthetix (-6%). The reason? Curve Finance, a flagship decentralized exchange specializing in stablecoin swaps, recently suffered a significant exploit. The resulting aftershocks are being felt across the DeFi ecosystem, inciting fears of a broader Ethereum DeFi massacre. The exploit, causing a damage of around $100 million, sets off potential domino effects threatening the stability of the wider DeFi landscape. Curve Hack Sparks Fears Of Ethereum DeFi Crash Delving into the details of the exploit reveals the intricate dynamics at play. The attackers took advantage of vulnerabilities in the Vyper smart contract software, leading to the significant losses on Curve Finance. The repercussions of this incident have been profound. The popular stablecoin DEX Curve Finance could be a ticking time bomb for the rest of the Ethereum DeFi sector. Related Reading: Here’s How Long The Majority Of New Ethereum Wallets Are Used Before They’re Dumped Post-incident, it is reported that over $45 million has been drained from liquidity pools of third-party providers, with an additional $25 million directly siphoned from the Curve Protocol&#8217;s CRV/ETH pool. The ensuing liquidity crisis and the impending risk of further sell-offs, given the millions of Curve (CRV) tokens still held by the attackers, is generating substantial anxiety within the market. The founder of Curve Finance, Michael Egorov, has not been immune to these significant losses. His large positions backed by CRV have come under intense pressure, pushing the platform to the brink. Delphi Digital explains, &#8220;Curve founder, Michael Egorov, currently has a ~$100 million loan backed by 427.5 million CRV (about 47% of the entire CRV circulating supply). With CRV down 10% over the past 24 hours, the health of Curve is in jeopardy.&#8221; Furthermore, Egorov holds large loans on Aave and Frax Finance, backed by CRV collateral. On Aave, he has a $305 million CRV backed loan amounting to 63.2 million USDT. At a liquidation threshold of 55%, his position could be liquidated if CRV/USDT hits $0.3767. As per Delphi Digital&#8217;s assessment, this would require a ~33% drop in the CRV price. Egorov also carries a ~4% APY for this loan. The situation on Frax Finance is even more precarious. Here, Egorov has supplied 59 million CRV against 15.8 million FRAX of debt. The high utilization and the Time-Weighted Variable Interest Rate, doubling every 12 hours, makes his position particularly vulnerable to astronomical interest rates and subsequent liquidation, irrespective of the CRV price. Delphi Digital emphasizes, &#8220;This astronomical interest rate could lead to his eventual liquidation, regardless of CRV price. At a max LTV of 75%, his position’s liquidation price could reach 0.517 CRV/FRAX within 4.5 days, less than a 10% decrease from current prices.&#8221; Related Reading: Ethereum Price Will Skyrocket Due To AI-Driven DAO Revolution: Arthur Hayes Today, Egorov deployed a new Curve pool and gauge: a 2 pool consisting of crvUSD &#38; Fraxlend’s CRV/FRAX LP token, seeded with 100,000 of CRV rewards. However, with no success. Utilization was quickly back to 100% as illiquid CRV holders took Frax stables to exit, and Frax lenders bailed on risky pool. Thus, Egorov&#8217;s new pool is just spending more of his CRV and not bringing his interest rate down. As the market grapples with the mounting liquidation risk of Egorov&#8217;s positions, the potential market-wide repercussions are alarming. Autism Capital warns, &#8220;If Michael gets liquidated by Fraxlend, all of his other debt positions will be liquidated too. This likely means Inverse Finance (INV) and Magic Internet Money (MIM) will both die due to the new bad debt, and Aave will get stuck with $63 million of bad debt.&#8221; Moreover, a liquidation of Egorov will likely trigger cascades on-chain and nuke CRV to almost zero. Not All Hope Is Lost However, despite the ensuing chaos, the DeFi sector&#8217;s operations, strictly governed by code and math, remain unaffected. As Autism Capital rightly puts it, &#8220;In one sense, this is proof that DeFi works as intended. There are no special rules or bailouts, no matter who you are. It’s a brutal free market governed by math and code.&#8221; Moreover, there’s still hope for a happy-end. Assuming liquidity recovers, the DeFi sector might regain balance. The Curve team has indicated that several millions in US dollars are in possession of white-hat hackers. This could potentially enable the recovery of some of the misappropriated assets. Additionally, some bots intercepted a significant quantity of CRV tokens from the Curve attackers. Nevertheless, the threat of the situation spreading remains a serious concern. Platforms like Frax, Aave and others remain on high alert, while some, like Alchemix, have already halted their smart contracts. [UPDATE] It looks like Egorov got an OTC deal with a CEX, paying off his debt. This is the reason for CRV&#8217;s price rebound. About to drop to $13M loaned. The money is definitely coming from an OTC deal. It looks like a handshake deal. He’s selling his CRV at 0.4 🚨2.5M crv for 1M usdt clips Which one of you chads got the sick deal? I assume this will go until entire debt paid off. pic.twitter.com/3c5OmcQ7wH — Midas: Fool&#8217;s Gold (@MidasFoolsGold) August 1, 2023 At press time, the Curve (CRV) price saw a slight recovery within the last three hours, rising to $0.57. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-01T08:07:02.000Z",
    "title": "QUBE Market Cap Surging in July, Set To Flip ENJ, 1INCH in 2 Years",
    "url": "https://www.crypto-news-flash.com/qube-market-cap-surging-in-july-set-to-flip-enj-1inch-in-2-years/?utm_source=rss&utm_medium=rss&utm_campaign=qube-market-cap-surging-in-july-set-to-flip-enj-1inch-in-2-years",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T103041.438.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T103041.438.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T103041.438-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the wake of a massively successful presale, July has seen a significant surge in the market capitalization of QUBE, the native token of InQubeta. With its current pace, it&#8217;s predicted that QUBE could flip prominent altcoins such as ENJ and 1INCH in the next two years. As an investment platform that democratizes access to [...]"
  }
]