[
  {
    "source": "CoinDesk",
    "date": "2024-01-16T16:48:38.000Z",
    "title": "BlackRock Wants to Follow Bitcoin ETF With an Ethereum ETF. Marketing It Might Not Be So Simple",
    "url": "https://www.coindesk.com/business/2024/01/16/blackrock-wants-to-follow-bitcoin-etf-with-an-ethereum-etf-marketing-it-might-not-be-so-simple/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Larry Fink has been talking up a spot ether ETF, but index provider CF Benchmarks sees a conundrum when it comes to selling that product."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-16T17:04:56.000Z",
    "title": "Solana Reveals Saga 'Chapter 2' Phone After Airdrop Frenzy Fueled Sellout",
    "url": "https://decrypt.co/213004/solana-reveals-saga-chapter-2-phone-after-airdrop-frenzy-fueled-sellout",
    "description": "Solana Labs has revealed its next phone, the Saga \"Chapter 2,\" which keeps the crypto focus in a more affordable package."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-16T17:00:00.000Z",
    "title": " Spot Ethereum ETF not coming &#039;anytime soon,&#039; says Mark Yusko  ",
    "url": "https://cointelegraph.com/news/spot-ethereum-etf-not-coming-anytime-soon-says-mark-yusko",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZDZkMWZlZmUtZWUyNi00ZTQzLTkzNDQtOWM2MzYzMDJiNjI0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Morgan Greek Capital CEO gives less than 50% odds a spot Ethereum ETF will be approved in the U.S. this year.</p>\n                    <p><p>The United States Securities and Exchange Commission (SEC) is unlikely to approve a spot Ethereum ETF this year despite optimism sparked by the recent approval of the first spot BItcoin ETF, according to Morgan Creek Capital CEO and co-founder Mark Yusko.  </p><p>In a recent interview, Bloomberg ETF analyst Eric Balchunas, <a href=\"https://twitter.com/WuBlockchain/status/1745312885298041012?t=QZjIdosZ_4cmP4QM1gDvIA&amp;s=19\" target=\"_blank\" rel=\"noopener nofollow\">said</a> there is a 70% chance a spot Ethereum ETF will be approved by May. However, Yusko disagrees. </p><p>\"I'd probably say less than 50/50,\" he said in an exclusive Cointelegraph interview. </p><p><a href=\"https://cointelegraph.com/news/spot-ethereum-etf-not-coming-anytime-soon-says-mark-yusko\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-16T17:00:12.000Z",
    "title": "Filecoin Foundation demonstrates IPFS data transmission in space, eyes future off-planet networks",
    "url": "https://cryptoslate.com/filecoin-foundation-demonstrates-ipfs-data-transmission-in-space-eyes-future-off-planet-networks/",
    "description": "<p>The Filecoin Foundation has successfully executed a groundbreaking mission, sending its digital asset&#8217;s whitepaper and an image of its mascot, affectionately known as &#8220;Biscuit, the FileCorgi,&#8221; into orbit and back to Earth using the InterPlanetary File System (IPFS). As outlined in a Jan. 16 statement, this achievement exemplifies the potential of decentralized technologies in space [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/filecoin-foundation-demonstrates-ipfs-data-transmission-in-space-eyes-future-off-planet-networks/\">Filecoin Foundation demonstrates IPFS data transmission in space, eyes future off-planet networks</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-16T16:57:42.000Z",
    "title": "3 Cryptos Set To Explode in 2024",
    "url": "https://cryptodaily.co.uk/2024/01/3-cryptos-set-to-explode-in-2024",
    "description": "Explore the dynamic shifts in the crypto market in 2024, focusing on the significant developments in altcoins such as Solana (SOL), Dogecoin (DOGE), and Avalanche (AVAX), which are paving the way for a diversified digital currency landscape."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-16T16:54:26.000Z",
    "title": "Crypto Forecast: BNB (BNB) Changes Bullish Course as Celestia (TIA) and Everlodge (ELDG) Gain Momentum",
    "url": "https://cryptodaily.co.uk/2024/01/crypto-forecast-bnb-bnb-changes-bullish-course-as-celestia-tia-and-everlodge-eldg-gain-momentum",
    "description": "A look at the price chart of several tokens tells insightful stories on what the future course of price action may be"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-16T16:46:09.000Z",
    "title": "Chainlink (LINK) and Toncoin (TON) Price Forecast -  Meme Moguls (MGLS) Reaches New ATH",
    "url": "https://cryptodaily.co.uk/2024/01/chainlink-link-and-toncoin-ton-price-forecast-meme-moguls-mgls-reaches-new-ath",
    "description": "The unpredictable nature of the cryptocurrency market has left many investors uncertain about their investment choices."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-16T16:50:31.000Z",
    "title": "Ondo Foundation Set to Unlock ONDO Tokens, Enhancing Liquidity in Its DeFi Ecosystem",
    "url": "https://www.cryptopolitan.com/ondo-foundation-unlock-ondo-tokens-liquidity/",
    "description": "In a recent announcement that has captured the attention of the decentralized finance (DeFi) community, the Ondo Foundation has revealed plans to unlock ONDO tokens on January 18. The move, communicated through their official Twitter handle, represents a pivotal moment for the foundation and its rapidly growing real-world asset (RWA) platform. The unlocking of ONDO [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-16T17:04:05.000Z",
    "title": "US ETF market heats up with Ethereum: what you need to know",
    "url": "https://crypto.news/us-etf-market-heats-up-with-ethereum-what-you-need-to-know/",
    "description": "The excitement over spot Bitcoin (BTC) ETFs has calmed, but a fresh wave of enthusiasm is emerging. Could the prospect of an Ethereum (ETH) ETF propel the crypto market to new heights? In the United States, competition is unfolding for&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-16T16:56:22.000Z",
    "title": "Coinbase vs. SEC case said to ignite altcoin run",
    "url": "https://crypto.news/coinbase-vs-sec-case-said-to-ignite-altcoin-run/",
    "description": "YouTube analyst Crypto Capital Venture argues that if the judge rules in favor of Coinbase against the SEC, it could ignite an altcoin run with up to 100% on assets like ADA."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-16T17:00:44.000Z",
    "title": "Ethereum Trouncing Bitcoin, ETH/BTC Ratio Bouncing Higher: Will This Trend Continue?",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-bitcoin-ethbtc-ratio-bouncing-higher/",
    "description": "Amidst a volatile crypto market, Ethereum (ETH) is gaining momentum, outperforming its long-time rival Bitcoin (BTC). According to Kaiko data, the ETH/BTC ratio has steadily risen, rebounding from multi-year lows.  ETH/BTC Ratio Rising, ETH Momentum Building The ETH/BTC ratio technically gauges market sentiment towards these two leading crypto. The recent rebound indicates investors are increasingly bullish on Ethereum&#8217;s potential relative to Bitcoin.  This upward trajectory is fueled by growing optimism surrounding the potential approval of spot Ethereum ETFs and the general confidence that markets will trend higher in 2024. The prospect of this product entering the market has also injected fresh energy into the ETH ecosystem, lifting the second most valuable coin by market cap. Related Reading: Institutional Inflows Into XRP Surges 244% Amid ETF Speculation After protracted lower lows, the ETH/BTC ratio began rising immediately after the United States Securities and Exchange Commission (SEC) approved 11 spot Bitcoin ETFs last week. This unexpected shift, analysts observe, is primarily because of increasing confidence in the SEC approving a similar product for ETH. Spot Ethereum ETFs, which would provide direct exposure to the Ethereum market, would make it easier for institutional investors to benefit from the volatility of ETH. So far, the SEC has approved an Ethereum Futures ETF, which, unlike the spot ETF, tracks an index, not the direct price of this asset. Blackrock is among the leading Wall Street giants interested in issuing a spot Ethereum ETF. Considering its history of success, the decision by one of the world&#8217;s leading asset managers to apply for this product is an endorsement of its prospects. Earlier, Larry Fink, the CEO of BlackRock, said Ethereum, despite its scaling challenge, might spearhead the tokenization drive in the years ahead. US SEC Yet To Clarify Whether Ethereum Is A Commodity Or Security Even so, the SEC has yet to clarify whether ETH, a coin pre-mined with some assets distributed to the Ethereum Foundation, is a commodity like Bitcoin. Earlier, Gary Gensler, the chairperson of the SEC, was cornered by the United States policymakers to give the agency&#8217;s stand on the coin but didn&#8217;t. Related Reading: XRP Investors Become Fearful: Time To Buy? Nonetheless, with the prospect of spotting Ethereum ETFs and the dominance of Ethereum in decentralized finance (DeFi) and non-fungible tokens (NFTs), ETH will likely continue outperforming BTC in the coming months. Price action data shows that ETH is already up 20% versus BTC in the past trading week. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-16T17:04:52.000Z",
    "title": "Memeinator vs. Fusionist: Which Is the Best Crypto Investment for 2024?",
    "url": "https://www.crypto-news-flash.com/memeinator-vs-fusionist-which-is-the-best-crypto-investment-for-2024/?utm_source=rss&utm_medium=rss&utm_campaign=memeinator-vs-fusionist-which-is-the-best-crypto-investment-for-2024",
    "description": "<img width=\"1600\" height=\"800\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Memeinator-Content-Media-Bank-–-Small-Logo-5-min1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Memeinator-Content-Media-Bank-–-Small-Logo-5-min1.jpg 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Memeinator-Content-Media-Bank-–-Small-Logo-5-min1-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Memeinator-Content-Media-Bank-–-Small-Logo-5-min1-1200x600.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Memeinator-Content-Media-Bank-–-Small-Logo-5-min1-768x384.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Memeinator-Content-Media-Bank-–-Small-Logo-5-min1-1536x768.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Memeinator-Content-Media-Bank-–-Small-Logo-5-min1-150x75.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Memeinator-Content-Media-Bank-–-Small-Logo-5-min1-450x225.jpg 450w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />Memeinator vs. Fusionist: Which Is the Best Crypto Investment for 2024? Deciding which crypto investment holds the most promise for 2024 unearths a riveting battle of potential: Memeinator versus Fusionist. With both offering promising potential, We’ve taken a deep dive to explore the unique features, exponential potential growth, and market predictions that set these digital [...]"
  }
]