[
  {
    "source": "Cointelegraph",
    "date": "2023-12-01T17:08:52.000Z",
    "title": " Why is the crypto market up today? ",
    "url": "https://cointelegraph.com/news/why-is-the-crypto-market-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTAvYTYzMzIzMGQtM2Y5YS00NzQ5LThiYWItMDE3YzRiOTQzNWEwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The crypto market is up today thanks to MicroStrategy's relentless Bitcoin purchases ahead of the key ETF decisions.</p>\n                    <p><p >The cryptocurrency market is up today with its net valuation reaching $1.427 trillion for the first time since May 2022.</p><p >Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), which controls more than half of the market share, contributed the most to the crypto sector's growth on Dec. Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), the second-largest cryptocurrency by market cap, jumped 2.8% over $2,100. </p><figure ><img src=\"https://s3.cointelegraph.com/uploads/2023-12/99e4f162-0b4c-4e37-9445-88813a42ede6.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto market capitalization weekly performance chart. Source: TradingView</em></figcaption></figure><h2 >Why is crypto market going up today?</h2><p >Crypto market gains in the last 24 hours coincide with MicroStrategy's <a href=\"https://cointelegraph.com/news/microstrategy-buys-600m-bitcoin\">announcement</a> that it had purchased nearly $600 million worth of Bitcoin at an average price of $36,785 per BTC. This acquisition brings the company's total BTC holdings to over $6 billion.</p><p >Interestingly, MicroStrategy's BTC investment comes a month ahead of the U.S. Securities and Exchange Commission's <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-january-approvals-possible-analysts\">potential approval</a> of all Bitcoin exchange-traded fund (ETF) applications. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">When people ask if there is demand for a spot Bitcoin ETF just take a look at purchases like Microstrategy today with the $500mm+ ticket. <br><br>Microstrategy is effectively used as a publicly traded Bitcoin ETF proxy. </p><p><a href=\"https://cointelegraph.com/news/why-is-the-crypto-market-up-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-01T16:45:06.000Z",
    "title": "Dormant Bitcoin re-enters circulation as sleeping giants stir",
    "url": "https://cryptoslate.com/insights/dormant-bitcoin-re-enters-circulation-as-sleeping-giants-stir/",
    "description": "<p>Quick Take The Bitcoin ecosystem has recently witnessed a noteworthy trend as a substantial quantity of coins, dormant for years, have sprung back into circulation. Data from Glassnode reveals a significant increase in the transfer volume of previously dormant coins for periods of over 1, 2, 3, and 5 years. Approximately 26,000 Bitcoins that were [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/dormant-bitcoin-re-enters-circulation-as-sleeping-giants-stir/\">Dormant Bitcoin re-enters circulation as sleeping giants stir</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-01T17:00:56.000Z",
    "title": "Report: Bankman-Fried Struggles With Extortion Attempts Behind Bars in Brooklyn’s MDC",
    "url": "https://news.bitcoin.com/report-bankman-fried-struggles-with-extortion-attempts-behind-bars-in-brooklyns-mdc/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/sbf66626263-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Report: Bankman-Fried Struggles With Extortion Attempts Behind Bars in Brooklyn&#039;s MDC\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/sbf66626263-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sbf66626263-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sbf66626263-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sbf66626263-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sbf66626263-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sbf66626263-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sbf66626263.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Sam Bankman-Fried (SBF), previously a key figure in the crypto sphere, encountered a stark contrast to his past life at the Metropolitan Detention Center (MDC) in Brooklyn. Gene Borrello, a past mob enforcer for the Bonanno crime family, shared insights with journalist Tiffany Fong about the daily challenges SBF faces in prison. Borrello&#8217;s revelations paint [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-01T16:52:58.000Z",
    "title": "Starship Collaborates with DWF Labs to Revolutionize Web3 Innovation and Fundraising",
    "url": "https://www.cryptopolitan.com/starship-collaborates-with-dwf-labs-web3/",
    "description": "In a significant development within the Web3 sphere, Starship, a pioneering community-driven multichain fundraising platform, has announced a strategic collaboration with DWF Labs, a global leader in digital asset market making and multi-stage Web3 investment.&#160; The partnership is poised to bring a new wave of innovation and accessibility to the Web3 ecosystem, aligning with Starship&#8217;s ... <a title=\"Starship Collaborates with DWF Labs to Revolutionize Web3 Innovation and Fundraising\" class=\"read-more\" href=\"https://www.cryptopolitan.com/starship-collaborates-with-dwf-labs-web3/\" aria-label=\"More on Starship Collaborates with DWF Labs to Revolutionize Web3 Innovation and Fundraising\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-01T17:00:52.000Z",
    "title": "300 Million Dogecoin (DOGE) Moved To Robinhood As Price Swells",
    "url": "https://www.newsbtc.com/news/dogecoin/300-million-dogecoin-doge-moved-to-robinhood-as-price-swells/",
    "description": "The Meme-based cryptocurrency Dogecoin (DOGE) has recently experienced a significant increase in whale transactions during an improvement in the crypto asset&#8217;s price. 300 Million Dogecoin (DOGE) Dumped In Crypto Exchange Data from the on-chain crypto tracker Whale Alert recently revealed that a massive amount of Dogecoin (DOGE) was transferred to Robinhood. This whale transaction has attracted the interest of traders and investors in the larger cryptocurrency space. Related Reading: Dogecoin Sees Highest Transactions Count Ever Due DRC20 Madness According to the crypto tracker, the transfer was orchestrated by an unknown wallet address earlier today. The wallet address identified as DDuXG.ruc1wwKF sent about 300 million DOGE to the cryptocurrency trading platform Robinhood. The post read: 300,000,000 #DOGE (25,033,123 USD) transferred from unknown wallet to #Robinhood. With the current price of Dogecoin, the whale transaction is valued at approximately $25 million. The whale moved the substantial Dogecoin haul to Robinhood for a comparatively low network cost of just $0.18. This is most likely by taking advantage of times when fees and congestion were low.  The transfer of DOGE to Robinhood suggests that the whale is looking to sell the tokens, igniting speculation in the larger cryptocurrency market. However, it seems that the meme-based cryptocurrency&#8217;s price increase runs counter to the tokens being dumped on exchanges. Currently, the price of DOGE is sitting at $0.0839, indicating an over 2% increase in price in the past 24 hours. Meanwhile, its market capitalization is also reflecting the same percentage rise at $11.9 billion, according to CoinMarketCap. A similar whale transaction was also flagged by the on-chain tracker recently. In October, a similar transaction of 300 million DOGE tokens occurred thrice, while last month also saw a similar transaction twice. Related Reading: Is Dogecoin About To Reverse? Key Factors To Watch Large-scale individual transactions usually come with the danger of crashes due to fast liquidations or market manipulation. However, there is no solid evidence that the whale transaction had any impact on the token&#8217;s price. The Crypto Asset&#8217;s Holders Increases Significantly Dogecoin has shown a significant uptick in its total number of holders lately. Analytics firm IntoTheBlock revealed that the total number of addresses holding a balance exceeded 5 million this week, and reached a high of 5.02 million on November 27. A major factor contributing to the rise in new Dogecoin addresses is the cryptocurrency&#8217;s increasing adoption and interest. The on-chain analytics firm also revealed that the numbers have been increasing gradually since the start of the year. &#8220;This recent activity is most likely driven by Dogecoin &#8220;Doginals&#8221;, which don&#8217;t require a significant on-chain balance of $DOGE,&#8221; IntoTheBlock said. DOGE trading at $0.0833 on the 1D chart &#124; Source: DOGEUSDT on Tradingview.com Featured image by iStock, chart by Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-01T16:59:00.000Z",
    "title": "Celsius Network Might Seek New Creditor Vote for Restructuring Plan",
    "url": "https://coinedition.com/celsius-network-might-seek-new-creditor-vote-for-restructuring-plan/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Celsius_Network_Revival_Plan_–_Heres_What_It_Includes-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Celsius New CEO Aims for Stability\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Celsius_Network_Revival_Plan_–_Heres_What_It_Includes-1.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Celsius_Network_Revival_Plan_–_Heres_What_It_Includes-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Celsius_Network_Revival_Plan_–_Heres_What_It_Includes-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Celsius_Network_Revival_Plan_–_Heres_What_It_Includes-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Celsius_Network_Revival_Plan_–_Heres_What_It_Includes-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A recent Reuters report unearthed a new development in the bankrupt cryptocurrency lending company Celsius Network’s bid to transform into a Bitcoin mining company. Reportedly, U.S. Bankruptcy Judge Martin Glenn pointed out the discrepancy between the creditors’ proposal and the revised deal of the company. Following Celsius Network’s collapse in 2022’s bearish market, the platform [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/celsius-network-might-seek-new-creditor-vote-for-restructuring-plan/\">Celsius Network Might Seek New Creditor Vote for Restructuring Plan</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]