[
  {
    "source": "Cointelegraph",
    "date": "2024-04-09T05:18:06.000Z",
    "title": " SushiSwap team treasury takeover looks likely, despite heated debate ",
    "url": "https://cointelegraph.com/news/sushi-swap-team-treasury-takeover-looks-likely-amid-heated-debate",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvZTBkZWE3ZTYtMDMzMi00MzI2LThiYTEtZjFjMmMzMzBlODU5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Voting for and against the proposal was evenly matched but recently tipped in favor of the ‘yay,' despite continued criticism of the plan on social media. Voting ends April 10.</p>\n                    <p><p>A controversial proposal to change SushiSwap’s treasury structure by the team behind the decentralized exchange looks like it may go through, despite vocal opposition to the proposal on social media.</p><p>The SushiSwap team made a controversial governance <a href=\"https://snapshot.org/#/sushigov.eth/proposal/0x21aa6c89fd5e4111e6046cfc12cc7280f2be13f8452e61a0025454678d1ff9d0\" target=\"_blank\" rel=\"noopener nofollow\">proposal</a> on March 26 to “significantly evolve Sushi by adopting a Labs model.” </p><p>It aims to restructure the current organization to “enhance operational efficiency and accelerate protocol development.” </p><p><a href=\"https://cointelegraph.com/news/sushi-swap-team-treasury-takeover-looks-likely-amid-heated-debate\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-04-09T05:25:30.000Z",
    "title": "Hong Kong’s ZA Bank to Offer Custody Accounts for Stablecoin Issuers",
    "url": "https://news.bitcoin.com/hong-kongs-za-bank-to-offer-custody-accounts-for-stablecoin-issuers/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/04/a2560408-c2ed-41ba-ad3b-ee37b1f4986a-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Hong Kong ZA Bank Offering Custody Accouns for Stablecoin Issuers\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/04/a2560408-c2ed-41ba-ad3b-ee37b1f4986a-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/a2560408-c2ed-41ba-ad3b-ee37b1f4986a-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/a2560408-c2ed-41ba-ad3b-ee37b1f4986a-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/a2560408-c2ed-41ba-ad3b-ee37b1f4986a-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/a2560408-c2ed-41ba-ad3b-ee37b1f4986a-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/a2560408-c2ed-41ba-ad3b-ee37b1f4986a-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/a2560408-c2ed-41ba-ad3b-ee37b1f4986a.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />ZA Bank, a virtual bank in Hong Kong, will offer cash custody accounts for institutions that want to issue stablecoins. The organization is in talks with several parties seeking to issue their stablecoins, and this service would be available for them after receiving a license from the Hong Kong Monetary Authority (HKMA). ZA Bank to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-09T05:34:47.000Z",
    "title": "Five Agencies Partner with Justice Department to Counter Civil Rights Violations Stemming from AI-induced Prejudice",
    "url": "https://www.cryptopolitan.com/justice-department-to-counter-ai-prejudice/",
    "description": "Five federal agencies have joined forces with the Department of Justice to enforce civil rights against AI-induced prejudice. The point to note is that these federal agencies are in addition to the agencies that have already been working in this regard. The announcement came through a press release on Friday from the Office of Public [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-09T05:28:46.000Z",
    "title": "MATIC Price Prediction: Can Polygon Rip Higher To $1.15",
    "url": "https://www.newsbtc.com/analysis/matic-analysis/matic-price-prediction-rip-1-15/",
    "description": "MATIC price is up over 5% and it tested the $0.950 resistance. Polygon bulls are in full control, and they might aim for more upsides above $1.00. MATIC price started a fresh increase above the $0.920 resistance against the US dollar. The price is trading above $0.925 and the 100 simple moving average (4 hours). There was a break above a key bearish trend line with resistance at $0.9150 on the 4-hour chart of the MATIC/USD pair (data source from Kraken). The pair could continue to move up if it clears the $0.9720 resistance. Polygon Price Starts Fresh Increase After forming a base above the $0.8620 level, Polygon’s price started a fresh increase. MATIC cleared many hurdles near $0.880 and $0.8950 to move into a positive zone, like Bitcoin and Ethereum. There was also a move above the $0.90 resistance and the 100 simple moving average (4 hours). The bulls pushed the price above the 23.6% Fib retracement level of the downward move from the $1.0854 swing high to the $0.8612 low. Besides, there was a break above a key bearish trend line with resistance at $0.9150 on the 4-hour chart of the MATIC/USD pair. MATIC is trading above $0.9250 and the 100 simple moving average (4 hours). Immediate resistance is near the $0.960 zone. The first major resistance is near the $0.9720 level or the 50% Fib retracement level of the downward move from the $1.0854 swing high to the $0.8612 low. If there is an upside break above the $0.9720 resistance level, the price could continue to rise. Source: MATICUSD on TradingView.com The next major resistance is near $1.00. A clear move above the $1.00 resistance could start a steady increase. In the stated case, the price could even attempt a move toward the $1.100 level or $1.150. Are Dips Limited in MATIC? If MATIC’s price fails to rise above the $0.9720 resistance level, it could start a downside correction. Immediate support on the downside is near the $0.915 level and the same trend line. The main support is near the $0.880 level. A downside break below the $0.880 level could open the doors for a fresh decline toward $0.8620. The next major support is near the $0.8250 level. Technical Indicators 4 hours MACD – The MACD for MATIC/USD is gaining momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for MATIC/USD is now above the 50 level. Major Support Levels – $0.9150 and $0.880. Major Resistance Levels – $0.9720, $1.00, and $1.15."
  }
]