[
  {
    "source": "CryptoSlate",
    "date": "2024-03-29T22:49:56.000Z",
    "title": "Court rules Custodia Bank not entitled to Federal Reserve master account",
    "url": "https://cryptoslate.com/court-rules-custodia-bank-not-entitled-to-federal-reserve-master-account/",
    "description": "<p>A Wyoming court has ruled against Caitlin Long&#8217;s Custodia Bank by determining that the lender is not entitled to a Federal Reserve master account. In a summary judgment on March 29, Judge Scott W. Skavdahl found that Custodia Bank has no statutory entitlement to a master account and will not be granted a writ of [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/court-rules-custodia-bank-not-entitled-to-federal-reserve-master-account/\">Court rules Custodia Bank not entitled to Federal Reserve master account</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NullTX",
    "date": "2024-03-29T23:00:24.000Z",
    "title": "BlockDAG’s Monumental Presale Surges To $10.4 Million, Beating PUSHD Amidst IOTA 2.0 Release",
    "url": "https://nulltx.com/blockdags-monumental-presale-surges-to-10-4-million-beating-pushd-amidst-iota-2-0-release/",
    "description": "BlockDAG has become a premier investment opportunity, overshadowing significant events like the IOTA 2.0 release and the PUSHD presale. With its innovative presale strategy and substantial investment appeal, BlockDAG Network has captured the attention of investors amidst the anticipation of explosive growth in the cryptocurrency sector. BlockDAG (BDAG) is in [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-29T23:00:53.000Z",
    "title": "Crypto Analyst Predicts 600%-1000% Return For XRP, Here’s The Target",
    "url": "https://www.newsbtc.com/analysis/xrp/600-1000-return-for-xrp/",
    "description": "A cryptocurrency analyst has predicted a massive price surge for XRP, anticipating the cryptocurrency to witness a more than 600% increase. Despite its historically sluggish growth, XRP has begun to gather momentum, showing potential to experience major price growth during the 2024 bull run.  Price Projected To Soar Above $5 A crypto analyst identified as Egrag Crypto has taken to X (formerly Twitter) to predict an exponential price surge for XRP. According to Egrag Crypto XRP is “guaranteed” to experience a 600% to 1000% increase to new all-time highs around $5.5.  Related Reading: The Bulls Are Back: Spot Bitcoin Inflows Surge With New Records Basing his predictions on XRP’s historical data from 2017, the analyst shared a chart illustrating XRP’s price movements over the years. He delved into the cryptocurrency’s minimum and shortest price pumps observed when the 21 Exponential Moving Average (EMA) crosses the 55 Moving Average (MA). The crypto expert disclosed that in 2017, the altcoin witnessed a significant price surge of approximately 902.85%, driving its price to $0.0646 at the time. Around 2021, the cryptocurrency recorded another pump, surging by about 585.29% to trade above the $1 price mark.  Following historical trends, XRP is anticipated to undergo a substantial surge of 585.20%, reaching a price level of about $3.26 in 2024. The analyst has revealed that if XRP manages to achieve a 900% or 585% price pump, it could potentially rise even further to $5.5 or $4, respectively.  On the flip side, Egrag Crypto has disclosed that if XRP fails to achieve an all-time high of $5 to $10 during the 2024 bull cycle, the cryptocurrency may not experience a bullish surge until the next bull run. Despite this, the analyst has remained confident in XRP’s potential to attain triple-digit gains and reach new all-time highs soon.  When Will XRP Witness A $5.5 Price Surge? When asked by a crypto community member about the timeline for the price of XRP to potentially rise to $5.5, Egrag Crypto boldly affirmed that the window of uptick lies between April and July 2024. He urged the XRP army to brace themselves for this potentially bullish period, emphasizing a strong belief for XRP to surge to unprecedented heights. Related Reading: The Bulls Are Back: Spot Bitcoin Inflows Surge With New Records Despite its recent price drops, the sentiment surrounding XRP has remained positive, with many crypto analysts predicting bullish price movements for the cryptocurrency. At the time of writing, XRP is trading around $0.61, reflecting a decline of 1.77% over the last 24 hours and 3.93% over the past week, according to CoinMarketCap.  While the cryptocurrency has successfully crossed resistance levels above $0.5, it is still a long way from surpassing its all-time high of $3.84 recorded in 2018. Token price trending at $0.62 &#124; Source: XRPUSDT on Tradingview.com Featured image from Bitcoin News, chart from Tradingview.com"
  }
]