[
  {
    "source": "Bitcoin.com",
    "date": "2023-12-17T09:00:04.000Z",
    "title": "CFTC Chairman: Many Crypto Tokens Are Considered Commodities Under Existing Laws",
    "url": "https://news.bitcoin.com/cftc-chairman-many-crypto-tokens-are-considered-commodities-under-existing-laws/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_1942923427-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"CFTC Chairman: Many Crypto Tokens Are Considered Commodities Under Existing Laws\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_1942923427-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_1942923427-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_1942923427-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_1942923427-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_1942923427-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_1942923427-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_1942923427.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The chairman of the Commodity Futures Trading Commission (CFTC), Rostin Behnam, has stated that many digital assets are considered commodities under existing law. Behnam urged the U.S. Congress to hasten the process of establishing a regulatory regime for cryptocurrency. He also emphasized that he and Gary Gensler, the U.S. Securities and Exchange Commission chairperson, &#x201C;get [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-17T08:58:56.000Z",
    "title": "Optimism Price To Resume Bullish Trajectory To $3? Here’s How",
    "url": "https://www.newsbtc.com/optimism-2/optimism-price-to-resume-bullish-trajectory-to-3-heres-how/",
    "description": "The Optimism price appears to have struggled over the past week, with its recent bullish momentum seemingly waning. During the altcoin rally, the price of Optimism’s native token OP went from a low of $1.2 to a high of nearly $2.5 before experiencing a pullback.  While OP has managed to preserve a majority of its recently accrued profit, the cryptocurrency seems to be finding it challenging to continue its bullish trajectory. And the latest on-chain revelation suggests that there might be only one thing in the way of the Optimism price rise to a new high. OP Price To Soar By 26% To $2.70, Crypto Analyst Projects Popular crypto analyst Ali Martinez, in a recent post on the X platform, disclosed his bullish projection for the price of Optimism over the next few weeks. This prediction revolves around on-chain data from IntoTheBlock, which is based on the density of investors who purchased the OP token at certain price zones. 26,800 addresses purchased roughly 45 million tokens between $2.17 and $2.23 &#124; Source: Ali_charts/X Related Reading: Polygon (MATIC) Price Faces Crucial Turning Point That Could Trigger 50% Rally, Analyst Says The chart above displays how the Optimism price zones around the current value look in terms of investor density. The size of the dot indicates the number of investors who bought the OP coin at each price range. Notably, the resistance or support at a price zone is more significant the larger the dot size of that price zone. In his post, Martinez pointed out that the Optimism price is currently bouncing off a major resistance zone between $2.17 and $2.30. According to data from the analytics platform, roughly 27,000 addresses purchased a massive 45 million tokens within this range. Martinez posited that the zone between $2.17 and $2.30 is one to watch out for, given the substantial buying activity within the price range. “A sustained close above could signal a bullish breakout, potentially propelling OP toward $2.70,” the crypto analyst said. This represents a more than 26% price growth from the cryptocurrency’s current value. Optimism Price Overview As of this writing, the Optimism price stands at $2.11, reflecting a 2.4% price decline in the past 24 hours. OP’s sluggish performance in the past day underscores the altcoin’s struggles over the past week. According to data from CoinGecko, the Optimism price has barely changed in the past seven days. Although the cryptocurrency surged to a multi-month high of $2.46 earlier in the previous week, it has since faced some level of correction to trade around $2.10. Related Reading: Analyst Predicts XRP Price Will Rise 800% To $5.5 – The Timeframe Will Shock You Nevertheless, Optimism still ranks amongst the top 40 cryptocurrencies in the sector, with a market capitalization of roughly $1.94 billion. Optimism price experiences correction on the daily timeframe &#124; Source: OPUSDT chart on TradingView Featured image from The Independent, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-17T08:42:16.000Z",
    "title": "Trader’s Forecast: Altcoin among the Top-10 on the verge of taking off",
    "url": "https://www.crypto-news-flash.com/traders-forecast-altcoin-among-the-top-10-on-the-verge-of-taking-off/?utm_source=rss&utm_medium=rss&utm_campaign=traders-forecast-altcoin-among-the-top-10-on-the-verge-of-taking-off",
    "description": "<img width=\"640\" height=\"427\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/austin-distel-EMPZ7yRZoGw-unsplash.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Trading\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/austin-distel-EMPZ7yRZoGw-unsplash.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/austin-distel-EMPZ7yRZoGw-unsplash-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/austin-distel-EMPZ7yRZoGw-unsplash-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />Ali Martinez predicts that Binance Coin (BNB) could increase in value by nearly 20% if it breaks above the key $261 level. Martinez highlights that Bitcoin and Ethereum present accumulation opportunities and critical support points for investors. Well-known crypto trader and analyst Ali Martinez has recently forecast that Binance Coin (BNB), one of the top [...]"
  }
]