[
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T01:44:06.000Z",
    "title": "100K ChatGPT logins have been leaked on dark web, cybersecurity firm warns",
    "url": "https://cointelegraph.com/news/dark-web-chatgpt-logins-leaked-group-ib-open-ai",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/07f9511d-b257-4ac4-8bb9-615eaec6a0f7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The compromised accounts could give bad actors confidential information about companies and individuals.  </p>\n                    <p><p>Over the past year, more than 100,000 login credentials to the popular artificial intelligence chatbot ChatGPT have been leaked and traded on the dark web, according to a Singaporean cybersecurity firm.</p><p>A June 20 blog <a href=\"https://www.group-ib.com/media-center/press-releases/stealers-chatgpt-credentials/\" target=\"_blank\" rel=\"noopener nofollow\">post</a> by Group-IB revealed just over 101,000 compromised logins for OpenAI’s flagship bot have traded on dark web marketplaces between June 2022 and May 2023.</p><p>The login information was found in the logs of “info-stealing malware.” May 2023 saw a peak of nearly 27,000 ChatGPT-related credentials made available on online black markets.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">According to our findings, the Asia-Pacific region has experienced the highest concentration of ChatGPT credentials being offered for sale. <a href=\"https://t.co/s3TbsntCgX\">pic.twitter.com/s3TbsntCgX</a></p>&mdash; Group-IB Threat Intelligence (@GroupIB_TI) <a href=\"https://twitter.com/GroupIB_TI/status/1671069059478175745?ref_src=twsrc%5Etfw\">June 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The Asia-Pacific region had the highest amount of compromised logins for sale over the past year, making up around 40% of the nearly 100,000 figure.</p><p>Indian-based credentials took the top spot overall with over 12,500 and the United States had the sixth most logins leaked online at nearly 3,000. France was seventh overall behind the U.S. and took the pole position for Europe.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/c9f812f1-4fea-462a-96d5-31ab99a3b44c.jpg\"  /><figcaption style=\"text-align: center;\"><em>The number of exploited ChatGPT accounts over the past year by region. Source: Group-IB</em></figcaption></figure><p>ChatGPT accounts can be created directly through OpenAI. Additionally, users can choose to use their Google, Microsoft or Apple accounts to login and use the service.</p><p>Cointelegraph contacted OpenAI for comment but did not immediately receive a response.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/how-ai-is-changing-how-humans-interact-with-machines\"><strong><em>How AI is changing the way humans interact with machines</em></strong></a></p><p>Group-IB said it noticed an uptick in the number of employees using ChatGPT for work. It warned confidential information about companies could be exposed by unauthorized users as user queries and chat history is stored by default.</p><p>Such information could then be exploited by others to undertake attacks against companies or individual employees.</p><p>The firm advised users to regularly update passwords and use two-factor authentication to better secure ChatGPT accounts. </p><p>Interestingly, the firm noted that the press release was written with the assistance of ChatGPT. </p><p><strong><em>AI Eye: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-is-ai-a-threat-why-ai-advance/\"><strong><em>Is AI a nuke-level threat? Why AI fields all advance at once, dumb pic puns</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-23T02:00:59.000Z",
    "title": "Russia Opposes French President Macron Attending BRICS Summit, Citing ‘Hostile and Unacceptable’ Policy Toward Moscow",
    "url": "https://news.bitcoin.com/russia-opposes-french-president-macron-attending-brics-summit-citing-hostile-and-unacceptable-policy-toward-moscow/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/macron-brics-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Russia Opposes French President Macron Attending BRICS Summit, Citing &#039;Hostile and Unacceptable&#039; Policy Toward Moscow\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/macron-brics-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/macron-brics-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/macron-brics-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/macron-brics-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/macron-brics-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/macron-brics-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/macron-brics.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The BRICS leaders’ summit will take place in a couple of months, and French President Emmanuel Macron has reportedly expressed interest in attending. However, Russia believes it would be &#8220;inappropriate&#8221; for the French president to attend. “Clearly, leaders of states that pursue such a hostile and unacceptable policy towards us” are inappropriate BRICS guests, said [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T02:00:03.000Z",
    "title": "Bitcoin 30-Day Price Range Foreshadowed The Rally, Here’s How",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-30-day-price-range-foreshadowed-rally-how/",
    "description": "Bitcoin has observed a sharp rally above the $30,000 mark over the past day. Here&#8217;s how the 30-day price range may have foreshadowed this volatility. Bitcoin Had Earlier Compressed To A Tight 30-Day Price Range According to data from the on-chain analytics firm Glassnode, tight price ranges have historically preceded large moves in the cryptocurrency&#8217;s price. In the context of the current discussion, the Bitcoin price range of interest is the 30-day one, simply a measure of the percentage difference between the top price and bottom price that the asset has observed over the last month. When the value of this metric is high, it means that the cryptocurrency has seen a significant degree of fluctuation between the high and low set during the past 30 days. Such a trend implies that the asset has registered high volatility recently. On the other hand, low values suggest the asset has only moved inside a narrow range during the past month. This kind of trend naturally highlights how stale the cryptocurrency&#8217;s price action has been lately. Related Reading: ‘Ripple (XRP) Is A Must-Hold For The Next Bull Run,’ Says Bitcoin Maxi Now, here is a chart that shows the trend in the Bitcoin 30-day price high and low, as well as the 30-day price range, over the history of the coin: The value of the metric seems to have seen an uplift in the last few days &#124; Source: Glassnode on Twitter As highlighted in the above graph, the Bitcoin 30-day range had compressed to a very tight range recently as the asset&#8217;s price had mostly moved sideways. During this period of consolidation, the 30-day range had fallen below the 11% mark, meaning that within 30 days, the asset&#8217;s top and bottom had only seen price action amounting to less than 11%. Related Reading: Bitcoin Whales Show Most Active Hour In 3 Months As BTC Breaks $30,000 In the chart, Glassnode has also marked the historical instances where the asset moved in similarly tight or tighter 30-day price ranges. Following such tight price consolidation periods, BTC has generally always observed a sudden burst of volatility. Most of the time, this volatility has been in the upwards direction, as the tight 30-day ranges have preceded many rallies in the asset. The 2021 bull run, for example, saw a similarly narrow price range in its early buildup. Though most cases may have been like this, the volatility hasn&#8217;t always been bullish. During the 2018-19 bear market, the cryptocurrency saw a long stale price action, with the 30-day price range falling to pretty low values. This stagnation finally ended up being broken by the November 2018 crash. Therefore, the recent tight range that Bitcoin had been stuck under wasn&#8217;t certain to lead to bullish volatility. But fortunately for the coin, it would appear that the narrow range has decompressed into a rally this time, as the cryptocurrency has been able to enjoy a sharp jump toward the $30,000 mark. BTC Price At the time of writing, Bitcoin is trading around $29,800, up 19% in the last week. BTC has observed a rapid increase recently &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Glassnode.com"
  }
]