[
  {
    "source": "CoinDesk",
    "date": "2023-07-07T05:52:14.000Z",
    "title": "Sega Rethinks GameFi Plans, COO Calls Blockchain Gaming 'Boring': Bloomberg",
    "url": "https://www.coindesk.com/web3/2023/07/07/sega-rethinks-gamefi-plans-coo-calls-blockchain-gaming-boring-bloomberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Sega earlier promised it would carefully assess play-to-earn gaming models and NFTs to make sure its efforts in the space weren’t seen as “simply money making.”"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-07T05:52:21.000Z",
    "title": "Nifty News: Sega exec calls P2E games ‘boring,’ Tom Brady’s NFT firm switches it up and more",
    "url": "https://cointelegraph.com/news/nifty-news-sega-p2e-boring-tom-brady-moves-from-nfts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/74b00d06-d5d7-40fa-91cc-cf0f7e464dbd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sega is still reportedly licensing its lesser-known properties out for NFTs and blockchain games, but its best ones are being kept close.</p>\n                    <p><h3>Sega co-COO yawns at P2E games</h3><p>The co-chief operating officer of Sega has called play-to-earn games “boring” amid the firm’s retreat from franchising some of its hottest properties to the blockchain gaming space.</p><p>Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2023-07-06/sega-joins-blockchain-games-pullback-as-crypto-winter-persists\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on July 6 that Shuji Utsumi, the co-COO of the gaming company behind Sonic The Hedgehog, said Sega would shelve plans to develop blockchain games for now.</p><p>Third-party blockchain gaming projects would also not get access to Sega’s biggest franchises, with Utsumi adding:</p><p>“The action in play-to-earn games is boring, what’s the point if games are no fun?”</p><p>However, some of the less-known Sega titles will still get licensed for runs in nonfungible token (NFT) collections, its lesser franchises are getting blockchain games slated for announcements later this year and Sega is still pumping millions into related projects.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Breaking: Via <a href=\"https://twitter.com/Bloomberg?ref_src=twsrc%5Etfw\">@bloomberg</a>, SEGA Co-COO Shuji Utsumi has confirmed that SEGA’s biggest IPs, Sonic will not use blockchain, to avoid devaluing them. <a href=\"https://twitter.com/hashtag/SonicNews?src=hash&amp;ref_src=twsrc%5Etfw\">#SonicNews</a><br><br>They were non-committal on using Web3 for their fabled “super game.” <br><br>Source:  <a href=\"https://t.co/fgeVTRYHdB\">https://t.co/fgeVTRYHdB</a></p>&mdash; Sonic Stadium ✪ Sonic the Hedgehog Community (@sonicstadium) <a href=\"https://twitter.com/sonicstadium/status/1677111164994453504?ref_src=twsrc%5Etfw\">July 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>It's up in the air if the “super game” <a href=\"https://cointelegraph.com/news/natural-extension-sega-s-super-game-project-looking-to-add-nfts\">touted by Sega</a> for the last year — set for launch in 2026 — will still involve Web3 tech.</p><p>Utsumi believed the tech is useful for such cases as moving in-game items between gaming titles but Sega may hang back until the tech sees wider use.</p><p>“We’re looking into whether this technology is really going to take off in this industry, after all,” Utsumi said.</p><h3>Tom Brady’s NFT co. breaks up with NFTs</h3><p>Professional American football star Tom Brady is reportedly switching up the strategy for his NFT-focused startup Autograph — which is now moving away from NFTs.</p><p>On July 6 The New York Times <a href=\"https://www.nytimes.com/2023/07/06/technology/tom-brady-crypto-ftx.html\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> Autograph’s marketing has quietly removed crypto language, downplays terms such as NFT and has shifted focus away from marketing them with a new focus on helping stars generally spin up loyalty with their fans, according to people with knowledge of the firm.</p><p>Brady co-founded the company in 2021 with the aim of helping celebrities sell NFTs, scoring a <a href=\"https://cointelegraph.com/news/tom-brady-s-nft-platform-autograph-raises-170m-to-scale-operations\">$170 million Series B</a> in January 2022 and lining up NFT deals <a href=\"https://cointelegraph.com/news/espn-and-tom-brady-s-autograph-ink-multi-year-nft-deal\">with ESPN</a>, the pro golfing organization <a href=\"https://cointelegraph.com/news/nifty-news-the-sandbox-hosts-its-first-wedding-hollywood-actor-auctions-photo-of-eye-as-nft-and-more\">the PGA Tour</a> and others.</p><p>Autograph’s revenue supposedly tanked in 2022 in line with the wider crypto market, according to a person familiar with the firm's finances.</p><p>Brady’s reputation in crypto has suffered due to <a href=\"https://cointelegraph.com/news/celebs-who-got-burned-endorsing-crypto-and-those-that-got-away-with-it\">his ties</a> with the now-bankrupt crypto exchange FTX. He’s also named in a <a href=\"https://cointelegraph.com/news/lawsuit-against-ftx-celebrity-promoters-gets-backup-from-former-exec\">class action lawsuit</a> aimed at alleged celebrity promotors of the exchange.</p><h3>No need for Euro Metaverse regulations…yet: EU competition chief</h3><p>Metaverses and those who create them won’t need to worry about specific regulations — at least not yet in the European Union (EU). </p><p>Reuters <a href=\"https://www.reuters.com/technology/vestager-says-no-concerns-about-metaverse-sees-no-regulation-yet-2023-07-06/\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on June 6 that EU competition commissioner Margrethe Vestager said there haven’t been any concerns triggered over the space even though Tech Giants Microsoft, Meta and now Apple have together poured billions into trying to corner the nascent sector.</p><p>The big spending by a small concentration of companies in a new market raises no competition concerns for Vestager:</p><blockquote>\"Actually we see that there is a lot of innovation when it comes to virtual worlds. I don't think that any company can claim that they will own it, so to speak, but that is what we hope to find out.\"</blockquote><p>Existing EU laws around market monopolies, privacy and the <a href=\"https://cointelegraph.com/news/european-union-ai-act-passes-in-parliament\">incoming rules</a> on artificial intelligence can also be applied to the Metaverse according to Vestager.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Alphabet?src=hash&amp;ref_src=twsrc%5Etfw\">#Alphabet</a><a href=\"https://twitter.com/hashtag/Amazon?src=hash&amp;ref_src=twsrc%5Etfw\">#Amazon</a><a href=\"https://twitter.com/hashtag/Apple?src=hash&amp;ref_src=twsrc%5Etfw\">#Apple</a><a href=\"https://twitter.com/hashtag/ByteDance?src=hash&amp;ref_src=twsrc%5Etfw\">#ByteDance</a><a href=\"https://twitter.com/hashtag/Meta?src=hash&amp;ref_src=twsrc%5Etfw\">#Meta</a><a href=\"https://twitter.com/hashtag/Microsoft?src=hash&amp;ref_src=twsrc%5Etfw\">#Microsoft</a><a href=\"https://twitter.com/hashtag/Samsung?src=hash&amp;ref_src=twsrc%5Etfw\">#Samsung</a><br><br>⬆️the <a href=\"https://twitter.com/hashtag/platforms?src=hash&amp;ref_src=twsrc%5Etfw\">#platforms</a> that notified us under the <a href=\"https://twitter.com/hashtag/DMA?src=hash&amp;ref_src=twsrc%5Etfw\">#DMA</a><br>If confirmed as gatekeepers, they will need to comply with <a href=\"https://twitter.com/hashtag/DMA?src=hash&amp;ref_src=twsrc%5Etfw\">#DMA</a> keep markets fair &amp; open, for us to have wide and affordable choices online<br><br><a href=\"https://t.co/0tqmE02r1u\">https://t.co/0tqmE02r1u</a> <a href=\"https://t.co/h4wn3mUGKc\">pic.twitter.com/h4wn3mUGKc</a></p>&mdash; Margrethe Vestager (@vestager) <a href=\"https://twitter.com/vestager/status/1676139927946264576?ref_src=twsrc%5Etfw\">July 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>\"In Europe, now we have a body of digital legislation, she added. “I think we do have time to explore, to know that we should not jump to regulation as the first sort of safety pad.\"</p><p>She said next week she will present a metaverse-related initiative aimed at helping antitrust regulators understand the space.</p><h3>Major League Baseball gets new virtual ballpark</h3><p>U.S. professional baseball is getting a stadium in the Metaverse, apparently, the first professional league to own a virtual world for fans to gather in.</p><p>On July 5, metaverse tech firm Improbable <a href=\"https://www.businesswire.com/news/home/20230705842181/en/Improbable-Builds-Major-League-Baseball%E2%80%99s-New-Virtual-Ballpark-That-Launches-During-the-MLB-All-Star-Celebrity-Softball-Game-Presented-by-Corona\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> the new virtual space, giving it the inventive title of “MLB virtual ballpark.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/secret-service-reveals-more-about-its-nft-collection\"><strong><em>Yes, the Secret Service has an NFT collection, and no, it’s not for sale</em></strong></a></p><p>The virtual stadium was developed within Improbable’s “MSquared” network of interoperable Web3 metaverses. Improbable also helped NFT conglomerate Yuga Labs build its Otherside metaverse.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">⚾️ Announcing the launch of the all-new <a href=\"https://twitter.com/MLB?ref_src=twsrc%5Etfw\">@MLB</a> virtual ballpark. ( 1/7)<br><br>The <a href=\"https://twitter.com/hashtag/MLB?src=hash&amp;ref_src=twsrc%5Etfw\">#MLB</a> virtual ballpark will allow fans to gather and interact simultaneously in a single place, making it the 1st service to host such large interactive sports experiences. <a href=\"https://t.co/dA9v0iXiAI\">pic.twitter.com/dA9v0iXiAI</a></p>&mdash; Improbable (@Improbableio) <a href=\"https://twitter.com/Improbableio/status/1676567356573712386?ref_src=twsrc%5Etfw\">July 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>MLB’s executive VP of media and business development, Kenny Gersh, said “not everyone has the opportunity to attend Major League games” but now that’s been opened “to anyone with an internet connection.”</p><p>Improbable founder and CEO, Herman Narula, believed the tech could help with “creating and selling [...] Digital assets.” The League has an existing partnership with the NFT platform Candy Digital. </p><h3>Other Nifty News</h3><p>NFT royalties on Ethereum are at a <a href=\"https://cointelegraph.com/news/ethereum-nft-royalties-hit-two-year-low-as-bored-ape-floor-price-falls-below-30-eth\">two-year low</a> according to data shared with Cointelegraph by analytics firm Nansen. The royalty drop comes as the floor price of Yuga’s flagship Bored Ape Yacht Club (BAYC) NFTs are also hitting a dip.</p><p>Animoca Brands co-founder Yat Siu told Cointelegraph <a href=\"https://cointelegraph.com/news/animoca-still-bullish-on-blockchain-games-awaits-license-for-metaverse-fund\">the firm is optimistic</a> about the blockchain gaming sector and said it’s looking for a license before putting its $800 million metaverse fund to work.</p><p><strong><em>NFT Collector: </em></strong><a href=\"https://cointelegraph.com/magazine/nft-collector-snoop-nft-passport-the-goose-millennials-sothebys/\"><strong><em>Snoop’s NFT nostalgia, The Goose draws Gen Y to Sotheby’s</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-07T05:41:00.000Z",
    "title": "BarnBridge DAO calls halt to ‘all work’ on DeFi protocol amid SEC probe",
    "url": "https://cointelegraph.com/news/barnbridge-dao-calls-halt-on-work-amid-sec-investigation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/b5e4173d-9ed5-4415-a078-48e6d3171992.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Some DAO members joked about the situation while others believed there may be an ulterior motive at play.</p>\n                    <p><p>BarnBridge DAO members have been told to pause “all work” related to the project after a reported probe by the United States Securities and Exchange Commission (SEC).</p><p>In a July 6 <a href=\"https://discord.com/invite/3waVcMa\" target=\"_blank\" rel=\"noopener nofollow\">post</a> to the platform’s Discord channel, Douglas Park, a lawyer for the <a href=\"https://cointelegraph.com/learn/what-is-a-dao\">decentralized autonomous organization</a> revealed the news to members.</p><p>“I am letting you know that the Securities and Exchange Commission is investigating BarnBridge DAO and individuals associated with the DAO,” Park said.</p><blockquote class=\"twitter-tweet\"><p lang=\"zxx\" dir=\"ltr\"><a href=\"https://t.co/ChsjBuGEzM\">pic.twitter.com/ChsjBuGEzM</a></p>&mdash; BarnBridge (@Barn_Bridge) <a href=\"https://twitter.com/Barn_Bridge/status/1677110787780018176?ref_src=twsrc%5Etfw\">July 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In order to “reduce potential further legal liability,” Park suggested “all work” on BarnBridge-related products should stop — including the closure of liquidity pools — and that individuals should not receive compensation for work flowing from the investment efforts of the DAO.</p><p>Co-founder Tyler Ward, presumably dubbed “Lord Tyler” on Discord, confirmed Park’s message was true on BarnBridge’s Discord shortly after.</p><p>Park and Ward didn’t explain why the SEC launched a probe into BarnBridge DAO. Park however explained that because the investigation is “ongoing” and “non-public,” only limited information can be shared.</p><p>Between June 30 and July 3, 100% of BarnBridge (BOND) token holders — <a href=\"https://snapshot.org/#/barnbridge.eth/proposal/0xe15b973f59e8410452005c4b8a74352f97215203e8093a5af37438575c2ff241\" target=\"_blank\" rel=\"noopener nofollow\">voted</a> on a proposal to retain the law firm Park &amp; Dibadj LLP — of which Park is the managing partner — as legal counsel for the DAO “for various legal work.”</p><p>213,000 votes were cast and 201,000, or 94.3%, of them came from the wallet “barnbridge.eth.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/cdcc61d6-3741-45c0-a348-15fcc6c36881.png\"  /><figcaption style=\"text-align: center;\"><em>100% of the 213,000 BOND tokens were placed in favor of the proposal. Source: Snapshot</em></figcaption></figure><p>The timing and subject of the proposal may suggest the SEC launched an investigation into BarnBridge DAO before June 30.</p><p>Some DAO members have raised suspicions over the announcement, however.</p><p>One member of the Discord asked for supporting evidence of the <a href=\"https://cointelegraph.com/news/we-had-to-change-strategies-says-sec-enforcement-director-on-recent-actions-report\">SEC’s investigation</a> and implied BarnBridge’s founders may be using it as an excuse to facilitate an “exit strategy” to potentially defraud investors.</p><p>Ward refuted the claim stating it would be the “worst thought-out rug attempt in history.”</p><p>Other members took the news more lightheartedly with one saying it’s “time to move to Europe” — suggesting DAO members could hide from the SEC.</p><p>Another jokingly stated that anyone who interacted with BarnBridge would be “shot” by SEC chair Gary Gensler “on live TV” — alluding to his tough stance on crypto.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/d0c7b585-5c3b-4035-a1bc-ad3db3640a8e.jpg\"  /><figcaption style=\"text-align: center;\"><em>Mixed reactions were recieved from BarnBridge DAO members on Discord. Source: Discord</em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/this-little-known-defi-crypto-token-has-rallied-over-800-in-a-month\"><strong><em>This little-known DeFi crypto token has rallied over 800% in a month </em></strong></a></p><p>BarnBridge is a cross-platform risk management DeFi protocol that attempts to tackle inflation risk and interest rate volatility. </p><p>Since the news emerged, the price of its native token BOND has fallen 1.9% to $3.12, <a href=\"https://www.coingecko.com/en/coins/barnbridge\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to CoinGecko. The token is down 98.3% since its all-time high price of $185.7 on Oct. 27, 2020, and currently has a market cap of $29 million.</p><p>Early last month, the SEC filed lawsuits against two of the industry’s largest exchanges <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">Binance</a> and <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">Coinbase,</a> alleging they offered unregistered securities. </p><p>The reported investigation into BarnBridge, a small to mid-sized DAO, could suggest the securities regulator isn’t just looking to target the crypto space's largest organizations.</p><p>Cointelegraph contacted the SEC for comment but did not receive an immediate response.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-is-hollywood-over-eth-founder-on-ai-wes-anderson-star-wars-robot-dogs-with-chatgpt-brains/\"><strong><em>AI Eye: ‘Biggest ever’ leap in AI, cool new tools, AIs are the real DAOs</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T06:06:20.000Z",
    "title": "Multichain MPC Bridge Experiences Massive Outflows, Triggering Concerns of Potential Exploit",
    "url": "https://www.cryptopolitan.com/multichain-mpc-bridge-massive-outflows/",
    "description": "In recent developments, the Multichain MPC bridge platform has witnessed significant outflows, with fears emerging of a potential exploit. Withdrawals exceeding half of the deposits in certain Multichain contracts on Ethereum have raised concerns among on-chain investigators and observers. This article delves into the details of the situation, explores the affected platforms, and highlights the ... <a title=\"Multichain MPC Bridge Experiences Massive Outflows, Triggering Concerns of Potential Exploit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/multichain-mpc-bridge-massive-outflows/\" aria-label=\"More on Multichain MPC Bridge Experiences Massive Outflows, Triggering Concerns of Potential Exploit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T05:48:47.000Z",
    "title": "Bitfinex Recovers $314K From 2016 Hack",
    "url": "https://www.cryptopolitan.com/bitfinex-recovers-314k-2016-hack-recovered/",
    "description": "Bitfinex, a prominent cryptocurrency exchange, has made significant progress in recovering funds lost during a notorious 2016 hack. In collaboration with the United States Department of Homeland Security and other law enforcement agencies, the exchange has retrieved $312,219 in cash and 6.9 Bitcoin Cash, valuing approximately $1,951 today.&#160; However, this recovery represents only a fraction ... <a title=\"Bitfinex Recovers $314K From 2016 Hack\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitfinex-recovers-314k-2016-hack-recovered/\" aria-label=\"More on Bitfinex Recovers $314K From 2016 Hack\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-07T06:00:15.000Z",
    "title": "Which ICO is Better — Golden Inu vs WallStreetMemes",
    "url": "https://www.crypto-news-flash.com/which-ico-is-better-golden-inu-vs-wallstreetmemes/?utm_source=rss&utm_medium=rss&utm_campaign=which-ico-is-better-golden-inu-vs-wallstreetmemes",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T084310.467.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T084310.467.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-07T084310.467-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />While mainstream cryptocurrencies deal with the hardships of dealing with regulatory pressures, memecoins have been surging in 2023. These types of tokens offer investors exciting prospects of significant returns.  Among the memecoin-craze of this year, two currencies stand out as one of the most promising new coins of the season.  WallStreetmemes, the new crypto inspired [...]"
  }
]