[
  {
    "source": "Decrypt",
    "date": "2023-06-22T10:20:02.000Z",
    "title": "Ripple Gains In-Principle Payments License in Singapore",
    "url": "https://decrypt.co/145750/ripple-gains-in-principle-payments-license-in-singapore",
    "description": "Ripple CEO Brad Garlinghouse said the approval reaffirmed the company’s commitment to the Asia-Pacific region."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-22T10:19:07.000Z",
    "title": "These 5 altcoins outperformed Bitcoin over the last 30 days",
    "url": "https://cryptoslate.com/these-5-tokens-outperformed-bitcoin-over-the-last-30-days/",
    "description": "<p>As Bitcoin surges amid a flurry of spot Bitcoin ETF applications from major institutional players, several altcoins have outperformed the leading cryptocurrency throughout June. STX experienced a staggering 72.3% gain in the last week, followed by PEPE and CFX, posting 67.8% and 43.8% increases, respectively. While ORDI, BCH, and KDA also experienced notable gains, ranging [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/these-5-tokens-outperformed-bitcoin-over-the-last-30-days/\">These 5 altcoins outperformed Bitcoin over the last 30 days</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-22T10:10:00.000Z",
    "title": "BTC Price Breaks $30,000, Crypto Daily TV 22/6/2023",
    "url": "https://cryptodaily.co.uk/2023/06/btc-price-breaks-30000-crypto-daily-tv-22-6-2023",
    "description": "In Todays Headline TV CryptoDaily News:\n<p></p>\n<p>MakerDAO boosts U.S. Treasury holding by $700 million </p>\n<p>Stablecoin issuer and decentralized finance protocol MakerDAO bought another $700 million U.S. Treasurys, taking the total in its DAI stablecoin reserve to $1.2 billion, the platform said in a press release.</p>\n<p>Stablecoins and DeFi to be next SEC targets</p>\n<p>Stablecoins and decentralized finance are likely to become the next targets in the U.S. Securities and Exchange Commission crackdown on the crypto industry, Berenberg said in a research report,</p>\n<p>Bitcoin breaks $30 000</p>\n<p>Bitcoin has broken $30,000 for the second time this year amid bullish sentiment in the market following a number of traditional finance players pushing further into crypto. The last time bitcoin reached above $30,000 was on April of 2023.</p>\nBTC/USD exploded 5.7% in the last session.\n<p>The Bitcoin-Dollar pair skyrocketed 5.7% in the last session. According to the RSI, we are in an overbought market. Support is at 26072.3333 and resistance at 29532.3333.</p>\n<p>The RSI points to an overbought market.</p>\n<p></p>\nETH/USD exploded 4.8% in the last session.\n<p>The Ethereum-Dollar pair skyrocketed 4.8% in the last session. The ROC is giving a positive signal. Support is at 1688.581 and resistance at 1844.781.</p>\n<p>The ROC is giving a positive signal.</p>\n<p></p>\nXRP/USD rose 0.7% in the last session.\n<p>Ripple rose 0.7% against the Dollar in the last trading session. The ROC's positive signal is in line with the overall technical analysis. Support is at 0.463 and resistance at 0.5113.</p>\n<p>The ROC is currently in the positive zone.</p>\n<p></p>\nLTC/USD exploded 5.7% in the last session.\n<p>The Litecoin-Dollar pair exploded 5.7% in the last session. The Stochastic indicator is giving a positive signal, which matches our overall technical analysis. Support is at 74.0367 and resistance at 83.9767.</p>\n<p>The Stochastic indicator is currently in positive territory.</p>\n<p></p>\nDaily Economic Calendar:\n<p>FR Business Climate in Manufacturing</p>\n<p>The Business Climate in Manufacturing is a survey of the current business conditions in the French manufacturing sector. The French Business Climate in Manufacturing will be released at 06:45 GMT, the UK's Monetary Policy Summary at 11:00 GMT, and the US Chicago Fed National Activity Index at 12:30 GMT.</p>\n<p>UK Monetary Policy Summary</p>\n<p>The Monetary Policy Summary contains the outcome of the vote on interest rates and other policy measures, along with commentary about the economic conditions that influenced the vote.</p>\n<p>US Chicago Fed National Activity Index</p>\n<p>The Chicago Fed National Activity Index, released by Federal Reserve Bank of Chicago, is a monthly index designed to gauge overall economic activity and related inflationary pressure.</p>\n<p>JP National Consumer Price Index</p>\n<p>The National Consumer Price Index measures price movements obtained by comparing the retail prices of a representative shopping basket of goods and services. Japan's National Consumer Price Index will be released at 23:30 GMT, the Eurozone's Consumer Confidence at 14:00 GMT, the US Initial Jobless Claims at 12:30 GMT.</p>\n<p>EMU Consumer Confidence</p>\n<p>Consumer Confidence is a leading index that measures the level of consumer confidence in economic activity. </p>\n<p>US Initial Jobless Claims</p>\n<p>The Initial Jobless Claims measure the number of people filing first-time claims for state unemployment insurance. </p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T10:21:21.000Z",
    "title": "More Investors Are Moving from Sui (SUI) To VC Spectra (SPCT) – Here’s Why",
    "url": "https://www.cryptopolitan.com/more-investors-are-moving-from-sui-sui-to-vc-spectra-spct-heres-why/",
    "description": "In recent times, there has been a notable shift in market sentiment, as investors prefer VC Spectra (SPCT) to Sui (SUI). Although the price of Sui (SUI) has surged recently, investors are unconvinced about Sui’s low utility, worsened by increased market volatility.&#160; On the other hand, VC Spectra (SPCT) offers diverse investment opportunities, making it ... <a title=\"More Investors Are Moving from Sui (SUI) To VC Spectra (SPCT) – Here’s Why\" class=\"read-more\" href=\"https://www.cryptopolitan.com/more-investors-are-moving-from-sui-sui-to-vc-spectra-spct-heres-why/\" aria-label=\"More on More Investors Are Moving from Sui (SUI) To VC Spectra (SPCT) – Here’s Why\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T10:15:43.000Z",
    "title": "Why is the crypto market up today? BTC at $30k",
    "url": "https://www.cryptopolitan.com/why-is-the-crypto-market-up-today-btc-at-30k/",
    "description": "Today, both the total Crypto Market Cap (TOTALCAP ) and the price of Bitcoin (BTC ) moved above their respective corrective patterns and are nearing new yearly highs. The crypto market is up today as Bitcoin, Cardano, Ether, and numerous altcoins surged after multiple large institutions filed for Bitcoin ETFs in the United States, following ... <a title=\"Why is the crypto market up today? BTC at $30k\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-is-the-crypto-market-up-today-btc-at-30k/\" aria-label=\"More on Why is the crypto market up today? BTC at $30k\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-22T10:21:43.000Z",
    "title": "When BlackRock Bitcoin ETF? Detailed Timeline And Implications",
    "url": "https://www.newsbtc.com/news/bitcoin/when-blackrock-bitcoin-etf-timeline-implications/",
    "description": "BlackRock&#8217;s filing for a Bitcoin spot ETF (iShares Bitcoin Trust) has breathed new life into the market and sparked a strong rally. The hope is that BlackRock will trigger a &#8220;Great Accumulation Race&#8221; around Bitcoin, fuelled by the fact that 69% of all investors have been unwilling to sell their Bitcoins for over a year, Bitcoinist reported. Market experts give the BlackRock ETF a high chance of approval. Remarkably, BlackRock has an approval ratio of 575:1, but the US Securities and Exchange Commission&#8217;s (SEC) ratio when it comes to rejecting Bitcoin spot ETFs is just as clear: 33:0. But because BlackRock has close ties to US regulators and Democratic politicians, there is room for an optimistic outlook on the likelihood of approval. As K33 Research writes in their latest market analysis, BlackRock is unlikely to spend time and resources if they do not see the chance of approval as very high. Race For The First Bitcoin Spot ETF Rumors have already emerged in recent days that BlackRock&#8217;s ETF filing could be decided within &#8220;days to weeks&#8221;, NewsBTC reported. But what are the exact deadlines? The SEC&#8217;s regulations provide a clue. The important thing to know here is that the deadlines for the SEC and its decision on the iShares Bitcoin Trust depend on when the application is published in the Federal Register for comments. Since this has not officially happened yet, there are only approximate estimates so far. Related Reading: “Yes, This Is A Bull Market” Expert Explains Why Bitcoin Will Outperform Tesla’s +162% Nevertheless, K33 Research has drawn up a rough timeline based on the SEC&#8217;s deadlines. Theoretically, a decision can be reached within four time intervals, with the decision process following a scheme of anchored decision dates. After publication of the application in the Federal Register, the SEC has 45 days in the first time interval to approve, reject or extend review of the ETF. Assuming the application is published in the Register on June 29, the SEC&#8217;s first deadline would be August 12, 2023. Similar inflection points occur 45 days later, 90 days later and 60 days later. When BlackRock #Bitcoin spot ETF? Timeline depends on the publication in the Federal Register. Assuming July 29: August 12: Extend 45 days September 26: Extend 90 days December 25: Extend 60 days Final deadline: February 23, 2024. h/t @K33Research More details 👇 — Jake Simmons (@realJakeSimmons) June 22, 2023 K33 Research states that the SEC must announce a decision after 240 days at the latest. This means that the market will have a decision by February 23, 2024 at the latest (may be shifted by a few days depending on the publication in the Federal Register). Will Grayscale Or CBOE Preempt BlackRock? Even though everyone is currently talking about BlackRock&#8217;s ETF filing, there is a possibility that two other institutions will get approval, or at least a decision on their matters, before the world&#8217;s largest asset manager. As K33 Research shows in its ETF schedule, the CBOE filed its &#8220;ARK 21Shares&#8221; before BlackRock and could potentially benefit from BlackRock&#8217;s momentum. Already on May 9, Cboe Global Markets filed to list and trade shares of a spot Bitcoin ETF from Cathie Woods Ark Invest and crypto investment product firm 21 on the Cboe BZX exchange. In addition, Grayscale could also receive a ruling ahead of BlackRock in its legal battle with the SEC. A final ruling on Grayscale&#8217;s lawsuit could be imminent. The final judgment is expected three to six months after the hearing. The hearing was held on March 7, 2023. The core of Grayscale&#8217;s lawsuit is that the SEC acted arbitrarily in approving futures-based ETFs and rejecting spot ETFs. Related Reading: Bitcoin Hits $138,000 On Binance US, What Happened? As K33 Research discusses, all market participants are currently in a race for first mover advantage. The launch of ProShares BITO clearly demonstrated this advantage. BITO saw $1bn in inflows two days after launch. To date, BITO has a 93% market share among futures-based long BTC ETFs. However, whoever wins the race, it seems clear at the moment that Bitcoin investors will be the winners. Head of resaerch at CryptoQuant, Julio Moreno, recently shared the chart below and commented: &#8220;Here&#8217;s what happens when a big fund [Grayscale&#8217;s GBTC] increases Bitcoin demand. At press time, the BTC price has taken a breather above $30,000 after yesterday&#8217;s rally and was trading at $30,150. Featured image from ETF Database, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-22T10:35:52.000Z",
    "title": "PEPE Coin Makes a Quantum Leap with a Jaw-Dropping 38% Surge – Is Now the Time to Fill Your Bags?",
    "url": "https://www.crypto-news-flash.com/pepe-coin-makes-a-quantum-leap-with-a-jaw-dropping-38-surge-is-now-the-time-to-fill-your-bags/?utm_source=rss&utm_medium=rss&utm_campaign=pepe-coin-makes-a-quantum-leap-with-a-jaw-dropping-38-surge-is-now-the-time-to-fill-your-bags",
    "description": "Pepe Coin, a meme cryptocurrency, witnesses a notable surge amid the crypto market&#8217;s revival, driven by institutional adoption and positive sentiment. As the digital asset market bounces back, Pepe Coin emerges as a top performer, reflecting the growing interest in meme coins. Is Now the Time to Fill Your Bags? Global meme coin phenomenon Pepe [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-22T10:17:39.000Z",
    "title": "ARB’s Price Gains 4+% As Dev Team Releases Array of Tools",
    "url": "https://coinedition.com/arbs-price-gains-4-as-dev-team-releases-array-of-tools/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Arbitrum-News-comes-with-a-price-analysis-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Yesterday, the Arbitrum (ARB) development team, Offchain Labs, announced on Twitter the release of a quickstart guide and tools to help make building an Arbitrum Orbit chain much easier. In a separate tweet, the crypto reporting platform, Wu Blockchain, shared some additional details about this new release. According to the second post, these new developments [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/arbs-price-gains-4-as-dev-team-releases-array-of-tools/\">ARB’s Price Gains 4+% As Dev Team Releases Array of Tools</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]