[
  {
    "source": "CryptoSlate",
    "date": "2023-12-26T20:30:30.000Z",
    "title": "KyberSwap cuts staff by 50% after $54M exploit",
    "url": "https://cryptoslate.com/kyberswap-cuts-staff-by-50-after-54m-exploit/",
    "description": "<p>KyberSwap, a leading decentralized exchange (DEX) aggregator, announced a 50% reduction in its workforce following a $54 million exploit earlier this month. CEO and co-founder Victor Tran announced the decision on social media on Dec. 24. Elastic fallout The cuts come as the company grapples with the fallout of the &#8220;Elastic exploit,&#8221; which compromised its [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/kyberswap-cuts-staff-by-50-after-54m-exploit/\">KyberSwap cuts staff by 50% after $54M exploit</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T20:35:33.000Z",
    "title": "Kyber Network takes bold steps to rebuild after security breach",
    "url": "https://www.cryptopolitan.com/kyber-network-takes-bold-steps-to-rebuild/",
    "description": "Decentralized Finance (DeFi) firm Kyber Network is determined to bounce back after a recent security breach, pledging to reimburse affected users while rejecting the hacker&#8217;s audacious demands to take control of the company.&#160; Victor Tran, CEO and co-founder of Kyber Network, announced a significant workforce reduction of 50% on December 24 as part of the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T20:32:13.000Z",
    "title": "Bitcoin loses ground as altcoins take center stage in futures trading",
    "url": "https://www.cryptopolitan.com/altcoins-overtake-bitcoin-in-futures-trading/",
    "description": "As 2023 draws to a close, the cryptocurrency market is witnessing a significant shift in its landscape. Bitcoin, once the undisputed king of the crypto world, is seeing its dominance wane in the futures market altcoins start to take the spotlight. This shift marks a crucial turning point in the ever-evolving digital currency space. Dwindling [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T20:27:52.000Z",
    "title": "Exciting Scientific Advances of 2023",
    "url": "https://www.cryptopolitan.com/exciting-scientific-advances-of-2023/",
    "description": "In 2023, the world witnessed remarkable scientific breakthroughs that have the potential to reshape our future. Despite facing numerous challenges, the year brought forth significant advancements in various fields, offering hope and optimism.&#160; AI chatbots revolutionize communication At the forefront of scientific progress in 2023 was the rapid development of large language models, epitomized by [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T20:23:17.000Z",
    "title": "Scammers steal $3M in crypto in 24-hour google Ads phishing blitz",
    "url": "https://www.cryptopolitan.com/scammers-steal-3m-in-crypto-in-24-hour/",
    "description": "In a stunning turn of events, scammers managed to pilfer a staggering $3 million worth of cryptocurrencies in a 24-hour spree by leveraging Google Ads to lure unsuspecting victims into malicious fake websites. These websites deployed wallet-draining software, targeting crypto enthusiasts during the holiday season.&#160; According to Scam Sniffer, a leading security firm, the attackers [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T20:18:19.000Z",
    "title": "The Future of Generative AI: Balancing Innovation and Regulation",
    "url": "https://www.cryptopolitan.com/the-future-of-generative-ai-balancing-innovation/",
    "description": "With the advent of OpenAI&#8217;s ChatGPT platform in late 2022, generative artificial intelligence (AI) has captured the imagination of the public and attracted significant private investment. This technology has spurred discussions about its potential and the challenges it presents, particularly in the realm of intellectual property and regulation.&#160; The IP conundrum: Generative AI, exemplified by [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-26T20:13:21.000Z",
    "title": "Solana’s new role as Ethereum layer-2 explored by Yakovenko",
    "url": "https://www.cryptopolitan.com/solana-new-role-as-ethereum-layer-2-explored/",
    "description": "In a recent development that could significantly impact the blockchain landscape, Anatoly Yakovenko, co-founder of Solana, has made a striking assertion about the relationship between Solana (SOL) and Ethereum (ETH). In a post on the social media platform X, Yakovenko stated that Solana is, in effect, Ethereum, pointing towards a future where the two blockchain [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-26T20:10:51.000Z",
    "title": "Modest investors turned into millionaires via Solana rally",
    "url": "https://crypto.news/modest-investors-turned-into-millionaires-via-solana-rally/",
    "description": "Solana’s over 87% surge in December has made several millionaires in the past weeks, some on less than a $100 investment. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-26T20:30:38.000Z",
    "title": "2023’s Crypto Bounty: These Top 13 Airdrops Distributed Over $4 Billion",
    "url": "https://www.newsbtc.com/altcoin/2023s-crypto-bounty-these-top-13-airdrops-distributed/",
    "description": "023 has emerged as a significant year for crypto airdrops. A recent analysis revealed that out of the 50 most substantial crypto airdrops since 2020, 13 occurred in 2023, collectively distributing roughly $4.56 billion worth of tokens. These figures are calculated based on the tokens&#8217; values at their respective all-time highs (ATHs), painting a picture of substantial distribution. The year 2023&#8217;s airdrop landscape was less crowded than 2021, which had 18 entries in the top 50, but the impact was notable. A report from CoinGecko highlights this trend shift, contrasting it with the mere 5 airdrops in 2020 and 14 in 2022. Related Reading: Arbitrum Network Faces Major Outage, ARB Token Faces 4% Decline Arbitrum Leads 2023&#8217;s Airdrop Charge Arbitrum, an Ethereum layer 2 scaling solution, topped the 2023 airdrop chart by distributing ARB tokens valued at $1.96 billion on March 23. This move significantly impacted its total value locked (TVL), which surged by 147% during the anticipation period. This airdrop alone constituted a substantial portion of the total value distributed in the year. Celestia, with its TIA tokens, followed suit, distributing $728 million on October 31. The airdrop targeted a diverse group, including developers, Ethereum rollup users, and stakeholders in the Cosmos Hub and Osmosis. Blur’s first airdrop, which handed out $446 million worth of BLUR on February 14, ranked third. The success of this initial airdrop set the stage for a second, which distributed an additional $327 million, ranking fourth. A Closer Look At 2023&#8217;s Crypto Airdrop Trends While Arbitrum, Celestia, and Blur&#8217;s first airdrop made up 69.9% of the total airdrop value in 2023, the year saw diverse contributions across the sector. Jito, Worldcoin, Aidoge, and other projects followed, each adding to the cumulative value and diversity of the airdrops. The total value distributed in 2023 may have seen a decline compared to 2022, but it&#8217;s essential to consider the market cycles these newer tokens have experienced. Unlike earlier tokens which saw the 2021 bull market and the 2022 non-fungible token (NFT) market surge, many of 2023&#8217;s airdropped tokens are yet to undergo a full bull market cycle. Related Reading: Arbitrum Sale On Binance: How This Investment Firm Lost $465,000 In An ARB Trade In terms of performance, Arbitrum and Worldcoin have shown significant gains, with ARB rising by 22% in the past week to trade at $1.33, at the time of writing and WLD by over 60% in the past two weeks to trade at $3.86, at the time of writing. Celestia and Blur follow closely in terms of price appreciation, with both tokens up by 10.7% and 5.7% respectively in the past 7 days. Conversely, Jito, despite being the newest among them, has seen a dip in its value down by 9.4% in the past two weeks but shows signs of recovery in the past week, up by 9%, illustrating the dynamic and often unpredictable nature of token valuations post-airdrop. Featured image from iStock, Chart from TradingView"
  }
]