[
  {
    "source": "Decrypt",
    "date": "2023-06-26T13:01:03.000Z",
    "title": "Azuki Expands With New 20K Ethereum NFT Collection, Elementals",
    "url": "https://decrypt.co/146153/azuki-expands-new-20k-ethereum-nft-collection-elementals",
    "description": "The Azuki Elementals collection will go on sale via Dutch auction on Tuesday, with a starting price of 2 ETH per NFT."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-26T13:01:02.000Z",
    "title": "Crypto Needs ‘Time-Tested Standards’ of Wall Street, Says Anchorage Digital’s Trading Boss",
    "url": "https://decrypt.co/146141/crypto-needs-time-tested-standards-of-wall-street-says-anchorage-digitals-trading-boss",
    "description": "Lincoln Bartlett left traditional finance for Anchorage Digital last year but has kept institutional best practices top of mind."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-26T12:46:02.000Z",
    "title": "Nigeria’s Crypto Tax Signals Slow Walk to Official Recognition—But Will People Pay Up?",
    "url": "https://decrypt.co/145940/nigerias-crypto-tax-signals-slow-walk-to-official-recognition-but-will-people-pay-up",
    "description": "As Nigeria grapples with mounting debt and dwindling revenue, authorities are turning to crypto taxation to shore up its coffers."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-26T12:47:52.000Z",
    "title": "HSBC’s Hong Kong customers can now trade Bitcoin, Ethereum futures ETFs",
    "url": "https://cryptoslate.com/hsbcs-hong-kong-customers-can-now-trade-bitcoin-ethereum-futures-etfs/",
    "description": "<p>HSBC customers in Hong Kong can now buy Bitcoin (BTC) and Ethereum (ETH) futures ETFs, per crypto reporter Colin Wu. Wu wrote: &#8220;The move will expand local users’ exposure to cryptocurrencies in Hong Kong.&#8220; Presently, in the region, cryptocurrency ETFs such as CSOP Bitcoin Futures ETF, CSOP Ethereum Futures ETF, and Samsung Bitcoin Futures Active [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/hsbcs-hong-kong-customers-can-now-trade-bitcoin-ethereum-futures-etfs/\">HSBC&#8217;s Hong Kong customers can now trade Bitcoin, Ethereum futures ETFs</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-26T13:05:28.000Z",
    "title": "MetaBlaze Announces $4M Crypto Presale Sellout, Gaming Partnerships, and AI MetaChip NFT Drop",
    "url": "https://cryptodaily.co.uk/2023/06/metablaze-announces-4m-crypto-presale-sellout-gaming-partnerships-and-ai-metachip-nft-drop",
    "description": "<p>Dover, USA, June 26th, 2023, Chainwire</p><p>MetaBlaze, a pioneering Web 3 Gaming, and AI Company, is building momentum as they approach its upcoming Q3 launch. Between strategic partnerships with household Crypto Gaming brands, a sold-out presale, and a never-before-seen AI-Integrated NFT collection, the MetaBlaze ecosystem is primed for its next evolution stage.</p><p>MetaBlaze Reaches $4M Presale HardCap Despite Crypto Winter</p><p>While the Web 3 Gaming industry has languished throughout 2022 and 2023, MetaBlaze has charged forward, going from strength to strength. Its community presale announces a filled hard cap, raising an impressive USD 4 million, with over two thousand and two-hundred holders.&nbsp;</p><p>This achievement is a testament to the unwavering support from MetaBlaze's enthusiastic community, who are buoyed and inspired by the vision, scope, and potential exhibited by the MetaBlaze team. The Company is now looking forward to the anticipated launch of its native mblz token on September 15th, which will be available on several centralized and decentralized crypto exchanges.</p><p>MetaBlaze Kickstarts Expansion with Two Key Strategic Partnerships</p><p></p><p>MetaBlaze is proud to announce partnerships with two of the most prominent Gaming Guilds in Web3.</p><p>These partnerships represent a significant milestone in MetaBlaze's journey, as they bring together some of the most respected names in the gaming guilds space.</p><p>MetaBlaze and Glip.gg have teamed up to positively impact the Web3 gaming space. Glip.gg is a renowned Gaming Guild with over ten million mobile app downloads. Leveraging their wealth of experience and vibrant player community, Glip.gg is poised to help MetaBlaze reach millions of players. Together, they plan to reshape Web3 gaming with MetaBlaze's innovative Craft-to-Earn and Solve-to-Earn experiences, interweaving with dynamic storytelling.&nbsp;</p><p>MetaBlaze has also entered into a strategic partnership with IndiGG, an affiliate of the esteemed Yield Guild Games (YGG) DAO, backed by Polygon Studios. IndiGG operates as a regional subDAO, concentrating on augmenting play-to-earn prospects. Their primary objective is to engage the vast population of passionate global gamers. Through this collaboration, MetaBlaze and Indi.gg aim to bring about a transformative shift in Web3 gaming.</p><p>MetaBlaze has established valuable partnerships to reach more players, elevate its game development, aiming to enhance gameplay for web3 gamers and deliver distinct MetaBlaze experiences that stand out in an increasingly competitive arena. </p><p>MetaBlaze is sets a new precedent with innovative Craft-to-Earn &amp; Solve-to-Earn mechanics, which incentivize players to showcase their creative crafting, problem-solving, and critical thinking skills. These mechanics ensure that each player's experience is just as dynamic as it is unique.</p><p>At its core, the MetaBlaze ecosystem promotes interoperability and sustainability. Its unique gamenomics are designed to breathe new life into these iconic and established Gaming Guilds and reimagine the expectations of the Web 3 Gaming space, further enhancing the MetaBlaze universe, and creating a more immersive and rewarding experience for players.</p>Unveiling The Industry's First Ever AI-Powered NFTs<p></p><p>Launching tomorrow, June 27th, MetaBlaze's AI MetaChip NFT brings disruptive new utility to the NFT industry. The AI MetaChip represents a significant advancement in the NFT space. It is a first-of-its-kind digital asset that enables players to metamorphose their coveted MetaBlaze NFTs into a responsive and adaptive AI-powered Galaxian Guide.</p><p>The Galaxian Guide, an in-game companion, is designed to help players navigate the challenges and mysteries within the MetaBlaze Universe, experiencing and interacting with in-game content organically alongside gamers as events unfold. The Galaxian Guide provides MetaBlaze players with dynamic intelligence and guidance, unlocking their creativity, enhancing gameplay, and increasing their chances of success.</p><p>Fully compatible with existing MetaBlaze NFTs, The AI MetaChip integrates seamlessly with MetaBlaze NFTs and gives players a competitive edge when navigating through mysteries and enigmas within the Universe.</p><p>The Galaxian Guide reimagines the possibilities of NFT technology, incorporating AI in an unprecedented manner within the Web 3 gaming industry and enhancing gaming experiences for players.</p><p>With a limited collection of only 1,000 NFTs and a full allowlist, the AI MetaChip NFT drop has generated significant interest. This ultra-limited collection presents a unique opportunity for players and collectors to seize this historic moment in Web 3 Gaming. Minting goes live tomorrow, June 27th.</p><p>An exclusive offering also includes an NFT Bundle, consisting of 1 AI MetaChip and 3 MetaGoblins NFTs.</p><p>Mint AI MetaChip NFT</p><p>About MetaBlaze</p><p>MetaBlaze combines AI and blockchain technology to craft immersive Web3 experiences through gaming, captivating storytelling, and purpose-driven digital assets.</p><p>For more updates and news about our MetaBlaze:</p><p>Official Website | Telegram | Twitter | Instagram | YouTube</p>ContactCEOMichelleMetaBlazeInfo@MetaBlazeToken.com"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-26T12:59:40.000Z",
    "title": "Japan Offers Crypto Companies a 30% Tax Break",
    "url": "https://cryptodaily.co.uk/2023/06/japan-offers-crypto-companies-a-30-tax-break",
    "description": "<p>The Japanese tax administration has offered companies that issue cryptocurrencies a 30% tax break under a revision of its corporate tax rules. </p>\n<p>Japan&rsquo;s National Tax Agency (NTA) has revised its corporate tax rules to provide a tax exemption to companies issuing cryptocurrencies. Under the revised regulations, companies will no longer be taxed on unrealized gains. Under the previous rules, companies issuing cryptocurrencies were taxed on unrealized gains at the end of a tax period.</p>\n<p>The NTA explained that companies&rsquo; holdings would be excluded from the market evaluation of a company&rsquo;s assets if specific terms are met.</p>\n<p>Japan&rsquo;s previously harsh tax regulations forced many domestically established crypto and blockchain firms to set up shop elsewhere. Japan&rsquo;s ruling Liberal Democratic Party (LDP) approved the proposal for the revised rules in December to improve business conditions for companies issuing cryptocurrencies in Japan.</p>\nJapan Introduces Stricter AML Measures\n<p>The Japanese crypto industry is changing after introducing stricter anti-money laundering (AML) procedures. Since June 1, tougher AML measures were introduced to trace crypto transactions to align Japan&rsquo;s legal framework with international crypto laws after its AML measures were found to be lacking by the Financial Action Task Force. The cabinet revised the relevant crypto rules in December, focusing on monitoring the movement of illicit funds under the pretext of legal crypto transactions.</p>\n<p>Japan is such a significant player in the global crypto market, and the government was forced to address the risk associated with the industry.</p>\n<p>Part of Japan&rsquo;s stricter policy includes the enforcement of the &ldquo;Travel Rule.&rdquo; The Travel Rule aims to ensure the precise monitoring of illicit proceeds. Under this rule, any financial institution processing a crypto transfer exceeding $3,000 must share customer information with the recipient exchange or institution.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-26T13:00:04.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Drops Below $31,000, After Becoming Overbought ",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-drops-below-31000-after-becoming-overbought/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146701713-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC Moves Higher, as Traders Prepare for Next Week&#039;s Fed Meeting\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146701713-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146701713-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146701713-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146701713-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146701713-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146701713-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146701713.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin fell below $31,000 to start the week, as traders seemingly moved to secure gains, as the cryptocurrency became overbought. The relative strength index (RSI) rose to its highest point since January, prompting bears to reenter the market. Ethereum also declined, falling below $1,900. Bitcoin Bitcoin (BTC) moved marginally lower to start the week, as [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T13:02:26.000Z",
    "title": "MetaBlaze Announces $4M Crypto Presale Sellout, Gaming Partnerships, and AI MetaChip NFT Drop",
    "url": "https://www.cryptopolitan.com/metablaze-announces-4m-crypto-presale-sellout-gaming-partnerships-and-ai-metachip-nft-drop/",
    "description": "Dover, USA, June 26th, 2023, Chainwire MetaBlaze, a pioneering Web 3 Gaming, and AI Company, is building momentum as they approach its upcoming Q3 launch. Between strategic partnerships with household Crypto Gaming brands, a sold-out presale, and a never-before-seen AI-Integrated NFT collection, the MetaBlaze ecosystem is primed for its next evolution stage. MetaBlaze Reaches $4M ... <a title=\"MetaBlaze Announces $4M Crypto Presale Sellout, Gaming Partnerships, and AI MetaChip NFT Drop\" class=\"read-more\" href=\"https://www.cryptopolitan.com/metablaze-announces-4m-crypto-presale-sellout-gaming-partnerships-and-ai-metachip-nft-drop/\" aria-label=\"More on MetaBlaze Announces $4M Crypto Presale Sellout, Gaming Partnerships, and AI MetaChip NFT Drop\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T12:53:13.000Z",
    "title": "AI and ML Integration To Boost Fog Computing Market Up to $274.52B by 2030",
    "url": "https://www.cryptopolitan.com/ai-and-ml-boost-fog-computing-market/",
    "description": "According to the latest research report by SkyQuest Technology Consulting Pvt. Ltd., the global Fog Computing market is poised for substantial growth, with a projected market size of USD 4314.38 million by 2030. The market is expected to exhibit a CAGR of 6.6% during the forecast period from 2023 to 2030. The increasing demand for ... <a title=\"AI and ML Integration To Boost Fog Computing Market Up to $274.52B by 2030\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-and-ml-boost-fog-computing-market/\" aria-label=\"More on AI and ML Integration To Boost Fog Computing Market Up to $274.52B by 2030\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-26T13:03:11.000Z",
    "title": "Japan grants tax exemption to token issuers",
    "url": "https://crypto.news/japan-grants-tax-exemption-to-token-issuers/",
    "description": "The National Tax Agency in Japan recently revised a law on June 20, exempting token issuers from paying corporate taxes on unrealized cryptocurrency gains."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T13:00:15.000Z",
    "title": "Crypto charts showing green, Tradecurve, Shiba Inu, and The Sandbox leading the way",
    "url": "https://www.crypto-news-flash.com/crypto-charts-showing-green-tradecurve-shiba-inu-and-the-sandbox-leading-the-way/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-charts-showing-green-tradecurve-shiba-inu-and-the-sandbox-leading-the-way",
    "description": "The broader crypto market has showcased green signs, and the market cap of the entire crypto industry went up by 2.7%. This was the result of a surge in the value of numerous cryptocurrencies, where Tradecurve, Shiba Inu, and The Sandbox have led the way due to their high growth.  Join us as we jump [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T13:00:08.000Z",
    "title": "MetaBlaze Announces $4M Crypto Presale Sellout, Gaming Partnerships, and AI MetaChip NFT Drop",
    "url": "https://www.crypto-news-flash.com/metablaze-announces-4m-crypto-presale-sellout-gaming-partnerships-and-ai-metachip-nft-drop/?utm_source=rss&utm_medium=rss&utm_campaign=metablaze-announces-4m-crypto-presale-sellout-gaming-partnerships-and-ai-metachip-nft-drop",
    "description": "Dover, USA, June 26th, 2023, Chainwire MetaBlaze, a pioneering Web 3 Gaming, and AI Company, is building momentum as they approach its upcoming Q3 launch. Between strategic partnerships with household Crypto Gaming brands, a sold-out presale, and a never-before-seen AI-Integrated NFT collection, the MetaBlaze ecosystem is primed for its next evolution stage. MetaBlaze Reaches $4M [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T12:47:47.000Z",
    "title": "Solana Fights to Regain Momentum: Post-SEC Lawsuit Struggle Impacts DEX Volumes and NFT Trading",
    "url": "https://www.crypto-news-flash.com/solana-fights-to-regain-momentum-post-sec-lawsuit-struggle-impacts-dex-volumes-and-nft-trading/?utm_source=rss&utm_medium=rss&utm_campaign=solana-fights-to-regain-momentum-post-sec-lawsuit-struggle-impacts-dex-volumes-and-nft-trading",
    "description": "Solana (SOL) has had a substantial 48% decline in network activity over the past 30 days.  Solana&#8217;s blue-chip NFTs witnessed a substantial surge in recent weeks.  Following the Securities and Exchange Commission&#8217;s (SEC) legal action against Coinbase and Binance, the crypto market, especially altcoins, faced adverse consequences. Over time, the repercussions expanded beyond token prices, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-26T13:00:00.000Z",
    "title": "DeFi Lending Protocol Soil Receives Regulatory Approval for Operations",
    "url": "https://coinedition.com/defi-lending-protocol-soil-receives-regulatory-approval-for-operations/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/DeFi_Lending_Protocol_Soil_Receives_Regulatory_Approval_for_Operations-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Soil, a blockchain-based lending protocol, has received confirmation from its local financial markets regulator, affirming that its planned operations comply with the jurisdiction&#8217;s regulations. In essence, Soil is now regulated, allowing investors in the blockchain to lend money to corporate outside the chain, assuring secure returns for investors and easy debt for businesses. Soil&#8217;s mission [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/defi-lending-protocol-soil-receives-regulatory-approval-for-operations/\">DeFi Lending Protocol Soil Receives Regulatory Approval for Operations</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-26T12:46:28.000Z",
    "title": "SPOs Notice Big Improvements in ADA Following 8.1.1 Node Release",
    "url": "https://coinedition.com/spos-notice-big-improvements-in-ada-following-8-1-1-node-release/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Cardanos-Much-Awaited-Vasil-Hard-Fork-Is-Complete-4-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Yesterday, Cardano (ADA) enthusiast Andrew Westberg shared on Twitter that the new 8.1.1 Cardano node has brought about remarkable enhancements. Several Stake Pool Operators (SPOs) have been reporting that BCSH pools experienced no missed slot leader checks in the current epoch as well. Although there are a few minor aspects that still require attention, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/spos-notice-big-improvements-in-ada-following-8-1-1-node-release/\">SPOs Notice Big Improvements in ADA Following 8.1.1 Node Release</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]