[
  {
    "source": "Cointelegraph",
    "date": "2023-09-15T23:01:44.000Z",
    "title": "Binance CEO responds to rumors, says US executive is 'taking a deserved break'",
    "url": "https://cointelegraph.com/news/binance-ceo-responds-to-rumors-says-us-executive-is-taking-a-deserved-break",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/40ef415a-e064-4af8-aec9-ad434f8c8a71.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Despite Brian Shroder resigning as CEO of the exchange’s US wing amid SEC and CFTC lawsuits, Binance CEO Changpeng Zhao claimed that the departure was normal.</p>\n                    <p><p>Binance Holdings CEO Changpeng Zhao (CZ) has shot down speculation surrounding the departure of Binance.US CEO Brian Shroder, noting that he is “taking a deserved break\" after a successful stint at the company.  </p><p>Binance.US is a subsidiary of Binance Holdings, and the U.S. based exchange has seen a handful of other top executives recently step down from the firm amid lawsuits from the Securities and Exchange Commission and Commodities Futures Trading Commission.  </p><p>In a Sept. 15 statement via X (Twitter), CZ urged people to \"ignore FUD\" around the recent shuffling of execs, as he suggested that Shroder was leaving the firm amicably after accomplishing everything he \"set out to do when he joined two years ago.\"</p><p>\"Under his leadership, Binance.US raised capital, improved its product and service offerings, solidified internal processes, and gained significant market share, all of which helped to build a more resilient company for the benefit of customers. We are grateful for his contributions,\" CZ said. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">There has been some speculation regarding recent management changes at <a href=\"https://twitter.com/BinanceUS?ref_src=twsrc%5Etfw\">@BinanceUS</a>. Brian Shroder is taking a deserved break after accomplishing what he set out to do when he joined two years ago. Under his leadership, <a href=\"https://t.co/hSHrrlF7o7\">https://t.co/hSHrrlF7o7</a> raised capital, improved its product…</p>&mdash; CZ  Binance (@cz_binance) <a href=\"https://twitter.com/cz_binance/status/1702750076647412146?ref_src=twsrc%5Etfw\">September 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Binance is <a href=\"https://cointelegraph.com/news/5-key-highlights-sec-lawsuit-binance\">facing lawsuits </a>from both the SEC and CFTC over several alleged violations of SEC and CFTC laws, including the alleged sale of unregistered securities and mishandling of customer funds. As part of its lawsuit, the SEC claimed that the US and international branches of Binance have illegally commingled funds between each other.</p><p>In the midst of this lawsuit, Binance.US announced on September 13 that it was laying off a third of its staff and that <a href=\"https://cointelegraph.com/news/binance-us-cuts-third-of-staff-ceo-brian-shroder-leaves-report\">Shroder was leaving his position as CEO</a>. On September 14, <a href=\"https://cointelegraph.com/news/two-more-top-executives-depart-binance-us-amid-layoffs-sec-action-report\">an additional two executive departures were reported</a> as both head of legal Krishna Juvvadi and chief risk officer Sidney Majalya decided to quit the company. The departures fueled speculation on Twitter that Binance may be facing worse legal troubles than previously understood.</p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/binance-us-not-cooperating-sec-investigation\"><strong>Binance.US not cooperating with investigation, US SEC says in filing</strong></a></p><p>Seemingly referencing the lawsuits in his X post, CZ also asserted that the crypto market “is in a different place now than  it was two years ago,” as crypto firms face an “increasingly hostile regulatory environment.” In his view, the new CEO for Binance.US, Norman  Reed, is the “right person” to lead the US exchange in this new era.</p><p>Binance is the largest crypto exchange by volume in the world. It has come under increasing criticism since the third-largest exchange, FTX, <a href=\"https://cointelegraph.com/news/ftx-ftx-us-and-alameda-file-for-chapter-11-bankruptcy-in-us-sbf-resigns#:~:text=In%20a%20Nov.%2011%20tweet%2C%20FTX%20said%20roughly,position%20and%20will%20be%20succeeded%20by%20John%20Ray.\">went bankrupt in November</a> and FTX executives were <a href=\"https://cointelegraph.com/news/indictment-against-sbf-unsealed-contains-8-counts-of-financial-and-elections-fraud\">charged with fraud</a>. Critics say that Binance has not been transparent enough about its business practices and has not proven that it is solvent. However, CZ has brushed off these concerns, stating that the firm <a href=\"https://cointelegraph.com/news/binance-changpeng-zhao-deny-fud-liquidity-employee-turnover\">has “no liquidity issues”</a> and that claims against it are unfounded.</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-15T23:00:06.000Z",
    "title": "Ethereum Surges Ahead Of Bitcoin In Active Addresses, What Does This Mean?",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-bitcoin-active-addresses/",
    "description": "Since its inception, Ethereum has continuously been compared to Bitcoin with the former being hailed as a better option to the latter in some cases. As the years have flown by, the competition has gotten even fiercer, especially with ETH growing rapidly. Eventually, Ethereum seems to be catching up with Bitcoin, especially in terms of active addresses. Ethereum Active Addresses Surpass Bitcoin On Thursday, September 14, on-chain data tracker Santiment revealed a surprising update on the fierce rivalry between Bitcoin and Ethereum. In the X post, the tracker revealed that the number of unique addresses that were transaction on the network had reached its second-highest daily figure of all time. Related Reading: Litecoin Eliminates Pre-Halving Gains As Volume Drops, Is A Fall To $50 Coming? While this is significant on the part of the blockchain alone, it is also significant in terms of the competition between the two largest assets in the space. To put this in perspective, the 1,089,893 figure reported by Santiment puts Ethereum ahead of Bitcoin in terms of this metric alone. The last time that the daily unique active addresses on the network hit its new all-time high was back in December 2022. So it has been almost a year since the metric was this high, suggesting a unique driving factor behind it. This report is also in line with the report from Artemis Terminal that shows that Ethereum was right in front of Bitcoin in terms of daily active addresses. ETH active addresses surpass BTC on Wednesday &#124; Source: Artemis Terminal Artemis reports that on September 13, Ethereum saw a total of 1.03 million daily addresses compared to Bitcoin’s 743,800 addresses in the same time period. However, this figure has since retracted and Bitcoin has pulled in front of Ethereum once more as of September 14. What Does This Mean? While Ethereum’s surge on Wednesday was impressive, it does not mean much since the network has been unable to sustain the growth. Also, the surge could be easily explained by the rise in the popularity of the Friend.Tech decentralized finance social media platform based on the Ethereum blockchain. Related Reading: Bitcoin Wallet Activity Touches 5-Month High, Will BTC Price Follow? Friend.Tech had seemingly come back from the death to reach a new all-time high in its number of daily users. Since an ETH address is required to participate in the platform, it is no surprise there was an uptick in the number of ETH addresses active on the network. The spike in the number of daily active addresses also seems to have had little impact on the price of the cryptocurrency itself. ETH’s price is still struggling to hold above $1,600, with small gains of 0.35% in the last day and losses of 1.15% in the last week. ETH price still holding above $1,600 &#124; Source: ETHUSD on Tradingview.com Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from CBS News, chart from TradingView.com"
  }
]