[
  {
    "source": "Decrypt",
    "date": "2024-01-16T21:51:01.000Z",
    "title": "Solana Shooter ‘Nyan Heroes’ Reveals NYN Airdrop Plans",
    "url": "https://decrypt.co/213066/solana-shooter-nyan-heroes-reveals-nyn-airdrop-plans",
    "description": "Cats-in-mechs game Nyan Heroes is set to launch a play-to-airdrop campaign as the early access test opens up in February."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-16T21:56:23.000Z",
    "title": " Socket protocol loses $3.3M in confirmed approval exploit ",
    "url": "https://cointelegraph.com/news/socket-protocol-loses-3-3-million-confirmed-approval-exploit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNmNkYzI2Y2ItMGFiMy00MTVmLWJkMDItMGQ2MzgxNmNmYmI1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>An attacker drained funds from users that had previously made infinite approvals to a Socket contract.</p>\n                    <p><p>Cross-chain protocol Socket has been exploited, and $3.3 million has been <a href=\"https://twitter.com/SocketDotTech/status/1747349422730813525\" target=\"_blank\" rel=\"noopener nofollow\">drained</a> from contracts associated with it, according to a Jan. 16 social media post from the team. The team has paused all contracts to prevent further losses.</p><p>“Urgent Socket has experienced a security incident which affected wallets with infinite approvals to Socket contracts” the post stated. “We have identified the issue &amp; have paused the affected contracts.”</p><p>Socket is a cross-chain infrastructure protocol used by many Web3 apps, including Synthetix, Lyra, Kwenta, Superform, Plasma Finance, and Level Finance. Socket claims that more than $3.3 million has been lost in the attack. The team has paused contracts, preventing the attacker from draining more funds.</p><p><a href=\"https://cointelegraph.com/news/socket-protocol-loses-3-3-million-confirmed-approval-exploit\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-16T21:43:59.000Z",
    "title": "Trio of nations unite to kill dollar with BRICS currency",
    "url": "https://www.cryptopolitan.com/trio-to-kill-dollar-with-brics-currency/",
    "description": "The global financial landscape is poised for a monumental shift as three powerhouse nations within the BRICS alliance gear up to launch a new currency, potentially dethroning the US dollar from its long-held pedestal of dominance. This bold move by Brazil, Russia, and South Africa, three of the five founding nations of BRICS, is not [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-16T22:07:57.000Z",
    "title": "Bitcoin Faces Selling Pressure As Big Whales Move Older Coins",
    "url": "https://nulltx.com/bitcoin-faces-selling-pressure-as-big-whales-move-older-coins/",
    "description": "Since the introduction of the Bitcoin ETF last week, Bitcoin&#8217;s price has shown modest performance, hovering around the $42,000 mark. Despite a spike to $48,000 during the ETF certification process, significant selling pressure has emerged in the aftermath. Reports from Santiment reveal that prominent Bitcoin wallets are swiftly liquidating older [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-16T22:00:42.000Z",
    "title": "Analyst Predicts Cardano Future Using Historic Trends, And It’s Very Bullish",
    "url": "https://www.newsbtc.com/news/cardano/cardano-future-very-bullish/",
    "description": "A crypto analyst has provided insights into why this year will be “massive” for Cardano (ADA) based on historical data. The analyst also highlighted how patience was key, as ADA could replicate a similar run like the one it did when it saw a gain of 8,288% following about two years of consolidation.  2024 Could Be Another Breakout Year For Cardano In a recent video, the analyst behind the Crypto ZX YouTube channel alluded to ADA’s history as he provided a bullish narrative for the crypto token in this new year. He spoke about how Cardano launched at the peak of the 2018 bull market but didn’t make any significant gains until two years later.  Related Reading: Bitcoin To Reach $1 Million In Days To Weeks, Crypto Analyst ADA is said to have broken below the $0.11 support months after its launch and ranged within that time frame from around August 2018 to June 2020. After that, things began to pick up for the crypto token as it went up by 8,288% on its way to hitting its all-time of $3 in 2021. Based on this, the analyst urged ADA investors to be patient as he expects ADA to break out anytime soon and enjoy a parabolic move. He warned these investors against being like those who currently have regrets about not holding when ADA was at its lowest, considering that some of those who held made millions.  ADA price at $0.53 &#124; Source: ADAUSD on Tradingview.com One Last Chance To Accumulate Before The Next Bull Run The Crypto ZX analyst mentioned that the bear market cycle ends at the 78.6 Fibonacci retracement level. However, he noted that ADA is currently struggling to break that level as the selling pressure around that range is huge, and there is not enough demand for ADA. Going by previous cycles, he stated that “explosions” could come by May or June. Related Reading: Crypto Analyst Says A Solana Price Will Climb To $750, Here’s When In his opinion, though, he believes that Cardano could get to that Fibonacci level before those months. However, he doesn’t expect “massive moves” until May at least. With this in mind and the fact that there could be another “shake-off” before Bitcoin Halving, the analyst believes this is a great opportunity to accumulate as many ADA tokens as possible.  Meanwhile, the “exciting times” will be in the third and fourth quarter of the year, as that is where this crypto analyst is personally targeting (possibly to take profits). He also predicted that this bull market would be the biggest of all time as he believes that other cryptocurrencies, including Cardano, could get their Spot ETF.  At the time of writing, ADA is trading at around $0.532, down in the last 24 hours, according to data from CoinMarketCap.  Featured image from Daily Hodl, chart from Tradingview.com"
  }
]