[
  {
    "source": "NewsBTC",
    "date": "2023-10-31T22:00:45.000Z",
    "title": "Bitcoin’s Price Tide: Could ASIC Miner Values Signal An Approaching Crypto Surge?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-price-tide-could-asic-miner-values-signal/",
    "description": "Adam Back, the co-founder and CEO of Blockstream, has recently drawn attention to a notable correlation, which is that the prices of ASIC (Application-Specific Integrated Circuit) miners tend to align with Bitcoin prices. This parallel trend has been confirmed historically, with the miners peaking in price during the 2021 Bitcoin bull run, just as BTC reached its peak of $69,000. Back&#8217;s analysis shows that even as the market navigates through changing tides, the fate of mining equipment is an important piece of the puzzle for understanding the overall ecosystem. The CEO of Blockstream also suggests that the price of ASIC miners is not just a reflection of manufacturing costs or technological advancements but also an indicator of market sentiment toward Bitcoin itself. Related Reading: The Hidden Signals: Bitcoin’s On-Chain Data Points To Bullish Outlook, But There’s A Catch The Miners&#8217; Market: A Reflection Of Bitcoin&#8217;s Value According to Back in a video posted on X (formerly known as Twitter), during the prelude to the 2021 bull market, the price of ASIC miners was low, mirroring the anticipation and optimism of the Bitcoin community for a significant rally. However, as Bitcoin&#8217;s value skyrocketed, so did the price for these mining machines, hitting a peak of $120/Terrahash (TH) alongside Bitcoin&#8217;s all-time high. Yet, with the subsequent decline in BTC value, the demand and price for ASIC miners plummeted, currently trading hands at under $15/TH—a stark contrast to their previous highs. Despite a positive momentum for Bitcoin this year, ASIC miner prices have remained subdued. However, Back maintains an optimistic outlook for a potential resurgence in ASIC miner prices. Historically there’s been a high correlation between ASIC miner and #Bitcoin prices. Learn how the new the Blockstream ASIC (BASIC) Note investment opportunity capitalizes on this thesis. Blockstream CEO Dr. @adam3us explains: pic.twitter.com/zHAqhLsGet — Blockstream (@Blockstream) October 31, 2023 The CEO of Blockstream suggests that as Bitcoin enters deeper into a bull phase, the value of these essential mining components is likely to increase. Back points to the upcoming Bitcoin Halving — an event that historically impacts Bitcoin&#8217;s price due to the reduced rate at which new Bitcoins are generated — as a possible catalyst for Bitcoin&#8217;s price surge and a parallel rise in ASIC miner values. Bitcoin Path To Reclaim $35,000 Despite several predictions and analyses about Bitcoin, the top crypto has continued to move at its own pace. After retracing from the previously tapped $35,000, the asset has begun to thrive to reclaim that price zone. Currently, the asset trades at $34,269, down by 1.1% in the past 24 hours. However, looking at its weekly performance, Bitcoin still appears to be in gains. Though it has dropped by 0.7% in the past 7 days, it is still up by 20% in the past two weeks. Back mentioned that the Bitcoin Halving appears as a significant milestone that could precede a notable increase in Bitcoin&#8217;s price, typically starting around six months post-halving. Related Reading: Bitcoin’s Stellar Surge: What’s Next? Expert Deciphers The Crypto Labyrinth While the CEO of Blockstream hesitates to make a definitive prediction about the exact outcome this time, he remains optimistic about Bitcoin&#8217;s prospects, positing that the cryptocurrency could still grow further this year or next year. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-31T22:01:56.000Z",
    "title": "Bitfinex Placed on UK’s ‘Warning List’ of Companies That May Be Operating in Country Without Permission",
    "url": "https://dailyhodl.com/2023/10/31/bitfinex-placed-on-uks-warning-list-of-companies-that-may-be-operating-in-country-without-permission/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/uk-members-hub.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/uk-members-hub.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/uk-members-hub.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/uk-members-hub.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/uk-members-hub.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/uk-members-hub.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/uk-members-hub.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The regulatory body responsible for overseeing financial markets and financial services firms in the United Kingdom is issuing a warning against the crypto exchange Bitfinex. In a new press release from the Financial Conduct Authority (FCA), the regulator tells UK customers not do business with Bitfinex. &#8220;This firm [Bitfinex] may be promoting financial services or [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/31/bitfinex-placed-on-uks-warning-list-of-companies-that-may-be-operating-in-country-without-permission/\">Bitfinex Placed on UK’s ‘Warning List’ of Companies That May Be Operating in Country Without Permission</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]