[
  {
    "source": "Cointelegraph",
    "date": "2023-07-24T01:54:57.000Z",
    "title": "Ripple CEO Brad Garlinghouse: ‘The SEC created this mess’",
    "url": "https://cointelegraph.com/news/ripple-ceo-brad-garlinghouse-condemns-sec-hint-appeal-xrp",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/a084eb8a-6a85-479c-b246-e4d11ee4d110.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Brad Garlinghouse has lashed out at the SEC for its \"absurd\" comments on the Ripple Labs case. </p>\n                    <p><p>Ripple CEO Brad Garlinghouse has condemned the United States securities regulator over recent comments from its lawyers that hint at a possible appeal to its case against Ripple.</p><p>In a July 23 tweet, Garlinghouse slammed the regulator for its \"regulation by enforcement\" approach, arguing it has only served to hurt retail investors.</p><p>“​​The SEC created this mess by proclaiming it was the cop on the crypto beat when it had no legal jurisdiction,” wrote Garlinghouse in a July 23 tweet. “Where’s that gotten us? Consumers left holding the bag in bankruptcy court while the SEC holds press conferences,” he added.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">An important topic has come up about protecting retail. The SEC created this mess by proclaiming it was the cop on the crypto beat when it had no legal jurisdiction Where’s that gotten us? Consumers left holding the bag in bankruptcy court while the SEC holds press conferences.</p>&mdash; Brad Garlinghouse (@bgarlinghouse) <a href=\"https://twitter.com/bgarlinghouse/status/1682869087511416832?ref_src=twsrc%5Etfw\">July 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Garlinghouse’s criticism came in response to the SEC’s latest round of comments concerning Ripple, where the regulator hinted at appealing the <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">split-decision ruling against Ripple Labs</a>.</p><p>On July 21, the SEC <a href=\"https://cointelegraph.com/news/sec-sues-do-kwon-and-terraform-labs-for-fraud\">used its ongoing case</a> against Terraform Labs founder Do Kwon to air out its concerns with the decision that retail sales of XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) on exchanges didn’t constitute the legal definition of a security.</p><p>“Respectfully, those portions of Ripple were wrongly decided, and this Court should not follow them,” SEC lawyers wrote, asserting that these sales of XRP should have been deemed securities.</p><p>“SEC staff is considering the various available avenues for further review and intends to recommend that the SEC seek such review,” they added.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ripple-applies-for-crypto-license-united-kingdom\"><strong><em>Ripple applies for crypto license in the United Kingdom</em></strong></a></p><p>Speaking directly to the SEC’s comments, Garlinghouse said it was “absurd” to blame a judge for simply applying the law.</p><p>\"We all know legislation — not more regulation by enforcement — is the only way forward to provide clear rules and protect retail,” he added.</p><p>Ripple Labs chief legal officer Stuart Alderoty chimed in with comments of his own, saying that trying to explain that XRP isn’t a security is like “explaining to a flat earther that the world is round.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Talking to someone who still doesn’t understand that the token itself is not the security is like explaining to a flat earther that the world is round.</p>&mdash; Stuart Alderoty (@s_alderoty) <a href=\"https://twitter.com/s_alderoty/status/1682769568232615936?ref_src=twsrc%5Etfw\">July 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On July 17, SEC Chair Gary Gensler also <a href=\"https://cointelegraph.com/news/sec-chair-gary-gensler-reaction-to-ripple-decision-is-mixed-still-under-consideration\">expressed his disappointment</a> over the court’s decision on the securitiestatus of XRP, adding that the regulator would continue to assess this opinion. </p><p>At the time of publication Ripple Labs' XRP is changing hands for $0.73, up nearly 50% in the last month, according to <a href=\"https://www.tradingview.com/symbols/XRPUSD/\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from TradingView. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation — Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  }
]