[
  {
    "source": "Bitcoin.com",
    "date": "2023-08-02T07:30:58.000Z",
    "title": "Binance Japan to Launch With 34 Listed Cryptocurrencies",
    "url": "https://news.bitcoin.com/binance-japan-to-launch-with-34-listed-cryptocurrencies/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2216902813-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance Japan to Launch With 34 Listed Cryptocurrencies\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2216902813-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2216902813-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2216902813-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2216902813-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2216902813-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2216902813-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2216902813.jpg 1281w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Binance, which is preparing to launch its new Japanese platform in August, will offer users the opportunity to trade 34 coins, local crypto media reported. Besides major cryptocurrencies such as bitcoin and ether, Binance&#x2019;s own token will also be among the listed digital assets. Binance to Restore Crypto Trading in Japan With More Coins Than [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T07:30:59.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 How much is MATIC worth? The current price of Polygon is $0.691. Over the past 24 hours, it has seen a trading volume of $1.16 billion. With a market capitalization of $6.15 billion, Polygon holds a market dominance of 0.51%. However, the MATIC price has experienced an increase of 2.07%in the ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T07:14:02.000Z",
    "title": "Curve Finance Founder Sells CRV at Discount Amidst DeFi Debt Crisis",
    "url": "https://www.cryptopolitan.com/curve-finance-founder-sells-crv-at-discount/",
    "description": "In the ever-evolving world of decentralized finance (DeFi), the name Michael Egorov has been synonymous with innovation and groundbreaking initiatives. As the founder of Curve Finance, Egorov has been at the forefront of reshaping the DeFi landscape, offering users new opportunities to maximize their yield and liquidity. However, recent events have taken a dramatic turn, ... <a title=\"Curve Finance Founder Sells CRV at Discount Amidst DeFi Debt Crisis\" class=\"read-more\" href=\"https://www.cryptopolitan.com/curve-finance-founder-sells-crv-at-discount/\" aria-label=\"More on Curve Finance Founder Sells CRV at Discount Amidst DeFi Debt Crisis\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-02T07:10:35.000Z",
    "title": "Why Is Bitcoin Price Up Today?",
    "url": "https://www.newsbtc.com/news/bitcoin/why-is-bitcoin-price-up-today-aug-2-2023/",
    "description": "Bitcoin (BTC) saw a significant resurgence over the past few hours after hitting the lowest price since June 21 at $28,641 yesterday. At press time, BTC has experienced a 3.7% hike from its low. In fact, BTC even brushed past the $30,000 mark, indicating a substantial shift in market sentiment. So, the question begs. Why Is Bitcoin Up Today? &#8220;The entire short build-up of the past couple days just got wiped,&#8221; tweeted analyst Byzantine General. Data from Coinglass backs this claim and shows that BTC short positions amounting to $27.8 million were liquidated yesterday, followed by an additional $13.45 million today. This accounts for the most significant short liquidation since July 14, undeniably playing a significant role in the current price movement. But perhaps the most influential reason for the sudden shift in market sentiment was MicroStrategy&#8217;s recent announcement. The company stated that it will conduct stock sales worth $750 million. After the announcement, the Bitcoin community was abuzz with speculation that Michael Saylor might make additional, gigantic BTC purchases. Related Reading: Bitcoin Addresses In Loss Soar To One-Month High Amid Mixed Market Indicators &#8220;As with prior programs, we may use the proceeds for general corporate purposes, which include the purchase of Bitcoin as well as the repurchase or repayment of our outstanding debt,&#8221; said Andrew Kang, MicroStrategy&#8217;s CFO during a recent earnings call. While it remains unclear if the entire proceeds will be funneled into Bitcoin, the likelihood of a substantial chunk is certain. Directly after this announcement, Bitcoin surged by 1.6% within one hour. On-chain analysis firm Santiment tweeted: &#8220;Bitcoin has breached back above $30k once again, with assistance from the many traders who capitulated during the past week of price declines. Volume is rising to kick off August, &#38; this psychological resistance cross may shift sentiment positive.&#8221; Related Reading: BlackRock CEO Larry Fink Is The Best Thing To Happen To Bitcoin, Mike Novogratz Says The chart shared by the firm shows that yesterday trading volume picked up steam again, rising to the highest level since six weeks. Also, the lowest amount of profit / loss taking in 7 months indicates a capitulation event. Analyst @52Skew added that the Bitcoin on the Binance spot market experienced a “real spot demand” which he wanted to see for a strong price reaction. “Note the limit bid wall that pushed up price; typical with PvP conditions to force limit chasing. Marked notable liquidity on the orderbook,” the analyst stated. What&#8217;s Next? However, he also cautioned that the 4-hour chart is so far looking like a classic Swing Failure Pattern (SFP) into a higher time-frame support / resistance. The Swing Failure Pattern, or SFP, is a type of reversal pattern where traders target stop-losses above a key swing low or below a key swing high to manipulate the price direction by generating enough liquidity. Nevertheless, the market appears to be brimming with anticipation. As per @DaanCrypto: &#8220;If price starts ranging here I&#8217;d look for another sweep of the lows and consolidation there. $28.5 &#38; 29.5K are the areas of interest.&#8221; Meanwhile, a break above the resistance zone at the monthly and weekly open between $29,236 and $29,300 would validate a bullish scenario where the price targets $30,000. At press time, BTC wasn&#8217;t able to reclaim the red resistance zone and was trading at $29,606. Featured image from Kanchanara /Unsplash, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T07:33:49.000Z",
    "title": "Toncoin’s Stellar Performance Mirror’s InQubeta’s Presale: Traders More Bullish On QUBE Than TON",
    "url": "https://www.crypto-news-flash.com/toncoins-stellar-performance-mirrors-inqubetas-presale-traders-more-bullish-on-qube-than-ton/?utm_source=rss&utm_medium=rss&utm_campaign=toncoins-stellar-performance-mirrors-inqubetas-presale-traders-more-bullish-on-qube-than-ton",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T100340.507.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T100340.507.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T100340.507-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto industry has continued to captivate investors with innovative and profitable projects. Amidst the potential for huge returns, unpredictable market trends have investors looking for the best crypto to buy to secure their investments. In searching for sustainable wealth opportunities, tokens such as InQubeta (QUBE) and Toncoin have risen to prominence in the market. [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-02T07:24:23.000Z",
    "title": "The State of Layer 1 Blockchains in 2023",
    "url": "https://www.altcoinbuzz.io/product-release/the-state-of-layer-1-blockchains-in-2023/",
    "description": "<p>On the Layer 1 landscape, there&#8217;s one dominant chain, Ethereum. It had a first-mover advantage with smart contracts. So, does this mean that all other L1s are being sidelined? No, not at all. So, let&#8217;s take a look at the state of some top Layer 1 blockchains. Ethereum (ETH) Ethereum does well when we look [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/product-release/the-state-of-layer-1-blockchains-in-2023/\">The State of Layer 1 Blockchains in 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]