[
  {
    "source": "CryptoGlobe",
    "date": "2023-09-01T04:49:33.000Z",
    "title": "Binance to Phase Out $BUSD Support, Urges Conversion to Other Stablecoins by February 2024",
    "url": "https://www.cryptoglobe.com/latest/2023/09/binance-to-phase-out-busd-support-urges-conversion-to-other-stablecoins-by-february-2024/",
    "description": "Binance, the world’s largest crypto exchange, has declared its intention to gradually cease support for Binance USD (BUSD) across its various services. According to Binance’s blog post, this decision comes in the wake of Paxos discontinuing the minting of new BUSD tokens. Despite this, Binance assures its users that BUSD will continue to be backed […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-01T04:48:28.000Z",
    "title": "Tron Price Prediction: TRX Eyes Bullish Break While Bitcoin and ETH Struggle",
    "url": "https://www.newsbtc.com/analysis/trx/tron-price-prediction-trx-bullish-0-078/",
    "description": "Tron price is rising and trading above $0.0750 against the US Dollar. TRX is outperforming Bitcoin and could rally further above the $0.0780 resistance. Tron is moving higher from the $0.0738 support zone against the US dollar. The price is trading above $0.0750 and the 100 simple moving average (4 hours). There is a crucial contracting triangle forming with resistance near $0.0775 on the 4-hour chart of the TRX/USD pair (data source from Kraken). The pair could continue to climb higher if it breaks $0.0775 and $0.0780. Tron Price Remains Supported This past week, Tron’s price saw a rejection pattern near the $0.0780 resistance against the US Dollar. TRX made a couple of attempts to clear $0.0775 and $0.0780 but failed. There was a downside correction below the $0.0765 level. The price declined below the 23.6% Fib retracement level of the upward move from the $0.0713 swing low to the $0.0778 high. However, the bulls were active near the $0.0750 support. TRX stayed above the 50% Fib retracement level of the upward move from the $0.0713 swing low to the $0.0778 high. The price is now trading above $0.0750 and the 100 simple moving average (4 hours). It is showing positive signs and outperforming both Bitcoin and Ethereum. On the upside, an initial resistance is near the $0.0775 level. Besides, there is a crucial contracting triangle forming with resistance near $0.0775 on the 4-hour chart of the TRX/USD pair. Source: TRXUSD on TradingView.com The first major resistance is near $0.0780, above which the price could start a fresh increase. The next resistance is near $0.080. A close above the $0.0800 resistance might send TRX further higher. The next major resistance is near the $0.0832 level, above which the bulls are likely to aim a larger increase toward the key $0.0880 zone in the coming days. Are Dips Supported in TRX? If TRX price fails to clear the $0.0780 resistance, it could start a downside correction. Initial support on the downside is near the $0.0760 zone and the 100 SMA. The first major support is near the $0.0750 level, below which the price could accelerate lower. The next major support is $0.0715. Technical Indicators 4 hours MACD – The MACD for TRX/USD is gaining momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for TRX/USD is currently above the 50 level. Major Support Levels – $0.0760, $0.0750, and $0.0715. Major Resistance Levels – $0.0780, $0.0800, and $0.0832."
  }
]