[
  {
    "source": "CryptoGlobe",
    "date": "2023-11-10T23:45:00.000Z",
    "title": "Bitcoin Behemoth: Whale Gathers Accumulated $500 Million in BTC Year-to-Date to Sit on Massive Unrealized Gains",
    "url": "https://www.cryptoglobe.com/latest/2023/11/bitcoin-behemoth-whale-gathers-accumulated-500-million-in-btc-year-to-date-to-sit-on-massive-unrealized-gains/",
    "description": "A massive Bitcoin ($BTC) whale has amassed over $500 million worth of the flagship cryptocurrency since the beginning of the year, and their dollar-cost averaging strategy has seemingly been working as their unrealized profit now exceeds $126 million. The price of Bitcoin has surged by more than 120% so far this year to now trade […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-11T00:00:44.000Z",
    "title": "A Whooping 56% Of OP Max Supply Not Assigned, What Does This Mean?",
    "url": "https://www.newsbtc.com/news/56-op-max-supply-unallocated/",
    "description": "According to Token Unlocks, a platform that tracks upcoming unlocking events, 56% of all the OP token maximum supply is in the to-be-discussed (TBD) allocation, meaning the community is yet to vote and determine where these tokens will be assigned to in the coming weeks or months. This news is a curious development, especially for OP Mainnet, the team behind one of the most popular Ethereum layer-2 scaling solutions, and OP token holders.  Billions Of OP Not Assigned Token Unlocks notes that roughly 2.4 billion OP, representing 55% of the max supply, remains under the TBD allocation. So far, over 831 million OP, or slightly above 19% of the max supply, have been unlocked.  This revelation also comes when OP prices have been trending higher, breezing past crucial resistance levels. At spot rates, OP is changing hands above September and October highs, temporarily retesting October highs. The bull bar of November 10 anchors the current leg up since it was accompanied by relatively high trading volume.  Token Unlocks defines a TBD allocation as not assigned a release timing but will be subject to community voting. These tokens can be distributed for governance, Retroactive Public Goods Funding (RetroGPF), ecosystem funding, moved to advisers or partners, and much more. RetroGPF is a funding mechanism that allows the protocol to support projects building solutions on its general-purpose layer-2 platform. Since it is retroactive, projects or developers don&#8217;t have to apply for funding in advance. Related Reading: Is A Bearish Reversal Coming For Bitcoin? This Metric May Warn So Usually, token unlocking releases coins initially locked or vested for a given time. Projects tend to employ this tactic to align the incentives of investors and that of the team. This also concurrently prevents early adopters from mass selling the coin, driving prices lower. Even so, since all specified unlocks are done publicly, transparency allows investors or traders to make informed decisions. What Will Happen To OP Prices? For the token&#8217;s Mainnet&#8217;s case, a big chunk of the max supply remains unassigned at spot rates, which is, as it is, supportive of prices. However, once these tokens are voted for, and the community decides the portion of the maximum supply that can, for instance, be distributed to advisers or used to fund ecosystem projects, then there is a tendency for prices to fall as the unlock date approaches. According to L2Beat, OP Mainnet is the second largest layer-2 scaling solution for Ethereum after Arbitrum One. OP Mainnet has a total value locked (TVL) of $3.39 billion, commanding a market share of 25%. Meanwhile, Base, a competitor backed by Coinbase, is third with a TVL of $600 million. Related Reading: What Is Shiba Inu: An Explainer And SHIB Price Prediction Feature image from Canva, chart from TradingView"
  }
]