[
  {
    "source": "CoinDesk",
    "date": "2024-04-03T14:42:20.000Z",
    "title": "UK Regulators Publish Draft Guidance on Digital Securities Sandbox Open to DLT",
    "url": "https://www.coindesk.com/policy/2024/04/03/uk-regulators-publish-draft-guidance-on-digital-securities-sandbox-open-to-dlt/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The DSS will last five years and could lead to a new regulatory regime for securities settlement."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-04-03T14:55:36.000Z",
    "title": "Nigeria and Interpol collaborate to extradite Binance executive amid money laundering charges",
    "url": "https://cryptoslate.com/nigeria-and-interpol-collaborate-to-extradite-binance-executive-amid-money-laundering-charges/",
    "description": "<p>The Nigerian Government has engaged the International Criminal Police Organization, Interpol, to facilitate the extradition of Binance executive Nadeem Anjarwalla, who is currently on the run, as reported by local media outlet Punch. Meanwhile, Binance has urged the Nigerian authorities to release its other executive, Tigran Gambaryan, currently within their hold. The firm said: &#8220;Binance [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/nigeria-and-interpol-collaborate-to-extradite-binance-executive-amid-money-laundering-charges/\">Nigeria and Interpol collaborate to extradite Binance executive amid money laundering charges</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-03T14:44:03.000Z",
    "title": "Solana Memecoin $IMARO Captures Turkish Market and Announces the listing on Coinstore, Aiming for Global Sensation",
    "url": "https://cryptodaily.co.uk/2024/04/solana-memecoin-imaro-captures-turkish-market-and-announces-the-listing-on-coinstore-aiming-for-global-sensation",
    "description": "Solana Memecoin $IMARO Captures Turkish Market and Announces the listing on Coinstore, Aiming for Global Sensation"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-03T14:48:00.000Z",
    "title": "XRP Price Prediction 2024-2033: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2024-2033 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-04-03T15:01:05.000Z",
    "title": "What is Hashcash? Explaining the Bitcoin predecessor",
    "url": "https://crypto.news/what-is-hashcash/",
    "description": "Want to know what is Hashcash? It&#8217;s the original PoW system, inspiring Bitcoin. Dive in and learn how it laid the groundwork for the number one crypto. With Bitcoin (BTC) surging to new all-time highs, fueled in part by the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-03T15:00:41.000Z",
    "title": "Crypto Expert Encourages Investors To Buy The Dip As Bitcoin Price Falls To $64,000",
    "url": "https://www.newsbtc.com/news/bitcoin/investors-buy-the-dip-bitcoin/",
    "description": "The Bitcoin price took a sharp downturn recently, dipping below $67,000 and raising concerns among investors. However, a crypto analyst has encouraged the crypto community to buy more Bitcoin at this time, suggesting that the decline presents an opportunity to acquire BTC at a lower price.  Bitcoin Decline Signals Prime Buying Opportunity Michael van de Poppe, a popular crypto analyst and enthusiast, has remained optimistic about Bitcoin’s future outlook, urging the broader crypto community to view the cryptocurrency’s recent dip as a buying opportunity. Related Reading: Dogecoin Hits Major Roadblock As Whales Go On Massive Selling Spree In a recent X (formerly Twitter) post, the analyst shared insights on the crypto market, noting the regular occurrence of both bullish and bearish activities, which contribute to the market’s balance and stability. He also revealed that price corrections were normal in the crypto market, independent of market performance or conditions.  Poppe has encouraged investors and crypto enthusiasts to buy more Bitcoin now that the price is currently trading at $66,528, according to CoinMarketCap. Over the past week, the cryptocurrency has witnessed significant price declines, plummeting by 4.64%.   This unexpected price decline has been attributed to the crackdown on Silk Road Bitcoin, an online black market that allows users to purchase illegal and unethical commodities anonymously using Bitcoin.  According to ZachXBT, a crypto community member, the United States government transferred 30,175 BTC worth $2.1 billion of Silk Road hack funds to Coinbase. This massive Bitcoin transaction has possibly led to the cryptocurrency’s present decline, fueled by bearish news and market volatility.  “At peak bullish momentum, you&#8217;ll see a huge impact of every bearish narrative. This time, it&#8217;s the Silk Road Bitcoin being transferred. Anyway, buy the dip,” Poppe stated.  BTC&#8217;s Peak Anticipated Before Halving Event In another X post, Poppe revealed disheartening news, noting that a critical price zone had been lost for Bitcoin. The crypto analyst asserted that the cryptocurrency would not witness a surge to new all-time highs during this pre-halving phase unless it breaks through resistance levels at $69,000.  Related Reading: Solana Whales Are Making Moves – Here’s The Direction They’re Headed In The analyst foresees a period of consolidation for BTC, highlighting that during this time altcoins are expected to gain traction while Bitcoin undergoes a correction phase. He further disclosed that a price correction for Bitcoin indicates a healthy and organic market cycle. Poppe has stated that Bitcoin’s area of interest lies between the range of $56,000 to $60,000. Concluding his post, the analyst further encouraged investors to acquire Bitcoin, emphasizing that “dips are for buying in these markets.” BTC price recovers from dip &#124; Source: BTCUSD on Tradingview.com Featured image from CNBC, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-04-03T14:43:34.000Z",
    "title": "Namada Unveils Governance-Based Mainnet Roadmap",
    "url": "https://www.crypto-news-flash.com/namada-unveils-governance-based-mainnet-roadmap/?utm_source=rss&utm_medium=rss&utm_campaign=namada-unveils-governance-based-mainnet-roadmap",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/namada_2_1712154786nSvKfTWehF.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/namada_2_1712154786nSvKfTWehF.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/namada_2_1712154786nSvKfTWehF-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/namada_2_1712154786nSvKfTWehF-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/namada_2_1712154786nSvKfTWehF-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/namada_2_1712154786nSvKfTWehF-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Zug, Switzerland, April 3rd, 2024, Chainwire Multi-chain data protection Layer1 Namada has released its proposed mainnet launch roadmap. The proposal involves launching the network over five phases, a process that will be driven in a decentralized way by the Namada community via Namada’s on-chain governance system. The multi-phase roadmap was announced by Namada co-founder Adrian [...]"
  }
]