[
  {
    "source": "Cointelegraph",
    "date": "2023-07-15T02:43:01.000Z",
    "title": "Allowing Coinbase to go public was not a 'blessing' of the business: SEC",
    "url": "https://cointelegraph.com/news/allowing-coinbase-to-go-public-was-not-a-blessing-of-the-business-sec",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/62d9491c-71c5-459b-9423-fb3764dcde1c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The SEC argued that just because it approves an S-1 filing from a company, does not mean the firm is not operating, or will not operate in “violation of the law.”</p>\n                    <p><p>The U.S. Securities and Exchange Commission (SEC) has argued in court that approving a firm's S-1 application to go public, does not represent a “blessing” from the agency, nor provide a verification that the business is regulatory compliant. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In the interest of transparency, here is the transcript from our hearing yesterday in the SDNY case brought against us by the SEC. We appreciate the Court’s careful consideration. <a href=\"https://t.co/NEEsr05fos\">https://t.co/NEEsr05fos</a></p>&mdash; paulgrewal.eth (@iampaulgrewal) <a href=\"https://twitter.com/iampaulgrewal/status/1679982125410406401?ref_src=twsrc%5Etfw\">July 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As per July 13 court <a href=\"https://t.co/NEEsr05fos\" target=\"_blank\" rel=\"noopener nofollow\">documents</a> from the pre-motion <a href=\"https://cointelegraph.com/news/what-to-expect-from-coinbase-sec-first-hearing\">hearing of the SEC vs Coinbase case</a>, the SEC asserted that it was not signing off on Coinbase’s business structure when giving it the greenlight to go public back in April 2021. </p><p>“Your Honor, I'll say that simply because the SEC allows a company to go public does not mean that the SEC is blessing the underlying business or the underlying business structure or saying that the underlying business structure is not in violation of the law,” SEC trial counsel Peter Mancuso said, adding that:</p><blockquote>“There is no way that an approval of an S-1 is a blessing of a company's entire business. In fact, there is no evidence being put forth that the SEC looked at specific assets and made specific determinations and then gave Coinbase comfort that this would not later be found to be a security.”</blockquote><p>On crypto Twitter, several people including Gemini co-founder Cameron Winklevoss highlighted the implications of such statements, as they questioned why the SEC would allow a supposedly non-compliant business to go public in the first place, given that its goal is to protect U.S. consumers. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">so they allow ipo for illegal business and let americans invest in it? lmao sec is cooked</p>&mdash; Metatron (@metatron_0x) <a href=\"https://twitter.com/metatron_0x/status/1679960822385180672?ref_src=twsrc%5Etfw\">July 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>U.S.-based firms are required to submit an S-1 filing with the SEC before they can start listing their shares on a national stock exchange. As part of the filing, companies need to provide a comprehensive rundown of their business structure and how proceeds from an Initial Public Offering will be used. </p><p>Following Mancuso’s comments, U.S. District Judge Katherine Polk Failia said: <strong> </strong>“Let's just pause so I can just sort of get rid of the skepticism I currently have as I hear that answer,” as she went on to raise some questions. </p><p>“I am not saying that the commission should be omniscient at the time it's evaluating a registration statement and that it should know all things,” she said, adding: </p><blockquote>“But I would have thought the commission was doing diligence into what Coinbase was doing, and somehow I thought that it would say, you know, you really shouldn't do this. This is violative of the securities laws, or we are kind of in some interesting unchartered territory here with respect to whether the assets on your platform are securities, so be forewarned that maybe someday there could be a problem.”</blockquote><p>In response, Mancuso ultimately reiterated the SEC’s argument that the S-1 filings are more focused on approving company disclosures, rather than the agency itself signing off on a business structure via an approval. </p><p>Judge Failia then posited to Mancuso if the SEC could not have said to Coinbase: “‘Hey, you guys need to register as a securities exchange.’”</p><p>“That was within the power of the SEC to do, was it not?” she questioned. </p><p>“I can't really speak to that,” Mancuso replied. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/time-for-the-sec-to-settle-with-coinbase-ripple\"><strong><em>It’s time for the SEC to settle with Coinbase and Ripple</em></strong></a></p><p>The SEC initially charged Coinbase for alleged <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">unregistered securities offerings</a> dating back to 2019. </p><p>Coinbase is pushing for an <a href=\"https://cointelegraph.com/news/coinbase-sec-seeks-dismissal-of-sec-suit-claims-extraordinary-abuse-of-process\">early dismissal of the case</a> on several grounds, with one of its arguments being that the SEC is charging the firm despite its business structure and planned activities being “exhaustively described” to the agency before the Coinbase IPO. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation — Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  }
]