[
  {
    "source": "Cointelegraph",
    "date": "2023-11-25T21:13:12.000Z",
    "title": "Binance onboarded millions into finance but forgot the paperwork — Columbia professor ",
    "url": "http://cointelegraph.com/news/binance-onboarded-millions-into-finance-forgot-paperwork-columbia-professor",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/35f23d89-518d-46ab-8b7c-c0c0df0a3b0e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance settlement highlights banks’ and crypto firms’ ambiguous treatment, says Columbia Business School adjunct professor Omid Malekan. </p>\n                    <p><p>Recent events surrounding the crypto exchange Binance sparked significant debate about the United States’ crackdown on crypto firms. According to Omid Malekan, adjunct professor at Columbia Business School and author, the Department of Justice’s approach in the case is very different from what is seen in traditional finance.</p><p>“People who sincerely believe that crypto is some unique enabler of bad people doing bad things don’t understand how the rest of the financial system actually works,” Malekan <a href=\"https://twitter.com/malekanoms/status/1727363668281524692\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> on X (formerly Twitter), adding that companies that follow Anti-Money Laundering best practices still process large sums of illicit funds. “But that’s all considered OK because somebody did the paperwork.”</p><p>Malekan also argued that many on Wall Street would be jailed if traditional firms were given the same treatment as Binance in similar cases.</p><blockquote>“If they’d been held to the Binance Standard there’d be hundreds of managing directors in jail and less money for shareholder buybacks (or lobbying). But the bankers were smart enough to never question the game.”</blockquote><p>Despite criticism, Malekan believes the exchange was still “wrong to lie to its customers and wrong for not being compliant.” Binance and its co-founder, Changpeng “CZ” Zhao, recently<a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\"> reached a billionaire settlement with the U.S. government</a> for allegedly allowing individuals engaged in illicit activities to move “stolen funds” through the exchange. CZ<a href=\"https://cointelegraph.com/news/binance-richard-teng-ceo-amid-changpeng-zhao-s-forced-departure\"> stepped down</a> as CEO as part of the settlement.</p><p>Malekan also praised Binance’s contribution to financial inclusion over the past few years: </p><blockquote>\"It did a reasonably decent job of onboarding tens of millions of poor, brown, and otherwise underprivileged people into the financial system, something the world’s compliant financial firms have chronically failed to do.\"</blockquote><h3>ICIJ investigation into global money laundering</h3><p>Some of the world’s largest banks allowed trillions of dollars to be laundered by criminals, according to leaked documents obtained by the International Consortium of Investigative Journalists (ICIJ).</p><p>The investigation,<a href=\"https://www.icij.org/investigations/fincen-files/global-banks-defy-u-s-crackdowns-by-serving-oligarchs-criminals-and-terrorists/\" target=\"_blank\" rel=\"noopener nofollow\"> disclosed on Sept. 2020</a>, analyzed over 2,100 suspicious activity reports (SARs) involving transactions worth more than $2 trillion between 1999 and 2017 that were flagged as potential money laundering or criminal activity by financial institutions’ internal compliance officers. Banks facilitating these transactions included major institutions such as the Bank of New York Mellon, Deutsche Bank, and HSBC. </p><p>The ICIJ organized more than 400 journalists from 110 news organizations in 88 countries to investigate banks potentially involved in money laundering.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-substance-abuse-traders-trading/\"><strong><em>This is your brain on crypto — Substance abuse grows among crypto traders</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-25T21:29:44.000Z",
    "title": "Do You Need Millions of Dollars for Happiness? CNBC Reveals What Americans Think It Costs",
    "url": "https://www.cryptoglobe.com/latest/2023/11/do-you-need-millions-of-dollars-for-happiness-cnbc-reveals-what-americans-think-it-costs/",
    "description": "A recent report by Kamaron McNair for CNBC’s Make It looks at American generations’ varying perceptions of financial happiness, as highlighted in a recent Empower survey. The piece uncovers that while a significant portion of Americans link financial wealth to happiness, the actual monetary value they attach to this sentiment differs markedly across age groups. […]\n"
  }
]