[
  {
    "source": "CoinDesk",
    "date": "2023-06-20T12:12:39.000Z",
    "title": "First Mover Americas: Tokenization Might Be a $5T Opportunity: Bernstein",
    "url": "https://www.coindesk.com/markets/2023/06/20/first-mover-americas-tokenization-might-be-a-5t-opportunity/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for June 20, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-20T12:21:58.000Z",
    "title": "Deutsche Bank Applies for Digital Asset Custody License in Germany: Report",
    "url": "https://decrypt.co/145387/deutsche-bank-applies-for-digital-asset-custody-license-in-germany-report",
    "description": "Germany’s largest bank, with assets worth $1.3 trillion, has been working on the custody platform for over two years."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-20T12:28:26.000Z",
    "title": "European Investment Bank taps blockchain for Climate Awareness Bond ",
    "url": "https://cointelegraph.com/news/european-investment-bank-issues-blockchain-bond",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/c20feeff-13b2-4876-8d23-f5d5357b46a6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Swedish krona-based Climate Awareness Bond will be issued on a blockchain that incentivizes node operators to improve environmental footprint of infrastructure. </p>\n                    <p><p>The European Investment Bank (EIB) has issued a blockchain-based digitial bond powered by environmentally-incentivized node infrastructure.</p><p>An <a href=\"https://via.tt.se/pressmeddelande/eib-issues-its-first-ever-digital-climate-awareness-bond-and-swedish-krona-transaction?publisherId=3236469&amp;releaseId=3352237\" target=\"_blank\" rel=\"noopener nofollow\">announcement </a>from the financial institution outlined the key points of a ‘digital native green bond’ denominated in Swedish krona. The 1 billion kr bond is set to offer a 3.638% fixed rate over two years to institutional investors.</p><p>The Climate Awareness Bond is also being touted as the first blockchain-based bond to be registered on the Luxembourg Stock Exchange Securities Official List and displayed on the Luxembourg Green Exchange.</p><p>The bond will operate on the recently launched sustainable blockchain digital bond platform So|bond. As Cointelegraph previously <a href=\"https://cointelegraph.com/news/european-banks-launch-sustainable-blockchain-platform-for-digital-bonds\">reported</a>, the platform allows issuing, trading and settlement of digital bonds using pro-environmental incentives for its node operators.</p><p>So|bond’s Proof of Climate awaReness protocol incentivizes nodes to reduce environmental impact of their infrastructure. This is done by remunerating nodes according to a formula linked to their climate impact, with lower impact ratings resulting in higher rewards.</p><p>French-based IT provider Finaxys developed the protocol, while So|bond itself is a joint project operated by Skandinaviska Enskilda Banken (SEB) and Credit Agricole CIB.</p><p>A statement fromEIB vice-president Ricardo Mourinho Felix said the first-ever green and SEK-denominated bond aims to harness blockchain technology to move towards more sustainable financial systems:</p><blockquote>“This Climate Awareness bond will run on a platform designed to minimise the environmental footprint of the IT infrastructure.”</blockquote><p>Ben Powell, head of sustainable DCM at SEB, added that blockchain technology adoption has been ‘restrained’ by perceptions of high energy consumption in recent years. So|bond looks to address the environmental impact of financial infrastructure by using technology that has typically been criticized for its carbon footprint:</p><blockquote>“The platform we have built aims to address this by introducing a disclosure of the environmental footprint of the operators of the network.\"</blockquote><p>Cointelegraph has reached out to EIB to ascertain finer details of the bond and its prospective institutional buyers.</p><p>The EIB has been exploring the use of blockchain-based platforms for digital bonds over the past three years. News of a potential EIB issued Ethereum-based digital bond sent ETH to <a href=\"https://cointelegraph.com/news/ethereum-on-a-high-after-european-investment-bank-s-121m-digital-bond-news\">all-time highs </a>in April 2021. </p><p>The institution t<a href=\"https://cointelegraph.com/news/eib-settles-100-million-digital-bond-on-private-blockchain\">hen settled a euro-denominated 100 million</a> ($103.7 million) digital bond on a private blockchain platform in collaboration with Goldman Sachs and Société Générale Luxembourg.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-20T12:24:56.000Z",
    "title": "4 things that can spark the next Bitcoin bull cycle",
    "url": "https://cointelegraph.com/news/4-things-spark-next-bitcoin-price-bull-cycle",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/721be988-e614-40b3-9422-4159e7ff4189.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin is down 15% from its 2023-highs, but $40,000 may be closer than you think due to several important factors.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has dropped nearly 15% from its yearly high of around $31,000, with the recent regulatory crackdowns on <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">Coinbase</a> and <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">Binance</a> crypto exchanges and the <a href=\"https://cointelegraph.com/news/hawkish-fed-stocks-market-rally-and-crypto-falling-behind\">Federal Reserve's hawkish forward guidance</a> accelerating its selloff.</p><p>Still, Bitcoin is up 60% year-to-date (YTD), holding above a technical support level of $25,000. Moreover, a new bull cycle can begin for a few reasons.</p><h2>Bitcoin halving</h2><p>The next <a href=\"https://cointelegraph.com/news/bitcoin-2024-halving-will-be-its-most-important-interview-with-charles-edwards\">Bitcoin halving</a>, a pre-programmed event that slashes the cryptocurrency's supply rate by half every four years, is in April 2024.</p><p>The previous three Bitcoin halvings (2012, 2016, 2020) have all preceded massive BTC price rallies and new all-time highs. For instance, BTC is up 276% since the previous halving in May 2020. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/1e44f6af-04c7-4c30-a8f7-6534cb444049.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin price performances since the last three halvings. Source: Glassnode</em></figcaption></figure><p>The market will likely be in an accumulation zone until the halving, according to analyst <a href=\"https://twitter.com/TheCryptoLark/status/1670068820474744832\" target=\"_blank\" rel=\"noopener nofollow\">Lark Davis</a>, who anticipates Bitcoin to test its record high of $69,000 in the next 18-24 months. One analyst even <a href=\"https://cointelegraph.com/news/160k-halving-btc-price-prediction-model-count-down-new-bitcoin-all-time-high\">sees</a> the price hitting $160,000 by April 2024.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Volatility, volumes, and realized values are at multi-year lows, indicating that Bitcoin investor apathy is firmly in play. <br><br>However, under the surface, HODLers continue their classic slow and steady accumulation, with the halving now less than 1yr away.<br><br>To find our more,… <a href=\"https://t.co/1w2gMTRWCC\">pic.twitter.com/1w2gMTRWCC</a></p>&mdash; glassnode (@glassnode) <a href=\"https://twitter.com/glassnode/status/1670793677441056770?ref_src=twsrc%5Etfw\">June 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><em><strong>Related: <a href=\"https://cointelegraph.com/news/why-cathie-wood-is-bullish-on-coinbase-stock-and-believes-bitcoin-will-reach-1-million\">Why Cathie Wood is bullish on Coinbase stock and believes Bitcoin will reach $1 million</a></strong></em></p><h2>BlackRock Bitcoin ETF</h2><p><a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">BlackRock's Bitcoin ETF</a> application to the U.S. Securities and Exchange Commission (SEC) has also boosted confidence in a potential BTC price rally in the days leading up to the halving.</p><p>The investment firm, which manages $8.5 trillion in assets, has a near-perfect ETF approval record with the SEC. The SEC's deadline to respond to BlackRock's application is around March 2024, a month before the halving. </p><p>An SEC approval may double Bitcoin's bullish prospects post-halving, several analysts argue.</p><p>\"Your are watching game theory at work,\" analyst Crypto Tea <a href=\"https://twitter.com/CryptoTea_/status/1670628358382661634\" target=\"_blank\" rel=\"noopener nofollow\">states</a>, noting:</p><blockquote>\"BlackRock understands the bitcoin halving is less than a year away. New supply will decrease while demand continues to increase from worldwide hyperinflation. They are asset managers and need to capture Bitcoin's performance before their competitors do.\"<a href=\"https://twitter.com/CryptoTea_/status/1670628358382661634/photo/1\" target=\"_blank\" rel=\"noopener nofollow\"></a></blockquote><h2>Bitcoin dominance rising</h2><p>The latest SEC crackdown on crypto exchanges Binance and Coinbase has left many top altcoins under stress, particularly those deemed \"unregistered securities.\" That has coincided with the Bitcoin's crypto market dominance <a href=\"https://cointelegraph.com/news/bitcoin-btc-reach-50-percent-market-dominance\">crossing 50% for the first time in two years</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/2f2f1964-0db9-4cd5-81cf-d046326d1117.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin market dominance index. Source: TradingView</em></figcaption></figure><p>In other words, capital is moving from altcoins to Bitcoin as the latter is not considered a \"security\" by the SEC. Therefore, BTC may be seen as the \"safe\" bet when compared to the <a href=\"https://cointelegraph.com/news/sec-labels-61-cryptocurrencies-securities-after-binance-suit\">60+ cryptocurrencies</a> deemed \"securities\" by the regulator. </p><p>MicroStrategy cofounder Michael Saylor predicts this will push BTC's market cap to 80% of the total crypto market in the coming years. He said:</p><blockquote>\"Regulatory clarity is going to drive Bitcoin adoption by eliminating the confusion &amp; anxiety that has been holding back institutional investors. Bitcoin dominance will continue to grow as the #Crypto industry rationalizes around $BTC and goes mainstream.\"</blockquote><h2>BTC price \"bull flag\"</h2><p>Technicals show Bitcoin painting a clear <a href=\"https://cointelegraph.com/news/what-is-a-bull-flag-chart-pattern-and-how-to-spot-it\">bull flag pattern</a> on its longer-timeframe (LTF) charts, suggesting an upside continuation of its overall recovery rally.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/2a07b75c-2034-4a98-b65f-252a0f33235c.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD weekly price chart. Source: TradingView</em></figcaption></figure><p>A bull flag gets resolved after the price breaks above its upper trendline and rises by as much as the height of the previous uptrend. As a result, Bitcoin's bull flag target comes near $35,500 — a level that was strong support in May 2021 and May 2022.</p><p>Still, Bitcoin will need to close decisively above $35,500 to begin a bull cycle, given it would still be a lower high compared to the cryptocurrency's previous <a href=\"https://cointelegraph.com/news/bitcoin-due-new-big-rally-as-rsi-copies-2018-bear-market-recovery\">bear market peaks</a>.</p><p>Interestingly (and simultaneously to the bull flag pattern), BTC price could be on the cusp of a breakout in its prevailing <a href=\"https://cointelegraph.com/news/this-classic-trading-pattern-signaled-that-bitcoin-price-had-hit-a-top\">inverse-head-and-shoulders (IH&amp;S) pattern</a>, as shown below.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/d31c55b9-65a9-4a7e-b930-86afc1c5395c.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD weekly price chart. Source: TradingView</em></figcaption></figure><p>An IH&amp;S is a bullish reversal pattern, confirmed by the formation of three troughs under a common neckline resistance. The middle trough comes to be deeper than the other two, which have more or less the same height.</p><p>As a rule, an IH&amp;S pattern is resolved after the price breaks above the neckline and rises by as much as the distance between the middle trough's lowest point and the neckline. Sometime, the price returns to retest the neckline as support after the first breakout attempt. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/31-percent-young-australians-hold-crypto-asx-survey\">31% of young Aussies hold crypto despite being ‘risk averse’ — ASX survey</a></em></strong></p><p>Thus, a rebound from the IH&amp;S neckline could have BTC price rally toward $40,500, up more than 60% from current price levels, and confirming a new bull cycle.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-20T12:13:43.000Z",
    "title": "Deutsche Bank reportedly applies for digital asset custody license with BaFin ",
    "url": "https://cointelegraph.com/news/deutsche-bank-applies-digital-asset-custody-license-with-ba-fin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/66cb5f34-fca2-4854-8a2e-18f277530117.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Germany’s banking industry is slowly warming up to the crypto industry with multiple partnerships and crypto services in 2023 after a long cautious approach. </p>\n                    <p><p>Germany’s largest banking institution, Deutsche Bank AG, has reportedly applied for a digital asset custody license with the German financial regulator BaFin in a bid to expand its revenue streams, Bloomberg <a href=\"https://www.bnnbloomberg.ca/deutsche-bank-applies-for-digital-asset-license-amid-growth-push-1.1935388\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-bnnbloomberg-ca.cdn.ampproject.org/c/s/www.bnnbloomberg.ca/deutsche-bank-applies-for-digital-asset-license-amid-growth-push-1.1935388.amp.html\">reported</a>.</p><p>This comes after a similar shift from the bank's investment arm, DWS Group, and aims to expand on digital asset custody services including cryptocurrencies. DWS Group had earlier <a href=\"https://cointelegraph.com/news/deutsche-bank-s-dws-eyes-2-german-crypto-firms-for-investment-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/deutsche-bank-s-dws-eyes-2-german-crypto-firms-for-investment-report/amp\">shown interest in investment in two German crypto firms</a>. Companies negotiating with DWS Group included Deutsche Digital Assets, a crypto exchange-traded products provider, and market maker Tradias.</p><p>The banking giant’s corporate bank division first revealed plans to offer digital asset-related services in 2020 but hadn't announced a timeline for the introduction of the services. Deutsche Bank’s commercial banking unit head David Lynne announced on June 20 that the lender is building its “digital assets and custody business,” and that it has applied for a license with the country’s financial regulator, according to Bloomberg.</p><p>While Deutsche Bank has been critical of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and the crypto market’s volatility over the past few years, its tone toward the industry has altered in 2023. In February this year, Deutsche Bank Singapore, in partnership with Memento Blockchain, successfully completed <a href=\"https://cointelegraph.com/news/deutsche-bank-completes-trial-of-tokenized-investment-platform\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/deutsche-bank-completes-trial-of-tokenized-investment-platform/amp\">trials for a tokenized investment platform called DAMA</a> (Digital Assets Management Access). </p><p>The digital asset fund was created with its own soulbound token and launched a direct fiat-to-digital on-ramp for users.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/almost-half-of-germans-to-invest-in-crypto-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/almost-half-of-germans-to-invest-in-crypto-report/amp\"><strong><em>Almost half of Germans to invest in crypto: Report</em></strong></a></p><p>Separately, German securities processor Deutsche WertpapierService Bank (Dwpbank) also created a <a href=\"https://cointelegraph.com/news/german-dwpbank-to-offer-bitcoin-trading-to-1-200-affiliate-banks-on-new-platform\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/german-dwpbank-to-offer-bitcoin-trading-to-1-200-affiliate-banks-on-new-platform/amp\">Bitcoin-focused platform, wpNex</a>, for retail customers. The new platform offers crypto accounts alongside bank clients' other accounts without requiring them to do any additional Know Your Customer processes.</p><p>Germany’s banking institutions had kept a safe distance from the crypto industry citing its volatile nature and unpredictability, however, that stance appears to be changing <a href=\"https://cointelegraph.com/news/german-banks-slowly-adopt-crypto-mostly-for-institutional-investors\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/german-banks-slowly-adopt-crypto-mostly-for-institutional-investors/amp\">in 2023</a> as major baking institutions continue to explore the potential of adding digital asset-centered services for clients.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\"><strong><em>Best and worst countries for crypto taxes — plus crypto tax tips</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-20T12:28:42.000Z",
    "title": "Tokenaut Launches AI-Powered Project Analysis Platform With Airdrop",
    "url": "https://cryptodaily.co.uk/2023/06/tokenaut-launches-ai-powered-project-analysis-platform-with-airdrop",
    "description": "<p>Singapore, Singapore, June 20th, 2023, Chainwire</p><p>Tokenaut a platform specializing in identifying the next moonshot memecoins and NFT projects, has announced its official launch. The platform&rsquo;s debut will be accompanied by a giveaway and airdrop to jumpstart the journey.</p><p>Tokenaut provides users with insights into emerging memecoins and NFTs throughout the crypto market. The platform uses an AI algorithm that crawls Twitter, Google, and other online platforms to assess whether a prospective project is fundamentally sound. Using predictive algorithms, Tokenaut can analyze whether a project is likely to succeed or fail.</p><p>The Tokenaut team employs an effective vetting process to ensure the projects listed on the platform have potential, thus offering users a curated and reliable source of alpha on meritorious projects.</p><p>To celebrate the launch, Tokenaut is rewarding its first 500 active supporters with an airdrop. Participants stand to earn a substantial amount of $TNT tokens based on their cumulative referral amount.</p><p>\"We're thrilled to unveil Tokenaut to the world,\" said Gallen, co-founder of Tokenaut. \"We believe that our platform will revolutionize how people discover and invest in new crypto projects, and we're excited to see our community grow.\"</p><p>Crypto enthusiasts can join the Tokenaut community and take part in shaping the future of crypto project discovery. Interested individuals can also join the community through the official Tokenaut Telegram group and Discord server.</p><p>For more information about Tokenaut, visit tokenaut.ai or follow Tokenaut on Twitter @TokenautAI and Telegram https://t.me/tokenaut.</p><p>About Tokenaut</p><p>Tokenaut is a pioneering platform that aims to simplify the discovery of the next big memecoins and NFT projects. With a focus on reliability, user-friendliness, and sophisticated AI-driven analysis, Tokenaut is committed to becoming the go-to platform for investors searching for promising new projects in the crypto space.</p>ContactCo-FounderGallen LouTokenaut Inchello@tokenaut.ai"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-20T12:30:11.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Climbs to 2-Week High on Tuesday, Rising Above $27,000",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-climbs-to-2-week-high-on-tuesday-rising-above-27000/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1743741506-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BTC Climbs to 2-Week High on Tuesday, Rising Above $27,000\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1743741506-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1743741506-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1743741506-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1743741506-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1743741506-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1743741506-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1743741506.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin rose above $27,000 for the first time in two weeks, as price broke out of a key resistance level on Tuesday. Bullish sentiment continues to make a gradual return, following recent market weakness. Ethereum remained over the $1,700 level during today&#x2019;s session. Bitcoin Bitcoin rose to a two-week high on Tuesday, as bullish sentiment [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T12:38:59.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the series of delisting fuelled by the ongoing United States SEC&#8217;s crackdown on major crypto platforms. Basically, it&#8217;s crypto winter in the summer as it stands. How do Cardano Price Prediction analysts steer in this turbulent crypto weather? ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T12:31:38.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T12:15:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. Crypto prices have fallen and the entire crypto market cap has dropped by 18% since April 18, 2023. What does the future hold for Binance Coin? ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-20T12:30:35.000Z",
    "title": "IMF Advances Global Central Bank Digital Currency Platform For International Transactions",
    "url": "https://www.newsbtc.com/news/cbdc/imf-advances-global-central-bank-digital-currency-platform-for-international-transactions/",
    "description": "The International Monetary Fund (IMF) is actively developing a global platform for CBDCs to facilitate seamless transactions across borders, announced IMF Managing Director Kristalina Georgieva at a conference in Rabat, Morocco.  Georgieva emphasized the importance of avoiding fragmented CBDC solutions and highlighted the need for systems that connect countries, promoting efficiency and fairness through interoperability.   &#8220;CBDCs should not be fragmented national propositions. To have more efficient and fairer transactions we need systems that connect countries: we need interoperability,&#8221; said Kristalina Georgieva. Related Reading: Bullish Signal: Bitcoin Realized Profit And Loss Fall To October 2020 Levels Over 114 central banks are currently exploring CBDCs, with approximately 10 nearing completion, she added.  Georgieva further warned that failure to agree on a common platform could lead to a void filled by cryptocurrencies. CBDCs, controlled by central banks, differ from decentralized cryptocurrencies in that they are controlled by an entity. Georgieva stressed that CBDCs foster financial inclusion by granting more individuals access to cost-effective financial services. She noted that remittances, which currently cost an average of 6.3% or around $44 billion annually, could be made cheaper through CBDCs.  &#8220;The average cost of money transfers stands at 6.3% amounting to $44 billion annually,&#8221; the director said.  However, she cautioned that CBDCs must be asset-backed to ensure stability, distinguishing them from speculative investments when cryptocurrencies lack such backing. Total market cap still holding above $1 trillion despite bearish trend &#124; Source: Crypto Total Market Cap on TradingView.com IMF Highlights Risks Of Poorly Designed CBDCs, Calls For Unified Regulatory Framework The IMF&#8217;s proposal for a global CBDC platform aligns with the goal of reducing fragmentation and enhancing cross-border transactions. A standardized platform would bridge the financial divide, strengthen payment systems, and make remittances quicker and less costly.  While CBDC benefits are evident, the IMF also underscored risks associated with their design. Poorly designed CBDCs could pose financial stability risks, encounter legal challenges, face cyber risks, and lead to operational risks for central banks. The IMF&#8217;s efforts to establish a unified regulatory framework and develop a global CBDC platform built upon previous discussions held in Jeddah, Saudi Arabia. Recognizing the complex technological and legal aspects, the IMF aims to leverage its expertise to guide the platform&#8217;s development, fostering trust and providing oversight. Related Reading: XRP Price Could Regain Strength If It Clears This Resistance Additionally, the IMF plans to release two forthcoming papers on CBDCs, sharing insights and analysis from regions such as the Middle East, Central Asia, and Sub-Saharan Africa. As central banks worldwide continue exploring CBDCs, the IMF&#8217;s initiative represents a significant step toward efficient and inclusive international transactions.  Featured image from Ledger Insights, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T12:30:02.000Z",
    "title": "Can DOGE hit $10 | Can PEPE recover | What is ApeMax",
    "url": "https://www.crypto-news-flash.com/can-doge-hit-10-can-pepe-recover-what-is-apemax/?utm_source=rss&utm_medium=rss&utm_campaign=can-doge-hit-10-can-pepe-recover-what-is-apemax",
    "description": "In the ever-evolving world of cryptocurrencies, speculation runs rampant, and investors often find themselves pondering the possibility of astronomical price targets. In this article, we delve into the question on many minds: Can DOGE reach the elusive $10 mark? While the idea may captivate some hopeful enthusiasts, a closer examination reveals several factors that make [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T12:28:52.000Z",
    "title": "Tokenaut Launches AI-Powered Project Analysis Platform With Airdrop",
    "url": "https://www.crypto-news-flash.com/tokenaut-launches-ai-powered-project-analysis-platform-with-airdrop/?utm_source=rss&utm_medium=rss&utm_campaign=tokenaut-launches-ai-powered-project-analysis-platform-with-airdrop",
    "description": "Singapore, Singapore, June 20th, 2023, Chainwire Tokenaut a platform specializing in identifying the next moonshot memecoins and NFT projects, has announced its official launch. The platform’s debut will be accompanied by a giveaway and airdrop to jumpstart the journey. Tokenaut provides users with insights into emerging memecoins and NFTs throughout the crypto market. The platform [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T12:17:21.000Z",
    "title": "Chainlink Unveils Q2 2023 Product Update: Empowering Web3 Builders with Data, Compute, and Cross-Chain Innovations",
    "url": "https://www.crypto-news-flash.com/chainlink-unveils-q2-2023-product-update-empowering-web3-builders-with-data-compute-and-cross-chain-innovations/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-unveils-q2-2023-product-update-empowering-web3-builders-with-data-compute-and-cross-chain-innovations",
    "description": "Chainlink has in its latest report unveiled some of its product updates, deployments, and plans.  Recently, it finished its Spring 2023 hackathon and emerged as its biggest event with 13,000 registrations.  Chief Product Officer of Chainlink Kemal El Moujahid has disclosed some deployments, next phase, and products to empower Web3 builders. The article covers product [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T12:14:21.000Z",
    "title": "$1,4 $ trillion asset manager Deutsche Bank Applies for Crypto Custody License to Store Bitcoin, Ethereum and Ripple (XRP)",
    "url": "https://www.crypto-news-flash.com/14-trillion-asset-manager-deutsche-bank-applies-for-crypto-custody-license-to-store-bitcoin-ethereum-and-ripple-xrp/?utm_source=rss&utm_medium=rss&utm_campaign=14-trillion-asset-manager-deutsche-bank-applies-for-crypto-custody-license-to-store-bitcoin-ethereum-and-ripple-xrp",
    "description": "Deutsche Bank seeks regulatory license to provide custody services for digital assets, including cryptocurrencies. The bank&#8217;s decision aligns with its strategy to expand income from digital asset offerings, following the footsteps of other financial institutions in the industry. Deutsche Bank, one of the largest financial institutions with $1.4 trillion in assets under management, is embracing [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-20T12:25:00.000Z",
    "title": "Arthur Hayes to Time Crypto Purchase Using Custom Bloomberg Index",
    "url": "https://coinedition.com/arthur-hayes-to-time-crypto-purchase-using-custom-bloomberg-index/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-11-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Popular crypto entrepreneur Arthur Hayes has built a custom index on the Bloomberg terminal. The BitMEX founder plans to use the Bloomberg index to time gauge the impact of the government filling up the Treasury General Account (TGA) on the United States stock market as well as the crypto market. Hayes took to Twitter earlier [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/arthur-hayes-to-time-crypto-purchase-using-custom-bloomberg-index/\">Arthur Hayes to Time Crypto Purchase Using Custom Bloomberg Index</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]