[
  {
    "source": "Cointelegraph",
    "date": "2023-08-01T13:31:58.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting the Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>FTX.com released a re-organization plan as it prepares for a comeback. The United States Securities and Exchange Commission (SEC) is suing Hex founder Richard Heart on allegations of unregistered crypto security sales. Meanwhile, several stable pools on Curve Finance were exploited on July 30 due to a reentrancy vulnerability in certain versions of the Vyper programming language. Losses topped $52 million, leading to a plummeting of Curve’s native CRV token.</p><h2>FTX.com releases restructuring plan, hints at rebooted offshore exchange</h2><p>FTX.com released a re-organization plan that outlines the company’s intended path to settle an “exceptionally large and complicated collection of claims”.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/15867dba-dace-46c2-ba52-22c73f16c342.png\"  /><figcaption style=\"text-align: center;\"><em>FTX draft plan of reorganization. Source: FTX</em></figcaption></figure><p>The document features recognition of special “shortfall” claims by the two FTX exchange organizations against this third pool of general assets. This is intended to “compensate” the exchanges for the unauthorized borrowing and misappropriation of assets that former CEO Sam Bankman-Fried and his close associates are accused of carrying out.</p><h3>SEC v. Terraform case to go ahead, judge disagrees with Ripple ruling</h3><p>A United States federal judge has denied a motion from Terraform Labs to dismiss the lawsuit brought by the U.S. securities regulator.</p><p>In handing down the order, the judge also rejected a decision from another judge who made a distinction between institutional and retail sales when it came to a ruling made in the Ripple case. </p><p>The SEC first <a href=\"https://cointelegraph.com/news/sec-sues-do-kwon-and-terraform-labs-for-fraud\">filed a suit</a> against Terraform Labs and its founder, Do Kwon, on Feb. 16, alleging them of “orchestrating a multi-billion dollar crypto asset securities fraud.\" In April, Terraform Labs’ legal representatives filed a <a href=\"https://cointelegraph.com/news/sec-argues-against-motion-to-dismiss-terraform-and-do-kwon-lawsuit\">motion for the dismissal</a> of the suit.</p><p>However, the judge has dismissed the motion as of July 31, rejecting a number of objections filed by Terraform Labs. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Judge presiding over SEC/Terraform Labs case in new court filing rejects approach taken in Ripple ruling. Says he won&#39;t distinguish between crypto assets based on how they&#39;re sold -- ie directly to institutional investors versus to retail investors on exchanges. <a href=\"https://t.co/6ar0ocXjd8\">pic.twitter.com/6ar0ocXjd8</a></p>&mdash; Ally Versprille (@allyversprille) <a href=\"https://twitter.com/allyversprille/status/1686115376118034432?ref_src=twsrc%5Etfw\">July 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>One of the opinions from the judge was around whether a distinction should be drawn depending on the manner of sale of the coin, such as in Ripple's case with XRP (XRP).  </p><p>The court however declined to “draw a distinction between these coins [MIR and LUNA] based on their manner of sale.” </p><blockquote>“The Court rejects the approach recently adopted by another judge of this District in a similar case, SEC v. Ripple Labs Inc. […] Howey makes no such distinction between [primary and secondary] purchasers.”</blockquote><p>Its rejection here could bode well for the SEC, if other judges follow Rakoff’s example.</p><h2>Hex founder faces SEC complaint over unregistered securities offering</h2><p>Controversial crypto entrepreneur and investor Richard Heart faces a lawsuit from federal regulators over an alleged unregistered securities offering. </p><p>In a July 31 filing, the United States Securities and Exchange Commission (SEC) claimed that Heart had <a href=\"https://cointelegraph.com/news/sec-files-complaint-hex-founder-offering-unregistered-securities\">raised more than $1 billion</a> through the unlawful sale of Hex, PulseChain (PLS) and PulseX (PSLX). According to the complaint, Heart made claims of “grandiose wealth for investors” in marketing the tokens. The Hex founder faces charges related to federal securities violations and defrauding retail investors. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today we charged Richard Heart (aka Richard Schueler) and three unincorporated entities that he controls, Hex, PulseChain, and PulseX, with conducting unregistered offerings of crypto asset securities that raised more than $1 billion in crypto assets from investors.</p>&mdash; U.S. Securities and Exchange Commission (@SECGov) <a href=\"https://twitter.com/SECGov/status/1686042971190272000?ref_src=twsrc%5Etfw\">July 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Like other crypto assets, Hex surged in popularity in 2021, reaching an all-time high around $0.48. The token is currently trading at around $0.00616, having declined over 28% on the day. </p><p>It has been speculated that Heart was aware that a federal complaint was incoming. Heart appears to have removed certain references from Hex and PulseChain in his social media profiles in the months leading up to the SEC complaint. </p><h2>Ethical hacker retrieves $5.4M for Curve Finance amid exploit</h2><p>An ethical hacker managed to retrieve $5.4 million worth of Ether from an exploiter and return it to DeFi protocol Curve Finance amid a recent hack. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/PeckShieldAlert?src=hash&amp;ref_src=twsrc%5Etfw\">#PeckShieldAlert</a> c0ffeebabe.eth has returned 2,879 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> (~$5.4m) to <a href=\"https://twitter.com/hashtag/Curve?src=hash&amp;ref_src=twsrc%5Etfw\">#Curve</a> deployer <a href=\"https://t.co/33BJLaq12A\">https://t.co/33BJLaq12A</a> <a href=\"https://t.co/2Jq0JOsrhV\">pic.twitter.com/2Jq0JOsrhV</a></p>&mdash; PeckShieldAlert (@PeckShieldAlert) <a href=\"https://twitter.com/PeckShieldAlert/status/1685804409610203136?ref_src=twsrc%5Etfw\">July 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>A maximal extractable value bot operator with the username “c0ffeebabe.eth” used a front-running bot against a malicious hacker to secure almost 3,000 ETH. The funds were then returned to the Curve deployer address, which looks to be its rightful custodian. </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-01T13:16:45.000Z",
    "title": "PancakeSwap Launches on Polygon zkEVM for DEX Functionality",
    "url": "https://cryptobriefing.com/pancakeswap-launches-on-polygon-zkevm/?utm_source=feed&utm_medium=rss",
    "description": "Decentralized exchange PancakeSwap has officially launchedits v3 on the Polygon zkEVM Mainnet Beta, introducing new functionalities for trading and liquidity provision.  Discover our products on zkSync Era:https://t.co/QgwmbLpEwx  Learn..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-01T13:20:36.000Z",
    "title": "QuickNode Now Available in AWS Marketplace",
    "url": "https://cryptodaily.co.uk/2023/08/quicknode-now-available-in-aws-marketplace",
    "description": "<p>Miami, Florida, August 1st, 2023, Chainwire</p><p>Developers and businesses worldwide can now easily access QuickNode's cutting-edge blockchain infrastructure on AWS.</p><p>QuickNode, a pioneering platform for Web3 development, today announced the availability of Core Node API, its cutting-edge blockchain accessibility infrastructure, in AWS Marketplace. AWS Marketplace is a digital catalog with thousands of software listings from independent software vendors that make it easy to find, test, buy, and deploy software that runs on Amazon Web Services (AWS). QuickNode customers can now benefit from AWS, simplifying blockchain deployment and management processes.</p>\"AWS is a go-to platform for businesses of all sizes that are looking to build and deploy innovative applications,\" said Alexander Nabutovsky, Co-founder and CEO of QuickNode. \"We are excited to bring QuickNode to AWS Marketplace, making it even easier for developers and businesses to access the next-gen blockchain infrastructure they need to build the future of the internet.\"<p>Availability of QuickNode in AWS Marketplace significantly streamlines the process for businesses to begin blockchain development. Businesses can seamlessly deploy a QuickNode endpoint on AWS through a simple, user-friendly process and start accessing blockchain data almost instantaneously. QuickNode's primary mission is to aid enterprises and Web3 developer teams with trustworthy, efficient solutions for blockchain data access that are further fortified by the security offered by AWS. As a result, businesses now have the opportunity to:</p><ul><li>Easily deploy enterprise RPC nodes tailored to their business goals.</li><li>Optimize blockchain data querying for high levels of speed and reliability with certified SOC 2 security.</li><li>Effortlessly track the performance of their nodes anytime, anywhere, with access to usage data and advanced telemetry.</li><li>Access a comprehensive Web3 developer toolkit with supercharged APIs, a one-click Web3 app store, world-class developer resources, and around-the-clock support.</li></ul><p>QuickNode's fully managed node hosting solution is engineered to lighten the load of blockchain infrastructure operational expenses (OpEx), allowing businesses to focus on innovation and scaling. By launching QuickNode in AWS Marketplace, a new gateway has been opened for developers and enterprises ready to harness the innovation made possible by blockchain technology. This platform sets the stage for a future where decentralized technology is seamlessly integrated into every web system stratum, propelling the growth and adoption of the internet's next iteration.</p><p>About QuickNode</p><p>Since its founding in 2017, QuickNode has emerged as a go-to solution for businesses and innovators requiring world-class blockchain development tools for speed, reliability, and security. Handling over eight billion blockchain requests daily, QuickNode boasts a 2.5X faster response time than competitors and unparalleled uptime across 24+ chains and 35+ networks. With a user-friendly interface and a robust multi-chain developer tool suite, QuickNode is an ideal choice for top Web3 businesses and global brands.</p>ContactVP of EcosystemJason HuntQuickNodeecosystem@quicknode.com"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T13:24:12.000Z",
    "title": "Can Meta’s AI Chatbots with Distinct Personas Save Threads From Dipping Further?",
    "url": "https://www.cryptopolitan.com/meta-develops-ai-chatbots-abraham-lincoln/",
    "description": "Meta, the parent company of Facebook, is developing artificial intelligence (AI) powered chatbots, each with distinct personas. Among these AI chatbots is one that emulates the personality of Abraham Lincoln. The company is considering launching the Lincoln chatbot and a surfer chatbot designed to offer travel recommendations as early as September. This move is part ... <a title=\"Can Meta&#8217;s AI Chatbots with Distinct Personas Save Threads From Dipping Further?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/meta-develops-ai-chatbots-abraham-lincoln/\" aria-label=\"More on Can Meta&#8217;s AI Chatbots with Distinct Personas Save Threads From Dipping Further?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T13:20:26.000Z",
    "title": "QuickNode Now Available in AWS Marketplace",
    "url": "https://www.cryptopolitan.com/quicknode-now-available-in-aws-marketplace/",
    "description": "Miami, Florida, August 1st, 2023, Chainwire Developers and businesses worldwide can now easily access QuickNode&#8217;s cutting-edge blockchain infrastructure on AWS. QuickNode, a pioneering platform for Web3 development, today announced the availability of Core Node API, its cutting-edge blockchain accessibility infrastructure, in AWS Marketplace. AWS Marketplace is a digital catalog with thousands of software listings from ... <a title=\"QuickNode Now Available in AWS Marketplace\" class=\"read-more\" href=\"https://www.cryptopolitan.com/quicknode-now-available-in-aws-marketplace/\" aria-label=\"More on QuickNode Now Available in AWS Marketplace\">Read more</a>"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-01T13:12:50.000Z",
    "title": "TOP 3 Coins That Gained Most In July’s Last Week",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-coins-that-gained-most-in-julys-last-week/",
    "description": "<p>Among the myriad of DeFi projects, three prominent platforms stand out in the last week: Uniswap, Maker, and Kaspa. Each of these projects plays a vital role in revolutionizing various aspects of finance and blockchain technology. In this article, we will explore these coins, their importance, use cases, and the latest news surrounding them 1) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-coins-that-gained-most-in-julys-last-week/\">TOP 3 Coins That Gained Most In July’s Last Week</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-01T13:37:00.000Z",
    "title": "Exploit on LeetSwap Leads to Loss of $624K Due to Price Manipulation",
    "url": "https://coinedition.com/exploit-on-leetswap-leads-to-loss-of-624k-due-to-price-manipulation/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Exploit on LeetSwap Leads to Loss of $624K Due to Price Manipulation\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/CRYPTO-HACK-5-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Operation on Coinbase’s base network, decentralized exchange LeetSwap has reportedly been exploited, claiming a loss of about 342.5 ETH, or roughly $626K+. According to crypto sleuth CertiK Alert, the attacker manipulated the price by invoking a vulnerable function on the Liquidity Provider (LP) contract, transferring tokens to a fee address, and then effortlessly purchasing all [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/exploit-on-leetswap-leads-to-loss-of-624k-due-to-price-manipulation/\">Exploit on LeetSwap Leads to Loss of $624K Due to Price Manipulation</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-01T13:22:02.000Z",
    "title": "Arweave (AR) Price Prediction 2023-2030: Will AR Price Hit $20 Soon?",
    "url": "https://coinedition.com/arweave-ar-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Arweave-AR-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Arweave-AR-Price-Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Arweave-AR-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Arweave-AR-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Arweave-AR-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Arweave-AR-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Arweave-AR-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>There are other digital currencies besides Bitcoin (BTC) and Ethereum (ETH) that people who want to diversify their portfolios and learn more about cryptocurrencies should consider. Arweave (AR) is one of them. Arweave is a piece of software designed to store data over a decentralized network of computers permanently. It aspires to create a digital [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/arweave-ar-price-prediction/\">Arweave (AR) Price Prediction 2023-2030: Will AR Price Hit $20 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]