[
  {
    "source": "Cointelegraph",
    "date": "2023-07-07T15:17:00.000Z",
    "title": "Gemini files lawsuit against Digital Currency Group and Barry Silbert over Genesis and Earn program",
    "url": "https://cointelegraph.com/news/gemini-files-lawsuit-against-digital-currency-group-barry-silbert-genesis-earn-program",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/a409ad05-005d-4c9c-a69c-fe81cca5a359.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Gemini co-founder Cameron Winklevoss alleged Barry Silbert committed fraud by knowing Genesis was “massively insolvent” when attempting to continue the Earn program.</p>\n                    <p><p>United States-based cryptocurrency exchange Gemini has announced legal action against the conglomerate Digital Currency Group (DCG) and its CEO Barry Silbert, claiming “fraud against creditors”.</p><p>In a July 7 filing in a New York court, Gemini <a href=\"https://assets.ctfassets.net/jg6lo9a2ukvr/1xKyURWTEqN9ZgOZWMOsYw/05b3e97823d3e2534e1d4a06b2ec794a/2023-07-07_Gemini_v._DCG_and_Silbert_Filed_Complaint.pdf\" target=\"_blank\" rel=\"noopener nofollow\">alleged</a> DCG and Silbert engaged in a scheme involving lending “huge amounts of cryptocurrency and U.S. dollars” to Genesis. According to the filing, Gemini seeks to recover funds incurred as a result of “DCG’s and Silbert’s false, misleading, and incomplete representations and omissions to Gemini, and Defendants’ role in encouraging and facilitating Genesis’s fraud against Gemini”, adding the firm would also pursue legal avenues in Genesis’ bankruptcy case.</p><p>Genesis had been the crypto lender responsible for operating an Earn program in partnership with Gemini. However, the firm halted withdrawals in November 2022, citing “unprecedented market turmoil” and subsequently filed for Chapter 11 bankruptcy. </p><p>According to a July 7 Twitter thread from Gemini co-founder Cameron Winklevoss, Silbert <a href=\"https://twitter.com/cameron/status/1677327397790666752\" target=\"_blank\" rel=\"noopener nofollow\">knew</a> Genesis was “massively insolvent” when attempting to continue the Earn program. The complaint included alleged false financial reporting from DCG and Silbert starting with the collapse of Three Arrows Capital in June 2022, which “blew a $1.2 billion hole in Genesis’s balance sheet”.</p><p>“Barry, DCG, and Genesis all conspired to create false financial reports to hide the truth from Gemini and creditors,” claimed Winklevoss. “This fraud goes to the very top. Barry Silbert and other DCG executives were directly involved in these lies and they lied again and again to conceal the truth from Gemini and other creditors.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ Today, <a href=\"https://twitter.com/Gemini?ref_src=twsrc%5Etfw\">@Gemini</a> filed a lawsuit against <a href=\"https://twitter.com/DCGco?ref_src=twsrc%5Etfw\">@DCGco</a> and <a href=\"https://twitter.com/BarrySilbert?ref_src=twsrc%5Etfw\">@BarrySilbert</a> personally in New York court. Barry was not only the architect and mastermind of the DCG and Genesis fraud against creditors, he was directly and personally involved in perpetrating it.</p>&mdash; Cameron Winklevoss (@cameron) <a href=\"https://twitter.com/cameron/status/1677327395869581316?ref_src=twsrc%5Etfw\">July 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-07T15:25:36.000Z",
    "title": "Majority of FSI customers comfortable with crypto, less so AI – Salesforce survey",
    "url": "https://cryptoslate.com/majority-of-fsi-customers-comfortable-with-crypto-less-so-ai-salesforce-survey/",
    "description": "<p>A 2023 H1 survey from Salesforce, which covered 6,058 financial service institution (FSI) customers worldwide, offered significant insights into sentiments surrounding artificial intelligence (AI), cryptocurrency, and the digital shift in the financial services industry. According to the Salesforce Financial Services Report, the survey was conducted from March 7 to April 12, 2023, and encompassed respondents [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/majority-of-fsi-customers-comfortable-with-crypto-less-so-ai-salesforce-survey/\">Majority of FSI customers comfortable with crypto, less so AI &#8211; Salesforce survey</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-07T15:39:00.000Z",
    "title": "Canada Places Trust in Regulated Crypto Investment Funds",
    "url": "https://cryptobriefing.com/canada-places-trust-regulated-crypto-market/?utm_source=feed&utm_medium=rss",
    "description": "The Canadian Securities Administrators (CSA) has confirmed its confidencein the regulated futures market for cryptocurrencies, considering Canada was the first country to launch a Bitcoin exchange-traded fund (ETF): The presence..."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-07T15:32:40.000Z",
    "title": "Biggest Movers: SOL Hits Fresh 4-Week High on Friday, ADA Snaps Losing Streak",
    "url": "https://news.bitcoin.com/biggest-movers-sol-hits-fresh-4-week-high-on-friday-ada-snaps-losing-streak/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1986636659-4-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SOL Hits Fresh 4-Week High on Friday, Whilst ADA Snaps Losing Streak\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1986636659-4-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1986636659-4-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1986636659-4-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1986636659-4-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1986636659-4-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1986636659-4-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1986636659-4.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Solana was one of Friday&#x2019;s biggest gainers, as the cryptocurrency rose by over 11% during today&#x2019;s session. The move came as markets reacted to June&#x2019;s nonfarm payrolls report, which came in at 209,000, below expectations of 229,000. On the other hand, cardano ended a three-day losing streak. Solana (SOL) Solana (SOL) rallied for a second [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T15:34:58.000Z",
    "title": "LUNC validator breathes new life into struggling community",
    "url": "https://www.cryptopolitan.com/lunc-validator-breathes-new-life-into-struggling-community/",
    "description": "In a surprising turn of events, popular Twitter personality, and LUNC validator, ClassyCrypto, has breathed new life into the struggling LUNC Classic (LUNC) cryptocurrency. Taking to Twitter, ClassyCrypto announced his intentions to participate in the LUNC network&#8217;s governance actively, signaling a strong commitment to pushing for substantial changes. Acknowledging the past failures and setbacks of ... <a title=\"LUNC validator breathes new life into struggling community\" class=\"read-more\" href=\"https://www.cryptopolitan.com/lunc-validator-breathes-new-life-into-struggling-community/\" aria-label=\"More on LUNC validator breathes new life into struggling community\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T15:30:09.000Z",
    "title": "EU trade body calls for DeFi inclusion in Europe’s MiCA regulatory framework",
    "url": "https://www.cryptopolitan.com/eu-trade-body-calls-for-defi-inclusion-in-europes-mica/",
    "description": "The Association for Financial Markets in Europe (AFME) is urging European regulators to include decentralized finance (DeFi) in the Markets in Crypto Assets (MiCA) regulations, cautioning against potential risks that could undermine the effectiveness of the regulatory frameworks if DeFi is excluded. The MiCA regulations, poised as the first comprehensive crypto legislation, are due to ... <a title=\"EU trade body calls for DeFi inclusion in Europe&#8217;s MiCA regulatory framework\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eu-trade-body-calls-for-defi-inclusion-in-europes-mica/\" aria-label=\"More on EU trade body calls for DeFi inclusion in Europe&#8217;s MiCA regulatory framework\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T15:25:57.000Z",
    "title": "Crypto Bridges Prone to Hacks: Are Vigilance and Robust Security Measures Effective Solutions?",
    "url": "https://www.cryptopolitan.com/crypto-bridges-prone-to-hacks-solutions/",
    "description": "Cryptocurrency bridges have emerged as critical instruments that facilitate the transfer of tokens between disparate blockchains. By permitting the seamless interplay of digital assets across different ecosystems, they stimulate an unprecedented level of interoperability in the cryptocurrency space.  The fact that crypto bridges prone to hacks are solvable makes this matter crucial. However, this powerful ... <a title=\"Crypto Bridges Prone to Hacks: Are Vigilance and Robust Security Measures Effective Solutions?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-bridges-prone-to-hacks-solutions/\" aria-label=\"More on Crypto Bridges Prone to Hacks: Are Vigilance and Robust Security Measures Effective Solutions?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T15:18:52.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the series of delisting fuelled by the ongoing United States SEC crackdown on major crypto platforms. Basically, it&#8217;s crypto winter in the summer as it stands. How do Cardano Price Prediction analysts steer in this turbulent crypto weather? ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-07T15:29:42.000Z",
    "title": "The Dual Nature Of Cryptocurrency Adoption: Examining Its Impact On Global Income Inequality",
    "url": "https://nulltx.com/the-dual-nature-of-cryptocurrency-adoption-examining-its-impact-on-global-income-inequality/",
    "description": "The widespread adoption of cryptocurrencies has the potential to have both positive and negative impacts on income distribution globally. On one hand, cryptocurrencies offer financial inclusion to those who are unbanked or underbanked, potentially bridging the wealth gap and reducing income inequality. By providing access to a decentralized and borderless financial system, cryptocurrencies can empower [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-07T15:20:57.000Z",
    "title": "Addressing The Potential Of Cryptocurrency For Illegal Activities: Mitigations",
    "url": "https://nulltx.com/addressing-the-potential-of-cryptocurrency-for-illegal-activities-mitigations/",
    "description": "Cryptocurrency, with its decentralized nature and pseudo-anonymity, does have the potential to be exploited for illegal activities such as tax evasion, terrorist funding, fraud, and ransomware attacks. However, it is important to note that the majority of cryptocurrency users engage in legitimate activities, and traditional financial systems are also used for illicit purposes. That said, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-07T15:23:53.000Z",
    "title": "Gemini files lawsuit against DCG and Barry Silbert alleging fraudulent activities",
    "url": "https://crypto.news/gemini-files-lawsuit-against-dcg-and-barry-silbert-alleging-fraudulent-activities/",
    "description": "Cryptocurrency exchange Gemini has filed a lawsuit in a New York court against DCG (Digital Currency Group) and Barry Silbert. Cameron Winklevoss, the co-founder of Gemini, alleged in a June 7 tweet that Silbert played a central role in orchestrating&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-07T15:30:23.000Z",
    "title": "Bitcoin Short-Term Holders Continue Exchange Inflows, But Price Holds On",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-short-term-holders-exchange-inflows-price/",
    "description": "On-chain data shows that Bitcoin short-term holders have continued to make exchange inflows, but the asset&#8217;s price has held on so far. Bitcoin Short-Term Holders Make High Deposits For 20 Straight Days According to data from the on-chain analytics firm Glassnode, the short-term holders have sent 617,000 BTC to exchanges during the past 20 days. The &#8220;short-term holders&#8221; (STHs) here refer to Bitcoin investors who have been holding onto their coins since less than 155 days ago. The STHs are generally the less experienced hands of the market, who may easily sell during periods of widespread FUD in the market, or during sharp surges in the cryptocurrency&#8217;s price. Usually, these investors make use of exchanges for participating in such selloffs, so the data for their &#8220;exchange inflows&#8221; can provide hints about their current behavior. The exchange inflow here naturally refers to the total amount of Bitcoin that the STHs are depositing to the wallets of centralized exchanges. When the value of this metric is high, it can be a sign that these holders are selling a large number of coins currently. Naturally, such a trend may have bearish consequences for the asset&#8217;s price. Now, here is a chart that shows the trend in the Bitcoin exchange inflow for these STHs over the past year or so: Looks like the value of the metric seems to have been relatively high in recent days &#124; Source: Glassnode on Twitter Here, the Bitcoin STH exchange inflows are represented in terms of the percentage of their supply. As the supply of these investors can change, it makes more sense to consider the percentage of it as it would make comparisons with history easier (the pure figures, on the other hand, may be incompatible). From the graph, it&#8217;s visible that the Bitcoin STH exchange inflows have been elevated recently. During the last 20 days, these investors&#8217; inflows have measured above 1% of their supply. Related Reading: BlackRock CEO Larry Fink Says Bitcoin Is Digital Gold, So What’s The Digital Silver? In this period, the cohort has deposited a total of about 617,000 BTC ($18.6 billion at the current exchange rate) to these platforms, which is quite a significant amount. In the chart, Glassnode has also highlighted the previous instances during the last year or so where the indicator crossed the same threshold of 1%. It looks like in terms of the magnitude of the inflow spikes, the three capitulation periods that followed the LUNA collapse, 3AC bankruptcy, and FTX crash, respectively, saw larger peaks than the recent levels. The duration of the latest period of elevated exchange inflow activity from the Bitcoin STHs, however, has been quite extraordinary, as it has gone on for at least 20 days so far. Whereas the aforementioned capitulation selloffs only lasted for 13 days each. Related Reading: Glassnode Co-Founder Predicts Bull Run For Bitcoin Amidst Sideways Trading Nevertheless, despite the high selling pressure from this cohort, It would appear that the price of the cryptocurrency has been holding strong thus far, as it&#8217;s still floating above the $30,000 level. BTC Price At the time of writing, Bitcoin is trading around $30,100, down 2% in the last week. BTC has been stuck in sideways movement recently &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-07T15:30:12.000Z",
    "title": "The Future of Personal Growth: Introducing WEWE Global’s Innovative Platform",
    "url": "https://www.crypto-news-flash.com/the-future-of-personal-growth-introducing-wewe-globals-innovative-platform/?utm_source=rss&utm_medium=rss&utm_campaign=the-future-of-personal-growth-introducing-wewe-globals-innovative-platform",
    "description": "WEWE Global, the innovative crypto platform aimed at fostering personal growth and community empowerment, is leading the way in creating an environment where everyone can thrive. By leveraging the power of technology, the platform offers individuals and communities the opportunity to access a diverse range of services, products, and growth opportunities. What is WEWE? WEWE [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-07T15:35:00.000Z",
    "title": "FBI Searches Home of Kraken Founder Jesse Powell in Cyberstalking Case",
    "url": "https://coinedition.com/fbi-searches-home-of-kraken-founder-jesse-powell-in-cyberstalking-case/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FBI Searches Home of Kraken Founder Jesse Powell in Cyberstalking Case\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/FBI-Searches-Home-of-Kraken-Founder-Jesse-Powell-in-Cyberstalking-Case-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A Kraken representative clarified that the crypto exchange was in no way involved in the investigation. The FBI conducted a search at the home of Jesse Powell in connection with the cyber-stalking case of Verge. Verge, which Powell cofounded, had removed him from the organization after they faced ideological differences. In connection with a case [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/fbi-searches-home-of-kraken-founder-jesse-powell-in-cyberstalking-case/\">FBI Searches Home of Kraken Founder Jesse Powell in Cyberstalking Case</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-07-07T15:28:09.000Z",
    "title": "The Importance of P2P Trading in Emerging Markets",
    "url": "https://blog.bitfinex.com/education/the-importance-of-p2p-trading-in-emerging-markets/",
    "description": "<p>Bitfinex launched a new peer to peer (P2P) crypto trading platform for citizens in Colombia, Argentina, and Venezuela this month. We look at how P2P trading is not just a useful way to acquire crypto assets, but also a key driver behind global crypto adoption....</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/education/the-importance-of-p2p-trading-in-emerging-markets/\">The Importance of P2P Trading in Emerging Markets</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]