[
  {
    "source": "CoinDesk",
    "date": "2024-03-25T20:32:16.000Z",
    "title": "Garlinghouse Says SEC to Press Judge for $2B in Fines and Penalties in Ripple Case",
    "url": "https://www.coindesk.com/policy/2024/03/25/garlinghouse-says-sec-to-press-judge-for-2b-in-fines-and-penalties-in-ripple-case/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Securities and Exchange Commission (SEC) is reportedly asking a New York judge to levy a $2 billion judgment against Ripple Labs, according to social media posts from the crypto company’s CEO and chief legal officer on Monday."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-25T20:30:00.000Z",
    "title": " DeFi fund, Texas apparel company sue to defend airdrop against SEC ",
    "url": "https://cointelegraph.com/news/defi-fund-texas-apparel-company-sue-defend-airdrop-against-sec",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYWQ5OTdkZDEtMWU4YS00NWUxLWJmODAtZTE3YjYxNTA2OWJlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The tokens are distributed for free and unasked for, so they’re not securities, according to the suit. </p>\n                    <p><p>Beba, a Texas clothing company run by African immigrants, and the DeFi Education Fund have teamed up to defend the company’s recent airdrop of BEBA tokens against potential actions by the United States Securities and Exchange Commission (SEC) by seeking a declaratory judgment from the U.S. District Court for Western Texas. In a suit <a href=\"https://www.defieducationfund.org/_files/ugd/84ba66_3f7a8f2ca6614d7381122cb1beeed4a8.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> on March 25, the plaintiffs also asked the court for clarification of the limits of the SEC’s authority in light of the Administrative Procedures Act (APA).</p><p>Beba created 100,000 BEBA tokens and has airdropped 60,880 of them so far, according to the suit. The tokens are intended to be freely traded and are expected to increase in value. The SEC “will take the position that BEBA tokens are investment contracts and that the airdrop is a securities transaction subject to registration requirements under the Securities Act of 1933,” it continued. </p><p>Nonetheless, the plaintiffs argued that token recipients do nothing to become eligible for the airdrop or take actions that involve no “meaningful consideration, like ‘following’ Beba on social media.” Therefore, there is no common enterprise in the airdrop. Nor did Beba promise to take measures to increase the token’s value. Therefore, the airdrop <a href=\"https://cointelegraph.com/news/crypto-and-securities-new-interpretation-of-us-howey-test-gaining-ground\">does not represent a contract</a> under the Howey test, they argued.</p><p><a href=\"https://cointelegraph.com/news/defi-fund-texas-apparel-company-sue-defend-airdrop-against-sec\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-25T20:13:25.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">The supply of Bitcoin on Coinbase has plunged to nine-year lows, signaling ongoing accumulation of the largest digital asset. Meanwhile, there's more bad news for Binance as it faces an investigation by the Nigerian government for tax evasion, while BlackRock's spot Bitcoin exchange-traded fund (ETF) is poised to flip that of Grayscale’s Bitcoin Trust ETF within three weeks, based on recent ETF flow data. </p><p>Bitcoin’s price <a href=\"https://cointelegraph.com/news/btc-accumulation-restarted-coinbase-btc-supply-9-year-low\">climbed back above $70,000</a> on March 25, as BTC supplies on crypto exchange Coinbase dwindled to nine-year lows — signaling continued accumulation. </p><p>The leading digital asset briefly traded above $71,000, according to Cointelegraph data, having gained more than 6% on the day. </p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-25T20:39:09.000Z",
    "title": "Decentralized Cloud Computing: A Future Empowered by Innovators",
    "url": "https://cryptodaily.co.uk/2024/03/decentralized-cloud-computing-a-future-empowered-by-innovators",
    "description": "In the digital age, cloud computing has emerged as the backbone of the internet, fostering innovation, supporting the global economy, and empowering billions of users worldwide."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-25T20:32:37.000Z",
    "title": "FTX estate plans to sell $884M stake in AI firm Anthropic",
    "url": "https://www.cryptopolitan.com/ftx-estate-sell-884m-stake-anthropic/",
    "description": "The estate of the bankrupt crypto exchange FTX has announced plans to sell about two-thirds of its 8% stake in the artificial intelligence startup Anthropic in deals totaling $884 million.  According to a report by the Wall Street Journal on Monday, ATIC Third International Investment Company LLC, linked to the United Arab Emirates&#8217; sovereign wealth [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-25T20:40:57.000Z",
    "title": "Internet Computer rallies 40%, emerges among the top weekly gainers",
    "url": "https://crypto.news/internet-computer-rallies-top-gainers/",
    "description": "Internet Computer's token price reached $17 today, its highest in two years."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-25T20:36:12.000Z",
    "title": "BOON, a new ERC-20 meme coin unveiled by the Base Baboon team",
    "url": "https://crypto.news/boon-a-new-erc-20-meme-coin-unveiled-by-the-base-baboon-team/",
    "description": "BOON, an ERC-20 meme coin released by the Base Baboon team, presents a distinctive proposition in the meme coin arena #sponsored"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-25T20:28:42.000Z",
    "title": "FTX to sell $884m Anthropic stake to Abu Dhabi firm, 20 other investors",
    "url": "https://crypto.news/ftx-sale-anthropic-abu-dhabi/",
    "description": "FTX is selling two-thirds of its shares in Anthropic at $884 million, most of which are being acquired by Abu Dhabi-based investors. "
  }
]