[
  {
    "source": "CoinDesk",
    "date": "2023-06-28T17:46:35.000Z",
    "title": "Gary Gensler Failed the U.S. Crypto Industry, and So Has Congress",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/28/gary-gensler-failed-the-us-crypto-industry-and-so-has-congress/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "As long as he keeps following the \"one over nine\" rule, the U.S. Securities and Exchange Commission will ruin crypto summer."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-28T18:00:00.000Z",
    "title": "Israeli authorities seize crypto from terror organizations, credit new technology",
    "url": "https://cointelegraph.com/news/israeli-authorities-seize-crypto-from-terror-organizations-credit-new-technology",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/86c0d0c0-2e3e-4de0-a77c-a88534f26bcd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Israeli Ministries of Defense and Justice and a number of intelligence and enforcement agencies collaborated, Chainalysis also pitched in.</p>\n                    <p><p>Israel has seized crypto wallets containing millions of dollars intended to fund terror, the country’s National Bureau for Counter Terrorist Financing <a href=\"https://nbctf.mod.gov.il/en/pages/28062023EN.aspx\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> June 28. Israeli Defense Minister Yoav Gallant <a href=\"https://www.jpost.com/arab-israeli-conflict/article-747924\" target=\"_blank\" rel=\"noopener nofollow\">credited</a> collaboration among the Israeli Defense and Justice Ministries, Israeli intelligence and new technology for the operation, according to local media.</p><p>Speaking at a conference on June 27, Gallant said the operation concluded “a few days ago” and seized crypto that had been transferred to terrorist organization Hezbollah and the Iranian Quds Force. It was the largest seizure of cryptocurrency from those groups so far. “We have effectively cut off the flow of terror funds via this channel,” Gallant said. He added:</p><blockquote>\"In recent months, we have developed at the National Bureau for Counter Terror Financing in the Ministry of Defense, in collaboration with intelligence and enforcement entities […] new capabilities that have led to very significant achievements also on this battlefront.\"</blockquote><p>Gallant said Hezbollah, Quds and “Syrian elements” had been using crypto “to obtain […] funds from third parties, mainly money changers with whom they perpetrated unlawful transactions.”</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/security-practices-for-web3-startups-israel-crypto-conference\">2 key security practices for Web3 startups from Israel Crypto Conference</a></em></strong></p><p>Blockchain analytics firm Chainalysis <a href=\"https://blog.chainalysis.com/reports/israel-nbctf-hezbollah-iran-quds-crypto-seizure/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a blog post that Israeli authorities seized $1.7 million in the operation. “We’re proud to say that Chainalysis tools played a role in this landmark national security achievement,” it added.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ Let’s take a look behind the scenes of Israel’s NBCTF seizure of ~$1.7M worth of crypto from addresses associated with Hezbollah &amp; Iran’s Quds Force terrorism financing infrastructure using Chainalysis Reactor.</p>&mdash; Chainalysis (@chainalysis) <a href=\"https://twitter.com/chainalysis/status/1674070265175605249?ref_src=twsrc%5Etfw\">June 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The operation was not the first to tackle crypto financing. Palestinian Sunni organization Hamas <a href=\"https://www.reuters.com/world/middle-east/hamas-armed-wing-announces-suspension-bitcoin-fundraising-2023-04-28/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> in April that it would no longer accept donation in cryptocurrency, reversing a longtime policy, “out of concern about the safety of donors” after “intensification of hostile efforts against anyone who tries to support the resistance through this currency.” </p><p>Reuters <a href=\"https://www.reuters.com/world/middle-east/israel-seized-binance-crypto-accounts-thwart-islamic-state-document-shows-2023-05-04/\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> a few days later that Israel had seized about 190 accounts on Binance linked to the Islamic State and Hamas since 2021. Binance <a href=\"https://www.binance.com/en/blog/community/our-response-to-reuters-1363137884256691497\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a blog post that the Reuters report was “deliberately leaving out critical facts” in its coverage.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\">Tornado Cash 2.0: The race to build safe and legal coin mixers</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T17:52:06.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-28T17:49:22.000Z",
    "title": "Creditors request BlockFi’s dissolution, accuse CEO of fraud and extortion",
    "url": "https://crypto.news/creditors-request-blockfis-dissolution-accuse-ceo-of-fraud-and-extortion/",
    "description": "Creditors of failed cryptocurrency lending platform BlockFi are seeking liquidation of the firm's assets, citing allegations of fraud and misconduct against the company and its CEO, Zac Prince."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-28T17:41:56.000Z",
    "title": "EU data act adopts smart contract kill switch regulations",
    "url": "https://crypto.news/eu-data-act-adopts-smart-contract-kill-switch-regulations/",
    "description": "The European Union (EU) is making progress on the European Data Act, despite facing criticism from the cryptocurrency community, as lawmakers have reached an agreement to proceed with the legislation."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T18:00:16.000Z",
    "title": "FTX Puts Sale Of $500 Million Stake In AI Firm Anthropic On Hold",
    "url": "https://www.newsbtc.com/ftx/ftx-puts-sale-of-500-million-stake-in-ai-firm-anthropic-on-hold/",
    "description": "The bankrupt cryptocurrency exchange FTX has suddenly halted the sale of its highly valued asset: its stake in the artificial intelligence startup, Anthropic. This abrupt decision introduces potential delays in addressing the remaining $2 billion deficit in FTX&#8217;s balance sheet, as the sale of the $500 million stake has been put on hold. Despite receiving interest from multiple parties interested in purchasing FTX&#8217;s stake, the advisory investment bank of FTX, Parella Weinberg Partners, has chosen to pause the sale of FTX&#8217;s stake in Anthropic this month. FTX stands to make a significant monetary recovery through the sale of its stake. A report by FTX restructuring chief John Ray on June 26 revealed that an estimated $8.7 billion in user funds had been misappropriated. Out of that, approximately $7 billion has already been successfully recovered. FTX&#8217;s &#8216;Clawback&#8217; Impacted By Halt In Anthropic&#8217;s Sale In January, a federal judge presiding over the FTX bankruptcy case granted permission for FTX to proceed with the sale of certain assets in order to repay its creditors. At the time of FTX&#8217;s bankruptcy filing in November, the company held $500 million worth of Anthropic stock. Related Reading: Uniswap Bullish But Struggles With Resistance, Potential For More Gains? However, due to the ongoing AI boom, it is anticipated that the value of this stock has significantly increased since then. FTX has also divested itself of other assets. These included the derivatives trading platform LedgerX, which was sold for $50 million. This sale resulted in a significant loss compared to the $300 million that FTX initially paid for LedgerX in 2021. Selling Anthropic&#8217;s shares was part of its strategy to recover funds and allocate them toward repaying creditors. This process is commonly known as a &#8220;clawback.&#8221; Clawback refers to a legal procedure, and in the context of bankruptcy, the bankruptcy trustee, in FTX&#8217;s case Perella Weinberg Partners, seeks to recover property or payments made by the company prior to its filing for bankruptcy. In November, FTX filed for Chapter 11 bankruptcy protection as a legal measure. Approximately a month later, FTX co-founder Sam Bankman-Fried faced a series of federal charges. These charges included money laundering, fraud, and conspiracy to commit wire fraud. In recently filed court documents at the United States Bankruptcy Court of Delaware, FTX&#8217;s former leadership, including Sam Bankman-Fried, has been accused of commingling more than $402 million in customer funds. Allegedly, this action was carried out under the direction of Bankman-Fried and other senior FTX executives. Second Highest Stake Was In Anthropic At the time of FTX&#8217;s bankruptcy, its stake in the AI firm was one of the significant holdings. FTX&#8217;s stake in the AI ranked just behind its reported $1.15 billion investment in the cryptocurrency miner, Genesis Digital Assets. Anthropic, was founded in 2021 by former OpenAI employees. It made waves in the AI industry with the launch of its platform, Claude AI, in March. The company gained significant attention and support, securing a $400 million investment from Google earlier this year. During May, Anthropic secured $450 million in Series C funding. Spark Capital played a key role in leading the funding round, demonstrating their confidence in Anthropic&#8217;s vision and potential. Related Reading: Robinhood To Lay Off 7% of Full-Time Staff In Latest Restructuring Notably, the funding round also saw participation from many prominent investors. Google, Salesforce Ventures, Sound Ventures, and Zoom Ventures were among the notable entities. Featured image from The New Republic, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T18:00:47.000Z",
    "title": "Ripple (XRP) Initially Approved for License in Singapore, Paving the Way for Avorak in Asia",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-initially-approved-for-license-in-singapore-paving-the-way-for-avorak-in-asia/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-xrp-initially-approved-for-license-in-singapore-paving-the-way-for-avorak-in-asia",
    "description": "The current positive trend of XRP indicates that blockchain technology is constantly evolving as the adoption curve accelerates. Nevertheless, artificial intelligence has demonstrated many improvements in education, healthcare, and medicine. Combined with blockchain tech, this new AI crypto, Avorak AI, is on its way to conquering Singapore and the whole world. What Does this License [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-28T18:05:24.000Z",
    "title": "Cardano (ADA), Solana (SOL) and One Additional Altcoin Could Be Part of Next ‘Reckoning’: Benjamin Cowen",
    "url": "https://dailyhodl.com/2023/06/28/cardano-ada-solana-sol-and-one-additional-altcoin-could-be-part-of-next-reckoning-benjamin-cowen/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/bot-allocates-sol-ada.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/bot-allocates-sol-ada.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/bot-allocates-sol-ada.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/bot-allocates-sol-ada.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/bot-allocates-sol-ada.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/bot-allocates-sol-ada.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/bot-allocates-sol-ada.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Popular crypto analyst Benjamin Cowen warns that Cardano (ADA), Solana (SOL) and one other altcoin could soon implode against Bitcoin (BTC). Cowen tells his 748,900 Twitter followers that he believes ADA, SOL and Polygon (MATIC) are going to show further weakness against the crypto king based on historical price action. Looking at ADA, Cowen predicts [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/28/cardano-ada-solana-sol-and-one-additional-altcoin-could-be-part-of-next-reckoning-benjamin-cowen/\">Cardano (ADA), Solana (SOL) and One Additional Altcoin Could Be Part of Next ‘Reckoning’: Benjamin Cowen</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]