[
  {
    "source": "Decrypt",
    "date": "2023-09-28T13:53:02.000Z",
    "title": "Coinbase Rolls Out Futures Trading for Retail Crypto Traders Globally",
    "url": "https://decrypt.co/199098/coinbase-rolls-out-futures-trading-retail-crypto-traders-globally",
    "description": "The crypto exchange has set its sights on global expansion amid ongoing legal challenges from the SEC in the U.S."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-28T13:56:55.000Z",
    "title": "Bitcoin lender Ledn to roll out ETH, USDT interest accounts ",
    "url": "https://cointelegraph.com/news/bitcoin-lender-ledn-launches-eth-usdt-deposits",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/c41b965d-e3d6-49f3-b98f-ee5c5f7fec5f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Spurred on by user requests, traditional Bitcoin lending firm Ledn is rolling out an Ethereum yield product. </p>\n                    <p><p>Despite its roots embedded in Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) lending, lending platform Ledn has announced the launch of an Ethereum (ETH) yield offering following user requests for a shielded alternative to manually staking Ether.</p><p>The Cayman Island’s firm has added an ETH offering to its Growth Accounts products, which currently offers users ring-fenced facilities to earn interest on Bitcoin and USD Coin (USDC) deposits.</p><p>An announcement shared with Cointelegraph highlighted user calls for a means to earn interest from ETH holdings without having to manually stake and manage Ether through liquid staking pools.</p><p>The lending firm also notes that its Growth Accounts are specifically “ring-fenced” from Ledn’s other products and services. Deposited ETH is only exposed to the counterparty that generates yield off the staked amount, which means that users deposits will remain unaffected if Ledn was to go bankrupt.</p><p><a href=\"https://cointelegraph.com/news/coinbase-launches-crypto-loans-for-institutional-investors\"><strong><em>Related: Coinbase launches crypto lending platform for US institutions</em></strong></a></p><p>This is particularly pertinent given high profile failures of some of the cryptocurrency industry most prominent crypto lending firms. The likes Celsius, Voyager and Three Arrows Capital (3AC) highlight the potential pitfalls of over-extended and questionable lending practices that have plagued the industry.</p><p>Ledn chief strategy officer Mauricio Di Bartolomeo said that Ledn users have continually inquired about an Ether offering and remained confident that it would be a favourable alternative to self-managing ETH staking:</p><blockquote>“This yield option is significantly easier to set up than native ETH staking. Looking forward, we’re working towards rolling out ETH support across the entire Ledn suite of products in the coming months.”</blockquote><p>Ledn also announced that it will be launching a second stablecoin Growth Account, with users set to be able to deposit and earn interest on USDT tokens from Oct. 12. These new offerings will not be available to United States or Canadian users.</p><p>Ledn is not the only Bitcoin-first company to have gradually rolled out support for cryptocurrencies other than BTC. Casa, a non-custodial wallet platform which began as a Bitcoin-only service, rolled out multi-signature ETH self-storage in <a href=\"https://cointelegraph.com/news/casa-launches-multi-signature-ethereum-self-custody-vault\">June 2023</a>.</p><p>Ledn also announced a partnership in <a href=\"https://cointelegraph.com/news/bitcoin-backed-property-investment-becomes-new-avenue-for-cayman-islands-residency\">Aug. 2023</a> with Cayman Islands' real estate company Parallel that would enable cryptocurrency users to invest in property as a means to attain eventual residency. </p><p><a href=\"https://cointelegraph.com/magazine/crypto-home-loan-bitcoin-mortgage-risky/\"><strong><em>Magazine: Home loans using crypto as collateral: Do the risks outweigh the reward?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-28T13:53:30.000Z",
    "title": "Costco’s Midas Touch: 1-ounce Gold Bars Are Flying Off the Shelves",
    "url": "https://www.cryptoglobe.com/latest/2023/09/costcos-midas-touch-1-ounce-gold-bars-are-flying-off-the-shelves/",
    "description": "Costco, the retail giant renowned for offering a wide range of products at discounted prices, has recently added an unexpected item to its inventory: 1-ounce gold bars. While the exact price is available only to Costco members, online discussions suggest that the bars were priced at just under $1,900. As of 1:30 p.m. UTC on […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-28T14:04:02.000Z",
    "title": "Radix Babylon Upgrade Marks New Era for Web3 User and Developer Experience",
    "url": "https://cryptodaily.co.uk/2023/09/radix-babylon-upgrade-marks-new-era-for-web3-user-and-developer-experience",
    "description": "Radix Babylon Upgrade Marks New Era for Web3 User and Developer Experience"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-28T14:00:47.000Z",
    "title": "Kresus Enters Strategic Collaboration With Collectibles.com As Leading Wallet Partner",
    "url": "https://cryptodaily.co.uk/2023/09/kresus-enters-strategic-collaboration-with-collectiblescom-as-leading-wallet-partner",
    "description": "Kresus Super App selected as the official wallet partner on the Web 3 collectibles marketplace, Collectibles.com."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-28T13:46:44.000Z",
    "title": "Supra Completes Over $24m in Early Stage Funding to Date",
    "url": "https://cryptodaily.co.uk/2023/09/supra-completes-over-24m-in-early-stage-funding-to-date",
    "description": "Supra Completes Over $24m in Early Stage Funding to Date"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T14:02:18.000Z",
    "title": "Marvel’s Spider-Man 2 Footage of Venom Vs. Miles and Peter Released",
    "url": "https://www.cryptopolitan.com/spider-man-2-footage-of-venom-vs-miles-peter/",
    "description": "After waiting for a long time, fans finally have a quick look at Venom standing up against Miles Morales and Peter Parker in Marvel&#8217;s Spider-Man 2.&#160; Previously, Marvel&#8217;s Spider-Man: Miles Morales and Spider-Man by Insomniac Entertainment have been a huge success. Now, the gaming studio is back with another adventurous sequel full of action and ... <a title=\"Marvel&#8217;s Spider-Man 2 Footage of Venom Vs. Miles and Peter Released\" class=\"read-more\" href=\"https://www.cryptopolitan.com/spider-man-2-footage-of-venom-vs-miles-peter/\" aria-label=\"More on Marvel&#8217;s Spider-Man 2 Footage of Venom Vs. Miles and Peter Released\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T14:01:00.000Z",
    "title": "Radix Babylon Upgrade Marks New Era for Web3 User and Developer Experience",
    "url": "https://www.cryptopolitan.com/radix-babylon-upgrade-marks-new-era-for-web3-user-and-developer-experience/",
    "description": "London, England, September 28th, 2023, Chainwire Decentralized ledger platform Radix Publishing has celebrated the successful completion of its long-anticipated Babylon mainnet upgrade. The Babylon upgrade represents the end of the Olympia era and has been hailed by Radix as a game-changing moment for Web3 and the wider DeFi space. The Babylon mainnet upgrade has been ... <a title=\"Radix Babylon Upgrade Marks New Era for Web3 User and Developer Experience\" class=\"read-more\" href=\"https://www.cryptopolitan.com/radix-babylon-upgrade-marks-new-era-for-web3-user-and-developer-experience/\" aria-label=\"More on Radix Babylon Upgrade Marks New Era for Web3 User and Developer Experience\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T13:57:09.000Z",
    "title": "3 Cryptocurrencies Pumping Right Now – Maker (MKR), Everlodge (ELDG), Chainlink",
    "url": "https://www.cryptopolitan.com/3-cryptocurrencies-pumping-right-now-maker-mkr-everlodge-eldg-chainlink/",
    "description": "Maker, Everlodge, and Chainlink have all surged over the past week after a recent rise in altcoin activity. Post increase, the number of investors buying Maker, Everlodge, and Chainlink has grown dramatically, which is expected to drive up their value again in October. Should current trends continue, Maker, Everlodge, and Chainlink could become some of ... <a title=\"3 Cryptocurrencies Pumping Right Now – Maker (MKR), Everlodge (ELDG), Chainlink\" class=\"read-more\" href=\"https://www.cryptopolitan.com/3-cryptocurrencies-pumping-right-now-maker-mkr-everlodge-eldg-chainlink/\" aria-label=\"More on 3 Cryptocurrencies Pumping Right Now – Maker (MKR), Everlodge (ELDG), Chainlink\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T13:50:24.000Z",
    "title": "Experts Pick the Best Gaming Tokens for New Investors – Apecoin, Kangamoon, Immutable",
    "url": "https://www.cryptopolitan.com/experts-pick-the-best-gaming-tokens-for-new-investors-apecoin-kangamoon-immutable/",
    "description": "Are you a new investor in the crypto space or you are looking for which tokens to invest in? From three top gaming tokens, crypto experts have chosen one you should consider looking at. Which of Apecoin, Immutable, and Kangamoon is worth your investment? Don&#8217;t Miss Out On The Kangamoon (KANG) Presale &#8211; Reserve Your ... <a title=\"Experts Pick the Best Gaming Tokens for New Investors – Apecoin, Kangamoon, Immutable\" class=\"read-more\" href=\"https://www.cryptopolitan.com/experts-pick-the-best-gaming-tokens-for-new-investors-apecoin-kangamoon-immutable/\" aria-label=\"More on Experts Pick the Best Gaming Tokens for New Investors – Apecoin, Kangamoon, Immutable\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T13:49:56.000Z",
    "title": "Supra Completes Over $24m in Early Stage Funding to Date",
    "url": "https://www.cryptopolitan.com/supra-completes-over-24m-in-early-stage-funding-to-date/",
    "description": "Miami, Florida, September 28th, 2023, Chainwire Supra has raised over $24m in private investment rounds.  Supra has received investment from several multi-billion dollar prominent VCs including: Animoca, Coinbase Ventures, HashKey, Prosus Ventures, Razer, United Overseas Bank Venture Management, Valor Equity Partners, among many more.  Supra is developing an innovative cross-chain oracle and “bridgeless” communication network ... <a title=\"Supra Completes Over $24m in Early Stage Funding to Date\" class=\"read-more\" href=\"https://www.cryptopolitan.com/supra-completes-over-24m-in-early-stage-funding-to-date/\" aria-label=\"More on Supra Completes Over $24m in Early Stage Funding to Date\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T13:49:19.000Z",
    "title": "Amazon Faces Major Antitrust Lawsuit from FTC and 17 States, Accused of Stifling Competition",
    "url": "https://www.cryptopolitan.com/amazon-faces-antitrust-lawsuit-from-ftc/",
    "description": "In a significant legal development, the e-commerce giant Amazon is now facing an antitrust lawsuit filed by the Federal Trade Commission (FTC) in a federal court in Seattle. Alongside the FTC, attorneys general from 17 U.S. states are jointly pursuing allegations that Amazon has engaged in anticompetitive practices detrimental to both consumers and sellers. The ... <a title=\"Amazon Faces Major Antitrust Lawsuit from FTC and 17 States, Accused of Stifling Competition\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amazon-faces-antitrust-lawsuit-from-ftc/\" aria-label=\"More on Amazon Faces Major Antitrust Lawsuit from FTC and 17 States, Accused of Stifling Competition\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T13:46:40.000Z",
    "title": "Theta Network and The Sandbox Investors Move To Kangamoon for 220% ROI in 2023",
    "url": "https://www.cryptopolitan.com/theta-network-and-the-sandbox-investors-move-to-kangamoon-for-220-roi-in-2023/",
    "description": "Theta Network and The Sandbox have lost several users and price gains to the crypto bear market. Despite their features and use cases, they have failed to retain investors&#8217; interest. Currently, Theta Network And The Sandbox are moving to a new crypto project called Kangamoon. Let&#8217;s find out more. Don&#8217;t Miss Out On The Kangamoon ... <a title=\"Theta Network and The Sandbox Investors Move To Kangamoon for 220% ROI in 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/theta-network-and-the-sandbox-investors-move-to-kangamoon-for-220-roi-in-2023/\" aria-label=\"More on Theta Network and The Sandbox Investors Move To Kangamoon for 220% ROI in 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T13:39:59.000Z",
    "title": "Riding the Next Crypto Wave: Pomerdoge (POMD), Toncoin (TON), and Solana (SOL) Stake Their Claim",
    "url": "https://www.cryptopolitan.com/riding-the-next-crypto-wave-pomerdoge-pomd-toncoin-ton-and-solana-sol-stake-their-claim/",
    "description": "Among the next wave of cryptos are Pomerdoge (POMD), Toncoin (TON), and Solana (SOL). Particularly noteworthy is Pomerdoge, a promising entrant currently in its presale phase. This article aims to delve into the potential these three contenders bring to the table, particularly emphasizing the opportunities presented by the Pomerdoge presale. &#160;&#160;Click Here To Find Out ... <a title=\"Riding the Next Crypto Wave: Pomerdoge (POMD), Toncoin (TON), and Solana (SOL) Stake Their Claim\" class=\"read-more\" href=\"https://www.cryptopolitan.com/riding-the-next-crypto-wave-pomerdoge-pomd-toncoin-ton-and-solana-sol-stake-their-claim/\" aria-label=\"More on Riding the Next Crypto Wave: Pomerdoge (POMD), Toncoin (TON), and Solana (SOL) Stake Their Claim\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T13:39:58.000Z",
    "title": "As Pomerdoge (POMD) Celebrates a 168% Jump, Pepe (PEPE) and ApeCoin (APE) Navigate Choppy Waters",
    "url": "https://www.cryptopolitan.com/as-pomerdoge-pomd-celebrates-a-168-jump-pepe-pepe-and-apecoin-ape-navigate-choppy-waters/",
    "description": "As the market observes a phenomenal 168% surge in the value of Pomerdoge (POMD), its counterparts, Pepe (PEPE) and ApeCoin (APE), are experiencing a rather turbulent phase. This high-altitude climb of Pomerdoge is even more noteworthy as it comes during the token&#8217;s presale phase, highlighting the early enthusiasm among investors for this emerging player in ... <a title=\"As Pomerdoge (POMD) Celebrates a 168% Jump, Pepe (PEPE) and ApeCoin (APE) Navigate Choppy Waters\" class=\"read-more\" href=\"https://www.cryptopolitan.com/as-pomerdoge-pomd-celebrates-a-168-jump-pepe-pepe-and-apecoin-ape-navigate-choppy-waters/\" aria-label=\"More on As Pomerdoge (POMD) Celebrates a 168% Jump, Pepe (PEPE) and ApeCoin (APE) Navigate Choppy Waters\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-28T14:00:01.000Z",
    "title": "IPO Frenzy: What Happens To XRP Price If Ripple Stock Climbs To $600?",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-ripple-stock-600/",
    "description": "One thing that has emerged that could influence the XRP price has been the possibility of Ripple carrying out an Initial Public Offering (IPO). This would mean that shares of the crypto firm would become publicly tradable like that of Coinbase’s COIN stock. However, even more prominent among investors is the possibility of how high the price of the shares could trade. Financial Expert’s Ripple Video Resurfaces The rumors had first begun with some members of the XRP community talking about a possible IPO. Like rumors are wont to do, it quickly took on a life of its own and grew from there. But the most interesting thing so far has been the resurrection of a video of financial expert Linda Jones talking about a possible valuation for Ripple. Related Reading: Analyst Presents 4 Charts That Prove Crypto Is Not Dead Jones had put forward a valuation of $5.7 billion for a possible stock, which placed the single share price at $35 apiece at the time, using data from the Linqto platform. She points to the XRP in circulation which comes out to over $21 billion. Given this, she believes that Ripple’s stock valuation at $35 is too low. Comparing Ripple to Coinbase which IPO’d at an $86 billion valuation, the financial analyst points out that Ripple stock would be valued much higher. She takes into account the market cap of the XRP supply as well, at which point she arrives at a $107 billion valuation. In this case, the value of Ripple stocks comes out to 20x higher than what they were valued at the time that the interview was made. This would put the Ripple stock at a value of around $600, but with the possibility of being higher as the expert points out Ripple’s valuation could reach as high as half a trillion. According to her, the company has what it takes to be considered a high-value company like Nvidia or Apple. What Happens To The XRP Price In This Case? If a Ripple stock were to be released and it reached as high as Jones’ calculations present, then there is more than enough reason for the XRP price to rocket alongside the stock price. In this case, Ripple would be the first public company to have a cryptocurrency, so there is really no historical data. However, some similarities can be drawn from Bitcoin’s connection to the stock price of Bitcoin mining companies. Related Reading: Crypto Analyst Predicts Huge Double-Digit Breakout For Bitcoin Price When the price of Bitcoin rallies, the stock price of Bitcoin mining companies have often followed suit. This is often because a surge in faith in one translates to a rise in faith in another. Applying the same logic to Ripple and a surge in the stock price would likely result in more interest in the underlying cryptocurrency, resulting in an increase in the XRP price. If the stock price eventually climbs above $600, then it is not out of the ordinary to expect the XRP price to cross $5 at least. Additionally, there would likely be a strong correlation in the performance of both assets, so a drop in one could mean a drop in the other, and vice versa. Token price rises above $0.5 once more &#124; Source: XRPUSD on Tradingview.com Featured image from CoinMarketCap, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T14:06:52.000Z",
    "title": "Radix’s Babylon Upgrade Transforms the Landscape of Web3 and DeFi",
    "url": "https://www.crypto-news-flash.com/radixs-babylon-upgrade-transforms-the-landscape-of-web3-and-defi/?utm_source=rss&utm_medium=rss&utm_campaign=radixs-babylon-upgrade-transforms-the-landscape-of-web3-and-defi",
    "description": "<img width=\"605\" height=\"297\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Babylon.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Radix Babylon Upgrade\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Babylon.png 605w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Babylon-300x147.png 300w\" sizes=\"(max-width: 605px) 100vw, 605px\" />Radix&#8217;s Babylon upgrade transforms Web3 and DeFi with Scrypto-based smart contracts, a user-friendly Radix Mobile Wallet, and other innovative features. CEO Piers Ridyard highlights the upgrade&#8217;s potential to create a more accessible DeFi ecosystem for developers and users. Radix Publishing, a prominent decentralized ledger platform, has recently marked a pivotal moment in the blockchain world [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T14:01:43.000Z",
    "title": "MakerDAO (MKR) and Pikamoon Renew Investors’ Hopes Despite the Lingering Market Crash Effect",
    "url": "https://www.crypto-news-flash.com/makerdao-mkr-and-pikamoon-renew-investors-hopes-despite-the-lingering-market-crash-effect/?utm_source=rss&utm_medium=rss&utm_campaign=makerdao-mkr-and-pikamoon-renew-investors-hopes-despite-the-lingering-market-crash-effect",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-169.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-169.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-169-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-169-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The effect of the last crypto market crash might still linger. Yet, certain projects have managed to sail through the bearish waters and create positive price performance to the delight of their investors. Two good examples of such projects are MakerDAO and Pikamoon (PIKA). The MKR price recent market performance has seen it soar in [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T13:56:58.000Z",
    "title": "Kresus Taps Partnership With Collectibles.com As Official Wallet Provider",
    "url": "https://www.crypto-news-flash.com/kresus-taps-partnership-with-collectibles-com-as-official-wallet-provider/?utm_source=rss&utm_medium=rss&utm_campaign=kresus-taps-partnership-with-collectibles-com-as-official-wallet-provider",
    "description": "<img width=\"1280\" height=\"850\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"hedera\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-1024x680.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Kresus Superapp has inked a partnership with Collectibles.com. This collaboration is designed to bolster interest in digital collectibles among other benefits. Popular Web3 superapp, Kresus has officially announced its strategic partnership with Collectibles.com, a premier online marketplace for collectible items. This groundbreaking collaboration positions Kresus as the official wallet provider for Collectibles.com. Seamless Integration for [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T13:54:00.000Z",
    "title": "IOTA’s ShimmerEVM Unlocks a New Era: Smart Contracts for All to Conquer Billion-Dollar Market",
    "url": "https://www.crypto-news-flash.com/iotas-shimmerevm-unlocks-a-new-era-smart-contracts-for-all-to-conquer-billion-dollar-market/?utm_source=rss&utm_medium=rss&utm_campaign=iotas-shimmerevm-unlocks-a-new-era-smart-contracts-for-all-to-conquer-billion-dollar-market",
    "description": "<img width=\"1920\" height=\"1920\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/iota-token-7741115_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/iota-token-7741115_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/iota-token-7741115_1920-300x300.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/iota-token-7741115_1920-1024x1024.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/iota-token-7741115_1920-150x150.jpg 150w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />ShimmerEVM, a groundbreaking update in IOTA, opens the doors for Ethereum applications to seamlessly interact with the IOTA network. Through its unique architecture, ShimmerEVM not only facilitates smooth transactions but also lays the foundation for robust protection against spam attacks with its native token, SMR. The blockchain world witnesses a groundbreaking update as IOTA unveils [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T13:51:46.000Z",
    "title": "Litecoin’s Battle: Bulls vs. Bears in a Sideways Struggle",
    "url": "https://www.crypto-news-flash.com/litecoins-battle-bulls-vs-bears-in-a-sideways-struggle/?utm_source=rss&utm_medium=rss&utm_campaign=litecoins-battle-bulls-vs-bears-in-a-sideways-struggle",
    "description": "<img width=\"1000\" height=\"560\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/VIsual-Generation-Litecoin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Litecoin LTC\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/VIsual-Generation-Litecoin.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/VIsual-Generation-Litecoin-300x168.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/VIsual-Generation-Litecoin-768x430.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Litecoin (LTC) has remained stable around $64 amidst a bearish trend in September, closely mirroring Bitcoin&#8217;s price fluctuations. Litecoin&#8217;s future prospects, including halving events and its strong fundamentals, make it an attractive investment option, with a key level to watch at $69 for potential bullish momentum. Litecoin (LTC) has remained confined to a narrow price [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T13:43:40.000Z",
    "title": "Chainlink Ushers in New Era by Connecting Polygon, Ethereum, Arbitrum, and Avax Through CCIP in Trillion-Dollar Market, Revolutionizing the Future",
    "url": "https://www.crypto-news-flash.com/chainlink-ushers-in-new-era-by-connecting-polygon-ethereum-arbitrum-and-avax-through-ccip-in-trillion-dollar-market-revolutionizing-the-future/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-ushers-in-new-era-by-connecting-polygon-ethereum-arbitrum-and-avax-through-ccip-in-trillion-dollar-market-revolutionizing-the-future",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/chainlink-qe.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink celebrates the first anniversary of Chainlink Economics 2.0.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/chainlink-qe.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/chainlink-qe-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/chainlink-qe-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Web3&#8217;s success depends on seamless cross-blockchain token transfers, enhancing digital asset versatility. Two methods enable cross-chain transfers, each with unique pros and cons. The realm of Web3, poised to reshape the digital landscape, hinges upon a crucial feature that often flies under the radar: cross-chain token transfers. As blockchain technology continues to merge with conventional [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-28T14:08:39.000Z",
    "title": "Crypto Prices Today: 4 Altcoins to Watch for Great Trades",
    "url": "https://coinedition.com/crypto-prices-today-4-altcoins-to-watch-for-great-trades/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Prices-Today-4-Altcoins-to-Watch-for-Great-Trades-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Several cryptocurrencies were able to achieve 24-hour gains throughout the past trading day. As a result, the market recorded a 0.67% increase in its collective market capitalization, according to CoinMarketCap data. This slight rebound may lead investors and traders to search for promising trade opportunities in the market this coming week. Potential trade opportunities that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-prices-today-4-altcoins-to-watch-for-great-trades/\">Crypto Prices Today: 4 Altcoins to Watch for Great Trades</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-28T13:43:00.000Z",
    "title": "Binance EUR Deposit Partner Bank Dumps Binance, Critic Reacts",
    "url": "https://coinedition.com/binance-eur-deposit-partner-bank-dumps-binance-critic-reacts/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/BANK-7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/BANK-7.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/BANK-7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/BANK-7-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/BANK-7-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/BANK-7-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/BANK-7-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/BANK-7-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/09/BANK-7-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/BANK-7-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/BANK-7-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/BANK-7-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/BANK-7-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/BANK-7-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/BANK-7-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/BANK-7-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/09/BANK-7-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent announcement, Binance reported that Paysafe Payment Solutions Limited (Paysafe) has unilaterally ceased processing EUR deposits for its users. The unexpected decision has prompted Binance to issue a series of advisories, urging Paysafe users to take specific actions ahead of time. To mitigate potential disruptions, Binance advised Paysafe users to consider converting their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-eur-deposit-partner-bank-dumps-binance-critic-reacts/\">Binance EUR Deposit Partner Bank Dumps Binance, Critic Reacts</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]