[
  {
    "source": "CryptoSlate",
    "date": "2024-04-06T00:51:22.000Z",
    "title": "Tornado Cash developer gets help in court from blockchain advocacy groups",
    "url": "https://cryptoslate.com/tornado-cash-developer-gets-help-in-court-from-blockchain-advocacy-groups/",
    "description": "<p>Three blockchain advocacy groups have filed amicus curiae briefs on April 5 to defend Tornado Cash developer Roman Storm from criminal charges in the US. The filings support Storm&#8217;s motion to dismiss the charges against him and present several arguments to ensure developers are protected from such legal action. The Blockchain Association said the government&#8217;s [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/tornado-cash-developer-gets-help-in-court-from-blockchain-advocacy-groups/\">Tornado Cash developer gets help in court from blockchain advocacy groups</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-04-06T01:01:00.000Z",
    "title": "Uniswap Hits $2 Trillion Trading Volume Milestone as $UNI Price Struggles",
    "url": "https://www.cryptoglobe.com/latest/2024/04/uniswap-hits-2-trillion-trading-volume-milestone-as-uni-price-struggles/",
    "description": "Leading decentralized cryptocurrency exchange Uniswap, has crossed a significant threshold, surpassing $2 trillion in total trading volume five and a half years after it was first launched back in November 2018 The milestone, first reported by Cointelegraph, according to data tracked by a Dune Analytics dashboard compiled by Uniswap’s own Zach Wong, came after trading […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-04-06T00:43:00.000Z",
    "title": "Goldman Sachs Chief Economist: No Rate Cuts This Year Would Be ‘Very Surprising’",
    "url": "https://www.cryptoglobe.com/latest/2024/04/goldman-sachs-chief-economist-no-rate-cuts-this-year-would-be-very-surprising/",
    "description": "Goldman Sachs Chief Economist Jan Hatzius has revealed he remains confident in the Federal Reserve’s plan to implement three interest rate cuts this year, despite recent comments from other Fed officials suggesting a wait-and-see approach. In a Friday interview with CNBC, Hatzius expressed his optimism on the U.S. economy, forecasting growth to reach close to […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-06T00:58:24.000Z",
    "title": "SushiSwap’s Bold Move: A New Concept in Sushi Labs ",
    "url": "https://www.cryptopolitan.com/sushiswaps-bold-move-concept-in-sushi-labs/",
    "description": "A substantial modification within the decentralized finance (DeFi) system is when SushiSwap, an influential decentralized exchange (DEX), proposed a governance one to-be-done that might reshape its auspices and operations. The plan, which is authored by Jiro &#8211; a SushiSwap developer, offers a fairly fundamental change in the allocation of the treasury assets, i.e. the transfer [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-06T00:44:38.000Z",
    "title": "Paraguay considers kicking crypto miners to the curb",
    "url": "https://www.cryptopolitan.com/paraguay-kicking-crypto-miners-to-the-curb/",
    "description": "Paraguay is laying down the law against crypto miners who’ve been having a field day tapping into its electrical grid like it&#8217;s an all-you-can-eat buffet. Lawmakers in Paraguay are done watching from the sidelines and have proposed a bill that&#8217;s basically a giant stop sign aimed at crypto mining and everything that comes with it. [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-06T01:00:19.000Z",
    "title": "Dogecoin Whale Takes $52.3 Million In DOGE Off Binance, Sign Of Buying?",
    "url": "https://www.newsbtc.com/dogecoin-2/dogecoin-whale-35-2-doge-binance-buying/",
    "description": "On-chain data shows a Dogecoin whale made a large withdrawal from Binance today, which may be bullish for the memecoin&#8217;s price. A Large Amount Of Dogecoin Has Left The Binance Platform In The Past Day According to data from the cryptocurrency transaction tracker service Whale Alert, a large transfer has been spotted on the Dogecoin blockchain during the past day. In this move, the network has processed the movement of 304,588,737 DOGE, worth around $52.3 million when the transaction was executed. Given the large scale of the transfer, it&#8217;s likely that a whale entity was involved. The whales are influential on the network due to the sheer number of tokens they carry in their wallets. As such, their moves can be worth keeping an eye on since they may cause noticeable fluctuations in the market. Related Reading: This Bitcoin Indicator May Have Signaled Latest Market Downturn In Advance How the market would be affected by the moves from these humongous entities depends on what they intend to do with those moves. Naturally, it&#8217;s impossible to say what an investor plans to do confidently. The type of addresses involved in the transaction, however, can sometimes at least provide a hint about what the whale may have wanted to achieve with the move. Below are the details of the latest Dogecoin whale transaction, which reveals its relevant addresses. Looks like this massive move only required a negligible fee of $0.03 to be possible on the Dogecoin blockchain &#124; Source: Whale Alert As is visible, this Dogecoin transaction was executed from a wallet connected to the cryptocurrency exchange Binance. The destination of the move appears to have been a couple of unknown addresses. An unknown address refers to a wallet not affiliated with any centralized entity like an exchange (the sender in this transfer is a &#8220;known&#8221; wallet as it&#8217;s attached to a central entity in Binance). Generally, such addresses are the investors&#8217; personal, self-custodial wallets. Transfers where coins move in the direction of exchanges to self-custodial entities are known as &#8220;exchange outflows.&#8221; Usually, investors make such moves when they plan to hold onto their coins long-term, as it&#8217;s safer to do so outside of these platforms, where the platforms control the wallets. Exchange outflows can also sometimes be an indication that fresh buying is going on, as some investors like to immediately withdraw their purchases of these platforms. Related Reading: Bitcoin Short-Term Holders Capitulate: $5.2 Billion Sold At Loss Given the relatively massive scale of the Dogecoin exchange outflow in the current case, it can naturally be bullish news for investors if the whale is indeed accumulating here. However, the scenario also exists where the whale has withdrawn to sell through the peer-to-peer (P2P) mode. In this case, the effect on the asset could be bearish instead. DOGE Price At the time of writing, Dogecoin is floating around $0.176, down 16% over the past week. The price of the asset seems to have been going down recently &#124; Source: Whale Alert Featured image from Mike Doherty on Unsplash.com, chart from TradingView.com"
  }
]