[
  {
    "source": "Cointelegraph",
    "date": "2023-07-06T01:49:27.000Z",
    "title": "Bitcoin miners raked up $184M in fees in Q2, surpassing all of 2022",
    "url": "https://cointelegraph.com/news/bitcoin-miners-raked-millions-in-fees-q2-amid-ordinals",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/0a8fe91d-141c-4a24-8672-d8e9d0e2be27.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>It's been one of the most lucrative quarters for those that profit from Bitcoin transaction fees in nearly two years.</p>\n                    <p><p>Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> miners made a lofty $184 million from transaction fees in the second quarter, far more than what they <a href=\"https://cointelegraph.com/news/bitcoin-mining-firms-keep-building-despite-profitability-slump\">pocketed over the entire 2022</a> — as Bitcoin’s price surged and BRC-20 tokens flourished.</p><p>The $184 million payout is more than a 270% increase from the first quarter of 2023 and it is the first quarter to have surpassed the $100 million mark since Q2 2021, <a href=\"https://coinmetrics.substack.com/p/state-of-the-network-issue-214?publication_id=6269&amp;post_id=132208708&amp;isFreemail=true&amp;utm_content=255684945&amp;utm_medium=social&amp;utm_source=twitter&amp;hss_channel=tw-867328053416001536\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to a July 5 report from cryptocurrency analytics platform Coin Metrics.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/071ae036-d991-4a3e-9d15-eea77377c3e9.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin miners earned more from fees in Q2 than the previous five quarters combined. Source: Coin Metrics</em></figcaption></figure><p>Bitcoin miners receive transaction fees whenevea new block has been validated, the amount of which is determined by the data volume and the user demand for block space.</p><p>Coin Metrics said the jump in fees was due to Bitcoin’s recent price surge bolstered ‘top-line revenues” and the advent of BRC-20, a <a href=\"https://cointelegraph.com/news/wallet-providers-introduce-brc-20-token-support-despite-market-drawdown\">new token standard on Bitcoin</a> introduced in March which uses Ordinals inscriptions to mint and transfer fungible tokens on the network, adding: </p><blockquote>“The token standard does unlock experimental new use cases for Bitcoin’s core transaction types, and accelerates the push to scale Bitcoin with the Lightning Network. </blockquote><p>However, it is worth noting that transaction fees represented only 7.7% of the total $2.4 billion made by miners over the quarter.</p><p>The remainder came in the form of Bitcoin block rewards, with miners currently being rewarded 6.25 BTC for solving each block. This is set to fall to 3.125 BTC after the <a href=\"https://cointelegraph.com/learn/bitcoin-halving-how-does-the-halving-cycle-work-and-why-does-it-matter\">network’s next halving cycle,</a> expected to take place in May. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-miners-send-record-inflows-to-exchanges\"><strong><em>Bitcoin miners send record $128M in revenue to exchanges </em></strong></a></p><p>Bitcoin miners also had other reasons to celebrate in the second quarter, according to the firm.</p><p>In May, the Bitcoin mining industry “notched a win” with the Biden Administration’s proposed Digital Asset Mining Energy (DAME) <a href=\"https://cointelegraph.com/news/deal-to-avoid-us-debt-default-nixes-proposed-30-crypto-mining-tax-says-ohio-lawmaker\">tax being blocked</a>.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In this special edition of State of the Network, we take a data-driven look at the most important events that impacted the digital assets industry from Q2 2023.<br><br>Get the insights here: <a href=\"https://t.co/xpcE27j1Fz\">https://t.co/xpcE27j1Fz</a><a href=\"https://twitter.com/hashtag/FutureofFinance?src=hash&amp;ref_src=twsrc%5Etfw\">#FutureofFinance</a> <a href=\"https://twitter.com/hashtag/PutTruthtoWork?src=hash&amp;ref_src=twsrc%5Etfw\">#PutTruthtoWork</a> <a href=\"https://t.co/67RDHKA2bT\">pic.twitter.com/67RDHKA2bT</a></p>&mdash; CoinMetrics.io (@coinmetrics) <a href=\"https://twitter.com/coinmetrics/status/1676609465078906883?ref_src=twsrc%5Etfw\">July 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Bitcoin miners also enjoyed easier macroeconomics conditions in the quarter too, with “receding inflation pressures” translating to <a href=\"https://cointelegraph.com/explained/bitcoin-miners-as-energy-buyers-explained\">lower electricity prices</a> for United States-based miners, Coin Metrics noted. </p><p>However, with <a href=\"https://cointelegraph.com/explained/what-is-bitcoin-hash-rate-and-why-does-it-matter\">Bitcoin’s hashrate</a> continuing to reach new all-time highs over the last 12 months, competition in the mining fee market is also tightening, Coin Metrics explained:</p><blockquote>“Competition remains as fierce as ever, with Bitcoin’s hashrate breaking new highs during the quarter at 375 EH/s [...] We see that the overall network’s efficiency continues to increase with the adoption of modern ASICs such as the S19 XP.”</blockquote><p><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/bitcoin-miami-2023-shitcoins-for-bitcoin/\"><strong><em>Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-06T02:00:21.000Z",
    "title": "Coca Cola Serbia partners with Solana-based NFT marketplace SolSea",
    "url": "https://cryptoslate.com/coca-cola-serbia-partners-with-solana-based-nft-marketplace-solsea/",
    "description": "<p>Solana-based NFT platform SolSea said that has partnered with Coca-Cola&#8217;s Serbian division, Coca-Cola Srbija, on July 5. SolSea said that the partnership will involve the offer of merchandise as well as Coca-Cola Serbia-branded non-fungible tokens (NFTs). The two companies are offering the NFTs and merch in partnership with EXIT Festival, a summer music festival that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coca-cola-serbia-partners-with-solana-based-nft-marketplace-solsea/\">Coca Cola Serbia partners with Solana-based NFT marketplace SolSea</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-06T02:00:00.000Z",
    "title": "Crypto Investor Sold His House for $HEX At the Height of the Bull Market to Bet on Token That Lost 99% of Its Value",
    "url": "https://www.cryptoglobe.com/latest/2023/07/crypto-investor-sold-his-house-for-hex-at-the-height-of-the-bull-market-to-bet-on-token-that-lost-99-of-its-value/",
    "description": "A cryptocurrency investor has seemingly made an audacious gamble at the height of the 2021 cryptocurrency market bull run, selling his house and pouring the proceeds into the cryptocurrency $HEX, according to an unreleased documentary. In the trailer of “The Highest Stakes,” a documentary that piqued the curiosity of cryptocurrency enthusiasts, there’s a tantalizing preview […]\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-06T02:04:43.000Z",
    "title": "Behind the curtains of blame and stigma: Blockchain and HIV | Opinion",
    "url": "https://crypto.news/behind-the-curtains-of-blame-and-stigma-blockchain-and-hiv-opinion/",
    "description": "Imagine living your life where every second person you meet would discriminate against you and stigmatize you. Just for a few seconds, put yourself in those shoes and think again: every second person you meet. Horrible, right? I wish it&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-06T02:00:50.000Z",
    "title": "Shibarium Reaches New Milestones As Anticipation Builds For Mainnet Launch",
    "url": "https://www.newsbtc.com/shiba-inu/shibarium-reaches-new-milestones-as-anticipation-builds/",
    "description": "The Shiba Inu community continues to mark new milestones with its testnet, Shibarium, as a steady surge of users links their crypto wallets to the network. Shibarium&#8217;s testnet, also known as Puppynet, launched on March 11 and has seen an increase in overall transaction count over the past 24 hours. Shibarium added almost a million transactions in a single day, catapulting past the 27 million mark and setting a new record. On June 13, a peak of 324,000 transactions was recorded, after which it slightly decreased over the following days. However, since June 19, the daily transactions have hovered around the 274,000 mark. Related Reading: Shiba Inu Records Surge In Daily New Addresses In Q2: A Sign Of Growing Interest? Consistent Growth In Wallet Links And Blocks Alongside transaction growth, the number of wallets linked to Shibarium continues to rise, albeit slower, according to Puppyscan data. The current count of linked wallets is over 17 million, with no substantial spikes recorded recently. The total blocks have increased to surpass 1.56 million, and the time required to create a new block has been reduced to 8.3 seconds. Notably, the community anticipates the official launch of Shibarium&#8217;s mainnet, with excitement fueled by a statement from the lead developer of Shiba Inu and Shibarium, the elusive Shytoshi Kusama. The developer informed the SHIB army about the planned &#8220;launch strategy&#8221; for Shibarium, noting that the date and time have been confirmed. The community speculates that the Shibarium mainnet could be launched between August 13 and 16 in Toronto, Canada, during the annual ETHToronto event. This event celebrates the creation of Ethereum, and given SHIB&#8217;s original launch on this blockchain, the community believes it would serve as a fitting tribute to Ethereum and its founder, Vitalik Buterin. Awaiting The Launch Of Shibarium Mainnet Kusama recently dropped a hint in a Telegram channel solely for Shibarium discussions, possibly confirming the theory regarding the mainnet&#8217;s launch date and location. Before this, he disclosed that Shiba Inu was &#8220;going somewhere&#8221; and clarified that this location would be outside the United States. Related Reading: Shiba Inu Lead Dev Teases Shibarium Launch, How High Can SHIB Rise? Regardless, Shiba Inu (SHIB) has been in a downward trend over the past 24 hours. The dog-themed meme coin has declined by nearly 4% and is currently trading for $0.00000745 at the time of writing. However, over the past week, SHIB&#8217;s market capitalization has surged by $200 million. The asset&#8217;s trading volume has also recorded a slight surge in the past week from $100 million seen last Wednesday to $117 million in the past 24 hours. Featured image from Shutterstock, Chart from TradingView"
  }
]