[
  {
    "source": "Decrypt",
    "date": "2024-01-18T00:05:17.000Z",
    "title": "'Nifty Island' NFT Game Launches Open Beta With Airdrop Rewards",
    "url": "https://decrypt.co/213275/nifty-island-nft-game-launches-open-beta-airdrop-rewards",
    "description": "Nifty Island, the create-an-island game with NFTs, is offering future token perks to active players who mint NFTs and create experiences."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-17T23:52:14.000Z",
    "title": "Coinbase Case Judge Asks If SEC Is ‘Sweeping Too Broadly’ as She Weighs Dismissal",
    "url": "https://decrypt.co/213288/coinbase-case-judge-asks-if-sec-is-sweeping-too-broadly-as-she-weighs-dismissal",
    "description": "U.S. District Judge Katherine Polk Failla will decide whether to dismiss the SEC’s lawsuit against the crypto exchange for alleged securities violations. "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-17T23:46:11.000Z",
    "title": "IRS says controversial $10k reporting rule doesn’t currently apply to crypto",
    "url": "https://cryptoslate.com/irs-says-controversial-10k-reporting-rule-doesnt-currently-apply-to-crypto/",
    "description": "<p>Two U.S. agencies announced on Jan. 16 that controversial transaction reporting rules do not apply to digital assets (ie. cryptocurrency). The Internal Revenue Service (IRS) and Department of the Treasury said: &#8220;Businesses &#8230; do not have to report the receipt of digital assets the same way as they must report the receipt of cash until [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/irs-says-controversial-10k-reporting-rule-doesnt-currently-apply-to-crypto/\">IRS says controversial $10k reporting rule doesn&#8217;t currently apply to crypto</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NullTX",
    "date": "2024-01-18T00:06:11.000Z",
    "title": "Socket Faces Security Breach Resulting In ~$3.3M Loss",
    "url": "https://nulltx.com/socket-faces-security-breach-resulting-in-3-3m-loss/",
    "description": "Socket, a protocol in the decentralized finance (DeFi) space, recently encountered a security incident that led to a loss of approximately $3.3 million.  The vulnerability stemmed from a call injection attack on the Socket protocol, specifically impacting wallets with infinite approvals to Socket contracts. As a response, all affected contracts [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-18T00:00:56.000Z",
    "title": "Bitcoin Gives Early Top Warning Signal, But Price Could Double First",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-early-top-warning-signal-price-double/",
    "description": "Bitcoin price reached highs of close to $50,000 a coin this year until an abrupt, 15% selloff stopped the climb and put the overheated crypto market on ice. The pullback has caused an early &#8220;top&#8221; warning signal to fire in BTCUSD, but data suggests that the top cryptocurrency could double before the actual top is in. Fishing For A Top Signal With the Fisher Transform Spot BTC ETF hype helped drive the price of Bitcoin from lows around $15,000 to over $45,000 per coin – a 300% increase. Peak post-ETF approval price action reached as high as $49,000 before a sharp rejection send BTC plummeting back to $42,000 where it trades currently. Related Reading: Bitcoin ETF Makes Waves: Volumes Surge $10 Billion 3 Days The 15% correction after a significant climb isn&#8217;t too out of the ordinary, however, the 1W Fisher Transform indicator might have just given an early &#8220;top&#8221; signal. The tool, which smooths out price action to better visualize price extremes, reached a +6 standard deviation. This is among the most extreme readings the tool has even given on the timeframe. More importantly, however, is how the technical indicator has behaved over the last several years. Specifically, the Fisher Transform on the weekly timeframe has accurately called the 2019 top, and the 2021 top several weeks in advance after reaching a +6 standard deviation. Is BTC poised to double soon? &#124; BTCUSD on TradingView.com Why This Warning Signal Could Mean A New ATH, 100% Rally This signal was an early top warning, not the actual top, to be precise. In 2019, after the Fisher Transform crossed bearish, BTCUSD rallied another 83% before the actual peak occurred. In 2021, there was another 122% more ROI to go before the peak was in. Related Reading: Grayscale Bitcoin ETF Bleeds: Traders Make $579 Million Run On The Fund This could mean that although Bitcoin price could be looking at a peak soon enough, another 100% could be added to the cost per coin. At $42,000 per coin, that could take BTC above $84,000 and to new all-time highs. It is worth noting that 2021 exceeded the ROI of 2019, which could hint at increasing returns as more participants become aware of Bitcoin. With institutions now getting involved, spot ETFs actively trading, and more, anything is possible. This chart was originally featured in issue #32 of CoinChartist VIP: This Time It&#8217;s Different. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  }
]