[
  {
    "source": "CoinDesk",
    "date": "2023-09-21T21:01:05.000Z",
    "title": "Bitcoin Slides to $26.5K Amid Surging U.S. Dollar; Record-High Rates Are ‘Nightmare’ for Crypto Firms",
    "url": "https://www.coindesk.com/markets/2023/09/21/bitcoin-slides-to-265k-amid-surging-us-dollar-record-high-rates-are-nightmare-for-crypto-firms/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BTC slid to $26,500 as interest rates and the U.S. dollar surged while equities declined."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-21T20:46:18.000Z",
    "title": "YouTube Adds AI Features to Enhance and Simplify Video Creation",
    "url": "https://decrypt.co/198226/youtube-adds-ai-features-enhance-simplify-video-creation",
    "description": "Google has unveiled new AI-powered features to bolster video creation on YouTube for both Shorts and long-form clips."
  },
  {
    "source": "NullTX",
    "date": "2023-09-21T20:48:50.000Z",
    "title": "Smart Crypto Whale’s Massive $40 Million ETH Withdrawals From Binance: What Does It Mean?",
    "url": "https://nulltx.com/smart-crypto-whales-massive-40-million-eth-withdrawals-from-binance-what-does-it-mean/",
    "description": "Recently, a smart whale made waves in the crypto community by withdrawing a staggering 24,548 Ethereum (ETH) tokens from the popular exchange, Binance. These withdrawals, totaling $40 million in value at the time of the transactions, have left many wondering about the implications of such substantial movements in the market. Whale Withdraws 5,050 ETH The [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-21T20:54:13.000Z",
    "title": "Binance executive flags potential EU stablecoin removal amid MiCA uncertainty",
    "url": "https://crypto.news/binance-executive-flags-potential-eu-stablecoin-removal-amid-mica-uncertainty/",
    "description": "Ahead of the forthcoming enforcement of the European Union&#8217;s Markets in Crypto Assets (MiCA) legislation, a top Binance representative is sounding the alarm about potential large-scale removals of stablecoins from the exchange. As legal experts wrestle with interpreting the EU&#8217;s&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-21T20:48:56.000Z",
    "title": "Sam Bankman-Fried key witnesses blocked from testifying in upcoming trial",
    "url": "https://crypto.news/sam-bankman-fried-key-witnesses-blocked-from-testifying-in-upcoming-trial/",
    "description": "Several key witnesses, including a British barrister and a University of Michigan professor, have been barred from testifying in the upcoming trial of former FTX CEO Sam Bankman-Fried, as ordered by District Judge Lewis Kaplan. The trial, which is scheduled&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-21T21:00:29.000Z",
    "title": "“Paper BTC” Is Counteracting A Bullish Bitcoin Supply Shock, Analyst Explains",
    "url": "https://www.newsbtc.com/bitcoin-news/paper-btc-bullish-bitcoin-supply-shock-analyst/",
    "description": "An analyst has explained how the growth in &#8220;paper BTC&#8221; could be counteracting a bullish Bitcoin supply shock from taking effect. Liquid Bitcoin Supply Has Dropped, But Paper BTC Is Still At Significant Levels In a new post on X, analyst Willy Woo shared insight into how the paper BTC compares against the real BTC being traded. According to the analyst, &#8220;paper BTC&#8221; refers to the combined futures open interest value. Here is a chart that shows the trend in the ratio between the two types of Bitcoin over the past couple of years: The data for the paper vs real BTC ratio since January 2021 &#124; Source: @woonomic on X The graph shows that the ratio&#8217;s value has fluctuated between 0.2 and 0.3 in recent months, suggesting that the paper Bitcoin has been 20 to 30% more than the real coins during this period. The real supply of the cryptocurrency may be divided into three categories: illiquid, liquid, and highly liquid. The on-chain analytics firm Glassnode puts coins into these divisions based on the behavior of the investors holding them. Related Reading: Is Bitcoin Bull Run Coming Soon? What Network Fundamentals Say To be more precise, the ratio between the cumulative outflows and inflows of the investor since they entered the market is used to define their liquidity. This ratio&#8217;s value approaches zero for the illiquid supply, as holders of this cohort rarely move coins out of their addresses. Similarly, the value becomes close to 1 for the highly liquid supply, as investors of this class tend to shift their coins quickly. In the above ratio, Woo has only used this highly liquid supply as a measure of the &#8220;real BTC.&#8221; As the chart below shows, this highly liquid Bitcoin supply has been going down recently. Looks like the value of the metric has been going down in recent years &#124; Source: @woonomic on X The analyst notes that the less the number of coins in this supply, the more bullish is the outlook for Bitcoin since there are a lesser amount of coins available to be bought. Another analyst, James V. Straten, replied to Woo&#8217;s post with a chart that combines the liquid supply into the ratio, which, while less fluid than the highly liquid supply, still constitutes a notable part of the BTC traded supply. The paper vs real BTC ratio with liquid supply accounted for &#124; @jimmyvs24 on X According to Straten, the liquid and highly liquid supplies have observed a combined drawdown of 500,000 BTC (around $13.3 billion at the current exchange rate) since May 2023. Related Reading: Bitcoin May Not See Lasting Bullish Momentum Until This Happens However, as the paper BTC is still significantly more than the real BTC, any &#8220;supply shock&#8221; effects being created out of the real supply becoming less liquid are being more than made up for by the increase in the paper supply. BTC Price Bitcoin has registered a sharp decline in the past day, as the coin has lost the $27,000 level and is currently floating around the $26,500 mark. BTC has dropped during the last 24 hours &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-21T21:02:00.000Z",
    "title": "Crypto Firms Seek Overseas Growth Amid Regulatory Pressure in the US",
    "url": "https://coinedition.com/crypto-firms-seek-overseas-growth-amid-regulatory-pressure-in-the-us/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Regulation6-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto firms are looking for growth opportunities outside America, according to the Wall Street Journal. The reasons for the departure are reportedly due to U.S. Securities and Exchange Commission (SEC) cases against crypto firms. Managers of crypto companies were reportedly being forced to “cook up growth plans” outside the U.S. The report highlighted one legal [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-firms-seek-overseas-growth-amid-regulatory-pressure-in-the-us/\">Crypto Firms Seek Overseas Growth Amid Regulatory Pressure in the US</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]