[
  {
    "source": "Decrypt",
    "date": "2023-08-21T16:57:32.000Z",
    "title": "Kenyan Government Launches Committee to Examine Worldcoin",
    "url": "https://decrypt.co/153186/kenyan-government-launches-committee-examine-worldcoin",
    "description": "The move comes just three weeks after the African nation's authorities suspended Worldcoin’s activities in the country."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-21T16:51:00.000Z",
    "title": "Michael Wagner's 'Controversial Take' on Crypto in Games",
    "url": "https://decrypt.co/videos/interviews/tc2nKeqA/michael-wagners-controversial-take-on-crypto-in-games",
    "description": "At Solana's PlayGG, Star Atlas CEO Michael Wagner shares his \"controversial take\" on crypto in games, shares the challenges of developing the upcoming scifi game, and how crypto's volatility has changed his perspective with Decrypt's Jason Nelson."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-21T17:00:55.000Z",
    "title": "Trending Social App Friend.Tech Tops Uniswap in Fees Earned But Leaks Private Data of 100k Users.",
    "url": "https://cryptobriefing.com/social-friendtech-uniswap-fees-leaks-private-data/?utm_source=feed&utm_medium=rss",
    "description": "Friend.tech surpassed Uniswap and Bitcoin in fees generated but then leaked wallet addresses and Twitter usernames of over 100,000 users."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-21T17:00:00.000Z",
    "title": "\n                        Helio Lending Sentenced for False Credit License Claims\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/helio-lending-sentenced-for-false-credit-license-claims",
    "description": "\n                        <p class=\"MsoNormal\" style=\"line-height: 150%;\">Australian- based crypto lender Helio has been sentenced for falsely claiming it held a local credit license.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Melbourne-based cryptocurrency lender Helio Lending received a sentence for a non-conviction good behaviour bond for a year after it falsely claimed to have a local credit license.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The Australian Securities and Investment Commission (ASIC) said Helio Lending had been sentenced for stating that it held a local credit license. Helio was sentenced to a non-conviction bond of AU$ 15,000 ($9,600) based on the condition it displays good behaviour for a year.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">In a media statement, the ASIC said: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;Melbourne-based cryptocurrency lender Helio Lending Pty Ltd (Helio) has been sentenced to a non-conviction bond for falsely claiming that it held an Australian credit licence (ACL) when it did not.</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Helio entered into a recognisance in the sum of $15,000 for a period of 12-months on the condition they are of good behaviour.&rdquo;</p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The ASIC states the lender made false representations in a news article on its website in August 2019, claiming it held a local credit license. According to the Commission, &ldquo;Helio was neither an ACL holder nor a representative of an ACL holder at the time the statement appeared.&rdquo;&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The ASIC explained that falsely claiming to have an ACL breaches section 30 of the National Consumer Protection Act 2009. The crypto lender was sentenced under section 19B(1)(d) of the Crimes Act 1914.&nbsp;</p>\nASIC Will Not Tolerate &ldquo;Misleading&rdquo; Statements\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">At the time of the false claim, Helio offered crypto-backed loans to consumers using crypto as security over the loan. The lender pleaded guilty to the charge of making false statements. A further charge relating to alleged content on Helio&rsquo;s website was withdrawn.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">ASIC Deputy Chair Sarah Court commented on Helio&rsquo;s conduct and sentence, saying: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;We expect entities and individuals to provide accurate information to their customers and potential customers. Helio falsely claimed that it held an Australian Credit licence, misleading their customers to believe that they had the protections afforded by such a licence.&rdquo; </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&nbsp;The sentence of a non-conviction good behaviour bond means that the lender will only face conviction if it breaks its bond.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-21T17:00:40.000Z",
    "title": "Gemini Hits Back At SEC Lawsuit With Dismissal Filing",
    "url": "https://www.newsbtc.com/crypto/gemini-sec-lawsuit-dismissal-filing/",
    "description": "Gemini, an American cryptocurrency exchange, has taken a stand against the United States Securities and Exchange Commission (SEC), deeming the lawsuit brought forth by the regulator as “absurd.” Gemini Pushes Back Against SEC Lawsuit In the ongoing legal battle between Gemini Exchange and the US SEC, co-founders Cameron Winklevoss and Tyler Winklevoss have contested the validity of the SEC’s case by submitting a comprehensive brief to oppose the SEC’s claims on the Gemini Earn program.  Related Reading: Experts Explain Why SEC’s Interlocutory Appeal In Ripple Case Was A Mistake In the filing, Gemini stated that the SEC had failed to establish a clear definition of what the regulatory body regards as securities. The exchange also highlighted the absence of well-defined requirements for violating regulatory laws. As a result, the lack of specification in the SEC’s argument hampers the exchange&#8217;s ability to respond properly to the allegations put forward.  In the Judicial presentation, the exchange urged the court to ignore the “convoluted analysis” provided by the SEC. The exchange has instead advocated for direct questions which would determine if the cryptocurrency in question qualifies as a security.  Gemini has also stated that the SEC should provide an identification of the unregistered security and information on the specific sale, highlighting that treating all cryptocurrencies as unregistered security is prejudiced.  The company&#8217;s lawyer, Jack Baughman also publicly refuted the SEC’s claims in a Twitter post, saying: The SEC is floundering. They can’t even decide what the security is. On the one hand, they claim that the Loan Agreement was a security. On the other hand, they claim that the entire Gemini Earn program was itself a security — an argument absurd on its face. GUSD market cap at $361 million &#124; Source: GUSD Market Capitalization on Tradingview.com Background On The SEC Lawsuit Earlier this year, on January 13, the US SEC filed a lawsuit against Gemini and Genesis, a crypto lender affiliated with Gemini Trust Company. According to the SEC, Genesis loaned the exchange&#8217;s users unregistered securities through the Gemini Earn program, allowing the exchange and Genesis to accumulate billions of dollars worth of crypto assets from thousands of investors.  Related Reading: Ethereum Whale Avoids Market Crash, Do They Know Something You Don’t? At the beginning of February 2021, Genesis and Gemini initiated a partnership that would offer the Gemini Earn program to retail investors allowing them to loan their crypto assets to Genesis, while the exchange acts as a middleman. Genesis would then invest the crypto assets, and pay users in interest.   The SEC alleged that the company, alongside Genesis, violated federal laws via the Gemini Earn program by not registering its offerings and sales with the Commission. The lawsuit was received with an unfavorable response from the exchange&#8217;s legal team, which resulted in the dismissal motion submitted on August 18.  Featured image from Unsplash, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T17:08:51.000Z",
    "title": "Terra Luna CEO Launches GrowthDAO: Fueling Ecosystem Expansion and Collaboration",
    "url": "https://www.crypto-news-flash.com/terra-luna-ceo-launches-growthdao-fueling-ecosystem-expansion-and-collaboration/?utm_source=rss&utm_medium=rss&utm_campaign=terra-luna-ceo-launches-growthdao-fueling-ecosystem-expansion-and-collaboration",
    "description": "<img width=\"1280\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Terra.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Terra Luna\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Terra.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Terra-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Terra-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Terra-768x432.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Chris Amani initiates community collaboration through funding DAOs. Terra Luna Classic&#8217;s USTC proposal was approved, boosting LUNC and USTC prices. In a significant development, GrowthDAO will receive funding on the Enterprise platform. Spearheaded by Chris Amani, the CEO of Terra Luna, this initiative aims to create a dynamic team comprising analysts and growth managers. The [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T17:00:20.000Z",
    "title": "Top Alt Coins to Watch in Q3: Ethereum (ETH) , Solana (SOL), and Pikamoon (PIKA)",
    "url": "https://www.crypto-news-flash.com/top-alt-coins-to-watch-in-q3-ethereum-eth-solana-sol-and-pikamoon-pika/?utm_source=rss&utm_medium=rss&utm_campaign=top-alt-coins-to-watch-in-q3-ethereum-eth-solana-sol-and-pikamoon-pika",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-62.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-62.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-62-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-62-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />It’s the second month of the third quarter, and investors who have yet to make a serious profit are desperate for a major win. These investors are on the hunt for coins that will drive a quick profit and help recover their losses. In this article, we’ll discuss the important features, investment potentials, and why [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-21T16:45:22.000Z",
    "title": "Bitcoin Struggles at $25,000: Altcoins HBAR, OP, INJ, and RUNE Flash Bull Signals",
    "url": "https://www.crypto-news-flash.com/bitcoin-struggles-at-25000-altcoins-hbar-op-inj-and-rune-flash-bull-signals/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-struggles-at-25000-altcoins-hbar-op-inj-and-rune-flash-bull-signals",
    "description": "<img width=\"800\" height=\"450\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/20221026-crypto_bitcoin-pixabay.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Stablecoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/20221026-crypto_bitcoin-pixabay.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/20221026-crypto_bitcoin-pixabay-300x169.jpg 300w\" sizes=\"(max-width: 800px) 100vw, 800px\" />Bitcoin sentiment turns bearish after an 11 percent weekly decline to around $26,060. While $25,000 offers some stability, analysts consider the possibility of a drop to $20,000.  Hedera (HBAR) gains 3.81 percent despite the market decline, trading at $0.06436 with a 12 percent weekly rise. Trader sentiment has shifted to a bearish stance after Bitcoin [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-21T16:55:01.000Z",
    "title": "Crypto Exchange Gemini Slams SEC in New Court Brief in Lawsuit Over Earn Program",
    "url": "https://dailyhodl.com/2023/08/21/crypto-exchange-gemini-slams-sec-in-new-court-brief-in-lawsuit-over-earn-program/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/gemini-plans-users-strikes.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/gemini-plans-users-strikes.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/gemini-plans-users-strikes.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/gemini-plans-users-strikes.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/gemini-plans-users-strikes.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/gemini-plans-users-strikes.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/gemini-plans-users-strikes.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto exchange Gemini is calling out the U.S. Securities and Exchange Commission (SEC) in its lawsuit over the platform’s Earn program. In a lengthy post, Gemini lawyer Jack Baughman says that the SEC’s lawsuit targeting the protocol’s Earn program, which allowed customers to loan their digital assets to crypto firm Genesis as a means of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/21/crypto-exchange-gemini-slams-sec-in-new-court-brief-in-lawsuit-over-earn-program/\">Crypto Exchange Gemini Slams SEC in New Court Brief in Lawsuit Over Earn Program</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]