[
  {
    "source": "Cointelegraph",
    "date": "2023-07-04T10:41:52.000Z",
    "title": "Creditors for bankrupt Voyager Digital billed $5.1M in legal fees",
    "url": "https://cointelegraph.com/news/creditors-for-bankrupt-voyager-digital-billed-5-1m-in-legal-fees",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/d2daf80e-e869-4d9b-b2e2-1e4fd42432f6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Voyager is not the only crypto firm incurring hefty legal fees; FTX, for example, has been billed over $120 million in fees.</p>\n                    <p><p>New York-based law firm McDermott Will &amp; Emery filed for compensation of $5.1 million from the creditors of bankrupt crypto brokerage firm Voyager Digital. The bill is for legal services offered between March 1 and May 13, 2023.</p><p>In a July 3 court <a href=\"https://cases.stretto.com/public/x193/11753/PLEADINGS/1175307042380000000001.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filing</a>, the law firm billed the legal fees to the “Official Committee of Unsecured Creditors.” The court documents revealed that the law firm charged an hourly rate of $1,026.76 for its services during the period.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/fc76809a-e8a0-40a5-84e9-9a3e0dfe3f98.png\"  /><figcaption style=\"text-align: center;\"><em>Summary of the final bill for Voyager Digital. Source: cases.stretto.com</em></figcaption></figure><p>The firm listed several legal services it offered Voyager, including advising the committee in connection with its powers and duties under the bankruptcy rules, attending meetings and negotiating with the representatives of the debtors and other parties in interest, preparing on behalf of the committee all necessary motions, applications, answers, orders, reports, replies, responses and papers, among others.</p><p>This was the third and final bill from the law firm, taking its total compensation to $16.48 million between July 5, 2022, and May 19, 2023, of which $8.97 million has already been paid by the creditors. However, McDermott Will &amp; Emery is not the only legal service provider to offer its services to Voyager. On June 28, legal adviser Kirkland &amp; Ellis also <a href=\"https://cointelegraph.com/news/voyager-pay-1-1-million-legal-fees-incurred-april\">billed Voyager for $1.1 million in legal fees</a> for the month of April. </p><p>McDermott Will &amp; Emery didn’t immediately respond to Cointelegraph’s request for comments.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/voyager-app-open-customer-withdrawals-june-20\"><strong><em>Voyager app set to reopen for customer withdrawals as soon as June 20</em></strong></a></p><p>Voyager <a href=\"https://cointelegraph.com/news/voyager-digital-files-for-chapter-11-bankruptcy-proposes-recovery-plan\">filed for bankruptcy in July 2022</a> amid a crypto lending crisis that led to market contagion and the collapse of multiple established crypto firms such as Celsius, BlockFi, and others. At the time of its bankruptcy filing, Voyager disclosed liabilities from $1 billion to $10 billion. </p><p>Apart from Voyager, multiple other crypto firms, including Celsius and FTX, have incurred hefty legal fees due to lengthy bankruptcy proceedings. FTX, for example, was <a href=\"https://cointelegraph.com/news/ftx-bankruptcy-very-expensive-heres-why-says-auditor\">billed over $120 million</a><a href=\"https://cointelegraph.com/news/ftx-bankruptcy-very-expensive-heres-why-says-auditor\"></a> in financial and legal advisory fees between Feb. 1 and April 30, 2023.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/huobi-lawsuit-hodlnaut-opnx-3ac-asia-express/\">Huobi sues… Huobi? 3AC rises from ashes, Korea crypto contagion</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-04T10:53:17.000Z",
    "title": "Thailand Bans Crypto Exchanges from Offering Lending Services",
    "url": "https://cryptodaily.co.uk/2023/07/thailand-bans-crypto-exchanges-from-offering-lending-services",
    "description": "<p>Thailand has followed in Singapore&rsquo;s footsteps by banning crypto exchanges from offering lending and staking services to retail investors. </p>\n<p>Thailand becomes the second Southeast Asian nation to ban crypto staking activities for retail investors.</p>\nThailand Bans Lending and Staking Services\n<p>The Thai SEC announced it is banning crypto exchanges from offering lending and staking services. On Monday, the securities agency issued new rules for digital asset service providers aiming to improve investor protection.</p>\n<p>According to the Thai SEC:</p>\n\n<p>It is forbidden to advertise or persuade the general public or do any other act in the manner of supporting the deposit staking &amp; lending service.</p>\n\n<p>The regulator explained the ban applies to &ldquo;depository services that offer returns to depositors and lenders,&rdquo; meaning exchanges are outright banned from offering such services. The SEC&rsquo;s new rules will take effect on July 31, 2023.</p>\n<p>Under the new rules, the SEC also introduced a mandatory trading risk disclaimer which exchanges must make clearly visible to customers.</p>\n<p>The risk disclaimer reads:</p>\n\n<p>Cryptocurrencies are high risk. Please study and understand the risks of cryptocurrencies thoroughly, because you may lose your entire investment.</p>\n\n<p>Further, the Thai SEC requires exchange operators to ensure users acknowledge trading risks before consenting to use such services. Finally, the SEC introduced investor suitability assessments to determine how much users may invest in crypto.</p>\nSingapore Bans Lending and Staking for Retail Investors\n<p>The Thai SEC&rsquo;s ban follows an announcement from Singapore&rsquo;s Monetary Authority (MAS) which also seeks to ban such services for retail investors. &nbsp;</p>\n<p>The regulator said in a statement on Monday that it determined staking activities are unsuitable for the retail public given the &ldquo;extremely high risk and speculative nature&rdquo; of those activities.</p>\n<p>The MAS said:</p>\n\n<p>Regulations alone cannot protect consumers from all losses, given the extremely high risk and speculative nature of digital payment token trading.</p>\n\n<p>In addition to the ban, the MAS will require crypto exchanges to safeguard customer assets in a trust before the end of the year.</p>\n\n<p>The Monetary Authority of Singapore (MAS) today announced new requirements for Digital Payment Token (DPT) service providers to safekeep customer assets under a statutory trust before the end of the year. This will mitigate the risk of loss or misuse of customers&rsquo; assets, and facilitate the recovery of customers&rsquo; assets in the event of a DPT service provider&rsquo;s insolvency.</p>\n\n<p>Thailand and Singapore&rsquo;s new investor protection rules come after the 2022 crypto lending crisis caused several firms to go bankrupt, costing investors billions of dollars.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T11:02:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-04T10:53:01.000Z",
    "title": "GCR gains 40%, making its way to top 100 with scam numbers",
    "url": "https://crypto.news/gcr-gains-40-making-its-way-to-top-100-with-scam-numbers/",
    "description": "Global Currency Reserve (GCR) just made its way to the top 100 cryptocurrencies with its significant surge over the past two months. However, data shows that a few accounts hold GCR. According to data provided by CoinMarketCap (CMC), the GCR&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-04T10:50:50.000Z",
    "title": "USDC Circulating Supply Down 38% Since Jan. 1 – Will It Affect Price?",
    "url": "https://www.newsbtc.com/news/usdc-circulating-supply-down-38-since-jan-1-will-it-affect-price/",
    "description": "USDC experienced a notable decrease in its circulating supply during the weekend, causing ripples of concern within the cryptocurrency market. According to data from CoinGecko, the stablecoin&#8217;s circulating supply dwindled by over 2%, falling from $27.9 billion on June 30 to $27.3 billion in less than 48 hours.  This sudden drop has intensified existing worries regarding the stability and long-term viability of stablecoins in the volatile world of cryptocurrencies. Since the beginning of the year, the total supply of USDC has exhibited a downward trajectory, plunging by a staggering 38%.  This continuous decline raises questions about the underlying factors contributing to the diminishing supply of USDC and its potential impact on the broader cryptocurrency ecosystem. Related Reading: Litecoin $100 Milestone Indicates Promising Bullish Trends – Here’s Why Declining Circulating Supply And Its Impact On USDC&#8217;s Price The decrease in USDC&#8217;s circulating supply can have significant implications for its price and overall value. As the supply of a stablecoin decreases, its scarcity may result in increased demand from investors and traders. If the demand for USDC remains steady or rises, the reduced supply could potentially push its price higher, following the basic principles of supply and demand economics.  However, this effect may not be linear, as other factors such as market sentiment, regulatory developments, and the overall performance of the broader cryptocurrency market can also influence USDC&#8217;s price movements. USD Coin in red in all timeframes. Source: Coingecko Market Perception And Trust Concerns The declining circulating supply of USDC might also trigger questions regarding the underlying reasons behind the reduction. Investors and users may question the transparency and credibility of the stablecoin&#8217;s issuer or the overall health of its backing reserves.  Any perceived lack of clarity or uncertainty could lead to reduced trust in USDC, causing some participants to seek alternative stablecoin options or even exit the market altogether. Consequently, the trustworthiness and regulatory compliance of stablecoin issuers will come under increased scrutiny, underscoring the need for greater transparency and accountability within the industry. As of today, the market cap of cryptocurrencies stood at $1.17 trillion. Chart: TradingView.com Regulatory Scrutiny The dwindling supply of USDC could also attract the attention of regulators and policymakers, who are increasingly keeping a close eye on the stablecoin space. Regulators have expressed concerns about the potential systemic risks associated with stablecoins, especially those with a significant market share.  A decline in the circulating supply might amplify these concerns and prompt regulatory bodies to take more aggressive actions to oversee and regulate stablecoin operations. Increased regulatory scrutiny could introduce new compliance requirements, which may impact stablecoin issuers and the broader cryptocurrency market. Related Reading: PEPE Breaches Local Highs With 20% Leap In Surprise Comeback Notably in March, the stablecoin experienced a temporary detachment from its peg to the dollar, which occurred in the aftermath of multiple cryptocurrency bank failures. In response to potential liquidity challenges related to US Treasury bonds, the company behind USDC, Circle, took proactive measures. They made the strategic choice to shift their investment focus towards short-term maturity bonds. This decision was aimed at safeguarding the stablecoin&#8217;s value and addressing concerns about the stability of its backing reserves. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from WorldCoin"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T10:52:19.000Z",
    "title": "Bitcoin Outperforms 80% of All Classical Assets and Is Set to Reach New ATH of $100,000 This Year – Report",
    "url": "https://www.crypto-news-flash.com/bitcoin-outperforms-80-of-all-classical-assets-and-is-set-to-reach-new-ath-of-100000-this-year-report/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-outperforms-80-of-all-classical-assets-and-is-set-to-reach-new-ath-of-100000-this-year-report",
    "description": "The price of BTC has almost doubled since the beginning of the year, surging from approximately $16,000 to over $31,000.  Bitcoin showcases remarkable liquidity, evident through its impressive volume-to-market cap ratio of 0.02669. During the first half of the year, the cryptocurrency market faced the repercussions of the FTX collapse and the previous year&#8217;s collapses [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T10:45:11.000Z",
    "title": "Exclusive: Credit Suisse and Swiss Football Association Introduce Ethereum NFT Collection for Women’s Football",
    "url": "https://www.crypto-news-flash.com/exclusive-credit-suisse-and-swiss-football-association-introduce-ethereum-nft-collection-for-womens-football/?utm_source=rss&utm_medium=rss&utm_campaign=exclusive-credit-suisse-and-swiss-football-association-introduce-ethereum-nft-collection-for-womens-football",
    "description": "Credit Suisse and the Swiss Football Association are introducing an Ethereum NFT collection to support women&#8217;s football in Switzerland. This marks Credit Suisse&#8217;s entry into the NFT and demonstrates Ethereum&#8217;s dominance in the space. Credit Suisse has officially announced its entry into the NFT space. The global investment bank and financial services firm based in [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-04T10:59:00.000Z",
    "title": "Analysis Channel Predicts BTC May Rise to $140K in the Next Cycle",
    "url": "https://coinedition.com/analysis-channel-predicts-btc-may-rise-to-140k-in-the-next-cycle/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"People Holding Bitcoin for the Last 5 Years Are Now in 34% Loss\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The crypto market analysis channel BitBoy Crypto uploaded its latest analysis for Bitcoin (BTC). In the video, the analyst predicted that the leading crypto could climb to as high as $140K in the next bull cycle. This bold prediction follows BlackRock’s BTC Exchange Traded Fund (ETF) filing, which resulted in several other large funds submitting [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/analysis-channel-predicts-btc-may-rise-to-140k-in-the-next-cycle/\">Analysis Channel Predicts BTC May Rise to $140K in the Next Cycle</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-04T10:55:18.000Z",
    "title": "Unveiling the Future of Enterprise AI Solutions: WorldAI Show Returns for its 42nd Edition in Singapore",
    "url": "https://coinedition.com/unveiling-the-future-of-enterprise-ai-solutions-worldai-show-returns-for-its-42nd-edition-in-singapore/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/pr-1-90.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/pr-1-90.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/pr-1-90-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/pr-1-90-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/pr-1-90-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/pr-1-90-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/pr-1-90-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/pr-1-90-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/pr-1-90-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/pr-1-90-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/pr-1-90-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/pr-1-90-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/pr-1-90-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/pr-1-90-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/pr-1-90-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/pr-1-90-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/pr-1-90-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Trescon is set to organize the 42nd edition of World AI Show, a global platform showcasing the latest trends and innovations in enterprise AI solutions. This highly anticipated event will be held on 2-3 August 2023 at the prestigious Marina Bay Sands Expo and Convention Centre in Singapore, bringing together IT Heads and business leaders [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/unveiling-the-future-of-enterprise-ai-solutions-worldai-show-returns-for-its-42nd-edition-in-singapore/\">Unveiling the Future of Enterprise AI Solutions: WorldAI Show Returns for its 42nd Edition in Singapore</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]