[
  {
    "source": "Cointelegraph",
    "date": "2023-07-30T08:11:33.000Z",
    "title": "Pro-XRP lawyer claims SEC prioritizes corporate capitalism over investors",
    "url": "https://cointelegraph.com/news/pro-xrp-lawyer-claims-sec-prioritizes-corporate-capitalism-over-investors",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/3838fab0-b05c-431e-bd33-486a34c85651.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>John Deaton believes the unequal treatment raises concerns about the regulatory body’s effectiveness and fairness, as well as the overall framework for digital assets.</p>\n                    <p><p>Pro-XRP lawyer, John Deaton, has said that the actions taken by the United States Securities and Exchange Commission (SEC) against the crypto industry are driven by a broader motive to safeguard corporate capitalism rather than prioritizing the protection of investors.</p><p>Deaton <a href=\"https://twitter.com/JohnEDeaton1/status/1685331246522523648\" target=\"_blank\" rel=\"noopener nofollow\">highlighted</a> what he views as an assault on cryptocurrencies, particularly in relation to the SEC's actions targeting Coinbase and Ripple. In his remarks, he touched on several aspects, such as the accredited investor rules, the SEC's approach to regulating cryptocurrencies and its position concerning retail investors in the Ripple case.</p><p>On X, Deaton expresses his conviction that the United States operates within a framework of corporate capitalism rather than a genuine capitalist system. To bolster his argument, he highlights various facets of the present financial landscape.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">For years I’ve said we don’t exist in a true capitalist system. We have corporate capitalism in the U.S. Look at the accredited investor rules and how they discriminate against the working class. Look at the attack on Crypto and the attack on Coinbase which allows non-accredited… <a href=\"https://t.co/JVis3xw30f\">https://t.co/JVis3xw30f</a></p>&mdash; John E Deaton (@JohnEDeaton1) <a href=\"https://twitter.com/JohnEDeaton1/status/1685331246522523648?ref_src=twsrc%5Etfw\">July 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As per the legal expert's analysis, the SEC's allocation of limited resources towards Section 5 cases and its focus on targeting the secondary market on exchanges, instead of addressing fraud within the crypto space, indicates a misplacement of priorities. He contends that this approach could potentially hinder innovation and impede the growth of the developing cryptocurrency industry.</p><p>Additionally, Deaton highlights the SEC's <a href=\"https://cointelegraph.com/news/sec-objects-to-xrp-holders-aiding-ripple-defense-moves-to-prohibit-lawyer\">opposition to retail investors participating as amici curiae</a> (friends of the court) in the Ripple case. With this stance, Deaton suggests a reluctance to consider the views of retail investors, further solidifying the perception that the regulatory body may prioritize the interests of larger financial institutions over those of individual investors.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blockchain-financial-institutions-2030-ripple\"><strong><em>Blockchain could save financial institutions $10B by 2030: Ripple</em></strong></a></p><p>Deaton highlights a major concern about a perceived double standard in crypto regulation. He criticizes the SEC for <a href=\"https://cointelegraph.com/news/sec-targeting-coinbase-binance-proxies-crypto\">not engaging in dialogue with proactive entities like Coinbase</a>, while SEC Chairman Gary Gensler <a href=\"https://cointelegraph.com/news/thousands-petition-for-congressional-investigation-of-alleged-gensler-sbf-links\">had multiple meetings with Sam Bankman-Fried</a>, the former CEO of FTX, an offshore crypto exchange facing allegations of defrauding users. This inconsistency in the SEC's approach troubles Deaton.</p><p>The unequal treatment raises concerns about the regulatory body's effectiveness and fairness, as well as the overall framework for digital assets. The SEC's differing approach to various players in the industry could impede the growth of innovative startups while potentially favoring more established entities. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-30T08:14:52.000Z",
    "title": "Crypto Analyst Stays Bullish on Ethereum ($ETH) Rival Solana ($SOL) Amid Market Volatility",
    "url": "https://www.cryptoglobe.com/latest/2023/07/crypto-analyst-stays-bullish-on-ethereum-eth-rival-solana-sol-amid-market-volatility/",
    "description": "Prominent pseudonymous cryopto analyst “Pentoshi” has been keeping a close eye on Solana (SOL), a rival to Ethereum (ETH). He stated that as long as Solana’s price remains above $22.30, he maintains a positive view on the cryptocurrency. Pentoshi’s analysis is based on high time frame (HTF) price action, a method that focuses on longer-term […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-30T08:30:51.000Z",
    "title": "Crypto․com Granted Registration Approval in the Netherlands",
    "url": "https://news.bitcoin.com/crypto%e2%80%a4com-granted-registration-approval-in-the-netherlands/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1940355673-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto․com Granted Registration Approval in the Netherlands\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1940355673-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1940355673-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1940355673-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1940355673-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1940355673-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1940355673-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1940355673.jpg 1281w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Digital asset exchange Crypto․com has been approved for registration as a crypto service provider in the Netherlands. The regulatory nod comes after a review of its business operations and compliance with the Dutch anti-money laundering legislation, the company pointed out. Trading Platform Crypto․com Adds Another Regulatory Approval in Europe Cryptocurrency exchange Crypto․com has secured an [&#8230;]"
  }
]