[
  {
    "source": "CoinDesk",
    "date": "2023-06-13T17:45:55.000Z",
    "title": "Binance Goes to Court Against the SEC",
    "url": "https://www.coindesk.com/policy/2023/06/13/binance-goes-to-court-against-the-sec/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Binance and Binance.US have made their case against the SEC's motion to freeze all Binance.US funds."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-13T17:56:47.000Z",
    "title": "Winklevoss Twins Caution Democrats Against “War on Crypto”",
    "url": "https://cryptodaily.co.uk/2023/06/winklevoss-twins-caution-democrats-against-war-on-crypto",
    "description": "<p>Crypto billionaires Tyler and Cameron Winklevoss cautioned the Democratic Party that its &ldquo;war on crypto&rdquo; will result in its losing crucial voters. </p>\n<p>According to the Winklevoss twins, US President Joe Biden and the Democratic Party risk losing crucial voters if it continues its &ldquo;war on crypto.&rdquo;&nbsp;</p>\n<p>Cameron Winklevoss, who founded crypto exchange Gemini with his brother Tyler, recently tweeted to warn democrats that they will &ldquo;alienate an entire generation&rdquo; of youth voters should it continue with its anti-crypto attitude.</p>\n\n<p dir=\"ltr\" lang=\"en\">The @SenWarren and @GaryGensler war against crypto is going to alienate an entire generation of would-be Democrats.Winning the youth vote w/ \"get out the vote\" is key part of Dem playbook. Dems believe the youth vote will carry the day. pic.twitter.com/F4FQowjCVn</p>\n&mdash; Cameron Winklevoss (@cameron) June 10, 2023\n<p>\n\n</p>\n<p>Winklevoss called out SEC Chairman Gary Gensler and Senator Elizabeth Warren in his tweet.</p>\n<p>He added:</p>\n\n<p>&ldquo;Crypto has already won the hearts and minds of Millennials and GenZ. They don&rsquo;t debate the merits of crypto.&rdquo;</p>\n\n<p>Tyler Winklevoss followed up the next day with a tweet saying:</p>\n\n<p>Roe cost Republicans the mid-terms. The @SenWarren and @GaryGensler war on crypto will cost Dems the 2024 election.</p>\n\n<p>The Winklevoss twins&rsquo; statements come amid aggressive action from the SEC, led by Gensler. The agency famously sued crypto exchange Binance and rival exchange Coinbase for alleged securities violations.</p>\n<p>Senator Warren also made headlines for cultivating an anti-crypto coalition under US politicians.</p>\n<p>The Gemini co-founder further offered two explanations for the recent enforcement:</p>\n\n<p dir=\"ltr\" lang=\"en\">Two explanations: (1) blue establishment either doesn't understand what's going on w/ Warren and Gensler or (2) are grossly miscalculating impact of their actions on youth vote this upcoming election cycle.They may not care about crypto, but they will care about the lost votes.</p>\n&mdash; Cameron Winklevoss (@cameron) June 10, 2023\n<p>\n\n</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-13T17:56:19.000Z",
    "title": "DWF Labs and TRON Reach Strategic Partnership to Strengthen Ecosystem Support",
    "url": "https://cryptodaily.co.uk/2023/06/dwf-labs-and-tron-reach-strategic-partnership-to-strengthen-ecosystem-support",
    "description": "<p>Geneva, Switzerland, June 13th, 2023, Chainwire</p><p>Global digital asset market maker and multi-stage Web3 investment firm DWF Labs has announced its partnership with TRON, the leading blockchain network focused on the decentralization of the Internet via decentralized applications (dApps). As part of this partnership, DWF Labs has become a liquidity provider for TRON, further enhancing the ecosystem support of the blockchain.</p><p>Andrei Grachev, the Managing Partner of DWF Labs, stated, \"With over 165 million accounts created and more than 5.8 billion transactions on the TRON network, we firmly believe that the TRON ecosystem is at the forefront of Web3 adoption. What we find particularly appealing about TRON's accomplishments is its remarkable ability to attract new ideas. TRON stands as one of the fastest-growing dApps ecosystems in the space at the moment, and the consistent rollout of innovative tools and services proves that TRON has a leading role in paving the trail in blockchain. That is why we are eager to further support the ecosystem with additional investment in the near future.\"</p><p>DWF Labs, as a prominent market maker in the blockchain industry, has been actively supporting and investing in Web3 protocols. Last year, DWF Labs committed an initial $15 million to the Web3 Industry Recovery Initiative, led by Binance Labs, to aid struggling protocols in the industry's recovery. More recently, DWF Labs has formed additional strategic partnerships with leading crypto players worldwide.</p>\"As a leading blockchain network focused on empowering decentralized commerce and community for every person on the planet, TRON has continually attracted new ideas and demonstrated exceptional growth within the space,&rdquo; a TRON spokesperson explained. &ldquo;We are delighted to partner with DWF Labs, as they bring their expertise and excellence to further strengthen the TRON ecosystem. Together, we aim to further support TRON's vision of a decentralized future.\"<p>By partnering with TRON as a liquidity provider, DWF Labs aims to contribute to the growth and development of the TRON ecosystem, facilitating improved accessibility of the blockchain network for all TRON users and community members.</p><p>About TRON DAO</p><p>TRON DAO is a community-governed DAO dedicated to accelerating the decentralization of the internet via blockchain technology and dApps.</p><p>Founded in September 2017 by H.E. Justin Sun, the TRON network has continued to deliver impressive achievements since MainNet launch in May 2018. July 2018 also marked the ecosystem integration of BitTorrent, a pioneer in decentralized Web3 services boasting over 100 million monthly active users. The TRON network has gained incredible traction in recent years. As of June 2023, it has over 166.5 million total user accounts on the blockchain, more than 5.85 billion total transactions, and over $11.52 billion in total value locked (TVL), as reported on TRONSCAN.&nbsp;</p><p>In addition, TRON hosts the largest circulating supply of USD Tether (USDT) stablecoin across the globe, overtaking USDT on Ethereum since April 2021. The TRON network completed full decentralization in December 2021 and is now a community-governed DAO. Most recently in October 2022, TRON was designated as the national blockchain for the Commonwealth of Dominica, which marks the first time a major public blockchain partnered with a sovereign nation to develop its national blockchain infrastructure. On top of the government&rsquo;s endorsement to issue Dominica Coin (&ldquo;DMC&rdquo;), a blockchain-based fan token to help promote Dominica&rsquo;s global fanfare, seven existing TRON-based tokens - TRX, BTT, NFT, JST, USDD, USDT, TUSD, have been granted statutory status as authorized digital currency and medium of exchange in the country.</p><p>TRONNetwork | TRONDAO | Twitter | YouTube | Telegram | Discord | Reddit | GitHub | Medium | Forum</p><p></p><p>About DWF Labs</p><p>DWF Labs is the global digital asset market maker and multi-stage Web3 investment firm, supporting portfolio companies from token listing to market making to OTC trading solutions.</p><p>With offices in Singapore, Switzerland, the UAE, Hong Kong, South Korea and BVI, the investment company DWF Labs is an affiliate of Digital Wave Finance (DWF), which consistently ranks among the top 5 trading entities by volume in the cryptocurrency world through its proprietary technology for high frequency trading.</p><p>For more information visit www.dwf-labs.com&nbsp;</p><p>For more information, please contact:</p><p>Andrei Grachev</p><p>Managing Partner, DWF Labs</p><p>ag@dwf-labs.com</p>ContactHayward Wongpress@tron.network"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T17:55:52.000Z",
    "title": "DWF Labs and TRON Reach Strategic Partnership to Strengthen Ecosystem Support",
    "url": "https://www.cryptopolitan.com/dwf-labs-and-tron-reach-strategic-partnership-to-strengthen-ecosystem-support/",
    "description": "Geneva, Switzerland, June 13th, 2023, Chainwire Global digital asset market maker and multi-stage Web3 investment firm DWF Labs has announced its partnership with TRON, the leading blockchain network focused on the decentralization of the Internet via decentralized applications (dApps). As part of this partnership, DWF Labs has become a liquidity provider for TRON, further enhancing ... <a title=\"DWF Labs and TRON Reach Strategic Partnership to Strengthen Ecosystem Support\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dwf-labs-and-tron-reach-strategic-partnership-to-strengthen-ecosystem-support/\" aria-label=\"More on DWF Labs and TRON Reach Strategic Partnership to Strengthen Ecosystem Support\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T17:51:54.000Z",
    "title": "Haru Invest suspends withdrawals due to a service partner issue",
    "url": "https://www.cryptopolitan.com/haru-invest-suspends-withdrawals-south-korea/",
    "description": "Haru Invest, a South Korean digital asset management company, has suspended withdrawals from its system due to an issue with one of its service partners. The decision was made to protect customer funds while a contingency plan was developed. Haru Invest, a company known for offering attractive dividend rates, has faced controversy and speculation surrounding ... <a title=\"Haru Invest suspends withdrawals due to a service partner issue\" class=\"read-more\" href=\"https://www.cryptopolitan.com/haru-invest-suspends-withdrawals-south-korea/\" aria-label=\"More on Haru Invest suspends withdrawals due to a service partner issue\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T17:40:50.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-13T18:00:02.000Z",
    "title": "Crypto Frenzy: Whale Accumulates 1.5 Trillion SHIB, Sparking Surge In Price",
    "url": "https://www.newsbtc.com/shiba-inu/whale-accumulates-1-5-trillion-shib-sparking-surge/",
    "description": "The bustling realm of cryptocurrencies is abuzz with a major development centered around Shiba Inu (SHIB). This news broke as Lookonchain, an on-chain analyst platform, reported a transaction involving a significant accumulation of Shiba Inu tokens by a major holder. This transaction took place on notable exchanges such as Binance and Coinbase and has made waves in the crypto community. According to Lookonchain&#8217;s data, a SHIB holder, identifiable by the address &#8220;0x40B3,&#8221; has recently added a colossal 1.5 trillion SHIB tokens to their portfolio. At current market rates, this acquisition equates to approximately $10 million. A History Of Accumulation Notably, this particular holder, &#8220;0x40B3,&#8221; has a history of substantial SHIB purchases. The holder had previously acquired 5.3 trillion Shiba Inu tokens, translating to around $35.5 million. On May 16, &#8220;0x40B3&#8221; made a transfer of 20 trillion SHIB tokens to another address, &#8220;0x73AF,&#8221; amounting to roughly $134.4 million. Related Reading: Shiba Inu (SHIB) Price At The Most Crucial Point In Its History? Owing to these sizable transactions, &#8220;0x40B3&#8221; has garnered attention within the crypto ecosystem. The scale of their holdings, rendering them the largest nonexchange holder of Shiba Inu, emphasizes their influence on the SHIB market. Impact On The SHIB Market The acquisition of the recent 1.5 trillion SHIB tokens by &#8220;0x40B3&#8221; had an immediate effect on the SHIB price. In just 15 minutes following the acquisition, the price of Shiba Inu surged over 1.5%. This brief window of time encapsulated the influence wielded by &#8220;whales,&#8221; or large-scale investors, over the price volatility in the cryptocurrency markets. Moreover, the SHIB price appears to be on a recovery path, with an uptick of nearly 25% since its recent low of $0.00000591 last Saturday. This rebound illustrates the dynamism of the cryptocurrency market and the significant role large investors play in shaping it. Meanwhile, Shiba Inu has shown a continuous uptick in the past 24 hours. SHIB which is one of the largest meme coins by market capitalization has recorded a brewing rally up by 3% in the past 24 hours. At the time of writing, Shiba Inu currently trades at $0.00000678 after trading below $0.00000600 on Tuesday. Interestingly, despite the current uptick, SHIB&#8217;s trading volume has plunged a bit from $185 million this time last week to $104 million in the past 24 hours. However, the meme coin&#8217;s market capitalization has seen a more than $700 million loss in the past 7 days. SHIB&#8217;s market cap has plunged from $4.7 billion last Tuesday to $3.9 billion as of today. Related Reading: Shiba Inu (SHIB) Price Could Soar To Major Highs Soon, Here’s Why In other news, the upcoming launch of Shibarium has cast a cloud of uncertainty over the Shiba Inu community due to some recent developments. Initially, LucieSHIB, a well-known advocate for Shiba Inu, set expectations for the launch of the eagerly awaited Shibarium mainnet, suggesting a timeframe between the second and third quarters of 2023. Nonetheless, according to recent posts from the same individual, the launch might experience a postponement from its initial projected timeline, causing a wave of speculation among market participants and aficionados.&#8221; Featured image from Shutterstock, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-13T18:05:04.000Z",
    "title": "Billionaire Tim Draper Says Gary Gensler Damaging the US With Anti-Crypto Policies, Calls for New Way of Regulation",
    "url": "https://dailyhodl.com/2023/06/13/billionaire-tim-draper-says-gary-gensler-is-damaging-the-usa-with-anti-crypto-policies/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/gensler-bubble-regulation.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/gensler-bubble-regulation.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/gensler-bubble-regulation.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/gensler-bubble-regulation.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/gensler-bubble-regulation.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/gensler-bubble-regulation.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/gensler-bubble-regulation.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Billionaire Tim Draper says the Chair of the U.S. Securities and Exchange Commission (SEC) is damaging the US with policies that stifle crypto innovation.  In a new interview with Fox Business&#8217;s The Claman Countdown, Tim Draper says the SEC and Gary Gensler should have no oversight on crypto technology.  &#8220;[The SEC] has no relevance to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/13/billionaire-tim-draper-says-gary-gensler-is-damaging-the-usa-with-anti-crypto-policies/\">Billionaire Tim Draper Says Gary Gensler Damaging the US With Anti-Crypto Policies, Calls for New Way of Regulation</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]