[
  {
    "source": "CryptoSlate",
    "date": "2023-08-16T14:00:28.000Z",
    "title": "VC firm a16z releases open-source microverse packed with generative AI NPCs in AI Town",
    "url": "https://cryptoslate.com/vc-firm-a16z-releases-open-source-microverse-packed-with-generative-ai-npcs-in-ai-town/",
    "description": "<p>Venture capital firm Andreessen Horowitz (a16z) has released the code for AI Town, an open-source project that lets developers create their own AI-powered simulated world. As the a16z team reported on X, this ambitious project aims to &#8220;democratize building your own simulation environment with AI agents.&#8221; The innovative project, built in collaboration with portfolio company [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/vc-firm-a16z-releases-open-source-microverse-packed-with-generative-ai-npcs-in-ai-town/\">VC firm a16z releases open-source microverse packed with generative AI NPCs in AI Town</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-16T13:49:18.000Z",
    "title": "SEC v. Ripple Proceedings Welcomes Sidley Austin LLP Representative",
    "url": "https://cryptobriefing.com/sec-v-ripple-proceedings-welcomes-representative/?utm_source=feed&utm_medium=rss",
    "description": "The ongoing SEC v."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-16T13:50:00.000Z",
    "title": "Sei Labs Announces Mainnet Beta Launch",
    "url": "https://cryptodaily.co.uk/2023/08/sei-labs-announces-mainnet-beta-launch",
    "description": "<p>Sei Labs has just announced the launch of its Mainnet beta platform, seeking to facilitate the mass adoption of digital assets.&nbsp;</p>\nSei Foundation Announces Mainnet Launch\n<p>Open-sourced tech firm behind the Sei blockchain, Sei Labs, has just announced a significant milestone in its journey toward revolutionizing the digital asset landscape. Following a successful Testnet alpha phase that witnessed an impressive 400 million transactions and the creation of 7.5 million unique testnet wallets, Sei Labs has officially launched the Sei Mainnet beta phase.</p>\n<p>The team tweeted the announcement on X,&nbsp;</p>\n\n<p>&ldquo;This marks the beginning of an long voyage, transitioning web2 experiences to web3 applications, with lightning fast time to finality&hellip;The Sei Foundation looks forward to seeing the exciting new applications built using Sei's infrastructure.&rdquo;</p>\n\n<p>The Mainnet beta phase's core mission is to undergo refinement through active community engagement and to seamlessly accommodate industry growth.&nbsp;</p>\n<p>Notably, Sei isn't just limiting its impact to decentralized finance (DeFi) but extends its prowess to any sector requiring trading, including gaming economies, NFT marketplaces, and decentralized exchanges (DEXs).</p>\nScaling to Address Current Challenges\n<p>As regulatory scrutiny mounts on centralized exchanges (CEXs), decentralized applications face the imperative of handling increased on-chain volume. Sei is seeking to provide a timely solution to the scalability challenges plaguing existing Layer 1 and Layer 2 infrastructures.&nbsp;</p>\n<p>The platform had taken a multi-faceted approach to decentralization, scalability, and capital efficiency, combined with geographical node diversification, to strengthen its resilience against potential network disruptions.</p>\n<p>Sei Labs' co-founder Jeff Feng encapsulates the mission succinctly:</p>\n\n<p>\"Current Web 3 infrastructure is unscalable, congested, and still too slow. Sei is designed to let apps and other projects scale in a way that no other blockchain can, while also maintaining a user-friendly experience.\"&nbsp;</p>\n\nSei&rsquo;s Performance Optimization\n<p>The platform has reported some unprecedented speed, with impressive time to finality clocking in at a mere 250ms, which is further enhanced by a 100ms buffer to ensure protocol stability. This speed is fortified by built-in parallelization, further optimizing its performance.&nbsp;</p>\n<p>Sei also introduces groundbreaking consensus research innovations, notably the Twin-Turbo consensus, propelling it to previously unattained performance milestones.</p>\nFocusing On Holistic User Experience\n<p>With the Mainnet's unveiling, the Sei team has revealed that over 200 teams are actively constructing on the Sei network, and over 7.5 million unique wallets have already emerged, generating a staggering 400 million testnet transactions.</p>\n<p>Launch day witnesses the introduction of 30 live applications, with more slated for H2 2023, including the much-anticipated decentralized perpetual futures exchange by Sushiswap.</p>\n<p>As Sei Labs co-founder Jay Jog pointed out,&nbsp;</p>\n\n<p>\"The fundamental use case for blockchains is the ability to exchange digital assets. Trading is universally important for all Web3 applications, not just DeFi. It includes social platforms, gaming economies, NFT marketplaces, and more. Exchange applications such as NFT marketplaces or gaming economies will offer the best user experience by building on Sei.\"</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T14:09:04.000Z",
    "title": "Generative AI will Reach Transformational Benefit in the Next 2 to 5 years, Gartner Report",
    "url": "https://www.cryptopolitan.com/generative-ai-benefit-in-5-years-gartner/",
    "description": "World’s leading IT research company Gartner Inc. on Wednesday released its “Hype Cycle for Emerging Technologies, 2023” report, predicting that generative artificial intelligence (AI) is likely to reach transformational benefit within the next two to five years.  Generative AI will have a profound impact on businesses, says Gartner In the report, Gartner placed generative AI ... <a title=\"Generative AI will Reach Transformational Benefit in the Next 2 to 5 years, Gartner Report\" class=\"read-more\" href=\"https://www.cryptopolitan.com/generative-ai-benefit-in-5-years-gartner/\" aria-label=\"More on Generative AI will Reach Transformational Benefit in the Next 2 to 5 years, Gartner Report\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T13:44:48.000Z",
    "title": "Trump’s hidden crypto treasures, $2.8M Ethereum wallet unearthed",
    "url": "https://www.cryptopolitan.com/trumps-hidden-2-8m-ethereum-wallet-unearthed/",
    "description": "Fresh financial disclosures have shed light on the cryptocurrency holdings of former United States President, Donald Trump. According to recently revealed financial statements, Trump is reported to possess a substantial sum of over $2.8 million in an Ethereum wallet. These statements were made public on August 14 by the nonprofit organization Citizens for Responsibility and ... <a title=\"Trump&#8217;s hidden crypto treasures, $2.8M Ethereum wallet unearthed\" class=\"read-more\" href=\"https://www.cryptopolitan.com/trumps-hidden-2-8m-ethereum-wallet-unearthed/\" aria-label=\"More on Trump&#8217;s hidden crypto treasures, $2.8M Ethereum wallet unearthed\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T14:02:52.000Z",
    "title": "FBI seized $1.7m of crypto in three months",
    "url": "https://crypto.news/fbi-seized-1-7m-of-crypto-in-three-months/",
    "description": "FBI seized $1.7 million worth of cryptocurrencies, including Bitcoin (BTC), Ethereum (ETH), Monero (XMR), and stablecoins USDT and DAI in three months. A document published by the US Federal Bureau of Investigation (FBI) revealed about $1.7 million worth of cryptocurrencies&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T13:48:21.000Z",
    "title": "US сrypto miners get unified voice with new lobbying group",
    "url": "https://crypto.news/us-%d1%81rypto-miners-get-unified-voice-with-new-lobbying-group/",
    "description": "Digital Energy Council debuts in the US, aiming to navigate the complex regulatory waters of crypto mining with Tom Mapes at its helm. The crypto mining industry in the US has a new lobbying organization known as the Digital Energy&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-16T14:00:39.000Z",
    "title": "Bitcoin Speculators Retreat As Long-Term Holders Double Down Since $69,000 Peak",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-speculators-retreat-as-long-term-holders-double-down/",
    "description": "The Bitcoin market continues to reveal trends and patterns, vital for both long-term holders and short-term speculators. Notably, since Bitcoin reached its all-time high of $69,000, speculators, who play a pivotal role in the market, now hold less of the cryptocurrency. This insight comes from prominent analytics firm Glassnode in its &#8220;The Week On-Chain&#8221; newsletter, which delves into the market&#8217;s dynamics and potential implications. Bitcoin Stagnation And Role Of Short-Term Holders The Bitcoin market has witnessed a prolonged period marked by relatively steady BTC price action. This phase has sown seeds of discontent among market participants, prompting speculation about potential downside risks. Related Reading: Bernstein Predicts Spot ETFs Could Claim 10% Of Bitcoin’s Market If Greenlit So far, the asset only hovers between $29,000 and $25,000 price points creating a tug-of-war between the bulls and bears in that price zones. A noteworthy shift in the Bitcoin market is the dwindling enthusiasm of its short-term traders, commonly referred to as speculators. This group, typically driven by the prospects of swift gains, seems to be re-evaluating its stance, perhaps deterred by the recent lack of significant price movement. Glassnode points out that the market share of these short-term holders has ebbed to a mere 2.56 million BTC. This stands in stark contrast to their presence in October 2021, right before Bitcoin soared to its record high. Yet, while these speculators recede, long-term holders, often viewed as the bedrock of the Bitcoin community, are seemingly undeterred. Their stronghold over the currency is tightening, with a current hold of 14.6M BTC, the highest ever recorded. The report noted: Overall, this suggests that conviction of Bitcoin investors does remain impressively high, and very few are willing to liquidate their holdings. A Market Teetering On Decisions The distinction in purchase prices between the two investor classes has been highlighted as a potential concern. According to the newsletter, Short-term speculators, having bought at a higher average price of $28,600, might be more susceptible to incurring losses with even a modest dip in Bitcoin&#8217;s price. On the other hand, long-term investors, with an aggregate purchase price substantially lower at around $20,300, seem more cushioned against market volatility. This variance in purchasing prices, combined with the contrasting reactions of the two investor groups, paints a picture of a market in flux, divided between those who believe in Bitcoin&#8217;s long-term value and those swayed by its immediate price trajectories. Related Reading: Bitcoin Price Key Indicators Suggest A Strong Case For More Losses Glassnode believes that &#8220;The separation between these two cost basis is an indicator that many recent buyers have a relatively elevated acquisition price.&#8221; Despite the current market uncertainty, an underlying sentiment that remains clear is the confidence of Bitcoin&#8217;s stalwarts. Their increasing hold suggests a steadfast belief in Bitcoin&#8217;s potential, even as speculators seem to waver amid its current price downturn. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-16T14:00:00.000Z",
    "title": "10 Tips That Will Help You Trade Crypto Safely",
    "url": "https://coinedition.com/10-tips-that-will-help-you-trade-crypto-safely/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/10-Tips-That-Will-Help-You-Trade-Crypto-Safely-Sponsored-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The recent Cryptocurrency Crime and Anti-Money Laundering Report of Ciphertrace found that the amount of crypto assets stolen through hacks, scams, and fraud in 2020 reached over $1.9 billion. Trading cryptocurrencies can be an exciting and potentially profitable venture. However, it&#8217;s essential to prioritize safety and security when engaging in crypto trading. Here are 10 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/10-tips-that-will-help-you-trade-crypto-safely/\">10 Tips That Will Help You Trade Crypto Safely</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-16T13:41:47.000Z",
    "title": "SEI and BONE Soar; SEI Enters Top 100 Coins on CoinMarketCap",
    "url": "https://coinedition.com/sei-and-bone-soar-sei-enters-top-100-coins-on-coinmarketcap/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/SEI-and-BONE-Soar-SEI-Enters-Top-100-Coins-on-CoinMarketCap-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>SEI, the native token of Sei&#8217;s blockchain scaling solution, rose quickly after being listed on major exchanges. Following the blockchain network’s beta launch, Coinbase, Binance, Bybit, and Bitget listed SEI on their platforms. Less than 24 hours after listing on these crypto exchanges, SEI’s value rose to $0.2556, at the time of writing, according to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sei-and-bone-soar-sei-enters-top-100-coins-on-coinmarketcap/\">SEI and BONE Soar; SEI Enters Top 100 Coins on CoinMarketCap</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]