[
  {
    "source": "Cointelegraph",
    "date": "2023-06-14T19:00:00.000Z",
    "title": "Puma launches metaverse experience: Nifty Newsletter, June 7–13",
    "url": "https://cointelegraph.com/news/puma-launches-metaverse-experience-nifty-newsletter-june-7-13",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/92798549-a106-4e57-92a4-632055b9d0ce.jpeg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Puma launches Black Station, a 3D metaverse experience allowing Puma Pass NFT holders access to exclusive products.</p>\n                    <p><p>In this week’s newsletter, read about footwear giant Puma’s new metaverse experience for Puma Pass <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a> holders. Check out Meta CEO Mark Zuckerberg’s comments on the new Apple Vision Pro headset, and how NFT platform Enjin has launched a new blockchain. In other news, GameStop terminated the executive responsible for its NFT push, and don’t forget this week’s Nifty News, featuring Kraken’s NFT marketplace and Coinbase’s Stand With Crypto NFTs.</p><h2>Footwear conglomerate Puma launches 3D Web3 experience</h2><p>Footwear company Puma has launched a 3D metaverse experience called Black Station. According to its creators, it’s an experiment to provide Puma Pass NFT holders access to various product drops. </p><p>Despite this, the company highlighted that the experience is open to everybody, but those with special tokens airdropped to Puma Pass holders will have perks like the ability to buy digital wearables and a “Rulebreaker” sneaker. </p><p><a href=\"https://cointelegraph.com/news/footwear-conglomerate-puma-launches-3d-web3-experience\"><strong>Continue reading</strong></a></p><h2>‘Already explored’ — Apple Vision Pro fails to impress Mark Zuckerberg</h2><p>Meta CEO Mark Zuckerberg has recently shared his thoughts on Apple’s newest product, the Vision Pro headset. According to the executive, while he had not yet experienced the product firsthand, he believes that the Meta team had “already explored” and contemplated the constraints of laws and physics, indirectly suggesting the new product may not be groundbreaking. </p><p>The Meta CEO also highlighted that Apple added increased capabilities, leading to a sevenfold cost increase. </p><p><a href=\"https://cointelegraph.com/news/already-explored-apple-vision-pro-unable-to-impress-mark-zuckerberg\"><strong>Continue reading</strong></a></p><h2>NFT platform Enjin forks Polkadot parachain Efinity to new mainnet</h2><p>NFT platform Enjin has launched a new mainnet called the Enjin Blockchain. To further Web3 adoption, the team said that the blockchain would provide solutions that do not rely on smart contracts but rather have functions integrated directly into the blockchain’s code. </p><p>The new chain enables various features like allowing developers to subsidize user transaction fees and letting users directly interact with projects within the blockchain without downloading specific wallet software. </p><p><a href=\"https://cointelegraph.com/news/nft-platform-enjin-forks-polkadot-parachain-efinity-to-new-mainnet\"><strong>Continue reading</strong></a></p><h2>GameStop fires CEO Matt Furlong months after axing crypto push</h2><p>GameStop has recently terminated its CEO Matt Furlong, the executive who led the company’s push into the NFT space. In a statement published by the company, Furlong was fired while Ryan Cohen was promoted to executive chairman.</p><p>The development follows GameStop’s 2022 announcement that the company would no longer focus major efforts toward NFTs or crypto after an earnings call that showed almost $95 million in losses. </p><p><a href=\"https://cointelegraph.com/news/gamestop-fires-ceo-matt-furlong-months-after-axing-crypto-push\"><strong>Continue reading</strong></a></p><h2>Nifty News: Kraken NFT exits beta, Coinbase’s ‘Stand with Crypto’ gains support and more</h2><p>Crypto exchange Kraken has recently announced that its NFT platform has launched out of its beta phase. With the launch, the marketplace noted that it expanded the number of collections supported and integrated the Polygon blockchain. Meanwhile, Coinbase’s Stand With Crypto NFTs strengthens as the community supports the campaign’s push for sound regulation.</p><p><a href=\"https://cointelegraph.com/news/nifty-news-kraken-nft-exits-beta-coinbase-stand-with-crypto-gains-support-and-more\"><strong>Continue reading</strong></a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-01/43adc850-7dbd-4fa8-811b-9eb32b6c1983.jpg\"  alt=\"\"  title=\"Puma launches metaverse experience: Nifty Newsletter, June 7&ndash;13\"  /></figure><p class=\"post-content__accent post-content__accent_big\"><a href=\"https://cointelegraph.com/podcasts/nft-steez\">CHECK OUT COINTELEGRAPH’S <em>NFT STEEZ</em> PODCAST</a></p><p><em>Thanks for reading this digest of the week’s most notable developments in the NFT space. Come again next Wednesday for more reports and insights into this actively evolving space.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-14T18:55:52.000Z",
    "title": "Why is BNB price up today?",
    "url": "https://cointelegraph.com/news/why-is-bnb-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/45ee74ef-9a84-444b-b4b2-3ddd6386dce3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BNB price has rebounded more than 10% from its six-month low of $220 as short traders were squeezed alongside rising open interest.</p>\n                    <p><p>The price of BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) is up around 3% today, in part due to bearish traders opening more BNB-tied contracts despite suffering losses via liquidations in the past 24 hours. In addition, BNB stands extremely \"oversold,\" which may have prompted traders to buy the dip.</p><h2>BNB price bounces after being \"oversold\" </h2><p>On June 14, BNB price climbed nearly 4% to $253. The gains came as a part of a recovery that saw its price rebounding 12% two days after falling to a six-month low of $220.</p><p>From a technical perspective, BNB's rise on June 14 came on the heels of its \"oversold\" status. Notably, the daily <a href=\"https://cointelegraph.com/news/here-s-3-ways-the-relative-strength-index-rsi-can-be-used-as-a-sell-signal\">relative strength index</a> (RSI) dropped to around 16.6 two days ago, its lowest reading since March 2020.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e764cceb-41bc-4156-980b-1b1bb7b4dc0a.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USD daily price chart. Source: TradingView.com</em></figcaption></figure><p>An RSI reading below 30 typically precedes a consolidation or recovery period in the market. </p><p>For instance, the BNB's daily RSI stint below 30 in December 2022 preceded a 50% price rally in the next two months.</p><h2>BNB funding rate flips negative</h2><p>The funding rate of BNB slipped below zero on June 10 and has been negative since. In other words, bearish traders are willing to pay bullish traders to keep their short bets open.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/77d93ccb-09c4-4cfb-b16d-492d110a4884.png\"  /><figcaption style=\"text-align: center;\"><em>BNB open interest-weighted funding rate. Source: Coinglass</em></figcaption></figure><p>Meanwhile, BNB open interest has reached a one-month high of around $377 million, coinciding with an overall downtrend. All these metrics suggest that most traders are betting on more downside, which often results in price rebounds that can extend if <a href=\"https://cointelegraph.com/news/ethereum-sets-record-eth-short-liquidations-wiping-out-500-billion-in-2-days\">short position get liquidated</a>. </p><h2>Key BNB price level to watch</h2><p>BNB's price rebound also comes after a steep 25% decline last week, prompted by the U.S. Securities and Exchange Commission's (SEC) <a href=\"https://cointelegraph.com/news/binance-us-halts-trading-for-dozens-of-usdt-btc-busd-pairs-amid-sec-lawsuit\">lawsuit</a> against Binance, which named BNB as an \"unregistered security.\"</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/sec-binance-us-negotiate-deal-asset-freeze\">SEC and Binance.US to negotiate deal avoiding total asset freeze</a></em></strong></p><p>In recent years, BNB price came under pressure due to broader crypto market declines, as shown below.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/56fcaa7d-942c-4047-9f1e-a8fb2148c69c.png\"  /></figure><p>Each time, BNB price discovered strong support near $220, which the bulls will argue should make this level an ideal buy-zone after the SEC-led price drop — if history repeats.</p><p>As of June 14, BNB/USD trades inside $240-250 range, a consolidation area from December 2022-January 2023. </p><p>If the price decisively closes above the $250 resistance, then the primary upside target will be its 50-day exponential moving average (50-day EMA; the red wave) near $300 in Q3, up around 20% from current prices. </p><p>Conversely, a close below $240 would risk crashing price toward $220. If the selloff continues, the next downside target to watch is likely in the $180-205 area.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-14T18:45:00.000Z",
    "title": "European Union AI Act passes in parliament ",
    "url": "https://cointelegraph.com/news/european-union-ai-act-passes-in-parliament",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/5172426f-f23f-4837-9f8d-2a48bbcb8ce0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Member states will have the opportunity to negotiate final details before the act becomes law. </p>\n                    <p><p>The European Parliament has passed the EU AI Act, a sweeping legislative framework for governance and oversight of artificial intelligence technologies in the European Union.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">EU AI act: first regulation on artificial intelligence<br>The use of artificial intelligence in the EU will be regulated by the AI Act, the world’s first comprehensive AI law. Find out how it will protect you ⬇️<a href=\"https://t.co/CQqAi7S8lR\">https://t.co/CQqAi7S8lR</a> <a href=\"https://t.co/GzVfIne7tH\">pic.twitter.com/GzVfIne7tH</a></p>&mdash; Europarl UK (@EPinUK) <a href=\"https://twitter.com/EPinUK/status/1668881961383854083?ref_src=twsrc%5Etfw\">June 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The measure passed in Parliament during a June 14 vote that saw majority support for the act in the form of 499 votes for, 28 against and 93 abstaining. The next step before the bill becomes law will involve individual negotiations with members of the European Parliament to smooth out the details. Initially proposed by the European Commission on April 21, the EU AI Act is a comprehensive set of rules for AI development in the EU.</p><p>Per a <a href=\"https://www.europarl.europa.eu/news/en/press-room/20230609IPR96212/meps-ready-to-negotiate-first-ever-rules-for-safe-and-transparent-ai\" target=\"_blank\" rel=\"noopener nofollow\">press release</a> from the European parliament:</p><blockquote>“The rules aim to promote the uptake of human-centric and trustworthy AI and protect the health, safety, fundamental rights and democracy from its harmful effects.”</blockquote><p>Once implemented, the act would prohibit certain types of artificial intelligence services and products while limiting or placing restrictions on others. Among the technologies outright banned are biometric surveillance, social scoring systems, predictive policing, so-called “emotion recognition” and untargeted facial recognition systems. Generative AI models, such as OpenAI’s ChatGPT and Google’s Bard, would be allowed to operate under the condition that their outputs be clearly labeled as AI-generated.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/irish-data-watchdog-blocks-google-from-launching-bard-in-the-eu-report\"><strong><em>Irish data watchdog blocks Google from launching Bard in the EU</em></strong></a></p><p>Once the act becomes law, any AI system that could “pose significant harm to people’s health, safety, fundamental rights or the environment” or “influence voters and the outcome of elections” will be classified as high risk and subject to further governance. </p><p>Parliament’s passing of the EU AI Act comes just two weeks after the supranational entity’s <a href=\"https://cointelegraph.com/news/eu-s-new-crypto-law-how-mica-can-make-europe-a-digital-asset-hub\">Markets in Crypto-Assets (MiCA) bill became law</a> on May 31. In both cases, industry leaders were among those leading the charge for regulation.</p><p>OpenAI CEO Sam Altman has been among the most vocal supporters of government oversight of the AI industry. He recently <a href=\"https://cointelegraph.com/news/openai-ceo-sam-altman-testifies-in-historic-senate-hearing-on-ai-safety\">testified before Congress</a> during a hearing in which he made explicit his belief that regulation is necessary. However, Altman also recently <a href=\"https://cointelegraph.com/news/open-ai-warns-european-officials-over-regulations\">warned European regulators against overregulation</a>. </p><p>On the cryptocurrency front, Ripple’s managing director for Europe and the United Kingdom, Sendi Young, recently told Cointelegraph that she believes <a href=\"https://cointelegraph.com/news/ripple-welcomes-europe-mica-regulation\">MiCA will help facilitate a “level playing field”</a> for companies operating in the crypto sector in Europe. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/musks-alleged-price-manipulation-the-satoshi-ai-chatbot-and-more-hodlers-digest-may-28-june-3/\">Musk’s alleged price manipulation, the Satoshi AI chatbot and more</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T19:05:08.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-14T19:03:51.000Z",
    "title": "Adidas announces collaboration with NFT artist Fewocious",
    "url": "https://crypto.news/adidas-announces-collaboration-with-nft-artist-fewocious/",
    "description": "Adidas, the global apparel company, has partnered with digital artist Fewocious for a special sneaker collaboration that combines physical footwear with NFT technology."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-14T18:48:00.000Z",
    "title": "EU firms up plans for introduction of digital euro",
    "url": "https://crypto.news/eu-firms-up-plans-for-introduction-of-digital-euro/",
    "description": "The European Union's executive branch is set to propose a plan for a digital euro, mandating the ECB to establish usage regulations."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T18:59:05.000Z",
    "title": "Cardano Founder Charles Hoskinson Secures Million-Dollar Investment from Industry Giant to Support Innovative Lace",
    "url": "https://www.crypto-news-flash.com/cardano-founder-charles-hoskinson-secures-million-dollar-investment-from-industry-giant-to-support-innovative-lace/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-founder-charles-hoskinson-secures-million-dollar-investment-from-industry-giant-to-support-innovative-lace",
    "description": "Cardano founder Charles Hoskinson announces the integration of the Web3 wallet platform Lace and the Web3 Brave browser. Lace Wallet is completely open source and embraces the principles of collaboration, transparency, and decentralization in the Web3 ecosystem. On Tuesday, June 13, Cardano founder Charles Hoskinson announced his support for Lace, a Web3 wallet platform developed [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-14T18:45:17.000Z",
    "title": "Lawmakers Introduce Bill To Remove Gary Gensler As SEC Chair Following ‘Long Series of Abuses’",
    "url": "https://dailyhodl.com/2023/06/14/lawmakers-introduce-bill-to-remove-gary-gensler-as-sec-chair-following-long-series-of-abuses/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/bill-remove-gary-long.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/bill-remove-gary-long.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/bill-remove-gary-long.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/bill-remove-gary-long.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/bill-remove-gary-long.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/bill-remove-gary-long.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/bill-remove-gary-long.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Two crypto-friendly Republican lawmakers in the US introduced legislation this week that would remove Gary Gensler as Chair of the U.S. Securities and Exchange Commission (SEC). House Majority Whip Tom Emmer of Minnesota and Representative Warren Davidson of Ohio rolled out the &#8220;SEC Stabilization Act,&#8221; which, if passed, would axe Gensler and also establish another [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/14/lawmakers-introduce-bill-to-remove-gary-gensler-as-sec-chair-following-long-series-of-abuses/\">Lawmakers Introduce Bill To Remove Gary Gensler As SEC Chair Following &#8216;Long Series of Abuses’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-14T18:41:44.000Z",
    "title": "Binance Gears Up To Leave Cyprus Ahead of New EU Regulation To Focus On Other Markets: Report",
    "url": "https://dailyhodl.com/2023/06/14/binance-gears-up-to-leave-cyprus-ahead-of-new-eu-regulation-to-focus-on-other-markets-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Exchange-Binance-Announces-Funding.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Exchange-Binance-Announces-Funding.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Exchange-Binance-Announces-Funding.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Exchange-Binance-Announces-Funding.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Exchange-Binance-Announces-Funding.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Exchange-Binance-Announces-Funding.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Exchange-Binance-Announces-Funding.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The world’s largest crypto exchange platform by trading volume is reportedly preparing to leave the country of Cyprus to focus on other European markets. According to a new report by Bloomberg, Binance is making moves to deregister its Cyprus arm, which was approved by the nation’s government in late 2022, to better tend to its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/14/binance-gears-up-to-leave-cyprus-ahead-of-new-eu-regulation-to-focus-on-other-markets-report/\">Binance Gears Up To Leave Cyprus Ahead of New EU Regulation To Focus On Other Markets: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]