[
  {
    "source": "CryptoGlobe",
    "date": "2023-07-18T14:28:35.000Z",
    "title": "XRP Is Getting Listed on One of the World’s Most Prestigious Crypto Exchanges",
    "url": "https://www.cryptoglobe.com/latest/2023/07/xrp-is-getting-listed-on-one-of-the-worlds-most-prestigious-crypto-exchanges/",
    "description": "LCX, the Liechtenstein Cryptoassets Exchange, is a fintech company that has been contributing to capital markets since 2018. With five years of innovation, LCX has significantly influenced the digital asset industry by delivering a robust blockchain infrastructure, characterized by exceptional security, efficiency, and transparency. The company has secured nine regulatory registrations in accordance with the […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-18T14:30:00.000Z",
    "title": "Polkadot Price Red On The Charts, Tradecurve To Lead The Next Crypto Bull Run",
    "url": "https://cryptodaily.co.uk/2023/07/polkadot-price-red-on-the-charts-tradecurve-to-lead-the-next-crypto-bull-run",
    "description": "<p>Despite the latest crypto market recovery, Polkadot (DOT) has been trading in the red region losing all its gains from the beginning of 2023. The charts have shown a notable decline in the price of Polkadot, leaving investors curious about its future trajectory. However, analysts have predicted that another token, Tradecurve (TCRV), will lead the next crypto bull run.&nbsp;</p>\n<p></p>\nPolkadot (DOT) Price Analysis: Why Is Polkadot Going Down?\n<p>Over the past week, the price of Polkadot l has been range-bound, fluctuating between $5.00 and $5.50.&nbsp;</p>\n<p>Despite the launch of Polkadot 2.0, the token has faced significant bearish pressure, evident in the long wick on its July 6th candlestick, suggesting selling pressure during intraday rallies. According to CoinMarketCap, the current price of Polkadot stands at $5.12, reflecting a 6.34% decline over the past seven days.</p>\n<p>Although Polkadot's price has dipped below the moving averages recently, there are indications of a potential recovery as the token experiences a modest 0.88% increase in the last 24 hours. Moreover, trading volume on the network has witnessed an 8.30% surge within the past 24 hours.</p>\n<p>Currently, Polkadot has surpassed the 50-Day Simple Moving Average (SMA) at $5.05, yet it still remains below the 200-Day SMA at $5.72.&nbsp;</p>\n<p>A positive sign would be a breakout above the $5.15 mark, signaling solid demand. In such a scenario, the bulls would likely attempt to drive the pair towards $5.64. On the downside, if bearish pressure lingers, the token could drop to $4.74.</p>\n<p></p>\nTradecurve (TCRV) To Lead The Next Crypto Bull Run\n<p>As Polkadot gears up for a rebound, market experts have predicted that Tradecurve could lead the next crypto bull run, surpassing the likes of Bitcoin. The market's belief in the potential of Tradecurve stems from its plan to bridge the crypto and traditional financial sector.</p>\nWhy Tradecurve (TCRV) Can Rally By 100X\n<p>While platforms like Binance and Coinbase already offer derivative options and futures for cryptocurrencies, Tradecurve seeks to expand this offering by incorporating a wide range of instruments from the traditional financial market.&nbsp;</p>\n<p>These instruments encompass commodities, indices, stocks, ETFs, forex, and cryptocurrencies, enabling traders to access a more diverse and comprehensive portfolio. Tradecurve gains the ability to tap into the OTC derivatives market worth over $632 trillion in 2022. It does so by introducing derivatives tied to traditional financial instruments,&nbsp;</p>\n<p>Tradecurve also has other features like copy trading, AI algorithmic trading, high leverage, and a metaverse trading academy. Tradecurve has attracted significant attention. This is with a projected price surge of 50x during the presale phase and up to 100x upon the launch of the trading platform,&nbsp;</p>\nExperts Opinion: Time To Take Advantage\n<p>Currently trading at $0.018, a 100X price increase could propel the token's value to $1.8, potentially propelling it into the top 100 cryptocurrencies based on market capitalization before the end of 2023.&nbsp;</p>\n<p>Savvy investors have recognized the opportunity and have already acquired millions of TCRV tokens, positioning themselves early for potential gains.</p>\n<p>Visit the links below to get more information about Tradecurve and the TCRV token:</p>\n<p>Click Here For the Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-18T14:15:00.000Z",
    "title": "BRISE Coin Holders Rejoice as Gate.io Offers 100% APY Staking",
    "url": "https://cryptodaily.co.uk/2023/07/brise-coin-holders-rejoice-as-gateio-offers-100-apy-staking",
    "description": "Recent reports reveal that Bitgert (BRISE) coin holders have received exciting news as they can now stake their tokens on the Gate.io exchange, offering a remarkable annual percentage yield (APY) of 100%. This recent development comes just a day after Bitgert announced the expansion of its rapidly growing crypto project.\n<p>&nbsp;</p>\n\n<p dir=\"ltr\" lang=\"en\">Exciting news for #BRISE coin holders! Now you can stake on https://t.co/kCJAqUnMnP exchange and earn a whopping 100% APY. Don't miss out on this opportunity. Visit https://t.co/t5E0VYsWrJ for more details. #cryptocurrency #staking #passiveincome</p>\n&mdash; Bitgert - $BRISE (@bitgertbrise) July 18, 2023\n<p>\n\n</p>\n<p>The team unveiled its new meme character, which has stirred up controversy within the crypto community. These updates have consequently caused an upward trend in the price of its native token, BRISE, outperforming other cryptocurrency pairs.</p>\n<p>Further, Bitgert has made significant strides by listing the BRISE token on ten cryptocurrency exchanges. This milestone includes the verification of the BRISE token on Etherscan, a highly regarded Ethereum network blockchain explorer. Etherscan enables users to track transactions, tokens, addresses, and associated prices on the Ethereum blockchain.</p>\n<p>&nbsp;</p>\n\n<p dir=\"ltr\" lang=\"en\">🎉 Exciting news! #BRISE, our ERC20 token, has just been verified on https://t.co/eHPZvPuNwL! 🚀 Join us in the world of decentralized finance and experience the power of blockchain firsthand. #crypto #ethereum #blockchain Explorer link: https://t.co/QnVPoUoKDS</p>\n&mdash; Bitgert - $BRISE (@bitgertbrise) July 13, 2023\n<p>\n\n</p>\n<p>Etherscan's previous reports indicate that the total supply of BRISE tokens is an astounding 405 billion. There has been a noticeable increase in active holders recently, with Uniswap V3 hosting 197 billion Bitgert (BRISE) tokens. Uniswap v2 also holds a substantial volume of BRISE tokens, highlighting the token's popularity.</p>\n<p>The native token of the Bitgert crypto platform, BRISE, has been leading the crypto market with remarkable price gains. A recent report that covered the eventful week for BRISE noted that the coin experienced a gain of over 30%, pushing its crypto market cap beyond $103 million.</p>\n<p>While BRISE has been enjoying positive growth, other major cryptocurrencies such as Ethereum (ETH), Binance Coin (BNB), Solana (SOL), and Cardano (ADA) have experienced losses in the past 24 hours. CoinMarketCap data reveals that while BRISE maintained a more than 16% upward trajectory over the past week, ETH and BNB only managed to achieve single-digit gains.</p>\n<p>Moreover, BRISE has climbed three positions in the ranking of significant coins within two weeks, resulting in a market cap increase of over $3 million. The interest in this coin can be attributed to exciting developments, celebrations, and collaborations surrounding Bitgert.</p>\n<p>Bitgert (BRISE) trades at $2.65e-7 in the past 24 hours, with a trading volume of $2,811,609 during a similar timeframe, according to Coinmarketcap data. Bitgert has also experienced a 2.41% increase in the last 24 hours, boasting a CoinMarketCap ranking of 189 and a market cap of $104,799,608.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T14:37:08.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-18T14:30:39.000Z",
    "title": "Bitcoin’s Realized Cap Nears $400 Billion Despite Price Struggle At $30,000",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-realized-cap-nears-400b-price-reclaims/",
    "description": "Despite Bitcoin&#8217;s current struggle to surpass the $30,000 mark, data analytics firm Glassnode earlier today reported that the asset&#8217;s realized capitalization has since been on an upward trajectory, nearing the $400 billion mark. Bitcoin Realized Cap Nears $400 Billion According to Data analytics firm Glassnode, Bitcoin&#8217;s Realized Cap is now inching closer to $400 billion, showing that new capital is continuously entering the market despite the year&#8217;s ups and downs.  Related Reading: Standard Chartered Raises Bitcoin Forecast To $120,000, Citing Miners’ Reduced Selling Bitcoin&#8217;s Realized Cap represents the total value of all BTC at the price they were last moved or transacted, indicating the cost basis of holders. When this metric rises, it reveals that BTC is being traded at progressively higher prices, which suggests an increase in demand. Glassnode reported that the increase in BTC&#8217;s realized cap signals the consistent influx of capital into the asset throughout the year 2023. This steady inflow represents a stable investment climate surrounding Bitcoin, despite its recent price fluctuations. Furthermore, Glassnode&#8217;s assessment of the ascending realized cap is indicative of a broader trend in the cryptocurrency market. The data analytics firms said, &#8220;It signals that coins are changing hands at higher prices on net,&#8221; &#8211; a phenomenon that underlines a rising demand for Bitcoin. It is worth noting that this recorded increasing demand for Bitcoin comes at a time the asset might have flashed a hope of bullish moves following the surge in Spot Bitcoin ETF filings and financial giants such as BlackRock embracing the largest asset by market cap. BTC Struggles To Push Past $30,000 Meanwhile, as Bitcoin realized&#8217;s cap is approaching $400 billion, the asset has struggled to make a significant move above the $30,000 mark. Over the past 24 hours alone, the BTC price has traded both below and above the $30,000 mark, suggesting a level of consolidation at this point. Particularly, the asset currently has a 24-hour high of $30,292 and a 24-hour low of $29,792, at the time of writing. However, regardless of that, BTC is currently down by only a slight dip of 1% in the last 24 hours with a trading price of $29,882.  This latest price action follows Bitcoin&#8217;s quick spike which was seen last week on July 13. This surge brought Bitcoin price to trade even above the $31,000 mark before briefly slipping below $30,000. Over the past few days, however, a total of more than $30 billion has been removed from the BTC market cap. Related Reading: Galaxy Digital Founder Anticipates BTC Price Surge Due To This Reason The asset&#8217;s market cap has plunged from a high of $614 billion seen on July 13 to $583 billion, as of today. Additionally, BTC trading volume has also declined in the past week indicating less trading activity. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-18T14:34:24.000Z",
    "title": "Ethereum’s zkSync Introduces Boojum: Advancing Decentralization and Efficiency",
    "url": "https://www.crypto-news-flash.com/ethereums-zksync-introduces-boojum-advancing-decentralization-and-efficiency/?utm_source=rss&utm_medium=rss&utm_campaign=ethereums-zksync-introduces-boojum-advancing-decentralization-and-efficiency",
    "description": "<img width=\"1000\" height=\"660\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Inked-Pixels-4-Ethereum.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethereum\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Inked-Pixels-4-Ethereum.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Inked-Pixels-4-Ethereum-300x198.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Inked-Pixels-4-Ethereum-768x507.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Inked-Pixels-4-Ethereum-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Inked-Pixels-4-Ethereum-214x140.jpg 214w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Ethereum scaling solution zkSync unveils Boojum as part of the steps to make a complete move into decentralization. This upgrade comes with several benefits including doing transaction compressing at a cheaper cost.  Ethereum scaling solution zkSync has unveiled an upgrade as part of the effort towards decentralization. According to the report, the launch is in [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-18T14:15:07.000Z",
    "title": "Pepe Coin Surge Followed by Correction, InQubeta (QUBE) Sets the Stage for a Bullish Rally",
    "url": "https://www.crypto-news-flash.com/pepe-coin-surge-followed-by-correction-inqubeta-qube-sets-the-stage-for-a-bullish-rally/?utm_source=rss&utm_medium=rss&utm_campaign=pepe-coin-surge-followed-by-correction-inqubeta-qube-sets-the-stage-for-a-bullish-rally",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-18T114312.247.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-18T114312.247.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-18T114312.247-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-18T114312.247-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The world of cryptocurrencies is constantly in flux, and this instability is one of the aspects that make it particularly intriguing for investors. The recent activity surrounding Pepecoin (PEPE) perfectly demonstrates this oscillating trend. After a considerable surge in value, a rapid correction followed, leaving the crypto community in a state of anticipation for the [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-18T14:30:44.000Z",
    "title": "Mark Yusko Predicts Legacy Financial Corporations To Become Crypto Companies As Digital Assets Become Inevitable",
    "url": "https://dailyhodl.com/2023/07/18/mark-yusko-predicts-legacy-financial-corporations-to-become-crypto-companies-as-digital-assets-become-inevitable/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/crypto-holders-big-impact.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/crypto-holders-big-impact.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/crypto-holders-big-impact.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/crypto-holders-big-impact.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/crypto-holders-big-impact.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/crypto-holders-big-impact.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/crypto-holders-big-impact.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Morgan Creek Capital founder Mark Yusko is predicting that traditional finance (TradFi) corporations will eventually transform into digital asset businesses. In a new London Real interview with host Brian Rose, Yusko predicts that it is only a matter of time before digital assets take over the financial sector. He compares the current state of blockchain technology [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/18/mark-yusko-predicts-legacy-financial-corporations-to-become-crypto-companies-as-digital-assets-become-inevitable/\">Mark Yusko Predicts Legacy Financial Corporations To Become Crypto Companies As Digital Assets Become Inevitable</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]