[
  {
    "source": "CoinDesk",
    "date": "2023-06-08T19:24:25.000Z",
    "title": "Crypto Custody Firm BitGo Reaches Preliminary Agreement to Buy Prime Trust: Source",
    "url": "https://www.coindesk.com/business/2023/06/08/crypto-custody-firm-bitgo-reaches-preliminary-agreement-to-buy-prime-trust-source/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Cryptocurrency custody firm BitGo is seeking to buy Prime Trust, another crypto custody specialist regulated in the state of Nevada, according to a person familiar with the matter."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T19:30:00.000Z",
    "title": "Quantum miners would yield ‘massive’ energy savings for blockchain: Study",
    "url": "https://cointelegraph.com/news/quantum-miners-would-yield-massive-energy-savings-for-blockchain-study",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/eab97541-657a-4c7b-be1d-7c497617781e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>University of Kent researchers compared three quantum systems to an ASIC miner, and the quantum machines were demonstrably more energy efficient. </p>\n                    <p><p>A pair of scientists from the University of Kent’s School of Computing in the United Kingdom recently <a href=\"https://arxiv.org/pdf/2306.03321.pdf\" target=\"_blank\" rel=\"noopener nofollow\">conducted</a> a study comparing energy consumption rates for current ASIC-based miners to proposed quantum-based solutions.</p><p>According to the team’s preprint research paper, the systems utilizing quantum computing demonstrably outperformed standard mining rigs in energy efficiency:</p><blockquote>“We show that the transition to quantum-based mining could incur an energy saving — by relatively conservative estimates — of about roughly 126.7 TWH, or put differently the total energy consumption of Sweden in 2020.”</blockquote><p>Bitcoin mining operations alone consumed more than 150 terawatt hours annually (as of May 2022), per the paper, putting into perspective the potential impact the proposed quantum-based systems could have.</p><p>The pair’s conclusions were based on experiments comparing three different quantum mining systems to an Antminer S19 XP ASIC miner. </p><p>The quantum mining devices were split between a system featuring a single layer of fault tolerance, another one with two layers of fault tolerance and one without any dedicated error-correction features. </p><p>As the researchers point out, blockchain mining is one of the few areas of quantum computing where error correction isn’t such a big deal. In most quantum functions, errors create noise that functionally limit a computing system’s ability to produce accurate computations. </p><p>In blockchain mining, however, success rates with state-of-the-art classical systems are still relatively low. Per the research paper, “A classical Bitcoin miner is profitable with only a success-rate of about 0.000070%.” </p><p>The researchers also note that, unlike classical systems, quantum-based systems can actually be fine-tuned over time for increased accuracy and efficiency. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/explained/how-does-quantum-computing-impact-the-finance-industry\"><strong><em>How does quantum computing impact the finance industry?</em></strong></a></p><p>While quantum computing technology is still considered to be in its infancy, the very specific problem of blockchain mining doesn’t require a full-service quantum computing solution. As the researchers put it, “a quantum miner is not, and need not be, a scalable, universal quantum computer. A quantum miner need only perform a single task.”</p><p>Ultimately, the researchers conclude that it should be possible to build miners using existing quantum technologies that demonstrate quantum advantage over classical computers.</p><p>Despite the potential energy savings, it bears mention that the researchers focused on a type of quantum computing system called a “noisy intermediate-scale quantum” (NISQ) system. </p><p>According to the preprint paper, quantum miners should demonstrate “massive” energy savings at a size of around 512 quantum bits, or “qubits” — a term somewhat analogous to classical computing bits. </p><p>Typically, however, NISQ systems only <a href=\"https://arxiv.org/abs/1801.00862\" target=\"_blank\" rel=\"noopener nofollow\">operate</a> with about 50-100 qubits, though there doesn’t appear to be an industry standard. </p><p>While the energy savings might be feasible, the costs of building and maintaining a quantum computing system in the 512 qubit range have, traditionally, been <a href=\"https://thequantuminsider.com/2023/04/10/price-of-a-quantum-computer\" target=\"_blank\" rel=\"noopener nofollow\">prohibitive</a> for most organizations. </p><p>Only D-Wave and IBM offer client-facing systems in the same range (D-Wave’s D2 is a 512-qubit processor, and IBM’s Osprey weighs in at 433), but their architectures differ so greatly that comparisons between their qubit counts are ostensibly meaningless. </p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-08T19:10:41.000Z",
    "title": "Coinbase legal chief Paul Grewal says SEC ‘misread the law’",
    "url": "https://cryptoslate.com/coinbase-legal-chief-paul-grewal-says-sec-misread-the-law/",
    "description": "<p>Coinbase chief legal officer Paul Grewal believes that the SEC has &#8220;misread the law&#8221; when it comes to labeling many cryptocurrencies as securities and the &#8220;status of crypto will remain strong.&#8221; Grewal said that once a federal judge versed in such matters presides over the case in court, they will come to the same conclusion. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinbase-legal-chief-paul-grewal-says-sec-misread-the-law/\">Coinbase legal chief Paul Grewal says SEC ‘misread the law’</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T19:36:32.000Z",
    "title": "Cardano price analysis: ADA finds support at the $0.3100 mark, can the bulls make a comeback?",
    "url": "https://www.cryptopolitan.com/cardano-price-analysis-2023-06-09/",
    "description": "TL;DR Breakdown The Cardano price analysis shows that the ADA price action found support at the $0.320 mark and the bullish momentum has enabled the price to return to the $0.3230 mark. However, the price action still faces strong bearish pressure at press time as the bulls face rejection at the $0.3300 mark.&#160; The broader ... <a title=\"Cardano price analysis: ADA finds support at the $0.3100 mark, can the bulls make a comeback?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-analysis-2023-06-09/\" aria-label=\"More on Cardano price analysis: ADA finds support at the $0.3100 mark, can the bulls make a comeback?\">Read more</a>"
  }
]