[
  {
    "source": "CoinDesk",
    "date": "2023-08-10T17:22:43.000Z",
    "title": "Aave Token Holders Voting on 2 Proposals Following Averted Curve Liquidation Crisis",
    "url": "https://www.coindesk.com/business/2023/08/10/aave-token-holders-voting-on-2-proposals-following-averted-curve-liquidation-crisis/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The proposals, which aim to disable CRV borrowing and decrease Aave’s exposure to Curve’s native token on its Ethereum V2 markets, are responses to the liquidation pressure faced by Curved founder Michael Egorov."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-10T17:17:05.000Z",
    "title": "Bitcoin Rallies Keep Getting Quickly Sold – What's Up?",
    "url": "https://www.coindesk.com/markets/2023/08/10/bitcoin-rallies-keep-getting-quickly-sold-whats-up/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The world’s largest cryptocurrency is lacking sustained momentum, the price selling off shortly after each attempted leg higher."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-10T17:12:47.000Z",
    "title": "Embattled Aragon Mulled Sale of Crypto Project, Leaked Screenshot Shows",
    "url": "https://www.coindesk.com/business/2023/08/10/embattled-aragon-mulled-sale-of-crypto-project-leaked-screenshot-shows/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "One of the biggest crypto projects building tools to support decentralized governance is trying to get out of its own governance pickle."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-10T17:15:00.000Z",
    "title": "Circle preps $1B war chest to deal with market threats from PayPal and others",
    "url": "https://cointelegraph.com/news/circle-preps-1b-war-chest-to-deal-with-market-threats-from-paypal-and-others",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/3f8a32c9-68b4-49b6-8ebe-4ba538b46cee.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Circle’s USDC stablecoin has dropped from $45 billion in circulation at the start of 2023 to just $26 billion as the summer winds down.</p>\n                    <p><p>Stablecoin issuer Circle has a $1 billion cash reserve pegged as insurance against a declining market capitalization and fresh competition from the traditional finance and technology industries, said CEO Jeremy Allaire. </p><p>In an interview with Bloomberg, Allaire <a href=\"https://www.bloomberg.com/news/articles/2023-08-10/circle-usdc-stablecoin-issuer-says-1-billion-cash-to-counter-paypal-binance?in_source=embedded-checkout-banner\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a> the war chest and shared his views on the uptick in competition from organizations such as PayPal that are new to the stablecoin space:</p><blockquote>“I expect you will see many many, not just internet payments firms, but also all kinds of financial services companies and others begin to get more involved in this. It’s great to have this new competition. I do think it’s going to drive more and more companies into the field.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/paypal-launches-stablecoin-for-payment\"><strong><em>PayPal launches PYUSD stablecoin for payment</em></strong></a></p><p>Circle is best known for its USDC (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) stablecoin, a digital token similar in design to regular cryptocurrency but backed entirely by fiat — in this case, the United States dollar. </p><p>However, since at least 2021, the company’s primary form of revenue has <a href=\"https://www.circle.com/hubfs/investors/Circle-Investor-Presentation-July2021.pdf\" target=\"_blank\" rel=\"noopener nofollow\">come</a> from interest on its cash holdings and through its treasuries services. For the first half of 2023, Circle had a reported revenue of $779 million, surpassing its total revenue of $772 for 2022.</p><p>Despite this, the company has seen its market share in the stablecoin space decline from $45 billion at the start of 2023 to $26 million in just seven months.</p><p>Allaire attributes this decline to cryptocurrency exchange Binance’s decision to pull backing from USDC in favor of its own token and other unfortunate events in the market. “The Terra collapse helped us; the Binance forced-conversion hurt us,” the Circle CEO told Bloomberg, adding that “the FTX collapse sort of helped us, and then the failure of regional banks hurt us.”</p><p>In related news, <a href=\"https://cointelegraph.com/news/usdc-issuer-circle-launches-mpc-wallet-beta-ethereum-polygon-avalanche\">as Cointelegraph recently reported</a>, Circle launched a wallet-as-a-service API for developers as part of its current ongoing Web3 initiatives. According to an Aug. 8 announcement, the new API will allow devs to create bespoke multiparty computation wallets for their customers.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/qLOENH-NCRU\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-10T17:30:00.000Z",
    "title": "Microsoft Partners with Aptos Labs to Merge AI and Blockchain",
    "url": "https://cryptodaily.co.uk/2023/08/microsoft-partners-with-apto-labs-to-merge-ai-and-blockchain",
    "description": "<p>The new collaboration between Microsoft and Aptos Labs will use the best of AI and blockchain technologies to drive Web3 into the masses.</p>\nWhy Does Aptos Need AI?\n<p>On Wednesday, August 9, Aptos Labs, a crypto project founded by Facebook ex-employees, announced its new partnership with tech giant Microsoft. The Layer 1 blockchain will use Microsoft Azure OpenAI Service to help onboard new users to Web3.</p>\n<p>Even though both blockchain and AI are being developed at astonishing speed, their adoption by the global population can be challenging due to user skepticism around the technologies. To facilitate and speed up the onboarding process, Aptos Labs joins forces with Microsoft to introduce Aptos Assistant, an AI-driven chatbot, similar to the distinguished ChatGPT.&nbsp;</p>\n<p>Aptos Assistant will help everyday Internet users bridge seamlessly from Web2 to Web3. The AI tool will be able to answer any questions regarding the Aptos blockchain ecosystem, and will guide developers through the creation of smart contracts and decentralized apps.&nbsp;</p>\n\n<p>\"Artificial Intelligence and blockchain technologies are quickly converging for one important reason: they are both generational breakthroughs that profoundly impact the evolution of the internet and shape society,\" commented Mo Shaikh, CEO of Aptos Labs. \"Together with Microsoft, our shared vision is to ensure that this technology is accessible to more people and organizations than ever before.\"</p>\n<p>\"The intersection of AI and blockchain is one of the most interesting combinations of emerging technologies and can generate transformational use cases,\" said Rashmi Misra, General Manager, AI &amp; Emerging Technologies, Microsoft. \"By fusing Aptos Labs' technology with the Microsoft Azure Open AI Service capabilities, we aim to democratize the use of blockchain enabling users to seamlessly onboard to Web3 and innovators to develop new exciting decentralized applications using AI.\"</p>\n\nWhy Does Microsoft Need Blockchain?\n<p>There&rsquo;s a reason why the tech giant wants to infuse its AI model into Aptos Web3 solutions. Microsoft explains that blockchain technology can provide more transparency to the AI-generated content, making it more credible and trustworthy.&nbsp;</p>\n\n<p>&ldquo;For example, how do we know that LLM-generated outputs are authentic [and] trustworthy? How do we know that the training data is bias free in the first place? Blockchain-based solutions can help with verifying, time-stamping and attributing content to its source, thereby improving credibility in a distributed digital economy,&rdquo; said Daniel An, global director of business development for AI and Web3 at Microsoft.</p>\n\n<p>The choice of the Aptos network can be explained by its phenomenal speed &ndash; the blockchain can support up to 160,000 transactions per second.</p>\nDigital Payments and CBDCs\n<p>According to the press release, Microsoft and Aptos have also agreed to collaborate upon innovative solutions, such as asset tokenization, payments, and Central Bank Digital Currencies (CBDCs). This will also be part of the effort towards Web3 adoption. Additionally, Aptos will operate validator nodes on Azure to make its blockchain more secure and reliable.</p>\n<p>Following the news, the Aptos token jumped by around 17% and is hovering at $7.36 at the moment of writing.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-10T17:30:51.000Z",
    "title": "US Inflation Climbs to 3.2% in July, Stoking Concerns and Dividing Market Opinions",
    "url": "https://news.bitcoin.com/us-inflation-climbs-to-3-2-in-july-stoking-concerns-and-dividing-market-opinions/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ddd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Inflation Climbs to 3.2% in July, Stoking Concerns and Dividing Market Opinions\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ddd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ddd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ddd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ddd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ddd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ddd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ddd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The most recent data from the Bureau of Labor Statistics reveals a growingly intricate inflationary scenario for the U.S. economy. Disclosed on Thursday, the Consumer Price Index for All Urban Consumers (CPI-U) exhibited a 3.2% annual increase in July, primarily propelled by housing expenses. This monthly surge aligns with June&#8217;s 0.2% escalation, where food costs [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T17:38:50.000Z",
    "title": "Google’s $5 Billion Lawsuit and the Crucial Battle for Digital Privacy",
    "url": "https://www.cryptopolitan.com/googles-5-billion-lawsuit-and-the-crucial-battle-for-digital-privacy/",
    "description": "In a significant legal development, tech giant Google has encountered a setback as a $5 billion collective lawsuit alleging privacy violation advances in court. The lawsuit contends that Google surreptitiously tracked the online activities of millions of users without obtaining explicit consent. The ruling by US Judge Yvonne Gonzalez Rogers denies Google&#8217;s attempt to dismiss ... <a title=\"Google&#8217;s $5 Billion Lawsuit and the Crucial Battle for Digital Privacy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/googles-5-billion-lawsuit-and-the-crucial-battle-for-digital-privacy/\" aria-label=\"More on Google&#8217;s $5 Billion Lawsuit and the Crucial Battle for Digital Privacy\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T17:32:18.000Z",
    "title": "The strategy to Binance’s slow exit from Europe",
    "url": "https://www.cryptopolitan.com/strategy-to-binance-slow-exit-from-europe/",
    "description": "Is Binance truly pulling the plug on Europe, or is there a deeper strategy at play? Binance, the titan of the crypto world, appears to be retracing its steps in Europe. But dig a little deeper, and their European strategy is more nuanced than meets the eye. Facing regulatory giants When you’re at the top, ... <a title=\"The strategy to Binance&#8217;s slow exit from Europe\" class=\"read-more\" href=\"https://www.cryptopolitan.com/strategy-to-binance-slow-exit-from-europe/\" aria-label=\"More on The strategy to Binance&#8217;s slow exit from Europe\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T17:21:52.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T17:16:26.000Z",
    "title": "Elon Musk in trouble over Trump Twitter records",
    "url": "https://www.cryptopolitan.com/musk-in-trouble-over-trump-twitter-records/",
    "description": "Elon Musk&#8217;s recent acquisition, now rebranded as X but once widely recognized as Twitter, finds itself ensnared in legal controversies involving none other than former U.S. President Donald Trump. A hefty $350,000 fine was slapped on X for its delay in responding to a covert search warrant relating to Trump’s infamous Twitter records. The evolving ... <a title=\"Elon Musk in trouble over Trump Twitter records\" class=\"read-more\" href=\"https://www.cryptopolitan.com/musk-in-trouble-over-trump-twitter-records/\" aria-label=\"More on Elon Musk in trouble over Trump Twitter records\">Read more</a>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-10T17:30:00.000Z",
    "title": "TWT‘s Bullish Momentum Builds as Buyers Defend Support",
    "url": "https://coinedition.com/twts-bullish-momentum-builds-as-buyers-defend-support/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Weve-seen-TWT-surging.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"TWT Market Upward Momentum\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Weve-seen-TWT-surging.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Weve-seen-TWT-surging-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Weve-seen-TWT-surging-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/Weve-seen-TWT-surging-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Weve-seen-TWT-surging-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Weve-seen-TWT-surging-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>After failing to break through the $0.9231 resistance level, bullish momentum in the Trust Wallet Token (TWT) has retraced in the last 24 hours. As a result, bears took control of the TWT market and dipped the price to a support level of $0.9061. This level of support has been holding firm, indicating potential buying [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/twts-bullish-momentum-builds-as-buyers-defend-support/\">TWT‘s Bullish Momentum Builds as Buyers Defend Support</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]