[
  {
    "source": "NewsBTC",
    "date": "2023-09-07T04:08:27.000Z",
    "title": "Ethereum Price Could See Lift-off Unless This Support Gives Way",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-could-see-lift-off-1650/",
    "description": "Ethereum price is eyeing an upside break above $1,650 against the US Dollar. ETH must stay above $1,600 to start a fresh increase in the near term. Ethereum is slowly moving higher from the $1,620 support zone. The price is trading above $1,632 and the 100-hourly Simple Moving Average. There is a connecting bullish trend line forming with support near $1,622 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a steady increase if there is a close above the $1,650 resistance. Ethereum Price Eyes Fresh Increase Ethereum’s price saw a couple of swing moves below the $1,650 resistance zone. ETH even spiked toward $1,665 but the bears remained active. There was a fresh decline, and the price retested the $1,600 support zone. It is again moving higher above $1,620, like Bitcoin. Ether is now trading above $1,632 and the 100-hourly Simple Moving Average. Besides, there is a connecting bullish trend line forming with support near $1,622 on the hourly chart of ETH/USD. On the upside, the price might face resistance near the $1,645 level. It is close to the 50% Fib retracement level of the recent drop from the $1,668 swing high to the $1,624 low. The next resistance is near the $1,650 level or the 61.8% Fib retracement level of the recent drop from the $1,668 swing high to the $1,624 low, above which the price could rise toward the $1,665 level. The next major hurdle is near the $1,700 level. Source: ETHUSD on TradingView.com A close above the $1,700 level might push Ethereum further higher. The next resistance might be near $1,750. Any more gains might send the price toward the $1,800 resistance. Another Decline in ETH? If Ethereum fails to clear the $1,650 resistance, it could start another decline. Initial support on the downside is near the $1,630 level and the 100-hourly Simple Moving Average. The first key support is close to $1,620 and the trend line. The next key support is $1,600. A downside break below $1,600 might put bears in control. The next major support is near the $1,580 level. If there is a downside break below $1,580, the price could revisit the key $1,540 support level. Technical Indicators Hourly MACD – The MACD for ETH/USD is slowly gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,600 Major Resistance Level – $1,650"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-07T03:40:41.000Z",
    "title": "The AI and Crypto Union – A New Dawn for Innovation or Pandora’s Box",
    "url": "https://dailyhodl.com/2023/09/06/the-ai-and-crypto-union-a-new-dawn-for-innovation-or-pandoras-box/",
    "description": "<p>The world is watching closely what innovative AI-meets-crypto solutions will bring about. A recent public attention-grabber has been shiny metallic orbs that scan the eyes in exchange for digital ID and cryptocurrency. Throughout the world, people are wondering if we are on the verge of a better future or heading toward disaster. Technology behind these [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/06/the-ai-and-crypto-union-a-new-dawn-for-innovation-or-pandoras-box/\">The AI and Crypto Union – A New Dawn for Innovation or Pandora’s Box</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]