[
  {
    "source": "Decrypt",
    "date": "2023-06-06T23:27:00.000Z",
    "title": "Senators Question Meta CEO Mark Zuckerberg Over LLaMA AI Model “Leak”",
    "url": "https://decrypt.co/143638/senators-question-meta-ceo-mark-zuckerberg-over-llama-ai-model-leak",
    "description": "Lawmakers decry the release of Meta’s advanced and uncensored Large Language Model, and ask what the company is doing to minimize its damage."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-06T23:18:41.000Z",
    "title": "Kevin O’Leary: Binance Will Be “Starved of Oxygen” by SEC’s Lawsuit",
    "url": "https://decrypt.co/143631/kevin-oleary-binance-will-be-starved-of-oxygen-by-secs-lawsuit",
    "description": "The “Shark Tank” star says today’s top digital asset firms are likely destined to live on only in history books."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-06T23:30:45.000Z",
    "title": "Chinese Yuan, Euro, Digital Currencies Challenge US Dollar Dominance, TD Economist Says",
    "url": "https://news.bitcoin.com/chinese-yuan-euro-digital-currencies-challenge-us-dollar-dominance-td-economist-says/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/td-yuan-euro-dollar-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Chinese Yuan, Euro, Digital Currencies Challenge US Dollar Dominance, TD Economist Says\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/td-yuan-euro-dollar-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/td-yuan-euro-dollar-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/td-yuan-euro-dollar-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/td-yuan-euro-dollar-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/td-yuan-euro-dollar-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/td-yuan-euro-dollar-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/td-yuan-euro-dollar.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A senior economist at financial services firm TD says the Chinese yuan, the euro, and digital currencies could erode the U.S. dollar’s dominance. “Several countries have shown frustration with the dominance of the dollar and are pursuing alternatives for conducting international trade and cross-border banking,” he said. Long-Term Trend Is Away From US Dollar, Says [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-06T23:30:00.000Z",
    "title": "Ripple CEO Blasts SEC Chair For Anti-Innovation Stance, XRP Bulls Remain Optimistic",
    "url": "https://www.newsbtc.com/analysis/xrp/ripple-ceo-blasts-sec-chair-for-anti-innovation-stance-xrp-bulls-remain-optimistic/",
    "description": "In a scathing critique of the Securities and Exchange Commission&#8217;s (SEC) recent actions against the cryptocurrency industry, Ripple Chair Executive Officer (CEO) Brad Garlinghouse has accused the SEC Chair Gary Gensler of “hypocrisy” and “desperation”. In a statement released on Twitter, Garlinghouse called Gensler&#8217;s claims to be &#8220;pro-innovation&#8221; laughable, arguing that the agency&#8217;s recent lawsuits against Ripple and other companies are simply a distraction from their internal struggles. Related Reading: Bitcoin (BTC) Rollercoaster Ride: Is $23,000 The End Of The Line? Ripple CEO Claps Back At SEC Chair Garlinghouse went on to criticize Gensler as an &#8220;unelected bureaucrat&#8221; who is flailing to mask the fact that he and his agency lack the power they so desperately crave. He suggested that the SEC&#8217;s crackdown on the crypto industry is misguided and ultimately harmful to innovation. Furthermore, Ripple CEO Garlinghouse criticizes Gensler for trying to exert power that he doesn&#8217;t possess and suggests that the agency&#8217;s actions are ultimately futile.  On the same note, according to Yassin Mobarak, founder of venture capital firm Dizer Capital, the SEC&#8217;s aggressive approach may be an attempt to prevent a precedent-setting ruling against them in the Ripple case. Mobarak suggests that the SEC may be expediting their attack plans to isolate any potential losses in the Ripple case and claim that they are specific to the facts and circumstances of that case, rather than applicable to the entire cryptocurrency industry. This would enable the SEC to avoid setting a precedent that could have negative implications for the industry as a whole. These comments reflect the growing tension between the SEC and the cryptocurrency industry, with many companies feeling unfairly targeted by the agency&#8217;s regulatory actions. The recent lawsuits against Ripple, Coinbase, and Binance have raised questions about the legitimacy of the SEC&#8217;s claims and the impact of their actions on the wider industry. XRP Price Shows Resilience Amid Regulatory Uncertainty XRP has had a tumultuous few weeks as increased regulatory scrutiny has put pressure on the entire crypto industry. After reaching a key level of $0.500 on May 30, XRP lost some of its momentum amid uncertainty about the future of the industry. However, the market has shown resilience, and XRP has managed to breach the $0.500 level once again. As of the time of writing, XRP is trading at $0.5285, up 3% in the last 24 hours. This suggests that investors remain optimistic about the long-term prospects of the cryptocurrency, despite the challenges posed by regulatory uncertainty. What’s more, according to the crypto analyst Egrag Crypto, XRP is nearing what he calls the &#8220;twilight zone&#8221; with a &#8216;W&#8217; formation, which has several measured targets. The non-logarithmic &#8216;W&#8217; formation measured target is between $0.75-$0.85 cents, while the logarithmic &#8216;W&#8217; formation measured target is between $1.00-$1.20. Additionally, the symmetrical triangle full send break-out target is around $5.5, while the Fib 1.618 target is at $6.4, which would represent an uptrend of over 1000% Related Reading: Cardano Founder Unveils SEC Motivation For Suing Binance However, despite these potential price targets, Egrag Crypto also warns of an ultimate shakeout, which could potentially retest the lows seen in June.  Featured image from iStock, chart from TradingView.com "
  }
]