[
  {
    "source": "CoinDesk",
    "date": "2023-07-17T10:53:24.000Z",
    "title": "EU's Data Act Final Draft Still Contains Controversial Smart Contract Kill Switch",
    "url": "https://www.coindesk.com/policy/2023/07/17/eus-data-act-final-draft-still-contains-controversial-smart-contract-kill-switch/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Lawmakers appear to have largely ignored pleas from organizations linked to Polygon, NEAR and Cardano about the kill-switch, according to a final version of the text seen by CoinDesk"
  },
  {
    "source": "Decrypt",
    "date": "2023-07-17T10:57:05.000Z",
    "title": "Aave’s Dollar-Pegged GHO Stablecoin Hits $2.5M Market Cap After Just 2 Days",
    "url": "https://decrypt.co/148856/aaves-dollar-pegged-gho-stablecoin-hits-2-5m-market-cap-just-2-days",
    "description": "Aave has launched a new dollar-pegged stablecoin on Ethereum that's backed by overcollateralized loans in the style of Maker's DAI."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-17T10:58:27.000Z",
    "title": "zkSync launches new STARK-based proof system with a focus on mass usability ",
    "url": "https://cointelegraph.com/news/zk-sync-launches-stark-based-proof-system",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/47243e1f-106e-478c-9d62-524685a08256.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The latest proof system promises to better throughput than the current 100 TPS rate and reduce costs in the long term.</p>\n                    <p><p>Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) layer-2 scaling solution <a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-the-zksync-ecosystem\">zkSync </a>Era has <a href=\"https://zksync.mirror.xyz/HJ2Pj45EJkRdt5Pau-ZXwkV2ctPx8qFL19STM5jdYhc\" target=\"_blank\" rel=\"noopener nofollow\">launched </a>a new STARK-based proof system called Boojum that promises to run on consumer-grade GPU systems. </p><p>zkSync Era is one of a handful of Ethereum scaling protocols that makes use of zero-knowledge rollups (ZK-rollup) to increase capacity and speed while reducing fees. ZK-rollups mostly use two prominent proof systems, namely <a href=\"https://cointelegraph.com/explained/zk-starks-vs-zk-snarks-explained\">zk-STARK and zk-SNARK</a>. zk-SNARK stands for a zero-knowledge succinct non-interactive argument of knowledge, while zk-STARK stands for zero-knowledge scalable transparent argument of knowledge.</p><p>The new Boojum proof system is based on a Rust-based cryptographic library from zkSync that implements an upgraded version of arithmetic circuits for zkSync Era and its ZK developer stack. Most importantly, it allows Boojum provers to be run on everyday personal computers, as opposed to powerful hardware and servers.</p><p>The upgrade is capable of running on computers with only 16 GB of GPU RAM which will ensure regular users can participate in network activity as well. For context, zkSync currently runs on a cluster of 100 GPUs each with 80 GB of RAM. </p><p>Prior to the launch of Boojum, zkSync was mainly dependent on zk-SNARK proof systems which were capable but comparatively less transparent than the zk-STARK-based systems. The earlier system was able to process about 100 transactions per second while Boojum promises to offer superior processing capabilities.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/privacy-scaling-drives-use-cases-for-zero-knowledge-technology\"><strong><em>Privacy, scaling drives use cases for zero-knowledge technology</em></strong></a></p><p>In the final stage of the implementation, the new proof will wrap the STARK proofs with a non-transparent pairing-based SNARK. It will essentially be a slightly upgraded version of the current SNARK-based proof system. This proof requires less storage and is cheaper to verify which drives down the cost of the proof system, and therefore the transactions themselves.</p><p>Boojum is currently live on the zkSync Era mainnet for testing, generating and verifying ‘shadow proofs’. Developers are currently testing ‘shadow proofs’ with real production data before complete migration and larger use. The new system will be upgraded without any regenesis.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethereums-layer-2-zk-rollups-can-become-interoperable/\"><strong><em>Here’s how Ethereum’s ZK-rollups can become interoperable</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-17T10:45:31.000Z",
    "title": "Philippines Blockchain Council exec sees crypto adoption ‘snowballing’ ",
    "url": "https://cointelegraph.com/news/crypto-philippines-blockchain-council-exec-sees-crypto-adoption-snowballing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/2778f306-3450-4c6f-b17b-f9144b26c16b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchain Council of the Philippines’ Donald Lim believes that blockchain and Web3 projects have the “opportunity to flourish” in the country. </p>\n                    <p><p>The Philippines has all the recipes for mainstream crypto and blockchain adoption according to Dr. Donald Lim, the founder of the Blockchain Council of the Philippines (BCP).</p><p>In an interview with Cointelegraph, Lim shared his thoughts on the country’s potential for crypto adoption and explained why he believes blockchain projects can potentially find success within the country. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/0d93e7b9-ba4d-4f6a-ba1f-be793d172607.png\"  /><figcaption style=\"text-align: center;\"><em>BCP's Donald Lim with Cointelegraph's Ezra Reguerra. Source: Cointelegraph</em></figcaption></figure><p>Lim told Cointelegraph that as they recognized that the world moved fast toward Web3, they organized an event called the Philippine Blockchain Week and found that there’s an entire ecosystem in the country that wants to “find their place in the world.” He explained: </p><blockquote>“We feel very strongly that we can be the blockchain capital of Asia. We realized that we have the technical know-how, we're very young, we have a 25-year median age, and in terms of adoption, we can adapt fast, like what happened with Axie Infinity.”</blockquote><p>In 2021, <a href=\"https://cointelegraph.com/explained/play-to-earn-vs-move-to-earn-explained\">play-to-earn (P2E)</a> blockchain game Axie Infinity <a href=\"https://cointelegraph.com/news/monster-battle-nft-game-axie-infinity-soars-in-popularity-among-developing-nations\">became popular in the Philippines</a>. Estimates showed that 40% of the game’s player base came from the developing nation. According to Lim, this introduced a lot of web3 concepts into the country such as the creation of crypto wallets. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/axie-infinity-player-buys-two-houses-in-the-philippines-from-in-game-profits\"><strong><em>Axie Infinity player buys two houses in the Philippines from in-game profits</em></strong></a></p><p>Since then, the BCP executive said there’s been a lot of interest from global players to set up their projects in the country. “We saw that around the world, there are a lot of the international organizations that have been wanting to penetrate the Philippines,” Lim said. </p><p>According to the executive, these organizations could flourish in the country not just because of the demographics, but also because of the government’s stance on crypto and blockchain. He explained: </p><blockquote>“We have an open government, I would say. We don't have a government that’s been wanting to shut us down. And therefore, we feel that any blockchain project or Web3 project has all the opportunity to flourish in the country.”</blockquote><p>On June 8, Cointelegraph spoke with Ethan Rose, founder of Pouch — a wallet service that supports the Bitcoin Lightning Network in the Philippines. According to Rose, they’ve managed to <a href=\"https://cointelegraph.com/news/bitcoin-payments-exec-philippines-adoption-interview\">onboard over 400 businesses</a> in the country to accept Bitcoin payments. </p><p>Despite the recent onboarding of Filipino merchants into Bitcoin and crypto, Lim believes the possibility of living in the Philippines using only Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) or crypto is still a long away. </p><p>“I don't think realistically that would happen anytime soon [...] but crypto will always be an option,” he said. However, the executive also believes that “it's only a matter of time before all of these snowballs and into become something bigger.” </p><p>The executive stressed that this could happen four or five years down the line once the entire infrastructure matures. This means that crypto will not only be used for payments but also for buying <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a>, going into the metaverse, among other activities. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-in-the-philippines-necessity-is-the-mother-of-adoption/\"><strong><em>Crypto in the Philippines: Necessity is the mother of adoption</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-17T11:04:24.000Z",
    "title": "Kalima Secures $10 Million Investment Commitment and Announces Private Sale and DEX Listing",
    "url": "https://cryptodaily.co.uk/2023/07/kalima-secures-10-million-investment-commitment-and-announces-private-sale-and-dex-listing",
    "description": "<p>Dubai, United Arab Emirates, July 17th, 2023, Chainwire</p><p>Delegated proof-of-stake blockchain Kalima has entered into an agreement with ABO Digital, a private alternative funding group based in the Bahamas and Dubai. This significant partnership involves a commitment of US$10 million into the French-based blockchain company. Kalima has also released details of its KLX token sale.</p><p>Kalima is a rapidly growing ecosystem that allows businesses, developers, and startups to build web3 enterprise and data governance applications, with a focus on IoT (Internet of Things) data in order to solve real-world problems.</p>Kalima CEO Andr&eacute; Legendre said: &ldquo;The funding commitment from ABO Digital marks a significant milestone for Kalima, which plans to utilize the funds to further innovate and refine IoT solutions to revolutionize industries and drive digital transformation. The arrangement with ABO Digital will enable Kalima to enhance its IoT blockchain solutions for industrial companies and bolster strategic partnerships within the IoT and blockchain ecosystem.&rdquo;&ldquo;We are excited to work with the Kalima team going forward,&rdquo; said Amine Nedjai, CEO of ABO Digital. &ldquo;Kalima&rsquo;s innovative approach and expertise in web3 enterprise applications align perfectly with our commitment to driving technological advancements in enterprise blockchain solutions.&rdquo;<p>The Kalima team has also announced a 24-hour private sale of its KLX token on Pinksale. The event will provisionally take place on July 19. A general purpose utility token, KLX can be used to pay for transactions and access blockchain services on the Kalima protocol.</p><p>To support the growth of the KLX token, on July 10 Kalima Blockchain Governance created several proposals. These include bridging the KLX token from Polygon to the Ethereum network and proposing the 24-hour token sale on Pinksale. Following completion of the private sale event, KLX will be made available for trading on Uniswap, where a KLX-ETH pair will be established.</p><p>The primary objective of the private sale, which will have a hard cap of 300 ETH, is to create a sufficiently deep liquidity pool on Uniswap. The Uniswap listing of the KLX token is planned for July 21.</p><p>About Kalima</p><p>Kalima is a low-consumption layer one blockchain for enterprises and IoT. It provides an interconnected blockchain for achieving decentralization and increasing scalability, adopting a framework popularized by blockchains such as Cosmos and Polkadot. Kalima can be embedded into very small IoT devices and allows AI inferences to be executed at the network&rsquo;s edge using its native smart contracts.</p><p>About ABO Digital</p><p>ABO Digital is an investment firm providing alternative financing solutions to cryptocurrency projects around the world. As part of the Alpha Blue Ocean group, which has executed more than $2B in financing commitments for publicly listed companies since its inception in 2017, ABO Digital brings institutional-grade expertise and flexible financing solutions for blockchain developers worldwide.</p><p class=\"ql-align-center\"></p>ContactHead of PRYousef BatterWhite Label Strategyyousef.batter@whitelabelstrategy.io+971559356531"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-17T10:54:56.000Z",
    "title": "Australian Banks Block Payments to “High-Risk” Crypto Exchanges",
    "url": "https://cryptodaily.co.uk/2023/07/australian-banks-block-payments-to-high-risk-crypto-exchanges",
    "description": "<p>National Australia Bank joins other large Australian banks to block payments to &ldquo;high-risk&rdquo; crypto exchanges to protect customers. </p>\n<p>National Australia Bank (NAB) announced Monday that it had blocked some payments to &ldquo;high-risk&rdquo; crypto exchanges over the past few months to protect its customers.</p>\n<p>The lender said Australians lost around $151 million last year due to crypto-related scams. The NAB did not disclose which platforms it involved.</p>\nNAB Halts Millions in Payments Between March and July\n<p>In a statement, the NAB said it &ldquo;intervened&rdquo; in more than AU$270 million worth of payments which raised concerns over scams in the past four months between March and July.</p>\n<p>The bank said it introduced several measures to protect its customers from scams. Chris Sheehan, the NAB&rsquo;s Executive for Group Investigations and Fraud, said:</p>\n\n<p>Introducing payment prompts, taking action on spoofing and stopping the use of links in unexpected text messages are among key measures we&rsquo;ve introduced recently.</p>\n<p>We&rsquo;re now also taking action to block some payments to high-risk cryptocurrency exchanges in a further effort to stop scammers.</p>\n\n<p>He added:</p>\n\n<p>&ldquo;While many customers ultimately complete their payment after receiving a prompt, we&rsquo;re seeing around $290,000 worth of payments abandoned daily. This tells us that customers are taking the time to stop and think before they make a payment.</p>\n<p>While we&rsquo;re focused on making banking simple and digital, we&rsquo;ve added this extra friction to help alert customers to warning signs. We need to do everything we can to stop the crime before it happens.&rdquo;</p>\n\nAustralian Banks Become Stricter to Prevent Customers Falling Victim to Scams\n<p>The NAB joins the Commonwealth Bank of Australia to restrict customer payments to &ldquo;certain&rdquo; exchanges due to crypto-related scams.</p>\n<p>The NAB further said in its statement that almost 50% of scam funds reported to the Australian Financial Crimes Exchange were linked to crypto in a recent 30-day period.</p>\n<p>Mr Sheehan noted:</p>\n\n<p>These scammers are part of organized, transnational crime groups. Increasingly, we&rsquo;re seeing them use cryptocurrency platforms to send stolen funds quickly and often overseas.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-17T11:00:36.000Z",
    "title": "Justbit: Why Many Players Win or Lose at the Casino and How RTP Works",
    "url": "https://news.bitcoin.com/justbit-why-many-players-win-or-lose-at-the-casino-and-how-rtp-works/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/photo_2023-07-14_13-35-35-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/photo_2023-07-14_13-35-35-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/photo_2023-07-14_13-35-35-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/photo_2023-07-14_13-35-35-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/photo_2023-07-14_13-35-35-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/photo_2023-07-14_13-35-35-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/photo_2023-07-14_13-35-35-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/photo_2023-07-14_13-35-35.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The surge in online gaming platforms has marked a transformative era in the casino industry, providing gaming enthusiasts with the opportunity to experience their favorite games from the comfort of their homes. Amidst this digital revolution, JustBit emerges as a distinctive platform that has captivated a multitude of gamers with its extensive selection of games [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T11:01:30.000Z",
    "title": "Kalima Secures $10 Million Investment Commitment and Announces Private Sale and DEX Listing",
    "url": "https://www.cryptopolitan.com/kalima-secures-10-million-investment-commitment-and-announces-private-sale-and-dex-listing/",
    "description": "Dubai, United Arab Emirates, July 17th, 2023, Chainwire Delegated proof-of-stake blockchain Kalima has entered into an agreement with ABO Digital, a private alternative funding group based in the Bahamas and Dubai. This significant partnership involves a commitment of US$10 million into the French-based blockchain company. Kalima has also released details of its KLX token sale. ... <a title=\"Kalima Secures $10 Million Investment Commitment and Announces Private Sale and DEX Listing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kalima-secures-10-million-investment-commitment-and-announces-private-sale-and-dex-listing/\" aria-label=\"More on Kalima Secures $10 Million Investment Commitment and Announces Private Sale and DEX Listing\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T10:59:25.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T10:54:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T11:00:51.000Z",
    "title": "Kalima Secures $10 Million Investment Commitment and Announces Private Sale and DEX Listing",
    "url": "https://www.crypto-news-flash.com/kalima-secures-10-million-investment-commitment-and-announces-private-sale-and-dex-listing/?utm_source=rss&utm_medium=rss&utm_campaign=kalima-secures-10-million-investment-commitment-and-announces-private-sale-and-dex-listing",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Kalima2_1689336268PZjRljAPG7.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Kalima2_1689336268PZjRljAPG7.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Kalima2_1689336268PZjRljAPG7-300x180.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Kalima2_1689336268PZjRljAPG7-1024x614.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Kalima2_1689336268PZjRljAPG7-768x461.jpeg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Dubai, United Arab Emirates, July 17th, 2023, Chainwire Delegated proof-of-stake blockchain Kalima has entered into an agreement with ABO Digital, a private alternative funding group based in the Bahamas and Dubai. This significant partnership involves a commitment of US$10 million into the French-based blockchain company. Kalima has also released details of its KLX token sale. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-17T11:00:06.000Z",
    "title": "Upcoming Altcoin Cycle, Here’s What to Expect: A surge in MATIC and SPCT, Further Drops in ADA and DOT",
    "url": "https://www.crypto-news-flash.com/upcoming-altcoin-cycle-heres-what-to-expect-a-surge-in-matic-and-spct-further-drops-in-ada-and-dot/?utm_source=rss&utm_medium=rss&utm_campaign=upcoming-altcoin-cycle-heres-what-to-expect-a-surge-in-matic-and-spct-further-drops-in-ada-and-dot",
    "description": "<img width=\"512\" height=\"301\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T132849.547.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T132849.547.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-17T132849.547-300x176.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />After a promising June, many believe the altcoin season may be upon us. Altcoins offer an interesting and affordable alternative to the tried-and-tested Bitcoin (BTC) and Ethereum (ETH). Polygon (MATIC) and VC Spectra (SPCT) have been surging in price, while Cardano (ADA) and Polkadot (DOT) have pulled back. Let&#8217;s consider what to expect for each [...]"
  }
]