[
  {
    "source": "CoinDesk",
    "date": "2023-11-02T10:00:00.000Z",
    "title": "The Case Against Sam Bankman-Fried",
    "url": "https://www.coindesk.com/policy/2023/11/02/the-case-against-sam-bankman-fried/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Is Sam Bankman-Fried going to prison? Five weeks into his criminal trial, 12 randomly selected New Yorkers are preparing to discuss among themselves whether they believe he violated federal law or not."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-02T09:40:02.000Z",
    "title": "Revolut identified as the most crypto-friendly UK bank as 38% of crypto investors leave legacy banks – report",
    "url": "https://cryptoslate.com/revolut-identified-as-the-most-crypto-friendly-uk-bank-as-38-of-crypto-investors-leave-restrictive-legacy-banks/",
    "description": "<p>The UK government aims to establish London as a global blockchain hub. Yet, restrictive cryptocurrency policies implemented by major banks appear to contradict these ambitions, according to a recent report by crypto tax software provider Recap. The report reveals the risk-averse approach adopted by banks has led to blanket bans on crypto transactions, impacting businesses [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/revolut-identified-as-the-most-crypto-friendly-uk-bank-as-38-of-crypto-investors-leave-restrictive-legacy-banks/\">Revolut identified as the most crypto-friendly UK bank as 38% of crypto investors leave legacy banks &#8211; report</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-02T09:51:24.000Z",
    "title": "155-Year-Old Swiss Bank Enters Crypto Space with Bitcoin and Ether Trading Services",
    "url": "https://www.cryptoglobe.com/latest/2023/11/155-year-old-swiss-bank-enters-crypto-space-with-bitcoin-and-ether-trading-services/",
    "description": "Established in 1868, St.Galler Kantonalbank (SGKB) was created to serve the banking needs of the local residents and small to medium-sized enterprises within the Canton of St. Gallen, thereby bolstering the region’s economic development. SGKB has announced the introduction of cryptocurrency trading services, starting with Bitcoin and Ether. This initiative is a result of SGKB’s […]\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-02T09:45:08.000Z",
    "title": "Europe’s Bitcoin miner secures €575m debt financing from Tether",
    "url": "https://crypto.news/europes-bitcoin-miner-secures-e575m-debt-financing-from-tether/",
    "description": "Northern Data Group says the financing will strengthen its ability to invest in &#8220;the most sophisticated hardware available.&#8221; Northern Data AG, a German company focused on Bitcoin (BTC) mining, has secured a €575 million debt financing provided by stablecoin issuer&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-02T10:00:52.000Z",
    "title": "Solana Welcomes November With $40 Breach – Ready For A $50 Breakthrough?",
    "url": "https://www.newsbtc.com/news/solana-welcomes-november-with-40-breach-ready-for-a-50-breakthrough/",
    "description": "The first day of November marked an eventful moment in the cryptocurrency market as altcoins surged vigorously, led by impressive gains of Solana. This rally in Solana&#8217;s value set the tone for a day where altcoins gained significant traction. (Concurrently, Bitcoin experienced a late rally, breaching the $35,500 mark. This unexpected surge in Bitcoin not only solidified its position but also contributed to the overall bullish sentiment in the market.) The day&#8217;s dynamic movements highlighted the growing influence of altcoins, particularly Solana, showcasing their capacity to drive market trends. This collective push underscored a major shift in the crypto landscape, suggesting a broader diversification of investment interest beyond Bitcoin. Related Reading: XRP Hits $0.6 In Unstoppable Surge: How High Can It Go This November? Solana: Meteoric Rise And Resilience In The Crypto Market Solana&#8217;s recent strides in the market have been nothing short of spectacular, showcasing an astounding growth of over 80% in just a few short weeks. SOL demonstrated its bullish momentum by surging to approximately $42.30, as reported by Coingecko. With a circulating supply of 420 million SOL, Solana is valued at a market cap of around $17,685,464,775. Despite worries about its future following the bankruptcy of Alameda Research, a major investor in the Solana ecosystem, and Sam Bankman Fried&#8217;s FTX cryptocurrency exchange, Solana has surprised many observers by emerging as one of the best-performing assets, rising by more than 300% this year. According to recent data from CoinMarketCap at the beginning of November, the value of SOL experienced a notable increase over the course of the last 30 days. Specifically, SOL&#8217;s market valuation rose from $9.80 billion on October 2 to surpass $17 billion on Wednesday, resulting in a substantial addition of approximately $6 billion to its overall capitalization. Against a backdrop of positive indicators and having already reached a critical milestone of $40, the cryptocurrency Solana is poised to attain a noteworthy valuation of $50. The current rising trajectory of SOL&#8217;s value, which has experienced a roughly twofold increase in the past month, establishes a solid basis for the anticipated milestone, lending credibility to its feasibility and potential imminence. Related Reading: Solana Bull Run Could Smash Through $40 Barrier This Week – Here’s How SOLUSD currently trading at $42.64 on the daily chart: TradingView.com SOL&#8217;s Ascent Towards A Milestone And FTX&#8217;s Notable Asset Transactions Given its quick growth, it appears that this new objective is attainable, indicating that SOL may soon achieve this unprecedented level in the dynamic realm of digital currencies. Meanwhile, according to a recent disclosure made by Nansen, a blockchain analytics company, it has come to light that wallets associated with the bankrupt FTX engaged in transactions involving a significant amount of digital assets, amounting to around $156 million. FTX funds have continued to move to exchanges since our last update &#8211; 695K PERP $423K &#8211; 767K BICO $182K &#8211; 833K KNC $616K &#8211; 108M TRU $420K &#8211; 138K BAND $221K &#8211; 2.5M GRT $273K &#8211; 845 MKR $1.17M &#8211; 7.16M RNDR $17.8M &#8211; 10.5M USDC &#8211; 23k MATIC $15K &#8211; 9.5M REN $500K &#8211; 1.1M ETH $2M And&#8230; pic.twitter.com/UPKkJh3llq — Nansen 🧭 (@nansen_ai) October 31, 2023 These assets include Ethereum and Solana, and the transactions occurred during the previous week. Nansen&#8217;s report provides a comprehensive account of FTX&#8217;s action of unstaking almost 1.6 million SOL tokens, which were estimated to be worth around $57.6 million, on October 30th. These assets are presently kept in a staking wallet. The act of unstaking described here is a component of FTX&#8217;s money movement plan, which has resulted in a notable rise in the overall amount of SOL transferred, approaching the threshold of $90 million. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from foulline/Pixabay"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-02T10:02:42.000Z",
    "title": "These 4 Altcoins Will SURVIVE & THRIVE in the Crypto Bull Run",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/these-4-altcoins-will-survive-thrive-in-the-crypto-bull-run/",
    "description": "<p>Bear market on its last legs? Not so sure but 1 Bitcoin gained 27% Solana is up 72%, and Chainlink is up 44% since the start of October.  But it&#8217;s by no means &#8216;alt season&#8217; yet. So we still have an opportunity to buy alts that will explode in the coming bullrun.  In this article, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/these-4-altcoins-will-survive-thrive-in-the-crypto-bull-run/\">These 4 Altcoins Will SURVIVE &#038; THRIVE in the Crypto Bull Run</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]