[
  {
    "source": "Cointelegraph",
    "date": "2023-08-14T21:57:26.000Z",
    "title": "Celsius customers to vote on settlement plan with Fahrenheit after judge gives okay",
    "url": "https://cointelegraph.com/news/celsius-customers-vote-settlement-plan-with-fahrenheit-after-judge-gives-okay",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/5cc78e03-7564-4cc3-a7b0-af720d8c030c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The settlement was reached in July and, if the customers agree, it will go before the court for approval in October. </p>\n                    <p><p>Bankrupt crypto lender Celsius can start sending out ballots to its customers for a vote on a proposed settlement plan that would see a consortium called Fahrenheit buy Celsius’ assets and launch a new company. That company would distribute Celsius assets and equity in the new company to its customers. </p><p>Judge Martin Glenn of the Southern District of New York bankruptcy court <a href=\"https://ecf.nysb.uscourts.gov/cgi-bin/show_temp.pl?file=file0.0397274059682502.pdf&amp;type=application/pdf\" target=\"_blank\" rel=\"noopener nofollow\">approved</a> a motion to <a href=\"https://cointelegraph.com/news/celsius-network-reaches-settlements-exit-bankruptcy\">allow Celsius customers to vote on a settlement</a> of class claims to reimburse participants in Celsius’ Earn program, as well as to increase customers’ recoveries by 5% to resolve claims concerning fraud  and misrepresentation by Celsius management.</p><p>According to Bloomberg, the asset distribution would be worth about $2 billion. It added that Glenn additionally instructed Celsius to provide a “plain language” explanation of the settlement and material on crypto volatility and challenges Celsius’ mining operations could face. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/celsius-seeks-to-convert-alts-to-bitcoin-and-ether-under-reorganization-plan\">Celsius seeks to convert alts to Bitcoin and Ether under reorganization plan</a></em></strong></p><p>Customers have to opt out of the settlement in order not to participate. Celsius lawyer Chris Koenig was quoted by Bloomberg as saying disbursements could begin before the end of the year.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/657c5f6a-53ae-473f-a038-a94fc48d100e.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Judge Glenn's Aug. 14 order. Source: Southern District of New York Bankruptcy Court</em></figcaption></figure><p>If approved, the plan will still require court approval, which could come in October. </p><p>Fahrenheit <a href=\"https://cointelegraph.com/news/fahrenheit-wins-bid-to-acquire-assets-of-crypto-lender-celsius\">won an auction for Celsius</a> assets on May 25. Part of the offer was a promise for US Bitcoin Corp., one of the consortium members, to construct a new 100-megawatt crypto mining plant. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/CELSIUS?src=hash&amp;ref_src=twsrc%5Etfw\">#CELSIUS</a> HEARING LIVE: <a href=\"https://twitter.com/hashtag/SEC?src=hash&amp;ref_src=twsrc%5Etfw\">#SEC</a> making their appearance for the record. K&amp;E giving an update on disclosure statement objections. UST &amp; debtors will move objections to confirmation statements. Earn Ad Hoc amended reservation of rights. K&amp;E say <a href=\"https://twitter.com/search?q=%24CEL&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$CEL</a> should not be a disclosure issue.</p>&mdash; Simon Dixon (@SimonDixonTwitt) <a href=\"https://twitter.com/SimonDixonTwitt/status/1691090741030981633?ref_src=twsrc%5Etfw\">August 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Celsius halted withdrawals on June 13, 2022, in the wake of the collapse of the Terra ecosystem and <a href=\"https://cointelegraph.com/news/breaking-celsius-is-reportedly-filing-for-bankruptcy-imminently\">filed for bankruptcy in July</a> of that year. Since then, former CEO Alex Mashinsky has been arrested for fraud. Last month, the United States Securities and Exchange Commission <a href=\"https://cointelegraph.com/news/celsius-alex-mashinsky-us-sec-files-lawsuit-against-celsius-and-alex-mashinsky-report\">filed suit against Mashinsky</a> and other Celsius executives and the U.S. Federal Trade Commission <a href=\"https://cointelegraph.com/news/celsius-network-fined-billions-by-ftc\">issued $4.7 billion in fines</a> against the company last month. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-og-simon-dixon-bankruptcies-elon-musk-crypto-twitter-hall-of-flame/\">Simon Dixon on bankruptcies, Celsius and Elon Musk: Crypto Twitter Hall of Flame</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-14T22:00:31.000Z",
    "title": "Decline in crypto-margined futures may signal market maturity",
    "url": "https://cryptoslate.com/decline-in-crypto-margined-futures-may-signal-market-maturity/",
    "description": "<p>Bitcoin futures are financial derivatives, essentially agreements to buy or sell Bitcoin at a predetermined price at a specific date. These offer a way for traders to speculate on the future price of Bitcoin. Open interest refers to the total number of outstanding futures contracts that have not been settled. Futures contracts can be collateralized [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/decline-in-crypto-margined-futures-may-signal-market-maturity/\">Decline in crypto-margined futures may signal market maturity</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-14T22:03:05.000Z",
    "title": "Go!Labs Empowers Global Change Through AI-Powered Engagement and Community Challenges",
    "url": "https://cryptodaily.co.uk/2023/08/golabs-empowers-global-change-through-ai-powered-engagement-and-community-challenges",
    "description": "<p>Singapore, Singapore, August 14th, 2023, Chainwire</p><p class=\"ql-align-justify\">The Go! Initiative stands at the forefront of AI-powered weekly global competitions, poised to drive substantial global impact. Leveraging advanced AI technology, their weekly global competitions transcend traditional boundaries, uniting a diverse global community in a shared pursuit of positive change. Each week, participants are presented with captivating challenges that encourage social, environmental, and personal betterment. Through these dynamic competitions, Go! not only showcases the transformative potential of AI but also empowers individuals worldwide to contribute to meaningful causes, fostering a collective movement toward a brighter and more sustainable future.</p><p class=\"ql-align-justify\">Dive right into the future of engaging impact experiences. One can kickstart their journey on Twitter and further immerse in the ecosystem by engaging in conversations on Discord. The experience isn&rsquo;t just pioneering an impact revolution; it&rsquo;s shaping the next era of Web3, intertwining thrilling real-life experiences with significant global impact in the multi-billion-dollar ESG market.</p><p class=\"ql-align-justify\">Fueled by the convergence of blockchain, generative AI, and an AI Copilot, Go! offers an immersive on-chain experience, backed by RWA (Real-World Assets). These assets guarantee tangible and verifiable value to every in-game achievement and token, transforming virtual wins into real-world impacts.</p><p class=\"ql-align-justify\">SmartChain: The Web3 System supporting Go!</p><p class=\"ql-align-justify\">Developed by Go! Labs, SmartChain integrates Layer 1 AI-optimized zkEVM tech, paving the way for a more performant and eco-efficient system. This results in superior on-chain experiences, minimized gas fees, and a sustainable ecosystem. The introduction of DePIN ensures that user interactions are not just fast, but also secure, private, and tailored, revolutionizing the blockchain realm.</p><p class=\"ql-align-justify\">Engage, Earn &amp; Empower</p><ul><li class=\"ql-align-justify\">Harness the Potential of AI: Through an innovative AI Copilot, participants are guided toward meaningful interactions that lead to remarkable rewards. By delving into genuine engagements, individuals can unlock unique experiences that empower them on a global scale.</li><li class=\"ql-align-justify\">Community-Centric Challenges and Recognition: The platform offers community-centered challenges that resonate with participants' shared values. As contributors distinguish themselves through impactful actions, they gain access to exclusive $HLTHY tokens, solidifying their role as catalysts for positive change. The engagement journey not only fosters growth but also fosters a tangible impact backed by Real-World Assets (RWA), aligning personal achievements with a greater purpose.</li></ul><p class=\"ql-align-justify\">Validators and Shaping the Web3 Future</p><p class=\"ql-align-justify\">Go! Labs is also scouting for skilled validators for SmartChain. If you&rsquo;re equipped to influence the future of blockchain and Web3, dive into the tech specifics, onboarding processes, and research documents here. Visit https://goplatform.io to learn more.</p><p class=\"ql-align-justify\">Join, Play, Transform</p><p class=\"ql-align-justify\">Embark on a journey that fuses global health, impact, and next-gen Web3 tech with Go! Stay updated on Twitter and partake in weekly global health competitions on their Discord under &ldquo;Events.&rdquo;</p><p class=\"ql-align-justify\">About Go! Labs</p><p class=\"ql-align-justify\">Go! Labs is a group of experienced industry professionals working towards improving the quality of life on a global scale. Supported by notable industry VCs with an established distribution network and a solid user base, Go! Labs are working on financial inclusion, data monetization, climate concerns, healthcare revolution, and web3 innovation. To learn more about Go! Labs and their work, visit https://www.goplatform.io/.</p>ContactGo! Labs TeamGo! Labshello@goplatform.io"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T22:10:40.000Z",
    "title": "BRICS potential: Experts suggest it could rival G7 soon",
    "url": "https://www.cryptopolitan.com/experts-suggest-brics-could-rival-g7-soon/",
    "description": "The narrative of global economic leadership is shifting. BRICS, an amalgamation of burgeoning economies that once stood on the fringes of global economic discourse, now stands toe-to-toe with the world&#8217;s economic heavyweights. Representing over a quarter of the world’s GDP, there&#8217;s rising speculation that BRICS could soon be the G7&#8217;s fiercest competitor. An Unprecedented Economic ... <a title=\"BRICS potential: Experts suggest it could rival G7 soon\" class=\"read-more\" href=\"https://www.cryptopolitan.com/experts-suggest-brics-could-rival-g7-soon/\" aria-label=\"More on BRICS potential: Experts suggest it could rival G7 soon\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T22:07:25.000Z",
    "title": "Challenges and Considerations in Training Large Language Models (LLMs)",
    "url": "https://www.cryptopolitan.com/challenges-and-language-models-llms/",
    "description": "Training large language models (LLMs) like GPT-4, GPT-NeoX, PaLM, OPT, and Macaw presents formidable challenges. These breakthroughs in machine learning have gained substantial attention, with OpenAI&#8217;s GPT-4 in the spotlight. The journey to developing such models involves surmounting obstacles related to data, hardware, and legal aspects, often requiring the resources of large organizations. Unveiling LLM ... <a title=\"Challenges and Considerations in Training Large Language Models (LLMs)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/challenges-and-language-models-llms/\" aria-label=\"More on Challenges and Considerations in Training Large Language Models (LLMs)\">Read more</a>"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-14T22:01:40.000Z",
    "title": "Coinbase Says Canada Is Its Next ‘Go Deep Market’ As Crypto Exchange Announces New Expansion",
    "url": "https://dailyhodl.com/2023/08/14/coinbase-says-canada-is-its-next-go-deep-market-as-crypto-exchange-announces-new-expansion/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/coinbase-issuing-unregistered.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/coinbase-issuing-unregistered.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/coinbase-issuing-unregistered.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/coinbase-issuing-unregistered.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/coinbase-issuing-unregistered.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/coinbase-issuing-unregistered.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/coinbase-issuing-unregistered.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>US-based crypto exchange giant Coinbase is announcing its official expansion into the market of North America&#8217;s second-largest economy. In a new blog post, Coinbase announces its official launch in Canada while promoting a premium trial program for new Canadian customers. &#8220;Coinbase announces its official entry into the Canadian market, backed by the integration of Interac [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/14/coinbase-says-canada-is-its-next-go-deep-market-as-crypto-exchange-announces-new-expansion/\">Coinbase Says Canada Is Its Next ‘Go Deep Market’ As Crypto Exchange Announces New Expansion</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]