[
  {
    "source": "Cointelegraph",
    "date": "2023-07-06T18:30:51.000Z",
    "title": "Sam Bankman-Fried backed out of FTX sponsorship deal with Taylor Swift: Report",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-backed-out-ftx-sponsorship-deal-taylor-swift",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/c468ad7a-d91a-4cb7-bbac-471c78e6c948.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The report contradicts the narrative from many media outlets that Taylor Swift’s team had done their due diligence in considering the FTX deal before pulling out.</p>\n                    <p><p>The sponsorship deal between defunct cryptocurrency exchange FTX and Taylor Swift was reportedly called off at the request of former CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a> (SBF), and not the singer-songwriter as many reports have suggested.</p><p>According to a July 6 report from the New York Times citing three individuals with knowledge of the sponsorship deal, Sam Bankman-Fried <a href=\"https://www.nytimes.com/2023/07/06/technology/tom-brady-crypto-ftx.html\" target=\"_blank\" rel=\"noopener nofollow\">was</a> the one responsible for dropping a roughly $100-million agreement with Swift prior to FTX filing for bankruptcy. Swift’s team had reportedly signed the agreement after more than six months of negotiations, but were frustrated and disappointed when SBF pulled the plug.</p><p>The report contradicts the narrative from many media outlets that Swift’s team had done their due diligence in considering the FTX deal before pulling out on their end. Celebrities including football star Tom Brady, NBA point guard Stephen Curry and other high profile figures have faced legal scrutiny in the wake of the exchange’s collapse, with some <a href=\"https://cointelegraph.com/news/tom-brady-and-other-celebrities-named-in-class-action-lawsuit-against-ftx\">named in class-action lawsuits</a> filed by disgruntled FTX investors.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Please go back and delete all your tweets about how &quot;Taylor Swift is better at due diligence than tech bros&quot;</p>&mdash; Joe Weisenthal (@TheStalwart) <a href=\"https://twitter.com/TheStalwart/status/1676936398526464000?ref_src=twsrc%5Etfw\">July 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/celebs-who-got-burned-endorsing-crypto-and-those-that-got-away-with-it\"><strong><em>Celebs who got burned endorsing crypto and those that got away with it</em></strong></a></p><p>Prior to news of the potential FTX deal, Swift was largely absent from the crypto space. However, the singer knows the power of owning one’s own data — or, in her case, music. She famously re-recorded and re-released many of her own albums in 2021 following a dispute with one of her old labels.</p><p>Bankman-Fried’s <a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-two-criminal-trials\">first criminal trial</a> for his alleged role in fraud at FTX is scheduled to begin in October. The crypto exchange’s bankruptcy case is also ongoing in the District of Delaware.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-06T18:26:04.000Z",
    "title": "Why is Bitcoin price down today? ",
    "url": "https://cointelegraph.com/news/why-is-bitcoin-price-down-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2022-11/d3605b6b-0eff-46f6-a46f-b15ec3b3ecbe.jpeg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price quickly reversed course today after hitting a 2023 high. Cointelegraph investigates why.  </p>\n                    <p><p>The bullish momentum that propelled Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price to a 2023 <a href=\"https://cointelegraph.com/news/bitcoin-hits-new-yearly-highs-btc-price-rebounds\">high over $31,500</a> on July 6, vanished after investors’ concerns of potential rate hikes resurfaced. </p><p>The contraction in Bitcoin price briefly sent<a href=\"https://cointelegraph.com/news/btc-price-dips-below-30-k-bitcoin-daily-candle-turns-sour\"> BTC below</a> $30,000 and on top of the renewed worries, traders are concerned that Bitcoin <a href=\"https://cointelegraph.com/news/btc-miners-millions-crypto-exchanges-5-things-bitcoin\">miners sending BTC to exchanges</a> could be a sign of an impending sell-off. </p><p>Let’s take a closer look at the factors impacting Bitcoin price today.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\"><strong><em>Should you ‘orange pill’ children? The case for Bitcoin kids books</em></strong></a></p><h2>Will the Federal Reserve restart interest rate hikes?</h2><p>Despite the Federal Reserve pausing interest rate increases on June 14, Fed chair Jerome Powell seems committed to reducing inflation by restarting rate hikes.</p><p>After Powell’s Federal Open Markets Committee (FOMC) speech on June 14, the market seemed to confidently believe that the Fed would begin increasing interest rates again. CME’s FedWatch <a href=\"https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html\" target=\"_blank\" rel=\"noopener nofollow\">tool</a> shows the market's belief that such increases are coming at the next FOMC meeting on July 26. As of July 6, the probability of interest rate hikes sits at 92.4%. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/3dbc5b9e-f089-4e1b-9e92-ade1f323a60a.png\"  /><figcaption style=\"text-align: center;\">Target interest rate probabilities. Source: CME Group</figcaption></figure><p>To date, crypto prices are still highly correlated with the Dow and S&amp;P 500 and most major banks still expect the U.S. to experience a sharp recession at some point in 2023. </p><p>According to U.S. Bank analysis which incorporates more than 1,000 data points, investor sentiment about the current state of the economy remains low.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/cd32db09-67c4-4429-921c-58949dd1cce1.png\"  /><figcaption style=\"text-align: center;\"><em>Global economic health. Source: U.S. Bank</em></figcaption></figure><p>According to U.S. Bank analysis, </p><blockquote>“Persistent inflation, elevated interest rates and uncertainty over the pace of earnings growth in 2023 remain headwinds to advancing equity prices. Although the pace of inflation is waning, the Fed is becoming less hawkish and earnings projections have stabilized.”</blockquote><h2>US-led regulatory pressure against crypto exchanges continues to impact markets </h2><p>Despite the recent wave of institutional interest in Bitcoin, the actions of U.S. regulators is still seen as unknown. On July 5, Larry Fink, the CEO BlackRock suggested that Bitcoin is digital gold and he briefly spoke about the firm's <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-filing-coinbase-surveillance-partner\">recent Bitcoin ETF application</a>.</p><p>While countries like <a href=\"https://cointelegraph.com/news/web-3-crypto-u-s-regulatory-uncertainty-could-be-hong-kong-s-gain-yat-siu\">Hong Kong</a> and the <a href=\"https://cointelegraph.com/news/uae-emerges-as-a-pro-bitcoin-mining-destination-in-the-middle-east\">United Arab Emirates</a> are embracing Bitcoin, on June 5 and June 6, the United States Securities and Exchange Commission filed civil lawsuits against two of the largest centralized exchanges in crypto, <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">Binance</a> and <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">Coinbase</a>. The action has led to Binance.US seeing <a href=\"https://cointelegraph.com/news/binance-us-market-share-drops-amid-regulatory-lawsuit-report\">market share drop</a> from 22% to under 1%. </p><p>While the SEC has previously noted Bitcoin is not a security, some market analysts are weighing if the current increase in actions is a renewed attempt for the <a href=\"https://cointelegraph.com/news/binance-v-sec-crypto-industry-debates-tai-chi-vs-operation-chokepoint-2\">Operation Chokepoint 2.0</a> initiative which aims to restrict access to all digital currencies. </p><p>Coinbase may have a pending lawsuit but ETFs, <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-filing-coinbase-surveillance-partner\">including BlackRock</a> and Valkyrie are listing Coinbase as their <a href=\"https://cointelegraph.com/news/nasdaq-refiles-valkyrie-spot-bitcoin-etf-coinbase-surveillance-partner\">required surveillance partner</a>. Coinbase has filed a lawsuit against the SEC for clarity and the SEC is <a href=\"https://cointelegraph.com/news/coinbase-sec-to-present-response-to-coinbase-s-legal-defense-on-july-13\">expected to respond</a> by July 13.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cex-crypto-trading-hits-2-7t-june-amid-sec-lawsuits-blackrock-etf-filing\"><strong><em>CEX crypto trading hits $2.7T in June amid SEC lawsuits, BlackRock Bitcoin ETF filing</em></strong></a></p><p>While some commentators are excited about the prospect of Bitcoin ETFs, not all analysts agree that the structure is healthy for Bitcoin price, <a href=\"https://cointelegraph.com/news/bitcoin-etfs-even-worse-for-crypto-than-central-exchanges\">noting “paper BTC”</a> concerns. </p><h2>Can Bitcoin price reverse course? </h2><p>The short-term uncertainty in the crypto market does not appear to have changed institutional investors' long-term outlook. Recently, despite a hostile U.S. regulatory environment, large institutions are pushing for <a href=\"https://cointelegraph.com/news/is-this-the-start-of-the-next-bull-run\">Bitcoin financial instruments</a> which may spark a bull run.</p><p>Bitcoin price continues to be directly impacted by macroeconomic events, and it is also likely that further regulatory actions and interest rate hikes will continue having some effect on BTC price. </p><p>In the long term, market participants still expect the price of Bitcoin to recover, especially as more financial institutions are seemingly embracing BTC. </p><p class=\"post-content__disclaimer\">The views and opinions expressed here are solely those of the author and do not necessarily reflect the views of Cointelegraph.com. Every investment and trading move involves risk, you should conduct your own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-06T18:10:16.000Z",
    "title": "US Homeland Security returns $314K from 2016 Bitfinex hack",
    "url": "https://cointelegraph.com/news/us-homeland-security-returns-314k-from-2016-bitfinex-hack",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/1fded7e6-2052-4067-8e3e-38a92946e614.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The funds were seized by U.S. Customs and Border Protection. Recovery efforts for the remaining funds are ongoing.</p>\n                    <p><p>Via a July 6 announcement, cryptocurrency exchange Bitfinex <a href=\"https://blog.bitfinex.com/media-releases/bitfinex-announces-return-of-seized-property-to-rrt-holders/\" target=\"_blank\" rel=\"noopener nofollow\">says</a> it has received $312,219.71 in cash and 6.917 in Bitcoin Cash (<a href=\"https://cointelegraph.com/bitcoin-cash-price-index\">BCH</a>) from the United States Department of Homeland Security. The seizure was conducted in cooperation with U.S. Customs and Border Protection. According to Bitfinex staff:</p><blockquote>“This is part of Bitfinex’s ongoing efforts, working with law enforcement and other investigation agencies, to recover assets stolen from the exchange in August 2016. The U.S. government continues to make progress in prosecuting individuals involved in the Bitfinex security breach and in seizing funds associated with the theft.\"</blockquote><p>The assets will be returned on a pro-rated basis to victims of the 2016 Bitfinex hack. Shortly after the security breach, Bitfinex issued Recovery Rights Tokens (RRTs) with a par value of $1 each. There are currently 30 million RRTs in circulation. After redemption of RRTs with recovered assets, the remainder will be paid to token holders of Unus Sed Leo (<a href=\"https://cointelegraph.com/leo-price-index\">LEO</a>), Bitfinex’s native token.</p><p>In 2016, Bitfinex suffered a security breach resulting in the loss of 119,576 customers' Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), worth around $70 million at the time and $3.7 billion now. On Feb. 8, 2022, the U.S. Department of Justice <a href=\"https://cointelegraph.com/news/doj-seizes-3-6b-in-crypto-and-arrests-two-in-connection-with-2016-bitfinex-hack\">arrested two individuals</a>, Ilya Lichtenstein and his wife, Heather Morgan, for allegedly conspiring to launder crypto connected to the hack. Special agents were then able to seize more than 94,000 stolen BTC from Morgan and Lichtenstein after a search warrant allowed them to view files containing private keys to the wallet the suspects owned. Recovery efforts for the funds are still ongoing. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-exchange-hacks/\">Report on Crypto 2011-2020 Exchange Hacks</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-06T18:34:34.000Z",
    "title": "Is the UK heading towards a sovereign debt crisis?",
    "url": "https://cryptoslate.com/insights/is-the-u-k-heading-towards-a-sovereign-debt-crisis/",
    "description": "<p>Quick Take The United Kingdom is currently facing a challenging financial environment as its household and government debt levels rise alarmingly. Household debt has skyrocketed, reaching 200% of the country&#8217;s Gross Domestic Product (GDP), while the government debt has equally grown, constituting 100% of GDP. The impending threat of interest rate hikes makes these soaring [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/is-the-u-k-heading-towards-a-sovereign-debt-crisis/\">Is the UK heading towards a sovereign debt crisis?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-06T18:20:24.000Z",
    "title": "Nayms Issues World’s First Crypto-Denominated Industry Loss Warranty (ILW)",
    "url": "https://www.cryptoglobe.com/latest/2023/07/nayms-issues-worlds-first-crypto-denominated-industry-loss-warranty-ilw/",
    "description": "London, United Kingdom, July 6th, 2023, Chainwire Nayms SAC Ltd., the leading crypto-native insurance marketplace, is proud to announce issuing the world’s first crypto-denominated industry loss warranty (ILW) through the second segregated account or ‘cell’ within its marketplace. This type of instrument is index-based and used for providing retrocessional reinsurance protection to property reinsurers. In […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-06T18:30:00.000Z",
    "title": "Pepe (PEPE) Hype Dies Down as Uwerx (WERX) Gains Momentum",
    "url": "https://cryptodaily.co.uk/2023/07/pepe-pepe-hype-dies-down-as-uwerx-werx-gains-momentum",
    "description": "<p>Memecoins had a heavy rally in the past few weeks, and it felt like the 2021 bull season again. But the excitement was short-lived, as most new memecoins that emerged in that timeframe have gone back to oblivion, but there&rsquo;s Pepe (PEPE) with some exciting narratives working in its favor. While the memecoin hype dies down, Uwerx also has taken center stage in the market with impressive presale rounds. &nbsp;</p>\n<p>Read on to learn the potential it has to grow massive and how you can take advantage of the presale for profit:</p>\nPepe (PEPE) Hype Train is Down\n<p>Pepe (PEPE) is impressive as a new memecoin considering the rallying strength it exhibited in just some weeks after emerging. PEPE moved to become a $1.8 billion market cap project in just two weeks, but the hype train is dying. There&rsquo;s only so much a project can do in a bear market, and PEPE holders can now wait for the bull market to launch another full-blown rally.</p>\n<p>The Pepe (PEPE) community is growing, and in the past few weeks, the memecoin craze has been shipped to other blockchain networks, including Bitcoin (BTC), which is fairly new to memecoins. Pepe as a meme had existed way before it got a derived cryptocurrency, but now crypto enthusiasts are confident that it can flip Dogecoin (DOGE) and Shiba Inu (SHIB) to become the biggest memecoin in the market.</p>\n<p>Pepe (PEPE) has fallen to around $600 million market cap, and with the prospects of passing Dogecoin ($10 million market cap) and Shiba Inu ($5 billion market cap), that&rsquo;s some 10x - 20x potential to look forward to. We could see such happen in a bull market considering Shiba Inu(SHIB) once pulled it off against Dogecoin (DOGE).</p>\n<p>However, memecoins always remain a risky play, and if you want to get a crypto asset with less risk, then you should be learning more about Uwerx.</p>\nUwerx (WERX) Gaining Momentum on Presale\n<p>Uwerx is a decentralized freelance platform looking to help democratize the freelance economy and create more value for active participants, including freelancers, clients, and other businesses worldwide that find the global gig market valuable. A report from Forbes has shown top companies like Google, Meta, and Unilever were able to create workforce synergy between full-time employees and freelancers, and the results were impressive. </p>\n<p>With this level of attention coming to the gig market, Uwerx might just be the most valuable solution the landscape has seen. For a start, Uwerx charges only 1% on contracts established on the platform. Uwerx also enables a host of blockchain-enabled features like incentivization, community governance, transparent pricing, personalized matching, and some special collaboration tools.</p>\n<p>Uwerx is a Web3 platform but will be as intuitive as any existing freelance platform. WERX will be the native token of the platform and will power utility and governance. WERX is selling for cheap on presale at $0.047725, and this opportunity only lasts for a short while.</p>\n<p>This week, a presale is launching a fully interactive prototype, which will include registration pages for freelancers and clients. Moreover, the much-anticipated feature, the Uwerx Vault, is set to be revealed next week. To decide the date for the test airdrop, a poll will be carried out.</p>\n<p>Take the opportunity to join the WERX presale with the links below and enjoy a 15% bonus on your purchase.</p>\n<p class=\"s10\">Presale: invest.uwerx.network</p>\n<p class=\"s10\">Telegram: https://t.me/uwerx_network</p>\n<p class=\"s10\">Twitter: https://twitter.com/uwerx_network</p>\n<p class=\"s10\">Website: https://www.uwerx.network</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-06T18:30:00.000Z",
    "title": "Gemini Dollar Vs Tether (USDT): Tradecurve Receives Bullish Rating, Is A 40% Price Rise On The Cards?",
    "url": "https://cryptodaily.co.uk/2023/07/gemini-dollar-vs-tether-usdt-tradecurve-receives-bullish-rating-is-a-40-price-rise-on-the-cards",
    "description": "<p>Gemini Dollar and Tether are two of the world's most popular stablecoins. Both have gained traction during the recent banking crisis, in which several high-profile banks collapsed. However, their reliance on the U.S. dollar could potentially cause issues in the future. If inflation continues to rise throughout financial markets, both Gemini Dollar and Tether could struggle in the DeFi space.&nbsp;</p>\n<p>At the same time, new projects like Tradecurve are making waves in the DeFi space. Tradecurve has raised $3 million during its presale, and following an 80% surge in value, analysts now believe that an additional 40% price rise could be on the table.&nbsp;</p>\n<p></p>\nTether Makes A Huge Investment In Bitcoin Mining&nbsp;\n<p>As the world's number one most traded cryptocurrency, Tether is considered an extremely safe crypto investment. The project recently invested $1 billion into a new Bitcoin mining farm in El Salvador.&nbsp;</p>\n<p>This investment is designed to help create an eco-friendly mining solution, with Tether offering expertise in green energy alternatives. This particular farm will utilize Volcano energy to produce 241 MW of power and will also install photovoltaic cells to produce solar energy.&nbsp;</p>\n<p>This investment is a huge development in the Tether ecosystem, and has helped to solidify the project's reputation. As Tether continues to invest in DeFi, its popularity is only going to grow, which has made Tether the number one option for investors looking to buy stablecoins,&nbsp;</p>\n<p></p>\nGemini Dollar Trading Volume Surges&nbsp;\n<p>Gemini Dollar is an alternative to Tether with a number of benefits. It&rsquo;s been approved by the New York Department of Financial Services, which makes it a safe investment despite the recent SEC lawsuits. Furthermore, Gemini Dollar has been audited by Trail of Bits Inc.&nbsp;</p>\n<p>Gemini Dollar is also a stable investment due to being pegged to the U.S. Dollar. As of July 2023, Gemini Dollar has a daily trading volume of $1.8 million, a significant increase from June. This increase suggests that more investors are looking for stable investments, with Gemini Dollar becoming a top option in the process.&nbsp;</p>\nTradecurve Attracts Thousands Of New Investors&nbsp;\n<p>Although Tradecurve may not be as stable as Gemini Dollar or Tether, the project offers significantly higher returns. Since its presale started, Tradecurve has raised over $3 million and offered investors returns of 80%. This ROI is expected to increase again soon, with stage four of the Tradecurve (TCRV) presale already 60% sold out.&nbsp;</p>\n<p>Tradecurve offers an exciting new alternative to traditional investing. Its hybrid exchange lets investors buy the widest range of assets of any platform, including traditional and DeFi options. Assets such as commodities, forex, and CFDs can be traded by investors who can use cryptocurrency as collateral.&nbsp;</p>\n<p>Furthermore, as a decentralized platform, all of these assets can be traded anonymously. Tradecurve lets investors trade assets without needing to pass KYC or intrusive background checks. This is expected to be a big selling point for the project, as thousands of investors left centralized platforms following lawsuits from the SEC in June.&nbsp;</p>\n<p></p>\nTradecurve Is Predicted To 100x Post Presale\n<p>Tradecurve is now ranked among the fastest-growing cryptocurrencies in the DeFi market. Its value has continuously increased in June, and now experts believe its value could 50x before its presale ends. Post presale, price predictions are going as high as 100x once TCRV tokens are listed on major exchanges.&nbsp;</p>\n<p>With such high price predictions, Tradecurve&rsquo;s current price of $0.018 is believed to be a huge bargain, though, with hundreds of investors buying tokens daily, TCRV is expected to increase in value again before mid-July.&nbsp;</p>\n<p>To find more information about Tradecurve and the TCRV token, visit the links below:</p>\n<p>Website: https://tradecurve.io/&nbsp;</p>\n<p>Buy presale: https://app.tradecurve.io/sign-up&nbsp;</p>\n<p>Twitter: https://twitter.com/Tradecurveapp&nbsp;</p>\n<p>Telegram: https://t.me/tradecurve_official</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T18:14:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-06T18:29:26.000Z",
    "title": "Israel’s parliament moves forward with crypto tax exemption for foreigners",
    "url": "https://crypto.news/israels-parliament-moves-forward-with-crypto-tax-exemption-for-foreigners/",
    "description": "On June 5, a bill proposing exemptions from capital gains taxes on the sale of digital currencies in Israel passed the preliminary reading in the country's parliament, the Knesset"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-06T18:30:55.000Z",
    "title": "Glassnode Co-Founder Predicts Bull Run For Bitcoin Amidst Sideways Trading",
    "url": "https://www.newsbtc.com/bitcoin-news/glassnode-co-founder-predicts-bull-run-for-bitcoin-amidst-sideways-trading/",
    "description": "Bitcoin (BTC) has been trading within a narrow range for the past 12 days. Nonetheless, the fact that bulls have held the crucial $30,000 support level is seen as a short-term win for them. Even though BTC has been experiencing sideways trading, there is a growing sense of optimism that it has the potential to break through upper resistance zones and reach new highs.  BTC’s Sideways Trading Sets Stage For Bullish Momentum?  According to Yan Alleman, the co-founder of blockchain analytics firm Glassnode, Bitcoin&#8217;s recent sideways trading has paved the way for potential bullish momentum shortly. BTC&#8217;s current range-bound trading between $31,200 and $29,600 is seen as a consolidation period allowing for a re-establishment of bullish momentum in the market. To assess market sentiment and potential price movements in the Bitcoin market, Glassnode has developed a proprietary metric called the Swissblock Risk Signal. This metric considers various factors, including volatility, on-chain activity, social sentiment, and more. Related Reading: CFTC Investigators Conclude Celsius And Former CEO Violated Rules, Potential Case Looms In the context of Alleman&#8217;s analysis, the Swissblock Risk Signal has remained stable at 0, as seen in the chart below, which suggests that the current market sentiment is neutral, with no clear dominance from either buyers or sellers.  This could indicate that the market is in a consolidation phase, as buyers and sellers are cautious before making any significant moves. Additionally, Alleman predicts that BTC will likely break above $31,200, providing a strong foundation for buyers to target resistance levels at $33,000 and $34,800. However, even if the support at $29,600 were to break, Alleman believes that remaining bullish until the 50% retracement level near $28,200 seems viable. This pullback could represent an opportunity for investors to accumulate BTC for the next leap as the market shows signs of potential growth. As such, Alleman&#8217;s analysis suggests that the current market conditions present a favorable opportunity for those looking to invest in Bitcoin. Bitcoin Faces Critical Moment Bitcoin is facing a critical moment as its price fluctuates within a narrow range, warns market analyst Michael Van de Poppe. With Bitcoin&#8217;s lows being taken again, Van de Poppe believes that if it fails to recover soon, it could test support at $28,500. Adding to Bitcoin&#8217;s challenges is the expectation of a rate hike due to positive unemployment data. This leads to increased speculation that the Federal Reserve will raise interest rates sooner than expected. This could create a more challenging economic environment for cryptocurrencies. If both major resistance lines of $29,600 and $28,500 give in to pressure, a potential bull run in the short term could be in danger, potentially resulting in a retracement down to the $27,500 resistance level. This would represent a 9% pullback from the current level of $30,200. Related Reading: Marathon Digital Reports 21% Decline In Bitcoin Production In June If such a scenario were to occur, it could take time for Bitcoin bulls to regain their current levels. In the past, a period of consolidation has typically followed a pullback before any further continuation to regain lost levels. However, despite Bitcoin&#8217;s challenges, as long as it can hold the $30,000 line, BTC bulls have the upper hand. At the time of writing, BTC is trading at $30,200, down a slight 0.3% in the last 24 hours. Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-06T18:31:18.000Z",
    "title": "Tether Launches USDt on Kava",
    "url": "https://dailyhodl.com/2023/07/06/tether-launches-usdt-on-kava/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>July 6, 2023 – Cayman Islands, Cayman Islands Native USDt unlocked on Cosmos. Tether&#8217;s USDt, the world&#8217;s most liquid, secure and transparent stablecoin, has successfully launched on Cosmos via Kava, marking a significant milestone in the expansion of the Cosmos DeFi ecosystem. The integration of Tether&#8217;s USDt on Kava makes deep stablecoin liquidity across Cosmos’ [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/06/tether-launches-usdt-on-kava/\">Tether Launches USDt on Kava</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]