[
  {
    "source": "Bitcoin.com",
    "date": "2023-08-08T09:30:42.000Z",
    "title": "Senator Calls for Audit on Palau’s Ripple-Backed Stablecoin Pilot Program",
    "url": "https://news.bitcoin.com/senator-calls-for-audit-on-palaus-ripple-backed-stablecoin-pilot-program/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1479487709-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Senator Calls for Audit on Ripple-Backed Palau&#039;s Stablecoin Pilot Program\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1479487709-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1479487709-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1479487709-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1479487709-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1479487709-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1479487709-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1479487709.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Palauan senator Mark Rudimch has called for an audit of Palau&#8217;s stablecoin pilot program, launched by the country&#8217;s ministry of finance in partnership with Ripple in July. In a letter sent to the public auditor Satrunino Tewid, Rudimch reported the Palauan senate had concerns regarding the &#8220;constitutionality, security, accountability, statutory authority, and oversight of the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T09:35:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. BNB prices have dropped by 23.95% since April 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T09:30:17.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T09:15:52.000Z",
    "title": "CoinsPaid hack exposed: North Korean group allegedly behind cybertheft",
    "url": "https://www.cryptopolitan.com/coinspaid-hack-exposed-north-korean-group-allegedly-behind-cybertheft/",
    "description": "CoinsPaid, the world&#8217;s largest crypto payments provider, has revealed details of a hacking incident that occurred on July 22, 2023, resulting in the theft of $37.3 million. The company suspects that the notorious Lazarus Group, linked to the North Korean government, is behind the attack. The Lazarus Group has been responsible for various high-profile hacking ... <a title=\"CoinsPaid hack exposed: North Korean group allegedly behind cybertheft\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinspaid-hack-exposed-north-korean-group-allegedly-behind-cybertheft/\" aria-label=\"More on CoinsPaid hack exposed: North Korean group allegedly behind cybertheft\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-08T09:30:27.000Z",
    "title": "Cardano (ADA) Price Prediction: 28% Upswing Or 23% Drop Coming Next?",
    "url": "https://www.newsbtc.com/news/cardano/cardano-ada-price-prediction-28-upswing-23-drop/",
    "description": "Cardano (ADA) is currently trading at a pivotal $0.291. The question is: Will ADA experience a 28% upswing or is a 23% drop on the horizon? Remarkably, the ADA price still remains in bearish territory, but the potential for a trend reversal is palpable. Price Analysis: 4-Hour Chart The 4-hour chart paints a picture of ADA trading just a smidge above the 23.6% Fibonacci retracement level, which stands at $0.286. Notably, on Monday, ADA briefly dipped below this level but was buoyed by the ascending trend line (black line) that was established in mid-June. This trend line is the bulls&#8217; last stand; a breach could see a bearish descent to the year&#8217;s low of $0.22. Adding another layer of complexity, the 200-EMA (blue line) on the 4-hour chart is converging towards the 23.6% Fibonacci level. ADA&#8217;s recent inability to surpass the 20-EMA (red line) is concerning. With the moving averages trending downward, a compression between $0.28 and $0.30 seems inevitable. However, if ADA remains resilient above the 23.6% Fibonacci retracement level and the trendline, and manages to break the moving averages, especially the 200-EMA, then the bulls might just have a fighting chance. Related Reading: Can The Cardano Mithril Protocol Propel ADA To $1 This Year? In this scenario, the 38.2% Fibonacci at $0.319, the 50% Fibonacci at $0.346, and the 61.8% Fibonacci at $0.378 become the next logical targets. A daily close above $0.38 (July&#8217;s high) would be a clarion call for the bulls, marking a 28% rallye from the recent price. Bullish Arguments for Cardano The recent price movements by Cardano might be bearish, but there are compelling arguments in favor of ADA&#8217;s potential resurgence. Santiment, a renowned analytics platform, recently tweeted: As Cardano sits just above $0.29, whales and sharks holding between 100K-10M ADA have accumulated back to their highest level since September, 2022. Additionally, on-chain transaction volume has been rising nearly every week for the past 6 months. Related Reading: Cardano (ADA) Price Remains Muted Despite Significant Milestones, Why? This statement is supported by data indicating ADA&#8217;s transaction volume surged above a staggering 67 billion ADA in consecutive weeks, a peak not seen since September 2021. Such heightened network activity is often interpreted as a bullish sign, indicative of increased user engagement and interest. Furthermore, ADA wallets holding between 100K-10M ADA now account for a significant 34.04% of all circulating tokens, suggesting strong confidence among larger investors. Also, Messari&#8217;s recent report on Cardano offers more reasons for optimism. The report delves deep into Cardano&#8217;s ecosystem, financial trends, and network performance. One of the standout revelations is the surge in decentralized app (dapp) activities. For the third consecutive quarter, Cardano has seen a remarkable uptick in dapp transactions, boasting a 49.0% quarter-over-quarter increase in Q2, averaging 57,900 daily transactions. State of @Cardano Q2 2023 With a dedicated community of users and developers, Cardano has demonstrated staying power. In Q2, average daily dapp transactions were up 49%, TVL up 10%, and 199% YTD.@redvelvetzip dives in. https://t.co/MNhyNJvIPq — Messari (@MessariCrypto) August 4, 2023 Featured image from Coinbase, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-08T09:17:35.000Z",
    "title": "How Messages in Web3 Wallets Can Kill Whatsapp?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-messages-in-web3-wallets-can-kill-whatsapp/",
    "description": "<p>This groundbreaking advancement has the potential to reshape the way crypto enthusiasts communicate. Offering a range of use cases from NFT trading negotiations to building stronger community connections. However, this innovation also raises important questions about its impact on the industry as a whole. Web3 Wallets are Evolving into Decentralized Messaging Platforms? The Ethereum Name [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-messages-in-web3-wallets-can-kill-whatsapp/\">How Messages in Web3 Wallets Can Kill Whatsapp?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-08T09:15:54.000Z",
    "title": "Shiba Inu Developer Shytoshi Kusama Explains ‘Myriad’ of Use Cases for New Shibarium Identity Project",
    "url": "https://dailyhodl.com/2023/08/08/shiba-inu-developer-shytoshi-kusama-explains-myriad-of-use-cases-for-new-shibarium-identity-project/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/SHIB-Developer-Shytoshi-Kusama.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/SHIB-Developer-Shytoshi-Kusama.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/SHIB-Developer-Shytoshi-Kusama.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/SHIB-Developer-Shytoshi-Kusama.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/SHIB-Developer-Shytoshi-Kusama.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/SHIB-Developer-Shytoshi-Kusama.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/SHIB-Developer-Shytoshi-Kusama.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Shiba Inu&#8217;s (SHIB) upcoming blockchain-based digital identity project will have a &#8220;myriad&#8221; of use cases that will help maintain decentralization, according to pseudonymous memecoin lead developer Shytoshi Kusama. Shib, the ecosystem’s official Twitter account, announced last week that Kusama is planning to integrate Self-Sovereign Identity (SSI) in all Shiba Inu projects. SSI is a blockchain-based digital [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/08/shiba-inu-developer-shytoshi-kusama-explains-myriad-of-use-cases-for-new-shibarium-identity-project/\">Shiba Inu Developer Shytoshi Kusama Explains ‘Myriad’ of Use Cases for New Shibarium Identity Project</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]