[
  {
    "source": "Decrypt",
    "date": "2023-06-10T20:48:00.000Z",
    "title": "Foodmasku Dishes Out Edible Masks on Ethereum",
    "url": "https://decrypt.co/144033/foodmasku-food-mask-proof-of-eat-nft",
    "description": "The multimedia artist has embraced the blockchain as a means to safeguard his work and explore the intersection of technology and humanity."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-10T20:50:57.000Z",
    "title": "Latam crypto holders flock to Bitget following Binance, Coinbase suits ",
    "url": "https://cointelegraph.com/news/latam-crypto-holders-flock-to-bitget-following-binance-coinbase-suits",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/7d3d019c-05ac-4ff9-bad0-9c1620c83a44.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The number of Bitget users in Latin America increased by 43% from June 6 to June 9, along with a 134% increase in deposits.</p>\n                    <p><p>Crypto exchange Bitget has seen a surge in new accounts in Latin America following lawsuits by United States regulators against major competitors Binance and Coinbase.</p><p>As compared to daily averages, new users in the region increased by 43% from June 6 to 9, with Brazil and Argentina leading market share growth, a spokesperson from Bitget told Cointelegraph. </p><p>According to the exchange, new clients in Brazil soared 54%, with a 208% jump in total deposits. In Argentina, its customer base rose by 33%, while funds deposited expanded 87%. The crypto exchange also operates in Venezuela, Colombia, and Mexico. Over the last few days, Bitget's total deposits rose 134% in the region. </p><p>Bitget has over 8 million clients across 100 countries. The company did not disclose the total number of users in Latin America. </p><p>The figures are explained by recent developments in the United States. On June 5, crypto exchange Binance <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">was sued by the U.S. Securities and Exchange Commission</a> for 13 charges, including alleged sale and offer of securities, failure to register as an exchange or broker, and commingling of funds. </p><p><a href=\"https://defillama.com/cexs\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to data from DefiLlama, Binance net outflows in the past seven days sits at $3.128 billion as of writing, while Bitget has seen its deposits increase by $14.8 million. The largest inflow of funds was reported by crypto exchange OKX, which received $603 million in deposits over the past week.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/f2d67ff4-8ba1-4864-89a6-95a01846a122.png\"  /><figcaption style=\"text-align: center;\"><em>CEX Transparency dashboard. Source: DefiLlama</em></figcaption></figure><p>\"The crypto industry is still very new and has experienced tremendous growth in recent years. [..] favorable policies are being implemented in places like Hong Kong, Dubai, Singapore and new opportunities are emerging. So, we are convinced that things will settle down over time, with the industry consolidating itself among the strongest ones in the modern economy,\" told Cointelegraph Gracy Chen, managing director of Bitget. </p><p>Also targeted by U.S. regulators, Coinbase was<a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\"> sued on June 6 for allegedly offering unregistered securities</a> and operating as an unregistered security broker since 2019. SEC's Chair Gary Gensler<a href=\"https://twitter.com/GaryGensler/status/1666059466750541825?s=20\" target=\"_blank\" rel=\"noopener nofollow\"> accused</a> the crypto exchange of depriving customers of critical protections that prevent fraud and manipulation, along with not providing proper safeguards against conflicts of interest. In the last 24 hours, Coinbase's trade volume has <a href=\"https://www.coingecko.com/en/exchanges/coinbase-exchange\" target=\"_blank\" rel=\"noopener nofollow\">changed</a> by 113.06% to $1.5 billion.</p><p>Binance has previously ranked Brazil among its top global markets, and its local partner was recently<a href=\"https://cointelegraph.com/news/binance-provider-in-brazil-gets-payment-institution-approval\"> granted a payment provider license</a> in the country. Coinbase is also expanding its local operations. Since March, it<a href=\"https://cointelegraph.com/news/coinbase-teams-up-with-brazilian-central-bank-s-pix-to-offer-expanded-services\"> has partnered with local payment providers</a> to offer crypto purchases, and enable deposits and withdrawals in the local currency.</p><p><a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\"><strong><em>Magazine:</em></strong><strong> </strong><strong><em>Best and worst countries for crypto taxes — Plus crypto tax tips</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-10T20:48:22.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 While the crypto market navigated the fallout from the&#160;collapse&#160;of FTX in late 2022, Ava Labs says it dodged the bullet. Ava Labs founder and CEO Emin Gün Sirer assure its stakeholders that FTX impacts very little the companies and projects operating in the Avalanche ecosystem. The company had an account on ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-10T20:42:32.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-10T21:00:50.000Z",
    "title": "As Conflux (CFX) and Kava (KAVA) Prices slide, here’s why DigiToads is a Better Investment",
    "url": "https://nulltx.com/as-conflux-cfx-and-kava-kava-prices-slide-heres-why-digitoads-is-a-better-investment/",
    "description": "Conflux (CFX) and Kava (KAVA) face strong resistance in the market, depicted by strong price movements to the downside. In contrast, DigiToads (TOADS) has turned out to be a bright spot in a bear market, rallying by more than 140%, and its presale is on track to raise millions. The opportunity to buy into DigiToads [&#8230;]"
  }
]