[
  {
    "source": "Cointelegraph",
    "date": "2023-09-29T20:30:00.000Z",
    "title": "Industry leaders and policymakers weigh in on a potential US gov't shutdown",
    "url": "https://cointelegraph.com/news/industry-leaders-policymakers-government-shutdown",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/bcac3145-b87b-4c33-b24f-8e3c933f4320.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A U.S. government shutdown was not inevitable, but even if one were to last for a matter of hours or days, lawmakers' priorities on their return may not be digital assets.</p>\n                    <p><p>The United States House of Representatives has rejected a bill passed on by the Senate aimed at funding the government, and Speaker Kevin McCarthy’s proposals have so far failed to gain traction with far-right lawmakers in the House — all actions suggesting that the U.S. government is heading toward at least a partial shutdown starting on Oct. 1.</p><p>A U.S. government shutdown, which occurs when Congress fails to pass legislation for funding for the next fiscal year, would effectively stop all federal agencies and departments from doing anything considered “non-essential”. Even if the shutdown were to only be a matter of hours — one in February 2018 lasted less than a day — crypto bills may take a backseat to other policies among lawmakers once activities resume.</p><p>Bills for the good or ill of digital assets would be halted amid a shutdown, and financial regulators including the Securities and Exchange Commission (SEC) and Commodity Futures Trading Commission would be running on a skeleton crew. Following a 2019 shutdown, Cointelegraph <a href=\"https://cointelegraph.com/news/trump-ended-us-government-shutdown-but-the-damage-it-did-to-crypto-adoption-is-here-to-stay\">reported SEC officials</a> had limited capabilities for enforcement and oversight.</p><p>“[I]n the aftermath of a shutdown, it is unclear what issues will rise to the top of the priority list in terms of gathering Congressional interest,” Sheila Warren, CEO of the Crypto Council for Innovation told Cointelegraph. “Apart from funding the government, Congress faces a number of statutory deadlines which will require additional legislative action before the end of the year.“</p><p>In July, lawmakers with the House Financial Services Committee voted to pass the Financial Innovation and Technology for the 21st Century Act (FIT), the Blockchain Regulatory Certainty Act, the Clarity for Payment Stablecoins Act and the Keep Your Coins Act. Should a shutdown occur, no action can be <a href=\"https://cointelegraph.com/news/crypto-bills-delayed-us-government-shutdown\">taken on these crypto-focused bills</a> — no amendments, no floor votes.</p><p>Warren suggested that congressional priorities could easily shift from crypto to any number of issues arising amid the shutdown, and there will likely be additional distractions as the 2024 elections approach. Treasury Secretary Janet Yellen also voiced her opposition to “House Republicans’ failure to act” in a Sept. 29 speech, claiming a shutdown was “dangerous and unnecessary” and could “cause economic headwinds” in the future.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">If we have a government shutdown, a lot of vital work in science and health could be impacted—from cancer research to food safety. <br><br>The American people need House Republicans to do their job: fund the government.</p>&mdash; Joe Biden (@JoeBiden) <a href=\"https://twitter.com/JoeBiden/status/1707435003041222818?ref_src=twsrc%5Etfw\">September 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/us-govt-shutdown-looms-5-things-bitcoin-this-week\"><strong><em>US gov’t shutdown looms — 5 things to know in Bitcoin this week</em></strong></a></p><p>Prior to any bills being put forward in the House, many Democratic members of the House Financial Services Committee <a href=\"https://cointelegraph.com/news/gary-gensler-sec-testimony-congressional-hearing\">staunchly criticized Republicans</a> at a Sept. 27 hearing, though the focus was intended to be on oversight of the SEC. Virginia Representative Don Beyer was one of the few Democrats <a href=\"https://cointelegraph.com/news/crypto-us-new-bill-record-off-chain-transactions\">pushing a crypto-related bill</a> amid concerns over government funding, but lawmakers will be unlikely to address the legislation before Oct. 1.</p><p>“It is seeming more and more likely there will be a shutdown with the fractured House [Republican] divisions and Senate going in their own direction,” <a href=\"https://twitter.com/RonwHammond/status/1706326157442818128\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the Blockchain Association director of government relations Ron Hammond on a Sept. 25 X thread. “For crypto the longer the shutdown goes on, the more various bills including FIT/market structure and stables get pushed.”</p><p>At the time of publication, the price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) had dropped below $27,000 but did not appear to be correlated with any news of congressional spending bills or the SEC moving ahead of schedule on <a href=\"https://cointelegraph.com/news/sec-delays-spot-bitcoin-etfs-blackrock-bitwise-valkyrie-invesco\">delaying decisions for spot Bitcoin</a> exchange-traded funds. In contrast, the price of Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) moved above the $1,600 level in the last 3 days as firms <a href=\"https://cointelegraph.com/news/valkyrie-backtracks-ether-futures-etf-launch\">announced their intention</a> to launch ETFs tied to Ether futures the first week of October. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/us-government-250k-bitcoin-price-prediction-tim-draper-hall-of-flame/\"><strong><em>US gov’t messed up my $250K Bitcoin price prediction: Tim Draper, Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-29T20:11:03.000Z",
    "title": "Bitcoin’s inflation-hedge theory tested as rising interest rates bring turbulence to markets",
    "url": "https://cointelegraph.com/news/bitcoin-inflation-hedge-theory-tested-rising-interest-rates-bring-turbulence-markets",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/1b32e456-c4f3-4ad8-915e-ef8bde0763d3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The losses on US Treasuries recently surpassed $1.5 trillion and the likely outcome is turbulent markets, but how will Bitcoin price fare? </p>\n                    <p><p>The U.S. economy has been facing turbulent times lately, with the U.S. personal consumption expenditure (PCE) inflation index rising by a significant 3.5% over the past 12 months. Even when excluding the volatile food and energy sectors, it's evident that the efforts made by the U.S. Federal Reserve to curb inflation have fallen short of their 2% target rate.</p><p>U.S. Treasuries have lost a staggering $1.5 trillion in value, primarily due to these rate hikes. This has led investors to question whether Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and risk-on assets, including the stock market, will succumb to heightened interest rates and a monetary policy aimed at cooling economic growth. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/4be0d91b-85aa-44e5-b423-c3f4ddd5a423.png\"  /><figcaption style=\"text-align: center;\"><em>Theoretical losses of U.S. Treasury holders, USD. Source: <a href=\"https://twitter.com/JoeConsorti\" target=\"_blank\" rel=\"noopener nofollow\">@JoeConsorti</a></em></figcaption></figure><p>As the U.S. Treasury keeps flooding the market with debt, there's a real risk that rates could climb even higher, exacerbating the losses to fixed-income investors. An additional $8 trillion in government debt is expected to mature in the next 12 months, further contributing to financial instability.</p><p>As Daniel Porto, the head of Deaglo London, pointed out in <a href=\"https://www.reuters.com/markets/us/view-us-core-inflation-slows-august-consumer-spending-rises-2023-09-29\" target=\"_blank\" rel=\"noopener nofollow\">remarks</a> to Reuters:</p><blockquote>\"(The Fed) is going to play a game where inflation is going to lead, but the real question is can we sustain this course without doing a lot of damage?\" </blockquote><p>Porto's comments resonate with a growing concern in financial circles—a fear that the central bank might tighten its policies to the point where it causes severe disruptions in the financial system.</p><h2>High interest rates eventually have devastating consequences</h2><p>One of the primary drivers behind the recent turmoil in financial markets is the rise in interest rates. As rates increase, the prices of existing bonds fall, a phenomenon known as interest rate risk or duration. This risk isn't limited to specific groups; it affects countries, banks, companies, individuals and anyone holding fixed-income instruments.</p><p>The Dow Jones Industrial Index has experienced a 6.6% drop in September alone. Additionally, the yield on the U.S. 10-year bonds climbed to 4.7% on Sept. 28, marking its highest level since August 2007. This surge in yields demonstrates that investors are becoming increasingly hesitant to take the risk of holding long-term bonds, even those issued by the government itself.</p><p>Banks, which typically borrow short-term instruments and lend for the long-term, are especially vulnerable in this environment. They rely on deposits and often hold Treasuries as reserve assets. </p><p>When Treasuries lose value, banks may find themselves short of the necessary funds to meet withdrawal requests. This compels them to sell U.S. Treasuries and other assets, pushing them dangerously close to insolvency and requiring rescue by institutions like the FDIC or larger banks. The collapse of Silicon Valley Bank (SVB), First Republic Bank, and Signature Bank serves as a warning of the financial system instability.</p><h2>Federal Reserve shadow intervention could near exhaustion </h2><p>While emergency mechanisms such as the Federal Reserve's BTFP emergency loan program can provide some relief by allowing banks to post impaired Treasuries as collateral, these measures do not make the losses magically disappear. </p><p>Banks are increasingly offloading their holdings to private credit and hedge funds, flooding these sectors with rate-sensitive assets. This trend is poised to worsen if the debt ceiling is increased to avoid a government shutdown, further raising yields and amplifying losses in the fixed-income markets.</p><p>As long as interest rates remain high, the risk of financial instability grows, prompting the Federal Reserve to support the financial system using emergency credit lines. That is highly beneficial for scarce assets like Bitcoin, given the increasing inflation and the worsening profile of the Federal Reserve's balance sheet as measured by the $1.5 trillion paper losses in U.S Treasuries.</p><p>Timing this event is almost impossible, let alone what would happen if larger banks consolidate the financial system or if the Federal Reserve effectively guarantees liquidity for troubled financial institutions. Still, there’s hardly a scenario where one would be pessimistic with Bitcoin under those circumstances. </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-29T20:20:48.000Z",
    "title": "Polygon adds Google Cloud to its validator set",
    "url": "https://cryptoslate.com/polygon-adds-google-cloud-to-its-validator-set/",
    "description": "<p>Polygon Labs announced on Sept. 29 that it has added Google Cloud to the decentralized group of validators powering its proof-of-stake Network. Polygon said in its statement that Google Cloud is now among more than 100 validators who secure the Polygon PoS Network, a network that originally operated under the name Matic Network and which [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/polygon-adds-google-cloud-to-its-validator-set/\">Polygon adds Google Cloud to its validator set</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T20:11:29.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here’s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-29T20:30:29.000Z",
    "title": "Court Rules Sam Bankman-Fried Will Remain In Jail Through Trial, Here’s Why",
    "url": "https://www.newsbtc.com/ftx/sam-bankman-fried-jail/",
    "description": "During a court hearing held on Thursday, September 28, 2023, the Court ruled that the former CEO of now-bankrupt crypto exchange FTX Sam Bankman-Fried aka SBF will remain in jail throughout his trial. Sam Bankman-Fried To Remain In Jail Throughout His Trial At the brief court hearing on Thursday at the Manhattan federal court, Bankman-Fried&#8217;s lawyers requested that the court should temporarily release their client so he could be able to prepare his defense against the charges raised against him. However, the judge overseeing the case Judge Lewis A. Kaplan has denied the request as he believes the Defendant is a flight risk. Related Reading: Important Events That Could Have A Massive Impact On XRP Price “The closer we get to trial, the more I’m wondering about that. Your client in the event of conviction could be looking at a very long sentence. If things begin to look bleak … maybe the time would come when he would seek to flee.&#8221; Judge Kaplan stated in the court hearing in Manhattan federal court. Bankman-Fried&#8217;s lead lawyer Mark Cohen then argued that there was no reason for his client to try and flee. Cohen told Judge Kaplan that his request was made due to him being unable to meaningfully confer with his client Bankman-Fried as long as he is jailed at the Metropolitan Detention Center in Brooklyn. In response, Assistant US Attorney Danielle Kudla told Judge Kaplan that Sam Bankman-Fried already had enough time to prepare for his trial. Kudla pointed out that Bankman-Fried had more than seven months to review his evidence and better prepare for his trial from the comfort of his parent&#8217;s home in Palo Alto, California since his freedom was not revoked until July 2023. Sam Bankman-Fried was extradited to the United States from the Bahamas in December last year and he was placed on house arrest in his parent&#8217;s home in Palo Alto, California where he had limited access to electronic devices until he was jailed on August 11, 2023, by Judge Kaplan. Sam Bankman-Fried was denied a $250 million bond by Judge Kaplan after the judge discovered that Bankman-Fried tried to tamper with and influence potential witnesses testifying against him. However, Judge Lewis A. Kaplan pondered on what Cohen had said and he stated that the court would arrange for Cohen and other lawyers to meet with Bankman-Fried most of the trial days at 7:00 AM at the court to speak with Bankman-Fried hours before the testimony begins. Bankman-Fried&#8217;s trial is set to begin on Tuesday, October 3, 2023, and it is expected to last more than 6 weeks. His lawyers already lost two other bail appeals before now. This marks the third time that the Defendant’s request to be released during his trial will be rejected by the court.  Prosecutors Bring Several Allegations Against FTX Founder CEO Sam Bankman-Fried has pleaded not guilty to several allegations brought against him following the collapse of crypto exchange FTX back in November 2022. Prosecutors accused Bankman-Fried of allegedly deceiving customers and investors to enrich himself and other executives while playing a major role in FTX&#8217;s multibillion-dollar collapse in November last year. Related Reading: $9 Trillion BlackRock Sees Bitcoin Spot ETF Approval Delayed, What This Means It was believed that Bankman-Fried stole billions of dollars in FTX customer deposits to resolve Alameda Research debts &#8211; a crypto hedge fund governed by him, live lavishly in the Caribbean, and fund political campaigns. Former Chief Executive Officer of Bankman-Fried&#8217;s Alameda Research hedge fund Caroline Ellison already pleaded guilty to fraud. She is expected to testify against Bankman-Fried in the upcoming trial. FTT price falls following court's rejection &#124; Source: FTTUSDT on Tradingview.com Featured image from Yahoo Finance, chart from Tradingview.com"
  }
]