[
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T11:59:24.000Z",
    "title": "Oman financial regulator seeks feedback on proposed virtual asset framework",
    "url": "https://cointelegraph.com/news/oman-financial-regulator-seeks-feedback-on-proposed-virtual-asset-framework",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/ed7566c2-324e-4caf-8deb-4fcc2dd3e35f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Although the proposed virtual asset regulatory framework in Oman covers FATF-defined assets, the issuance of privacy coins might get banned.</p>\n                    <p><p>The Sultanate of Oman is inching closer to launching its own virtual asset regulations, with its financial markets regulator seeking public comments on its proposed regulatory framework governing digital assets, such as cryptocurrencies.</p><p>The Capital Market Authority of Oman is currently in the process of drafting a comprehensive regime for the virtual asset sector, which includes various business requirements and market abuse prevention, it said in the <a href=\"https://cma.gov.om/Home/EParticipation/LegislationDrafts\" target=\"_blank\" rel=\"noopener nofollow\">consultation paper</a> published on July 27.</p><p><strong><em>“The CMA is seeking to provide an alternative financing and investment platform for issuers and investors while mitigating the risks associated with the [virtual asset] class.”</em></strong></p><p>The consultation paper includes 26 questions, with which industry stakeholders could provide their opinion. It includes proposals on regulatory and licensing requirements for virtual asset service providers (VASPs), corporate governance, risk management and virtual asset issuance.</p><p>It revealed that the proposed framework encompasses utility tokens, security tokens, fiat-backed and asset-backed stablecoins, and other digital currencies that fall under the Financial Action Task Force’s definition of virtual assets. However, the issuance of <a href=\"https://cointelegraph.com/news/what-are-privacy-coins-and-how-do-they-differ-from-bitcoin\">privacy coins</a> might get banned, pending public feedback.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/uae-emerges-as-a-pro-bitcoin-mining-destination-in-the-middle-east\"><strong><em>UAE emerges as a pro-Bitcoin mining destination in the Middle East</em></strong></a></p><p>The CMA might also require VASPs to establish a local presence in Oman through a legally established entity and physical office and impose minimum capital requirements on them. If finalized, virtual asset firms might also be required to hold only a low percentage of assets in hot wallets, conduct audits of safeguarded assets and show proof of reserves.</p><p>The public must submit their feedback to the consultation paper by Aug. 17, with key opinions potentially getting posted on the CMA website.</p><p>Following the consultation phase of the development of the virtual asset regime, the CMA will draft and finalize the regulatory framework.</p><p>Although the CMA publicly <a href=\"https://cointelegraph.com/news/oman-to-establish-regulatory-framework-for-virtual-assets\">announced</a> launching a regulatory framework on Feb. 14, discussions on regulating the virtual asset industry in Oman began much earlier. In November 2020, the country’s National Committee for Combating Money Laundering and Terrorist Financing decided to launch a task force comprising CMA and Central Bank of Oman officials to study whether to ban or permit virtual asset activities. Consultants were then enlisted in December 2022 to assist in setting up the new regime.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T11:44:35.000Z",
    "title": "Revolut to suspend cryptocurrency services in US",
    "url": "https://cointelegraph.com/news/crypto-revolut-to-suspend-cryptocurrency-services-in-us",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/c07bf0c5-30ac-400d-8164-4ab862c0ec29.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Revolut’s suspension of cryptocurrency services in the United States will affect 1% of their total global user base, the firm said.</p>\n                    <p><p>Cryptocurrency-friendly trading neobank Revolut is wrapping up its crypto services in the United States amid the ongoing regulatory uncertainty.</p><p>Soon after announcing a partial delisting of certain digital assets from its platform, Revolut took a decision to suspend all crypto services for U.S. users, the firm said in a statement to Cointelegraph on Aug. 4.</p><p>Together with its U.S. banking partner, Revolut will be working to suspend access to crypto through its platform starting from Sept. 2, 2023. The firm then will completely shut down crypto services on Revolut on Oct. 3, a spokesperson for the online bank said, adding:</p><blockquote>“The access to cryptocurrencies through Revolut will be fully disabled and US customers will no longer be able to buy, sell, or hold any cryptocurrencies.”</blockquote><p>The Revolut representative emphasized that the decision to leave the U.S. market will impact “just 1%” of the company’s global crypto customers. The representative also stressed that Revolut will continue to operate its non-crypto business in the United States.</p><p>“This decision has not been taken lightly, and we understand the disappointment this may cause,” the spokesperson for Revolut noted.</p><p>Crypto customers in the U.S. will soon find all relevant information regarding the suspension in the email communication they received from Revolut. “Our dedicated support team is available to address any concerns and questions our U.S. crypto customers may have via our in-app chat,” the statement added.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinbase-pauses-staking-services-following-regulators-orders\"><strong><em>Coinbase pauses staking services in four US states following regulators’ orders</em></strong></a></p><p>As previously reported, Revolut US announced delisting of cryptocurrencies like Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>), Polygon (<a href=\"http://matic\" target=\"_blank\" rel=\"noopener nofollow\">MATIC</a>) and Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) in late June. The company was <a href=\"https://cointelegraph.com/news/revolut-us-to-delist-ada-matic-and-sol-in-september\">planning to proceed with delistings</a> in September. As of late July, Revolut supported a total of roughly 30 cryptocurrencies in the United States.</p><p>Some major crypto services have also been struggling to continue servicing their customers in the United States recently. Crypto.com, a major global crypto exchange, announced the <a href=\"https://cointelegraph.com/news/crypto-com-suspends-us-institutional-exchange-service\">suspension of services to institutional clients in the U.S.</a> in mid-June.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation — Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-04T12:01:58.000Z",
    "title": "US exodus as Revolut now ‘suspends’ crypto access in country amid regulatory uncertainty",
    "url": "https://cryptoslate.com/us-exodus-continues-as-revolut-suspends-crypto-access-in-the-country-amid-regulatory-uncertainty/",
    "description": "<p>Amid the evolving landscape of crypto regulation in the United States, financial technology company Revolut has announced it is &#8220;suspending&#8221; crypto services in the US. A Revolut spokesperson told CryptoSlate, the company, together with its US banking partner, will suspend access to cryptocurrencies for its US customers starting Sept. 2, 2023, specifically, &#8220;As a result [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/us-exodus-continues-as-revolut-suspends-crypto-access-in-the-country-amid-regulatory-uncertainty/\">US exodus as Revolut now &#8216;suspends&#8217; crypto access in country amid regulatory uncertainty</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-04T11:48:11.000Z",
    "title": "Binance Adds SHIB to Collateral Assets List, Eyes Potential Bone ShibaSwap Listing",
    "url": "https://cryptobriefing.com/binance-adds-shib-to-collateral-assets/?utm_source=feed&utm_medium=rss",
    "description": "Binance expands its loan services by incorporating 22 new collateral assets, including Shiba Inu, with speculation growing."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-04T11:43:00.000Z",
    "title": "BlackBerry Identifies Notorious Malware Targeting Crypto",
    "url": "https://cryptodaily.co.uk/2023/08/blackberry-identifies-notorious-malware-targeting-crypto",
    "description": "<p>Former smartphone giant BlackBerry&rsquo;s cybersecurity division has identified notorious malware families that are exclusively targeting cryptocurrencies and the crypto ecosystem.&nbsp;</p>\n<p>Prominent malware includes the likes of RaccoonStealer, SmokeLoader, and Vidar, which hijack computers belonging to unsuspecting users for crypto mining or theft.&nbsp;</p>\nBlackBerry Identifies Significant Threats&nbsp;\n<p>The findings were published in a &ldquo;Global Threat Intelligence Report&rdquo; published on Thursday. In the report, the former smartphone giant states that they successfully averted over 1.5 million cyberattacks between the months of March and May. The company added that the primary target of these attacks was the healthcare, financial, and government sectors. BlackBerry published the report on X, stating,&nbsp;</p>\n\n<p>&ldquo;Think only enterprises get hacked? If you&rsquo;re a mid-market or small business, you still have a big target on your small or mid-size back. BlackBerry&rsquo;s@aboutsecurity shares why cybercriminals select targets based on impact &amp; how much they&rsquo;re willing to pay.&rdquo;</p>\n\n<p>One of the most significant threats identified during this period was RedLine, a commodity malware that can harvest information such as saved credentials, crypto, and credit card information. RedLine was used to breach Hatch Bank, a fintech banking platform, leading to the loss of significant banking data and crypto. BlackBerry noted in its report,&nbsp;</p>\n\n<p>&ldquo;During this reporting period, BlackBerry telemetry observed a continuous trend in the use of commodity malware such as RedLine, which can harvest information including saved credentials, credit card information, and cryptocurrency.&rdquo;</p>\n\nMalware Targeting Crypto&nbsp;\n<p>The company also identified several other malware families specifically designed to hijack and use computers for mining purposes. These include RaccoonStealer, Vidar, and SmokeLoader. SmokeLoader, a rogue financial tool, is of particular concern and has been used by Russian hackers and threat actors for rogue crypto mining. RaccoonStealer, a malware that can be sourced from the dark web, has been designed to specifically target crypto wallets and steal information. The malware is capable of obtaining passwords, cookies, web browser data, and cryptocurrency wallet data.&nbsp;</p>\n<p>Another malware, Vidar, targets Linux users and extracts information from crypto wallets and exchanges. Hackers routinely target Linux systems because they are vulnerable to mining attacks. BlackBerry has advised companies to apply security patches to secure themselves from attacks orchestrated by the malware families in question.&nbsp;</p>\n\n<p>&ldquo;Vidar harvests banking information, browser credentials, and cryptocurrency wallets, as well as standard files.&rdquo;</p>\n\n<p>The report also highlighted the Clop ransomware, which was used to target banking and financial institutions. This particular ransomware was also responsible for a data breach at Hatch Bank. The report also highlighted the growing threat to critical sectors from hackers and such malware, emphasizing the importance and urgency for companies to bolster their cybersecurity practices to counter these threats.&nbsp;</p>\n<p>Hackers have also introduced the Promotei botnet to target Linux-based servers to mine cryptocurrencies such as Monero. Given the botnet&rsquo;s advanced features, tracing and stopping it has been notoriously difficult.</p>\nThe Crypto Space And Cybersecurity&nbsp;\n<p>SonicWall, a cybersecurity firm, has, in a recent report, stated that crypto-jacking incidents have risen a staggering 399% year-on-year. Most of the entities behind these attempts are based in regions where mining bans and sanctions are in force. An estimate by Statista projects the cybersecurity market to reach $162 billion in 2023 on the back of increasing threats to the crypto ecosystem.&nbsp;</p>\n<p>The most recent hack targeting an exchange occurred on the 22nd of July when North Korean hackers from the notorious Lazarus Group targeted the Coinspaid exchange and stole around $37 million.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T12:03:18.000Z",
    "title": "The Best Delft University AI Courses You Can Take Online for Free This Month",
    "url": "https://www.cryptopolitan.com/the-best-delft-university-ai-courses-online/",
    "description": "Delft University of Technology, the Netherlands&#8217; oldest and largest technological university, has made a significant stride in online education. The institution, which holds a global standing akin to Harvard and MIT, has launched various online courses on the edX platform. Delft University of Technology in the Netherlands provides a diverse selection of artificial intelligence (AI) ... <a title=\"The Best Delft University AI Courses You Can Take Online for Free This Month\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-best-delft-university-ai-courses-online/\" aria-label=\"More on The Best Delft University AI Courses You Can Take Online for Free This Month\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T11:56:51.000Z",
    "title": "Ripple soars to new heights joins elite Ranks of global fintech giants",
    "url": "https://www.cryptopolitan.com/ripple-soars-to-new-heights-joins-elite-ranks-of-global-fintech-giants/",
    "description": "Ripple, the leading cryptocurrency firm, has ascended to the echelons of global fintech giants alongside the likes of PayPal and Revolut. The coveted position comes as CNBC, in partnership with research firm Statista, unveils its exclusive list of best-performing fintech companies across Asia, Africa, Europe, and North America. Having meticulously studied over 1,500 firms from ... <a title=\"Ripple soars to new heights joins elite Ranks of global fintech giants\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-soars-to-new-heights-joins-elite-ranks-of-global-fintech-giants/\" aria-label=\"More on Ripple soars to new heights joins elite Ranks of global fintech giants\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-04T11:50:46.000Z",
    "title": "Binance Approves Shiba Inu As Collateral: What Does This Signal For SHIB’s Future?",
    "url": "https://www.newsbtc.com/shiba-inu/binance-approves-shiba-inu-as-collateral-what-this-shibs-future/",
    "description": "Binance has continued to make significant strides, cementing its role as a crucial player in the market. One of the recent moves involves the addition of 22 new loanable and collateral assets to its Flexible Loan and VIP Loan services, including the meme-inspired cryptocurrency, Shiba Inu. This marks an essential milestone for Shiba Inu, intensifying the spotlight of the dog-themed meme coin. Shiba Inu Emerges As A Viable Collateral Asset Binance&#8217;s approval of Shiba Inu as a collateral asset is specifically noteworthy as it suggests that the crypto exchange is acknowledging Shiba Inu&#8217;s market potential and the growing trust in its liquidity. This could possibly pave the way for increased adoption of SHIB as a credible asset within the wider crypto and decentralized finance (DeFi) space. Related Reading: Whale Activity Spikes As Shiba Inu Preps For Shibarium Launch Simultaneously, the recent development has ignited conjecture about the possibility of Bone ShibaSwap (BONE) tokens being listed on Binance. This conjecture aligns with the eagerly-awaited roll-out of the layer 2 blockchain, Shibarium, slated for unveiling within the current month. Should this transpire, it could boost the visibility and credibility of both SHIB and BONE. Interestingly, Binance&#8217;s announcement on August 4 didn&#8217;t only involve Shiba Inu. Among other notable assets are Compound and Theta, representing the exchange&#8217;s commitment to continually broaden its offering to cater to diverse crypto investors.  Implications For SHIB&#8217;s Future The potential implications for Shiba Inu following this announcement are profound. It is a significant indicator of the coin&#8217;s evolution from its meme origin to a legitimate financial asset within the crypto sphere. Particularly, the acceptance of SHIB as a collateral asset could attract serious investors, impacting its price and market cap in the long run. Further driving this speculation is Binance&#8217;s potential listing of the BONE token, dependent on the successful Shibarium mainnet launch. As previously disclosed by the lead developer, Shytoshi Kusama, the Shibarium launch is expected in August, making BONE&#8217;s listing on Binance a distinct possibility. If actualized, this could further solidify Shiba Inu&#8217;s standing in the market, making it a coin worth watching in the crypto space. Related Reading: Shiba Inu’s DeFi Aspirations May Rattle DOGE’s Market As SHIB Turns To Digital IDs To further showcase Shiba Inu&#8217;s seriousness in becoming more than a meme coin, Kusama reportedly disclosed the Shiba Inu project, Shibarium, will integrate Digital Identity Verification into all its future developments. The lead developer noted: [We are currently] laying the groundwork for a new global standard in decentralized digital trust and international identity verification. In this way, Shibarium is the herald of a new digital age where faith in systems is restored and enhanced. Alongside this update, SHIB has seen a nearly 5% gain in value in the past 24 hours bringing its price to currently trade at $0.00000858, at the time of writing. Featured image from WatcherGuru, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-04T12:06:09.000Z",
    "title": "Bank of England (BoE) Releases Paper Exploring Ripple Interledger Protocol for Payment Settlement, Demonstrates XRP Real World Case",
    "url": "https://www.crypto-news-flash.com/bank-of-england-boe-releases-paper-exploring-ripple-interledger-protocol-for-payment-settlement-demonstrates-xrp-real-world-case-2/?utm_source=rss&utm_medium=rss&utm_campaign=bank-of-england-boe-releases-paper-exploring-ripple-interledger-protocol-for-payment-settlement-demonstrates-xrp-real-world-case-2",
    "description": "<img width=\"1920\" height=\"1279\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/banknotes-209104_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/banknotes-209104_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/banknotes-209104_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/banknotes-209104_1920-1024x682.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/banknotes-209104_1920-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/banknotes-209104_1920-1536x1023.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/banknotes-209104_1920-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/banknotes-209104_1920-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/banknotes-209104_1920-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/banknotes-209104_1920-48x32.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />The British central bank is exploring the use cases by integrating Ripple&#8217;s Interledger protocol. As per the research paper, BoE has already integrated the Ripple solution into its RTGS system. In the latest development, the UK&#8217;s central bank &#8211; the Bank of England (BoE) &#8211; announced that they are exploring Ripple&#8217;s Interledger protocol for the [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-04T11:54:29.000Z",
    "title": "Top 3 Ethereum Coins in Q3-2023",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-ethereum-coins-in-q3-2023/",
    "description": "<p>Among the plethora of digital assets, there are some Ethereum tokens that have emerged as prominent players, each offering unique concepts, use cases, and real-world applications. In this article, we will delve into the fundamentals of LIDO, MakerDAO, and AAVE tokens. Let&#8217;s take a look at these Ethereum Coins. 1) Lido LIDO is a decentralized [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-ethereum-coins-in-q3-2023/\">Top 3 Ethereum Coins in Q3-2023</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-04T11:40:04.000Z",
    "title": "Optimism (OP)’s Bounce to $2 Level May Be Inevitable: Analyst",
    "url": "https://coinedition.com/optimism-ops-bounce-to-2-level-may-be-inevitable-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Optimism OP Coin Skyrockets Following Bedrock Upgrade Announcement\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Optimism-OP-Coin-Skyrockets-Following-Bedrock-Upgrade-Announcement-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The rise of Optimism (OP) in the last seven days may have brewed confidence in market participants considering a recent opinion by a crypto analyst. Altcoin Sherpa, the analyst in question, shared his short-term prediction for OP with his 196,300 followers. According to Altcoin Sherpa, OP is one of the stronger altcoins. Furthermore, he opined [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/optimism-ops-bounce-to-2-level-may-be-inevitable-analyst/\">Optimism (OP)’s Bounce to $2 Level May Be Inevitable: Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-04T11:45:54.000Z",
    "title": "Trader Predicts Chainlink To Surge by Over 60%, Updates Outlook on DeFi Altcoin That’s Exploded 6x Year-to-Date",
    "url": "https://dailyhodl.com/2023/08/04/trader-predicts-chainlink-to-surge-by-over-60-updates-outlook-on-defi-altcoin-thats-exploded-6x-year-to-date/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Updates-Outlook-on-Altcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Updates-Outlook-on-Altcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Updates-Outlook-on-Altcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Updates-Outlook-on-Altcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Updates-Outlook-on-Altcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Updates-Outlook-on-Altcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Updates-Outlook-on-Altcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader thinks Chainlink (LINK) is now primed to surge after enduring an extended accumulation period. In a new video strategy session, crypto analyst Michaël van de Poppe tells his 162,000 YouTube subscribers that the decentralized oracle network Chainlink could increase by more than 50% from its current value. According to the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/04/trader-predicts-chainlink-to-surge-by-over-60-updates-outlook-on-defi-altcoin-thats-exploded-6x-year-to-date/\">Trader Predicts Chainlink To Surge by Over 60%, Updates Outlook on DeFi Altcoin That’s Exploded 6x Year-to-Date</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]