[
  {
    "source": "Decrypt",
    "date": "2023-11-01T19:58:57.000Z",
    "title": "The Comeback Coin: Solana Soars 20% as Rally Rages On",
    "url": "https://decrypt.co/204021/solana-soars-in-seemingly-unstoppable-rally-to-be-best-performing-asset",
    "description": "SOL won't stop going up in price. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-01T20:03:40.000Z",
    "title": "Sam Bankman-Fried “doubled down” by buying Binance’s stake in FTX — U.S. prosecutors",
    "url": "http://cointelegraph.com/news/sam-bankman-fried-sbf-doubled-down-buying-binance-stake-ftx-u-s-prosecutors",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/9c514da1-a113-460b-aad8-e127c7fb8d48.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The prosecution is delivering its closing arguments at the Southern District Court of New York, where Sam Bankman-Fried’s trial has been taking place since Oct. 3. </p>\n                    <p><p>Federal prosecutors claimed Sam \"SBF\" Bankman-Fried “doubled down” on the use of customers’ funds when he purchased Binance’s $2 billion stake in FTX in 2021. According to U.S. government attorneys, Bankman-Fried paid for the buyout with funds from FTX customers.</p><p>The prosecution is delivering its closing arguments on Nov. 1 at the Southern District Court of New York, where Bankman-Fried’s trial has been taking place since Oct. 3. Jurors in the case reportedly heard from ​​Assistant U.S. Attorney Nicolas Roos:</p><blockquote>“The defendant had a choice: come clear or double down? He doubled down. Here's when he doubled down. He used customer money to buy back FTX’s stock from Binance. [...]. It cost $2 billion.\"</blockquote><p>In 2019, Binance invested in FTX through a strategic partnership. Two years later, in 2021, Bankman-Fried sought to buy back FTX’s shares, paying its competitor $2.1 billion in Binance’s stablecoin (BUSD) and in FTX Token (FTT).</p><p>Additionally, prosecutors went through other payments and purchases allegedly made by FTX with customer funds, including millions of dollars in political donations, luxury real estate in the Bahamas, and venture capital investments. </p><p>“He spends on K5 - here is the payment document, signed by the defendant. Nishad Singh said it was a bad idea. The guy who ran K5 hung around with celebrities,” Roos said in reference to K5 Ventures, a venture capital fund focused on early-stage startups.</p><p>K5 entities received $700 million in investment from FTX in 2022. Alameda Research, FTX’s sister company, also invested $300 million in K5 Global. According to prosecutors, FTX’s customer deposits were the source of the funds. Roos continued:</p><blockquote>\"The defendant knows Alameda can’t repay the debt. Nishad sees the giant hole and freaks out. The defendant, not so much. He has come to terms with it. He wanted to use the money. He did use the money. He had the arrogance to think he’d get away with it.\"</blockquote><p>Bankman-Fried’s defense has argued that FTX’s own funds — whose revenue swelled from $89 million in 2020 to $1.02 billion in 2021 — were used for venture investments, political contributions, and property purchases. According to his defense team, the $8 billion gap between FTX and Alameda Research was caused by a lack of risk management and trading mistakes by Alameda. </p><p>Bankman-Fried faces seven counts of fraud and conspiracy to commit fraud, and could spend up to 115 years in prison if found guilty. The defense is expected to deliver its closing arguments on Nov. 2, just before the jury renders its final verdict. </p><p><strong><em>Magazine:</em></strong> <a href=\"https://cointelegraph.com/magazine/crypto-zero-knowledge-voting-finance/\"><strong><em>Beyond crypto — Zero-knowledge proofs show potential from voting to finance</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-01T19:50:33.000Z",
    "title": "deBridge launches IaaS solution for cross-chain communication between Ethereum and Solana",
    "url": "https://cryptoslate.com/debridge-launches-iaas-solution-for-cross-chain-communication-between-ethereum-and-solana/",
    "description": "<p>Web3 interoperability layer deBridge has launched an Infrastructure as a Service (IaaS) turnkey solution that offers a subscription-based interoperability service to facilitate cross-chain movements on Ethereum (ETH) and Solana (SOL) Virtual Machines, according to a Nov. 1 statement shared with CryptoSlate. The newly launched IaaS is designed to tackle key challenges hampering interoperability between the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/debridge-launches-iaas-solution-for-cross-chain-communication-between-ethereum-and-solana/\">deBridge launches IaaS solution for cross-chain communication between Ethereum and Solana</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-01T20:08:21.000Z",
    "title": "CFTC has paid $16m to crypto whistleblowers this year",
    "url": "https://www.cryptopolitan.com/cftc-16m-to-crypto-whistleblowers-this-year/",
    "description": "In an astonishing revelation this year, the United States Commodity Futures Trading Commission (CFTC) has disclosed the whopping amount of $16 million paid out to whistleblowers, with a staggering 1,530 tips received, the majority of which were tied to cryptocurrency-related matters. The digital age has seen a significant increase in retail customers venturing into the ... <a title=\"CFTC has paid $16m to crypto whistleblowers this year\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cftc-16m-to-crypto-whistleblowers-this-year/\" aria-label=\"More on CFTC has paid $16m to crypto whistleblowers this year\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-01T20:00:00.000Z",
    "title": "Unique Fair Pricing Model Puts XRP Price Higher Than Bitcoin, Here’s How Much",
    "url": "https://www.newsbtc.com/analysis/xrp/pricing-model-xrp-price-bitcoin/",
    "description": "New research from financial analysts at Valhil Capital suggests the XRP price is far undervalued than what it should be. Analysts have developed pricing models that put the value of XRP way higher than its current price of $0.5853, possibly even surpassing Bitcoin.  According to the research paper from Valhil Capital, which evaluated six distinct pricing models, XRP’s price should not be trading for less than a dollar but somewhere between $9.81 and $513,000. Research on XRP’s Fair Value It’s been well established that the XRP price has been held back over the past few years in large part due to the ongoing lawsuit between Ripple Labs, the company behind the cryptocurrency, and the SEC. This legal uncertainty made many crypto exchanges and investors hesitant to buy and trade XRP, leading to the cryptocurrency being left behind during the 2021 crypto market bull run. Related Reading: Galaxy Digital and Invesco Bitcoin Spot ETF Join BlackRock On The DTCC Unlike most cryptocurrencies, which aim to replace the traditional method of banking, XRP was designed by Ripple to help banks move money quicker and cheaper than current methods. Using this transaction function of XRP and its use as a store of value, Valhil Capital created six different valuation models to determine XRP&#8217;s fair market value. The first model, called the Pipeline Flow Model, considered XRP&#8217;s function as a mode of transaction as well as a store of value, putting its fair value in this case at $3,541. The second model called the Athey and Mitchnick Model, also used the transaction and store of value function to put XRP&#8217;s current fair price at $4,813.  The next two models looked at the transaction function alone. These models, named the 99-Year Golden Eagle Model and the Discounted Cash Flow Model, determined XRP&#8217;s fair market price to be $13,368 and $18,036, respectively.  Using XRP&#8217;s function as a store of value, the last two models, called the Collaterization Model and Quantum Liquidity Model, determined XRP&#8217;s current fair market price to be far above the price of Bitcoin, putting it at $122,580 and $513,518 respectively.  Current State Of The XRP Price XRP trading has since resumed on US-based crypto exchanges, as the cryptocurrency has been deemed not to be a security by a federal judge. Despite its challenges with the SEC since 2020, the cryptocurrency has grown to become the 5th-largest in terms of market cap.  Related Reading: Top 5 Bitcoin-Like Altcoins That Could Make You A Millionaire In The Crypto Bull Run Some of XRP&#8217;s fair market prices determined by Valhil Capital might seem extravagant, but some of them resonate with current predictions and sentiment in the XRP community. On-chain data has shown that whale and shark investors have increased their holdings in the past few days. On the other hand, Ripple&#8217;s latest periodic release of 1 billion XRP tokens from escrow could potentially reduce this ongoing buying pressure. At the time of writing, the XRP price is trading at $0.6006, up by 8.94% in a 7-day timeframe.  Token price reclaims $0.6 &#124; Source: XRPUSD on Tradingview.com Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-01T19:58:00.000Z",
    "title": "Number Of Bitcoin Whales Holding Over 1K BTC Is On The Rise",
    "url": "https://coinedition.com/number-of-bitcoin-whales-holding-over-1k-btc-is-on-the-rise/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Bitcoin_is_a_commodity_not_a_security_Advocating_a_commodity_is.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin_is_a_commodity,_not_a_security_Advocating_a_commodity_is\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Bitcoin_is_a_commodity_not_a_security_Advocating_a_commodity_is.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Bitcoin_is_a_commodity_not_a_security_Advocating_a_commodity_is-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Bitcoin_is_a_commodity_not_a_security_Advocating_a_commodity_is-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Bitcoin_is_a_commodity_not_a_security_Advocating_a_commodity_is-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Bitcoin_is_a_commodity_not_a_security_Advocating_a_commodity_is-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Earlier today, crypto analyst James Straten tweeted that the number of Bitcoin whales holding over 1K BTC has been on the rise during the latter half of this year. According to him, whales buy cheaper BTC during bear markets to increase their holdings before dumping them for profit in bull markets. On October 19, data [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/number-of-bitcoin-whales-holding-over-1k-btc-is-on-the-rise/\">Number Of Bitcoin Whales Holding Over 1K BTC Is On The Rise</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-01T20:00:17.000Z",
    "title": "Telegram Trading Bot Unibot Suffers $640,000 Exploit Against Token Approval Contract: Peckshield",
    "url": "https://dailyhodl.com/2023/11/01/telegram-trading-bot-unibot-suffers-640000-exploit-against-token-approval-contract-peckshield/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/unibot-suffers-exploit.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/unibot-suffers-exploit.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/unibot-suffers-exploit.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/unibot-suffers-exploit.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/unibot-suffers-exploit.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/unibot-suffers-exploit.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/unibot-suffers-exploit.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A Telegram trading bot crypto project that was launched earlier this year has been exploited for more than $600,000. According to the team behind the Unibot (UNIBOT) crypto project, the nature of the hack was a token approval exploit. &#8220;We experienced a token approval exploit from our new router and have paused our router to contain [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/01/telegram-trading-bot-unibot-suffers-640000-exploit-against-token-approval-contract-peckshield/\">Telegram Trading Bot Unibot Suffers $640,000 Exploit Against Token Approval Contract: Peckshield</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-01T19:55:39.000Z",
    "title": "Trader Who Called 2021 Crypto Collapse Says Bitcoin in Official Bull Market Territory – Here’s Why",
    "url": "https://dailyhodl.com/2023/11/01/trader-who-called-2021-crypto-collapse-says-bitcoin-in-official-bull-market-territory-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/Recovery-Unlikely-To-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/Recovery-Unlikely-To-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/Recovery-Unlikely-To-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/Recovery-Unlikely-To-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/Recovery-Unlikely-To-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/Recovery-Unlikely-To-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/Recovery-Unlikely-To-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A trader who accurately called Bitcoin&#8217;s (BTC) May 2021 crash believes that the king crypto just officially entered a bull market. Pseudonymous analyst Dave the Wave tells his 140,900 followers on the social media platform X that Bitcoin’s moving average convergence divergence (MACD) indicator on the monthly chart has now flipped bullish after crossing over [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/01/trader-who-called-2021-crypto-collapse-says-bitcoin-in-official-bull-market-territory-heres-why/\">Trader Who Called 2021 Crypto Collapse Says Bitcoin in Official Bull Market Territory – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]