[
  {
    "source": "Cointelegraph",
    "date": "2024-01-08T15:40:27.000Z",
    "title": " What 3 things should Web3 founders think about in 2024? ",
    "url": "https://cointelegraph.com/news/web3-founders-think-about-2024",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNGIyYjUwNGYtYThjOS00OTQ5LTkxODktMzE4NjI2MzAxNmZmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Experts from Cointelegraph's Accelerator agree: Blockchain developers should prioritize interoperability if they want to achieve greater adoption for Web3.</p>\n                    <p><p>How is the cryptocurrency market going to evolve in 2024? While the consensus is that it will be bullish, the commentators say it will not be a good time to become complacent. Creating advancements in <a href=\"https://cointelegraph.com/blockchain-for-beginners/how-does-blockchain-work-everything-there-is-to-know\">blockchain technology</a> will be key to sustained growth — and long-term survival means using resources sparingly with the knowledge that a bear market will eventually return.</p><p>Cointelegraph Accelerator asked its partners and mentors to suggest three things that Web3 founders should keep in mind this year. They suggested that users are ready for products that they can indeed “use” — meaning they’re ready to reward founders who focus on things like user experience, interoperability and account abstraction solutions. </p><p><em>Robby is the CEO of Animoca Brands, a blockchain gaming and digital rights company headquartered in Hong Kong.</em></p><p><a href=\"https://cointelegraph.com/news/web3-founders-think-about-2024\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-08T16:04:40.000Z",
    "title": "Bitcoin shoots for the Moon with BitMEX",
    "url": "https://cryptobriefing.com/bitcoin-shoots-for-the-moon-with-bitmex/?utm_source=feed&utm_medium=rss",
    "description": "BitMEX launches a historic mission to send a physical Bitcoin token to the Moon symbolizing the expansion of cryptocurrency beyond Earth."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-08T15:58:43.000Z",
    "title": "High Appeal for Stacks (STX) and Everlodge (ELDG) With Chainlink (LINK) Heading for a Resurgence",
    "url": "https://cryptodaily.co.uk/2024/01/high-appeal-for-stacks-stx-and-everlodge-eldg-with-chainlink-link-heading-for-a-resurgence",
    "description": "A look into the crypto market trends reveals insights into the performance of some tokens since the turn of the year"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-08T15:46:30.000Z",
    "title": "Areon launches layer-1 chain with Proof of Area on January 12",
    "url": "https://cryptodaily.co.uk/2024/01/areon-launches-layer-1-chain-with-proof-of-area-on-january-12",
    "description": "The digital asset landscape is constantly evolving, driven by the relentless innovation of blockchain and Web3 pioneers"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-08T16:00:38.000Z",
    "title": "L2 Crypto Token Stacks Leads With 29% Gain in Varied Week for Cryptocurrencies",
    "url": "https://news.bitcoin.com/l2-crypto-token-stacks-leads-with-29-gain-in-varied-week-for-cryptocurrencies/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/image-2021-12-27-102648-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"L2 Crypto Token Stacks Leads With 29% Gain in Varied Week for Cryptocurrencies\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/image-2021-12-27-102648-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/image-2021-12-27-102648-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/image-2021-12-27-102648-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/image-2021-12-27-102648-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/image-2021-12-27-102648-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/image-2021-12-27-102648-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/image-2021-12-27-102648.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />This week witnessed a 5% uptick in bitcoin&#x2019;s value, while ethereum experienced a 1.6% dip over the same period. Leading the charge among the top 100 cryptocurrencies, stacks (STX) soared 29.2%, with osmosis (OSMOS) closely trailing with a 17% increase against the U.S. dollar. Mixed Week for Crypto: Stacks Witnesses 29% Surge, Heavy Losses for [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-08T15:56:00.000Z",
    "title": "Cardano whales accumulating, Everlodge enhancing access to real estate investing",
    "url": "https://crypto.news/cardano-whales-accumulating-everlodge-enhancing-access-to-real-estate-investing/",
    "description": "Cardano whales are accumulating. Meanwhile, Everlodge aims to reshape real estate investing"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-08T15:49:07.000Z",
    "title": "Stacks, Injective, Internet Protocol emerge as crypto top gainers",
    "url": "https://crypto.news/stacks-injective-internet-protocol-emerge-as-crypto-top-gainers/",
    "description": "Stacks, Injective, and Internet Protocol boast 24-hour gains, emerging as crypto leaders on Jan. 8 charts."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-08T15:40:21.000Z",
    "title": "Bitcoin regains $45,000 amid ETF chatter",
    "url": "https://crypto.news/bitcoin-regains-45000-amid-etf-chatter/",
    "description": "Bitcoin's price surged to $45,000, fueled by renewed market enthusiasm and interest in exchange-traded funds."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-08T16:00:42.000Z",
    "title": "Analyst Predicts $570 Billion Inflow Amid Bitcoin Spot ETF Approval",
    "url": "https://www.newsbtc.com/news/bitcoin/analyst-predicts-570-billion-inflow-amid-bitcoin-spot-etf-approval/",
    "description": "Scott Melker, a cryptocurrency analyst and advocate has pointed out a massive inflow into Bitcoin following the approval of BTC Spot Exchange-Traded Fund (ETF). Bitcoin Might Be Poised For $570 Million Inflow The crypto analyst shared his projections with the entire cryptocurrency community on the social media platform X (formerly Twitter). Melker proposed that $570 billion could be invested in a Bitcoin ETF, representing just 0.5% of the overall assets managed by Registered Investment Advisors (RIAs). Related Reading: Revised Forecast: Bloomberg Analyst Cuts Probability Of Bitcoin Spot ETF Rejection To 5% In the X post, Melker pointed out that the overall assets managed by RIAs are currently valued at $114 trillion. He also highlighted that the total market capitalization of Bitcoin is currently pegged at $860 billion. The post read: RIAs manage $114 TRILLION in assets. If a measly half of a percent of that money eventually comes into a #Bitcoin ETF, that would be roughly 570 billion dollars. The entire market cap of $BTC now is $860 BILLION. Several crypto analyst seems to disagree with Melker&#8217;s projections and have shared their opinions on his claims. One of the analysts who has voiced his opinions toward the prediction is top Bloomberg Intelligence analyst Eric Balchunas. Eric Balchunas asserted that the RIAs assets valued at $114 trillion &#8220;seems really high.&#8221; He further added that the total advisor assets are worth around $30 trillion, due to data from market tracker Cerulli. However, Melker backed up his claims by sharing a data screenshot from Thinkadvisor. Thinkadvisor highlighted that &#8220;15,114 fiduciary investment advisors currently manage $114 trillion in assets for 61.9 million clients.&#8221; Another crypto enthusiast who has expressed displeasure with Melker&#8217;s inflow prediction is investment advisor Rick Ferri. The advisor challenged Melker noting that his &#8220;expectations are overblown.&#8221; Ferri asserted that despite his 35 years of advisory experience, he still doesn&#8217;t understand why Melker would make such claims. Additionally, Ferri stressed that if any adviser decides to own BTC, they would have done so through Grayscale Bitcoin (BTC). BTC Spot ETF To Serve As A Game-Changer For Crypto Market Melker&#8217;s post came in response to Bruce Fenton&#8217;s post on how the Bitcoin Spot ETF could be a game-changer for crypto. Fenton predicted a dramatic change in the future while highlighting that several brokers, financial advisors, and RIAs are not knowledgeable about BTC. Related Reading: Is A Bitcoin Spot ETF Approval A Sell The News Event? Experts Respond According to the crypto investor, financial advisors must &#8220;keep up with what the public and customers are talking about.&#8221; Additionally, he noted that Bitcoin ought to be included in many portfolios, given its past 10 years of performance and correlation. He also added that &#8220;financial advisors will follow the money and the trends.&#8221; Fenton asserted that advisors are not stupid about money and they will be motivated to learn. Fenton went further to say that large investment firms would spend billions promoting to their clients Bitcoin-based investments. This would lead to chief economists talking about it, public awareness of its importance, and the creation of the best ads. Featured image from iStock, charts from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-08T15:40:00.000Z",
    "title": "Altcoins Market Cap Could Surge But the Road Isn’t Straight-Forward",
    "url": "https://coinedition.com/altcoins-market-cap-could-surge-but-the-road-isnt-straight-forward/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Altcoins Market Cap Could Surge But the Road Isn’t Straight-Forward\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Analyst highlights a specific pattern that the altcoin market has been traversing. Whale activity or BTC ETF rejection could mar the analyst’s prediction of an uptrend. Altcoin market cap is at the latter stages of forming the Wyckoff pattern, an uptrend could be oncoming. Crypto Analyst Moustache tweeted that the altcoins market cap was following [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/altcoins-market-cap-could-surge-but-the-road-isnt-straight-forward/\">Altcoins Market Cap Could Surge But the Road Isn’t Straight-Forward</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]