[
  {
    "source": "Decrypt",
    "date": "2024-03-01T00:07:38.000Z",
    "title": "How the ‘Star Wars’ Stormtrooper Landed in Solana NFT Game MixMob",
    "url": "https://decrypt.co/219808/star-wars-stormtrooper-solana-nft-game-mixmob",
    "description": "It really is the iconic Star Wars character, but this isn’t a Disney deal or broader franchise IP play. Here’s the story behind the collab."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-29T23:41:33.000Z",
    "title": "'Otherside' Apes Come Home Event: Was It Worth Buying a $75K Bored Ape?",
    "url": "https://decrypt.co/219802/otherside-apes-come-home-event-worth-buying-75k-bored-ape",
    "description": "PREVIEW: Rug Radio creator Orangie went to the Otherside—and reported back from the Apes Come Home game event. Is it living up to the hype?"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-29T23:58:18.000Z",
    "title": "KuCoin partners with Revolut to facilitate Euro-to-crypto purchases",
    "url": "https://www.cryptopolitan.com/kucoin-partners-with-revolut/",
    "description": "KuCoin, a global cryptocurrency exchange, has integrated Revolut Pay as a new payment method, enabling users in the European Economic Area (EEA) to convert euros into cryptocurrencies easily. Also, this partnership allows for one-click purchases of popular cryptocurrencies like Bitcoin, Ethereum, Solana, and stablecoins such as USDT and USDC directly from users&#8217; Revolut accounts. The [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-01T00:00:36.000Z",
    "title": "Bitcoin Volatility Induces $700 Million Carnage In Crypto Futures",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-volatility-713-carnage-crypto-futures/",
    "description": "Data shows the cryptocurrency futures market has seen liquidations amounting to $700 million in the past day as Bitcoin has gone through its volatility. Bitcoin Has Seen Intense Price Action In Past 24 Hours The past day has been a bit of a rollercoaster for Bitcoin, with the asset registering sharp price action in both directions but ultimately going up as the bulls win out. Related Reading: Bitcoin MVRV Hits Levels That Led To Parabolic Bull Run In 2020 The chart below shows what the price action for the cryptocurrency has looked like recently. The price of the asset seems to have enjoyed sharp bullish momentum recently &#124; Source: BTCUSD on TradingView From the graph, it&#8217;s visible that Bitcoin initially witnessed some sharp bullish momentum, in which the coin not only broke above the $60,000 level, but went up to touch the $64,000 mark. This high, which is the peak for the year so far, only lasted briefly, however, as BTC crashed down spectacularly to under the $59,000 mark. The asset has since recovered to higher levels, now floating around $62,700. The rest of the cryptocurrency sector has also gone through its volatility, with prices fluctuating across the coins. As is usually the case with such sharp price action, the futures market has suffered many liquidations. Crypto Futures Market Has Gone Through A Squeeze In The Past Day According to data from CoinGlass, the cryptocurrency futures market has witnessed the liquidation of contracts worth more than $700 million in the last 24 hours. The table below displays the relevant information about the liquidations. A massive amount of liquidations appear to have occurred in the past day &#124; Source: CoinGlass It would appear that only $131 million of the liquidations came within twelve hours, suggesting that most of the flush was situated inside the preceding half-day period. This makes sense, as Bitcoin was most volatile inside this window. It also seems that the long-to-short ratio in this liquidation event has been quite balanced, even though the price has increased in the past day. This would suggest that some aggressive longing occurred as Bitcoin approached $64,000, and the subsequent pullback wiped these top buyers. The table below shows how the distribution has looked for the various symbols. Looks like BTC has topped the charts once more &#124; Source: CoinGlass As is generally the case, Bitcoin futures contracts have again been responsible for the largest portion of the total market liquidations, contributing around $270 million. Related Reading: TRON Hits 95 Million Addresses Milestone, Will This Help Price? What&#8217;s different this time, however, is that this share, although the largest, isn&#8217;t even half the total liquidations. This could come down to the fact that speculators may now be playing around with altcoin positions after gaining confidence from the BTC price surge. Dogecoin, the best performer among the top coins with its 34% jump, has occupied the largest share among the alts, with almost $51 million in liquidations. Featured image from André François McKenzie on Unsplash.com, CoinGlass.com, chart from TradingView.com"
  }
]