[
  {
    "source": "CoinDesk",
    "date": "2023-06-15T00:26:51.000Z",
    "title": "Bitcoin Friendly Miami Mayor Francis Suarez Jumps Into Presidential Race",
    "url": "https://www.coindesk.com/policy/2023/06/15/bitcoin-friendly-miami-mayor-francis-suarez-jumps-into-presidential-race/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Suarez joins an increasingly crowded field as a longshot candidate for the Republican nomination. The mayor once accepted a paycheck in bitcoin."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-15T00:30:00.000Z",
    "title": "$XRP Loses Price Gains After Hinman Documents Unsealing and Growing Whale Activity",
    "url": "https://www.cryptoglobe.com/latest/2023/06/xrp-loses-price-gains-after-hinman-documents-unsealing-and-growing-whale-activity/",
    "description": "The long-awaited unsealing of the Hinman documents this week had the potential to significantly impact the price of $XRP, a popular digital asset that’s at the center of the U.S. Securities and Exchange Commission’s (SEC) case against Ripple labs. In a 2018 address, William Hinman, the then-head of the SEC’s finance division, effectively declared that […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-15T00:15:00.000Z",
    "title": "Green Economy - Bitcoin mining grows greener",
    "url": "https://cryptodaily.co.uk/2023/06/green-economy-bitcoin-mining-grows-greener",
    "description": "<p>In the coming years, the tone of the cryptocurrency market will be set by environmental projects, which will be increasingly used for mining around the world. New technologies and developments will be implemented in different parts of the world. And maybe even in outer space - such ideas and proposals already exist and are being discussed within the professional community. Interesting discussions took place at the Bitcoin Miami conference in the USA at the end of May.</p>\n<p>Bitcoin mining was one of the key topics in the latest report by Messari, a leader in cryptocurrency market research and analysis. The authors believe that the green agenda will increasingly dominate in this field, and it will be the driving force of the industry in the years to come.On the one hand, environmental friendliness will grow into an actual trend, and crypto enthusiasts will adhere to ESG (Environmental, Social, Governance) Investing approach - environmental, social, governance aspects of investing. On the other hand, this trend will be supported by economic considerations, and the high cost of energy. As for this point, Messari analytics highlights a very indicative example for Bitcoin mining cost: in 2021, the mining of 1 bitcoin cost American miners in Texas about $5-10 thousand, and the coin itself was trading at around $50-60 thousand; its value went down in 2022, and the best price was estimated at $20 thousand with $15-20 thousand of mining cost.</p>\n<p></p>\nSerhiy Tron, Owner of White Rock Management, speaking at the Bitcoin 2023 conference\n<p>As the coins value decreased, miners actively went looking for ways to reduce their energy costs. First of all, by making mining more environmentally friendly. The interest in hydroelectric power and electricity generation by flaring gas, byproduct of oil production, has grown tremendously. The latter technology not only provides cheaper energy for cryptocurrency mining, but also significantly reduces carbon dioxide emissions into the atmosphere. Reduction of the negative impact of mining on the environment.</p>\n<p></p>\n\n<p>\"Being environmentally friendly is not just a fashion trend, but an economically profitable direction for mining. In some regions, the share of renewable energy in this field amounts to 40%, and even exceeds 70% in other regions. I think that interest will keep on growing, and global oil and gas corporations will cooperate more actively with the cryptocurrency industry. For example, our company has various projects in the U.S. underway: gas flaring in Texas and hydropower near Niagara Falls in the state of New York,\" said the founder of one of the world's largest mining companies, White Rock Management, Serhiy Tron.</p>\n\n<p>White Rock Management, along with 250 other companies, has joined the Crypto Climate Accord for environmentally friendly and safe cryptocurrency mining. With operating offices in Canada, Sweden, Kazakhstan and the United States, the company implements a number of green projects and has plans to develop data centers in Switzerland and the U.S.Tron believes that coal, oil and gas constituents will gradually be outed from the energy consumed by miners. A similar opinion has been voiced by Coin Metrics co-founder Nick Carter, who has high hopes about the use of energy from flare gas in bitcoin mining; he believes this type of fuel can completely cover the needs of all miners worldwide inside the next 10 years. Crypto analysts' predictions regarding the development of alternative sources are backed by energy experts.A new report from a global energy think tank Ember emphasizes that the global energy system will very shortly enter a &ldquo;new era of reduction of fossil fuel production&rdquo;. Gas and coal generation volumes are expected to decrease, with alternative sources in extensive use.Ember's findings note that at the end of 2022, the expansion of wind and solar power accounted for 80% of the growth in electricity demand, and when combined with hydropower and bioenergy, 92% of the growth. By the end of 2023, low-carbon sources are expected to provide 100% of the growth in energy demand. Analysts provide an interesting example: the solar power plants launched worldwide last year would be powerful enough to supply an entire country like South Africa for a year, and wind power plants would provide almost the entire 12-month supply for the United Kingdom.</p>\n\n<p>&nbsp;</p>\n<p>\"The price/quality principle will be always at work. Miners will do everything to reduce their costs, and increase their income from cryptocurrency mining, while preventing methane emissions and being environmentally conscious along the way. This, in my opinion, is worth the support of local authorities in different regions. For example, by tax incentives or other means,\" says financial analyst Vladyslav Kravets.</p>\n\n<p>Particular interest in \"green\" mining is growing in the U.S. Local Marathon Digital Holdings launched the King Mountain data center in Texas, with a capacity of 280 MW, carbon-neutral by 70%. In addition, this spring the company announced a joint project with Zero Two, designed to construct two new 200 MW and 50 MW zero-carbon sites in the UAE (Abu Dhabi). Also, BIT Mining Limited reported building a 57.2 MW facility in the same state, running by 85% on clean energy.</p>\n<p></p>\n<p>This does not come as a surprise, since the Americans have been growing generally more interested in cryptocurrency as of late. The bigger it is, the greater the interest of local miners in more environmentally friendly and cheaper crypto mining. The analytics service Ahrefs recently estimated that the word \"Bitcoin\" has been looked up 1.9 million times in Google search in the U.S. over the past 12 months. It topped the search ranking, coming before the scandalous former president Donald Trump, news, Elvis Presley, Disney and Spider-Man.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n\n<p>\"For years, Texas was considered the home of the American shale gas and oil revolution, but it has now become the go-to place for cryptocurrency miners. Miners have realized that energy from flare gas can be used profitably to mine crypto. Our company is using it already. Also, this way we significantly reduce CO2 emissions. Around 400 million tons of carbon dioxide make their way to the atmosphere annually, but the crypto community can reduce this figure significantly,\" assures Serhiy Tron.</p>\n\n<p>There is no doubt that the miners&rsquo; interest in green energy will grow as the interest in cryptocurrencies as such multiplies. This process is gradually spreading around the world, although not always in transparent ways.For example, in May, during the bankruptcy of BlockFi and Celsius, it was revealed that Druk Holding &amp; Investments (DHI), a state-owned investment bank in the Asian Kingdom of Bhutan, was secretly (without public knowledge) mining bitcoin. This country employs hydropower, with natural availability of high-altitude mountains with fresh air that allow cooling down the equipment. Mining is carbon-neutral and, as DHI assures, self-sustaining.The interest in cryptocurrencies is increased in the Seychelles, and local Finance Minister Naadir Hassan stated in April that his government is working out the requirements for the registration and licensing of specialized companies. Also, state authorities in Europe's Liechtenstein have recently declared they&rsquo;re going to allow their citizens to use bitcoin to pay for public services. Although the head of the government, Daniel Risch, did not specify when such a possibility was to come in effect, but was adamant that it eventually would.</p>\n<p>&nbsp;</p>\n<p>Regardless of what goes on in the crypto market and no matter what skeptics say about this industry, the interest for it does not decrease. Even after significant price swings of several coins and frightening statements about the crypto-winter. Steady focus of the investors and hi-tech companies is backed not only by the projects that&rsquo;s been already greenlit, but with new developments, ideas and discussions that do not stop. At the end of May, for instance, active debates on the future development of the market and its prospects took place in the United States, at the Bitcoin Miami conference.</p>\n<p>&nbsp;</p>\n\n<p>&ldquo;Rather interesting and large-scale event, which was helpful not for professional players alone, but for the curious newcomers as well. Highly-esteemed and acknowledged experts were represented at the event: Christopher Grilhault des Fontaines from Dfns, Joseph Ziolkowski from Relm Insurance, Domenic Carosa from Banxa and many others. Not only current problems were discussed, but some new developments, including those in the space industry, were spoken of openly, too. Quite gripping and productive. Once again, we were able to make sure that Bitcoin remains a powerful asset, and amid the challenging situation in the global economy and growing rates of inflation everywhere, attention and trust to Bitcoin is on the steady rise&rdquo;, summed up Serhiy Tron.</p>\n\n<p>&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  }
]