[
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T10:02:20.000Z",
    "title": "Here’s how OpenAI plans to cleanse ChatGPT from false information ",
    "url": "https://cointelegraph.com/news/here-s-how-openai-plans-to-cleanse-chatgpt-from-false-information",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/9fced648-86df-4900-a85a-a03b03238f14.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>OpenAI aims to reduce AI hallucinations in ChatGPT by enhancing math skills as process supervision shows promise in improving accuracy.</p>\n                    <p><p>OpenAI announced on May 31st, its efforts to enhance ChatGPT's mathematical problem-solving capabilities, aiming to reduce instances of <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/artificial-intelligence\">artificial intelligence (AI)</a> hallucinations. OpenAI emphasized mitigating hallucinations as a crucial step towards developing aligned AGI.</p><p>In March, the introduction of the latest version of ChatGPT, GPT-4, further propelled artificial intelligence into the mainstream. However, generative AI chatbots have long grappled with factual accuracy, occasionally generating false information, commonly referred to as \"hallucinations.\" The efforts to reduce these AI hallucinations were <a href=\"https://openai.com/research/improving-mathematical-reasoning-with-process-supervision\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> through a post on their website.</p><p>AI hallucinations refer to instances where artificial intelligence systems generate outputs that are factually incorrect, misleading or unsupported by real-world data. These hallucinations can manifest in various forms, such as generating false information, making up nonexistent events or people or providing inaccurate details about certain topics. </p><p>OpenAI <a href=\"https://cdn.openai.com/improving-mathematical-reasoning-with-process-supervision/Lets_Verify_Step_by_Step.pdf\" target=\"_blank\" rel=\"noopener nofollow\">conducted</a> research to examine the effectiveness of two types of feedback– \"outcome supervision\" and \"process supervision.\" Outcome supervision involves feedback based on the final result, while process supervision provides input for each step in a chain of thought. OpenAI evaluated these models using math problems, generating multiple solutions and selecting the highest-ranked solution according to each feedback model.</p><p>After thorough analysis, the research team found that process supervision yielded a superior performance as it encouraged the model to adhere to a human-approved process. In contrast, outcome supervision proved more challenging to scrutinize consistently.</p><p>OpenAI recognized that the implications of process supervision extend beyond mathematics, and further investigation is necessary to understand its effects in different domains. It expressed the possibility that if the observed outcomes hold true in broader contexts, process supervision could offer a favorable combination of performance and alignment compared to outcome supervision. To facilitate research, the company publicly released the complete dataset of process supervision, inviting exploration and study in this area.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/nvidia-briefly-hits-1-trillion-market-cap\"><strong><em>AI demand briefly catapults Nvidia into $1T club</em></strong></a></p><p>Although OpenAI did not provide explicit instances that prompted their investigation into hallucinations, two recent occurrences exemplified the problem in real-life scenarios.</p><p>In a recent incident, lawyer Steven A. Schwartz in the Mata v. Avianca Airlines case <a href=\"https://www.documentcloud.org/documents/23826751-mata-v-avianca-airlines-affidavit-in-opposition-to-motion?responsive=1&amp;title=1\" target=\"_blank\" rel=\"noopener nofollow\">acknowledged</a> relying on the chatbot as a research resource. However, the information provided by ChatGPT turned out to be entirely fabricated, highlighting the issue at hand.</p><p>OpenAI's ChatGPT is not the sole example of artificial intelligence systems encountering hallucinations. Microsoft's AI, during a <a href=\"https://www.youtube.com/watch?v=rOeRWRJ16yY\" target=\"_blank\" rel=\"noopener nofollow\">demonstration</a> of its chatbot technology in March, examined earnings reports and generated inaccurate figures for companies like Gap and Lululemon.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-traders-chatgpt-stock-picks-ai-dice-adobe-firefly/\"><strong><em>25K traders bet on ChatGPT’s stock picks, AI sucks at dice throws, and more</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T09:43:56.000Z",
    "title": "‘Not just Bitcoin price’ — Dan Tapiero shares tips on navigating the bear market",
    "url": "https://cointelegraph.com/news/bitcoin-price-dan-tapiero-shares-tips-on-how-to-navigate-bear-market",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/31a713df-4889-4578-b144-669610d999cd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Veteran trader Dan Tapiero said the most important thing for traders is to make rational judgments that aren’t impacted by people’s fears.</p>\n                    <p><p>While many beginners base their trades on the negativity brought about by devastating events happening in the crypto space, experienced traders base their decisions on different factors, helping them come out on top — even in a bear market.</p><p>Speaking with Cointelegraph, Dan Tapiero, founder of growth equity funds 10T Holdings and 1RoundTable Partners, shared some of his most important strategies to navigate the market. These include having a broader perspective, and avoiding the influence of feelings and people’s fears. Tapiero explained: </p><blockquote>“It’s important to understand that the space has really grown. It’s not just about the price of Bitcoin or the price of Ethereum. We have five or six companies that actually made more money last year than in the previous year. So, even during the time of a massive drop in the price of Bitcoin and Ethereum, we’ve had companies do better.” </blockquote><p>The executive also gave examples of sectors within the broad digital asset ecosystem that, according to Tapiero, are not correlated. He explained that in 2022, $8 trillion in stablecoins were settled, one trillion <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world#:~:text=NFTs%20refer%20to%20nonfungible%20tokens,based%20video%20games%20and%20video.\">nonfungible tokens (NFTs)</a> were minted and blockchain gaming took off. Tapiero pointed out that three years ago, these were all zero. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/c0f5d497-f808-44cf-b79b-23875fee268f.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>10T Holdings founder Dan Tapiero with Cointelegraph reporter Ezra Reguerra in Dubai, UAE. Source: Cointelegraph</em></figcaption></figure><p>Apart from these, the veteran trader also pointed to developments in the <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> space and highlighted that despite the space’s locked value going from $200 billion to $50 billion, it was also at zero a couple of years ago.</p><p>“I found like, you know, young guys in the space don’t have the perspective. Five, six years ago, which is not that long ago, nothing exists. You barely even had Ethereum. It was just Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). So, as the space broadens out, the value also increases with it,” he explained. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blackrock-ceo-warning-debt-ceiling-bitcoin\"><strong><em>Blackrock CEO issues dire warning over ‘debt ceiling drama’ — Bullish for Bitcoin?</em></strong></a></p><p>When asked about what he thinks about community sentiments and their impact on his strategies, Tapiero said that they are able to “see it and sense it,” but he’s not interested in these feelings. He believes that similar to other currencies, bonds or stocks, crypto is a market. He explained:</p><blockquote>“Markets display certain behaviors. I spent my entire life managing a portfolio of financial assets that move around and honestly, the most important thing is to be able to set your emotion aside and make rational judgments that aren't impacted by what the news is or what people's fears are.”</blockquote><p>In addition to these insights, the executive also shared his thoughts on the next bull phase. “The bear phase is finished,” he said. While Bitcoin and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) went down last year, Tapiero said that the market has “had a very nice recovery” and will have an “explosive” and broad bull market. </p><p>“I think we'll see new highs probably in the second half of 2024, 2025. And I think in that bull phase, we'll probably hit up to 6 to 8 trillion,” he added. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/moral-responsibility-how-blockchain-can-improve-ai-trustworthiness/\"><strong><em>‘Moral responsibility’ — Can blockchain really improve trust in AI?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-01T09:46:41.000Z",
    "title": "Fidelity’s Jurrien Timmer Analyzes Bitcoin’s Place in a 60/40 Portfolio",
    "url": "https://www.cryptoglobe.com/latest/2023/06/fidelitys-jurrien-timmer-analyzes-bitcoins-place-in-a-60-40-portfolio/",
    "description": "Jurrien Timmer, Director of Global Macro at Fidelity Investments, recently shared his insights on Twitter about Bitcoin’s potential role in a traditional 60/40 investment portfolio. He discussed the current state of Bitcoin and its correlation with other assets, providing a comprehensive analysis of its place in portfolio diversification. Timmer started by noting that Bitcoin’s price, […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-01T09:43:00.000Z",
    "title": "Binance Plans New Round Of Layoffs, Crypto Daily TV 1/6/2023",
    "url": "https://cryptodaily.co.uk/2023/06/binance-plans-new-round-of-layoffs-crypto-daily-tv-1-6-2023",
    "description": "In Todays Headline TV CryptoDaily News:\n<p></p>\n<p>Binance plans new round of layoffs</p>\n<p>A fresh headcount reduction is coming to crypto exchange Binance, which is reportedly planning to lay off 20% of its workforce in June. The job cuts come after the company said earlier this year it would not lay off any employees.</p>\n<p>Bitcoin price volatility</p>\n<p>Bitcoin's trading range fluctuated between $25,800 and $28,000 over the last week amid increased volatility. The variation was fueled by a prospective debt ceiling agreement, prompting market rallies, increased Bitcoin dominance and trading volumes, and may lead to more market activity due to Asian regulatory changes.</p>\n<p>Bitcoin faces first monthly drop of 2023</p>\n<p>The crypto rebound is losing steam, leaving Bitcoin on course for its worst month since the FTX exchange collapsed in November last year. The roughly 8% drop in May is Bitcoin&rsquo;s first monthly retreat of 2023.&nbsp;</p>\nBTC/USD dove 2.1% in the last session.\n<p>The Bitcoin-Dollar pair plummeted 2.1% in the last session. The CCI is giving a negative signal. Support is at 273311 and resistance is at 282611.</p>\n<p>The CCI is giving a negative signal.</p>\n<p></p>\nETH/USD plummeted 1.8% in the last session.\n<p>The Ethereum-Dollar pair plummeted 1.8% in the last session. The Stochastic-RSI is giving a negative signal. Support is at 1866.91 and resistance is at 1932.721.</p>\n<p>The Stochastic-RSI is currently in the negative zone.</p>\n<p></p>\nXRP/USD plummeted 1.3% in the last session.\n<p>The Ripple-Dollar pair dove 1.3% in the last session. The CCI indicates an overbought market. Support is at 0.4737 and resistance is at 0.5521.</p>\n<p>The CCI points to an overbought market.</p>\n<p></p>\nLTC/USD plummeted 2.8% in the last session.\n<p>The Litecoin-Dollar pair dove 2.8% in the last session. The ROC is giving a negative signal, going against our overall technical analysis. Support is at 89.3067 and resistance is at 94.7667.</p>\n<p>The ROC is currently in the negative zone.</p>\n<p></p>\nDaily Economic Calendar:\n<p>US ADP Employment Change</p>\n<p>The ADP Employment Change measures the change in the number of employed people in the US, making it an indicator of the labour market. The US ADP Employment Change will be released at 12:15 GMT, the US ISM Manufacturing PMI at 14:00 GMT, and Germany's Retail Sales at 06:00 GMT.</p>\n<p>US ISM Manufacturing PMI</p>\n<p>The ISM Manufacturing PMI shows the business conditions in the manufacturing sector. It is a significant indicator of the overall economic conditions. </p>\n<p>DE Retail Sales</p>\n<p>The Retail Sales measure the total receipts of retail stores. Monthly percent changes reflect the rate of change of such sales.</p>\n<p>ES 30-y Bond Auction</p>\n<p>The auction sets the average yield on the bonds auctioned off. Yields are set by bond market investors, and therefore they can be used to estimate investors' outlook on future interest rates. Spain's 30-y Bond Auction will be released at 08:40 GMT, Japan's Jibun Bank Manufacturing PMI at 00:30 GMT, and Japan's 10-y Bond Auction at 03:35 GMT.</p>\n<p>JP Jibun Bank Manufacturing PMI</p>\n<p>The Jibun Bank Manufacturing PMI gives an early snapshot of the health of the Japanese manufacturing sector.</p>\n<p>JP 10-y Bond Auction</p>\n<p>The auction sets the average yield on the bonds auctioned off. Yields are set by bond market investors, and therefore they can be used to estimate investors' outlook on future interest rates.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T09:57:57.000Z",
    "title": "Crypto.com now a licensed payment provider in Singapore",
    "url": "https://www.cryptopolitan.com/cryptocom-license-payment-provider-singapore/",
    "description": "As a pioneering figure in the blockchain revolution, Crypto.com is surging ahead once again. In a strategic expansion of its services in Singapore, the renowned cryptocurrency platform has successfully secured the Major Payment Institution (MPI) license for Digital Payment Token (DPT) services from the Monetary Authority of Singapore (MAS). This milestone fortifies Crypto.com&#8217;s stronghold in ... <a title=\"Crypto.com now a licensed payment provider in Singapore\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cryptocom-license-payment-provider-singapore/\" aria-label=\"More on Crypto.com now a licensed payment provider in Singapore\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T10:08:52.000Z",
    "title": "Crypto Conqueror TMS Network (TMSN) Declares Dominance Over BNB (BNB) and Aptos (APT)",
    "url": "https://www.crypto-news-flash.com/crypto-conqueror-tms-network-tmsn-declares-dominance-over-bnb-bnb-and-aptos-apt/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-conqueror-tms-network-tmsn-declares-dominance-over-bnb-bnb-and-aptos-apt",
    "description": "<p>TMS Network (TMSN) has emerged as a powerful contender for the top spot in crypto, swiftly asserting its dominance over established players like BNB (Binance Coin) and Aptos (APT). With its innovative blockchain solutions, TMS Network (TMSN) is reshaping the crypto landscape, captivating investors and flipping crypto skeptics, raising over $6 million since it launched. [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/crypto-conqueror-tms-network-tmsn-declares-dominance-over-bnb-bnb-and-aptos-apt/\">Crypto Conqueror TMS Network (TMSN) Declares Dominance Over BNB (BNB) and Aptos (APT)</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T10:00:18.000Z",
    "title": "Bitcoin’s New Heaven? EU Makes Groundbreaking Strides in Crypto Regulation with MiCA Legislation",
    "url": "https://www.crypto-news-flash.com/bitcoins-new-heaven-eu-makes-groundbreaking-strides-in-crypto-regulation-with-mica-legislation/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoins-new-heaven-eu-makes-groundbreaking-strides-in-crypto-regulation-with-mica-legislation",
    "description": "<p>The European Union officially enacts the Markets in Crypto-Assets (MiCA) law, ushering in a unified regulatory approach towards crypto-assets and services. MiCA&#8217;s introduction is expected to stimulate innovation and fair competition, bolster consumer protection, uphold market integrity, and facilitate cross-border expansion for crypto service providers. As the vanguard of cryptocurrency regulation, the European Union has [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/bitcoins-new-heaven-eu-makes-groundbreaking-strides-in-crypto-regulation-with-mica-legislation/\">Bitcoin&#8217;s New Heaven? EU Makes Groundbreaking Strides in Crypto Regulation with MiCA Legislation</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T09:42:41.000Z",
    "title": "Aave (AAVE) and DigiToads (TOADS) Spark Investor Interest – A New Era of Crypto Dominance on the Horizon?",
    "url": "https://www.crypto-news-flash.com/aave-aave-and-digitoads-toads-spark-investor-interest-a-new-era-of-crypto-dominance-on-the-horizon/?utm_source=rss&utm_medium=rss&utm_campaign=aave-aave-and-digitoads-toads-spark-investor-interest-a-new-era-of-crypto-dominance-on-the-horizon",
    "description": "<p>The global cryptocurrency market is witnessing a tremendous surge, exceeding a total valuation of $1.12 trillion. While Bitcoin and Ethereum, two of the earliest cryptocurrencies, unsurprisingly occupy the majority of this value, the rapid evolution of the crypto market paints a picture of far more complex dynamics.  Today, the lens through which investors view cryptocurrencies [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/aave-aave-and-digitoads-toads-spark-investor-interest-a-new-era-of-crypto-dominance-on-the-horizon/\">Aave (AAVE) and DigiToads (TOADS) Spark Investor Interest &#8211; A New Era of Crypto Dominance on the Horizon?</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-01T10:02:32.000Z",
    "title": "Top 4 Chinese Altcoins Set To Explode On June 1st",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-4-chinese-altcoins-set-to-explode-on-june-1st/",
    "description": "<p>Don&#8217;t avoid Chinese crypto after June 1st. The Asian market has been exploding after the Chinese govt injected $92 billion. And now Hong Kong’s crypto retail investments will shake the market on June 1st.  Smart investors are making their list of Chinese altcoins to buy in June. And I know you do not want to be [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-4-chinese-altcoins-set-to-explode-on-june-1st/\">Top 4 Chinese Altcoins Set To Explode On June 1st</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-01T09:48:29.000Z",
    "title": "Rumors on Binance and Gate.io: Platforms Clarify the Issues",
    "url": "https://coinedition.com/rumors-on-binance-and-gate-io-platforms-clarify-the-issues/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Less-FUD-More-Trust.-❤️-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Less-FUD-More-Trust.-❤️-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Less-FUD-More-Trust.-❤️-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Less-FUD-More-Trust.-❤️-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Less-FUD-More-Trust.-❤️-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Less-FUD-More-Trust.-❤️-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Less-FUD-More-Trust.-❤️.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The leading cryptocurrency trading platforms Binance and Gate.io came forward repudiating the rumors raised against the firms the previous days. While rumors on the 20% layoff of Binance’s employees were spread, scandals on Gate.io’s “insolvency problems,” unfurled within minutes. On May 31, the Chinese reporter Collin Wu posted on his Twitter account Wu Blockchain about [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/rumors-on-binance-and-gate-io-platforms-clarify-the-issues/\">Rumors on Binance and Gate.io: Platforms Clarify the Issues</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]