[
  {
    "source": "Bitcoin.com",
    "date": "2023-07-15T22:00:48.000Z",
    "title": "US Lawmakers Call on Congress to Pass Crypto Law Following SEC v Ripple Ruling on XRP",
    "url": "https://news.bitcoin.com/us-lawmakers-call-on-congress-to-pass-crypto-law-following-sec-v-ripple-ruling-on-xrp/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/lawmakers-xrp-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Lawmakers Call on Congress to Pass Law Upholding SEC v Ripple Ruling on XRP\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/lawmakers-xrp-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/lawmakers-xrp-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/lawmakers-xrp-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/lawmakers-xrp-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/lawmakers-xrp-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/lawmakers-xrp-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/lawmakers-xrp.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Several U.S. lawmakers have called on Congress to pass crypto legislation following the court ruling on the U.S. Securities and Exchange Commission (SEC) v. Ripple case regarding XRP. &#x201C;Gary Gensler&#x2019;s SEC cannot continue to pursue its regulation by enforcement approach, which only harms investors and creates uncertainty,&#x201D; said one lawmaker. US Lawmakers Call on Congress [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-15T22:00:41.000Z",
    "title": "Why Ripple’s Victory Against The SEC May Be Short-Lived: Legal Expert",
    "url": "https://www.newsbtc.com/analysis/xrp/ripple-victory-against-the-sec-may-be-short-lived/",
    "description": "The news of Ripple&#8217;s recent partial victory against the SEC after a legal battle spanning almost three years sent a ripple of joy around the entire crypto industry. However, according to a legal expert on Twitter, Lawyer Bryan Jacoutot, the victory might be short-lived as SEC has enough grounds to appeal the decision and drag this thing out for a lot longer. The SEC&#8217;s Lawsuit Against Ripple Labs The SEC filed a lawsuit against Ripple Labs in December 2020, alleging that Ripple had conducted an unregistered securities offering worth over $1.3 billion through the sale of XRP. According to the SEC, XRP is a security under federal securities laws. But the court determined on June 13 that the random &#8220;programmatic sale&#8221; of XRP to regular investors does not constitute the sale of an unregistered security under Howey.  Related Reading: Large Exchanges Relist XRP Following Ripple Victory Over SEC However, sales to institutional investors fall under Howey, which is used in the United States to determine whether a transaction qualifies as an investment contract. In this case, the Court found that the buyers couldn&#8217;t know who was selling them the XRP, unlike the institutional investors who would expect Ripple Labs to use the capital for the betterment of the Ripple ecosystem. According to Jacoutot, the Court&#8217;s reasoning is weak and Howey was misapplied in the case. The Court reasoned that regular investors bought XRP fully knowing that it is subject to the general cryptocurrency market trends, especially secondary sales of XRP tokens. However, Jacoutot believes those buying XRP would have also expected to make a profit from the efforts of Ripple Labs. XRP price at $0.7254 &#124; Source: XRPUSD on Tradingview.com The attorney also made a case of the Ethereum Foundation, as everyone who took part in the pre-sale of ETH knew they were buying from Ethereum Foundation. When looking at the XRP ruling in a similar manner, this would mean institutional investors of the ETH presale also bought unregistered securities. What Does The Ruling Mean? According to Jacoutot, the ruling opens up a few loopholes that can be exploited. In a tweet by attorney Joe Carlasare on Twitter, it explains that the logic of the ruling leaves an opening that can be used to lawfully launch a pyramid scheme. In this case, profits from the &#8220;programmatic sales&#8221; to retail investors can be distributed to institutional investors. Ripple CEO Brad Garlinghouse has said the ruling provided relief and that the company could now promote the various use cases for Ripple and its technology without worrying about legal repercussions. Related Reading: XRP Kicks Out BNB To Become 4th-Largest Crypto After 65% Rally This is definitely a win for Ripple, but an appeal by the SEC could drag out the legal battle for years and create another round of major uncertainty in the crypto market.  The price of XRP skyrocketed after the ruling. It is now up by 50% this month and is currently trading at $0.7154. Featured image from Bit2Me Academy, chart from Tradingview.com"
  }
]