[
  {
    "source": "Cryptopolitan",
    "date": "2023-09-09T15:11:10.000Z",
    "title": "Wells Fargo’s $1 billion settlement approved, former executive faces prison time",
    "url": "https://www.cryptopolitan.com/wells-fargos-1-billion-settlement-approved-former-executive-faces-prison-time/",
    "description": "According to a report by Bloomberg, Wells Fargo &#38; Co. has received federal approval for a $1 billion settlement in a shareholder lawsuit concerning unauthorized customer accounts. However, U.S. District Judge Jennifer L. Rochon greenlit the settlement after a hearing in New York, bringing the bank&#8217;s total payouts for the scandal to nearly $5 billion. ... <a title=\"Wells Fargo&#8217;s $1 billion settlement approved, former executive faces prison time\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wells-fargos-1-billion-settlement-approved-former-executive-faces-prison-time/\" aria-label=\"More on Wells Fargo&#8217;s $1 billion settlement approved, former executive faces prison time\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-09T15:35:31.000Z",
    "title": "Here’s Why Ethereum Price Barely Moved Following Ark’s ETF Application",
    "url": "https://www.newsbtc.com/news/ethereum/heres-why-ethereum-price-barely-moved-following-arks-etf-application/",
    "description": "The price of Ethereum seems to be back under the influence of the current market sentiment despite enjoying a relatively positive week. On Wednesday, September 6, Ark Invest filed for the first Ethereum spot exchange-traded fund (ETF) in the United States. This ETF application had a tame impact on the price of Ether, with the cryptocurrency only climbing to $1,650 the following day. Moreover, the token has almost fully reversed the minor gains from the significant development. Ethereum Price Registers 0.1% Rise Last Week &#8211; Here’s Why Ethereum currently changes hands at about $1,628, according to data from CoinGecko. A negligible 0.1% price increase in the last seven days underscores the struggling market performance of the second-largest cryptocurrency. A spot ETH exchange-traded fund is an investment vehicle that tracks the price of Ethereum on the spot market, allowing investors to buy and sell the crypto asset via a brokerage account. A product of this kind is expected to boost interest and investment in the Ether token. Related Reading: Ethereum Price is Showing Early Signs of Fresh Rally But $1,670 is the Key Nevertheless, the price of ETH has remained relatively unmoved this week despite the optimistic news. A recent report by blockchain analytics firm IntoTheBlock has provided insight into why the news barely impacted the price of Ethereum. &#8216;Supply &#38; Demand Balance&#8217; According to the data analytics platform, the current supply and demand balance is one of the primary reasons why the ETH price continues to move sideways. “Large holdings are concentrated close to ETH’s current price, consolidating prices in a tight range,” IntoTheBlock said. Source: IntoTheBlock IntoTheBlock data shows that a total of 5.1 million ETH was acquired below the $1,600 mark to create support, while a total of 6.5 million ETH was purchased at a price above this level to establish resistance. The blockchain analytics firm concluded that traders agree to transact within a narrow range with a large concentration of ETH positions. &#8216;Automated Buying, Discretionary Selling&#8217;  Additionally, IntoTheBlock believes that while bullish traders seemed to have bought the news, “discretionary sellers&#8221; overtook the narrative not too long after.  “A key factor behind the discretionary selling is likely to be FTX’s upcoming liquidation of reportedly $3B in crypto holdings,” the report read. While FTX has yet to disclose when it intends to execute these liquidations, it is likely that recent activity on the exchange’s wallets alarmed the market.  Related Reading: Polygon Foundation Refutes Claims Of Dumping MATIC On Binance – Here’s What Happened This sentiment also seems to be reflected in the performance of SOL after global payment giant VISA disclosed that it will use the Solana network for payment settlements. While the value of SOL jumped by more than 5% to trade above $20 immediately after the announcement, the cryptocurrency is back trading beneath $19.5. With the Ethereum and Solana tokens constituting a significant portion of FTX’s holdings, it is likely that the slow market performance of these assets is driven by traders being cautious because of the impending liquidation. ETH price continues to move sideways on the daily timeframe &#124; Source: ETHUSDT chart on TradingView Featured image from Unsplash, chart from TradingView"
  }
]