[
  {
    "source": "CoinDesk",
    "date": "2023-10-25T15:45:00.000Z",
    "title": "Crypto's Darkest Hour, and the Bright Day Ahead",
    "url": "https://www.coindesk.com/business/2023/10/25/cryptos-darkest-hour-and-the-bright-day-ahead/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "There really is a crypto future worth fighting for if we can just leave the crypto clowns behind."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-25T15:45:00.000Z",
    "title": "Are Rising Yields Putting the Squeeze on DeFi?",
    "url": "https://www.coindesk.com/markets/2023/10/25/are-rising-yields-putting-the-squeeze-on-defi/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "In this week’s “Crypto Long & Short,” Todd Groth investigates the interplay between TradFi and DeFi yields and why comparisons across markets are often overly simplified apples vs oranges."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-25T15:50:19.000Z",
    "title": "Unprecedented series of Bitcoin inflows and outflows observed across exchanges",
    "url": "https://cryptoslate.com/insights/unprecedented-series-of-bitcoin-inflows-and-outflows-observed-across-exchanges/",
    "description": "<p>Quick Take On Oct. 24, significant Bitcoin (BTC) exchange movements were recorded, signaling a potential market shift. Binance experienced its third major inflow of 2023, amassing approximately $320 million, a figure only surpassed on Apr. 21 and May. 25. Notably, transactions of $1 million or more dominated these inflows, hinting at substantial &#8216;whale&#8217; activity. In [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/unprecedented-series-of-bitcoin-inflows-and-outflows-observed-across-exchanges/\">Unprecedented series of Bitcoin inflows and outflows observed across exchanges</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-25T15:51:46.000Z",
    "title": "Bullish Cryptos to Not Sleep On in Q4 2023: Shiba Inu, Ethereum and Everlodge",
    "url": "https://cryptodaily.co.uk/2023/10/bullish-cryptos-to-not-sleep-on-in-q4-2023-shiba-inu-ethereum-and-everlodge",
    "description": "Shiba Inu (SHIB) saw a massive upward momentum following the successful growth of its ecosystem. This year has been massive for it, as Shibarium launched and reached millions of investors."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-25T15:48:29.000Z",
    "title": "Top 30 Crypto Projects Shining Bright in 2023",
    "url": "https://cryptodaily.co.uk/2023/10/top-30-crypto-projects-shining-bright-in-2023",
    "description": "Discover the top 30 cryptocurrency projects that have been shining in 2023. Explore the latest trends, innovations, and game-changers in the crypto space."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-25T16:00:59.000Z",
    "title": "Shiba Inu Burn Rate Falls 80%, Is It Time To Sell?",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-burn-rate-falls-80/",
    "description": "The Shiba Inu community burn rate has seen a significant decline over the last few days. The burn rate which had been on a tear earlier in the month started to recede and has fallen double-digits in the last 24 hours alone. Given that this burn initiative was implemented to reduce supply and increase the price in the process, this decline in burn rate could have an impact on SHIB’s price performance. Shiba Inu Burn Rate Down Over 80% As data from the Shiba Inu burn tracking website, Shibburn, shows, the Shiba Inu burn rate is down more than 80% in the last day. The reason for this decline is lower participation in the burn rate, as investors have turned their focus to the surging crypto market prices. Related Reading: Bitcoin: On-Chain Tracker Points Out Interesting Difference Between Current And Past Rallies At this time, only 29.98 million SHIB have been burned. Compared to the figures from earlier in the month which often came out above 100 million tokens burned, it shows a serious lack of participation from the Shiba Inu community members. Burn rate down 80% &#124; Source: Shibburn Burns have come from over 40 wallets but the number of SHIB each transaction was carrying was very small, hence the lackluster burn rate recorded at this time. However, on the weekly time frame, the burn rate is faring much better, as the burn tracker revealed on X (formerly Twitter) that it has seen a 61.82% increase. This means that over 362.4 million tokens were incinerated in the seven-day period. Will This Affect The SHIB Price? A look at the Shiba Inu price chart shows that the meme coin has seen a slowdown in its rally over the last day. But this has not completely eliminated the bullish tendencies that the SHIB price has shown. For example, whales are not giving up on the crypto and are instead choosing to accumulate through the twists and turns. As Bitcoinist reported, Shiba Inu whales picked up 4.52 trillion tokens from the market, which saw the price rally resume once more. This shows that these large players expect the price to continue to rally, especially in the short term, making it a good time to be in the cryptocurrency. Related Reading: Pro-XRP Legal Expert Shares Expectations If SEC Wins Appeal Against Ripple However, there has been a significant decline in the excitement and participation in the SHIB token. CoinMarketCap data shows a 20.94% decrease in its daily trading volume, which suggests that sellers may be gaining ground. Nevertheless, Shiba Inu has done a good job of sticking with the Bitcoin rally. And if the leading cryptocurrency continues its upward march, Shiba Inu’s tendency to follow the same path will see its value rise despite the decrease in burn rate. SHIB holds $0.000007 &#124; Source: SHIBUSDT on Tradingview.com Featured image from Freepik, chart from Tradingview.com"
  }
]