[
  {
    "source": "NewsBTC",
    "date": "2024-01-15T05:06:29.000Z",
    "title": "Ethereum Price Faces Crucial Test: Will $2,440 Withstand the Pressure?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-faces-crucial-test-2440/",
    "description": "Ethereum price struggled to clear $2,720 and corrected gains. ETH is now struggling to stay above the key $2,440 support zone and might extend losses. Ethereum climbed further higher toward $2,720 before the bears appeared. The price is trading below $2,550 and the 100-hourly Simple Moving Average. There is a connecting bearish trend line forming with resistance near $2,520 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a downside thrust if it breaks the $2,440 support zone. Ethereum Price Revisits Support Ethereum price outpaced Bitcoin and extended its increase above the $2,550 resistance. ETH even broke the $2,600 zone and spiked above $2,700. Finally, the beards appeared near the $2,720 resistance. A new multi-week high was formed near $2,716 before the price corrected gains. There was a move below the $2,600 and $2,550 levels. The price declined below the 23.6% Fib retracement level of the upward move from the $2,170 swing low to the $2,716 high. Ethereum is now trading below $2,550 and the 100-hourly Simple Moving Average. If there is a fresh increase, the price might face resistance near the $2,520 level. There is also a connecting bearish trend line forming with resistance near $2,520 on the hourly chart of ETH/USD. Source: ETHUSD on TradingView.com The next major resistance is now near $2,585. A clear move above the $2,585 level might send ETH toward $2,650. The main resistance is now forming near the $2,720 level. A close above the $2,720 resistance could push the price further into a bullish zone. The next key resistance is near $2,780. Any more gains might send the price toward the $2,880 zone. More Losses in ETH? If Ethereum fails to clear the $2,520 resistance, it could continue to move down. Initial support on the downside is near the $2,440 level or the 50% Fib retracement level of the upward move from the $2,170 swing low to the $2,716 high. The next key support could be the $2,350 zone. A downside break below the $2,350 support might send the price further lower. In the stated case, Ether could test the $2,300 support. Any more losses might send the price toward the $2,240 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $2,440 Major Resistance Level – $2,585"
  }
]