[
  {
    "source": "Cointelegraph",
    "date": "2023-09-29T08:27:22.000Z",
    "title": "French police raids Nvidia offices amid antitrust investigation: Report ",
    "url": "https://cointelegraph.com/news/ai-chips-nividia-french-police-raid-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/6c2a1e34-f34c-416f-b408-c604f6f127d7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The action reportedly came as a part of a general inquiry of French antitrust authorities into the cloud computing sector. </p>\n                    <p><p>Nvidia, one of the global leaders in artificial intelligence (AI) chip production with headquarters in California, reportedly faced a police raid in its French offices this week. The action came as a part of a general inquiry of French antitrust authorities into the cloud computing sector. </p><p>On Sept. 28, the Wall Street Journal <a href=\"https://www.wsj.com/tech/ai/nvidias-french-offices-raided-in-cloud-computing-competition-inquiry-97c094ea\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> the raid, although neither Nvidia nor the French enforcement agencies have officially commented on what happened. </p><p>A press release on the webpage of the French antitrust agency, the Autorité de la Concurrence, refers to an unannounced <a href=\"https://www.autoritedelaconcurrence.fr/en/press-release/general-rapporteur-autorite-de-la-concurrence-indicates-unannounced-inspection-was\" target=\"_blank\" rel=\"noopener nofollow\">inspection in the graphics cards </a>sector. According to the release, a judge authorized the raid at the premise of the company “having implemented anticompetitive practices in the graphics cards sector.” </p><p>However, the raid itself does not “pre-suppose the existence of a breach of the law, which could be imputed to the company,” as the message from the agency specifies. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/french-telecom-group-invests-millions-in-local-ai-industry\"><strong><em>French telecom group invests millions in local AI industry</em></strong></a></p><p>Autorité de la Concurrence refers to its own opinion, <a href=\"https://www.autoritedelaconcurrence.fr/en/press-release/cloud-computing-autorite-de-la-concurrence-issues-its-market-study-competition-cloud\" target=\"_blank\" rel=\"noopener nofollow\">issued</a> in conclusion to a year-long study of the cloud computing sector. Published in June 2023, this document does not mention Nvidia. Instead it focuses on other tech companies, namely the three hyper scalers” — Amazon Web Services (AWS), Google Clou,d and Microsoft Azure. According to the agency’s data, they represent 80% of the spending growth in public cloud infrastructures and applications in France in 2021: </p><blockquote>“Amazon and Microsoft have captured 46% and 17% respectively of revenues from IaaS and PaaS services in 2021. Given their financial capacities and their digital ecosystems, these hyperscalers are in a position to hinder competition development.”</blockquote><p>The agency is considering various options provided by the national competition laws and the European Data Act to combat this tendency. </p><p>Nvidia inevitably comes under the regulators' attention due to its unique position as the hardware producer for the most innovative sectors of the digital industry. The company's recent quarterly report revealed that the United States regulators asked it <a href=\"https://cointelegraph.com/news/us-curbs-export-nvidia-ai-chip-to-some-middle-eastern-countries\">to curb exports of AI chips</a> to “some Middle East countries.” A day later, the United States Department of Commerce <a href=\"https://cointelegraph.com/news/us-regulators-deny-blocking-ai-chip-exports-to-middle-east\">denied this information</a>. </p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T08:38:49.000Z",
    "title": "The Impact of AI on BRICS Economies: Opportunities and Challenges",
    "url": "https://www.cryptopolitan.com/the-impact-of-ai-on-brics-economies/",
    "description": "Artificial intelligence (AI) &#8216;s influence on emerging markets economies has garnered significant attention and discussion in an era marked by growing digitization. Among the BRICS nations—Brazil, Russia, India, China, and South Africa—the potential ramifications of AI are a topic of both anticipation and apprehension.  Recent developments, such as Chinese President Xi Jinping&#8217;s announcement at the ... <a title=\"The Impact of AI on BRICS Economies: Opportunities and Challenges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-impact-of-ai-on-brics-economies/\" aria-label=\"More on The Impact of AI on BRICS Economies: Opportunities and Challenges\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T08:31:14.000Z",
    "title": "VanEck unveils groundbreaking Ethereum futures ETF in the US",
    "url": "https://www.cryptopolitan.com/vaneck-unveils-ethereum-futures-etf-in-us/",
    "description": "In a significant move that underscores the growing acceptance of cryptocurrency in mainstream finance, investment management giant VanEck has announced its intention to launch the VanEck Ethereum Strategy ETF (EFUT). This development comes on the heels of the firm&#8217;s earlier foray into the crypto space with its Bitcoin Strategy ETF. A deep dive into the ... <a title=\"VanEck unveils groundbreaking Ethereum futures ETF in the US\" class=\"read-more\" href=\"https://www.cryptopolitan.com/vaneck-unveils-ethereum-futures-etf-in-us/\" aria-label=\"More on VanEck unveils groundbreaking Ethereum futures ETF in the US\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-29T08:10:17.000Z",
    "title": "Why Is Bitcoin Price Up Today? Insights From Leading Analysts",
    "url": "https://www.newsbtc.com/news/bitcoin/why-is-bitcoin-price-up-today-insights-leading-analysts/",
    "description": "In the last 24 hours, the Bitcoin price experienced a significant surge of 2%, touching an intraday high of $27,320 yesterday. As of this writing, the BTC price hovered near the $27,000 mark. Why Is Bitcoin Price Up Today? Several analysts have offered insights into the recent upward trajectory. Renowned crypto specialist Skew elucidated on Twitter, &#8220;BTC Aggregate CVDs &#38; Delta: Lower timeframe stuff but pretty clear spot absorption around the high, so $27.2K is an important price area to clear for spot buyers. Most of the push up was perp driven with spot trailing price (short liquidations &#38; strong perp bid).&#8221; Related Reading: Bonds Out, Bitcoin In? Bloomberg Analyst Predicts Major Portfolio Shifts Skew&#8217;s chart unveils that the momentum was predominantly backed by short liquidations and sturdy bids in the perpetual markets. Upon touching the $27,200 threshold, spot market selling began, indicating a potential local zenith for the Bitcoin price. Complementing the data, on-chain analytics firm Santiment confirmed that open long and short Bitcoin positions surged as Bitcoin&#8217;s price enjoyed a bullish Thursday. The chart shared by Santiment correlates Bitcoin&#8217;s ascent with the augmented open interest in the futures market. &#8220;After a quick price retrace after those longs &#38; shorts quickly closed yesterday, they have remained high today, allowing prices to maintain their levels,&#8221; the on-chain tracker said. On a bullish note, Santiment commented that Bitcoin sharks and whale addresses, which are defined as 10-10,000 BTC wallets, have now accumulated to their highest amount held in 2023, amounting to 13.03 million BTC. Additionally, Tether sharks and whales are accumulating buying power. &#8220;This is generally a bullish combination,&#8221; Santiment remarked. Nonetheless, the analysis firm also sounded a note of caution: &#8220;The long-term outlook is bright for Bitcoin with whales accumulating BTC &#38; USDT. However, watch for a short-term correction, with traders profit taking heavily as $27K hit Thursday. When the 7D MVRV gets below 0, that may be ideal for another leg up.&#8221; Related Reading: Marathon Digital Mines Invalid Bitcoin Block Amid Heightened BTC Volatility Their data further highlights that during yesterday&#8217;s significant move, Bitcoin showcased its highest on-chain profit/loss mark in the past quarter, which usually hints at an impending short-term correction. DaanCrypto, another industry pundit, remarked during the price flux, &#8220;Bitcoin Price up, Spot Premium up, Funding down. This move has seen a strong sustained spot bid so far which is looking quite healthy as we speak.&#8221; Similarly, renowned crypto analyst Exitpump chimed in during the price crescendo with the observation, &#8220;BTC Binance spot orderbook: Noticed chasing bid on the book with big asks stacked slightly above the price, it&#8217;s getting interesting. Maybe a spoof buy wall, but I think that it just grinds higher.&#8221; What&#8217;s Next For BTC Price? As described in one of our last analyses, the Bitcoin price is facing a crucial monthly close tomorrow, Saturday. Rekt Capital, a seasoned crypto analyst, recently spotlighted the significance of Bitcoin&#8217;s approaching monthly candle close. Via X, he emphasized that Bitcoin is currently treating the $27,000 mark as a resistance. He elaborated, “Bitcoin needs to monthly close above $27,091 for this to be a fake-breakdown. Otherwise, the breakdown will be technically confirmed.&#8221; In this case, a fall toward $23,000 could be imminent. On the 1-day chart, Bitcoin is showing strong bullish momentum today. The BTC price has managed to break the (black) trend line. The task today is to defend the re-test. If it succeeds, a monthly close above $27,100 seems very likely, and a rally similar to June could be possible. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-29T08:35:13.000Z",
    "title": "Ripple Abandons Fortress Trust Takeover Deal but Remains Largest Shareholder",
    "url": "https://www.crypto-news-flash.com/ripple-abandons-fortress-trust-takeover-deal-but-remains-largest-shareholder/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-abandons-fortress-trust-takeover-deal-but-remains-largest-shareholder",
    "description": "<img width=\"1000\" height=\"668\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Ripple.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Ripple-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Ripple-768x513.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Ripple-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Although Ripple has decided not to proceed with the acquisition of crypto custodian Fortress Trust, it will retain its investment. The decision comes after Fortress Trust suffered a crypto hack that affected a small number of its customers. Blockchain startup Ripple has cleared its stand over the acquisition of its Nevada-based chartered trust company Fortress [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-29T08:31:50.000Z",
    "title": "VeChain (VET) Price Jumps in Big Market Rebound After US Patent Announcement – ‘Let’s Change the World Together",
    "url": "https://www.crypto-news-flash.com/vechain-vet-price-jumps-in-big-market-rebound-after-us-patent-announcement-lets-change-the-world-together/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-vet-price-jumps-in-big-market-rebound-after-us-patent-announcement-lets-change-the-world-together",
    "description": "<img width=\"1000\" height=\"640\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/RuskaDesign-VeChain-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Coinbase adds two new digital assets, they are VeChain and VeThor additionally Bince U.S includes VET in the list of 10 selected cryptocurrencies offering both USD and USDT trading.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/RuskaDesign-VeChain-1.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/RuskaDesign-VeChain-1-300x192.jpg 300w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />VeChain reveals a significant US patent promoting secure and precise data recording in transportation through IoT and blockchain integration. This innovation particularly addresses challenges in refrigerated transportation, offering a leap towards ensuring cargo safety and standards compliance. Drawing upon the insights shared by VeChain (@vechainofficial) on sustainability, the blockchain pioneer continues to stride on its [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-29T08:12:42.000Z",
    "title": "Tottenham Hotspur Scores Big in the Crypto Game with Chiliz Blockchain Fan Token",
    "url": "https://www.crypto-news-flash.com/tottenham-hotspur-scores-big-in-the-crypto-game-with-chiliz-blockchain-fan-token/?utm_source=rss&utm_medium=rss&utm_campaign=tottenham-hotspur-scores-big-in-the-crypto-game-with-chiliz-blockchain-fan-token",
    "description": "<img width=\"1280\" height=\"960\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/soccer-3566694_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/soccer-3566694_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/soccer-3566694_1280-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/soccer-3566694_1280-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/soccer-3566694_1280-768x576.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The leading English Premier League football club is set to issue a new fan token on the Chillz blockchain network.  The Tottenham Hotspur football club will become the first Premier League club in two years to debut on the Chillz Chain. A handful of football clubs are making their way into the cryptocurrency market, as [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-29T08:37:33.000Z",
    "title": "12 Gems Backed by Binance Labs to Watch – Part 1",
    "url": "https://www.altcoinbuzz.io/spotlight/12-gems-backed-by-binance-labs-to-watch-part-1/",
    "description": "<p>Investors may find it hard to search for the right token or coin that fits their needs. Given the large number of cryptocurrencies available. So, one of the easiest ways is to “outsource” the search process to legitimate platforms and launchpads. For example, Binance Labs regularly publishes new listings. So, successful projects must be of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/spotlight/12-gems-backed-by-binance-labs-to-watch-part-1/\">12 Gems Backed by Binance Labs to Watch &#8211; Part 1</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-29T08:24:00.000Z",
    "title": "ADA May Soon Surge as a Result of Cardano’s Positive Fundamentals",
    "url": "https://coinedition.com/ada-may-soon-surge-as-a-result-of-cardanos-positive-fundamentals/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/CARDANO-On-FIRE-Look-At-This-ADA-TARGET.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ADA May Soon Surge as a Result of Cardano’s Positive Fundamentals\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/CARDANO-On-FIRE-Look-At-This-ADA-TARGET.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/CARDANO-On-FIRE-Look-At-This-ADA-TARGET-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/CARDANO-On-FIRE-Look-At-This-ADA-TARGET-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/CARDANO-On-FIRE-Look-At-This-ADA-TARGET-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/CARDANO-On-FIRE-Look-At-This-ADA-TARGET-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/CARDANO-On-FIRE-Look-At-This-ADA-TARGET-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Dan Gambardello predicted in his latest analysis that ADA could soar to as high as $10 in the next bull cycle. The analyst based his bullish prediction on the fact that ADA’s market cap is following the same trend as ETH’s. At press time, ADA was changing hands at $0.2504 following a 2.56% gain over [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ada-may-soon-surge-as-a-result-of-cardanos-positive-fundamentals/\">ADA May Soon Surge as a Result of Cardano’s Positive Fundamentals</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]