[
  {
    "source": "Cointelegraph",
    "date": "2023-07-16T19:15:23.000Z",
    "title": "Bitcoin price support at $30K opens the door for gains from UNI, ARB, AAVE and MKR",
    "url": "https://cointelegraph.com/news/bitcoin-price-support-at-30k-opens-the-door-for-gains-from-uni-arb-aave-and-mkr",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/589fe004-7289-43e5-ae76-e17d89b2888a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price is back in its range, potentially given opportunities for UNI, ARB, AAVE and MKR to move higher.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) attempted to break away from its boring sideways price action on July 13 following Ripple’s legal victory over the United States Securities and Exchange Commission, but the enthusiasm proved to be short-lived. Sellers pulled the price back into the range on July 14, indicating that they remain active at higher levels. However, a positive sign is that the bulls have kept Bitcoin’s price above $30,000.</p><p>Market observers are expected to closely follow the review process for the various exchange-traded fund (ETF) proposals for a spot Bitcoin ETF, prominent being the proposal by BlackRock. Interestingly, out of 550 ETF applications by BlackRock, <a href=\"https://cointelegraph.com/news/blackrock-larry-fink-crypto-will-transcend-international-currencies\">only one has been rejected</a>, according to Bloomberg Intelligence’s Eric Balchunas and James Seyffart.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/4aa2f297-314b-48fc-8fd0-110adfedf296.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto market data daily view. Source:</em><em> </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>Even as Bitcoin consolidates waiting for its next catalyst, several altcoins are witnessing solid buying. This has pulled <a href=\"https://cointelegraph.com/news/altcoin-season-bitcoin-btc-dominance-ripple-xrp-victory\">Bitcoin’s market dominance below 50%</a>, suggesting that the focus could be shifting to the altcoins in the near term.</p><p>Could Bitcoin start a trending move in the short term or will it remain stuck inside the range? What are the altcoins that are looking strong on the charts? Let’s study the charts of top-5 cryptocurrencies that could be on trader's radar in the next few days.</p><h2>Bitcoin price analysis</h2><p>Bitcoin closed above $31,000 on July 13 but that proved to be a bull trap because the bears yanked the price back below the level on July 14. This shows that the bears are fiercely defending the zone between $31,000 and $32,400.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/3375a39f-eb40-4a45-bd85-1b9d1424aebc.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The price action of the past few days has formed a bearish divergence on the RSI. This indicates a weakening bullish momentum. The bears will try to build upon their advantage by pulling the price below the 20-day exponential moving average ($30,187). If they manage to do that, the BTC/USDT pair could descend to the 50-day simple moving average ($28,631).</p><p>If bulls want to prevent the decline, they will have to quickly push and sustain the price above $31,000. The pair could then climb to $32,400. A break and close above this level will clear the path for a potential run to $40,000 as there are no major resistances in between.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/67770bf3-a1d8-4185-a8f0-a31baf2f3d09.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The pair has dropped below the moving averages on the 4-hour chart, indicating that demand dries up at higher levels. The bears will have to sink and sustain the price below $29,500 to start a deeper correction. The pair could then plummet to $27,500.</p><p>Alternatively, the bulls will have to push and sustain the price above $31,000 to start an up-move toward $32,400. If the price turns down from $32,400 but rebounds off $31,000, it will suggest that the bulls have flipped the level into support. The pair may then start a rally to $40,000.</p><h2>Uniswap price analysis</h2><p>Uniswap (<a href=\"https://cointelegraph.com/uniswap-price-index\">UNI</a>) has been taking support at the 20-day EMA ($5.41) during pullbacks indicating that the sentiment has turned positive and traders are buying the dips.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/333450da-17a6-4283-870b-5c232aa5a508.png\"  /><figcaption style=\"text-align: center;\"><em>UNI/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls will try to buy the current dip and push the price above the immediate resistance at $6.16. If they can pull it off, the UNI/USDT pair could rise to $6.50. This level may again act as a strong resistance but if bulls do not give up much ground, the pair could reach $6.70.</p><p>The important support to watch on the downside is the 20-day EMA. A break and close below this level will suggest that the bears are back in the game. The pair may then fall to the 50-day SMA ($5) and later to the crucial support at $4.72.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/10259d4b-4e52-4708-a4aa-835d59a2bffa.png\"  /><figcaption style=\"text-align: center;\"><em>UNI/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The correction on the 4-hour chart has reached the 20-EMA. This is the first important support to watch out for. If the price rebounds off this level, the pair could retest the overhead resistance at $6.17. Above this level, the pair may climb to the resistance line of the ascending channel.</p><p>Contrarily, if the price slips below the 20-EMA, it will suggest that the short-term traders may be booking profits. That could pull the price down to the support line of the channel. If this level cracks, the pair may slide to $5.08. </p><h2>Arbitrum price analysis</h2><p>Arbitrum (ARB) broke and closed above the symmetrical triangle pattern on July 15, indicating that the bulls have overpowered the bears.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/88f06f34-b1c2-42bb-8e7b-292e6630737a.png\"  /><figcaption style=\"text-align: center;\"><em>ARB/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The 20-day EMA ($1.16) has turned up and the RSI has reached near the overbought zone, indicating that the path of least resistance is to the upside. There is a minor resistance at $1.36 but if that level is crossed, the ARB/USDT pair may surge to $1.50. This level may again pose a strong challenge but if bulls overcome it, the rally may extend to $1.70.</p><p>This positive view will invalidate in the near term if the price turns down and plummets below the support line of the triangle. That may trap several aggressive bulls, resulting in a sharp drop to $0.90.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/85e2d4d2-88ac-49cf-a1ba-ed5637f0fb96.png\"  /><figcaption style=\"text-align: center;\"><em>ARB/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The bulls successfully held the retest of the breakout level from the symmetrical triangle, indicating that lower levels are attracting buyers. The bulls will try to build upon this strength by driving the price above $1.36. If they succeed, the pair may pick up momentum.</p><p>On the contrary, if the price turns down from the current level or $1.36, the bulls will again try to drag the pair back into the triangle. If they do that, it will suggest that the recent breakout may have been a bull trap. The pair could then drop to the 50-SMA and subsequently to the support line of the triangle.</p><p><strong><em>Related: </em><a href=\"https://cointelegraph.com/news/buying-dip-bitcoin-supply-moved-30k\"><em>Buying the dip? Record 3.8% of the Bitcoin supply last moved at $30.2K</em></a></strong></p><h2>Aave price analysis</h2><p>Aave (<a href=\"https://cointelegraph.com/aave-price-index\">AAVE</a>) broke and closed above the descending channel pattern on July 3. The bulls successfully held the retest of the breakout level on July 6 and again on July 10. This shows that the bulls flipped the resistance line into support.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/25c70cd4-65de-4915-8907-00bf2b720fb0.png\"  /><figcaption style=\"text-align: center;\"><em>AAVE/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The rising 20-day EMA ($72) and the RSI in the positive territory indicate that the bulls are in command. If the price turns up from the current level or bounces off the 20-day EMA, it will enhance the prospects of a rally above $84.50. The AAVE/USDT pair could then rally to $95.</p><p>Contrary to this assumption, if the price turns down and breaks below the 20-day EMA, it will suggest that the bulls may be losing their grip. The bears will then again try to tug the price back into the descending channel.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/329c1be8-f60d-4441-be20-b2b2c268eb06.png\"  /><figcaption style=\"text-align: center;\"><em>AAVE/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The 4-hour chart shows that the bulls pushed the price above the overhead resistance of $84.50 but they could not sustain the breakout. The bears sold at higher levels and pulled the price back below the 20-EMA.</p><p>Both moving averages have flattened out and the RSI is near the midpoint, indicating a balance between supply and demand. </p><p>If the price breaks below the 50-SMA, the advantage may shift in favor of the bears. The pair could then slide to $68. The advantage will shift in favor of the bulls if they maintain the price above $84.50.</p><h2>Maker price analysis</h2><p>Maker (<a href=\"https://cointelegraph.com/maker-price-index\">MKR</a>) broke above the downtrend line on July 2 and successfully retested the level on July 14. The bounce off this support suggests strong demand at lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/01eb13e4-f9e6-463a-a762-b00e4e1a4329.png\"  /><figcaption style=\"text-align: center;\"><em>MKR/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The upsloping 20-day EMA ($878) and the RSI in the positive zone signal that bulls are in control. Buyers are attempting to resume the up-move but may face stiff resistance near $1,100. If bulls clear this hurdle, the MKR/USDT pair may soar to $1,200.</p><p>On the contrary, if the price turns down from $1,080, it will suggest that bears continue to sell on rallies. The pair could then slump to the 20-day EMA. A break below this level will suggest that the bears are trying a comeback.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/4611d856-c2f4-419f-b7dd-11b2b76f7eda.png\"  /><figcaption style=\"text-align: center;\"><em>MKR/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The 4-hour chart shows that the bulls have pushed the price above the resistance line, indicating that the short-term correction may be over. The price may dip to the resistance line, which is an important level to keep an eye on. </p><p>A strong rebound off this level will suggest that the bulls have flipped the resistance line into support. That will improve the possibility of a break above $1,080.</p><p>This positive view could invalidate in the near term if the price plummets below the moving averages. That could sink the pair to $831.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-16T19:33:57.000Z",
    "title": "Former Ripple director debunks price influence: XRP’s market forces prevail",
    "url": "https://www.cryptopolitan.com/former-ripple-director-debunks-price-influence-xrps-market-forces-prevail/",
    "description": "In a recent Twitter exchange shedding light on Ripple&#8217;s influence on the price of XRP, Matt Hamilton, former Director of Developer Relations at Ripple, provided illuminating insights. Hamilton&#8217;s comments centered on Ripple&#8217;s XRP holdings and their connection to price fluctuations, revealing a more nuanced perspective. Highlighting the scale of Ripple&#8217;s XRP holdings, Hamilton clarified that ... <a title=\"Former Ripple director debunks price influence: XRP&#8217;s market forces prevail\" class=\"read-more\" href=\"https://www.cryptopolitan.com/former-ripple-director-debunks-price-influence-xrps-market-forces-prevail/\" aria-label=\"More on Former Ripple director debunks price influence: XRP&#8217;s market forces prevail\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-16T19:31:59.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-16T19:24:54.000Z",
    "title": "India and UAE sign agreements for trade settlement in national currencies",
    "url": "https://www.cryptopolitan.com/india-and-uae-sign-agreements-trade-settlement-national-currencies/",
    "description": "India and the United Arab Emirates (UAE) have solidified their commitment to enhanced economic cooperation with the signing of agreements on trade settlement in national currencies. The Memoranda of Understanding (MoUs) aims to facilitate seamless cross-border transactions and payments between the two countries, promoting greater economic collaboration. Prime Minister Narendra Modi and the Reserve Bank ... <a title=\"India and UAE sign agreements for trade settlement in national currencies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/india-and-uae-sign-agreements-trade-settlement-national-currencies/\" aria-label=\"More on India and UAE sign agreements for trade settlement in national currencies\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-16T19:14:32.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here&#8217;s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\">Read more</a>"
  }
]