[
  {
    "source": "CoinDesk",
    "date": "2023-06-21T17:14:37.000Z",
    "title": "Why Short Sellers May Have a Hard Time Betting Against Tether",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/21/why-short-sellers-may-have-a-hard-time-betting-against-tether/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto’s most controversial instrument enjoys some notable insulation from skeptical bets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-21T17:20:00.000Z",
    "title": "US lawmakers propose bills to hold bank execs accountable for failures and address risks",
    "url": "https://cointelegraph.com/news/us-lawmakers-propose-bills-to-hold-bank-execs-accountable-for-failures-and-address-risks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/6438fc50-ec09-405f-8b52-79aaf1041b14.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Maxine Waters did not specifically mention crypto in the proposed legislation, drafted in response to the collapse of Silicon Valley Bank, Signature Bank, and First Republic Bank.</p>\n                    <p><p>Democrats with the United States House Financial Services Committee have introduced several bills in what they described as the “first wave” of legislation aimed at addressing failures at major banks.</p><p>In a June 21 announcement, committee ranking member Maxine Waters said House Democrats had backed 11 bills drafted in response to the collapse of Silicon Valley Bank, Signature Bank, and First Republic Bank in the United States. Among the proposed legislation — which has not yet gone to the committee’s Republican members for approval — included measures to impose fines as well as ban bank executives from future work in the industry should they “negligently contribute to their bank’s failure”.</p><p>“The failures of Silicon Valley Bank, Signature Bank, and First Republic Bank make clear that it is past time for legislation aimed at strengthening the safety and soundness of our banking system and enhancing bank executive accountability,” said Rep. Waters. “Congress must not sit idly by.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/BREAKING?src=hash&amp;ref_src=twsrc%5Etfw\">#BREAKING</a>❗<br><br>RM <a href=\"https://twitter.com/RepMaxineWaters?ref_src=twsrc%5Etfw\">@RepMaxineWaters</a> announces the introduction of a first wave of Cmte Democratic bills to respond to the recent failures of <a href=\"https://twitter.com/hashtag/SVB?src=hash&amp;ref_src=twsrc%5Etfw\">#SVB</a>, <a href=\"https://twitter.com/hashtag/SignatureBank?src=hash&amp;ref_src=twsrc%5Etfw\">#SignatureBank</a>, &amp; <a href=\"https://twitter.com/hashtag/FirstRepublicBank?src=hash&amp;ref_src=twsrc%5Etfw\">#FirstRepublicBank</a>, which were the 2nd, 3rd, &amp; 4th largest bank failures in U.S. history. | <a href=\"https://t.co/NOSRBnc4Jc\">https://t.co/NOSRBnc4Jc</a> <a href=\"https://t.co/Dhsn5ZiCMr\">pic.twitter.com/Dhsn5ZiCMr</a></p>&mdash; U.S. House Committee on Financial Services (@FSCDems) <a href=\"https://twitter.com/FSCDems/status/1671531687707123715?ref_src=twsrc%5Etfw\">June 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The House Committee, chaired by Republican Patrick McHenry, often discusses matters concerning digital assets, including oversight of federal regulatory agencies like the Securities and Exchange Commission. Though some lawmakers have <a href=\"https://cointelegraph.com/news/gao-cites-exposure-to-digital-assets-in-exploring-collapse-of-signature-bank\">pointed to digital assets</a> as contributing to the failures of Signature and Silicon Valley Bank, Rep. Waters did not specifically mention crypto or blockchain in the proposed legislation. The lawmaker also did not invoke the crypto-friendly Silvergate Bank — which in March <a href=\"https://cointelegraph.com/news/silvergate-capital-corporation-will-voluntarily-liquidate-silvergate-bank\">announced its voluntary liquidation</a> — in introducing the bills.</p><p>Other measures included in the proposed bills could give regulators the authority to prohibit bank executives from selling stock under certain circumstances — as was the case with Silicon Valley Bank — and have regulators expand banks’ stress testing requirements. One bill suggested restricting bonus payments to bank executives. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bipartisan-support-crypto-regulation-attractive-to-firms-moodys\"><strong><em>Lack of bipartisan support on crypto regulation could make US ‘less attractive’ to firms: Moody’s</em></strong></a></p><p>Rep. Waters said committee Republicans “expressed openness” to some of the legislation at markup, but it’s unclear which bills have any hope of getting through with bipartisan support. Cointelegraph reached out to the California Representative, but did not receive a response at the time of publication.</p><p>Rep. Waters previously <a href=\"https://cointelegraph.com/news/rep-maxine-waters-says-all-us-regulators-better-get-together-on-crypto\">called for coordination and cooperation</a> between government agencies and lawmakers to address crypto regulation. She told Cointelegraph in February she was “still optimistic” a stablecoin bill could pass the committee. Lawmakers <a href=\"https://cointelegraph.com/news/us-house-committee-releases-new-stablecoin-bill-draft\">reviewed a discussion draft</a> of the bill as part of a June 13 hearing on digital assets.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/opinion-republican-crypto-maxis-democrat-anti-crypto-army-mchenry-warren/\"><strong><em>Opinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-21T17:18:51.000Z",
    "title": "3 reasons why Ethereum’s market cap dominance is on the rise",
    "url": "https://cointelegraph.com/news/3-reasons-why-ethereum-market-cap-dominance-is-rising",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/9c2fdc7f-6827-41c4-b4e8-9596510d87f4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin dominance is rising, but so is Ethereum’s share of market dominance among its altcoin competitors. Cointelegraph explains why.</p>\n                    <p><p>Ethereum has been the dominant smart contract and decentralized application (Dapp) network since its inception. An analysis based on Ether’s price (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), and its market capitalization, shows indisputable evidence that the blockchain has been gaining market share over time. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/f13ae011-5dc4-43ae-9a0f-61d30a2620b1.png\"><figcaption style=\"text-align: center;\"><em>Ether market capitalization dominance (%). Source: TradingView</em></figcaption></figure><p>As shown above, Ether’s dominance in market capitalization terms grew over the past couple of years, from an 18% average in July 2021 to the current 20%. Excluding Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) from the analysis, Ether’s market share presently stands at 40.6%, while the next competitor, <a href=\"https://cointelegraph.com/binance-coin-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/binance-coin-price-index\">BNB</a>, holds a 7.2% share.</p><p>This shows the disparity from the leading Dapp-focused network to the incumbents, which is also evident when analyzing the total value locked (TVL) on each network’s smart contracts. Ethereum is the absolute leader with $24.6 billion in TVL, followed by Tron’s $5.4 billion and BNB Chain’s $3.3 billion.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/8b3224d1-252d-417c-a044-bbb399d8d9be.png\"><figcaption style=\"text-align: center;\"><em>Total value locked market share (%). Source: DefiLlama</em></figcaption></figure><p>The above chart depicts the Ethereum network’s TVL market share declining from 70.5% in June 2021 to 49.5% in May 2022. The movement happened while Terra and Avalanche gained a combined 20% market share in smart contract deposits. However, after the<a href=\"https://cointelegraph.com/news/terra-luna-crash-anniversary-community-reflects-on-the-lessons-learned\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/terra-luna-crash-anniversary-community-reflects-on-the-lessons-learned/amp\"> Terra-Luna ecosystem collapse</a> in May 2022, which culminated with developers halting network activity, Ethereum quickly regained a 58% market share. </p><p>Despite the emergence of Dapps on the BNB and Tron blockchains, Ethereum’s leadership has remained unquestioned over the past 12 months. This data shows the irrelevance of the total number of unique active wallets interacting with smart contracts (UAW) per chain.</p><p>For instance, <a href=\"https://dappradar.com/industry-overview\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to DappRadar, WAX has 363,600 active users, followed by BNB Chain's 517,300 30-day UAW. These figures are way higher than the Ethereum network’s 66,300 unique active addresses, but they reflect a much lower transaction fee, opening room for manipulation.</p><h2>Decentralization matters, and Ethereum stands out among its competitors</h2><p>Ethereum is the ecosystem with the highest<a href=\"https://cointelegraph.com/news/number-of-devs-increased-during-crypto-winter-electric-capital-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/number-of-devs-increased-during-crypto-winter-electric-capital-report/amp\"> number of active developers</a>, surpassing 1,870, which is more than the next three competitors combined: Polkadot (752), Cosmos (511), and Solana (383). </p><p>Currently, the Ethereum network has<a href=\"https://cointelegraph.com/news/ethereum-validators-may-have-to-stake-2048-eth-devs-discuss\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ethereum-validators-may-have-to-stake-2048-eth-devs-discuss/amp\"> over 700,000 validators</a>, with 99% of the balances locked in staking participating in the process. The 32 ETH threshold limit per validator undoubtedly inflates this number, but Lido, the largest known staking pool, <a href=\"https://dune.com/queries/1937676/3202670\" target=\"_blank\" rel=\"noopener nofollow\">controls</a> 32% of the staking, with Coinbase coming in second with 9.6%. </p><p>Consequently, it is safe to say that Ethereum is far less centralized in terms of development and validation in comparison to Tron, BNB Chain and Solana.</p><p>Other reasons why Ether’s dominance has been on the rise, even as <a href=\"https://cointelegraph.com/news/bitcoin-btc-reach-50-percent-market-dominance\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-btc-reach-50-percent-market-dominance/amp\">Bitcoin reached a 50% market share</a> on June 19 are: derivatives activity and Ethereum’s dominance of the NFT market </p><h2>Derivatives markets are essential to institutional investors</h2><p>Ether’s future contracts are essential for institutional trading practices like hedging and trading with leverage. Ether’s cash-settled futures were added to the Chicago Mercantile Exchange in February 2021. To date, no other cryptocurrency, apart from Bitcoin, has ever reached the world’s largest derivatives exchange. </p><p>In futures markets, longs and shorts are balanced at all times, but having a larger number of active contracts — open interest — allows the participation of institutional investors who require a minimum market size. Ether futures aggregated open interest stands at $5.4 billion, while competitors BNB hold $380 million and Solana a mere $178 million.</p><h2>Ethereum is still the market leader in NFTs</h2><p>Nonfungible tokens (NFT) are a perfect example of how cheaper and faster transactions do not always translate to increased adoption. There’s nothing stopping NFT projects from shifting between blockchains, whether for new listings or existing collections. In fact,<a href=\"https://cointelegraph.com/news/nft-project-accepted-3m-to-move-its-collection-to-polygon\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/nft-project-accepted-3m-to-move-its-collection-to-polygon/amp\"> y00ts and DeGods moved to Polygon</a> earlier in 2023. </p><p>Despite facing gas fees that oftentimes break above $10, Ethereum remains the absolute leader in the number of buyers and total sales. According to CryptoSlam!, the leading network<a href=\"https://www.cryptoslam.io/\" target=\"_blank\" rel=\"noopener nofollow\"> reached</a> $380 million in sales in the past 30 days, while Solana, Polygon and BNB Chain totaled a combined $93 million.</p><p>Ultimately, the data favors Ethereum versus the competing smart contract-focused blockchains. The positive trend in Ether’s dominance might fade over time if the promised upgrade to allow parallel processing (sharding) does not come to fruition, but for now, Ether’s 20% market capitalization share remains unchallenged.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p>\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-21T17:00:00.000Z",
    "title": "Crypto payment solution Ramp expands on-ramp service, adds support for 40 fiat currencies",
    "url": "https://cointelegraph.com/news/crypto-payment-solution-ramp-expands-on-ramp-service-supports-43-fiat-currencies",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/e68dd094-930f-461d-8b93-9155cf4149de.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ramp expands its platform compatibility with 40 new currencies, including the Bermudian dollar, Costa Rican colón, Hungarian forint, Mexican peso, Singapore dollar and Swiss franc.</p>\n                    <p><p>Ramp, a financial technology company specializing in crypto infrastructure, has announced a significant expansion of its platform’s compatibility, adding 40 new fiat currencies. </p><p>According to a June 21 announcement, the expansion is set to allow users to more easily transact with various digital and traditional currencies across borders while benefiting from favorable conversion rates.</p><p>With its latest expansion, Ramp hopes to empower individuals across 150 countries to convert between cryptocurrencies and 43 fiat currencies. Expanded currency support includes a mix of developed and emerging markets, including the Bermudian dollar, Costa Rican colón, Hungarian forint, Mexican peso, Singapore dollar and Swiss franc.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/1Tx1Dvt9eK4\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>In the cryptocurrency industry, on-ramps facilitate the acquisition of digital assets by allowing individuals to purchase or receive cryptocurrencies using fiat money. On the other hand, off-ramps enable users to convert their cryptocurrencies back into fiat currencies.</p><p>On- and off-ramps are essential for the adoption and usability of cryptocurrencies, as they bridge the gap between the crypto ecosystem and the traditional financial system. They provide a convenient means for individuals to enter or exit the crypto market, enhancing accessibility, liquidity and integration between crypto and fiat currencies.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/robinhood-launches-fiat-to-crypto-on-ramp-for-self-custody-wallets-and-dapps\">Robinhood launches fiat-to-crypto on-ramp for self-custody wallets and DApps</a></em></strong></p><p>In a recent conversation with Cointelegraph, Jameson Lopp, a Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) self-custody advocate and software developer, <a href=\"https://cointelegraph.com/news/bitcoin-self-custody-advocate-explains-why-on-ramps-are-key-to-adoption\">shed light on the significance of on-ramps</a> in driving cryptocurrency adoption. Lopp underscored the importance of increasing the number of on-ramps within the industry to facilitate the acquisition of Bitcoin and stimulate economic activity with the digital currency. </p><p>As an example, he pointed to <a href=\"https://cointelegraph.com/news/apple-to-delist-nostr-based-damus-app-for-bitcoin-tip-feature\">Nostr</a>, a decentralized social media platform that has integrated the Bitcoin layer-2 Lightning Network protocol, effectively encouraging the use of Bitcoin.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/hong-kong-crypto-exchanges-do-kwon-jail-korean-crypto-lenders-contagion-asia-express/\"><strong><em>Korean crypto contagion, Bank of China on Ethereum, HK’s exchange red carpet: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-21T17:33:27.000Z",
    "title": "Mysterious whale ‘0xd275e’ linked to FTX collapse, Tether depeg, and recent $75M token transfers",
    "url": "https://cryptoslate.com/mysterious-whale-0xd275e-linked-to-ftx-collapse-tether-depeg-and-recent-75m-token-transfers/",
    "description": "<p>Recent on-chain activity involving the Ethereum address &#8216;0xd275e&#8216; has caught the attention of the crypto community. Through CryptoSlate&#8216;s on-chain analysis, no concrete evidence pointing to the owner of the account has been discovered. However, the account has actively traded large amounts of tokens during key industry events. The whale account has been identified during on-chain [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/mysterious-whale-0xd275e-linked-to-ftx-collapse-tether-depeg-and-recent-75m-token-transfers/\">Mysterious whale &#8216;0xd275e&#8217; linked to FTX collapse, Tether depeg, and recent $75M token transfers</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-21T16:43:19.000Z",
    "title": "Crypto community voices skepticism over OPNX x 3AC Ventures partnership",
    "url": "https://cryptoslate.com/crypto-community-voices-skepticism-over-opnx-x-3ac-ventures-partnership/",
    "description": "<p>OPNX has announced a partnership with 3AC Ventures &#8211; a move that did not go down well with the crypto community. A June 21 tweet detailed the purpose of the partnership is to develop the OPNX ecosystem, suggesting plans to expand beyond its current capacity &#8211; no further details were given. &#8220;The partnership will invest [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/crypto-community-voices-skepticism-over-opnx-x-3ac-ventures-partnership/\">Crypto community voices skepticism over OPNX x 3AC Ventures partnership</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T16:53:16.000Z",
    "title": "BIS Backs Tokenization, But Disses Crypto as “Flawed System”",
    "url": "https://cryptodaily.co.uk/2023/06/bis-backs-tokenization-but-disses-crypto-as-flawed-system",
    "description": "<p>In a new report, the BIS has expressed its approval for tokenizing assets, releasing a blueprint for a global &ldquo;unified ledger,&rdquo; but described crypto as a &ldquo;flawed system.&rdquo; </p>\n<p>The Bank of International Settlements on Tuesday released a plan for a global &ldquo;unified ledger&rdquo; which would support central bank digital currencies (CBDCs) and tokenized assets. The BIS, which is regarded as the central bank of central banks described in a report detailing the future of the monetary system, that tokenization, or converting money and other assets into digital tokens that can be traded on programmable platforms, says it offers a &ldquo;major leap&rdquo; in the financial system.</p>\n<p>While advocating for a centralized option, the BIS described decentralized cryptocurrencies as a &ldquo;flawed system.&rdquo; Moreover, the report said:</p>\n\n<p>Crypto and decentralized finance (DeFi) have offered a glimpse of tokenization&rsquo;s promise, but crypto is a flawed system that cannot take on the mantle of the future of money.</p>\n\n<p>The BIS also further argued that &ldquo;crypto has collapsed&rdquo; and said the successful use of tokenization relies on the trust provided by central banks.</p>\n\n<p>The collapse of crypto and the faltering progress of other tokenization projects underline a key lesson: tokenization&rsquo;s success rests on the foundation of trust provided by central bank money and its capacity to knit together key elements of the financial system.</p>\n\nTokenization is &ldquo;The Next Logical Step&rdquo;\n<p>The bank further asserts that tokenization is &ldquo;the next logical step&rdquo; in asset transfer and digital record keeping. It said:</p>\n\n<p>Tokenization could dramatically enhance the capabilities of the monetary and financial system by harnessing new ways for intermediaries to interact in serving end users, removing the traditional separation of messaging, reconciliation and settlement.</p>\n\nBIS Identifies Smart Contracts as a Significant Use Case of a Unified Ledger &nbsp;\n<p>In making its case for a unified ledger, the BIS identified its potential use case. The bank identifies smart contracts which could open the door to new types of &ldquo;arrangements and transactions that &ldquo;could expand the universe of possible contracting outcomes.&rdquo;</p>\n<p>The report outlines that smart contracts can overcome coordination problems frequently occurring in joint ventures. It states blockchain technology could add to the stability of bank funding and eliminate free-riding.</p>\n\n<p>A smart contract could specify that each participant contributes only a certain amount to a joint venture if all other participants also contribute, this way, free-riding is eliminated.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-21T17:30:31.000Z",
    "title": "Fed Chair Powell Signals More Rate Hikes This Year as Taming Inflation Has ‘Long Way to Go’",
    "url": "https://news.bitcoin.com/fed-chair-powell-signals-more-rate-hikes-this-year-as-taming-inflation-has-long-way-to-go/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/powell-rate-hikes-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Fed Chair Powell Signals More Rate Hikes This Year as Taming Inflation Has &#039;Long Way to Go&#039;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/powell-rate-hikes-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/powell-rate-hikes-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/powell-rate-hikes-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/powell-rate-hikes-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/powell-rate-hikes-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/powell-rate-hikes-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/powell-rate-hikes.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Federal Reserve Chairman Jerome Powell has signaled more interest rate hikes this year. “Given how far we’ve come, it may make sense to move rates higher but to do so at a more moderate pace,” the Fed chair told U.S. lawmakers. “Inflation pressures continue to run high, and the process of getting inflation back down [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T17:21:28.000Z",
    "title": "Binance launches new crypto exchange in Kazakhstan amid regulation trouble",
    "url": "https://www.cryptopolitan.com/binance-launches-new-crypto-exchange/",
    "description": "The largest cryptocurrency exchange Binance is expanding its presence in Kazakhstan with the launch of a local exchange amid ongoing regulatory concerns in the United States. The move follows Binance obtaining a license from the AIFC Financial Services Authority (AFSA) in October 2022, allowing the company to manage a digital asset platform and provide custodial ... <a title=\"Binance launches new crypto exchange in Kazakhstan amid regulation trouble\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-launches-new-crypto-exchange/\" aria-label=\"More on Binance launches new crypto exchange in Kazakhstan amid regulation trouble\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T17:11:15.000Z",
    "title": "How Can You Make A Lot of Money from Meme Coin Trading?",
    "url": "https://www.cryptopolitan.com/make-money-from-meme-coin-trading/",
    "description": "In the dynamic sphere of cryptocurrency, the recent phenomenon of Meme Coins has been gaining notable traction. These unique digital assets, borne from internet culture and humor, offer an innovative, albeit unpredictable, avenue for capital growth. The lure of rapid, substantial financial gains, evidenced by stories of overnight millionaires, has drawn global attention to this ... <a title=\"How Can You Make A Lot of Money from Meme Coin Trading?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/make-money-from-meme-coin-trading/\" aria-label=\"More on How Can You Make A Lot of Money from Meme Coin Trading?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T17:03:02.000Z",
    "title": "Ledger releases highly anticipated white paper for Ledger recover",
    "url": "https://www.cryptopolitan.com/ledger-releases-highly-anticipated-white-paper-for-ledger-recover/",
    "description": "Ledger, the industry-leading provider of Bitcoin wallets, has taken a significant step towards openness and cooperation by releasing the highly anticipated white paper for their innovative Ledger Recover product. This revolutionary service has garnered widespread approval within the cryptocurrency community, as it offers a key recovery solution for Ledger Nano X owners who have lost ... <a title=\"Ledger releases highly anticipated white paper for Ledger recover\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ledger-releases-highly-anticipated-white-paper-for-ledger-recover/\" aria-label=\"More on Ledger releases highly anticipated white paper for Ledger recover\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T17:00:15.000Z",
    "title": "Singapore’s Monetary Authority unveils innovative guidelines for crypto assets",
    "url": "https://www.cryptopolitan.com/singapores-monetary-authority-unveils-innovative-guidelines-for-crypto-assets/",
    "description": "The Monetary Authority of Singapore (MAS) has taken a significant stride towards creating a uniform regulatory framework for using crypto assets. MAS has proposed a comprehensive set of guidelines to govern the evolving digital currency landscape in a groundbreaking move. The move aims to provide clarity and security while fostering innovation in cryptocurrencies. Purpose-bound money ... <a title=\"Singapore&#8217;s Monetary Authority unveils innovative guidelines for crypto assets\" class=\"read-more\" href=\"https://www.cryptopolitan.com/singapores-monetary-authority-unveils-innovative-guidelines-for-crypto-assets/\" aria-label=\"More on Singapore&#8217;s Monetary Authority unveils innovative guidelines for crypto assets\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T16:55:10.000Z",
    "title": "Binance announces  zero-fee TUSD trading amid regulatory headwinds",
    "url": "https://www.cryptopolitan.com/binance-announces-zero-fee-tusd-trading-amid-regulatory-headwinds/",
    "description": "Binance has announced a new zero-fee promotion for TrueUSD (TUSD) trading pairs. However, this strategic move, scheduled to commence on June 30, 2023, is predicted to stimulate the crypto-market dynamics by extending its feeless trading opportunity to a wider audience. The introduction of zero maker fees on all TUSD spot and margin trading pairs is ... <a title=\"Binance announces  zero-fee TUSD trading amid regulatory headwinds\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-announces-zero-fee-tusd-trading-amid-regulatory-headwinds/\" aria-label=\"More on Binance announces  zero-fee TUSD trading amid regulatory headwinds\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T16:42:05.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-21T17:00:07.000Z",
    "title": "Bitcoin Cash Surges 20% In One Day As Market Rebounds, What’s Next? ",
    "url": "https://www.newsbtc.com/news/bitcoin-cash/bitcoin-cash-surges-20-in-one-day-as-market-rebounds-whats-next/",
    "description": "The crypto market entered an upward trajectory in the past 24 hours, with most coins, including Bitcoin Cash (BCH), making notable price moves. Speculations and anticipation around BlackRock’s spot BTC application, and the recent WisdomTree and Invesco filing, could be driving the surge. Also, the just-launched Wall Street-backed crypto exchange EDX must have contributed, to a large extent, to the improved market sentiment. The total crypto market cap has already increased 5.74% in the last 24 hours as Bitcoin tallies a 7.94% gain over the same time frame, propelling its weekly gain to 11.73%.  BCH Price Outlook Following the brief consolidation and sporadic price action triggered by heightened regulatory uncertainty, the bulls are leading the market. Assets prices ticked positive in the last 24 hours. As Bitcoin fights to break the $29,000 mark, its close relative, Bitcoin Cash, has put on an incredible performance in the background. Related Reading: Nansen Forecast For Bitcoin Bull Run: Regulatory Clarity And Lower Inflation Bitcoin Cash’s (BCH) price has surged over 21.20% in the last day with the recent bullish momentum. The asset&#8217;s remarkable performance pushed it atop the chartsand it is now the top-gaining coin of the day, June 21, with a 22.10% price gain in the last seven days. Bitcoin Cash&#8217;s appearance on the EDX exchange boosted social sentiment, massively pushing network activity. The token trading volume has increased massively from $76.86 million, recorded yesterday, June 20, to $382 million today. The increase represents over 493% in 24 hours. Also, BCH trades at $129.21, with a 21.20% price increase over the past 24 hours. What&#8217;s Behind The Price Rally? One of the reasons for BCH&#8217;s performance is the newly launched crypto exchange, EDX, backed by Fidelity Investments, Charles Schwab, and other Wall Street market leaders. The crypto exchange went live today, June 21, and currently, it supports only Bitcoin (BTC), Litecoin (LTC), Ethereum (ETH), and Bitcoin Cash (BCH). A crypto exchange supported by top Wall Street participants suggests more institutional investors and mainstream crypto adoption is underway. Now, investor sentiment has turned bullish following spot BTC ETF applications by three leading asset managers.  According to reports, BlackRock’s Bitcoin ETF application encouraged two others (WisdomTree Investment and Invesco) to step forward. The world&#8217;s largest asset manager filed for a spot Bitcoin exchange-traded fund (ETF) with the US Securities and Exchange Commission (SEC) on June 15.  Related Reading: Why Are Bitcoin And Crypto Up Today? You Need To Know This The SEC had previously denied the approval of other firms&#8217; BTC ETF applications. However, many believe BlackRock would succeed due to its reputation and connections. This is also because BlackRock has a high success rate in previous ETF applications, hence the market’s optimism.  An approved BTC spot ETF would boost Bitcoin’s legitimacy and encourage institutional investment, improving the asset market outlook. As such, the market sentiment rapidly shifted. On June 20, the Fear &#38; Greed Index pointed towards &#8220;Neutral&#8221; but now flags Greed after today&#8217;s market rebound. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T17:37:30.000Z",
    "title": "Proposal to Increase Staking Amount for Ethereum Validators: Enhancing Network Efficiency and Improving Infrastructure Management",
    "url": "https://www.crypto-news-flash.com/proposal-to-increase-staking-amount-for-ethereum-validators-enhancing-network-efficiency-and-improving-infrastructure-management/?utm_source=rss&utm_medium=rss&utm_campaign=proposal-to-increase-staking-amount-for-ethereum-validators-enhancing-network-efficiency-and-improving-infrastructure-management",
    "description": "Ethereum developers are pushing for a proposal to increase the maximum staking amount.  Although community members are critical of the proposal, some market players remain confident that the proposal will facilitate decentralization.  During the recently held Ethereum blockchain Core Developers Conference, developers discussed the potential integration of a new proposal. According to Michael Noider, a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T17:14:09.000Z",
    "title": "Ethereum Overtakes Altcoins in Market Cap, Solidifying Its Dominance as Bitcoin’s Rival",
    "url": "https://www.crypto-news-flash.com/ethereum-overtakes-altcoins-in-market-cap-solidifying-its-dominance-as-bitcoins-rival/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-overtakes-altcoins-in-market-cap-solidifying-its-dominance-as-bitcoins-rival",
    "description": "Bitcoin and Ethereum have both solidified their dominance in the crypto ecosystem. The rebooted sentiment that led to a price surge was fueled by BlackRock&#8217;s Bitcoin ETF bid. The global cryptocurrency market is presently overtaken by a wave of recovery that has sent the dominance of Bitcoin (BTC) and Ethereum (ETH) into new territory.  For [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T17:00:02.000Z",
    "title": "Axelar (AXL) Price Prediction: Can Uwerx or AXL Pump Bags?",
    "url": "https://www.crypto-news-flash.com/axelar-axl-price-prediction-can-uwerx-or-axl-pump-bags/?utm_source=rss&utm_medium=rss&utm_campaign=axelar-axl-price-prediction-can-uwerx-or-axl-pump-bags",
    "description": "In the fast-paced world of cryptocurrencies, Uwerx and Axelar (AXL) have emerged as promising digital assets with the potential to transform your financial future. With their unique features and enticing price predictions, these tokens present exciting investment opportunities. In this article, we take a look at the critical aspects of both Uwerx and Axelar (AXL), [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-21T17:01:00.000Z",
    "title": "BTC Rallies Toward $30K With Significant Momentum in Latest Surge",
    "url": "https://coinedition.com/btc-rallies-toward-30k-with-significant-momentum-in-latest-surge/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/btc-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BTC Rallies Toward $30K With Significant Momentum in Latest Surge\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/btc-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/btc-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/btc-3-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/btc-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/btc-3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/btc-3-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/btc-3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/btc-3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/btc-3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/btc-3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/btc-3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/btc-3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/btc-3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/btc-3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/btc-3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/btc-3-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bitcoin’s price embarked on a fresh rally, surging past the $29,000 mark with significant momentum. According to the market intelligence platform IntoTheBlock, BTC could climb over $30,000 in the current rally, considering the few historical buy orders around the region. In a recent tweet, IntoTheBlock revealed that relatively few holders acquired Bitcoin around the $30,000 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/btc-rallies-toward-30k-with-significant-momentum-in-latest-surge/\">BTC Rallies Toward $30K With Significant Momentum in Latest Surge</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-21T16:55:54.000Z",
    "title": "Payments Giant Mastercard Files Trademark for Set of Crypto and Blockchain Tools",
    "url": "https://dailyhodl.com/2023/06/21/payments-giant-mastercard-files-trademark-for-set-of-crypto-and-blockchain-tools/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/giant-files-set-tools.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/giant-files-set-tools.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/giant-files-set-tools.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/giant-files-set-tools.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/giant-files-set-tools.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/giant-files-set-tools.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/giant-files-set-tools.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Payments processing giant Mastercard is filing a trademark application for a number of crypto blockchain tools in its latest advancement in the digital asset space. According to the U.S. Patent and Trademark Office application, Mastercard intends to introduce software for crypto transactions and create links between virtual asset service providers. Says the trademark filing, “MASTERCARD [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/21/payments-giant-mastercard-files-trademark-for-set-of-crypto-and-blockchain-tools/\">Payments Giant Mastercard Files Trademark for Set of Crypto and Blockchain Tools</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-21T16:44:39.000Z",
    "title": "Struct Finance Launches Customizable Interest Rate Products, Enabling DeFi Users To Earn Predictable Returns",
    "url": "https://dailyhodl.com/2023/06/21/struct-finance-launches-customizable-interest-rate-products-enabling-defi-users-to-earn-predictable-returns/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2022/03/Struct-Finance-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/03/Struct-Finance-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2022/03/Struct-Finance-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2022/03/Struct-Finance-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2022/03/Struct-Finance-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2022/03/Struct-Finance-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>June 21, 2023 – Tortola, British Virgin Islands Struct Finance – a DeFi platform that enables investors to engage with tailored structured financial products linked to digital assets – today announced the mainnet launch of its innovative &#8216;interest rate vaults&#8217; and unique tranching mechanism. Amid the highly volatile crypto industry, users can now invest in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/21/struct-finance-launches-customizable-interest-rate-products-enabling-defi-users-to-earn-predictable-returns/\">Struct Finance Launches Customizable Interest Rate Products, Enabling DeFi Users To Earn Predictable Returns</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]