[
  {
    "source": "Decrypt",
    "date": "2023-11-11T03:47:40.000Z",
    "title": "Billionaire Bryan Johnson Has Burned $4 Million Chasing Youth and Virility",
    "url": "https://decrypt.co/205729/bryan-johnson-longevity-blueprint-sleep-gene-therapy-kate-tolo",
    "description": "Kate Tolo, the first woman to commit to Johnson's \"Blueprint,\" was drawn to its intersection with artificial intelligence."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-11T04:00:50.000Z",
    "title": "XRP Price Outlook: Expert Forecasts Potential Rise To $5.5",
    "url": "https://www.newsbtc.com/xrp-news/xrp-price-outlook-expert-forecasts-potential-rise-to-5-5/",
    "description": "In the evolving cryptocurrency market, XRP, currently ranked as the fifth largest digital asset, has recently exhibited a modest price increase compared to its major counterparts.  However, when examining XRP&#8217;s performance across various time frames, the token has reported significant gains. Nonetheless, it is worth noting that XRP is currently trading well below its yearly high, in contrast to its peers who have achieved and surpassed new highs in 2023 during the recent bullish surge. Impending XRP Price Breakout? Prominent industry expert using the pseudonym &#8220;Crypto Insight&#8221; on the X platform (formerly known as Twitter) shared an intriguing update with his over 20,000 followers, signaling an impending XRP blastoff. According to Crypto Insight, it becomes apparent that XRP tends to lag behind the price action of Bitcoin (BTC), the leading cryptocurrency. However, there are indications that XRP breakouts are gradually converging with the movements of BTC. Related Reading: Algorand (ALGO) NFT Rewards Skyrocket: Transactions Surge 320% In Q3 Analyzing historical data, Crypto Insight highlights that the time taken for XRP to experience significant breakouts has been decreasing over time.  The first major breakout took approximately 22 days, while the most recent pump occurred within a shorter time frame of 13 days. If this trend of closing the gap between XRP and BTC continues, it suggests a potential breakout date around November 15th. Additionally, XRP has undergone a cooling-off period in the 4-hour time frame, implying that there might be further room for a downside correction before a reversal to the upside occurs. Crypto Analyst Targets $5.5 Crypto analyst Egrag Crypto has recently unveiled a noteworthy forecast for XRP, centering around the Multi-Year Ascending Triangle (MYAT) pattern, which holds significant implications for XRP&#8217;s price movements. According to Egrag’s analysis, The MYAT pattern indicates that XRP experienced a breakout above the Symmetrical Triangle after reaching the 70% completion mark, which aligns with the timeline of July on the chart.  Related Reading: What Is Shiba Inu: An Explainer And SHIB Price Prediction The surge in price to $0.93 and the subsequent retest at the breakout point are seen as part of a standard retest process, indicating potential strength in the upward momentum. Looking ahead, Egarg Crypto highlights several key projections for XRP: XRP appears to be poised to reach a target of $1.3, as indicated by the Blue Ascending Triangle on the chart. This level represents a significant milestone that XRP could potentially achieve in the near future. The next notable move for XRP could potentially propel it to $5.5. However, it is important to note that at this price level, a considerable selloff by retail investors is anticipated, according to Egrag.  Building upon the larger symmetrical triangle pattern, Egarg Crypto suggests that XRP could see a remarkable 500% price increase in the future, indicating the potential for a substantial pump.  Currently, XRP is grappling with the challenge of establishing consolidation above the crucial $0.600 level, which holds significant implications for the cryptocurrency&#8217;s future price uptrend and overall prospects. In the past 30 days, XRP has recorded a gain of 35%.  However, the sustainability of this price action for the anticipated second leg up in November remains uncertain. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-11T04:08:02.000Z",
    "title": "Wells Fargo Refuses To Refund Customer After Thousands of Dollars Allegedly Exits Bank Account Without Authorization: Report",
    "url": "https://dailyhodl.com/2023/11/10/wells-fargo-refuses-to-refund-customer-after-thousands-of-dollars-allegedly-exits-bank-account-without-authorization-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/bank-wells-dollar.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/bank-wells-dollar.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/bank-wells-dollar.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/bank-wells-dollar.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/bank-wells-dollar.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/bank-wells-dollar.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/bank-wells-dollar.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>One of America&#8217;s biggest banks is reportedly refusing to reimburse a customer after thousands of dollars vanished from his account. Mike Mitchell, who runs a home rental company in Florida, says he recently realized $3,771 left his business account at Wells Fargo without his authorization, reports the CBS-affiliated news station WKMG. According to the National [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/10/wells-fargo-refuses-to-refund-customer-after-thousands-of-dollars-allegedly-exits-bank-account-without-authorization-report/\">Wells Fargo Refuses To Refund Customer After Thousands of Dollars Allegedly Exits Bank Account Without Authorization: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]