[
  {
    "source": "CoinDesk",
    "date": "2023-11-13T17:30:04.000Z",
    "title": "Crypto Fund Inflows of $293M Bring Yearly Total Above $1B: CoinShares",
    "url": "https://www.coindesk.com/markets/2023/11/13/crypto-fund-inflows-of-293m-bring-yearly-total-above-1b-coinshares/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Ethereum related products witnessed the largest amount of inflows since August 2022."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-13T17:19:34.000Z",
    "title": "Price analysis 11/13: SPX, DXY, BTC, ETH, BNB, XRP, SOL, ADA, DOGE, LINK",
    "url": "http://cointelegraph.com/news/price-analysis-11-13-spx-dxy-btc-eth-bnb-xrp-sol-ada-doge-link",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/27055707-309c-41ba-9bf2-6f2741020b69.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin opened the week with a shallow correction, but altcoin traders seem unaffected by the slight BTC price pullback.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has risen more than 120% year-to-date, indicating that the crypto sentiment has improved significantly. Solid buying has resulted in a sharp increase in <a href=\"https://cointelegraph.com/news/bitcoin-millionaire-wallets-triple-this-year\">crypto wallets holding more than $1 million</a> in Bitcoin this year from 23,795 on Jan. 1 to 81,925 currently, according to BitInfoCharts data.</p><p>After the substantial rally, Bitcoin could face headwinds in the near term as investors digest the <a href=\"https://cointelegraph.com/news/funding-rates-69k-btc-price-5-things-bitcoin-this-week\">macroeconomic data and events due this week</a>. The Consumer Price Index data is set to be released on Nov. 14, followed by the Producer Price Index data on Nov. 15, and the Nov. 17 deadline to avoid a partial United States government shutdown could give rise to short-term volatility.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/a3914051-6f6a-482e-b22d-e1da5b03daf3.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>A short-term pullback is healthy for the long-term trend of the market. It is also likely to be viewed as a buying opportunity by traders as most analysts anticipate Bitcoin to rally in 2024, buoyed by the expectations of a spot Bitcoin exchange-traded fund finally receiving regulatory approval.</p><p>Will Bitcoin and select altcoins start a short-term correction, or will the bulls maintain their buy pressure and clear the respective overhead resistance levels? Let’s analyze the charts to find out.</p><h2>S&P 500 Index price analysis</h2><p>The S&amp;P 500 Index (SPX) snapped back from the neckline on Nov. 9, indicating that the bulls are buying on every minor dip.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/8456c933-db55-460d-a4d3-1ca174d680eb.png\"  /><figcaption style=\"text-align: center;\"><em>SPX daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=TVC%3ASPX\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The 20-day exponential moving average (4,319) has started to turn up, and the relative strength index (RSI) has risen into the positive zone, indicating that the bulls are in command. A break and close above the downtrend line will clear the path for a rally to 4,512.</p><p>However, the bears are unlikely to give up easily. They will try to fiercely protect the downtrend line and drag the price below the neckline. If they do that, the index may drop to the 20-day EMA. Sellers will have to sink the price below the 20-day EMA to come out on top.</p><h2>U.S. Dollar Index price analysis</h2><p>The U.S. Dollar Index (DXY) tumbled below the descending channel pattern on Nov. 3, but the bears could not build upon this advantage and start a deeper correction.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/7b8e3b91-cb5a-4f8a-9b33-338f0aed3a74.png\"  /><figcaption style=\"text-align: center;\"><em>DXY daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=TVC%3ADXY\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>That started a recovery, which has reached the 20-day EMA (105.92). If the price turns down sharply from the current level, it will suggest that the sentiment has turned negative and traders are selling at the 20-day EMA. That could pull the price down to the 38.2% Fibonacci retracement level of 104.38.</p><p>On the other hand, if bulls propel the price above the 20-day EMA, the index could rise to the resistance line of the descending channel pattern. </p><h2>Bitcoin price analysis</h2><p>Bitcoin has been holding near the channel’s resistance line for the past four days, but the bulls have failed to start the next leg of the uptrend. This suggests that demand dries up at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/5f29d0f0-fbdc-4aac-b99b-57ead4796864.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If the price re-enters inside the channel, it will suggest that the breakout on Nov. 9 may have been a bull trap. Short-term traders may book profits, pulling the price toward the 20-day EMA ($34,961). </p><p>The overbought level on the RSI also warns of a possible correction or consolidation in the near term. The correction may extend to $32,400 and eventually to $31,000 if the bears yank the BTC/USDT pai below the channel. </p><p>Conversely, if the price turns up sharply and ascends above $38,000, it will indicate the start of a rally to $40,000.</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) rebounded off the psychological level at $2,000 on Nov. 12, indicating that the bulls are trying to flip the level into support.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/f0364d78-1c0a-43a8-9ef0-6824a5909264.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AETHUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Buyers will make one more attempt to overcome the obstacle at $2,200. If they succeed, the ETH/USDT pair could pick up momentum and soar toward $3,000, as there is no major resistance level in between.</p><p>Meanwhile, the bears are likely to have other plans. They are likely to mount a vigorous defense at $2,200. If the price turns down from this level, the pair may consolidate between $2,000 and $2,200 for a few days. The short-term trend will turn negative if the price breaks and sustains below $2,000. The pair may then collapse to the 20-day EMA ($1,908).</p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) has been consolidating between $240 and $258 for the past few days. This has pulled the RSI down from the overbought zone.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/e67d7498-224d-4af3-87ae-36fb5f63d21b.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABNBUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The upsloping 20-day EMA ($238) and the RSI in the positive territory indicate an advantage to buyers. If the price rebounds off the 20-day EMA, the bulls will try to propel the BNB/USDT pair to $265. This level may again witness a tough battle between the bulls and the bears, but if cleared, the pair may surge to $285.</p><p>On the downside, the bears will have to yank the price below $235 to indicate the start of a deeper connection to the 50-day SMA ($222).</p><h2>XRP price analysis</h2><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) has been trading below $0.67 for the past few days, but a positive sign is that the bulls have not allowed the price to skid below the 20-day EMA ($0.62).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/a94de340-6f7b-4bb7-8208-497d98722060.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AXRPUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The tight consolidation near $0.67 enhances the prospects of a break above it. If that happens, the XRP/USDT pair could jump to $0.74. This level may pose a challenge, but it is likely to be crossed. That could start a rally toward $0.85.</p><p>Contrary to this assumption, if the price turns down and breaks below the 20-day EMA, it will indicate that the bulls have given up. That could sink the pair toward the next significant support at $0.56.</p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) skyrocketed above the $48 resistance on Nov. 10 and ascended the $59 level on Nov. 11, but the bulls are facing stiff opposition from the bears. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/42869e59-11cc-4b3d-a575-0642ecaaf614.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ASOLUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The rally of the past few days pushed the RSI above 88, indicating that the rally is overextended and a correction or consolidation may be around the corner. If the price turns down from the current level, the SOL/USDT pair could slide to $48. This level is likely to attract buyers who will try to flip $48 into support. </p><p>On the contrary, if the $48 level gives way, it will suggest that the traders are rushing to the exit. The pair may then decline to the 20-day EMA ($43).</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-institutional-inflows-1b-2023-btc-supply-squeeze\"><strong><em>Bitcoin institutional inflows top $1B in 2023 amid BTC supply squeeze</em></strong></a></p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) pushed through the barrier at $0.38 on Nov. 10, but the bulls failed to build upon the recovery. This indicates that the bears are fiercely defending the $0.38 level.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/17c60f5a-59b6-434e-b720-e962924bb125.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AADAUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Sellers will try to tug the price to the 20-day EMA ($0.34). If bulls want to maintain their hold, they will have to guard the 20-day EMA with vigor. A strong rebound off this level will increase the likelihood of a rally above $0.38. The pair may first rise to $0.42 and subsequently to $0.46.</p><p>Alternatively, if the price continues lower and plummets below the 20-day EMA, it will indicate that the ADA/USDT pair may spend some time inside the large range between $0.24 and $0.38.</p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) rose above $0.08 on Nov. 11, but the bulls could not sustain the higher levels as seen from the long wick on the day’s candlestick.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/6ddc1f39-2200-4955-9775-70eb020a012f.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOGEUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The failure to maintain above the overhead hurdle has started a pullback toward the 20-day EMA ($0.07). Buyers will try to defend this level and start a rebound off it. If they manage to do that, the DOGE/USDT pair could rally to $0.08. This is an important level to watch out for because a break above it could open the doors for a rally to $0.10.</p><p>Contrarily, a break and close below the 20-day EMA will signal that the pair may stay range-bound between $0.06 and $0.08 for some time.</p><h2>Chainlink price analysis</h2><p>Chainlink’s (<a href=\"https://cointelegraph.com/chainlink-price-index\">LINK</a>) solid rally of the past few days pushed the RSI above 86, indicating that the rally was overextended in the near term.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/66d257ec-c84a-414c-bf5d-0e3a805c603c.png\"  /><figcaption style=\"text-align: center;\"><em>LINK/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=OKX%3AlinkUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>That may have tempted short-term traders to book profits near $16.60 on Nov. 12. The LINK/USDT pair could pullback to the 38.2% Fibonacci retracement level of $14.27 and then to the 50% retracement level of $13.55.</p><p>The real test will be at the 20-day EMA ($13). A strong rebound off this level will suggest that buyers continue viewing the dips as a buying opportunity. That may push the price toward $16.60. If this level is scaled, the pair may reach $18. This bullish view will be invalidated in the near term if the price slips and maintains below the 20-day EMA.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-13T17:13:34.000Z",
    "title": "History tells us we’re in for a strong bull market with a hard landing ",
    "url": "http://cointelegraph.com/news/history-tells-us-strong-bull-market-hard-landing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/c365fe84-7b5a-4179-a64b-5417ef79f8ab.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Consumer debt is at a record high, a fact that will weigh on the market in 2024. Yet, it's safe to say central banks will keep rewriting the rules to keep the economy at full steam.</p>\n                    <p><p>While the United States Federal Reserve decided to hold interest rates at its November meeting, they remain at their highest level since well before the global financial crisis (GFC) of 2008-09. The Federal Funds rate stands at 5.25-5.5%, similar to the United Kingdom’s 5.25%, while in the European Union it is at a record high of 4%.</p><p>This is being driven by high inflation, which remains sticky throughout the developed Western world. It is so sticky that some, including Citadel’s Ken Griffin, are predicting it will hang around for a decade or more. As such, central banks are now musing on <a href=\"https://cointelegraph.com/news/high-interest-rates-exactly-what-crypto-market-needs\">higher rates</a> that may last longer.</p><p>This is a significant departure from what has become the norm over the past 15 years: ultra-low interest rates facilitated by never-ending cycles of borrowing at the government, corporate and individual levels. This constant flow of money led to a strong, uniform rally following the GFC, and kept equity markets on life support during the worst global health crisis in over 100 years.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-halving-months-away-may-time-risk-on\"><strong><em>With Bitcoin’s halving months away, it may be time to go risk-on</em></strong></a></p><p>Understandably, then, investors are nervous about what an end to this regime could look like, and they are right to be so. If history has taught us anything, it’s that capitalism is a boom-and-bust game. And right now, we are at the beginning of a fresh cycle.</p><p>While most of us look straight to 2008 to understand our current situation, it’s helpful to look back a bit further. Between 1993 and 1995, U.S. interest rates rose rapidly as a flash crash in 1989, high inflation, and tensions in the Middle East put pressure on the world’s largest economy. In response, the Federal Reserve raised rates from 3% in 1993 to 6% by 1995.</p><p>Far from hurting the U.S. or its Western trading partners, though, that rise witnessed the start of an incredible period of growth. Between 1995 and 1999, the S&amp;P 500 more than tripled in value, while the NASDAQ composite index rose a staggering 800%.</p><p>This was a period of globalization, innovation, and optimism that led to the creation of what has become the backbone of not just the global economy, but the life of every human being on the planet: the Internet. This didn’t last, though, and by October 2002, the dot.com bubble had burst and the NASDAQ had given up all of its gains.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-beyond-35k-christmas-thank-jerome-powell\"><strong><em>Bitcoin beyond 35K for Christmas? Thank Jerome Powell if it happens</em></strong></a></p><p>Today, we also find ourselves emerging from a brutal period of high inflation and high interest rates, against a backdrop of rising tensions in Europe and the Middle East. Similarly, though, the economy is doing remarkably well, despite everything it has faced since the Covid-19 pandemic.</p><p>We can also draw parallels between the dot-com boom and crypto. January will almost certainly spell one or more U.S. Bitcoin spot ETF approvals, which will drive huge waves of institutional money into this relatively new asset class. This could potentially spur a wave of IPO activity inside and outside the industry that, as it did in 1999, could eventually go bang.</p><p>While we can draw some comparisons with the 1990s, there is one overriding factor that puts us closer to the market cycle of 2001-07: debt. As we all know — thanks to Margot Robbie explaining it to us in a bubble bath — 2001-07 saw one of the most reckless periods of lending, and then trading on that lending, ever known. And the result was world changing.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/wlHrSZ7BVFI\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Today, we see frightening hints of 2008 as U.S. household debt stands at a record high, and delinquency rates on credit card loans are rising at the fastest rate since 1991. Instead of tightening their belts, U.S. consumers chose so-called “revenge spending” after being locked in their houses for nearly two years, and it is taking a toll.</p><p>The reversal of this credit trend may not bring down the global banking system the way it did in 2008; but it is important for the health of the U.S. economy, which is currently being driven by the U.S. consumer. And the longer interest rates stay high, the more pressure is going to build as those debts pile up.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The consumer has borrowed more than they can afford<br><br>Default rate on credit card loans from small lenders has seen a sharp spike to 7.51%<br><br>This level is highest level EVER seen<br><br>Even higher than the Dot Com bubble and Financial Crisis<br><br>With credit card interest rates still over… <a href=\"https://t.co/dSX9cXicYE\">pic.twitter.com/dSX9cXicYE</a></p>&mdash; Game of Trades (@GameofTrades_) <a href=\"https://twitter.com/GameofTrades_/status/1723423186749149597?ref_src=twsrc%5Etfw\">November 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>And of course, to address the 10-ton elephant in the room, it’s not just the U.S. consumer racking up debt. Thanks to the pandemic, the U.S. government is now more than $30 trillion down. This is a previously unimaginable situation that has led to credit downgrades for the world's largest economy that everybody has, so far, brushed off as no big deal.</p><p>We are not, though, at a 2008 “credit crunch” inflection point just yet. Despite activity in the bond market suggesting otherwise, the U.S. economy remains resilient — and the U.S. consumer particularly. Higher interest rates haven’t put people off buying property, and nobody seems interested in cutting back on spending as wages are still rising faster than inflation.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/3643087d-3bd6-411c-93a5-ec165e433d0d.jpg\"  /><figcaption style=\"text-align: center;\"><em>Difference between inflation rate and wage growth in the United States from January 2020 to September 2023. Source: Statista</em></figcaption></figure><p>We also see some optimism in markets, especially the cryptocurrency market, which has already kicked off its next bull cycle as investors exorcize the ghosts of <a href=\"https://cointelegraph.com/news/investors-drop-lawsuit-terraform-labs-do-kwon\">Terraform Labs</a>, <a href=\"https://cointelegraph.com/news/genesis-court-cut-3ac-claim-33-million\">Three Arrows Capital</a>, <a href=\"https://cointelegraph.com/news/celsius-network-bankruptcy-newco-seeks-court-approval-confirmation-hearing\">Celsius</a> and FTX by piling into altcoins. </p><p>The odds, then, favor an extremely strong bull market over the next year or two until the steam runs out, as it always does. Eventually, the U.S. consumers’ enormous debt pile is going to topple, especially if interest rates remain higher for longer.</p><p>The most important players in this cycle will be the U.S. Treasury and Federal Reserve. As we saw in March 2023, they are willing to rewrite the rules to ensure the survival of the banking system. As things wobble, goalposts will likely be moved. What goes up must come down, though. Of that, we can be sure. </p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Lucas Kiely</strong> is the chief investment officer for Yield App, where he oversees investment portfolio allocations and leads the expansion of a diversified investment product range. He was previously the chief investment officer at Diginex Asset Management, and a senior trader and managing director at Credit Suisse in Hong Kong, where he managed QIS and Structured Derivatives trading. He was also the head of exotic derivatives at UBS in Australia.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-13T17:31:06.000Z",
    "title": "Ethereum (ETH) breaks out and ecosystem alts follow",
    "url": "https://cryptodaily.co.uk/2023/11/ethereum-eth-breaks-out-and-ecosystem-alts-follow",
    "description": "$ETH has just broken out after consolidating over the past three days. Next leg higher can drive ethereum ecosystem altcoins skywards."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-13T17:30:42.000Z",
    "title": "Cboe Digital to Launch Bitcoin and Ether Margin Futures in 2024; Aims to Bolster Liquidity",
    "url": "https://news.bitcoin.com/cboe-digital-to-launch-bitcoin-and-ether-margin-futures-in-2024-aims-to-bolster-liquidity/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/cboedigggy-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Cboe Digital to Launch Bitcoin and Ether Margin Futures in 2024; Aims to Bolster Liquidity\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/cboedigggy-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cboedigggy-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cboedigggy-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cboedigggy-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cboedigggy-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cboedigggy-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/cboedigggy.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Cboe Digital has announced plans to offer margin futures trading for bitcoin (BTC) and ethereum (ETH) starting January 11, 2024. The initiative, which features a platform integrating spot and futures trading, has garnered backing from a slew of fintech and crypto firms. Cboe says the service introduction aims to enhance capital efficiency in the digital [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T17:38:57.000Z",
    "title": "Pulsar Finance acquisition signals a new strategic chapter for Terraform Labs.",
    "url": "https://www.cryptopolitan.com/terraform-labs-pulsar-finance-acquisition/",
    "description": "In a strategic move signaling a new direction for the company, Terraform Labs, the primary developer behind the Terra blockchain, has announced the acquisition of Pulsar Finance, a cross-chain portfolio management and analytics startup. The acquisition marks a significant step for Terraform Labs as it navigates through a complex period marked by legal challenges and ... <a title=\"Pulsar Finance acquisition signals a new strategic chapter for Terraform Labs.\" class=\"read-more\" href=\"https://www.cryptopolitan.com/terraform-labs-pulsar-finance-acquisition/\" aria-label=\"More on Pulsar Finance acquisition signals a new strategic chapter for Terraform Labs.\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T17:30:42.000Z",
    "title": "SEC’s investigation on PayPal tells investors of the future of crypto in the US",
    "url": "https://www.cryptopolitan.com/secs-investigation-into-paypals-pyusd/",
    "description": "Following PayPal&#8217;s stablecoin launch in August 2023, the initial market reaction was seemingly muted as compared to other stablecoin data. Tether has remained at the top as the largest stablecoin regardless of recurring questions on the transparency of operations.&#160; Circle remains a preserved stablecoin despite questionable asset management tactics employed through Silicon Valley Bank. It ... <a title=\"SEC’s investigation on PayPal tells investors of the future of crypto in the US\" class=\"read-more\" href=\"https://www.cryptopolitan.com/secs-investigation-into-paypals-pyusd/\" aria-label=\"More on SEC’s investigation on PayPal tells investors of the future of crypto in the US\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T17:13:54.000Z",
    "title": "Bitcoin funding rates mimic a $69K BTC surge! What you must know",
    "url": "https://www.cryptopolitan.com/bitcoin-funding-rates-mimic-a-69k-btc-surge/",
    "description": "Bitcoin rallying half past its initial all-time high to levels above $35,000 has been met with a lot of enthusiasm as the crypto market awaits approval of ETFs that could drive its price even higher. Considering the macro-volatility triggers, it is yet to be known if this trend will continue as other cryptocurrencies are influenced ... <a title=\"Bitcoin funding rates mimic a $69K BTC surge! What you must know\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-funding-rates-mimic-a-69k-btc-surge/\" aria-label=\"More on Bitcoin funding rates mimic a $69K BTC surge! What you must know\">Read more</a>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-13T17:37:00.000Z",
    "title": "Wall Street Journal Report: Hamas Uses Cryptos for its Operations",
    "url": "https://coinedition.com/wall-street-journal-report-hamas-uses-cryptos-for-its-operations/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/blockchain2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/blockchain2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/blockchain2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/blockchain2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/blockchain2-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/blockchain2-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/blockchain2-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Palestinian political and military organization Hamas has reportedly pivoted its financing approaches to cryptocurrencies, as detailed in a comprehensive investigative news story by the news organization, the Wall Street Journal. The newly published piece delved into how Hamas, strategized by a Palestinian businessman called Zuhair Shamlakh, used cryptocurrencies for its operations. However, the report [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/wall-street-journal-report-hamas-uses-cryptos-for-its-operations/\">Wall Street Journal Report: Hamas Uses Cryptos for its Operations</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]