[
  {
    "source": "CoinDesk",
    "date": "2023-08-15T09:49:53.000Z",
    "title": "Europe's First Spot Bitcoin ETF Lists in Amsterdam",
    "url": "https://www.coindesk.com/business/2023/08/15/europes-first-spot-bitcoin-etf-lists-in-amsterdam/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Jacobi first won approval for the fund in October 2021 with plans to list it in 2022. However the firm opted to push back its plans due to inopportune circumstances elsewhere in the digital asset market."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-15T09:52:05.000Z",
    "title": "Meme Coin Base DEX RocketSwap Hit by $866K Exploit",
    "url": "https://decrypt.co/152519/meme-coin-base-dex-rocketswap-hit-866k-exploit",
    "description": "The RocketSwap hackers then bridged the stolen amount back to Ethereum and created a meme coin with the loot."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-15T09:49:58.000Z",
    "title": "Binance seeks protection from ‘overbroad’ SEC information requests",
    "url": "https://cryptoslate.com/binance-seeks-protection-from-secs-overbroad-information-requests/",
    "description": "<p>BAM Trading, Binance U.S.&#8217;s operating company, and BAM Management sought a protective order against the U.S. Securities and Exchange Commission&#8217;s (SEC) &#8220;troubling and inappropriate&#8221; abuse of its information requests, according to an Aug. 14 court filing. The SEC request BAM stated that the SEC wants it to produce &#8220;all communications&#8221; from Nov. 2022 from at [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-seeks-protection-from-secs-overbroad-information-requests/\">Binance seeks protection from &#8216;overbroad&#8217; SEC information requests</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-15T09:52:00.000Z",
    "title": "SEC Takes Action Against UK Company Over Audit",
    "url": "https://cryptodaily.co.uk/2023/08/sec-takes-action-against-uk-company-over-audit",
    "description": "<p>The SEC has taken decisive action against Crowe U.K. LLP, a pro-crypto London-based audit firm over the auditing of music streaming service Akazoo.</p>\n<p>The firm's CEO, Nigel Bostock, and senior auditor, Matthew Stallabrass, who advocate for wider crypto adoption, have also been implicated for their roles in a flawed audit of the music streaming entity, Akazoo Limited. All parties involved have opted for a settlement with the SEC.&nbsp;</p>\nAkazoo revenue overstated\n<p>Diving into the details, the SEC's findings reveal that Crowe U.K. had given Akazoo's 2018 financial statements a clean bill of health. However, post Akazoo's public debut in 2019 through a merger with a special purpose acquisition entity, discrepancies emerged.</p>\n<p>Akazoo's 2018 financial records boasted a whopping $120 million in revenue, a figure that was later debunked, revealing only trivial revenue figures. The SEC's probe highlighted that Crowe U.K.'s audit team lacked the requisite experience and training in Public Company Accounting Oversight Board (PCAOB) standards.&nbsp;</p>\n<p>The oversight became evident when the team missed glaring warning signs, such as accepting fabricated agreements and dubious confirmation letters from Akazoo without the necessary scrutiny.&nbsp;</p>\nFailings and penalties\n<p>The SEC's findings also spotlighted the roles of Bostock and Stallabrass. Bostock, as the lead for the Akazoo audit, was found lacking in his supervisory duties, documentation, and professional care. On the other hand, Stallabrass, responsible for reviewing the audit's quality, failed to conduct a comprehensive review.&nbsp;</p>\n<p>Eric Werner, the Regional Director of the Fort Worth Regional Office, commented on the situation, emphasising the role of Crowe U.K. in lending an unwarranted legitimacy to Akazoo, facilitating its entry into the public trading arena. He stressed the SEC's commitment to holding such gatekeepers accountable to prevent financial deceptions from infiltrating public markets.&nbsp;</p>\n<p>In the settlement, without admitting to any wrongdoing, Crowe U.K., Bostock, and Stallabrass have agreed to pay penalties amounting to $750,000, $25,000, and $10,000, respectively. They've also committed to refraining from any future violations related to the Exchange Act and Regulation S-X. Additionally, Crowe U.K. will voluntarily withdraw its PCAOB registration and introduce measures concerning new client acquisitions.&nbsp;</p>\n<p>Both Bostock and Stallabrass face suspensions from practising before the SEC as accountants, with potential reinstatements after five and two years, respectively.&nbsp;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-15T10:00:32.000Z",
    "title": "Libertarian Javier Milei Wins Argentine Primaries: Experts Weigh In on Dollarization as the Peso Fades",
    "url": "https://news.bitcoin.com/libertarian-javier-milei-wins-argentine-primaries-experts-weigh-in-on-dollarization-as-the-peso-fades/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1918331396-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Libertarian Javier Milei Wins Argentine Primaries: Experts Weigh in on Dollarization as the Peso Fades\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1918331396-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1918331396-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1918331396-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1918331396-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1918331396-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1918331396-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1918331396.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Javier Milei, a libertarian politician, won the Argentine primaries with more than 30% of the total vote, causing experts to weigh in on the dollarization plans he has vowed to apply. Milei&#8217;s government plan contemplates reducing the political apparatus in Argentina and axing the central bank, which would be closed after the dollarization process. Javier [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T09:51:42.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.1159, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 1.19% decrease. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-15T10:02:15.000Z",
    "title": "SBF might suffer from depression and ADHD, needs meds in jail",
    "url": "https://crypto.news/sbf-might-suffer-from-depression-and-adhd-needs-meds-in-jail/",
    "description": "Lawyers claim that Sam Bankman-Fried (SBF) needs his medications for depression and ADHD at Brooklyn&#8217;s detention center.  Reuters reported that SBF’s lawyers requested Emsam skin patches for depression and a few doses of Adderall for attention deficit hyperactive disorder (ADHD)&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-15T09:40:28.000Z",
    "title": "Bitcoin Prediction: Crypto Analyst Forecasts New ATH by 2024 – Can It Happen?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-prediction-crypto-analyst-forecasts-new-ath-by-2024-can-it-happen/",
    "description": "On August 14, Kevin Kelly, Co-founder of prominent crypto research firm Delphi Digital provided some interesting insights on Bitcoin and the crypto market in general. According to Kelly, the crypto market moves in consistent cycles, and we are currently in the initial stages of a new cycle based on market evidence. Using the premier cryptocurrency as a benchmark, Kelly states a crypto cycle usually begins with Bitcoin attaining a new all-time high (ATH) value, followed by an 80% loss in the next year. Thereafter, BTC would experience a market recovery over two years before embarking on a bullish run to attain a new ATH.  The Interplay Between The Crypto Cycle And Macroeconomic Signals Based on Kelly’s analysis, a typical crypto cycle occurs within four years, and its events are triggered by some factors in the bigger macro business cycle.  Related Reading: Bitcoin Price Relatively Muted – What Could Trigger A Sharp Decline? The analyst noted that, for example, Bitcoin usually attains new price peaks at the same period as the Institute of Supply Management (ISM) Index &#8211;  an economic indicator that tracks the manufacturing sector’s health in the United States. He said: BTC price peaks occur around the same time the ISM shows signs of topping out. Active addresses, total transaction volumes, total fees – they all peaked alongside tops in the ISM too. As the business cycle shows signs of recovery, so too does network activity levels… Due to this similarity in market movement, Kevin notes that turning moments in a typical business cycle have proven to be a favorable period to increase one’s exposure to risk assets such as Bitcoin.  Source: Delphi Digital Bitcoin Poised To Attain New ATH By Q4 2024, Kelly Says Interestingly, Kevin Kelly stated in his analysis that the ISM is currently heading toward the end of a two-year downtrend, indicating that BTC’s prices may soon start surging in the coming months. To back his long-term bullish price prediction, Kelly highlights several other factors, including the Bitcoin Halving event coming up in April 2024.  The Delphi Digital Co-founder stated that the last two Bitcoin halvings had occurred 18 months after BTC’s price tanked and 7 months before rallying to a new ATH. Related Reading: Bernstein Predicts Spot ETFs Could Claim 10% Of Bitcoin’s Market If Greenlit Based on this historical data, BTC could well attain a new ATH by Q4 2024. However, as with all predictions, Kelly stated that are certain risk factors involved.  Firstly, he predicted that the BTC market is likely to soon witness a modest selling pressure or price consolidation, especially following the market&#8217;s strong recovery in the last 9 months. In addition, he also highlighted the possibility of the business cycle presenting a false bearish end &#8211; as seen in March 2020 &#8211;  or not reaching its bearish end as soon as predicted.  According to data from CoinMarketCap, Bitcoin is trading around $29,333.89, with a 0.12% decline on the last day. However, the token’s daily trading volume is up by 26.38% and is valued at $12.2 billion BTC trading at $29,322 on the daily chart &#124; Source: BTCUSD chart on Tradingview.com Featured image from LinkedIn, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-15T10:00:35.000Z",
    "title": "What is the Next Big Crypto?",
    "url": "https://www.crypto-news-flash.com/what-is-the-next-big-crypto/?utm_source=rss&utm_medium=rss&utm_campaign=what-is-the-next-big-crypto",
    "description": "<img width=\"512\" height=\"287\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-40.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-40.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-40-300x168.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Navigating the ever-evolving crypto space? With buzzwords and new digital currencies popping up almost daily, it can be a challenge to identify where the crypto wave is headed next. From time-tested giants to promising newcomers, let&#8217;s dive into a deep analysis of some cryptocurrencies that are creating ripples in 2023, and understand why ApeMax, in [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-15T09:55:07.000Z",
    "title": "Pepe (PEPE) Primed for Breakout: Crypto Analyst Anticipates Upsurge in Memecoin Momentum",
    "url": "https://www.crypto-news-flash.com/pepe-pepe-primed-for-breakout-crypto-analyst-anticipates-upsurge-in-memecoin-momentum/?utm_source=rss&utm_medium=rss&utm_campaign=pepe-pepe-primed-for-breakout-crypto-analyst-anticipates-upsurge-in-memecoin-momentum",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/PEPE.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"As of Tuesday, Pepe 2.0, which appears to be the most favored among the imitations, witnessed a trading volume of nearly $7 million in the last 24 hours.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/PEPE.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/PEPE-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/PEPE-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />A crypto analyst is bullish on PEPE as he expects to add more to his PEPE stack when it makes a slight decline to $0.00000127. Another analyst has shown that most indicators point to a bullish run for the meme coin.  PEPE was one of the meme coins that gained a lot of attention this [...]"
  }
]