[
  {
    "source": "Cointelegraph",
    "date": "2023-11-12T08:25:28.000Z",
    "title": "FTX files billion-dollar lawsuit against ByBit over asset withdrawals",
    "url": "http://cointelegraph.com/news/ftx-files-billion-dollar-lawsuit-against-bybit-over-asset-withdrawals",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/a9ab6aed-7467-4b5d-8883-834e931f5a54.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The legal action is pursuing “compensatory and punitive damages” from ByBit regarding the token scheme and the assets held on its platform.</p>\n                    <p><p>The FTX bankruptcy estate, headed by CEO John J. Ray III, has filed a lawsuit against ByBit, its investment arm Mirana, and various executives. The aim is to recover funds and digital assets that ByBit withdrew from FTX just before its collapse, with the current value close to $1 billion.</p><p>The suit <a href=\"https://restructuring.ra.kroll.com/FTX/Home-DocketInfo\" target=\"_blank\" rel=\"noopener nofollow\">claims</a> ByBit used its “VIP” access and ties with FTX staff to withdraw significant cash and digital assets from Mirana, Time Research (another entity linked to ByBit), and executives just before FTX’s collapse.</p><p>During FTX’s November 2022 withdrawal difficulties, FTX employees tracked VIP customers’ withdrawal requests in a spreadsheet labeled \"VIP Request – Prioritize (Settlement).” The lawsuit alleges that FTX’s settlement team went to great lengths to prioritize Mirana’s significant withdrawals, resulting in over $327 million in transfers to Mirana. The total value of assets withdrawn by ByBit and its executives from FTX has now reportedly reached almost $1 billion.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/068f0b74-d7a3-46a7-bc7e-16e8225fab43.JPG\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of the FTX lawsuit against ByBit.            Source: Kroll</em></figcaption></figure><p>The lawsuit claims that ByBit has imposed limitations on the FTX estate, preventing the withdrawal of assets exceeding $125 million on the ByBit exchange. Allegedly, ByBit is using these assets as leverage to seek recovery for a remaining balance of $20 million that it could not withdraw from FTX before its collapse.</p><p>The lawsuit claims that in October 2021, a ByBit executive privately revealed to FTX that the company controlled BitDAO, now known as Mantle, despite presenting BitDAO as a decentralized organization run by community members. Then, in May 2023, ByBit approached the FTX bankruptcy estate about reversing the transaction, even though the value of the BIT tokens, approximately $50 million at the time, far outweighed the value of the FTT tokens, approximately $4 million at the time.</p><p>After FTX rejected the “illogical proposal,” BitDAO swiftly rebranded as Mantle, introducing MNT tokens for BIT holders to convert at a 1:1 ratio. As FTX began its conversion, BitDAO allegedly disabled it and held a “community vote” to decide on restricting FTX from converting its tokens.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/former-ftx-executives-team-up-to-build-new-crypto-exchange-one-year-after-ftx-collapse\"><strong><em>Ex-FTX execs team up to build new crypto exchange 12 months after FTX collapse: Report</em></strong></a></p><p>According to the lawsuit, FTX informed ByBit that the action violated the automatic stay in Chapter 11 bankruptcy. Despite this, the “community vote” passed, with votes seemingly linked to ByBit executives. Notably, the fifth-largest vote <a href=\"https://snapshot.org/#/bitdao.eth/proposal/0x00625c4f2d9aa9d4efb41ef3d0942194ca2087fae0599deced8b8ed86372c6c2\" target=\"_blank\" rel=\"noopener nofollow\">came</a> from the wallet “dtoh.eth,” <a href=\"https://delegatevote.mantle.xyz/0xf87095925339f7fFdde266258f62947567de6aEb\" target=\"_blank\" rel=\"noopener nofollow\">identified</a> as Mirana Ventures, a Mirana subsidiary led by David Toh.</p><p>The legal action is pursuing “compensatory and punitive damages” from ByBit regarding the token scheme and the assets held on its platform. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-12T08:16:26.000Z",
    "title": "Entrepreneurs Encourage AI Integration to Propel Pakistani Businesses",
    "url": "https://www.cryptopolitan.com/entrepreneurs-ai-to-propel-businesses/",
    "description": "Entrepreneurs and business leaders, along with academics, gathered at the &#8220;+92Disrupt&#8221; conference organized by Katalyst Labs to emphasize the importance of integrating Artificial Intelligence (AI) into local industries in Pakistan. The event aimed to inspire and motivate the startup community by showcasing success stories and discussing the transformative potential of AI in the country&#8217;s business ... <a title=\"Entrepreneurs Encourage AI Integration to Propel Pakistani Businesses\" class=\"read-more\" href=\"https://www.cryptopolitan.com/entrepreneurs-ai-to-propel-businesses/\" aria-label=\"More on Entrepreneurs Encourage AI Integration to Propel Pakistani Businesses\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-12T08:10:43.000Z",
    "title": "Nick Bostrom Discusses the Existential Risks and Rewards of Artificial Intelligence",
    "url": "https://www.cryptopolitan.com/risks-and-rewards-of-artificial-intelligence/",
    "description": "In a recent interview, Nick Bostrom, a Swedish philosopher at Oxford University and the director of its Future of Humanity Institute, delved into the concept of &#8220;existential risk&#8221; in the context of artificial intelligence (AI). Bostrom defines existential risk as the potential for humanity to face premature extinction or being trapped in a radically suboptimal ... <a title=\"Nick Bostrom Discusses the Existential Risks and Rewards of Artificial Intelligence\" class=\"read-more\" href=\"https://www.cryptopolitan.com/risks-and-rewards-of-artificial-intelligence/\" aria-label=\"More on Nick Bostrom Discusses the Existential Risks and Rewards of Artificial Intelligence\">Read more</a>"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-12T08:35:38.000Z",
    "title": "Why Kujira Grew Up 116% in the Last 7 Days?",
    "url": "https://www.altcoinbuzz.io/spotlight/why-kujira-grew-up-116-in-the-last-7-days/",
    "description": "<p>Nowadays, Kujira is in the #113 position in the general rank of the projects with the highest marketcap.  There are a few key reasons why Kujira is growing consistently. Let&#8217;s discover them here. 📣 Introducing Pond. The easiest way for developers to get started building dApps on Kujira 🌐 Available today, Pond creates an entire [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/spotlight/why-kujira-grew-up-116-in-the-last-7-days/\">Why Kujira Grew Up 116% in the Last 7 Days?</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]