[
  {
    "source": "Cointelegraph",
    "date": "2023-10-07T12:15:00.000Z",
    "title": "Long and short positions, explained",
    "url": "https://cointelegraph.com/explained/long-and-short-positions-explained",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/16b4446db67ecea42277355f0dc6ff3b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Long positions involve buying assets to profit from price increases, while short positions entail selling borrowed crypto, aiming to repurchase it cheaper for profit.</p>\n                    <p><div data-ct-widget=\"explained-block\" id=\"explained-block-53897-6\">            <h2 data-ct-widget=\"explained-block-title\">                The concept of long and short positions            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>The long and short positions represent opposite strategies that investors and traders use to speculate on the price movements of assets under consideration.</em></p><p>The idea of long and short positions is still applicable to traditional financial markets in the realm of cryptocurrencies. In order to profit from a cryptocurrency&rsquo;s price increase, a long position entails purchasing it with the expectation that its value will rise over time.&nbsp;</p><p>In contrast, going short in the cryptocurrency market means selling a cryptocurrency one doesn&rsquo;t own in anticipation of a price reduction, then buying it back at a cheaper cost to close out the position and profit from price drops.</p><p>Crypto <a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-cryptocurrency-trading-strategies\">traders and investors employ these strategies</a> to navigate the highly volatile and speculative nature of digital assets and seize opportunities in both bullish and bearish market conditions.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-53897-5\">            <h2 data-ct-widget=\"explained-block-title\">                The fundamental distinctions between long and short positions            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>In <a href=\"https://cointelegraph.com/learn/how-to-trade-cryptocurrencies-the-ultimate-beginners-guide\">cryptocurrency trading</a>, a long position is started by purchasing an asset in the hope that its price will rise, whereas a short position is started by disposing of an asset (typically one that was borrowed) in the hope that its price will fall.&nbsp;</em></p><p>While closing a short position means purchasing the asset at a lower price to achieve gains, exiting a long position involves selling the asset at a higher price to lock in profits. Entry and exit points are essential for these tactics to be implemented successfully.</p><p>Understanding the differences between long and short positions in the world of cryptocurrency trading is essential for successfully navigating the volatile digital asset markets. Here&rsquo;s a summary of the differences between the two:</p><p><img alt=\"Long position vs. short position\" src=\"https://s3.cointelegraph.com/storage/uploads/view/89c64b5528fb75ece07387b8ea077113.jpg\" title=\"Long position vs. short position\"></p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-53897-4\">            <h2 data-ct-widget=\"explained-block-title\">                The process of going long in cryptocurrency            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Going long in cryptocurrency involves a strategic process to profit from anticipated price increases.</em></p><p>Here&rsquo;s a step-by-step process:</p><h3>Research and analysis</h3><p>Before making any investment, a person must carefully investigate and analyze their chosen cryptocurrency. Consider elements like its technology, market trends, historical data and likelihood of acceptance.</p><h3>Select a crypto exchange</h3><p>The traders must then pick a trustworthy <a href=\"https://cointelegraph.com/learn/binance-vs-coinbase-how-do-they-compare\">cryptocurrency exchange or trading platform</a> that provides the required cryptocurrency. They should set up an account, carry out the required checks and use two-factor authentication to protect the account.</p><h3>Deposit funds</h3><p>The next step after creating an account is to deposit money into it. Depending on the platform, users can often deposit fiat money or another cryptocurrency to be used to buy the desired coin.</p><h3>Place a buy order</h3><p>Placing a <a href=\"https://cointelegraph.com/learn/crypto-trading-basics-a-beginners-guide-to-cryptocurrency-order-types\">&ldquo;buy&rdquo; order on the platform</a> of choice for the cryptocurrency is the next step. Users can either choose the current market price or a limit order with a specific purchase price.</p><h3>Monitor and manage</h3><p>After the buy order is carried out, an individual owns the cryptocurrency. They should carefully monitor market developments and choose an exit strategy, which can entail deciding on a price objective, relying on technical indicators or meeting other requirements. When it&rsquo;s time to sell their long position and convert the cryptocurrency to their preferred currency, they can place a &ldquo;sell&rdquo; order.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-53897-3\">            <h2 data-ct-widget=\"explained-block-title\">                Risks and potential rewards associated with long positions            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Long positions in cryptocurrencies offer the potential for significant profits through price appreciation, but they are accompanied by the substantial risk of market volatility and potential losses.</em></p><p>Although they carry some risk, long positions in cryptocurrencies have the potential to yield significant gains. The chance to profit from price growth is the main benefit. For instance, an investor who purchased Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) at a discount and kept it during its sharp increase in value realized large gains.</p><p>Long positions can expose investors to the developing cryptocurrency ecosystem and may profit from the uptake of blockchain technology. However, the risks are equally pronounced. Cryptocurrencies are well-known for being extremely volatile and prone to sudden price changes.</p><p>If the market goes bearish and the value of investors&rsquo; holdings declines, they could lose money. Prices can also be impacted by regulatory uncertainty, security breaches and <a href=\"https://cointelegraph.com/news/bitcoin-investor-sentiment-slumps-to-a-new-low-even-as-macro-and-equities-show-improvement\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-investor-sentiment-slumps-to-a-new-low-even-as-macro-and-equities-show-improvement/amp\">market sentiment</a>.&nbsp;</p><p>As cryptocurrency markets are subject to protracted periods of instability and unfavorable trends, maintaining a long position needs patience. Investors must do in-depth research, exercise risk management and stay educated to make informed decisions when pursuing long positions in cryptocurrencies.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-53897-2\">            <h2 data-ct-widget=\"explained-block-title\">                The process of going short in cryptocurrency            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>In cryptocurrency, going short includes betting on a price decrease and making money off of it.&nbsp;</em></p><p>Here&rsquo;s a step-by-step process:</p><h3>Research and analysis</h3><p>A trader starts by thoroughly researching and analyzing the cryptocurrency they want to sell. They seek signs that an asset&rsquo;s value may be declining, such as unfavorable news, overvaluation or technical indicators <a href=\"https://cointelegraph.com/learn/bull-vs-bear-crypto-market-what-is-the-difference-and-how-to-handle-both\">pointing to a bearish trend</a>.</p><h3>Select a trading platform</h3><p>Traders pick a trustworthy cryptocurrency exchange or trading platform that provides margin trading or short-selling alternatives for the particular cryptocurrency they want to short.</p><h3>Margin account setup</h3><p>The trader opens a margin trading account on the chosen platform, goes through any necessary identification verification steps, and deposits fiat money or cryptocurrencies to use as collateral. This collateral is necessary to protect against potential losses when holding a short position.</p><h3>Borrow cryptocurrency</h3><p>To sell a cryptocurrency short, a person must borrow it from an exchange or other platform users. This borrowed cryptocurrency is then sold on the open market.</p><h3>Monitor and set limits</h3><p>The trader carefully monitors the crypto market to watch price changes. They established a target buy-back price and placed stop-loss orders to prevent further losses. They intend to buy back the borrowed cryptocurrency to <a href=\"https://cointelegraph.com/learn/a-beginners-guide-on-how-to-short-bitcoin-and-other-cryptocurrencies\">close off their short position</a> at this target price.</p><h3>Close the position</h3><p>When the anticipated price decline of the cryptocurrency occurs, the trader closes the position by purchasing the borrowed cryptocurrency at a lower price to return it to the lender and profit from the price decline. This action marks the completion of the short position.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-53897-1\">            <h2 data-ct-widget=\"explained-block-title\">                Risks and potential rewards associated with short positions            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>By betting on price reductions, short positions in cryptocurrencies may yield rewards, but they also come with significant risks due to market volatility, endless potential for loss and unforeseen price increases.&nbsp;</em></p><p>Short positions in cryptocurrency trading have a high <a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-taking-crypto-profits-and-reinvesting\">potential for gains</a> but also pose substantial risks. The main benefit is the chance to profit from a cryptocurrency&rsquo;s price drop. For example, if a trader accurately foresees a bearish trend and shorts a cryptocurrency like Bitcoin, they may then purchase it back at a lower price and keep the profit from the price difference.</p><p>Short investments, however, often pose several significant risks. The markets for cryptocurrencies are notorious for their high volatility, and unanticipated price increases could result in large losses for short sellers.&nbsp;</p><p>There is also the limitless risk aspect to consider because there is no cap on how much the price might increase. Sharp price increases can be brought on by legislative changes, unanticipated shifts in market sentiment or unexpected positive news.</p><p>Short-selling in cryptocurrencies necessitates exact timing, meticulous risk management and continuous market monitoring to successfully negotiate the inherent volatility and maximize potential gains while limiting losses.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-53897-0\">            <h2 data-ct-widget=\"explained-block-title\">                Tax implications associated with gains and losses in long and short positions            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Tax ramifications for gains and losses in long and short cryptocurrency holdings can be complicated and vary by country.&nbsp;</em></p><p>Gains from long positions are typically regarded as <a href=\"https://cointelegraph.com/news/how-to-track-and-report-crypto-transactions-for-tax-purposes\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/how-to-track-and-report-crypto-transactions-for-tax-purposes/amp\">capital gains in many nations</a>, and when the asset is sold, capital gains taxes may apply. Short-term gains are taxed more than long-term gains, and the tax rate frequently varies depending on the holding time.</p><p>Conversely, short positions may present particular tax difficulties. The act of borrowing and selling a cryptocurrency short may not result in an immediate tax obligation in some countries because the short position is not closed until the borrowed asset is bought back. The trader may experience <a href=\"https://cointelegraph.com/learn/cryptocurrency-losses-and-gains-are-they-tax-deductible-or-taxable\">capital gains or losses</a> when closing out a short position, depending on the discrepancy between the selling and buying prices.</p><p>To understand and abide by local tax laws, cryptocurrency traders should be aware of <a href=\"https://cointelegraph.com/learn/how-to-file-crypto-taxes\">crypto tax laws</a> applicable in a particular jurisdiction, as the tax treatment of cryptocurrency gains and losses can differ dramatically from one location to the next. Also, proper record-keeping and reporting are crucial to maintaining tax compliance in the cryptocurrency sector.</p>            </p>        </div>    </p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-07T12:30:58.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Back Above $28,000 Following Comments from Joe Rogan, Sam Altman",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-back-above-28000-following-comments-from-joe-rogan-sam-altman/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1254945220-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC Back Above $28,000 Following Comments for Joe Rogan, Sam Altman\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1254945220-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1254945220-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1254945220-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1254945220-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1254945220-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1254945220-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_1254945220.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin traded above $28,000 to start the weekend, after Joe Rogan commented that it had a chance of becoming a &#x201C;universal viable currency.&#x201D; Additionally, traders also reacted to yesterday&#x2019;s U.S. nonfarm payrolls, which rose by 336,000 in September, more than the 170,000 many had expected. Ethereum was marginally higher on Saturday. Bitcoin Bitcoin (BTC) continued [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-07T12:21:57.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-07T12:14:57.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-07T12:29:00.000Z",
    "title": "Crypto Prices Today: SUI, XMR, LDO Prices Rise In The Last 24H",
    "url": "https://coinedition.com/crypto-prices-today-sui-xmr-ldo-prices-rise-in-the-last-24h/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Altcoins Not Make States Youtuber\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Over the past 24 hours, the prices of Sui (SUI), Monero (XMR), and Lido DAO (LDO) have experienced a significant increase in price, indicating a possible uptick in investor interest surrounding these tokens. The 24 hour success of&#160; XMR and LDO also secured them a spot on CoinMarketCap’s trending list. Sui (SUI)&#160;&#160; At press time, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-prices-today-sui-xmr-ldo-prices-rise-in-the-last-24h/\">Crypto Prices Today: SUI, XMR, LDO Prices Rise In The Last 24H</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]