[
  {
    "source": "NewsBTC",
    "date": "2023-06-10T00:00:32.000Z",
    "title": "Bitcoin (BTC) Lower Timeframe Outlook: $26,800 Breakthrough Could Spark Rally",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-btc-lower-timeframe-outlook-26800-breakthrough-could-spark-rally/",
    "description": "Bitcoin (BTC), the largest cryptocurrency in the market, made a fake attempt to breach the $27,500 barrier on Tuesday. Since then, it has been trading sideways, moving within a narrow channel.  The 50-day Moving Average, which is the nearest resistance, is at $27,200. Meanwhile, the strongest support is at the 200-day MA, placed at $25,200.  For Bitcoin to initiate a fully formed bull run in the market, it is essential to hold this support level, if BTC bulls expect another attempt to breach the $30,000 mark and propel the market in full force, the $25,200 support level is crucial, and it needs to be held to achieve this goal. Related Reading: Here’s How Current Bitcoin Capitulation Compares With Past Crashes XRP And LTC Poised For Breakouts As Bitcoin Eyes $28,000 The lower timeframe picture for Bitcoin is straightforward, according to cryptocurrency analyst Michael Van de Poppe. He believes that for BTC to continue its upward trend, it needs to break through the $26,800 level. If that level is breached and flipped, Van de Poppe predicts that $27,500 is a likely next target, with the possibility of further breakouts on XRP and Litecoin (LTC). Van de Poppe&#8217;s analysis is based on technical indicators and market trends. He highlights the significance of the $26,800 level as a key resistance level that must be overcome for BTC to gain momentum. The cryptocurrency has been trading in a narrow range, and a breakout could signal a shift in market sentiment. Van de Poppe&#8217;s predictions align with the overall bullish sentiment in the cryptocurrency market, with many analysts expecting BTC to continue its upward trajectory. However, there are also concerns about potential price corrections and volatility, which could impact short-term market movements. BTC In Period of Stability, Revisiting 200-Week MA Despite Downside Volatility According to cryptocurrency analyst Rekt Capital, BTC is currently in a period of stability. If this stability continues, BTC could revisit the $27,600 level and potentially break out. However, BTC is still retesting the 200-week Moving Average despite downside volatility below it during the week. Furthermore, BTC is currently trading below a series of Lower Highs, which is represented by the blue line in the chart. To move higher, BTC needs to invalidate this series of Lower Highs. On the other hand, the 200-week MA is acting as support, as indicated by the orange line in the chart. Together, these factors are creating a pennant-like structure, which is a pattern that typically indicates price compression and is often followed by a period of volatility. Rekt Capital&#8217;s analysis suggests that BTC is at a critical juncture, with the potential for a breakout or a breakdown depending on how it interacts with the 200-week MA and the series of Lower Highs. Related Reading: LUNC Token Continues To Surge During Market Uncertainty, What’s Behind It? Despite the potential risks, many investors remain bullish on BTC and other cryptocurrencies, with the overall market continuing to show strength and resilience. As institutional adoption of cryptocurrencies continues to grow, the demand for BTC and other digital assets is expected to increase, potentially driving prices higher in the long term. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-10T00:04:39.000Z",
    "title": "US Banks Doing ‘Very Little’ To Recover $24,000,000,000 Stolen From Customers This Year: Report",
    "url": "https://dailyhodl.com/2023/06/09/us-banks-doing-very-little-to-recover-24000000000-stolen-from-customers-this-year-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/banks-cash-fraud-dollar.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/banks-cash-fraud-dollar.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/banks-cash-fraud-dollar.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/banks-cash-fraud-dollar.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/banks-cash-fraud-dollar.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/banks-cash-fraud-dollar.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/banks-cash-fraud-dollar.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>American banks are doing &#8220;very little&#8221; to recover and reimburse billions upon billions of dollars stolen from customers each year, according to a new report. People are struggling to get their banks to protect them from massive and systemic checking fraud, reports NBC Los Angeles. The specific type of theft – which is expected to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/09/us-banks-doing-very-little-to-recover-24000000000-stolen-from-customers-this-year-report/\">US Banks Doing &#8216;Very Little&#8217; To Recover $24,000,000,000 Stolen From Customers This Year: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-10T00:00:23.000Z",
    "title": "Large-Cap Cryptos BNB, Cardano, Solana and Polygon Plunge in Price This Week After SEC Labels Them Securities",
    "url": "https://dailyhodl.com/2023/06/09/large-cap-cryptos-bnb-cardano-solana-and-polygon-plunge-in-price-this-week-after-sec-labels-them-securities/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/large-cap-price-week.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/large-cap-price-week.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/large-cap-price-week.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/large-cap-price-week.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/large-cap-price-week.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/large-cap-price-week.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/large-cap-price-week.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Four large-cap digital assets cratered in price this week after the U.S. Securities and Exchange Commission (SEC) labeled them securities in a pair of lawsuits against high-profile crypto exchanges. On Monday, the SEC sued Binance and its CEO Changpeng Zhao over what the federal agency’s head, Gary Gensler, called “an extensive web of deception, conflicts [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/09/large-cap-cryptos-bnb-cardano-solana-and-polygon-plunge-in-price-this-week-after-sec-labels-them-securities/\">Large-Cap Cryptos BNB, Cardano, Solana and Polygon Plunge in Price This Week After SEC Labels Them Securities</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]