[
  {
    "source": "CryptoSlate",
    "date": "2023-11-30T16:03:35.000Z",
    "title": "Harness the power of Satoshi on CryptoSlate: New Mash partnership revolutionizes reader interactions",
    "url": "https://cryptoslate.com/harness-the-power-of-satoshi-on-cryptoslate-new-mash-partnership-revolutionizes-reader-interactions/",
    "description": "<p>CryptoSlate is excited to announce our partnership with Mash, introducing an innovative way for readers to engage with our content using Satoshi (SATs), fractions of Bitcoin. This partnership marks a significant step in enhancing our website&#8217;s interactivity and supporting independent journalism. Introducing Mash reactions on CryptoSlate We have integrated Mash&#8217;s revolutionary tool on our website, [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/harness-the-power-of-satoshi-on-cryptoslate-new-mash-partnership-revolutionizes-reader-interactions/\">Harness the power of Satoshi on CryptoSlate: New Mash partnership revolutionizes reader interactions</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-30T16:04:13.000Z",
    "title": "SEC Acknowledges Ethereum ETF Filing By Fidelity",
    "url": "https://cryptobriefing.com/sec-acknowledges-ethereum-etf-filing-fidelity/?utm_source=feed&utm_medium=rss",
    "description": "SEC acknowledges Ethereum exchange-traded fund filing from Fidelity, proposing a spot ETF holding ether if approved."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-30T16:01:29.000Z",
    "title": "Dove 850 sets a new standard in 800G DSP innovation",
    "url": "https://www.cryptopolitan.com/dove-850-sets-a-new-standard-in-800g-dsp/",
    "description": "Credo Technology Group Holding Ltd has unveiled the Dove 850, a pioneering 800G Digital Signal Processor (DSP) Integrated Circuit (IC) optimized for Linear Receive Optics (LRO), also known as Half-retimed Linear Optics (HALO). Designed specifically for hyperscale data center AI deployments, the Dove 850 addresses the increasing demand for high-speed optical transceivers and Active Optical ... <a title=\"Dove 850 sets a new standard in 800G DSP innovation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dove-850-sets-a-new-standard-in-800g-dsp/\" aria-label=\"More on Dove 850 sets a new standard in 800G DSP innovation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-30T16:00:39.000Z",
    "title": "Fasset Secures VASP License in Dubai: A Milestone for Digital Asset Services",
    "url": "https://www.cryptopolitan.com/fasset-vasp-license-dubai-digital-services/",
    "description": "In a significant move for the digital asset sector, Fasset, a leading digital asset investment platform, has been granted a Virtual Asset Service Provider (VASP) license by the Dubai Virtual Asset Regulatory Authority (VARA). The pivotal development, announced on November 29, marks a new chapter for Fasset, enabling it to offer broker-dealer services in Dubai ... <a title=\"Fasset Secures VASP License in Dubai: A Milestone for Digital Asset Services\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fasset-vasp-license-dubai-digital-services/\" aria-label=\"More on Fasset Secures VASP License in Dubai: A Milestone for Digital Asset Services\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-30T15:56:51.000Z",
    "title": "Philippine SEC takes action against Binance",
    "url": "https://www.cryptopolitan.com/philippine-sec-takes-action-against-binance/",
    "description": "The Philippines&#8217; Securities and Exchange Commission (SEC) has initiated measures to restrict access to Binance, the world&#8217;s largest cryptocurrency exchange. This action follows recent developments where Binance&#8217;s former CEO, Changpeng Zhao, pleaded guilty to violating U.S. anti-money laundering laws.&#160; The SEC contends that Binance, the operator of the exchange, lacks the necessary registration and authorization ... <a title=\"Philippine SEC takes action against Binance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/philippine-sec-takes-action-against-binance/\" aria-label=\"More on Philippine SEC takes action against Binance\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-30T15:41:36.000Z",
    "title": "Assessing the Alleged Threat of Runaway Machines",
    "url": "https://www.cryptopolitan.com/assessing-alleged-threat-of-runaway-machines/",
    "description": "In the realm of artificial intelligence and technology, concerns surrounding the potential development of &#8220;runaway machines&#8221; have garnered attention and speculation. A recent article in The New Yorker titled &#8220;Maybe We Already Have Runaway Machines&#8221; explores this issue, prompting a closer examination of the claims made and the broader implications for society. Unpacking the notion ... <a title=\"Assessing the Alleged Threat of Runaway Machines\" class=\"read-more\" href=\"https://www.cryptopolitan.com/assessing-alleged-threat-of-runaway-machines/\" aria-label=\"More on Assessing the Alleged Threat of Runaway Machines\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-30T15:50:04.000Z",
    "title": "Will USTC stay bullish? Analyst weighs in",
    "url": "https://crypto.news/will-ustc-stay-bullish-analyst-weighs-in/",
    "description": "Crypto analyst sees bullish signs for beaten-down USTC, but worrying weakness in Luna Classic leaves him straddling the fence."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-30T16:00:25.000Z",
    "title": "Bitcoin Whales Ready To Push Price Above $40,000? Data Throws Clues",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-whales-ready-to-push-price-above-40000-data-throws-clues/",
    "description": "The Bitcoin price has been steadily moving around its current range as 2023 comes to an end. Recent data cast light on the current market structure and what could trigger an extension in the bullish momentum. Related Reading: Rare Signal Predicts Next XRP Price Move: Crypto Analyst As of this writing, Bitcoin (BTC) trades at $37,900 with a 1% loss in the last 24 hours. Over the previous week, the cryptocurrency has traded in the green as other assets recorded small losses, except for Solana (SOL) and Dogecoin (DOGE). Big Day For The Bitcoin Price: What Whales Are Planning Data shared by crypto analytics platform Material Indicators shows the current state of the orderbook for trading venue Binance. The world&#8217;s largest crypto, looking into this orderbook often reveals patterns and clues to anticipate the price action. Today, Bitcoin faces two potentially high volatility events: whales will fight over the monthly candle close, and the US will reveal macroeconomic data. Thus, the cryptocurrency could finally break above its current levels or re-test support. The data from Material Indicators, as seen on the chart below, shows a spike in buying orders from Bitcoin whales and “mega” whales (Purple and Brown on the chart, respectively). This buying pressure is unlikely to translate into a rally as these investors prioritize market efficiency. Thus, they place small orders on exchanges to reduce slippage, leading the price to range. The good news is that this behavior is often positive for the BTC price by attracting, according to Material Indicators, “bid (buy) liquidity.“ Once there is enough liquidity in the order book, whales can sell their positions and avoid downside slippage. The firm stated: The more they attract, the more they can dump while minimizing slippage. Over the past 7 Days, Purple Whales have Market Bought ~$16M of #BTC and in 4 hours distributed ~$42M to the bidders they lured into the range. Regardless of whether you are bullish or bearish, there are #trading opportunities ahead, as this game appears to be on extended play mode. Related Reading: Crypto Analyst Who Sold The Bitcoin Top Reveals How To Buy And Sell At The Perfect Time In that sense, traders should expect further sideways price action as whales and mega whales take over the market. In the meantime, $40,000 and $35,000 are two critical areas that could hint at a change in the current market dynamic. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-30T15:51:12.000Z",
    "title": "Galaxy Fox Closing in on $400K; Is This Coin The New Doge?",
    "url": "https://www.crypto-news-flash.com/galaxy-fox-closing-in-on-400k-is-this-coin-the-new-doge/?utm_source=rss&utm_medium=rss&utm_campaign=galaxy-fox-closing-in-on-400k-is-this-coin-the-new-doge",
    "description": "<img width=\"512\" height=\"512\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-95.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-95.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-95-300x300.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-95-150x150.png 150w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the midst of a crypto slowdown, one name is cutting through the noise – Galaxy Fox. In the last three days alone, this good crypto to buy has witnessed an impressive 54% growth in its presale. So, what&#8217;s the buzz about, and why is Galaxy Fox catching everyone&#8217;s attention? Let&#8217;s dive into the details [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-30T15:58:00.000Z",
    "title": "XRP Community is Engaging in Conspiracy Theory: Charles Hoskinson",
    "url": "https://coinedition.com/xrp-community-is-engaging-in-conspiracy-theory-charles-hoskinson/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Cardanos-Charles-Hoskinson-Wants-Nothing-To-Do-With-XRP.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP Community is Engaging in Conspiracy Theory: Charles Hoskinson\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Cardanos-Charles-Hoskinson-Wants-Nothing-To-Do-With-XRP.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Cardanos-Charles-Hoskinson-Wants-Nothing-To-Do-With-XRP-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Cardanos-Charles-Hoskinson-Wants-Nothing-To-Do-With-XRP-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Cardanos-Charles-Hoskinson-Wants-Nothing-To-Do-With-XRP-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Cardanos-Charles-Hoskinson-Wants-Nothing-To-Do-With-XRP-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cardano founder Charles Hoskinson has reiterated that several XRP community members are embarking on a conspiracy theory campaign against Ethereum’s Co-Founder, Joseph Lubin. According to Hoskinson, many XRP supporters believe Lubin bribed the Securities and Exchange Commission (SEC) to go after XRP to eliminate competition for Ethereum. Hoskinson made the recent statement via a post [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/xrp-community-is-engaging-in-conspiracy-theory-charles-hoskinson/\">XRP Community is Engaging in Conspiracy Theory: Charles Hoskinson</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]