[
  {
    "source": "Crypto Daily",
    "date": "2024-01-26T12:27:47.000Z",
    "title": "Dormant Shiba Inu (SHIB) and Dogecoin Wallets Awaken After 2 Years, Dump To Create Room for Retik Finance (RETIK) Priced at $0.08",
    "url": "https://cryptodaily.co.uk/2024/01/dormant-shiba-inu-shib-and-dogecoin-wallets-awaken-after-2-years-dump-to-create-room-for-retik-finance-retik-priced-at-008",
    "description": "2021 was the year when Dogecoin (DOGE) gained wild popularity online, thanks to Elon Musk's tweets and meme-driven excitement."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-26T12:30:59.000Z",
    "title": "Peeling Back the Layers: Ensuring AR Remains a Tool for Expression, Not Manipulation",
    "url": "https://news.bitcoin.com/peeling-back-the-layers-ensuring-ar-remains-a-tool-for-expression-not-manipulation/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/ho90-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/ho90-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ho90-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ho90-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ho90-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ho90-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ho90-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ho90-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />With the launch of Apple’s Reality Pro headset just a few days away, Augmented Reality (AR) is the topic on everyone’s minds. But the buzz isn’t baseless &#8211; the possibilities of AR technology are breathtaking! Fancy the new MSG Sphere in Las Vegas? Imagine having one in your own backyard! But beneath this surface-level spectacle, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T12:38:40.000Z",
    "title": "Facial Recognition Technology and Racial Inequities in Policing",
    "url": "https://www.cryptopolitan.com/facial-recognition-technology-and-inequities/",
    "description": "Facial Recognition Technology (FRT) has come under scrutiny once again due to concerns that it may exacerbate racial inequities in policing. Recent research conducted by Scientific American online has shed light on the potential biases embedded in FRT algorithms and their real-world consequences.&#160; The study revealed that law enforcement agencies utilizing automated facial recognition disproportionately [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T12:26:30.000Z",
    "title": "Elon Musk’s X Company Receives $10 Million Tax Break for AI Hardware in Georgia",
    "url": "https://www.cryptopolitan.com/elon-musks-x-receives-10-million-tax-break/",
    "description": "In a significant move to bolster its AI hardware capabilities, X, the social media firm previously known as Twitter and now under Elon Musk&#8217;s leadership, has been granted a $10.1 million tax break for maintaining its data center hardware in Atlanta, Georgia. This decision follows the company’s earlier contemplation of relocating to Portland, Oregon. The [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T12:20:17.000Z",
    "title": "The Gaming Industry’s Impact on Entertainment Spending",
    "url": "https://www.cryptopolitan.com/gaming-industrys-impact-on-spending/",
    "description": "The gaming industry has emerged as a global powerhouse, reshaping the entertainment landscape. With a market capitalization that skyrockets, it has become a key player in the entertainment world.&#160; From the early days of pixelated arcade games to the modern era of lifelike graphics and immersive experiences, video games have evolved remarkably. Technological progression has [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T12:17:08.000Z",
    "title": "ICP Price Prediction 2024-2033: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2024-2033 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T12:16:43.000Z",
    "title": "Waiting for Solana Price Above $100? These Cryptos Have Greater Potential",
    "url": "https://www.cryptopolitan.com/waiting-for-solana-price-above-100-these-cryptos-have-greater-potential/",
    "description": "The cryptocurrency market is currently dynamic, with Solana (SOL) experiencing a bearish trend, having fallen more than 10% this year. Despite reaching a high of $126, the Solana (SOL) price has since declined. The introduction of token extensions by Solana (SOL), including features like confidential transfers and interest-bearing tokens, could positively impact its utility and [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-26T12:30:07.000Z",
    "title": "Report Shows Polygon Users Rivaled Ethereum In 2023, But Why Has Price Failed To Clear $1?",
    "url": "https://www.newsbtc.com/polygon/polygon-users-ethereum-2023/",
    "description": "Layer-2 network Polygon is reported to have competed with Ethereum in 2023, as both networks saw the most influx of new users. This development has once again raised concerns about MATIC’s price, considering that such an achievement should potentially mean that new money moved into the ecosystem last year.  Polygon and Ethereum Acquired The Most Users In 2023 According to a report by Blockchain analytics firm Flipside, Polygon and Ethereum led the pack with 30.6 million acquired users in 2023. Giving a further breakdown, Polygon is said to have acquired 15,24 million users, while Ethereum attracted 15.4 million users. Meanwhile, these users are defined as persons who performed at least two transactions on the networks.  Related Reading: Cardano Defies Bear Market As Smart Contracts Count Sees 10,000 Explosion Despite falling about 160,000 short of Ethereum’s numbers, Polygon’s numbers are still impressive, considering that it ranked ahead of other networks like Bitcoin and Solana. The layer-2 network also outperformed other Ethereum L2 networks like Arbitrum, Optimism, and Base, which recorded 7.3 million, 3.3 million, and 1.9 million acquired users, respectively.  Notably, Polygon hit the ground running as soon as 2023 began, setting the record for monthly acquired users with 2 million in January. Interestingly, January 2023 was the first time MATIC rose above $1 in a very long while. It held above that level until the end of April 2023. After that, MATIC traded below that level for most of the year, only rising above $1 towards the end of December 2023.  MATIC price at $0.74 &#124; Source: MATICUSDT on Tradingview.com Why Has MATIC Failed To Rise And Hold Above $1 A recent analysis by Blockchain intelligence firm ChainArgos suggested that the Polygon team has been secretly selling off MATIC tokens, something which could have accounted for the significant sell pressures that have risen at different times for the crypto token. This could also serve as a plausible explanation for why MATIC has struggled to hold above $1 despite enjoying great utility.  The Polygon team was accused of not executing its token allocations in line with the publicly stated plan, with part of the allocated funds accounting for some of the tokens that were sold. These secret sales, which have for long gone under the radar, are said to be circumvented through wallets linked to the crypto exchange Binance.  Related Reading: RippleX Announces Major Update For XRP Ledger EVM Sidechain, Can This Trigger A Price Recovery So far, about 767 million MATIC have apparently been offloaded in these secret transactions. ChainArgos hinted at how these transactions have no doubt affected MATIC’s price on different occasions, as they noted that the outflows are a “good indicator for an upcoming top and subsequent move lower.” At the time of writing, MATIC is trading at around $0.73, up in the last 24 hours, according to data from CoinMarketCap.  Featured image from CoinGape, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-26T12:09:51.000Z",
    "title": "Stellar’s Soroban Mainnet Set to Launch on January 30th, Promises Game-Changing Upgrades",
    "url": "https://www.crypto-news-flash.com/stellars-soroban-mainnet-set-to-launch-on-january-30th-promises-game-changing-upgrades/?utm_source=rss&utm_medium=rss&utm_campaign=stellars-soroban-mainnet-set-to-launch-on-january-30th-promises-game-changing-upgrades",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/upgrade-1672367_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/upgrade-1672367_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/upgrade-1672367_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/upgrade-1672367_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/upgrade-1672367_1920-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Stellar (XLM) has been trading sideways and is 19% below its highest point this year, but an upcoming upgrade could inject new life into the token. The Soroban upgrade will go live on the Stellar mainnet in a few days, four months after it launched on a testnet, introducing smart contracts to the network and [...]"
  }
]