[
  {
    "source": "Decrypt",
    "date": "2023-12-27T21:41:02.000Z",
    "title": "Brakes on Bonk: Solana Meme Coin Down 56% From All-Time High",
    "url": "https://decrypt.co/211030/bonk-solana-based-meme-coin-slows-down",
    "description": "The meme token is now well below the all-time high it touched two weeks ago. "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T22:03:14.000Z",
    "title": "Banks Face Growing Account Closure Crisis: Rethinking AML Processes and Customer Relationships",
    "url": "https://www.cryptopolitan.com/banks-rethinking-aml-processes/",
    "description": "Banks across the United States are witnessing a significant surge in the closure of customer accounts subjected to AML processes. A recent American Banker article titled &#8220;Rushed anti-money-laundering calls backfire. Can AI help?&#8221; explores the reasons behind this unsettling trend.&#160; Outdated AML processes and rushed decisions One of the primary reasons behind the increasing number [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T21:42:39.000Z",
    "title": "Top crypto fundraisings for 2023 – What’s the 2024 market direction?",
    "url": "https://www.cryptopolitan.com/top-crypto-fundraisings-for-2023/",
    "description": "As the crypto market witnesses the dawn of a new bull run in 2023, the landscape for fundraising within the digital asset space is evolving rapidly. With blockchain technology gaining mainstream recognition and institutional interest in cryptocurrencies on the rise, 2023 has proven to be a pivotal year for innovative projects seeking capital infusion As [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T21:41:52.000Z",
    "title": "World leaders join digital economy forum for web 3.0 and Metaverse",
    "url": "https://www.cryptopolitan.com/world-leaders-forum-for-web-30-metaverse/",
    "description": "The digital economy landscape is witnessing a seismic shift as world leaders converge for the &#8220;Guangdong-Hong Kong-Macao Greater Bay Area Digital Economy Development Conference&#8221;, also known as the first Yuan Asset Forum and the 9th Guanhuo Web 3.0 Thousand People Summit. This pivotal event, orchestrated by a coalition of influential organizations including the Silk Road [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-27T21:45:11.000Z",
    "title": "Analyst: Make or break moment coming for Cardano",
    "url": "https://crypto.news/analyst-make-or-break-moment-coming-for-cardano/",
    "description": "A crypto analyst behind the LuckSide Crypto channel predicts Cardano will make a major price move within days based on technical signals he sees converging in the charts."
  }
]