[
  {
    "source": "Bitcoin.com",
    "date": "2023-07-25T00:30:54.000Z",
    "title": "Algeria Readies $1.5B BRICS Bid: Major Move for Membership in the Cards?",
    "url": "https://news.bitcoin.com/algeria-readies-1-5b-brics-bid-major-move-for-membership-in-the-cards/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/algeria-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Algeria Readies $1.5B BRICS Bid: Major Move for Membership in the Cards?\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/algeria-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/algeria-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/algeria-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/algeria-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/algeria-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/algeria-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/algeria.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />As quoted by Ennahar TV, Algerian president Abdelmadjid Tebboune has signaled that Algeria — Africa&#8217;s largest nation — is eager to align itself with the BRICS coalition. He conveyed that this significant alignment with the five major emerging economies could potentially unlock unprecedented economic prospects for all the nations. Algeria Sets Sights on BRICS In [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T00:29:18.000Z",
    "title": "Russia advances in the CBDC race as Putin signs digital ruble bill into law",
    "url": "https://www.cryptopolitan.com/russia-advances-in-the-cbdc-race-as-putin-signs-digital-ruble-bill-into-law/",
    "description": "Russian President Vladimir Putin has signed the digital ruble bill into law, marking a significant step towards the country&#8217;s central bank issuing its own digital currency, according to a document released by the Russian government. The law, signed on July 24, 2023, will officially come into effect on August 1, 2023. This development follows the ... <a title=\"Russia advances in the CBDC race as Putin signs digital ruble bill into law\" class=\"read-more\" href=\"https://www.cryptopolitan.com/russia-advances-in-the-cbdc-race-as-putin-signs-digital-ruble-bill-into-law/\" aria-label=\"More on Russia advances in the CBDC race as Putin signs digital ruble bill into law\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T00:36:25.000Z",
    "title": "This Technical Signal Says Bitcoin Dominance Has Potentially Peaked",
    "url": "https://www.newsbtc.com/bitcoin-news/thbitcoin-dominance-has-potentially-peaked/",
    "description": "Altcoin sentiment is at extreme lows, but that’s not the only thing reaching extremes. Bitcoin dominance, a measure of the top cryptocurrency by market cap’s weight compared to the rest of the space, also reached the most extreme reading ever on a technical indicator known for its precise timing and ability to pin-point reversals. If accurate, it’s only a matter of time until altcoins once again outperform BTC. Why The 50% Level In Bitcoin Dominance Is Critical In recent weeks, BTC dominance reached above 50% — an important psychological level in the relationship between Bitcoin and altcoins. While the metric has been much higher — and lower — in the past, the idea that one coin is the size of all others combined is a massive accomplishment. Related Reading: This Bitcoin Continuation Pattern Points To 3-6 Months Of Uptrend Ahead But after reaching only 2% above the 50% zone, Bitcoin dominance has struggled to push any higher and found resistance. The first signs of a possible reversal began as XRP was deemed not a security by a US judge. Since then, the relationship between Bitcoin and alts has since switch course. The change in course coincides with the Fisher Transform flipping downward from the most extreme reading in the history of 2W BTC.D charts. The Fisher is turning down from +4 std. deviation &#124; BTC.D on TradingView.com The Fisher Transform Forecasts A Potential Altcoin Season The Fisher Transform, created by John Elhers, converts price action into a Gaussian normal distribution in order to better highlight precise turning points in markets. The tool’s readings are based on a standard deviation, where readings on the most extreme side of the bell curve are rare, and thus have a higher probability of reversal once the signal turns down. Such moves to extremes require enormous strength behind the underlying trend. But even the most powerful trends must eventually come to an end. Related Reading: Perfect Storm: Why Bitcoin &#38; Crypto Are Poised For A Dramatic Recovery Reversing down from the highest point in 2W BTC.D history could suggest the trend favoring Bitcoin has ended, and the altcoins will perform better for the foreseeable future. Whether or not that leads to a sustainable altcoin season remains to be seen. This chart originally appeared in issue #13 of CoinChartist (VIP). Subscribe for free. Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  }
]