[
  {
    "source": "Cointelegraph",
    "date": "2023-06-12T09:00:44.000Z",
    "title": "Cardano's worst week since May 2021 is over — Will ADA price rebound 40%?",
    "url": "https://cointelegraph.com/news/cardano-worst-week-may-2021-ada-price-rebound-40",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/57d2fce5-0fe9-4c8c-b96b-b72e47832de9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The price of Cardano lost 30% over the past week as it gets delisted from popular trading platforms such as Robinhood following the U.S. SEC intervention. </p>\n                    <p><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) bounced modestly after losing nearly 30% of its valuation in the previous week, its worst seven-day performance since May 2021, when the <a href=\"https://cointelegraph.com/news/breaking-terra-blockchain-officially-halted-following-luna-price-collapse\">Terra collapse</a> sparked a cryotocurrency market crash.</p><p>Nonetheless, ADA looks ready to undergo a sharp recovery in the coming months, based on technical analysis.</p><h2>ADA price up 30% from six-month lows</h2><p>On June 12, ADA price rose 2.25% to $0.28, up around 27% from the six-month low of $0.22 seen last week. The rise appeared alongside gains elsewhere in the crypto market, hinting at investors buying the dip.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/2dba20e7-58c2-4b32-b8a4-d19c7955cd83.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USD daily price chart. Source: TradingView</em></figcaption></figure><p>The reasons behind Cardano's bad week include the U.S. Securities and Exchange Commission (SEC) <a href=\"https://cointelegraph.com/magazine/binance-coinbase-head-to-court-and-the-sec-labels-67-crypto-securities-hodlers-digest-june-4-10/\">deeming</a> it an unregistered security in the lawsuits filed against crypto exchanges Binance and Coinbase.</p><p>On June 9, U.S.-based investment service Robinhood, which allows users to trade cryptocurrencies, <a href=\"https://cointelegraph.com/news/robinhood-will-end-support-for-3-tokens-named-in-sec-lawsuits\">announced it would delist</a> ADA from its platform. This preceded a maximum 30% drop in ADA price on the day.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/ddc09300-7605-4d9d-912f-408c1bbc59a3.png\"  /><figcaption style=\"text-align: center;\"><em>ADA's market dominance daily chart. Source: TradingView</em></figcaption></figure><p>Cardano was also part of the services offered by crypto exchange Crypto.com to its U.S.-based institutional clients. On June 9, the company <a href=\"https://cointelegraph.com/news/crypto-com-suspends-us-institutional-exchange-service\">terminated</a> those services, thus restricting ADA to its potential mainstream investors base in the U.S.</p><h2>Cardano most oversold since March 2020</h2><p>Cardano's technicals, however, hint at a possible rebound ahead. For instance, the ongoing token recovery comes a day after its daily relative strength (RSI) dropped to 20, the most oversold since March 2020.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/74d469e3-d16c-4203-85d0-7786e9fa713f.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USD daily price chart. Source: TradingView</em></figcaption></figure><p>Oversold RSI readings typically precede a consolidating or recovering price action. </p><p>For instance, the ADA price had jumped 900% four months after March 2020's oversold readings. It also happened due to the Federal Reserve's <a href=\"https://cointelegraph.com/news/on-quantitative-easing-crypto-and-modern-monetary-theory\">quantitative easing</a> policy, which boosted upside sentiments across the riskier markets. </p><p>However, the Fed is poised to continue hiking <a href=\"https://cointelegraph.com/news/interest-rate-hike-speculation-triggers-outflows-from-crypto-investment-products-report\">interest rates</a> as inflation persists, which should remove excessive cash from the market. In addition, the SEC's crypto crackdown has created unfavorable market conditions in the United States for cryptocurrency tokens such as ADA.</p><p>Therefore, an oversold rebound, if it comes, could be weaker than what the market witnessed after March 2020.  </p><p>On the three-day chart, ADA appears rangebound inside the $0.247-0.382 area, similar to its price trends in January 2021 and January 2023, as shown below.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/bd8b5cf0-2ef1-4203-a1cb-ebda08a83124.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USD 3D price chart. Source: TradingView</em></figcaption></figure><p>Therefore, a rebound from the $0.247-support may start an uptrend toward $0.382 by October 2023. The $0.382-resistance, up 40% from current levels, also coincides with the 200-3D EMA (the red wave).</p><p>Conversely, a decisive close below the $0.247-support gives bears more fuel to pull the price toward $0.19, down about 30%, by October 2023, a resistance-turned-support level from July 2020-December 2020 session.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/nigeria-regulator-halts-binance-operations-report\">Nigeria regulator halts Binance operations: Report</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-12T08:56:00.000Z",
    "title": "Reddit crypto community goes offline: Here’s why",
    "url": "https://cointelegraph.com/news/reddit-crypto-community-goes-offline-here-s-why",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/2d739e70-3771-4d85-928e-89efe531b378.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Reddit communities unanimously decided to go private or in read-only modes between June 12 – June 14, protesting against the upcoming change that would prevent users from freely accessing APIs and tools.</p>\n                    <p><p>Numerous sub-communities on Reddit – including popular crypto subreddits – unanimously decided to go private for 48 hours as a way to protest against new company policies that prevent the use of third-party applications.</p><p>In April, Reddit <a href=\"https://www.redditinc.com/blog/2023apiupdates\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> plans to modify the way users can interact with Reddit Data API, a seven-year-old application that enabled developers to create tool and utilities for moderation and other activities.</p><p>Most subreddits retaliated the move as Reddit’s intention to build native moderator tools directly impacts the community’s ability to create and use third-party tools – predominantly used for moderating the content and interactions. As a result, communities decided to go private or in read-only modes between June 12 – June 14, protesting against the upcoming change.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/9ada9361-a8e0-4120-b0e8-043475a36de0.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">Subreddit r/Bitcoin went private. Source: Reddit</figcaption></figure><p>The list includes major crypto communities, which have been instrumental for millions of investors worldwide to discuss various aspects of the ecosystem.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/fb4dfe04-0bad-42ff-aaea-78befed7bff3.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Subreddit r/CryptoCurrency participated in Reddit blackout. Source: Reddit</em></figcaption></figure><p>Some of the popular subreddits dedicated to discussing Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and cryptocurrencies that are protesting against the change include r/Bitcoin, r/CryptoCurrency/ and r/cardano. Reddit has also received backlash for introducing paid access to its Data API.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/6ee06939-6758-437b-a97d-2f70129312b6.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>A snippet showing the upcoming changes shared by Reddit. Source: Reddit </em></figcaption></figure><p>While nearly 3,500 subreddits were estimated to become inaccessible, the numbers could increase if other communities join the revolt. On the other hand, Reddit CEO Steve Huffman <a href=\"https://mashable.com/article/reddit-steve-huffman-ceo-ama-third-api-backlash?taid=6486ad74db776900011809ea&amp;utm_campaign=trueAnthem%3A+Trending+Content&amp;utm_medium=trueAnthem&amp;utm_source=twitter\" target=\"_blank\" rel=\"noopener nofollow\">backed</a> the social media platform’s decision by revealing the need for being “a self-sustaining business.” He said:</p><blockquote>“We respect when you and your communities take action to highlight the things you need, including, at times, going private.”</blockquote><p>Moreover, to eradicate the extensive use third-party moderator tools, Reddit plans to launch mobile moderator tools for Reddit’s iOS and Android apps in the coming months.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/eu-watchdog-targets-crypto-ads-on-instagram-youtube-tiktok-twitter\">EU watchdog targets crypto ads on Instagram, YouTube, TikTok, Twitter</a></em></strong></p><p>Contrary to the ongoing community retaliation, Reddit is close to achieving a new milestone in terms of collectible avatar holders on the platform.</p><p>Reddit managed to amass 10 million holders of its collectible avatars barely within an year of the launching “Reddit NFTs.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/7bb5f23f-9322-452b-a219-962f81d63f17.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Reddit's collectible avatar banner. Source: Reddit</em></figcaption></figure><p>Reddit’s collectible avatar marketplace was launched on the Ethereum scaling network Polygon in July 2022, which allows independent artists and Redditors to design customizable NFT collections.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\">Tornado Cash 2.0: The race to build safe and legal coin mixers</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-12T09:07:09.000Z",
    "title": "Ex-SEC executive says U.S. DOJ likely to bring criminal charges against Binance",
    "url": "https://cryptoslate.com/ex-sec-executive-says-u-s-doj-likely-to-bring-criminal-charges-against-binance/",
    "description": "<p>Binance&#8217;s legal troubles are set to worsen, believes John Reed Stark, former chief of the Securities and Exchange Commission (SEC) Office of Internet Enforcement. As per Stark, the U.S. Department of Justice is likely working behind the scenes to bring criminal charges against Binance and its executives. In March, Binance and its CEO, Changpeng Zhao, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ex-sec-executive-says-u-s-doj-likely-to-bring-criminal-charges-against-binance/\">Ex-SEC executive says U.S. DOJ likely to bring criminal charges against Binance</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-12T08:54:57.000Z",
    "title": "Equities pivot from crypto, metaverse to AI",
    "url": "https://cryptoslate.com/insights/equities-pivot-from-crypto-metaverse-to-ai/",
    "description": "<p>Quick Take Despite rising interest rates and fixed-income yields, equities have traded higher this year. However, the sustainability of this trend will be tested as the promise of future solid earnings growth is challenged going forward. The Nasdaq is up 35%, and the S&#38;P 500 (SPX) is up 12% yearly. The focus of equities has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/equities-pivot-from-crypto-metaverse-to-ai/\">Equities pivot from crypto, metaverse to AI</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-12T08:51:54.000Z",
    "title": "Bitcoin Dominance Surges to 50%, Crypto Daily TV 12/6/2023",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-dominance-surges-to-50-crypto-daily-tv-12-6-2023",
    "description": "In Today&rsquo;s Headlines TV CryptoDaily News:\n<p></p>\n<p>SEC lawsuits spur huge deposits from main exchanges</p>\n<p>The U.S. Securities and Exchange Commission lawsuits against Binance, Binance.US and Coinbase have spurred the exodus of some $4 billion of deposits from the crypto exchange giants, according to blockchain data.</p>\n<p>Crypto.com Arena will retain its name despite corporate shuffling</p>\n<p>Crypto.com is shutting down a portion of its business, but its name will remain on the downtown Los Angeles arena that is home to the Lakers, Clippers, Kings and Sparks. Crypto.com said it is closing its institutional exchange in the US.</p>\n<p>Bitcoin dominance surges to 50%</p>\n<p>Bitcoin's dominance rate or share in the total crypto market capitalization rose during the weekend, nearing the 50% mark for the first time since April 2021. The uptick came as many altcoins suffered double-digit losses.</p>\nBTC/USD exploded 1.0% in the last session.\n<p>The Bitcoin-Dollar pair skyrocketed 1.0% in the last session. The ROC is giving a negative signal. Support is at 24876.6667, and Resistance is at 27052.6667.</p>\n<p>The ROC is currently in the negative zone.</p>\n<p></p>\nETH/USD exploded by 1.1% in the last session.&nbsp;\n<p>The Ethereum-Dollar pair skyrocketed 1.1% in the last session. The Williams indicator is giving a positive signal. Support is at 1646.591, and Resistance is at 1896.611.</p>\n<p>The Williams indicator is currently in the positive zone.</p>\n<p></p>\nXRP/USD skyrocketed 3.5% in the last session.&nbsp;\n<p>The Ripple-Dollar pair exploded 3.5% in the last session. The ROC is giving a positive signal. Support is at 0.4437, and Resistance is at 0.5702.</p>\n<p>The ROC is currently in the positive zone.</p>\n<p></p>\nLTC/USD exploded by 1.5% in the last session.\n<p>The Litecoin-Dollar pair exploded 1.5% in the last session. The Ultimate Oscillator's negative signal is in line with the overall technical analysis. Support is at 65.9833, and Resistance is at 94.9233.</p>\n<p>The Ultimate Oscillator is currently in the negative zone.</p>\n<p></p>\nDaily Economic Calendar:\n<p>US Consumer Price Index</p>\n<p>The Consumer Price Index is a measure of price movements made by comparing the retail prices of a representative shopping basket of goods and services.</p>\n<p>The US Consumer Price Index will be released at 12:30 GMT, the US Consumer Price Index Core at 12:30 GMT, the Eurozone's ZEW Survey &ndash; Economic Sentiment at 09:00 GMT.</p>\n<p>US Consumer Price Index Core</p>\n<p>The Core Consumer Price Index (CPI) measures the changes in the prices of goods and services, excluding food and energy.</p>\n<p>EMU ZEW Survey &ndash; Economic Sentiment</p>\n<p>The ZEW Survey - Economic Sentiment measures institutional investor sentiment, reflecting the difference between the share of investors that are optimistic and pessimistic.</p>\n<p>DE ZEW Survey &ndash; Current Situation</p>\n<p>The ZEW Survey - Current Situation measures the current institutional investor sentiment, reflecting the difference between the share of investors that are optimistic and pessimistic.</p>\n<p>Germany's ZEW Survey &ndash; Current Situation will be released at 09:00 GMT, the UK's Claimant Count Change at 06:00 GMT, and the UK's ILO Unemployment Rate at 06:00 GMT.</p>\n<p>UK Claimant Count Change</p>\n<p>The Claimant Count Change presents the change in the number of unemployed people in the UK.</p>\n<p>UK ILO Unemployment Rate</p>\n<p>The ILO Unemployment Rate is the number of unemployed workers divided by the total civilian labour force.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-12T08:39:36.000Z",
    "title": "Sparklo (SPRK) Dominates the Crypto Market While Theta Network (THETA) And Stacks (STX) Price Continues to Fall",
    "url": "https://nulltx.com/sparklo-sprk-dominates-the-crypto-market-while-theta-network-theta-and-stacks-stx-price-continues-to-fall/",
    "description": "The recent crash of many crypto tokens has further underscored the volatility and unpredictability of the crypto market. Only exciting projects such as Sparklo have been able to weather the storm of the bear market. Tokens like Theta Network (THETA) and Stacks (STX) are currently sitting deep in the red zone, with there price curve [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T09:07:36.000Z",
    "title": "Top crypto exchanges see notable negative net flows, volumes down",
    "url": "https://crypto.news/top-crypto-exchanges-see-notable-negative-net-flows-volumes-down/",
    "description": "The top 10 cryptocurrency exchanges have witnessed significant negative net flows after the FUD (fear, uncertainty and doubt) around Binance and Coinbase rose. Last week, the US Securities and Exchange Commission (SEC) sued Binance and Coinbase, triggering a massive sell-off&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T09:00:36.000Z",
    "title": "Bitcoin’s SOPR ratio suggests strong interest as price recovers",
    "url": "https://crypto.news/bitcoins-sopr-ratio-suggests-strong-interest-as-price-recovers/",
    "description": "Bitcoin’s (BTC) price witnessed an instant fall on June 5, as the US Securities and Exchange Commission (SEC) decided to take legal action against Binance and Coinbase. The asset’s price fell from around $26,800 to $25,500 within 18 hours after&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-12T08:40:28.000Z",
    "title": "Solana Community Discusses Fork Due To SEC As Price Tanks",
    "url": "https://www.newsbtc.com/news/solana/solana-community-discusses-fork-due-sec/",
    "description": "The Solana (SOL) token is one of the biggest losers on the crypto market with a price drop of around 30% in the last seven days. After the US Securities and Exchange Commission (SEC) declared the Solana token as well as numerous other altcoins as securities in its lawsuits against Coinbase and Binance US, the SOL price plummeted. In a worst-case scenario, the SEC could sue Solana Foundation in the same way it did Ripple Labs in December 2020. Thus, the bottom of the SOL price&#8217;s slump might not be reached yet, if the SEC really takes this step and thus causes more investors to panic sell. Solana Community And Developers Oppose The SEC The Solana Foundation has now responded to the SEC&#8217;s classification of its SOL token as an unregistered security. In a statement, it said, &#8220;The Solana Foundation strongly believes that SOL is not a security,&#8221; adding &#8220;SOL is the native token to the Solana blockchain, a robust, open-source, community-based software project that relies on decentralized user and developer engagement to expand and evolve.&#8221; While one developer at a recent event dismissed the SEC&#8217;s legal action, stating that developers &#8220;give a shit&#8221; about what the SEC thinks, there is a part of the community that is already thinking about possible ways to solve the SEC issue. Related Reading: SOL Price Prediction: Solana Turns Sell On Rallies As It Breaks $20 The founder of Degen Picks launched a poll within the Solana community on whether the blockchain should fork to avoid the regulatory issues with the SEC. A total of 2,050 people participated in the poll, 39.9% answered &#8220;yup&#8221; while 24.2% answered &#8220;stfu&#8221; (shut the fuck up). OK hear me out. It&#8217;s time to fork $SOL. SEC dissapears, FTX bankruptcy can dump on themselves. $BTC and $ETH both did it. cc @SOLBigBrain Your reaction? — Caps² (@capsjpeg) June 10, 2023 Surprisingly, the idea is supported by Abracadabra founder @HGEABC. Via Twitter, he responded to the poll, writing, &#8220;Bold but not a bad idea actually. Community fork Solana will get rid of SEC issue. No bankruptcy will dump on you for next 3 years continuously. ETH is a fork of ETC and doing well. Blink twice if you agree.&#8221; A user then asked the Abracadabra founder if he could get Solana Labs co-founder Anatoly Yakovenko and his team to work on the fork. The Abracadabra founder speculated that they &#8220;probably will&#8221; if they are sued by the SEC. &#8220;Then work on the fork save their own problem too.&#8221; Remarkably, the Solana Foundation has not yet responded to the poll. Related Reading: Billions Of Dollars Tokenized Bitcoin Moved To Ethereum, BSC, And Solana Overall, however, there are mixed opinions in the community about the fork. It&#8217;s also worth noting that proponents don&#8217;t have a specific plan for a fork yet. Nevertheless, according to the founder of Degen Picks, a fork could not only solve the SEC problem, but also FTX bankruptcy. A copy of the Solana chain could be given a new set of rules and parameters. The FTX wallets could be blacklisted and not receive the new token. SOL Price Keeps Falling At press time, the SOL price was trading at $15.15. The 1-day chart shows the dicey situation for the SOL price. The bulls need to defend the $12.82 level at all costs to prevent a fall to the December 2022 low at $8.02. To the upside, the $16.00 level is the key resistance for now. With an RSI of 26.2, SOL is in oversold territory and could initiate a recovery. Featured image from Analytics Insight, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T08:45:06.000Z",
    "title": "Bitcoin’s Next Move: $20,000 or $30,000? BTC Uncovers Resilient Support at $25,000 Despite Binance’s Regulatory Challenges",
    "url": "https://www.crypto-news-flash.com/bitcoins-next-move-20000-or-30000-btc-uncovers-resilient-support-at-25000-despite-binances-regulatory-challenges/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoins-next-move-20000-or-30000-btc-uncovers-resilient-support-at-25000-despite-binances-regulatory-challenges",
    "description": "With the US SEC naming several altcoins as securities, Bitcoin&#8217;s dominance in the market has shot up moving closer to 50%. With the increasing number of enforcement actions, the total value of crypto assets under the SEC&#8217;s control shot up significantly. Bitcoin (BTC) and the broader crypto market continue to stay under pressure following the [...]"
  }
]