[
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T05:23:06.000Z",
    "title": "Bitcoin Ordinals team launch non-profit to grow protocol development",
    "url": "https://cointelegraph.com/news/bitcoin-ordinals-non-profit-open-ordinals-institute",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/1d231eef-d53a-491b-8144-948f51de2293.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Open Ordinals Institute aims to bolster the protocol’s future development as Ordinals inscriptions hit a milestone of 21 million.</p>\n                    <p><p>A non-profit organization dedicated to growing the development of nonfungible tokens (NFTs) on Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has been launched by the team behind the Bitcoin Ordinals protocol.</p><p>The California-based nonprofit called the Open Ordinals Institute will bolster the Ordinals protocol by providing funding to the team’s core developers, which includes the project’s pseudonymous lead maintainer <a href=\"https://twitter.com/raphjaph\" target=\"_blank\" rel=\"noopener nofollow\">Raph</a>.</p><p>In total, four team members will serve on the board of the new nonprofit; Raph, Bitcoin-focused podcast host Erin Redwing an anonymous Ordinals developer known as Ordinally and Ordinals creator Casey Rodarmor.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Ordinals protocol team is proud to announce the launch of the Open Ordinals Institute, a 501(c)(3) non-profit organization to foster the growth and advancement of the Bitcoin Ordinals protocol. Donations can be made at our website: <a href=\"https://t.co/H7ymKSL4VR\">https://t.co/H7ymKSL4VR</a></p>&mdash; Open Ordinals Institute (@ordinalsorg) <a href=\"https://twitter.com/ordinalsorg/status/1686435373780746242?ref_src=twsrc%5Etfw\">August 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The Ordinals protocol was launched in January by Rodarmor. It rapidly became one of the most popular crypto trends with users rushing to inscribe assets on the Bitcoin blockchain, including NFTs and <a href=\"https://cointelegraph.com/learn/what-is-a-brc-20-token-standard-an-overview\">Bitcoin-based cryptocurrencies</a>.</p><p>On May 28, <a href=\"https://cointelegraph.com/news/bitcoin-ordinals-surpass-inscription-as-casey-rodarmor-steps-down\">Rodarmor stepped down</a> as the protocol’s lead maintainer and handed the role over to Raph.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I haven&#39;t been able to give ord the attention it deserves, so I am pleased to announce that <a href=\"https://twitter.com/raphjaph?ref_src=twsrc%5Etfw\">@raphjaph</a> has agreed to step up as lead maintainer!<br><br>Raph is an impoverished student, and his work on ord will be entirely funded by donations. If you can, please consider donating!…</p>&mdash; Casey (@rodarmor) <a href=\"https://twitter.com/rodarmor/status/1662617512700420096?ref_src=twsrc%5Etfw\">May 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As of Aug. 1, 5:30 pm UTC, the total number of Bitcoin Ordinals inscriptions <a href=\"https://dune.com/dgtl_assets/bitcoin-ordinals-analysis\" target=\"_blank\" rel=\"noopener nofollow\">topped</a> 21 million, an auspicious milestone for users of the Bitcoin network.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-has-entered-a-civil-war-over-art\"><strong><em>Bitcoin has entered a civil war — Over ‘art’</em></strong></a></p><p>The team also launched the official website for the organization, <a href=\"https://ordinals.org/\" target=\"_blank\" rel=\"noopener nofollow\">Ordinals.org</a>, allowing users to make donations and view updates to the project’s development. </p><p>According to the official website, any donations made to the Institute will be tax-deductible for United States taxpayers following the organization’s approval by the Internal Revenue Service, which it expects to occur sometime later this year. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\"><strong><em>Should you ‘orange pill’ children? The case for Bitcoin kids books</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-02T05:30:32.000Z",
    "title": "Bitcoin Miner Genesis Digital Assets Opens 3 New Data Centers in South Carolina",
    "url": "https://news.bitcoin.com/bitcoin-miner-genesis-digital-assets-opens-3-new-data-centers-in-south-carolina/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/minerssd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Miner Genesis Digital Assets Opens 3 New Data Centers in South Carolina\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/minerssd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/minerssd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/minerssd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/minerssd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/minerssd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/minerssd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/minerssd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Genesis Digital Assets (GDA), one of the world&#8217;s largest bitcoin mining companies, has opened three new data centers in the western region of South Carolina. The facilities represent GDA&#8217;s continued expansion in the United States, where its data centers now account for over 2% of Bitcoin&#8217;s total hashrate. Genesis Digital Assets Reveals 3 New South [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-02T05:30:54.000Z",
    "title": "Ethereum Denied Non-Security Status In Latest Court Battle Against SEC",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-denied-non-security-status-in-latest-court-battle-against-sec/",
    "description": "In a recent court ruling, Ethereum (ETH) was denied non-security status in a case against the U.S. Securities and Exchange Commission (SEC).  The court granted the SEC&#8217;s motion to dismiss the complaint for declaratory relief on whether Ethereum and the Ethereum Network are securities. While the ruling was a procedural one and not on the merits, it confirmed that there is no protection for Ethereum as a non-security.  Ethereum And Other Cryptocurrencies Left In Legal Limbo At this point in the US, only Bitcoin (BTC) and XRP are large-cap tokens that have legal clarity. The court&#8217;s decision highlights the regulatory uncertainty surrounding cryptocurrencies and the need for the SEC to issue definitive guidance rather than approaching the issue in piecemeal litigation. According to the Law Firm Dedicated to unique issues of digital assets and cryptocurrency, Hodl Law, the court emphasized that the SEC has not investigated the plaintiff or threatened to investigate, and there is no imminent threat based on its unclear Ethereum position and enforcement-by-litigation approach.  Related Reading: Bitcoin Price Forecast: Dark Days Ahead As $29,200 Support Fails However, the SEC&#8217;s recent refusals to comment on Ethereum, combined with the position it was forced to take in this briefing, clearly demonstrate that it views Ethereum as a security and is waiting for the most opportune time to strike. While there are appellate options and constitutional grounds available, the ruling underscores the need for greater regulatory clarity in the cryptocurrency space. Businesses and individuals operating in the crypto industry need expert legal counsel to navigate the complex legal landscape and ensure compliance with applicable regulations. ETH’s Fate As A Security If the SEC were to classify Ethereum as a security, it could have significant consequences for the cryptocurrency and the broader industry. First and foremost, if Ethereum were classified as a security, it would be subject to the same regulations as traditional securities, such as stocks and bonds. This would mean that Ethereum would have to comply with securities laws and regulations, including registration requirements, disclosure requirements, and other compliance obligations.  This would likely increase the cost and complexity of operating the ETH network and could potentially stifle innovation. Related Reading: Bitcoin Bollinger Bands Are The Tightest Ever, What Happens Next? Additionally, it could impact the value and liquidity of the cryptocurrency. The SEC&#8217;s classification would create uncertainty and potentially undermine investor confidence in Ethereum, leading to a decline in its value and potentially reducing demand for the cryptocurrency. Furthermore, this case could potentially lead to legal action against the platform and its developers. If the SEC were to determine that Ethereum was sold in violation of securities laws, it could result in penalties and fines for the platform&#8217;s founders and developers. As the crypto industry continues to evolve, regulators must provide clear guidance on the status and treatment of cryptocurrencies.  The ongoing confusion and uncertainty surrounding the legal status of Ethereum and other cryptocurrencies pose significant challenges for businesses and investors in the space. While the court&#8217;s ruling, in this case, maybe disappointing for some, it underscores the need for greater clarity and regulatory certainty in the cryptocurrency industry. As of the time of writing, ETH is in the process of recovering from a significant decline experienced over the past few days. Currently, the second-largest token in the nascent industry is trading at $1,850, which represents a 0.7% decrease in the last 24 hours. Featured image from iStock, chart from TradingView.com"
  }
]