[
  {
    "source": "Cryptopolitan",
    "date": "2023-09-19T04:38:42.000Z",
    "title": "A Techie’s Take on ‘Why Not Let Developers Use ChatGPT During an Interview?’",
    "url": "https://www.cryptopolitan.com/let-developers-use-chatgpt-during-interview/",
    "description": "In a rapidly evolving tech world, the debate over whether developers should be allowed to use ChatGPT, an advanced AI language model, during interviews has sparked controversy. A recent poll conducted among 5,000 individuals unveiled that 42% of respondents were opposed to the idea of candidates employing ChatGPT during interviews.&#160; Many of these skeptics emphasized ... <a title=\"A Techie&#8217;s Take on &#8216;Why Not Let Developers Use ChatGPT During an Interview?&#8217;\" class=\"read-more\" href=\"https://www.cryptopolitan.com/let-developers-use-chatgpt-during-interview/\" aria-label=\"More on A Techie&#8217;s Take on &#8216;Why Not Let Developers Use ChatGPT During an Interview?&#8217;\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-19T04:35:03.000Z",
    "title": "Ethereum Price Faces Another Rejection – Can Bulls Save The Day?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-rejection-1670/",
    "description": "Ethereum price climbed above $1,650 but failed to surpass $1,670 against the US Dollar. ETH trimmed gains and now consolidating near the $1,630 zone. Ethereum struggled to clear the $1,670 resistance. The price is trading above $1,630 and the 100-hourly Simple Moving Average. There was a break above a key bearish trend line with resistance near $1,628 on the hourly chart of ETH/USD (data feed via Kraken). The pair must stay above the $1,620 support zone to start a fresh increase in the short term. Ethereum Price Revisits Support Ethereum’s price started a decent increase above the $1,620 resistance. ETH even climbed above the $1,650 resistance before the bears appeared, like Bitcoin. During the increase, there was a break above a key bearish trend line with resistance near $1,628 on the hourly chart of ETH/USD. However, the bears defended the $1,670 resistance. A high was formed near $1,669 and the price started a downside correction. There was a move below the $1,650 level. The price declined below the 50% Fib retracement level of the upward move from the $1,613 swing low to the $1,669 high. Ether is now trading above $1,630 and the 100-hourly Simple Moving Average. It is also trading near the 61.8% Fib retracement level of the upward move from the $1,613 swing low to the $1,669 high. On the upside, the price might face resistance near the $1,650 level. Source: ETHUSD on TradingView.com The next resistance is near the $1,670 level. A close above the $1,670 resistance might send the price toward the $1,720 resistance. The next major hurdle is near the $1,750 level. A close above the $1,750 level might send Ethereum further higher toward $1,880 in the coming days. More Losses in ETH? If Ethereum fails to clear the $1,650 resistance, it could start another decline. Initial support on the downside is near the $1,630 level and the 100-hourly Simple Moving Average. The first key support is close to $1,620. The next key support is $1,600. A downside break below $1,600 might start another bearish wave. In the stated case, the price could even decline toward the $1,540 level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,620 Major Resistance Level – $1,670"
  }
]