[
  {
    "source": "Cointelegraph",
    "date": "2024-01-31T05:58:14.000Z",
    "title": " SEC’s settlement gag rule ‘undermines regulatory integrity’ — Hester Peirce  ",
    "url": "https://cointelegraph.com/news/sec-settlement-gag-rule-undermines-integrity-hester-peirce",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYmE3ODdjMzgtZTMyZi00OGU4LThlN2YtZDkzY2JlZTQ4Nzk0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Settlements are the “most common” way the SEC resolves enforcement actions, but this stops defendants from speaking out, says Hester Peirce.</p>\n                    <p><p>A United States Securities and Exchange Commission rule forbidding defendants from criticizing the agency’s claims when settling enforcement actions “undermines regulatory integrity” and free speech, says one of its commissioners.</p><p>In a Jan. 30 <a href=\"https://www.sec.gov/news/statement/peirce-nand-013024\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, SEC commissioner Hester Peirce disagreed with her agency’s <a href=\"https://www.sec.gov/files/rules/petitions/2024/4-733-letter-013024.pdf\" target=\"_blank\" rel=\"noopener nofollow\">denial</a> of a petition to amend its 1972 “gag rule” — which forbids defendants from denying or refusing to admit to the SEC’s allegations following a settlement. </p><p>“The policy of denying defendants the right to criticize publicly a settlement after it is signed is unnecessary, undermines regulatory integrity, and raises First Amendment concerns,” Peirce wrote.</p><p><a href=\"https://cointelegraph.com/news/sec-settlement-gag-rule-undermines-integrity-hester-peirce\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-31T05:54:33.000Z",
    "title": " Happy ending after Moscow dev uses AI to ‘date’ 5,239 women ",
    "url": "https://cointelegraph.com/news/developer-uses-chatgpt-ai-date-women-tinder-marriage",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMjU0MWIzYTAtYjFlMS00NWY1LTg2MjEtODM1ZWZiYTg4MjNjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>“I decided to simplify communication with girls via GPT,” said Moscow-based AI developer Alexander Zhadan.</p>\n                    <p><p>A developer from Moscow has found his “happily ever after” after a self-reported year-long experiment using ChatGPT and other AI tools to date more than 5,000 women on Tinder.</p><p>In a Jan. 30 thread on X, TenChat product manager Alexander Zhadan announced he’s getting married in August to AI-endorsed soulmate Karina Imranovna after whittling down 5,239 Tinder matches using an <a href=\"https://cointelegraph.com/news/openai-learnings-1m-grant-program\">AI system</a> he devised.</p><p>It filtered out women according to his red flags, made small talk on his behalf, booked dates, and even helped him propose to his now-fiance.</p><p><a href=\"https://cointelegraph.com/news/developer-uses-chatgpt-ai-date-women-tinder-marriage\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-31T05:54:00.000Z",
    "title": "IOTA’s Shimmer Network Unveils $1 Million Liquidity Mining Airdrop to Bolster DeFi Ecosystem",
    "url": "https://www.cryptoglobe.com/latest/2024/01/iotas-shimmer-network-unveils-1-million-liquidity-mining-airdrop-to-bolster-defi-ecosystem/",
    "description": "IOTA staging network Shimmer,has recently announced a $1 million liquidity mining airdrop in an initiative developed by the Tangle Ecosystem Association’s Shimmer Growth Committee, aimimg to support its layer-2 ShimmerEVM and boost its decentralized finance (DeFi) ecosystem. In collaboration with the Shimmer community, the project is set to enhance the usage of the Shimmer Bridge […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T05:57:06.000Z",
    "title": "Avalanche Price Prediction 2024-2033: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2024-2033 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here’s a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T05:52:07.000Z",
    "title": "Tech Industry Adapts as Layoffs Continue Amidst Growing Embrace of Artificial Intelligence",
    "url": "https://www.cryptopolitan.com/tech-industry-faces-shifting-landscape/",
    "description": "The tech industry is navigating a transformative period marked by significant shifts in employment dynamics and strategic priorities as companies pivot towards artificial intelligence (AI). With the onset of 2024, the sector has already witnessed many layoffs, raising questions about the long-term implications of this evolving landscape. The past year, aptly termed the &#8220;year of [&#8230;]"
  }
]