[
  {
    "source": "Cointelegraph",
    "date": "2023-12-27T19:34:14.000Z",
    "title": " Fortnite, GTA6 might create a functional metaverse before any crypto nerds ",
    "url": "https://cointelegraph.com/news/fortnite-gta6-functional-metaverse-before-crypto-nerds",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNmU1NTBlZjctOWE4Yi00ZWU0LTgzZWItOWZkOTA5MGNkY2VmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Web3 geeks keep ranting about the metaverse, so it's ironic that Web2 games might be the first to bring us functional versions of it in 2024 and 2025.</p>\n                    <p><p>Disruptive innovation commonly undergoes a pattern of gradual evolution. It develops and matures on established foundations. Things don't simply happen spontaneously. That has been clearly visible in the shift from <a href=\"https://cointelegraph.com/explained/how-web3-resolves-fundamental-problems-in-web2\">Web2</a> to <a href=\"https://cointelegraph.com/blockchain-for-beginners/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future\">Web3</a>, particularly when it comes to the metaverse.</p><p>The metaverse didn't emerge out of nothing. Rather, it is has been evolving for years, derived primarily from Web2 video games — which presently offer environments that come much closer to the concept of the metaverse than any Web3 projects.</p><p><em><strong>Related: <a href=\"https://cointelegraph.com/news/wagmi-mentality-undermining-crypto\">The ‘WAGMI’ mentality is undermining crypto</a></strong></em></p><p><a href=\"https://cointelegraph.com/news/fortnite-gta6-functional-metaverse-before-crypto-nerds\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-27T19:30:25.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">MicroStrategy has increased its Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) holdings by an additional 14,620 coins, according to regulatory filings with the United States Securities and Exchange Commission. Meanwhile, ARK Invest CEO Cathie Wood expects some investors to “sell on the news” of spot Bitcoin ETF approval in the short term, but sees the long-term perspective as promising. Elsewhere, Grayscale Investments has announced a shake-up in its board of directors, with the firm's CEO and president stepping down — this happened the same day Grayscale refiled its spot Bitcoin ETF application with some notable changes. </p><p>Business intelligence firm MicroStrategy acquired <a href=\"https://cointelegraph.com/news/microstrategy-14620-bitcoins-december-2023\">an additional 14,620 BTC</a> between Nov. 20 and Dec. 26, the company announced in a regulatory filing with the SEC.</p><p>The cumulative price of the newly acquired Bitcoin was $615.7 million, or $42,110 per coin. MicroStrategy has now amassed a staggering 189,150 BTC, making it one of the world's largest Bitcoin whales. </p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-27T19:20:28.000Z",
    "title": "10 Cryptos Under $10 Worth Every Penny in 2024",
    "url": "https://cryptodaily.co.uk/2023/12/10-cryptos-under-10-worth-every-penny-in-2024",
    "description": "Explore our expert guide on the top 10 cryptocurrencies under $10 in 2024, offering incredible value and potential for growth. Discover affordable investment opportunities in the dynamic world of digital currencies"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T19:32:13.000Z",
    "title": "Microsoft Patents Groundbreaking In-Browser AI Technology for On-Device Processing",
    "url": "https://www.cryptopolitan.com/microsoft-in-browser-ai-technology/",
    "description": "Microsoft Corporation, a pioneer in the technology industry, has recently filed a patent that could revolutionize the way artificial intelligence (AI) is processed and utilized. The patent, unveiled on December 21, 2023, introduces a groundbreaking technology that enables users to create and run AI pipelines directly within web browsers on their devices.&#160; This innovation is [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T19:29:53.000Z",
    "title": "Russia, Iran finally dump the US dollar for good",
    "url": "https://www.cryptopolitan.com/russia-iran-dump-the-us-dollar-for-good/",
    "description": "In a bold move that shakes the foundations of international trade, Russia and Iran have officially turned their backs on the US dollar. This decision, a strategic pivot towards utilizing local currencies in their bilateral trade, marks a significant shift in the global economic landscape. The move not only challenges the dollar&#8217;s dominance but also [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T19:26:17.000Z",
    "title": "ElliQ: AI Companion for Loneliness Alleviation Among Seniors",
    "url": "https://www.cryptopolitan.com/elliq-for-loneliness-alleviation-seniors/",
    "description": "Intuition Robotics has introduced ElliQ, an AI-powered device designed specifically for seniors to combat loneliness and isolation among older Americans. ElliQ has found its way into the lives of elderly individuals across the country, offering companionship and assistance in various forms. A robotic companion for seniors ElliQ, a creation of Intuition Robotics, has emerged as [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T19:26:12.000Z",
    "title": "What’s the fate of France’s economy as Macron loses ground?",
    "url": "https://www.cryptopolitan.com/fate-of-france-economy-macron-loses-ground/",
    "description": "As France stands at a pivotal juncture in its political history, the question that looms large is: what does the future hold for its economy? With Emmanuel Macron&#8217;s influence waning, the political landscape of France is undergoing a seismic shift, one that could have profound implications for its economic health. The once-sturdy ground under President [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T19:20:18.000Z",
    "title": "Bankruptcy judges did what regulators could not in 2023 –  Is regulation better in the courts?",
    "url": "https://www.cryptopolitan.com/bankruptcy-judges-did-what-regulators-didnt/",
    "description": "In recent years, the dynamic landscape of the financial world has witnessed the rise and fall of crypto coins, ushering in a new era of economic uncertainty and bankruptcy fillings. The fervor surrounding these digital assets has not only captivated investors but has also posed unprecedented challenges, particularly when crypto markets experienced sudden and severe [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T19:17:20.000Z",
    "title": "Year 2023: A Global Snapshot",
    "url": "https://www.cryptopolitan.com/year-2023-a-global-snapshot/",
    "description": "In the Anthropocene era, the impact of human activities on the environment and climate is undeniable. Record-breaking global temperatures, particularly in the oceans, are becoming routine.&#160; Rising sea levels, melting ice caps, and drastic shifts in weather patterns are evident. The consequences manifest in devastating forest fires, severe flooding, and other extreme weather events. Despite [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-27T19:16:26.000Z",
    "title": "Central Bank of Nigeria reverses crypto ban",
    "url": "https://crypto.news/central-bank-of-nigeria-reverses-crypto-ban/",
    "description": "The Central Bank of Nigeria recently lifted its ban on local banks and financial institutions serving cryptocurrency firms."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-27T19:24:05.000Z",
    "title": "Shimmer Integrates LayerZero for Improved Cross-Chain Communication",
    "url": "https://www.crypto-news-flash.com/shimmer-integrates-layerzero-for-improved-cross-chain-communication/?utm_source=rss&utm_medium=rss&utm_campaign=shimmer-integrates-layerzero-for-improved-cross-chain-communication",
    "description": "<img width=\"875\" height=\"496\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/shimmer.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"shimmer\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/shimmer.png 875w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/shimmer-300x170.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/shimmer-768x435.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/shimmer-150x85.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/shimmer-450x255.png 450w\" sizes=\"(max-width: 875px) 100vw, 875px\" />Shimmer integrates LayerZero into ShimmerEVM, enhancing cross-chain communication and expanding connections with leading DeFi networks. This integration establishes a more connected digital ecosystem, driving development and interoperability in the blockchain space. Shimmer, known for its interoperable architecture, has integrated LayerZero into ShimmerEVM. This move marks a significant advance in cross-chain communication and decentralized finance (DeFi). [...]"
  }
]