[
  {
    "source": "Cointelegraph",
    "date": "2024-02-23T05:47:11.000Z",
    "title": " FTX to add over $1B to cash stack after court approves Anthropic sale ",
    "url": "https://cointelegraph.com/news/ftx-court-approval-sell-billion-dollar-anthropic-ai-stake",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZjBiNmEyNGQtNTJlNi00ODNjLThkZTEtM2M2NzkwYTAyODZkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Anthropic’s latest reported valuation is $15 billion, raising the value of FTX’s nearly 8% stake to over $1 billion that could be used to repay creditors.</p>\n                    <p><p data-ct-non-breakable=\"true\">Bankrupt crypto exchange FTX has been given the judge’s nod to sell over $1 billion worth of its shares in artificial intelligence startup Anthropic.</p><p>Delaware Bankruptcy Court Judge John Dorsey ruled in a Feb. 22 <a href=\"https://restructuring.ra.kroll.com/FTX/Home-DownloadPDF?id1=MzA3MjE0NA==&amp;id2=-1\" target=\"_blank\" rel=\"noopener nofollow\">hearing</a> that the sale could go ahead after FTX made concessions with some customers who objected to the sale.</p><p>The customers had claimed the Anthropic shares didn’t belong to FTX, saying they were purchased with misappropriated customer funds, citing <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\">evidence presented</a> during FTX co-founder Sam Bankman-Fried’s criminal trial.</p><p><a href=\"https://cointelegraph.com/news/ftx-court-approval-sell-billion-dollar-anthropic-ai-stake\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T05:43:10.000Z",
    "title": "Cardano Price Prediction 2024-2033: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2024-2033 Cardano stands out as a project with remarkable potential beyond its role as a tradable asset. Rooted in scholarly peer-reviewed research, it has cultivated a robust community over time. Here, we delve into the essence of Cardano and offer a projection for the future value of ADA. How Much is ADA [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T05:41:20.000Z",
    "title": "Cardano (ADA) Leads Scalability As Avalanche (AVAX) Tops Activity While Algotech (ALGT) Presale 275%",
    "url": "https://www.cryptopolitan.com/cardano-ada-leads-scalability-as-avalanche-avax-tops-activity-while-algotech-algt-presale-275/",
    "description": "Crypto enthusiasts have become active and optimistic since the presale launch of Algotech (ALGT). They believe that the fundamentals of this new project are quite strong, and it can soon become one of the largest and most profitable cryptocurrencies. Therefore, they are aggressively accumulating its presale tokens to earn massive returns over the coming weeks. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T05:41:02.000Z",
    "title": "“Feel like I’m buying MATIC at $0.1,” says Polygon Millionaire about this new token priced at just $0.04",
    "url": "https://www.cryptopolitan.com/feel-like-im-buying-matic-at-0-1-says-polygon-millionaire-about-this-new-token-priced-at-just-0-04/",
    "description": "Polygon is an Ethereum L2 scaling solution that has experienced exponential growth since its launch year. Its native token, MATIC, has shown a massive increase of 2700% to an all-time high of $2.8 from the $0.1 base level within a year. Based on CoinMarketCap rankings, it is now ranked 14th with a market volume of [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-23T06:07:33.000Z",
    "title": "Optimism’s Mainnet Surges With Over 60% Daily Active Addresses",
    "url": "https://nulltx.com/optimisms-mainnet-surges-with-over-60-daily-active-addresses/",
    "description": "Optimism, a Layer 2 network, is experiencing a significant uptick in user activity, with its Mainnet consistently boasting over 60% of the daily active addresses among the top optimistic rollups.  This surge in activity marks a pivotal moment in the adoption and utilization of layer 2 scaling solutions within the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-23T06:01:41.000Z",
    "title": "Crypto Whales Navigate Mixed Signals Amid Market Fluctuations, Top BTC Whales Accumulate More Bitcoins",
    "url": "https://nulltx.com/crypto-whales-navigate-mixed-signals-amid-market-fluctuations-top-btc-whales-accumulate-more-bitcoins/",
    "description": "Whale activity has been a mixed bag lately, with some whales opting to buy while others choose to sell, all in pursuit of capitalizing on recent market movements. Among the largest cohort of whales, those holding between 1,000 and 100,000 BTC, there&#8217;s a discernible trend of accumulation, typically associated with [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-02-23T05:55:24.000Z",
    "title": "Ethereum Faces Volatility As Market Value Surpasses $3K With Whales Selling And Buying More Token",
    "url": "https://nulltx.com/ethereum-faces-volatility-as-market-value-surpasses-3k-with-whales-selling-and-buying-more-token/",
    "description": "The cryptocurrency community celebrated a significant milestone as Ethereum&#8217;s market value surpassed $3,000 for the first time since April 2022. However, the jubilation was short-lived as the broader market experienced a drop over the past 24 hours, signaling a period of volatility. 🧐 #Crypto&#39;s celebration of #Ethereum&#39;s market value exceeding [&#8230;]"
  }
]