[
  {
    "source": "Decrypt",
    "date": "2023-06-23T11:02:59.000Z",
    "title": "SEC to Forego BlockFi’s Outstanding $30 Million Penalty—For Now",
    "url": "https://decrypt.co/145899/sec-to-forego-blockfis-outstanding-30-million-penalty-for-now",
    "description": "The Securities and Exchange Commission has agreed to let BlockFi’s investors go to the front of the claims queue. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T10:55:45.000Z",
    "title": "Crypto.com receives regulatory approval to offer crypto services in Spain ",
    "url": "https://cointelegraph.com/news/crypto-com-enters-spain-with-regulatory-approval-to-offer-crypto-services",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/0184410b-a17c-4a88-b518-e9c02b9d3013.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The latest regulatory approval for the crypto exchange comes within weeks of getting a MPI license from regulators in Singapore </p>\n                    <p><p>Singapore based cryptocurrency exchange service provider Crypto.com has <a href=\"https://crypto.com/company-news/crypto-com-obtains-virtual-asset-service-provider-registration-in-spain\" target=\"_blank\" rel=\"noopener nofollow\">obtained </a>a virtual asset service provider (VASP) registration from the Bank of Spain. The regulatory approval would allow the exchange to offer a range of crypto-focused services to customers in Spain, a country which has shown a positive crypto stance in recent times.</p><p>The crypto exchange platfrom had to undergo a comprehensive review of its Anti-Money Laundering Directive (AMLD) compliance and adhere to other financial crimes laws before getting the nod. The latest regulatory approval in Spain comes within weeks of obtaining a <a href=\"https://cointelegraph.com/news/crypto-com-joins-ranks-of-licensed-payment-institutions-in-singapore\">major payment institution (MPI) license for digital payment token (DPT) services by the Monetary Authority of Singapore (MAS).</a></p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We&#39;re excited to share our latest regulatory achievement in Europe!<br><br>We have obtained our Virtual Asset Provider Registration in Spain <br><br>Learn more:<a href=\"https://t.co/ZGmgE9n937\">https://t.co/ZGmgE9n937</a> <a href=\"https://t.co/fmkWt6npvK\">pic.twitter.com/fmkWt6npvK</a></p>&mdash; Crypto.com (@cryptocom) <a href=\"https://twitter.com/cryptocom/status/1672161216305987584?ref_src=twsrc%5Etfw\">June 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Kris Marszalek, CEO of Crypto.com called its latest entry into the Spanish crypto market a testimony of their “commitment to compliance” while adding:</p><blockquote>“We look forward to continuing to work with the Bank of Spain as we launch our products and services in-market and providing users with the comprehensive, safe and secure crypto experience that they desire.” </blockquote><p>The latest regulatory approval helped the crypto exchange become a regulated platform in nearly a dozen countries. Apart from Spain, the firm has obtained regulatory nod in Singapore, <a href=\"https://cointelegraph.com/news/crypto-com-scores-fresh-regulatory-approval-in-france\">France</a>, United Kingdom, Dubai, South Korea, Australia, Italy, Greece, Cayman Islands, and a pre-registration undertaking with Ontario Securities Commission and Canada Securities Administrators.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-com-adds-pay-support-for-matic-usdc-and-dai\"><strong><em>Crypto.com adds Pay support for MATIC, USDC and DAI</em></strong></a></p><p>Crypto.com like most other crypto businesses, thrived during the 2021-22 bull market, expanding its <a href=\"https://cointelegraph.com/news/staples-center-los-angeles-will-be-renamed-crypto-com-arena\">partnerships into the mainstream</a> and obtaining regulatory approval in multiple jurisdictions. The platfrom made headlines when it obtained naming rights to the very famous Staples Center in Los Angeles. The Staples Center is a multi-purpose arena that has been home to numerous public events including boxing and basketball competitions, as</p><p>However, with the advent of the bear market, the platform faced certain business troubles and a fall in demand leading to the <a href=\"https://cointelegraph.com/news/crypto-com-suspends-us-institutional-exchange-service\">closure of its </a>institutional platform in the United States earlier this month. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-23T10:50:00.000Z",
    "title": "PEPE Makes Huge Gains, Crypto Daily TV 23/6/2023",
    "url": "https://cryptodaily.co.uk/2023/06/pepe-makes-huge-gains-crypto-daily-tv-23-6-2023",
    "description": "In Todays Headline TV CryptoDaily News:\n<p></p>\n<p>Pepecoin becomes biggest meme coin gainer</p>\n<p>Pepecoin surged as much as 40% to extend weekly gains to over 70% amid a market-wide rally led by bitcoin. Trading volumes for the frog-themed tokens jumped to over $800 million, as a risk-on environment likely fueled outsized bets on riskier assets, such as altcoins and meme coins.</p>\n<p>Ripple gets in-principle nod for digital asset services in Singapore</p>\n<p>Blockchain-based payments firm Ripple has obtained in-principle regulatory approval from Singapore&rsquo;s financial regulator to offer digital asset payments and token products in the city-state.</p>\n<p>ETF-fueled rally puts ether lower versus BTC</p>\n<p>The price ratio between ether and bitcoin, a commonly watched metric for the biggest cryptocurrencies, sank to a two-month low as a traditional finance giant's plan for a BTC exchange-traded fund dramatically shifted sentiment in the industry.</p>\nBTC/USD rose 0.5% in the last session.\n<p>The Bitcoin-Dollar pair rose 0.5% in the last session. According to the Williams indicator, we are in an overbought market. Support is at 27206.3333 and resistance at 32172.3333.</p>\n<p>The Williams indicator points to an overbought market.</p>\n<p></p>\nETH/USD traded sideways in the last session.\n<p>Ethereum-Dollar price remained largely unchanged in the last session. The ROC is giving a negative signal. Support is at 1747.3767 and resistance at 1970.2567.</p>\n<p>The ROC is currently in negative territory.</p>\n<p></p>\nXRP/USD fell 0.4% in the last session.\n<p>Ripple fell 0.4% against the Dollar in the last trading session. The Stochastic-RSI's positive signal is in line with the overall technical analysis. Support is at 0.4835 and resistance at 0.5116.</p>\n<p>The Stochastic-RSI is currently in positive territory.</p>\n<p></p>\nLTC/USD skyrocketed 1.3% in the last session.\n<p>The Litecoin-Dollar pair skyrocketed 1.3% in the last session. The ROC's positive signal is in line with the overall technical analysis. Support is at 76.8733 and resistance at 91.3933</p>\n<p>The ROC is currently in positive territory.</p>\n<p></p>\nDaily Economic Calendar:\n<p>JP Jibun Bank Services PMI</p>\n<p>The Jibun Bank Services Purchasing Managers Index (PMI) captures the business conditions in the services sector. The services PMI is an important indicator of the overall economic conditions. Japan's Jibun Bank Services PMI will be released at 00:30 GMT, the Dutch Gross Domestic Product at 04:30 GMT, the UK's CFTC GBP NC Net Positions at 20:30 GMT.</p>\n<p>NL Gross Domestic Product</p>\n<p>The Gross Domestic Product is a measure of the total value of all goods and services produced by a country. The GDP is considered as a broad measure of economic activity and health.</p>\n<p>UK CFTC GBP NC Net Positions</p>\n<p>The weekly Commitments of Traders (COT) report provides information on the size and the direction of the positions taken. The report focuses on speculative positions.</p>\n<p>US Baker Hughes US Oil Rig Count</p>\n<p>The Baker Hughes Rig Count is an important business barometer for the drilling industry and its suppliers. Active drilling rigs consume products and services produced by the oil service industry. The US Baker Hughes US Oil Rig Count will be released at 17:00 GMT, the Belgian Leading Indicator at 13:00 GMT, the UK's Retail Sales at 06:00 GMT.</p>\n<p>BE Leading Indicator</p>\n<p>The Leading Indicator indicates future trends of the overall economic activity including industrial confidence, orders inflow/demand, tendency in manufacturing, and more.</p>\n<p>UK Retail Sales</p>\n<p>The Retail Sales measures the total receipts of retail stores. Monthly percent changes reflect the rate of change of such sales.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-23T11:00:11.000Z",
    "title": "Securing Web3 With Zero Trust: Empowering Data, Smart Contracts, and AI on the Blockchain With Mind Network",
    "url": "https://news.bitcoin.com/securing-web3-with-zero-trust-empowering-data-smart-contracts-and-ai-on-the-blockchain-with-mind-network/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-88-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-88-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-88-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-88-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-88-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-88-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-88-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/unnamed-88.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In the rapidly evolving world of Web3, where data security and privacy are paramount, innovative solutions are needed to protect sensitive information and establish trust within the decentralized ecosystem. This sponsored article delves into the concept of Zero Trust and explores how it serves as the foundation for a revolutionary platform called Mind Network. By [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T10:48:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T10:44:37.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T10:40:03.000Z",
    "title": "Breaking Through This Ceiling Will Propel XRP By Another 12%",
    "url": "https://www.newsbtc.com/analysis/xrp/breaking-through-this-ceiling-will-propel-xrp-by-another-12/",
    "description": "The price of XRP experienced an increase after surpassing the $0.50 mark; however, it has recently undergone a fresh decline. Analyzing the daily chart, the altcoin has depreciated by approximately 3%, whereas the weekly chart shows an appreciation of about 6%. The technical outlook for XRP indicates a bearish bias due to a decrease in demand and accumulation shown on the chart. Buying strength has weakened following the coin&#8217;s drop below the $0.50 threshold. As Bitcoin entered the $30,000 price range, other major altcoins also began to appreciate on their respective charts but remained constrained beneath immediate resistance levels. So it is crucial for XRP to surpass the $0.50 mark to enable an upward movement. Related Reading: Conflux Claims Its Place Among Top Altcoins As CFX Price Skyrockets 46% Currently, the $0.50 price level acts as a significant barrier that needs to be converted into immediate support. If the altcoin manages to consistently trade above $0.50 for a substantial number of sessions, it may initiate a rally. The market capitalization of XRP has also declined, indicating a decrease in buying strength. XRP Price Analysis: One-Day Chart Following its failure to maintain a price above $0.50, the altcoin was trading at $0.49. With a small boost from buyers, there is potential for the altcoin to once again surpass the $0.50 threshold. An important resistance level for XRP is situated at $0.53. If this resistance is overcome, XRP could make an attempt to trade above $0.56, resulting in a significant 12% rally. Conversely, a decline from the current price level would bring XRP down to $0.47. The volume of XRP traded during the last session was in the red, indicating that selling pressure outweighed buying pressure. Technical Analysis Despite a slight recovery attempt in buying strength, investor confidence was dampened by the recent price dip. The Relative Strength Index (RSI) was positioned just below the half-line, suggesting that sellers outnumbered buyers at the time of writing. Additionally, the price of the asset dropped below the 20-Simple Moving Average line, indicating a decline in demand and signaling that sellers were driving the price momentum in the market. Despite a decline in sell signals on the daily chart though, XRP remained under the control of sellers. The Moving Average Convergence Divergence (MACD), which illustrates price momentum and its changes, displayed red signal bars associated with sell signals. The Bollinger Bands, which indicate the price volatility and fluctuations, were wide but parallel, suggesting that XRP may not trade within a narrow range. Related Reading: Avalanche Coin Teeters At Crucial Price Level: Which Way Will it Swing? Given this, it will still face significant challenges in surpassing the $0.51 price level. However, a move above this level is anticipated to reignite demand, potentially propelling the price higher. Featured Image From UnSplash, Chart From TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T11:00:43.000Z",
    "title": "How New Meme Coin Caged Beast Compares to Top Altcoins Avalanche & Solana",
    "url": "https://www.crypto-news-flash.com/how-new-meme-coin-caged-beast-compares-to-top-altcoins-avalanche-solana/?utm_source=rss&utm_medium=rss&utm_campaign=how-new-meme-coin-caged-beast-compares-to-top-altcoins-avalanche-solana",
    "description": "&#160; Caged Beasts (BEASTS) is an intriguing new meme coin that will be entering its IPO phase with the launch of a presale in a matter of weeks. In preparation for that, it’ll be a good idea for potential investors of the project to see how it compares to already established top cryptos like Avalanche [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-23T11:00:31.000Z",
    "title": "When will the Next Bull Run Begin? – Part 1",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/when-will-the-next-bull-run-begin-part-1/",
    "description": "<p>Many people believe we should have entered a bull market a long time ago. We are all tired of the bear market and the havoc it has wreaked. But the SEC’s recent attack on crypto companies has raised concerns about when we will eventually enter the bull market. For clarity&#8217;s sake, the bull market is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/when-will-the-next-bull-run-begin-part-1/\">When will the Next Bull Run Begin? &#8211; Part 1</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-23T10:46:38.000Z",
    "title": "When will the Real Bull Market Begin – Part 2",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/when-will-the-real-bull-market-begin-part-2/",
    "description": "<p>While predicting exact market cycles is challenging, we can gain valuable insights by analyzing the opinions of crypto analysts, traders, and industry leaders. This is the second part of this article, we will look at their opinions to see when the next bull market might develop. You can read the first here. Opinions from Crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/when-will-the-real-bull-market-begin-part-2/\">When will the Real Bull Market Begin &#8211; Part 2</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-23T10:52:24.000Z",
    "title": "Coinfest Asia Uses Web2.5 Theme and Will Feature Over 100 Speakers",
    "url": "https://coinedition.com/coinfest-asia-uses-web2-5-theme-and-will-feature-over-100-speakers/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/PR-1-85.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/PR-1-85.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/PR-1-85-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/PR-1-85-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/PR-1-85-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/PR-1-85-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/PR-1-85-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/PR-1-85-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/PR-1-85-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/PR-1-85-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/PR-1-85-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/PR-1-85-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/PR-1-85-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/PR-1-85-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/PR-1-85-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/PR-1-85-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/PR-1-85-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Coinfest Asia 2023 by Coinvestasi is ready to return on August 24-25 2023, in Jimbaran, Bali. Carrying the theme of Web2.5, Coinfest Asia wants to strengthen the linkages between the Web2 and Web3 industries, thus forming a more resilient Web2.5 industry. This festival will invite participants to explore real use cases from Web3, which can [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinfest-asia-uses-web2-5-theme-and-will-feature-over-100-speakers/\">Coinfest Asia Uses Web2.5 Theme and Will Feature Over 100 Speakers</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-23T10:45:46.000Z",
    "title": "Many Long-Term BAYC Holders Sell Their NFTs in the Last 7 Days",
    "url": "https://coinedition.com/many-long-term-bayc-holders-sell-their-nfts-in-the-last-7-days/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Unique_wallets_the_number_of_wallets_holding_at_least_one_BAYC_NFT-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to Nansen, a blockchain data and research platform, many long-term Bored Ape Yacht Club (BAYC) NFT holders sold their NFTs in the last seven days. In a Twitter post, the research platform showed that 36 long-term holders had their BAYC NFTs for over one year. Nansen also revealed that the number of wallets holding [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/many-long-term-bayc-holders-sell-their-nfts-in-the-last-7-days/\">Many Long-Term BAYC Holders Sell Their NFTs in the Last 7 Days</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]