[
  {
    "source": "Cointelegraph",
    "date": "2024-01-23T02:45:31.000Z",
    "title": " MoonDAO ‘unlikely’ to colonize the moon by 2030, admits co-founder ",
    "url": "https://cointelegraph.com/news/moondao-crypto-space-moon-mission-funding-research",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZDk4MGQyN2ItYWZjMi00ZjYzLTg0ZTktNmZiMmJjY2MwM2ZjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Co-founder Pablo Moncada said the ambitious goal is lofty for a reason, and that his DAO could eventually become a solution to the “walled-off” landscape of space exploration.</p>\n                    <p><p>For the last two and a bit years, MoonDAO co-founder Pablo Moncada and his decentralized autonomous organization (DAO) have been working to create a self-sustaining colony on the moon.</p><p>The timeline? Just under seven years from now. </p><p>That is, at least, the very ambitious goal of Moncada and the 5,000-member-strong MoonDAO that he co-founded in 2021. </p><p><a href=\"https://cointelegraph.com/news/moondao-crypto-space-moon-mission-funding-research\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-23T03:00:52.000Z",
    "title": "China Pushes Metaverse Standardization Group to Establish the Rules of the Yuanverse",
    "url": "https://news.bitcoin.com/china-pushes-metaverse-standardization-group-to-establish-the-rules-of-the-yuanverse/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/9ca355d4-4461-44d9-8163-050ca5a05b24-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"China Pushes Metaverse Standardization Group to Create the Rules of the Yuanverse\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/9ca355d4-4461-44d9-8163-050ca5a05b24-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/9ca355d4-4461-44d9-8163-050ca5a05b24-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/9ca355d4-4461-44d9-8163-050ca5a05b24-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/9ca355d4-4461-44d9-8163-050ca5a05b24-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/9ca355d4-4461-44d9-8163-050ca5a05b24-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/9ca355d4-4461-44d9-8163-050ca5a05b24-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/9ca355d4-4461-44d9-8163-050ca5a05b24-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The government of China has announced the creation of a metaverse standardization working group to establish different rules to govern the Chinese Yuanverse platform. The standardization group will be integrated by Chinese universities, government institutions, and companies like Tencent, Huawei, Baidu, Netease, and Sense Time. China Announces Metaverse Standardization Group The Chinese government aims to [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-23T03:08:37.000Z",
    "title": "Bitcoin Price Dives Below $40K, Can Bulls Save The Day?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-dives-below-40k/",
    "description": "Bitcoin price extended its decline below the $40,000 support zone. BTC is consolidating losses and remains at risk of more downsides below $38,500. Bitcoin price is gaining bearish momentum below the $40,500 zone. The price is trading below $40,500 and the 100 hourly Simple moving average. There is a connecting bearish trend line forming with resistance near $40,850 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might correct above $40,000 but the bears could remain active near $40,500. Bitcoin Price Takes Hit Bitcoin price remained in a bearish zone below the $42,000 support zone. BTC bears gained strength and were able to push the price below the $40,000 support zone. A new weekly low was formed near $39,451 and the price is now consolidating losses. It is slowly recovering above the $39,800 level. It is approaching the 23.6% Fib retracement level of the recent decline from the $42,260 swing high to the $39,451 low. Bitcoin is now trading below $40,500 and the 100 hourly Simple moving average. Immediate resistance is near the $40,150 level. The first major resistance is near the $40,850 level. There is also a connecting bearish trend line forming with resistance near $40,850 on the hourly chart of the BTC/USD pair. Source: BTCUSD on TradingView.com The trend line is close to the 50% Fib retracement level of the recent decline from the $42,260 swing high to the $39,451 low. A clear move above the $40,850 resistance could send the price toward the $41,250 resistance. The next resistance is now forming near the $42,000 level. A close above the $42,000 level could push the price further higher. The next major resistance sits at $43,000. More Downsides In BTC? If Bitcoin fails to rise above the $40,850 resistance zone, it could continue to move down. Immediate support on the downside is near the $39,650 level. The next major support is $39,500. If there is a close below $39,500, the price could gain bearish momentum. In the stated case, the price could drop toward the $38,500 support in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $39,500, followed by $38,500. Major Resistance Levels – $40,500, $40,850, and $41,250."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-23T03:00:57.000Z",
    "title": "Ethereum’s Tipping Point: Analyst Warns Of Steep Drop To $2,000",
    "url": "https://www.newsbtc.com/news/ethereum/ethereums-tipping-point-analyst-warns-of-steep-drop-to-2000/",
    "description": "Since Ethereum (ETH) peaked at $2,717 in the last two weeks, the asset has experienced a gradual decline, culminating in its arrival at a key demand zone, which could be instrumental in determining its imminent price trajectory, according to a prominent crypto analyst. Critical Support Zone Flags Continuous Bearish Move Renowned crypto analyst Ali has pinpointed a critical demand zone for ETH, ranging between $2,388 and $2,460. The resilience of this support level could pave the way for an upward trajectory, offering Ethereum a much-needed respite from bearish pressures. Related Reading: Market Dips, Whales Play: Bitcoin And Ethereum Snagged By Savvy Investors However, should Ethereum falter, a bearish slide to the next major support level of around $2,000 may be imminent. Such a decline would represent a significant drop of nearly 20% from its current price around the $2,300 mark, posing a stern test for Ethereum&#8217;s market upward stability. #Ethereum Market Update: $ETH is currently in a key demand zone, ranging between $2,388 and $2,460. If this support holds strong, there&#8217;s a clear path ahead with minimal resistance, offering a potential for upward movement. ⚠️ However, if #ETH fails to maintain this level, we… pic.twitter.com/F0HfyrSdGF — Ali (@ali_charts) January 21, 2024 Over the past 24 hours, Ethereum has witnessed a noticeable 4.3% decrease in value, breaching Ali&#8217;s critical demand zone. Currently, ETH trades at $2,368, signaling a possibility of a further plunge from here. This price dip is mirrored in Ethereum&#8217;s trading volume, which has seen a significant decrease from $19 billion last Monday to just over $10 billion today, indicating lesser trading activity and a shift in investor sentiment. Ethereum&#8217;s Market Dynamics: Whales Buying Dip and Rising Dominance The current market dip has not gone unnoticed by savvy investors. According to Lookonchain, a crypto analytics platform, a prominent Ethereum whale has capitalized on the opportunity, acquiring 3,600 ETH valued at around $8.9 million. After the price of $ETH dropped today, this smart whale bought 3,600 $ETH($8.9M) back at a lower price 5 hours ago. This whale is very good at buying $ETH at low prices and selling $ETH at highs. The profit is ~$25.8M currently!https://t.co/UzXbheftr1 pic.twitter.com/DannZzsQVk — Lookonchain (@lookonchain) January 19, 2024 This strategic move is part of a larger pattern observed in the whale&#8217;s trading history, marked by buying low and selling high. This tactic has reportedly amassed profits estimated at $25.8 million. Related Reading: Here Are The Most Bullish Predictions For ETH Price As Ethereum Dominance Rises Against Bitcoin Amid this bearishness, Ethereum has shown resilience in terms of market dominance. A recent report by analytics firm Santiment reveals that Ethereum&#8217;s market share, relative to the total crypto market capitalization, has surged by roughly 22.4% in just one week. This growth is complemented by a significant increase in active Ethereum addresses, with an average of 89,400 new addresses joining the network daily, reaching a peak of 96,300 new addresses in a single day. These figures suggest a growing interest and engagement in the Ethereum ecosystem despite the current market conditions. 📈 #Ethereum&#8216;s price dominance continues to surge against #Bitcoin&#8216;s, now +22.4% in a week. During this stretch, there have been 89.4K new $ETH addresses created per day, and 96.3K wallets just yesterday. Additionally, the 2nd largest market cap asset&#8217;s supply on (Cont) 👇 pic.twitter.com/9nHCl6PJPy — Santiment (@santimentfeed) January 16, 2024 Featured image from Unsplash, Chart from TradingView"
  }
]