[
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T14:39:52.000Z",
    "title": "BitMEX co-founder issues debt ceiling warnings",
    "url": "https://www.cryptopolitan.com/bitmex-co-founder-issue-debt-ceiling-warning/",
    "description": "Former BitMEX CEO, Arthur Hayes, has expressed expectations of significant Bitcoin volatility in the latter half of the year, attributing it to a potential “powder keg” explosion arising from the United States banking crisis and soaring national debt. Hayes, who currently manages the crypto-focused investment fund Maelstrom, shared his insights on the What Bitcoin Did ... <a title=\"BitMEX co-founder issues debt ceiling warnings\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitmex-co-founder-issue-debt-ceiling-warning/\" aria-label=\"More on BitMEX co-founder issues debt ceiling warnings\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-05-29T15:00:15.000Z",
    "title": "The Next Generation of Crypto won’t be like Axie Infinity. AI is the Future",
    "url": "https://nulltx.com/the-next-generation-of-crypto-wont-be-like-axie-infinity-ai-is-the-future/",
    "description": "Cryptocurrency markets are known for their volatility and rapid fluctuations. This makes it hard for traders to make profits in the market. Besides, it takes time for human traders to make accurate and timely decisions. Introducing AI Cryptocurrencies like Avorak AI brings affordable and easy-to-use trading bots to the markets. These bots calculate the potential [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-29T15:00:14.000Z",
    "title": "No All-Time High For Bitcoin In 2023, Former BitMEX Head Arthur Hayes Predicts",
    "url": "https://www.newsbtc.com/news/bitcoin/no-all-time-high-for-bitcoin-in-2023-former-bitmex-head-arthur-hayes-predicts/",
    "description": "In a recent podcast appearance, Arthur Hayes, the former head of BitMEX, delivered a sobering prediction about the largest cryptocurrency by market capitalization, Bitcoin (BTC). Hayes believes that Bitcoin&#8217;s anticipated climb to an all-time high of $70,000 is unlikely to materialize this year, dampening the hopes of investors and traders. However, he points to a potentially bullish turn in 2024, driven by a significant event that could shape the market&#8217;s trajectory. Bitcoin Rise To $70,000 To Be Delayed During an episode of the &#8216;What Bitcoin Did&#8217; podcast, Hayes shared his perspective on Bitcoin&#8217;s price trajectory. He indicated that breaching the $70,000 milestone is not expected to occur in 2023. Related Reading: The Best Decision Is To ‘Buy Bitcoin (BTC),’ Robert Kiyosaki Urges Instead, Hayes suggests that next year&#8217;s anticipated halving event will play a crucial role in determining the market&#8217;s direction. While the delay may disappoint some, he remains optimistic about a potential breakthrough in the near future. The former head of BitMEX believes that the upcoming 2024 halving, an event that slashes Bitcoin&#8217;s block reward in half, will be a pivotal moment for the market. He suggests that crossing the $70,000 barrier will likely happen during that time. However, his long-term forecast raises concerns about an impending &#8220;blow-off top&#8221; in 2025 or 2026, potentially signaling a significant societal event or turmoil which he calls &#8220;Armageddon.&#8221; Hayes attributes this potential turmoil to factors such as excessive money printing and growing global discontent. Hayes noted: We have got this halving next year, 2024. I think that’s gonna be a good year. I don’t think we get up to $70,000 this year. Next year is when we cross that barrier and then we get the blow-off top 2025, 2026. And then it’s Armageddon. BTC Latest Price Action Meanwhile, Bitcoin has shown a possible brewing uptick in the past week. The largest crypto asset by market capitalization has surged 4.3% in the past week. Over the past 24 hours, BTC has seen a 2.8% gain. At the time of writing, Bitcoin currently trades at $27,925 after slightly trading above $28,000 on Sunday. Bitcoin&#8217;s trading volume has surged from $5 billion last Monday to $12 billion in the past 24 hours indicating a possible upward momentum.  In addition, the asset&#8217;s market capitalization has also seen a more than $20 billion gain in the past 7 days. However, according to Hayes, the increased practice of quantitative easing, which involves injecting more money into the economy, has created a volatile situation that could explode in the third and fourth quarters of this year. Related Reading: JPMorgan Predicts Bitcoin (BTC) To Revisit $45,000, Here’s Why He warns of mounting geopolitical tensions and a lack of trust, asserting that these factors form a &#8220;tinderbox&#8221; that could trigger a period of immense volatility for Bitcoin. Hayes emphasizes the importance of navigating these uncertain times, both for individuals seeking financial stability and for the cryptocurrency market as a whole. Featured image from Shutterstock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-29T14:40:50.000Z",
    "title": "Unlocking Cardano’s Staking Potential: Atrium Lab Launches Innovative Solution for Delegating ADA to 50 Pools",
    "url": "https://www.crypto-news-flash.com/unlocking-cardanos-staking-potential-atrium-lab-launches-innovative-solution-for-delegating-ada-to-50-pools/?utm_source=rss&utm_medium=rss&utm_campaign=unlocking-cardanos-staking-potential-atrium-lab-launches-innovative-solution-for-delegating-ada-to-50-pools",
    "description": "<p>Atrium protocol plans to offer multi-pool staking with rebalancing on Cardano, allowing users to lock ADA using smart contracts and rebalancing between successful staking pools. Atrium&#8217;s Staking Baskets, approved by MLabs, will enable Cardano users to delegate ADA to multiple staking pools seamlessly, promoting decentralization and portfolio diversification. As the Cardano blockchain ecosystem evolves, more [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/unlocking-cardanos-staking-potential-atrium-lab-launches-innovative-solution-for-delegating-ada-to-50-pools/\">Unlocking Cardano&#8217;s Staking Potential: Atrium Lab Launches Innovative Solution for Delegating ADA to 50 Pools</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-29T14:40:00.000Z",
    "title": "Bulls Overcome Delay: LUNC Price Surges Amid Terra Classic v2.1.0 Upgrade",
    "url": "https://coinedition.com/bulls-overcome-delay-lunc-price-surges-amid-terra-classic-v2-1-0-upgrade/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Bulls_Overcome_Delay_LUNC_Price_Surges_Amidst_Terra_Classic_v2-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Bulls_Overcome_Delay_LUNC_Price_Surges_Amidst_Terra_Classic_v2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Bulls_Overcome_Delay_LUNC_Price_Surges_Amidst_Terra_Classic_v2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Bulls_Overcome_Delay_LUNC_Price_Surges_Amidst_Terra_Classic_v2-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Bulls_Overcome_Delay_LUNC_Price_Surges_Amidst_Terra_Classic_v2-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Bulls_Overcome_Delay_LUNC_Price_Surges_Amidst_Terra_Classic_v2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Bulls_Overcome_Delay_LUNC_Price_Surges_Amidst_Terra_Classic_v2.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The L1 Joint Task Force (L1JTF) has opted to delay the delivery of the much anticipated v2.1.0 upgrade for the Terra Classic blockchain in a recent update to its Q2 timetable. Project Manager LuncBurnArmy (LBA) noted the necessity for further testing as the reason for the postponed release date, which is now planned for June [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bulls-overcome-delay-lunc-price-surges-amid-terra-classic-v2-1-0-upgrade/\">Bulls Overcome Delay: LUNC Price Surges Amid Terra Classic v2.1.0 Upgrade</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]