[
  {
    "source": "Decrypt",
    "date": "2023-11-07T18:56:27.000Z",
    "title": "Rookie Sensation Victor Wembanyama Set to Make NBA Top Shot Debut",
    "url": "https://decrypt.co/204677/rookie-sensation-victor-wembanyama-nba-top-shot-nft",
    "description": "San Antonio Spurs rookie Victor Wembanyama gets his first NBA Top Shot NFT today after last week’s $110K Sorare NFT sale."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-07T18:50:26.000Z",
    "title": "Ava Labs lays off 12% of staff to reallocate resources",
    "url": "https://cryptoslate.com/ava-labs-lays-off-12-of-staff-to-reallocate-resources/",
    "description": "<p>Ava Labs founder Emin Gün Sirer announced a strategic workforce reduction at the company on Nov. 6, citing the need to reallocate resources. Gün Sirer announced the decision on X, noting that the layoff affects 12% of the company’s workforce to &#8220;reallocate resources to double down on the growth of our firm and the Avalanche [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ava-labs-lays-off-12-of-staff-to-reallocate-resources/\">Ava Labs lays off 12% of staff to reallocate resources</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-07T18:50:37.000Z",
    "title": "Coinbase Enlists National Security Experts to Advisory Council",
    "url": "https://cryptobriefing.com/coinbase-national-security-experts-advisory-council/?utm_source=feed&utm_medium=rss",
    "description": "Coinbase adds 4 national security experts, including Frances Townsend and Stephanie Murphy, to advise its leadership on crypto."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-07T18:44:32.000Z",
    "title": "Bitcoin and Ripple Watch the Horizon for November's Critical Calls",
    "url": "https://cryptodaily.co.uk/2023/11/bitcoin-and-ripple-watch-the-horizon-for-novembers-critical-calls",
    "description": "Dive into the enigmatic dance of Bitcoin (BTC) and Ripple (XRP) as they approach a defining moment in the crypto arena. Our in-depth examination uncovers their potential paths amidst ETF speculations and legal entanglements, offering a nuanced perspective on their upcoming market maneuvers. Stay informed with our expert analysis, poised to navigate through the unpredictable twists and turns of a market on the cusp of change. Whether it's a bullish surge or a bearish downturn, our insights are designed to keep you one step ahead in the dynamic world of cryptocurrency."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-07T19:06:50.000Z",
    "title": "Broker Complaint Alert (BCA) Marks 3 Years of Successful Crypto Scam Recovery, Bringing Hope to Victims Worldwide",
    "url": "https://cryptodaily.co.uk/2023/11/broker-complaint-alert-bca-marks-3-years-of-successful-crypto-scam-recovery-bringing-hope-to-victims-worldwide",
    "description": "Broker Complaint Alert (BCA) Marks 3 Years of Successful Crypto Scam Recovery, Bringing Hope to Victims Worldwide"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-07T19:00:13.000Z",
    "title": "Chainlink Has Massive Resistance Ahead, Will The Rally End Soon?",
    "url": "https://www.newsbtc.com/chainlink-news/chainlink-massive-resistance-ahead-rally-end-soon/",
    "description": "On-chain data shows there is major resistance ahead for Chainlink, a sign that could be troubling for the rally&#8217;s sustainability. Only 55% Of Chainlink Investors Are In Profit So Far As explained by an analyst in a post on X, Chainlink is still behind Bitcoin in terms of investor profitability despite the LINK price outperforming BTC in the year so far. The below chart shows what the LINK address concentration looks like on the different price ranges that the asset has previously visited: The different on-chain resistance and support levels of the asset &#124; Source: @hmalviya9 on X Here, the size of the dot represents the number of investors or addresses who purchased their coins inside the particular price range. It would appear that the ranges below $10 are host to the cost basis of a hefty number of holders. Related Reading: XRP Enjoys 11% Rally As Sharks &#38; Whales Hit 2023 High Holdings Since the LINK price is above these levels right now, these investors would naturally be in a state of profit. These addresses only make for about 55% of the network total, however, implying that a significant number of them are still sitting at a loss. From the chart, it&#8217;s visible that the $16 to $27 range in particular has a considerable density of investors. In on-chain analysis, major support and resistance levels are defined on the basis of the number of investors that are at a particular range. This is because of the fact that whenever the spot price interacts with the cost basis of an investor, they become more likely to show a move. When the price retests the cost basis from above, the holder may decide to buy more. The reason behind this is that they might tend to believe that the level, which had been profitable for them earlier, might produce gains in the future again, so it would appear like an ideal point of accumulation for them. On the other hand, the red holders might see the break-even point as a decent exit point, as they might fear that the cryptocurrency would go back down in the near future, so going out here at least means they can avoid taking any losses. Such buying or selling from just a few investors when the price retests their common cost basis doesn&#8217;t produce any effects on the macro scale, but if a large number of investors bought at the same level, the reaction might be more pronounced. Related Reading: Bitcoin Has Just Cleared A Level That Historically Lead To Rallies Of 99%+ Thus, the Chainlink levels ahead until the $27 mark might prove to be a source of some heavy resistance, making the rally hard to sustain through them. The analyst notes, however, &#8220;once LINK breaks the $27 mark, the ensuing rally is expected to be substantial. Alongside this, the wallet profitability ratio is projected to surpass 80%.&#8221; As mentioned before, Bitcoin&#8217;s investor profitability distribution is looking much better so far, as the below chart from IntoTheBlock shows: Looks like the current price levels have a substantial amount of investors &#124; Source: IntoTheBlock on X Bitcoin is currently battling against the resistance offered by the current investor-packed $34,100 to $35,100 range. Once BTC is through these levels, however, the road towards $40,000 might prove to be relatively easy. LINK Price Following its 12% rally in the past week, Chainlink is now sitting just below the $12.9 mark. LINK has exploded more than 67% in the past month &#124; Source: LINKUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, IntoTheBlock.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-07T18:56:42.000Z",
    "title": "Bitcoin (BTC) Aims for $39K and InQubeta (QUBE) On Track to Raise $10M in Presale",
    "url": "https://www.crypto-news-flash.com/bitcoin-btc-aims-for-39k-and-inqubeta-qube-on-track-to-raise-10m-in-presale/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-btc-aims-for-39k-and-inqubeta-qube-on-track-to-raise-10m-in-presale",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-11.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-11.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-11-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-11-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Bitcoin, the leader in the top ten cryptocurrency list, may be able to reach the critical $39K mark in the coming weeks, which could lead to a major breakout. Meanwhile, InQubeta (QUBE), one of the top DeFi projects this year, is on its way to raising $10M in its presale. Let’s take a look at [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-07T18:53:00.000Z",
    "title": "Bitcoin Network Experiences Historic Hour-Long Block Production Delay",
    "url": "https://coinedition.com/bitcoin-network-experiences-historic-hour-long-block-production-delay/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Bitcoin_Mining_Difficulty_Drops_Most_Since_July_2021_as_Crypto_Winter.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin Network Experiences Historic Hour-Long Block Production Delay\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Bitcoin_Mining_Difficulty_Drops_Most_Since_July_2021_as_Crypto_Winter.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Bitcoin_Mining_Difficulty_Drops_Most_Since_July_2021_as_Crypto_Winter-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Bitcoin_Mining_Difficulty_Drops_Most_Since_July_2021_as_Crypto_Winter-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Bitcoin_Mining_Difficulty_Drops_Most_Since_July_2021_as_Crypto_Winter-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Bitcoin_Mining_Difficulty_Drops_Most_Since_July_2021_as_Crypto_Winter-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Bitcoin_Mining_Difficulty_Drops_Most_Since_July_2021_as_Crypto_Winter-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Data has shown that the Bitcoin (BTC) network has again experienced a historic temporary lapse in block production, with a notable pause that lasted over an hour. According to Bitcoin’s dedicated blockchain explorer, a delay occurred on November 7 as the network failed to produce a block between 16:47 and 17:56 (UTC+8). Prominent Chinese reporter [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bitcoin-network-experiences-historic-hour-long-block-production-delay/\">Bitcoin Network Experiences Historic Hour-Long Block Production Delay</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-07T19:05:25.000Z",
    "title": "Hard and Fast Bitcoin Price Explosion to New Highs About To Catch Everyone off Guard, Says Top Trader",
    "url": "https://dailyhodl.com/2023/11/07/hard-and-fast-bitcoin-price-explosion-to-new-highs-about-to-catch-everyone-off-guard-says-top-trader/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/trader-peter-washout-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/trader-peter-washout-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/trader-peter-washout-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/trader-peter-washout-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/trader-peter-washout-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/trader-peter-washout-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/trader-peter-washout-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader is predicting that Bitcoin (BTC) will suddenly soar in price and reach a new all-time high while many are caught on the sidelines. Pseudonymous analyst Bluntz tells his 226,800 followers on the social media platform X that Bitcoin may be in the early stages of a strong impulse that could [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/07/hard-and-fast-bitcoin-price-explosion-to-new-highs-about-to-catch-everyone-off-guard-says-top-trader/\">Hard and Fast Bitcoin Price Explosion to New Highs About To Catch Everyone off Guard, Says Top Trader</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]