[
  {
    "source": "Cryptopolitan",
    "date": "2023-09-30T13:37:00.000Z",
    "title": "Marvel to Unveil Exclusive Spider-Man 2 Suits at New York Comic Con",
    "url": "https://www.cryptopolitan.com/marvel-to-unveil-exclusive-spider-man-2/",
    "description": "New York Comic Con is just around the corner, and fans of the Marvel Universe have another reason to get excited. Marvel, the entertainment giant known for its beloved superhero franchises, is gearing up to make a big splash at this year&#8217;s event. While the official schedule for the Marvel booth at New York Comic ... <a title=\"Marvel to Unveil Exclusive Spider-Man 2 Suits at New York Comic Con\" class=\"read-more\" href=\"https://www.cryptopolitan.com/marvel-to-unveil-exclusive-spider-man-2/\" aria-label=\"More on Marvel to Unveil Exclusive Spider-Man 2 Suits at New York Comic Con\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-30T13:15:14.000Z",
    "title": "FedEx Unveils Innovative DexR Robot for Enhanced Cargo Truck Packing",
    "url": "https://www.cryptopolitan.com/fedex-unveils-innovative-dexr-robot-for-enhanced-cargo-truck-packing/",
    "description": "FedEx, a renowned player in the logistics sector, has introduced a groundbreaking solution to tackle one of the most intricate tasks in shipping and logistics—efficiently loading cargo trucks. Meet DexR, an advanced robot empowered by artificial intelligence (AI) that promises to revolutionize the art of cargo packing, optimizing how packages are loaded into delivery trucks. ... <a title=\"FedEx Unveils Innovative DexR Robot for Enhanced Cargo Truck Packing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fedex-unveils-innovative-dexr-robot-for-enhanced-cargo-truck-packing/\" aria-label=\"More on FedEx Unveils Innovative DexR Robot for Enhanced Cargo Truck Packing\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-30T13:14:22.000Z",
    "title": "Embracing the AI Revolution in Education by Preparing Teachers and Students for ChatGPT",
    "url": "https://www.cryptopolitan.com/teachers-and-students-for-chatgpt/",
    "description": "As the new school year dawns, educators worldwide are gearing up for a groundbreaking academic year – one where students will wield ChatGPT, a powerful AI tool capable of answering questions by tapping into vast datasets. This innovative technology allows students to pose both simple and complex queries, receiving answers without the need for internet ... <a title=\"Embracing the AI Revolution in Education by Preparing Teachers and Students for ChatGPT\" class=\"read-more\" href=\"https://www.cryptopolitan.com/teachers-and-students-for-chatgpt/\" aria-label=\"More on Embracing the AI Revolution in Education by Preparing Teachers and Students for ChatGPT\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-30T13:30:22.000Z",
    "title": "Ethereum ETF: Valkyrie Halts Purchase Of ETH Futures Contracts",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-etf-valkyrie-halts-purchase-of-eth-futures-contracts/",
    "description": "Asset management firm Valkyrie, one of the frontrunners for the first Ethereum ETF (exchange-traded fund) in the United States, has decided to pause its purchase of Ether futures contracts until the US Securities and Exchange Commission approves an Ether futures ETF. This comes barely a day after the asset manager reportedly secured approval to offer investors exposure to Ether futures under its existing strategy ETF (BTF). SEC Might Be Behind This Action, Bloomberg Expert Speculates On Friday, September 29, Valkyrie filed a 497 with the SEC, saying that it would halt the purchase of Ether futures contracts and unwind its existing positions.  A part of the filing read: Effectively immediately, The Fund will not purchase ether futures contracts until the effectiveness of an amendment to the Fund’s registration statement contemplating the addition of ether futures contracts to the principal investment strategy of the Fund. Until such time, the Fund will unwind any existing positions in ether futures contracts. As reported on Thursday, September 28, the SEC appears to be fast-tracking the approval of Ethereum futures ETF in anticipation of a potential US government shutdown next week.  Following this report, Valkyrie disclosed that it had begun purchasing Ether futures contracts for its combined strategy ETF ahead of a possible launch next week. However, this latest action poses questions about the odds of Valkyrie becoming one of the first firms to introduce an Ethereum ETF in the United States.  Related Reading: Ethereum Price Registers Breakout But Lacks Momentum, $1,620 Is The Key Bloomberg analyst Eric Balchunas has put forward a possible reason for Valkyrie’s decision to halt and unwind its Ether futures purchases. “SEC must have threatened them to cut it out,” Balchunas speculated via a post on X (formerly Twitter). Valkyrie filed its unique Ethereum ETF application with the SEC in August. The asset manager seeks to convert its existing Bitcoin Strategy ETF (BTF) to a combined Bitcoin and Ether futures ETF. Nine Ethereum ETFs To Launch Next Week? According to Eric Balchunas’ analysis, about nine Ethereum ETFs will potentially start trading on Monday, October 2. Notably, asset manager ProShares owns three of these funds, with two being combined Bitcoin and Ethereum ETFs. Related Reading: Is The Ethereum Winter Over? L2 Exploding, ETH Futures ETF Launches VanEck is another frontrunner for the first Ether futures ETFs in the US. The investment manager recently announced its intention to donate 10% of profits from its Ethereum ETF (EFUT) to The Protocol Guild, a compensation plan for Ethereum core contributors. VanEck wrote on X (formerly Twitter):  If TradFi stands to gain from the efforts of Ethereum&#8217;s core contributors, it makes sense that we also give back to their work. We urge other asset managers/ETF issuers to consider also giving back in the same way. It is worth mentioning that the ETH price has seen some reprieve since news of the potential Ethereum ETF launch started making rounds. As of this writing, Ether is valued at $1,676, reflecting a substantial 5% price jump in the past week. Ethereum price continues recovery on the daily timeframe &#124; Source: ETHUSDT chart on TradingView &#160; Featured image from Unsplash, chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-30T13:32:00.000Z",
    "title": "Huge XRP Transfer Worth $18+Million Hits Bithumb Exchange",
    "url": "https://coinedition.com/huge-xrp-transfer-worth-18million-hits-bithumb-exchange/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Huge XRP Transfer Worth $18+Million Hits Bithumb Exchange\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/09/Huge-XRP-Transfer-Worth-18Million-Hits-Bithumb-Exchange-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Whale Alerts shared that XRP worth more than $18 million was deposited onto the Bithumb exchange earlier today. At press time, XRP’s price was still in the green after it increased by 1.57% in the past 24 hours. XRP’s price was able to break above a symmetrical triangle pattern that had formed on its daily [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/huge-xrp-transfer-worth-18million-hits-bithumb-exchange/\">Huge XRP Transfer Worth $18+Million Hits Bithumb Exchange</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]