[
  {
    "source": "CryptoGlobe",
    "date": "2023-05-28T13:28:53.000Z",
    "title": "Cardano’s Evolution: IOG CEO Hoskinson Unveils Future Plans and Progress",
    "url": "https://www.cryptoglobe.com/latest/2023/05/cardanos-evolution-iog-ceo-hoskinson-unveils-future-plans-and-progress/",
    "description": "In a recent in-depth video update, Charles Hoskinson, the Co-Founder and CEO of IO Global (IOG), shared a comprehensive overview of Cardano’s ongoing development and future roadmap. Cardano, a leading blockchain platform for smart contracts, continues to make significant strides in its evolution, as outlined by Hoskinson. A key focus of Hoskinson’s update was the […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-28T13:11:52.000Z",
    "title": "Changpeng Zhao applauds Schiff’s unexpected crypto conversion",
    "url": "https://www.cryptopolitan.com/changpeng-zhao-applauds-schiffs-unexpected-crypto-conversion/",
    "description": "In a recent lighthearted tweet, CZ, the well-known figure in the cryptocurrency industry, expressed his delight at Peter Schiff&#8217;s unexpected conversion. Schiff, who has long been a vocal critic of Bitcoin and cryptocurrencies, surprised many by announcing his involvement in a new project centered around NFT art on the Bitcoin blockchain. The project involves collaborating ... <a title=\"Changpeng Zhao applauds Schiff&#8217;s unexpected crypto conversion\" class=\"read-more\" href=\"https://www.cryptopolitan.com/changpeng-zhao-applauds-schiffs-unexpected-crypto-conversion/\" aria-label=\"More on Changpeng Zhao applauds Schiff&#8217;s unexpected crypto conversion\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-28T13:17:34.000Z",
    "title": "Binance launches compliant platform for users in Japan",
    "url": "https://crypto.news/binance-launches-compliant-platform-for-users-in-japan/",
    "description": "Binance has announced switching to a new platform explicitly tailored for customers in Japan in a quest to adhere to local regulations"
  }
]