[
  {
    "source": "Cryptopolitan",
    "date": "2023-11-19T12:06:03.000Z",
    "title": "Sonic Superstars (PC) Review: A Disappointing Entry in the Sonic Franchise",
    "url": "https://www.cryptopolitan.com/sonic-superstars-pc-review/",
    "description": "Explore the review of Sonic Superstars (PC), highlighting its strengths and weaknesses, from solid physics and music to lackluster level design and a disappointing overall experience."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-19T11:59:43.000Z",
    "title": "League of Legends World Championship 2024 to Take Place at The O2 in London",
    "url": "https://www.cryptopolitan.com/league-of-legends-world-championship-2024-to-take-place-at-the-o2-in-london/",
    "description": "League of Legends fans worldwide have reason to celebrate as Riot Games officially announced that the 2024 World Championship, the biggest event of the League of Legends esports calendar, will be hosted in London, United Kingdom. The prestigious event will culminate with the grand finals held at The O2, one of the world&#8217;s most renowned ... <a title=\"League of Legends World Championship 2024 to Take Place at The O2 in London\" class=\"read-more\" href=\"https://www.cryptopolitan.com/league-of-legends-world-championship-2024-to-take-place-at-the-o2-in-london/\" aria-label=\"More on League of Legends World Championship 2024 to Take Place at The O2 in London\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-19T11:50:06.000Z",
    "title": "Debating Bitcoin’s Role: A Potential Slowdown for AI Advancements?",
    "url": "https://www.cryptopolitan.com/debating-bitcoins-role-in-slowdown-for-ai/",
    "description": "In a recent series of thought-provoking posts on a prominent social media platform, cryptocurrency analyst Tuur Demeester ignited a debate over the possible impact of Bitcoin mining on the progression of artificial intelligence (AI). Demeester, an advocate of the leading cryptocurrency, posited that Bitcoin&#8217;s intensive demand for computational resources could potentially hinder the rapid development ... <a title=\"Debating Bitcoin&#8217;s Role: A Potential Slowdown for AI Advancements?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/debating-bitcoins-role-in-slowdown-for-ai/\" aria-label=\"More on Debating Bitcoin&#8217;s Role: A Potential Slowdown for AI Advancements?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-19T11:42:16.000Z",
    "title": "Weekly Crypto Price Analysis: BTC, ETH, BNB, XRP, SOL, ADA, And DOGE",
    "url": "https://www.cryptopolitan.com/weekly-crypto-price-analysis-19-11-2023/",
    "description": "Weekly crypto price analysis reveals that most of cryptocurrencies are experiencing a mixed reaction in the market.  The bearish and bullish sentiments clash, making it difficult to predict the market direction. Bitcoin (BTC) is one of the major coins that has been trading below $37,000 for most of the days in the last seven days. ... <a title=\"Weekly Crypto Price Analysis: BTC, ETH, BNB, XRP, SOL, ADA, And DOGE\" class=\"read-more\" href=\"https://www.cryptopolitan.com/weekly-crypto-price-analysis-19-11-2023/\" aria-label=\"More on Weekly Crypto Price Analysis: BTC, ETH, BNB, XRP, SOL, ADA, And DOGE\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-19T12:00:46.000Z",
    "title": "Cardano Founder Courts OpenAI’s Sam Altman – What Does He Want To Build?",
    "url": "https://www.newsbtc.com/news/cardano/cardano-founder-courts-openais-sam-altman-what-does-he-want-to-build/",
    "description": "OpenAI recently announced a shocking leadership change with Sam Altman being ousted as CEO. After five years of being at the helm of taking OpenAI from a $0 to $80 billion valuation, the AI company is now at a crossroads with Altman departing and former Chief Technology Officer (CTO), Mira Murati taking over as interim CEO.  Altman hasn&#8217;t provided specifics of his next actions; however, he has posted on social media that he &#8220;will have more to say about what&#8217;s next later.&#8221; In light of this, Charles Hoskinson, the creator of Cardano, sees a window of opportunity. Hoskinson gave the former CEO a bold proposal on social media platform X to join hands in establishing a decentralized language learning model in partnership with the Cardano blockchain.  Sam @sama since you have some free time now. If you are interested in doing a decentralized LLM, then hit me up. Would be a fun Cardano Partnerchain — Charles Hoskinson (@IOHK_Charles) November 18, 2023 Hoskinson Wants To Build A Decentralized Language Learning Model Charles Hoskinson has a vision for AI that embraces decentralization and openness. As the founder of Cardano and a former co-founder of Ethereum, Hoskinson knows a thing or two about building decentralized networks. Hoskinson’s vision of a decentralized language learning model is ambitious, but promising.  Related Reading: Crypto Acceptance Grows As Fidelity Joins Race For A Spot Ethereum ETF On the other end, if there&#8217;s anyone who knows anything about language learning models, it is definitely Sam Altman. The former CEO is known for being one of the architects of the language models that power ChatGPT, which has gained widespread adoption since its launch in November 2022. Bitcoin (BTC) is currently trading at $36.680. Chart: TradingView.com If Altman takes Hoskinson up on his offer, it could mark a turning point in how AI models like ChatGPT are built and how they serve users. A decentralized LLM would essentially be available to everyone and resistant to censorship, tampering, and monopolization by governments and large corporations, which is one of the concerns being raised regarding existing LLMs.  Aftermath Of Sam Altman&#8217;s Removal As CEO Altmann&#8217;s removal as CEO sent ripples around the AI and crypto industries. Greg Brockman, president and one of the co-founders of OpenAI, also announced his departure from the company.  As one would expect, WorldCoin reacted negatively to the news. According to data from Coinmarketcap, Worldcoin (WLD) dropped by 12.75% in the hours following the news of the CEO&#8217;s removal. However, the crypto has since recovered and is now trading at $2.38.  Related Reading: Kaspa Binance Listing Sparks Frenzy: 50% Price Surge Captures Investors’ Interest According to OpenAI’s announcement, the decision to fire Altman was made by the board of directors, as they&#8217;ve lost confidence in his ability to continue his duties as CEO due to his lack of transparency in his communications. However, rumors are that OpenAI investors are looking to reinstate Altmann into his job as CEO. Cardano ADA is trading at $0.375 at the time of writing. According to a crypto analyst, ADA could spike to the $0.78 mark if it is able to break out of the current falling wedge pattern. Featured image from Pexels"
  }
]