[
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T06:34:00.000Z",
    "title": "Bad news for Ripple? LBRY judge passes ruling on if secondary crypto sales are securities",
    "url": "https://cointelegraph.com/news/lbry-judge-declines-ruling-on-secondary-sales-being-securities",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/691e227a-8196-4e10-93fc-08dfd4c18d22.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In January, lawyer John Deaton persuaded the Judge in the SEC vs LBRY case that secondary LBC token sales don’t constitute a securities offering.</p>\n                    <p><p>Ripple may be holding its breath a bit longer after a United States District Judge refused to rule on if the secondary sale of LBRY Credits (LBC) constitutes a security.</p><p>On July 11, New Hampshire District Court Judge Paul Barbadoro made the <a href=\"https://www.dropbox.com/scl/fi/9opwley51peioqzwgvlm8/US_DIS_NHD_1_21cv260_d19671166e199_MEMORANDUM_AND_ORDER_RE_89_Motion_to_Limit_the_Com.pdf?rlkey=8ju1p2o7r3tb1dundhvclwv8x&amp;dl=0\" target=\"_blank\" rel=\"noopener nofollow\">ruling</a> in the case the United States Securities and Exchange Commission (SEC) brought against the decentralized content platform LBRY.</p><p>The ruling may have <a href=\"https://www.dropbox.com/s/qf0nq2hva7h6yi3/SEC%20v.%20LBRY%20Discovery%20Conference%202.6.2023.pdf?dl=0\" target=\"_blank\" rel=\"noopener nofollow\">offered</a> legal precedent to fellow District Court Judge Analisa Torres, who is set to make a decision on the SEC’s case against Ripple in the coming months.</p><p>In his ruling, Judge Barbadoro said:</p><blockquote>“Accordingly, I take no position on whether the registration requirement applies to secondary market offerings of LBC.”</blockquote><p>A secondary market is where traders buy and sell securities, while a primary market involves trading from the company issuing the security directly.</p><p>John Deaton, a U.S. lawyer representing thousands of XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) token holders, <a href=\"https://twitter.com/JohnEDeaton1/status/1678867465642573827\" target=\"_blank\" rel=\"noopener nofollow\">tweeted</a> on July 11 that he contacted Judge Barbadoro to seek clarity on if LBC constituted a security.</p><p>Judge Barabadoro ultimately decided to uphold his “judicial restraint,” Deaton said.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I asked the Judge to clarify that the token itself is not the security just as Judge Castel did in Telegram. He declined to do so because he said that specific issue wasn’t litigated and he believes in exercising judicial restraint. He wrote: “it suffices to say that merely… <a href=\"https://t.co/xR9AemS5Hq\">https://t.co/xR9AemS5Hq</a></p>&mdash; John E Deaton (@JohnEDeaton1) <a href=\"https://twitter.com/JohnEDeaton1/status/1678867465642573827?ref_src=twsrc%5Etfw\">July 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Judge Barbadoro’s latest opinion is an about-turn from what he concluded in a January appeal hearing where Deaton persuaded him that the secondary sale of LBC <a href=\"https://cointelegraph.com/news/sec-settles-on-security-claim-in-lbry-case-community-calls-it-a-big-win-for-crypto\">doesn’t constitute a securities offering</a>.</p><p>The New Hampshire Judge clarified in the appeal hearing that LBC is only considered a security when the sale is made directly.</p><p>The SEC also admitted that secondary market LBC sales don’t constitute a security. </p><p>While the SEC won a summary judgment in November 2022, it elected <a href=\"https://cointelegraph.com/news/sec-settles-on-security-claim-in-lbry-case-community-calls-it-a-big-win-for-crypto\">to settle for $22 million</a> at an appeal hearing on Jan. 30.</p><p>In May, the SEC revised the figure and instead asked the court to <a href=\"https://cointelegraph.com/news/sec-revises-lbry-fine-to-111k\">impose a fine of $111,000</a> citing LBRY’s “lack of funds and near-defunct status.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/the-aftermath-of-lbry-consequences-of-crypto-s-ongoing-regulatory-process\"><strong><em>The aftermath of LBRY: Consequences of crypto’s ongoing regulatory process </em></strong></a></p><p>Meanwhile, Jeremy Hogan, a U.S.-based Attorney and Ripple advocate, told Cointelegraph that District Court Judge Analisa Torres will likely lay out her ruling within the next couple of months.</p><blockquote>“We'll have the big picture sometime in the next two months and, unless Ripple completely wins, we'll know the details before the end of the year. If the details are bad then we will see appeals that will drag on for a long time.”</blockquote><p>“But [that] won't really matter for a typical XRP holder,” he added.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The final ruling is out in the SEC v. LBRY case.<br><br>The Judge did not rule on secondary sales (or, not surprisingly, the Major Questions Doctrine). He enjoined further violations and issued a penalty.<br><br>Is a similar result possible in the Ripple case? <a href=\"https://t.co/6bOl34UKpo\">https://t.co/6bOl34UKpo</a></p>&mdash; Jeremy Hogan (@attorneyjeremy1) <a href=\"https://twitter.com/attorneyjeremy1/status/1678879298134876160?ref_src=twsrc%5Etfw\">July 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/pro-xrp-lawyer-john-deaton-10x-more-into-btc-4x-more-into-eth-hall-of-flame/\"><strong><em>Crypto Twitter Hall of Flame: Pro-XRP lawyer John Deaton ‘10x more into BTC, 4x more into ETH</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T06:18:00.000Z",
    "title": "Grayscale CEO: BlackRock ETF filing a ‘moment of validation’ for Bitcoin",
    "url": "https://cointelegraph.com/news/blackrock-etf-validates-bitcoin-grayscale-ceo-sonnenshein",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/625f1b15-a131-40a3-9930-ddfb15d7b44d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BlackRock’s commitment to advancing its crypto efforts only lends to the validity of Bitcoin as an asset class, said Michael Sonnenshein.</p>\n                    <p><p>The recent tsunami of spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) filings should be seen as a “moment of validation” for Bitcoin, says Grayscale Investments CEO Michael Sonnenshein.</p><p>During a July 12 <a href=\"https://www.cnbc.com/video/2023/07/11/traditional-finance-companies-creating-bitcoin-etfs-is-a-moment-of-validation-says-grayscale-ceo.html\" target=\"_blank\" rel=\"noopener nofollow\">interview</a> on CNBC’s <em>Last Call, </em>Sonnenshein rejected the notion that BlackRock’s entrance to the Bitcoin ETF race made it “uncool.” </p><blockquote>“To see, literally, the largest asset manager in the world publicly commit to advancing their crypto efforts only lends to the validity of the asset class and the staying power it has.” </blockquote><p>In just the last four weeks, at least seven major institutional firms including BlackRock have applied for a spot Bitcoin ETF in the United States. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">&quot;It&#39;s a moment of validation,&quot; says <a href=\"https://twitter.com/Grayscale?ref_src=twsrc%5Etfw\">@Grayscale</a> CEO <a href=\"https://twitter.com/Sonnenshein?ref_src=twsrc%5Etfw\">@Sonnenshein</a> on <a href=\"https://twitter.com/search?q=%24BLK&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BLK</a> aiming to launch a <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> spot ETF. &quot;To see the largest asset manager in the world publicly commit to advancing their crypto efforts only lends validity to the asset class and the staying power that it has.&quot; <a href=\"https://t.co/agt7emHWt0\">pic.twitter.com/agt7emHWt0</a></p>&mdash; Last Call (@LastCallCNBC) <a href=\"https://twitter.com/LastCallCNBC/status/1678916217833246722?ref_src=twsrc%5Etfw\">July 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>If approved, both institutional and retail investors in the U.S. would have a simple, legally compliant way of getting exposure to the price of Bitcoin without actually owning any. </p><p>“The ETF wrapper is tried and true and it has become the access point for so many different assets, whether they’re commodities or stocks,” said Sonnenshein.</p><blockquote>“Bitcoin is an asset that’s not going away. Investors want and deserve access to it.”</blockquote><p>Up until this point, Sonnenshein’s Grayscale has been offering U.S. investors a roundabout way of gaining exposure to Bitcoin — by enabling investors to trade shares in trusts holding large pools of Bitcoin via its Grayscale Bitcoin Trust (GBTC). </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, our attorneys filed a letter with the DC Circuit highlighting the disparity between the SEC’s approval of a leveraged <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a> futures ETF while continuing to deny approval of spot bitcoin ETFs like <a href=\"https://twitter.com/search?q=%24GBTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$GBTC</a>. Let’s dive deeper. /6 <a href=\"https://t.co/z7WyGBthhT\">pic.twitter.com/z7WyGBthhT</a></p>&mdash; Grayscale (@Grayscale) <a href=\"https://twitter.com/Grayscale/status/1678431528156794880?ref_src=twsrc%5Etfw\">July 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, the firm wants to convert it to a spot Bitcoin ETF too, which would allow inventors a far simpler method to trade the price of Bitcoin without GBTC’s pesky discount to net asset value. </p><blockquote>“To be able to give investors Bitcoin exposure through GBTC, like we do today has been an unbelievable milestone [...] But moving to an ETF structure will give investors the additional protection that they want.”</blockquote><p>In June 2022, Grayscale filed a lawsuit against the United States Securities and Exchange Commission over the <a href=\"https://cointelegraph.com/news/grayscale-lawyers-sec-approval-volatility-shares-etf-lawsuit\">rejection of its 2021 application</a> to convert its GBTC.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/grayscale-resolves-lawsuit-fir-tree-bitcoin-trust\"><strong><em>Grayscale resolves lawsuit with Fir Tree over proposed changes to Bitcoin Trust</em></strong></a></p><p>“If we’re successful in that challenge, there’s actually billions of dollars of investor capital that would be unlocked through that,” said Sonnenshein.</p><p>The price of Bitcoin shot upwards of 20% in the days after BlackRock’s filing for a spot Bitcoin ETF on June 15, reaching a year-high of $31,460 on July 6. It is currently trading at $30,633. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\"><strong><em>Should you ‘orange pill’ children? The case for Bitcoin kids books</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T06:20:33.000Z",
    "title": "Labor Criticizes UK Government’s AI Approach, Stating Workers Are Disadvantaged",
    "url": "https://www.cryptopolitan.com/labour-criticizes-uk-governments-ai-approach/",
    "description": "Labor&#8217;s shadow digital minister, Lucy Powell, has criticized the UK government&#8217;s AI approach, stating that it fails to keep pace with technological advancements. Powell warns that AI technologies disrupt society and the economy, leading to potential job cuts as companies turn to automation. She describes the government&#8217;s approach as confused, chaotic, and slow, leaving workers ... <a title=\"Labor Criticizes UK Government&#8217;s AI Approach, Stating Workers Are Disadvantaged\" class=\"read-more\" href=\"https://www.cryptopolitan.com/labour-criticizes-uk-governments-ai-approach/\" aria-label=\"More on Labor Criticizes UK Government&#8217;s AI Approach, Stating Workers Are Disadvantaged\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-12T06:30:40.000Z",
    "title": "Better Logical Approach To Robert Kiyosaki’s Bitcoin Prediction",
    "url": "https://nulltx.com/better-logical-approach-to-robert-kiyosakis-bitcoin-prediction/",
    "description": "Robert Kiyosaki&#8216;s warning about the demise of the U.S. dollar and his endorsement of Bitcoin can have significant implications for the cryptocurrency. Firstly, his statements could bring increased attention and credibility to Bitcoin among his followers and the wider audience, potentially driving up demand. This heightened demand, coupled with the belief that Bitcoin can act [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-12T06:38:53.000Z",
    "title": "Solana (SOL) Price Climbs 15% – A Positive Outlook For Investors?",
    "url": "https://www.newsbtc.com/news/solana-sol-price-climbs-15-a-positive-outlook-for-investors/",
    "description": "Solana (SOL) has recently made a significant breakthrough, successfully shattering both long-term and short-term resistance lines and marking a pivotal moment for the cryptocurrency&#8217;s future. Resistance lines are an essential concept in technical analysis that represent price levels where selling pressure historically outweighed buying pressure, resulting in a temporary halt or reversal in an asset&#8217;s price movement. In the case of SOL, the breakthrough of both long-term and short-term resistance lines signifies a significant shift in the market dynamics. Breakout Signals A Shift In SOL Price Movement Analyzing the weekly time frame reveals an important development for Solana. Last week, SOL managed to break out from a long-term descending resistance line. Remarkably, this resistance line had been in place for a staggering 600 days, originating from the all-time high reached back in November 2021.  Related Reading: Dogecoin (DOGE) Price Downtrend Set To Persist – What To Expect Breakouts from such extended structures often serve as a significant indication that the preceding trend has concluded and a new one has commenced, but in the opposite direction. SOL market cap nearing the $9 billion mark. Chart: TradingView.com Considering SOL&#8217;s recent breakout from the long-term descending resistance line, it is highly likely that the cryptocurrency has initiated a new bullish trend reversal. Related Reading: Cardano Price Momentum Bid Fizzles Out Despite New Payment Feature This breakthrough represents a major shift in the market dynamics for SOL, suggesting that the selling pressure that previously impeded its progress has weakened or been overcome by increasing buying pressure.  As a result, the stage is set for SOL to potentially experience an upward surge in value and embark on a new bullish trajectory. Source: Benzinga Meanwhile, over the previous week, Solana has experienced a notable 98.0% surge in trading volume, accompanied by a 0.91% rise in the coin&#8217;s circulating supply. Current SOL Price And Recent Performance At present, the SOL price listed on CoinGecko stands at $22.07, highlighting a notable 1.7% rally within the past 24 hours. Over the course of the last seven days, SOL has exhibited an impressive climb of 14.7%. These recent price movements further support the notion of a potential bullish trend reversal, as SOL continues to gather positive momentum. Source: Coingecko While the current analysis suggests a bullish outlook for Solana, it is essential to acknowledge the possibility of a price correction. If SOL loses its current momentum, there is a chance that it could retrace to the descending resistance line. However, it is worth noting that there are no immediate indications or signals in the short term to suggest such a decline is likely to occur. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from POSITRAN"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T06:21:52.000Z",
    "title": "Aave Working In Launching GHO Stablecoin On Ethereum To Conquer DeFi Spaces",
    "url": "https://www.crypto-news-flash.com/aave-working-in-launching-gho-stablecoin-on-ethereum-to-conquer-defi-spaces/?utm_source=rss&utm_medium=rss&utm_campaign=aave-working-in-launching-gho-stablecoin-on-ethereum-to-conquer-defi-spaces",
    "description": "<img width=\"599\" height=\"443\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins.png 599w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-300x222.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-24x18.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-36x27.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-48x35.png 48w\" sizes=\"(max-width: 599px) 100vw, 599px\" />Aave has been pursuing its vision for the GHO stablecoin Aave awaits approval from Aave DAO for its revolutionary GHO stablecoin proposal on Ethereum, enabling users to mint tokens with collateral while enhancing efficiency. Aave has unveiled a groundbreaking proposal to introduce its native stablecoin, GHO, on the Ethereum mainnet. However, the proposal&#8217;s implementation hinges [...]"
  }
]