[
  {
    "source": "CoinDesk",
    "date": "2023-07-13T13:24:18.000Z",
    "title": "Zero-Knowledge Rollup ZKM Sets Out to Make Ethereum 'Universal Settlement Layer'",
    "url": "https://www.coindesk.com/tech/2023/07/13/zero-knowledge-rollup-zkm-sets-out-to-make-ethereum-universal-settlement-layer/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "With funding from the foundation that oversees development of the Metis layer-2 Ethereum protocol, ZKM is developing a hybrid approach that combines Optmistic and Zero-Knowledge rollups into one."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-13T13:24:23.000Z",
    "title": "SEC Sues Bankrupt Crypto Lender Celsius Network and CEO Alex Mashinsky",
    "url": "https://decrypt.co/148431/sec-sues-bankrupt-crypto-lender-celsius-network-and-ceo-alex-mashinsky",
    "description": "The SEC has charged Mashinsky and Celsius with four counts of fraud and one count of offering unregistered securities."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-13T13:25:29.000Z",
    "title": "Celsius’s Mashinsky arrested, SEC files securities fraud charges – reports",
    "url": "https://cryptoslate.com/celsiuss-mashinsky-arrested-sec-files-securities-fraud-charges/",
    "description": "<p>Alex Mashinksy, the co-founder and former CEO of bankrupt crypto lender Celsius, was arrested during the early hours of today, according to a July 13 Bloomberg report, citing people familiar with the matter. The U.S. Securities and Exchange Commission (SEC) has also filed securities fraud charges against Mashinsky and Celsius, according to July 13 court [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/celsiuss-mashinsky-arrested-sec-files-securities-fraud-charges/\">Celsius&#8217;s Mashinsky arrested, SEC files securities fraud charges &#8211; reports</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-13T13:10:00.000Z",
    "title": "Uniswap Launches On Avalanche",
    "url": "https://cryptodaily.co.uk/2023/07/uniswap-launches-on-avalanche",
    "description": "<p>Uniswap users can now start swapping their Avalanche tokens on the Uniswap website, as the decentralized exchange has now launched on the Avalanche network.&nbsp;</p>\nUniswap&rsquo;s C-Chain Debut&nbsp;\n<p>Leading decentralized exchange (DEX) and automated market maker (AMM), Uniswap, has made its debut on Avalanche C-Chain, marking another significant expansion of the decentralized finance (DeFi) sector on the Avalanche blockchain. Uniswap's move follows in the footsteps of other prominent DeFi platforms like Curve and Aave, who have already established a presence on Avalanche.</p>\n<p>This expansion was made possible through a governance proposal initiated by the University of Michigan's blockchain club, Michigan Blockchain. The proposal, aiming to promote a diverse and robust multi-chain future, received overwhelming support during the on-chain vote, with an impressive 95% majority in favor of the deployment.</p>\nAva Labs Head Welcomes Uniswap\n<p>The integration of LayerZero, an interoperability protocol facilitating Avalanche's BTC.b, played a crucial role in enabling the deployment. LayerZero acts as a communication bridge between Ethereum and Avalanche, allowing for seamless cross-chain asset transfers and governance proposals.</p>\n<p>Expressing excitement about the integration, Luigi D'Onorio DeMeo, the Head of DeFi and Developer Relations at Ava Labs, said,&nbsp;</p>\n\n<p>&ldquo;We&rsquo;re thrilled to welcome battle-tested DeFi mainstay Uniswap to C-Chain, strengthening the competition between DEXes on Avalanche. The opportunity set for DEXes on Avalanche is huge. As new Subnets launch, more liquidity for DEXes like Uniswap will likely come to C-Chain. Furthermore, Avalanche Warp Messaging creates other unique opportunities for DEXes that aren&rsquo;t possible on other EVM chains.&rdquo;</p>\n\nLeading DEX For Traders And Liquidity Providers\n<p>Uniswap, originally launched on Ethereum in 2018, revolutionized the market with its innovative AMM model. By facilitating trades through liquidity pools, the platform offered traders and liquidity providers an efficient and indirect trading method. With over 139 million trades conducted and a trading volume exceeding $1.5 trillion, Uniswap remains a dominant force in the AMM space.</p>\n<p>The current iteration, known as V3, introduces concentrated liquidity, allowing liquidity providers to allocate their assets within specific price ranges. This feature empowers liquidity providers to customize their strategies for each pool, potentially generating higher fees.</p>\n<p>Uniswap's integration into Avalanche's ecosystem, alongside other pioneering Avalanche-native exchanges like Trader Joe, Dexalot, and DeltaPrime, further enriches the DEX options available to users.</p>\nUniswap V4\n<p>Uniswap's recent expansion onto the Avalanche blockchain aligns with its upcoming upgrade to version 4 (V4), a highly anticipated development that hinges on the Ethereum Cancun upgrade, which is expected to be deployed in September.&nbsp;</p>\n<p>According to a developer from Uniswap Labs, the V4 upgrade will grant users the ability to construct their own features, paving the way for endless possibilities. Among the notable advancements in V4 is the introduction of a novel smart contract variant known as \"hooks.\" This feature empowers developers to create innovative solutions on top of Uniswap's liquidity pools, further expanding the platform's capabilities.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-13T13:34:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-13T13:32:13.000Z",
    "title": "Coinbase could be the weapon formed against BTC ETFs approval",
    "url": "https://www.cryptopolitan.com/coinbase-could-hinder-btc-etfs-approval/",
    "description": "Here&#8217;s a long story short &#8211; the SEC went after Coinbase and Binance.US in June, and all hell broke loose in the crypto ecosystem. Soon after that, market behemoth BlackRock filed for Bitcoin ETF and named Coinbase as their security service provider. And for a while, all seemed to work out best for the American ... <a title=\"Coinbase could be the weapon formed against BTC ETFs approval\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-could-hinder-btc-etfs-approval/\" aria-label=\"More on Coinbase could be the weapon formed against BTC ETFs approval\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-13T13:21:25.000Z",
    "title": "World Mobile obtains licensed spectrum in California and 3 Other US States",
    "url": "https://crypto.news/world-mobile-obtains-licensed-spectrum-in-california-and-3-other-us-states/",
    "description": "World Mobile, a decentralized wireless network operator, has obtained up to 20MHz spectrum in California, New Mexico, Nevada, and Utah"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-13T13:27:14.000Z",
    "title": "3 Unstoppable Memecoins: Shiba Inu, Anarchy (ANA), and Floki Inu. Why Anarchy is Investors’ Top Choice",
    "url": "https://www.crypto-news-flash.com/3-unstoppable-memecoins-shiba-inu-anarchy-ana-and-floki-inu-why-anarchy-is-investors-top-choice/?utm_source=rss&utm_medium=rss&utm_campaign=3-unstoppable-memecoins-shiba-inu-anarchy-ana-and-floki-inu-why-anarchy-is-investors-top-choice",
    "description": "<img width=\"512\" height=\"364\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T123841.493.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T123841.493.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T123841.493-300x213.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T123841.493-269x192.png 269w\" sizes=\"(max-width: 512px) 100vw, 512px\" />If the crypto-verse were a college classroom, meme coins would be the life of the party. Billy Markus and Jackson Palmer definitely had the lightbulb moment when he brought jokes and memes into crypto trading. The trading scene now has a better outlook, thanks to the many meme coin projects: first, Dogecoin, then its brood.  [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-13T13:20:21.000Z",
    "title": "Rich Dad’ R. Kiyosaki Claims This Epic Meeting of Nations Will Cement Bitcoin’s Dominance and Doom Fiat Money",
    "url": "https://www.crypto-news-flash.com/rich-dad-r-kiyosaki-claims-this-epic-meeting-of-nations-will-cement-bitcoins-dominance-and-doom-fiat-money/?utm_source=rss&utm_medium=rss&utm_campaign=rich-dad-r-kiyosaki-claims-this-epic-meeting-of-nations-will-cement-bitcoins-dominance-and-doom-fiat-money",
    "description": "<img width=\"2560\" height=\"1706\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/network-3524352-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Brics Bitcoin adoption\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/network-3524352-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/network-3524352-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/network-3524352-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/network-3524352-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/network-3524352-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/network-3524352-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/network-3524352-104x69.jpg 104w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Kiyosaki has advocated for investment in gold, silver, and the flagship cryptocurrency, Bitcoin (BTC). He also predicts that Bitcoin&#8217;s price could soar to an impressive $120,000 within the next year. Against the backdrop of mounting warnings regarding a potential recession in the United States, a prominent investor and author Robert Kiyosaki, known for his best-selling [...]"
  }
]