[
  {
    "source": "CoinDesk",
    "date": "2023-11-02T14:00:00.000Z",
    "title": "Privacy Technology Firm Nym Plans Early 2024 Rollout of 'Decentralized VPN'",
    "url": "https://www.coindesk.com/tech/2023/11/02/nym-plans-early-2024-rollout-of-decentralized-vpn/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The privacy-focused infrastructure project says that the new NymVPN will disperse traffic across a network of nodes rather than running data through single servers as centralized VPNs do."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-02T14:01:45.000Z",
    "title": "Protocol Village: Huma, On-Chain Credit Platform, Deploys on Celo",
    "url": "https://www.coindesk.com/tech/2023/11/01/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Nov. 2-8, with live updates throughout."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-02T14:03:40.000Z",
    "title": "SHIB Devs Launch Name Service in Decentralized Identity Push",
    "url": "https://decrypt.co/204090/shib-devs-launch-name-service-decentralized-identity-push",
    "description": "The SHIB devs are still hard at work spinning up a hyped up decentralized identity platform, rolling out a new name service for users."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-02T13:47:09.000Z",
    "title": "Over half of musicians concerned over audience perception of AI use: Survey ",
    "url": "http://cointelegraph.com/news/over-half-of-musicians-concerned-over-audience-perception-ai-use-survey",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/e570acab-116e-4c6d-8f64-b43068f030f9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Over half of musicians surveyed said they’re concerned with how their audience might perceive music created using AI, yet many artists have found it useful in their creative process.</p>\n                    <p><p>As artificial intelligence (AI) continues to be pervasive in global industries, the music industry has been <a href=\"https://cointelegraph.com/news/justin-bieber-hit-track-becomes-nft\">receptive to its transformative capabilities</a> while remaining cautious about the <a href=\"https://cointelegraph.com/news/universal-music-group-partnership-artists-rights-ai-violations\">risks to artists</a>. </p><p>In a recent <a href=\"https://pirate.com/en/blog/over-half-of-musicians-will-conceal-ai-use/\" target=\"_blank\" rel=\"noopener nofollow\">survey</a> released by the private music studio house Pirate, 53% of respondents said they had “concerns about how their audience might perceive music created with the assistance of AI.”</p><p>The survey reached 1,141 of its artists across the United Kingdom, United States and Germany - including band members, singer-songwriters, producers, instrumentalists, and rappers. </p><p>It also revealed artists’ hesitancy to employ AI in the studio with only 25% saying they have experience with AI. Nonetheless, 46% said they are willing to consider using such tools in the future. </p><p>One of the artists surveyed, Cristoph Krey of the Brooklyn-based band MYAI, said they use AI for 30% of all their activities and call the other 70% “art intelligence\". Krey said it could be a difficult learning curve for artists to get involved with.  </p><blockquote>“It’s one more thing that artists now have to do on top of everything else they have to do to create value.\" </blockquote><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/ai-music-sending-traditional-industry-into-panic-ai-music-platform-ceo\"><strong><em>AI music sending traditional industry into ‘panic,’ says new AI music platform CEO</em></strong></a></p><p>The co-founder and CEO of Pirate, David Borrie, said it’s understandable for artists to be hesitant about using AI and broadcasting the use of AI. However, he likened the emerging technology to auto-tune, another groundbreaking technology to permeate the music industry and become a mainstay in contemporary production </p><blockquote>“It’s useful to look back at the introduction of tools like Auto-Tune which faced criticism in their early days but eventually found their place in the music industry. AI’s journey toward becoming a standard tool in music creation may follow a similar path, as artists and audiences alike adapt to this innovation.\"</blockquote><p>Regarding artists in the music industry who already use AI in their creative process, the answer to where it was the most useful was in “songwriting and composition.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/ff94ef5d-b004-4285-b03a-f49b52405f4d.png\"  /><figcaption style=\"text-align: center;\"><em>Source: Pirate Studios</em></figcaption></figure><p>Cointelegraph reached out to Pirate for more information on the survey. </p><p>In an interview with Cointelegraph earlier this year the CEO of the Recording Academy, the legacy institution in charge of the yearly Grammy Awards, said that he sees <a href=\"https://cointelegraph.com/news/ai-grammys-recording-academy-ceo-harvey-mason-jr\">AI as a “creative amplifier”</a> for artists who employ it in their work. </p><p>There has already been controversy with those wishing to get their music recognized. An artist who used an AI-generated vocal track of the rapper Drake<a href=\"https://cointelegraph.com/news/ai-generated-drake-song-grammy-nomination\"> in a track that went viral</a> tried to submit his piece for nomination. </p><p>However, the track was <a href=\"https://cointelegraph.com/news/grammy-ceo-ai-drake-song-ineligible-for-award\">denied by the Academy</a> over copyright infringement issues. The Academy commented on the issue saying that the topic of AI is both “complicated” and “moving really quickly.”</p><p>Official rules for AI-generated music instated by the Academy say that a human must create the primary components of tracks up for official nomination. For example, for a track to win an award for vocal performance, it must have been performed by a human.</p><p>Major labels in the music industry are also trying to stay on top of AI usage, including Universal Music, which has partnered with Google to <a href=\"https://cointelegraph.com/news/universal-music-google-negotiate-ai-deep-fakes\">combat AI deep fakes of its artists</a> and petitioned streaming services like Spotify to<a href=\"https://cointelegraph.com/news/universal-music-group-tells-streaming-services-to-block-ai-generated-music\"> remove AI-generated tracks</a> from its platform. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/biticulture-fine-art-on-solana-ai-music-podcast-book-reviews/\"><strong><em>BitCulture: Fine art on Solana, AI music, podcast + book reviews</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-02T14:00:54.000Z",
    "title": "Record-high inflows and outflows noticed on Kraken, large investors in play",
    "url": "https://cryptoslate.com/insights/record-high-inflows-and-outflows-noticed-on-kraken-large-investors-in-play/",
    "description": "<p>Quick Take Recent data analysis by CryptoSlate brought to light an unusual pattern of massive inflows and outflows on cryptocurrency exchanges. Notably, Kraken, one of the prominent crypto exchanges, has been at the heart of this trend with significant movements of digital assets in recent weeks. On Nov. 1, Kraken experienced the third largest outflow [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/record-high-inflows-and-outflows-noticed-on-kraken-large-investors-in-play/\">Record-high inflows and outflows noticed on Kraken, large investors in play</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-02T13:45:02.000Z",
    "title": "UK National Crime Agency forms specialized cryptocurrency team with new hires",
    "url": "https://cryptoslate.com/uk-national-crime-agency-forms-specialized-cryptocurrency-team-with-new-hires/",
    "description": "<p>The United Kingdom&#8217;s National Crime Agency seeks to employ six crypto investigators as part of a new project that will form a specialized digital assets team. &#8220;The role will be dedicated to a proactive cryptocurrency remit with the right tools and capabilities to target UK-based subjects along with supporting colleagues with specialist advice and guidance.&#8221; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/uk-national-crime-agency-forms-specialized-cryptocurrency-team-with-new-hires/\">UK National Crime Agency forms specialized cryptocurrency team with new hires</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-02T14:00:46.000Z",
    "title": "Paypal Faces SEC Scrutiny Over New Stablecoin PYUSD, Cooperates With Document Production Request",
    "url": "https://news.bitcoin.com/paypal-faces-sec-scrutiny-over-new-stablecoin-pyusd-cooperates-with-document-production-request/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/secpaypal-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Paypal Faces SEC Scrutiny Over New Stablecoin PYUSD, Cooperates With Document Production Request\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/secpaypal-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/secpaypal-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/secpaypal-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/secpaypal-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/secpaypal-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/secpaypal-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/secpaypal.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />After releasing its new stablecoin PYUSD, the payments giant Paypal disclosed that the U.S. Securities and Exchange Commission (SEC) subpoenaed the company concerning the stablecoin. Paypal stated in its Form 10-Q for the third fiscal quarter that it had been asked to produce documents for the SEC and is “cooperating” with the securities regulator. Paypal [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-02T14:07:44.000Z",
    "title": "Hacked Multichain protocol exhibits recovery with confirmed transactions",
    "url": "https://www.cryptopolitan.com/hacked-multichain-protocol-exhibits-recovery/",
    "description": "In a recent development, the Multichain protocol, which had been a victim of a hacking incident, is now showing signs of recovery as some of its transactions have been confirmed. Prior to November 1, the protocol&#8217;s last transactions had taken place over 117 days ago, according to Multichain&#8217;s Explorer tool. The backlog of queued transactions ... <a title=\"Hacked Multichain protocol exhibits recovery with confirmed transactions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hacked-multichain-protocol-exhibits-recovery/\" aria-label=\"More on Hacked Multichain protocol exhibits recovery with confirmed transactions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-02T13:49:15.000Z",
    "title": "China’s Presence Shines at AI Safety Summit 2023",
    "url": "https://www.cryptopolitan.com/chinas-shines-at-ai-safety-summit-2023/",
    "description": "The Artificial Intelligence (AI) Safety Summit 2023, hosted by British Prime Minister Rishi Sunak and Technology Secretary Michelle Donelan, has kicked off at Bletchley Park in Buckinghamshire, England. This landmark event, running from November 1 to 2, has drawn participants from leading global tech companies, renowned academic institutions specializing in AI, influential think tanks, and ... <a title=\"China&#8217;s Presence Shines at AI Safety Summit 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chinas-shines-at-ai-safety-summit-2023/\" aria-label=\"More on China&#8217;s Presence Shines at AI Safety Summit 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-02T13:45:45.000Z",
    "title": "Solana’s remarkable 80% gain: Firedancer testnet ignites a surge",
    "url": "https://www.cryptopolitan.com/solanas-remarkable-80-gain/",
    "description": "Solana, the blockchain often hailed as an &#8220;Ethereum killer,&#8221; has made significant strides in recent weeks, with an 80% gain in the past month following the launch of its testnet for the long-anticipated scaling solution, Firedancer. This surge has rekindled investor interest and optimism in the Solana ecosystem. Solana (SOL) has demonstrated remarkable performance, with ... <a title=\"Solana&#8217;s remarkable 80% gain: Firedancer testnet ignites a surge\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solanas-remarkable-80-gain/\" aria-label=\"More on Solana&#8217;s remarkable 80% gain: Firedancer testnet ignites a surge\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-02T13:43:39.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-02T13:41:03.000Z",
    "title": "MicroStrategy buys $5.3m in Bitcoin, bringing total holdings to over 150,000 BTC",
    "url": "https://crypto.news/microstrategy-buys-5-3m-in-bitcoin-bringing-total-holdings-to-over-150000-btc/",
    "description": "Since the end of Q2, 2023, MicroStrategy acquired a total sum of 6,067 BTCs at $27,531 price per each."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-02T14:00:40.000Z",
    "title": "Dormant Bitcoin Whales Rouse From Slumber To Threaten BTC Rally",
    "url": "https://www.newsbtc.com/news/bitcoin/dormant-bitcoin-whales-rally/",
    "description": "Dormant Bitcoin whales, or long-term HODLers holding huge amounts of BTC, have suddenly awakened and started moving their funds. After over six years of inactivity, three dormant Bitcoin addresses containing thousands of BTC unexpectedly became active again, and they transferred a combined total of 6,500 BTC.  With BTC now showing signs of the resumption of the October rally, these massive Bitcoin transfers could either increase buying momentum or threaten to capsize the current bull run. Dormant Bitcoin Whales Make Waves With Massive BTC Transfers Movement of dormant Bitcoin addresses has been sporadic this year, with most causing a stir and rising interest amongst the Bitcoin community. Whale movement and whale acquisitions also spiked up in October, as Bitcoin&#8217;s price saw its highest increase in 18 months. Related Reading: Unique Fair Pricing Model Puts XRP Price Higher Than Bitcoin, Here’s How Much In the latest record of whale transactions this year, on-chain data has shown that a set of dormant Bitcoin from 2017 has moved for the first time in six years. These transactions came from three addresses transferring a total of 6,500 BTC, worth approximately $230 million.  An in-depth look into these addresses shows they received their assets on November 5, 2017, with no movement until now. At the time, Bitcoin was trading at around $7,400, putting the total value of the transaction at $48 million. BTC has grown substantially since then, with a unit now going for $35,230 at the time of writing. Selling Pressure Incoming? The timing of the acquisition and transfer of these BTC point to them being controlled by one entity. Uncertainty behind these transfers sometimes can threaten buyer confidence as it could indicate the whale expects a price drop and is securing profits.  Alternatively, it could show they foresee further growth and are reorganizing for the next big rally. On-chain data points to the former, as the BTC is still held in private addresses, showing they are probably still in self-custody. Whale transfers to cryptocurrency exchanges have increased over the past few days, which may jeopardize Bitcoin&#8217;s present bull market and price gain. However, whale purchases have surged during the same period, indicating a combination of buys and selloffs from bulls and bears. Related Reading: Bull Season: Analyst Outlines Breakout That Could Send Solana To $100 One particular whale transfer that caught the eye of many traders is the movement of 2,905 BTC worth approximately $100 million dollars between two unknown wallets. 🚨 🚨 🚨 🚨 🚨 2,905 #BTC (100,351,765 USD) transferred from unknown wallet to unknown new wallethttps://t.co/qpyONJupI2 — Whale Alert (@whale_alert) November 1, 2023 On the other hand, Bitcoin recently cleared the $35,000 resistance level, as bulls look to continue October&#8217;s Bitcoin gains in the new month. November has generally been a profitable month for Bitcoin and on-chain signals currently point to greed on the Bitcoin Fear &#38; Greed Index. A continued break above the $35,000 mark could see BTC reach 2022&#8217;s order block at $45,000.  BTC at 35,400 &#124; Source: BTCUSD on Tradingview.com Featured image from Shutterstock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-02T13:55:36.000Z",
    "title": "Binance’s Latest Move: SHIB, LUNA, ADA Pairs Removed – What It Means for Traders",
    "url": "https://www.crypto-news-flash.com/binances-latest-move-shib-luna-ada-pairs-removed-what-it-means-for-traders/?utm_source=rss&utm_medium=rss&utm_campaign=binances-latest-move-shib-luna-ada-pairs-removed-what-it-means-for-traders",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Binance is delisting several crypto margin trading pairs with BUSD, including popular ones like ADA and SHIB, effective November 9, 2023. The exchange plans to phase out the BUSD stablecoin by February 2024, signaling a shift in its market strategy. Binance has confirmed the forthcoming delisting of numerous crypto margin trading pairs. Linked to major [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-02T13:48:54.000Z",
    "title": "Bitcoin ETF Acceptance Opens The Door For New Projects Like Bitcoin Spark",
    "url": "https://www.crypto-news-flash.com/bitcoin-etf-acceptance-opens-the-door-for-new-projects-like-bitcoin-spark/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-etf-acceptance-opens-the-door-for-new-projects-like-bitcoin-spark",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-4.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-4-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-4-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The recent trends in the regulatory landscape surrounding cryptocurrencies have set the stage for exciting developments within the digital asset arena. In particular, the potential approval of a Bitcoin Exchange-Traded Fund (ETF) heralds a significant milestone in the Bitcoin journey, paving the way for the emergence of innovative projects, such as Bitcoin Spark (BTCS). Bitcoin [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-02T13:42:13.000Z",
    "title": "TON Sets New World Record for Blazing Fast Blockchain Speed",
    "url": "https://www.crypto-news-flash.com/ton-sets-new-world-record-for-blazing-fast-blockchain-speed/?utm_source=rss&utm_medium=rss&utm_campaign=ton-sets-new-world-record-for-blazing-fast-blockchain-speed",
    "description": "<img width=\"1920\" height=\"1307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"MEXC Ventures\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s-300x204.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s-1024x697.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s-768x523.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Telegram-ton-s-1536x1046.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />The Toncoin (TON) developers recently conducted a public testing of the blockchain speed and concluded that the chain is capable of clocking as high as 104,715 transactions per second (TPS), thus outpacing Ethereum and Solana. Amid positive developments in the Toncoin ecosystem in the recent past, the TON price has gained about 42 percent YTD [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-02T14:02:00.000Z",
    "title": "Can Injective (INJ) Hit $20 After Hitting a 30-Day 100% Jump?",
    "url": "https://coinedition.com/can-injective-inj-hit-20-after-hitting-a-30-day-100-jump/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Injective-INJ-Price-Analysis-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Will INJ’s Bullish Action Continue Amidst Development Activity?\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Injective-INJ-Price-Analysis-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Injective-INJ-Price-Analysis-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Injective-INJ-Price-Analysis-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Injective-INJ-Price-Analysis-2-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Injective-INJ-Price-Analysis-2-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Injective-INJ-Price-Analysis-2-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Like most altcoins, Injective (INJ) has participated in the broader market rally. At press time, INJ posted a 1.10% decline. But that was only a slight retracement compared to how far the cryptocurrency has come in the last 30 days. Bears Quench the First Try One month ago, the price of INJ was around $7.60, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/can-injective-inj-hit-20-after-hitting-a-30-day-100-jump/\">Can Injective (INJ) Hit $20 After Hitting a 30-Day 100% Jump?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]