[
  {
    "source": "Cointelegraph",
    "date": "2023-07-17T02:19:00.000Z",
    "title": "Aave Protocol launches stablecoin GHO on Ethereum mainnet, $2M minted",
    "url": "https://cointelegraph.com/news/aave-protocol-launch-stablecoin-gho-ethereum-mainnet",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/3d4b8052-8a8e-4640-822f-810a9341a677.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Decentralized finance protocol Aave has finally launched its new algorithmic dollar-pegged stablecoin GHO on Ethereum.</p>\n                    <p><p>Decentralized finance (DeFi) protocol Aave has launched its algorithmic United States-dollar pegged stablecoin GHO on the Ethereum mainnet, with $2.19 million worth of GHO minted so far.</p><p>Aave announced the launch of the new stablecoin in a July 16 blog post, describing the new stablecoin GHO as a “decentralized, over-collateralized” asset. The stablecoin is backed by a “multitude” of digital assets including Ethereum’s native currency Ether (ETH) and Aave’s native token AAVE (<a href=\"https://cointelegraph.com/aave-price-index\">AAVE</a>). </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Let&#39;s GHO! Congrats to the <a href=\"https://twitter.com/AaveAave?ref_src=twsrc%5Etfw\">@AaveAave</a> community on the Mainnet Launch. <a href=\"https://t.co/vI7JbMLYb4\">https://t.co/vI7JbMLYb4</a></p>&mdash; GHO (@GHOAave) <a href=\"https://twitter.com/GHOAave/status/1680217243282489345?ref_src=twsrc%5Etfw\">July 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The launch of GHO on mainnet came after a community governance vote, which saw nearly 100% of the 424 participating addresses vote in favor of the new stablecoin. </p><p>Unlike centralized stablecoins such as Tether’s USDT (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>), which have drawn some criticism for an <a href=\"https://cointelegraph.com/news/tether-says-new-court-order-to-produce-usdt-reserve-backing-is-a-routine-discovery-matter\">apparent lack of transparency</a> around its reserves — the assets backing GHO are transparent and verifiable and can be confirmed by on-chain data, according to Aave.</p><p>“All transactions are performed through self-executing smart contracts, and all data regarding GHO transactions is available and auditable directly from the blockchain or via numerous user interfaces,” Aave wrote.</p><p>Additionally, Aave said GHO’s revenue would further bolster its DAO treasury, with governance being entrusted to AAVE and stkAAVE token holders.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/62775a76-bab8-4609-8a6c-3cecf43bc41b.png\"  /><figcaption style=\"text-align: center;\"><em>Total circulating supply of GHO since inception. Source: DeFiLlama</em></figcaption></figure><p>The GHO stablecoin is currently available to the public:</p><blockquote>“Anyone can mint GHO using the assets they supply into the Aave Protocol V3 Ethereum market as collateral, ensuring that GHO is overcollateralized by a multitude of assets.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/circle-ceo-urge-stablecoin-laws-video-congress\"><strong><em>Circle CEO spells doom scenario for US dollar in warning to Congress</em></strong></a></p><p>The launch of GHO marks another addition to the growing ranks of DeFi-native algorithmic stablecoins. On May 4, DeFi protocol Curve <a href=\"https://cointelegraph.com/news/22m-of-curve-finance-algo-stablecoin-minted-since-mainnet-launch\">launched its flagship algorithmic stablecoin</a> crvUSD. </p><p>At the time of publication, MakerDAO’s Ethereum-based stablecoin DAI, is the largest algorithmic stablecoin in circulation, commanding a $4.28 billion market capitalization according to <a href=\"https://defillama.com/stablecoins\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from DeFiLlama. </p><p>However, the total stablecoin market remains dominated by centralized issuers including Tether and Circle. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/e1d0a580-85b0-4aa5-aea8-7452b912e641.png\"  /><figcaption style=\"text-align: center;\"><em>Stablecoin dominance by market capitalization. Source: DeFiLlama</em></figcaption></figure><p>At current, Tether’s USDT and Circle’s USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) account for 87% of the total circulating supply of all U.S.-dollar pegged stablecoins. </p><p>At the time of publication, GHO is trading slightly below the desired $1 peg at $0.9927 and has fallen as low as $0.9814 on July 16, according to price <a href=\"https://coinmarketcap.com/currencies/gho/\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from CoinMarketCap. </p><p>Cointelegraph contacted Aave for comment but has yet to receive an immediate response. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]