[
  {
    "source": "Decrypt",
    "date": "2024-02-05T14:45:55.000Z",
    "title": "Bitcoin ETFs Put BlackRock and Fidelity Among January's Top 10 ETFs",
    "url": "https://decrypt.co/215730/bitcoin-etfs-blackrock-fidelity-top-10",
    "description": "BlackRock and Fidelity's spot Bitcoin ETFs landed in the top 10 ETFs by net asset flows in January, according to a Morningstar report."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-05T15:05:00.000Z",
    "title": " XRP Clawback nears 100% consensus — Will &#039;reversible&#039; transactions boost price?  ",
    "url": "https://cointelegraph.com/news/xrp-price-clawback-reversible-transactions",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNjhmZjU3MjctMGIzZi00MmFlLWI0MTQtNzEyNjQzMjQ5OTg0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Clawback proposal on the XRPL blockchain could enhance XRP's appeal to institutional investors, but the impact on price may disappoint bulls.</p>\n                    <p><p>The XRP community is rallying in support of the <a href=\"https://xrpl.org/known-amendments.html#clawback\" target=\"_blank\" rel=\"noopener nofollow\">Clawback proposal</a>, set to be implemented on the XRP Ledger (XRPL) on Feb. 8, 2024. This proposal has gained overwhelming approval, with 94% of its unique validators voting in favor.</p><p>On one hand, enhanced regulatory compliance and increased trust could attract more institutional investment into XRP, potentially driving up the price. On the other hand, concerns about misuse and the impact on user autonomy could lead to negative market sentiment.</p><p>Historically, retail investors have often overlooked how features like clawback, which can introduce elements of centralization, might influence market dynamics.</p><p><a href=\"https://cointelegraph.com/news/xrp-price-clawback-reversible-transactions\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-05T14:51:29.000Z",
    "title": "Analyst Makes a Bold Prediction for 2024 Bull Run, Says New Ethereum Competitor Priced at $0.1 Will Outperform ETH",
    "url": "https://cryptodaily.co.uk/2024/02/analyst-makes-a-bold-prediction-for-2024-bull-run-says-new-ethereum-competitor-priced-at-01-will-outperform-eth",
    "description": "Excitement permeates the cryptocurrency realm as analysts unveil bold predictions for the imminent 2024 bull run."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T15:04:11.000Z",
    "title": "Unpacking Key Concepts in AI Ethics: Beyond Explainability and Fairness",
    "url": "https://www.cryptopolitan.com/unpacking-key-concepts-in-ai-ethics/",
    "description": "The recent release of advanced language models like ChatGPT4, Bard, and Bing Chat has ignited widespread interest in AI ethics. Many are seeking to understand the underlying concepts that govern the potential risks posed by these cutting-edge technologies. This article aims to dissect crucial ideas presented in a 2021 talk on AI ethics, emphasizing the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T15:00:29.000Z",
    "title": "Script Network (SCPT) has a Bullish Sentiment Score, is Rising, and Outperforming the Crypto Market Wednesday: What’s Next?",
    "url": "https://www.cryptopolitan.com/script-network-scpt-has-a-bullish-sentiment-score-is-rising-and-outperforming-the-crypto-market-wednesday-whats-next/",
    "description": "Script Network ($SCPT) is capturing the attention of the crypto world with its innovative approach to live TV streaming and its integration with blockchain technology. As a layer 1 open-source platform, Script Network is pioneering the watch-to-earn model through its flagship product, Script TV. This platform is not just a live TV service; it&#8217;s a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T14:58:31.000Z",
    "title": "Shaping the Future of Web 3: Forward Protocol’s Pioneering Role",
    "url": "https://www.cryptopolitan.com/shaping-the-future-of-web-3-forward-protocols-pioneering-role/",
    "description": "According to experts, the blockchain market’s value will reach $1,235.71 billion by 2030, from just $5.85 billion in 2021. However, this requires everyday businesses to migrate to Web3 and incorporate smart contracts in their everyday transactions.&#160; Web3 has the potential to transform a wide range of industries like real estate, fashion, healthcare, energy sector, and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T14:53:42.000Z",
    "title": "Consensus Eludes UK Government, AI Companies, and Creative Organizations on AI Copyright Code",
    "url": "https://www.cryptopolitan.com/consensus-eludes-uk-government-ai-companies/",
    "description": "After nearly a year of deliberations, the Intellectual Property Office (IPO) of the UK has failed to broker a consensus between government authorities, AI industry leaders, and creative organizations regarding a proposed code of practice for training AI models on copyrighted material.&#160; The aim of these discussions was to establish clear guidelines for the practice [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T14:52:41.000Z",
    "title": "Revolutionizing Lab Automation: Pathfinder Technology Paves the Way",
    "url": "https://www.cryptopolitan.com/lab-automation-technology-paves-the-way/",
    "description": "In the rapidly evolving landscape of life sciences research and development, Xavo emerges as a frontrunner, wielding advanced AI in lab automation. Their groundbreaking Pathfinder technology promises to reshape the future of sample management, materials interfacing, equipment coordination, and workflow optimization. Xavo&#8217;s innovative approach, powered by their exclusive Pathfinder technology, acts as a catalyst for [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T14:40:09.000Z",
    "title": "Hacker allegedly gains access to law enforcement tool to target user data on Discord, Binance, Coinbase",
    "url": "https://www.cryptopolitan.com/hacker-allegedly-gains-access-to-law-enforcement-tool-to-target-user-data-on-discord-binance-coinbase/",
    "description": "An online hacker claims to have gained access to KodexGlobal, a law enforcement request account for securing communications between law enforcement agencies and regulators. This breach risks users&#8217; personal data across various online platforms, including major cryptocurrency exchanges like Binance and Coinbase, as well as social media and communication services such as LinkedIn and Discord. [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-05T14:59:51.000Z",
    "title": "Solana network usage hits all-time high; will SOL price reach $120? ",
    "url": "https://crypto.news/solana-network-usage-hits-all-time-high-will-sol-price-reach-120/",
    "description": "Solana market data shows historic levels of daily active users, will it propel SOL price above the $120 target? "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-05T15:00:09.000Z",
    "title": "Chainlink (LINK) Price Breaks Out Of Bullish Flag Pole, Here’s The Next Target",
    "url": "https://www.newsbtc.com/analysis/link/chainlink-link-price-bullish-flag/",
    "description": "The Chainlink (LINK) price has been on an impressive rally over the last week that has brought its price to new yearly highs. As LINK bulls continue to hold firmly above the $18 support, the emergence of this bullish rally has continued to signal that the price surge is far from over. Crypto Analyst Says Chainlink Bullish Flag Has Been Broken In an analysis posted on the TradingView website, crypto analyst CobraVanguard explains why the Chainlink price is currently very bullish. According to the analyst, despite the altcoin showing very bullish signs, a lot of traders are failing to realize that this is the case. Related Reading: Bitcoin Holders Moving Big: Number Of Whale Wallets Reaches Highest Count In 15 Months They identified a flag pole that was created in the chart, and in this case, the flag for the LINK price was actually bullish. Even more interesting is the fact that the analyst revealed that the Chainlink price had successfully broken this flag, which they say is bullish for the price. Source: Tradingview.com “LINKUSDT is in a Bullish flag Patter,” the analyst said. “We can expect a bullish movement as much as the Measured Price movement (flag pole) to happen!” This further solidifies LINK’s entrance into its most bullish phase so far in 2024. Another major factor that the analyst identifies for the LINK price at this level is that the price was testing the major supply zone at $18. At the time, the LINK price had not cleared this level. But at the time of writing, LINk has broken clean off this major supply zone and is now trending toward $19. “The Flag Is Broken,” the crypto analyst declared. What Are The Targets For The LINK Price? In the chart shared in the analysis, the crypto analyst identifies two major points of interest in the Chainlink chart and these are the Supply Zone and the Target Price. The first, which is the Supply Zone, is at $18.3, and the LINK price has already broken above this level. Related Reading: Crypto Token Unlocks To Cross $700 Million In February 2024, Here Are The Culprits Given this, the next major point of interest is the Target Price, and CobraVanguard puts this at the $27 price level. However, there is no straight shot toward this level as the analyst’s chart also shows a correction below the $13 support before rallying onto its target. If this analysis holds over the coming days/weeks, then the LINK price could see a sharp 20% correction as the first sign. Then from there, a complete 100% move upward to bring the price to the $27 price target. At the time of writing, LINK bulls continue to show dominance after a sharp 7% move in the last day. On the broader chart, the LINK price is up 27% in the last week, bringing its market cap to $10.9 billion. LINK bulls push price above $19 &#124; Source: LINKUSDT on Tradingview.com Featured image from Changelly, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-05T14:55:32.000Z",
    "title": "Avalanche’s $900 Million Token Release: Will It Sink AVAX Prices?",
    "url": "https://www.crypto-news-flash.com/avalanches-900-million-token-release-will-it-sink-avax-prices/?utm_source=rss&utm_medium=rss&utm_campaign=avalanches-900-million-token-release-will-it-sink-avax-prices",
    "description": "<img width=\"7996\" height=\"4001\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Esenin-Studio-Bulle-Bär-bullisch-bearish.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Esenin-Studio-Bulle-Bär-bullisch-bearish.jpg 7996w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Esenin-Studio-Bulle-Bär-bullisch-bearish-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Esenin-Studio-Bulle-Bär-bullisch-bearish-768x384.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Esenin-Studio-Bulle-Bär-bullisch-bearish-1024x512.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Esenin-Studio-Bulle-Bär-bullisch-bearish-1200x600.jpg 1200w\" sizes=\"(max-width: 7996px) 100vw, 7996px\" />Several crypto projects will release a combined $900 million worth of vested tokens this month, with Avalanche leading the way at 9.5 million AVAX tokens worth over $300 million. Others set to release tokens include Aptos, SUI and Optimism, with analysts concerned that these releases could tank the prices of these projects amid dipping altcoin [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-05T15:04:00.000Z",
    "title": "Is SHIB on the Verge of a Rally? Key Factors Suggest Positive Momentum Ahead",
    "url": "https://coinedition.com/is-shib-on-the-verge-of-a-rally-key-factors-suggest-positive-momentum-ahead/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Is SHIB on the Verge of a Rally? Key Factors Suggest Positive Momentum Ahead\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/SHIB-Downtrend-Continues-Despite-Burn-Event-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Shibarium&#8217;s milestone of three million blocks hints at increased demand for SHIB. A 99% surge in whale activity suggests a potential market shift and an upturn in SHIB&#8217;s valuation. SHIB&#8217;s increase in trading volume signals growing investor interest despite a minor price setback. Shiba Inu (SHIB) has recently caught the attention of investors and enthusiasts [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/is-shib-on-the-verge-of-a-rally-key-factors-suggest-positive-momentum-ahead/\">Is SHIB on the Verge of a Rally? Key Factors Suggest Positive Momentum Ahead</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2024-02-05T14:58:25.000Z",
    "title": "Bitfinex Alpha | Bitcoin Miners Are Pressuring BTC",
    "url": "https://blog.bitfinex.com/bitfinex-alpha/bitfinex-alpha-bitcoin-miners-are-pressuring-btc/",
    "description": "<p>Subscribe to Bitfinex Alpha! Want to receive Alpha from Bitfinex every week? Subscribe In this week&#8217;s on-chain report, we identify that much of the recent price falls in Bitcoin, particularly following the approval of spot Bitcoin ETFs by the SEC, can be attributed to selling...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/bitfinex-alpha/bitfinex-alpha-bitcoin-miners-are-pressuring-btc/\">Bitfinex Alpha | Bitcoin Miners Are Pressuring BTC</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]