[
  {
    "source": "Cointelegraph",
    "date": "2023-12-19T05:34:21.000Z",
    "title": " Why a gold rush for inscriptions has broken half a dozen blockchains ",
    "url": "https://cointelegraph.com/news/inscriptions-evm-frenzy-clogs-up-blockchains",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYTk1NzBhM2QtMDQ2Ny00ZjIwLTgxMDUtZmUwNjc2MGM3OWI5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Some suggest EVM inscriptions are the latest way for retail to access low-cap coins, while others argue it’s an over-hyped fad. Whatever it is, it’s clogging up the blockchain.</p>\n                    <p><p>The latest degen “gold rush\" to inscribe everything from profile pictures to memecoins has led to at least half a dozen blockchain networks cracking under pressure over the past week.</p><p>The last few days have seen <a href=\"https://cointelegraph.com/news/arbitrum-network-goes-offline-december-15\">Arbirtrum</a>, Avalanche, Cronos, zkSync, and TON all suffering partial or full outages recently due to inscriptions, with modular data availability network Celestia the latest to succumb, according to industry researchers who <a href=\"https://twitter.com/Dogetoshi/status/1736813432983130186\" target=\"_blank\" rel=\"noopener nofollow\">posted</a> a screenshot of its block explorer on Dec. 18.</p><p>Videos have also been <a href=\"https://twitter.com/am_hi_man/status/1736418216992506190\" target=\"_blank\" rel=\"noopener nofollow\">posted</a> of mass minting on the Celestia network. </p><p><a href=\"https://cointelegraph.com/news/inscriptions-evm-frenzy-clogs-up-blockchains\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-19T05:21:21.000Z",
    "title": " ‘Concerning precedent’ — bloXroute Labs&#039; MEV relays to reject OFAC blocks ",
    "url": "https://cointelegraph.com/news/concerning-precedent-bloxroute-labs-mev-relays-to-reject-ofac-blocks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNWE3NjNkYzEtNGNkYy00MDk0LTg5NGItNjBlMmYzZTBiNTdhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A decision by bloXroute Labs to start censoring OFAC-sanctioned blocks has been seen as a loss for Ethereum censorship resistance. </p>\n                    <p><p><strong> </strong>One of the largest producers of censorship-resistant blocks on Ethereum has made a complete u-turn, announcing it will start censoring OFAC-sanctioned blocks across all of its MEV relays in compliance with local laws.</p><p>The firm, bloXroute Labs — which has produced at least 400,000 Ethereum blocks from its two leading Maximal Extraction Value (MEV) relays — made the announcement of its policy change on Dec. 18 in a post on X (formerly Twitter), noting: </p><p>An \"OFAC transaction,\" as described by bloXroute Labs, is any that interacts with a wallet that has been sanctioned by the United States Office of Foreign Asset Control, or OFAC. </p><p><a href=\"https://cointelegraph.com/news/concerning-precedent-bloxroute-labs-mev-relays-to-reject-ofac-blocks\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-19T05:30:59.000Z",
    "title": "Solana Saga Phone Interest Soars Following BONK Meme Coin Surge",
    "url": "https://news.bitcoin.com/solana-saga-phone-interest-soars-following-bonk-meme-coin-surge/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/solana-saga-phone-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Solana Saga Phone Interest Soars Following BONK Meme Coin Surge\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/solana-saga-phone-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/solana-saga-phone-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/solana-saga-phone-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/solana-saga-phone-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/solana-saga-phone-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/solana-saga-phone-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/solana-saga-phone.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Fueled by the explosive growth of the BONK meme coin, the Solana Saga phone&#8217;s market interest has soared, with units selling for up to $5,000 on Ebay, far exceeding its reduced price of $599 Saga Phone Resurgence: BONK’s Rise Turns Solana Device Into Hot Commodity The Solana Saga phone, once struggling to find its market, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T05:18:54.000Z",
    "title": "AI Transformations in 2023 and Prospects for 2024",
    "url": "https://www.cryptopolitan.com/ai-transformations-in-2023-and-prospects/",
    "description": "In a groundbreaking year for artificial intelligence (AI), 2023 witnessed a rapid integration of generative AI into our daily lives, influencing how we work, entertain ourselves, and even worship. As we look ahead to 2024, it&#8217;s essential to understand the key developments and anticipate what the future holds in the ever-evolving AI landscape. AI in [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-19T05:28:09.000Z",
    "title": "SOL Price Soars 8%, Solana Indicators Suggest Breakout Above $80",
    "url": "https://www.newsbtc.com/analysis/sol-price-soars-8-solana-breakout-80/",
    "description": "Solana stayed above the $67.50 support and started a fresh increase. SOL price is gaining pace and might soon attempt a move above $80. SOL price started a fresh rally above the $72 resistance against the US Dollar. The price is now trading above $74 and the 100 simple moving average (4 hours). There is a key bullish trend line forming with support near $70.00 on the 4-hour chart of the SOL/USD pair (data source from Kraken). The pair is up nearly 8% and might rally further above the $80 resistance zone. Solana Price Resumes Increase In the past few days, Solana saw a downside correction from the $80.00 zone, like Bitcoin and Ethereum. SOL declined below the $77.50 and $75.00 support levels. However, the bulls were active above the $67.50 support. A low was formed near $67.25, and the price is now attempting a fresh increase. There was a move above the $70 and $72 resistance levels. The price is up nearly 8% and there was a move above the 50% Fib retracement level of the downward move from the $79.45 swing high to the $67.25 low. SOL is now trading above $74 and the 100 simple moving average (4 hours). There is also a key bullish trend line forming with support near $70.00 on the 4-hour chart of the SOL/USD pair. On the upside, immediate resistance is near the $76.50 level. It is near the 76.4% key bullish trend line forming with support near $70.00 on the 4-hour chart of the SOL/USD pair. The first major resistance is near the $80.00 level. Source: SOLUSD on TradingView.com The main resistance is now near $82.0. A successful close above the $82.0 resistance could set the pace for another major rally. The next key resistance is near $88.00. Any more gains might send the price toward the $92.00 level. Another Decline in SOL? If SOL fails to rally above the $80.00 resistance, it could start a fresh decline. Initial support on the downside is near the $72.00 level. The first major support is near the $70.00 level or the trend line, below which the price could test $67.50. If there is a close below the $67.50 support, the price could decline toward the $65.00 support in the near term. Technical Indicators 4-Hours MACD – The MACD for SOL/USD is gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $72.00, and $70.00. Major Resistance Levels – $76.50, $80.00, and $88.00."
  }
]