[
  {
    "source": "CryptoGlobe",
    "date": "2023-11-04T17:00:15.000Z",
    "title": "Crypto Analyst Worried About Potential Crash For Cardano’s $ADA Token Amid Market Volatility",
    "url": "https://www.cryptoglobe.com/latest/2023/11/crypto-analyst-worried-about-potential-crash-for-cardanos-ada-token-amid-market-volatility/",
    "description": "A popular crypto analyst recently offered a comprehensive review of Cardano’s ADA token to his 152K YouTube subscribers. As he geared up for the Cardano Summit in Dubai, he shared critical insights into ADA’s current price trends and the broader market’s influence on its future trajectory. The analyst expressed concerns about ADA’s immediate future, suggesting […]\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-04T16:55:50.000Z",
    "title": "Avi Eisenberg’s $110m crypto fraud trial gets rescheduled",
    "url": "https://crypto.news/avi-eisenbergs-110m-crypto-fraud-trial-rescheduled/",
    "description": "Last month, Avi Eisenberg was transferred from a federal jail in New Jersey to Metropolitan Detention Center in Brooklyn."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-04T17:00:50.000Z",
    "title": "Bitcoin Price Plunge To $12,000 Is Not Foreseeable – Analyst Explains Why",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-plunge-to-12000-is-not-foreseeable-analyst-explains-why/",
    "description": "The Bitcoin price performance was one of the brightest stories in the crypto market in the month of October. While some crypto analysts currently have bearish projections for the premier cryptocurrency, others have maintained a positive stance for BTC’s performance in November and beyond. A crypto analyst known by the pseudonym Mags on the X (formerly Twitter) platform recently offered an insight into Bitcoin’s price action, quelling bearish sentiments around the pioneer cryptocurrency. The Current Cycle Witnessed Its Own Black Swan Event Bitcoin enthusiasts and analysts have been closely monitoring the coin’s price movements, with some skeptics anticipating a significant drop to as low as $12,000. Mags, on the other hand, said on X that the recent slow but steady upward trajectory of Bitcoin suggests a different narrative. Related Reading: RUNE Solid 100% Rally Hits Barrier: THORChain Price Nears Key Resistance The crypto analyst posited that the current Bitcoin price action resembles a phase of vertical accumulation, hinting at the potential for a parabolic surge in the near future. Mags claimed that people waiting for a substantial price decline seem to be in disbelief. Furthermore, Mags suggested that most bearish projections are centered around the potential occurrence of a black swan event. For context, a black swan event refers to an unpredictable incident that is beyond what is normally expected of a situation and has potentially severe consequences. However, the analyst believes that the anticipated black swan event has already occurred. While the black swan event in the 2021 bull cycle was the COVID-19-induced market crash, the current bull cycle witnessed the FTX exchange collapse as its own black swan event. As a result of FTX’s collapse, Bitcoin price plunged to as low as $15,500. Nevertheless, BTC’s price has been on a gradual ascent and is back up by more than 120% since the market crash. This steady price rise reflects the cryptocurrency&#8217;s robust nature and its ability to bounce back from unforeseen setbacks. Bitcoin Price Overview The Bitcoin price has been on a tear in the past weeks, rallying by more than 25% in the last month. However, it is worth noting that the premier cryptocurrency has somewhat slowed down in the past few days, with only a 1.9% price increase in the past week. Related Reading: Is Fantom (FTM) About To Explode Like Solana (SOL)? This Analyst Thinks So As of this writing, Bitcoin is valued at $34,765, reflecting a 1.5% price jump in the past 24 hours. Although the market leader breached the $35,000 mark and traveled to a high of $35,700 in the past week, it has struggled to maintain momentum and stay above $35,000. Bitcoin price at $34,758 on the daily timeframe &#124; Source: BTCUSDT chart on TradingView Featured image from iStock, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-04T16:55:44.000Z",
    "title": "Ripple To Partner With Georgia’s Central Bank in the Eurasian Country’s CBDC Pilot",
    "url": "https://dailyhodl.com/2023/11/04/ripple-to-partner-with-georgias-central-bank-in-the-eurasian-countrys-cbdc-pilot/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/ripple-partner-central-bank.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/ripple-partner-central-bank.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/ripple-partner-central-bank.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/ripple-partner-central-bank.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/ripple-partner-central-bank.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/ripple-partner-central-bank.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/ripple-partner-central-bank.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Payments platform Ripple Labs is collaborating with the central bank of Georgia to create the nation’s first central bank digital currency (CBDC) pilot program. In a new company blog post, Ripple says that The National Bank of Georgia (NGB) has chosen to partner with Ripple for its digital Lari (GEL) pilot project. “The pilot will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/04/ripple-to-partner-with-georgias-central-bank-in-the-eurasian-countrys-cbdc-pilot/\">Ripple To Partner With Georgia’s Central Bank in the Eurasian Country’s CBDC Pilot</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]