[
  {
    "source": "Cryptopolitan",
    "date": "2024-03-05T01:04:48.000Z",
    "title": "Coinbase users still left in limbo – What even is going on?",
    "url": "https://www.cryptopolitan.com/coinbase-users-still-left-in-limbo/",
    "description": "Let&#8217;s say you&#8217;re chilling, maybe sipping on something cold or hot, depending on your vibe, and you decide to check your Coinbase account. You&#8217;re expecting to see your crypto treasure trove, but instead, you&#8217;re greeted with a big, fat zero. Yes, zeroes across the board where your stash should be. And it&#8217;s not just you; [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-05T01:00:14.000Z",
    "title": "Meme Coins Market Cap Soar To Over $54 Billion – Here’s What Is Driving The Surge",
    "url": "https://www.newsbtc.com/news/meme-coins-market-cap-soar-to-over-54-billion/",
    "description": "The meme coins market cap is currently hovering above $54 billion up by nearly 20% ion the past day. This surge is evident as roughly seven meme coins now rank among the top 100 crypto by market capitalization, marking a significant shift in investor interest towards these once &#8216;speculative assets.&#8217; A recent market report from QCP Capital has shed light on this phenomenon, disclosing what drives this meme coins surge. Related Reading: CryptoQuant’s Bitcoin “Bull-Bear” Indicator Flags Price As Overheated What Is Driving The Meme Coins Surge According to QCP Capital, the price appreciation in meme coins can be attributed to a &#8220;speculative buying frenzy&#8221; during the Asia trading session. Particularly, the firm report suggests that the rallying meme coins is driven by retail FOMO (Fear of Missing Out), indicating a significant shift in the dynamics of market participation. The analysts from QCP Capital also observed an increase in leveraged buying activity, hinting at the &#8220;robust&#8221; momentum that could potentially pause should Bitcoin surpass its all-time high in dollar terms. The market report read: Altcoins, especially memecoins, are rallying hard as retail FOMO really kicks in now. Leveraged buyers will likely not relent until we break all-time highs, which could be any time now. So far, major meme coins such as Dogecoin, Shiba Inu, PEPE, and BONK have registered. massive gains, with increases of 27%, 57%, 46%, and 68% respectively over the last 24 hours. These gains reflect the growing investor interest in meme coins and underscore the broader trend of retail investment driving the crypto market. Dogecoin and Shiba Inu, in particular, have solidified their positions within the top 15 global crypto market cap rankings, demonstrating the significant traction meme coins have gained among investors. Retail Participation Fuelling The Crypto Rally The surge in memecoins is part of a larger trend of increased retail participation in the cryptocurrency market. Analysts from JPMorgan have echoed the observations made by QCP Capital, noting that retail traders have played a crucial role in the cryptocurrency market rally observed throughout February. Related Reading: Bitcoin Will Reach A New All-Time High This Week, Matrixport Head Of Research Says The study carried out by the research group at JPMorgan, under the guidance of Managing Director Nikolaos Panigirtzoglou, highlighted the significant role of &#8220;small-scale investors,&#8221; commonly known as &#8216;mom-and-pop&#8217; traders, in driving prominent cryptocurrencies like Bitcoin to a two-year high last month. The researchers noted: We find that the retail impulse into crypto rebounded in February, thus likely responsible for this month’s strong crypto market rally. Meanwhile, over the past 24 hours, Bitcoin has reached new heights, trading above $66,000, marking a nearly 30% increase over the past week. This upward trajectory is also evident in the asset&#8217;s market cap, which currently exceeds $1.2 trillion. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-05T01:00:12.000Z",
    "title": "Memecoins and Another Crypto Subsector Offering the Best Plays This Market Cycle, According to Top Trader",
    "url": "https://dailyhodl.com/2024/03/04/memecoins-and-another-crypto-subsector-offering-the-best-plays-this-market-cycle-according-to-top-trader/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Cause-Crypto-To-Nuke.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Cause-Crypto-To-Nuke.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Cause-Crypto-To-Nuke.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Cause-Crypto-To-Nuke.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Cause-Crypto-To-Nuke.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Cause-Crypto-To-Nuke.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Cause-Crypto-To-Nuke.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed trader says memecoins and an additional crypto subsector are likely to outperform the rest during this market cycle. Pseudonymous analyst The Flow Horse tells his 204,000 followers on the social media platform X that traders who made big gains on memecoins will likely rotate their capital to other crypto assets and trigger [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/04/memecoins-and-another-crypto-subsector-offering-the-best-plays-this-market-cycle-according-to-top-trader/\">Memecoins and Another Crypto Subsector Offering the Best Plays This Market Cycle, According to Top Trader</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]