[
  {
    "source": "Cointelegraph",
    "date": "2024-02-20T23:00:00.000Z",
    "title": " Bitcoin price rejects at $53K as futures open interest hits a 2-year high ",
    "url": "https://cointelegraph.com/news/bitcoin-price-rejects-at-53k-as-futures-open-interest-hits-a-2-year-high",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvOGYzZTBkNDgtYTljYS00ZjQxLTg1ZjktY2JiYWI3NzlhMWU5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin price surged to $53,000 today. Cointelegraph explains why.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price rallied to a new 2024 high at $53,019 on Feb. 20, before abruptly selling off to $50,000 on some exchanges. Traders are citing consistent spot BTC ETF inflows and the upcoming supply halving event as major factors behind the price move, and at the time of publishing, BTC price trades above $52,100.</p><p>Let’s take a look at the primary reasons why the Bitcoin price is volatile today.</p><p>Bitcoin futures open interest (OI) has hit a new yearly high, reaching levels last seen in Number 2021. This indicates increased trading activity around the largest cryptocurrency by market capitalization. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-rejects-at-53k-as-futures-open-interest-hits-a-2-year-high\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-20T22:56:25.000Z",
    "title": "Bitcoin ETF real-time price data now tracked on Pyth Network",
    "url": "https://cryptobriefing.com/bitcoin-etf-real-time-price-data-tracked-pyth-network/?utm_source=feed&utm_medium=rss",
    "description": "Pyth Network introduced today a new feature that allows users to access spot Bitcoin ETF real-time data without any complex configurations."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-20T23:00:23.000Z",
    "title": "Dogecoin Begins Massive Recovery Trend, But Can These Factors Drive A Rally To $0.2?",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-rally-to-0-2/",
    "description": "The Dogecoin price action in the past few days is showing signs of the crypto embarking on a bullish recovery. Particularly, DOGE has seen a strong uptick in trading volume in the last few days, fueled by an increase in activity from whale addresses.  At the time of writing, DOGE spiked by over 6% in the past 24 hours to break over $0.09 for a brief moment. This spike in DOGE came despite the price of Bitcoin showcasing a weakening of bullish momentum at $52,000 and most cryptocurrencies sparking corrections, indicating a lingering bullish momentum among DOGE traders. DOGE Recent Metrics Indicate Recovery Trend Dogecoin mostly went through a lackluster price action throughout January, with the cryptocurrency ending the month at $0.07973, a negative 13% from its open price on January 1. The $0.079 price level acted as a major support, as DOGE started to rebound in early February after the formation of a double bottom. Consequently, DOGE technicals, transaction count, and price action pointed to a change in momentum and sentiment amongst traders.   Related Reading: Crypto Analyst Reveals Why Shiba Inu Price Will Not Reach $1 According to metrics from the on-chain analytics platform IntoTheBlock, the Dogecoin ecosystem has witnessed a lot of activity in the past month, processing more than 1 million transactions every day since the 30th of January. This increase in activity seems to have been reflected in the price of Dogecoin, with the cryptocurrency up by 11% since the beginning of February. Source: IntoTheBlock At the time of writing, DOGE&#8217;s trading volume from Coinmarketcap is approximately $824 million, an increase of over 129% in the past 24 hours. The majority of the recent increase in activity can be attributed to whales of large investors.  According to Dogecoin whale data, whale transactions greater than $100,000 now stand at $2.53 billion in the past seven days. Notably, this transaction count from large investors reached 1,570 in the past 24 hours with a total volume of 15.88 billion DOGE. This huge surge of activity seems to be providing the cryptocurrency with a big boost, fueling an impressive recovery that could see it crossing the $0.1 threshold once more and possibly reaching the $0.2 price level. DOGE Price Action &#8211; Rally To $0.2? Dogecoin has started showing signs of life again, fueled in large part by whale activity. The crypto recently surged to $0.09115 in the past 24 hours. Although still up by 1% in the same timeframe, DOGE has since corrected by 4.5% and is currently trading at $0.08702.  Related Reading: Bitcoin Spot ETFs: Issuers Set New Record As Weekly Inflows Cross $2.2 Billion A minor support is at the $0.08693 price level, with metrics and general market sentiment pointing to continued bullish price action in the short time. The first price level would be the return to $0.09. If Dogecoin manages to maintain a stronghold above this key milestone, it is expected to create a more bullish momentum among traders which could see it breaking past above $0.1 for the first time in three months.  This breakthrough over $0.11 could mark an important milestone for Dogecoin’s price trajectory, as the next target would be $0.2.  DOGE price at $0.087 &#124; Source: DOGEUSD on Tradingview.com Featured image from CoinGape, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-20T23:01:48.000Z",
    "title": "‘Proof of Humanity’ Project With Palm Recognition Technology Announces Partnership With Polygon Labs and Animoca Brands",
    "url": "https://dailyhodl.com/2024/02/20/proof-of-humanity-project-with-palm-recognition-technology-announces-partnership-with-polygon-labs-and-animoca-brands/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/matic-top-altcoin-pick.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/matic-top-altcoin-pick.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/matic-top-altcoin-pick.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/matic-top-altcoin-pick.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/matic-top-altcoin-pick.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/matic-top-altcoin-pick.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/matic-top-altcoin-pick.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A new crypto project backed by the team behind Polygon (MATIC) wants to introduce a new &#8220;proof of humanity&#8221; protocol. According to a new press release, the Humanity Institution, in partnership with Polygon Labs and Animoca Brands, is introducing a new zero-knowledge-proof, Ethereum Virtual Machine (zkEVM)-compatible blockchain that uses palm scanning technology. Using palm-scanning tech to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/20/proof-of-humanity-project-with-palm-recognition-technology-announces-partnership-with-polygon-labs-and-animoca-brands/\">‘Proof of Humanity’ Project With Palm Recognition Technology Announces Partnership With Polygon Labs and Animoca Brands</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]