[
  {
    "source": "Cointelegraph",
    "date": "2024-03-14T04:37:39.000Z",
    "title": " Elon Musk: Dogecoin will used to buy Teslas ’at some point’ ",
    "url": "https://cointelegraph.com/news/elon-musk-dogecoin-doge-buy-teslas-at-some-point",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZjY4NjEzOGQtN2Y0OC00MTkwLTlmYTctMDQwM2QxZTEyZGJiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Musk started advocating for Dogecoin after receiving requests from Tesla factory employees and SpaceX visitors to include the memecoin as an official mode of payment. </p>\n                    <p><p>Tesla CEO Elon Musk revealed his intent to start accepting Dogecoin (DOGE) as official payment for Tesla cars “at some point”.</p><p>On March 13, Musk was interacting with the public at the Berlin Gigafactory, a Tesla manufacturing plant, wherein an audience member asked if Tesla can be bought using DOGE in the near future. Musk <a href=\"https://twitter.com/dogeofficialceo/status/1768087572234793050\" target=\"_blank\" rel=\"noopener nofollow\">responded</a> positively to the request:</p><p>Musk's response sparked enthusiasm among investors as the market price of the token witnessed a sudden surge. Dogecoin reacted by jumping from $0.172 to $0.188 at the time of writing, marking a 9.3% as the video gains traction on X.</p><p><a href=\"https://cointelegraph.com/news/elon-musk-dogecoin-doge-buy-teslas-at-some-point\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-14T05:00:23.000Z",
    "title": "New AI Crypto Presale Raises $9m: 5 Days Left to Buy Scotty the AI Before Exchange Listings",
    "url": "https://news.bitcoin.com/new-ai-crypto-presale-raises-9m-5-days-left-to-buy-scotty-the-ai-before-exchange-listings/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/image2-4-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/image2-4-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/image2-4-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/image2-4-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/image2-4-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/image2-4-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/image2-4-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/image2-4.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A new meme coin, Scotty the AI (SCOTTY), is turning heads and raking in substantial investment dollars during its limited-time presale. With $9 million raised already, crypto traders have been scrambling to buy SCOTTY tokens before the presale window ends in five days. Scotty the AI Unleashes Meme Power &#38; AI Utility While meme coins [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-14T04:48:25.000Z",
    "title": "Is OpenAI’s GPT-4.5 Turbo an Accidental Leak or Strategic Tease?",
    "url": "https://www.cryptopolitan.com/is-openais-gpt-4-5-turbo-accidental-leak/",
    "description": "In a series of events that sent ripples through the online AI community, OpenAI found itself at the center of speculation after a deleted blog post hinted at what could potentially be the next significant upgrade to its flagship conversational AI model, ChatGPT. The accidental leak shed light on the existence of a faster, more [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-14T04:59:43.000Z",
    "title": "Ethereum Price Faces Many Hurdles, Downside Thrust Before Fresh Increase?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-hurdles-4000/",
    "description": "Ethereum price is struggling above the $4,000 zone. ETH is slowly moving lower and there is a risk of a downside thrust toward the $3,850 support. Ethereum traded to a new multi-month high above $4,080 before correcting lower. The price is trading below $4,000 and the 100-hourly Simple Moving Average. There is a connecting bullish trend line forming with support at $3,965 on the hourly chart of ETH/USD (data feed via Kraken). The pair could resume its increase if it clears the $4,025 resistance zone. Ethereum Price Holds Support Ethereum price extended its increase above the $4,050 level, like Bitcoin. ETH traded to a new multi-month high above $4,080 before there was a downside correction. The price declined below the $4,000 level. It seems like Ether bulls are struggling to keep the price above $4,000. There was a move below the 23.6% Fib retracement level of the upward move from the $3,830 swing low to the $4,083 high. Ethereum price is now trading below $3,980 and the 100-hourly Simple Moving Average. However, the bulls are active near the $3,950 zone. There is also a connecting bullish trend line forming with support at $3,965 on the hourly chart of ETH/USD. The trend line is close to the 50% Fib retracement level of the upward move from the $3,830 swing low to the $4,083 high. If the pair stays above the $3,950 level, it could attempt another increase. Immediate resistance on the upside is near the $4,025 level. The first major resistance is near the $4,050 level. The next major resistance is near $4,085, above which the price might gain bullish momentum. Source: ETHUSD on TradingView.com In the stated case, Ether could rally toward the $4,150 level. If there is a move above the $4,150 resistance, Ethereum could even rise toward the $4,250 resistance. Any more gains might call for a test of $4,320. Downside Break In ETH? If Ethereum fails to clear the $4,025 resistance, it could start a downside correction. Initial support on the downside is near the $3,950 level. The first major support is near the $3,880 zone. The next key support could be the $3,830 zone. A clear move below the $3,830 support might send the price toward $3,750. Any more losses might send the price toward the $3,650 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $3,950 Major Resistance Level – $4,025"
  }
]