[
  {
    "source": "CoinDesk",
    "date": "2023-11-30T12:00:00.000Z",
    "title": "Polygon's Secret Deal: Sending DraftKings Millions to Run Failed Validator",
    "url": "https://www.coindesk.com/business/2023/11/30/polygons-secret-deal-sending-draftkings-millions-to-run-failed-validator/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Polygon quietly gave DraftKings' validator preferential treatment while telling the public it was an \"equal\" member of the validator community."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-30T11:55:01.000Z",
    "title": "Google DeepMind’s AI predicts 2 million novel chemical materials for real-world tech",
    "url": "http://cointelegraph.com/news/google-deep-mind-ai-predicts-2-million-material-structures-for-real-world-tech",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/44af58b3-bbb2-450b-8ceb-fd612bf8dfc1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A paper published in the science journal Nature says the AI developed by DeepMind underwent training using data sourced from the Materials Project, an international research consortium established at the Lawrence Berkeley National Laboratory in 2011.</p>\n                    <p><p>Google DeepMind has utilized <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/artificial-intelligence\">artificial intelligence (AI)</a> to forecast the structure of over 2 million novel chemical materials, marking a breakthrough with potential applications for enhancing real-world technologies soon.</p><p>In a scientific paper <a href=\"https://www.nature.com/articles/d41586-023-03745-5\" target=\"_blank\" rel=\"noopener nofollow\">released</a> in the Nature Journal on Wednesday, Nov. 29, the AI company owned by Alphabet reported that nearly 400,000 of its theoretical material designs may soon undergo laboratory testing. Possible uses for this research encompass the development of batteries, solar panels, and computer chips with enhanced performance.</p><p>According to the paper, identifying and creating new materials is often expensive and time-intensive. It took approximately two decades of research before lithium-ion batteries, now widely employed in devices like phones, laptops, and electric vehicles, became commercially accessible.</p><p>Ekin Dogus Cubuk, a research scientist at DeepMind, expressed optimism that advancements in experimentation, autonomous synthesis, and machine learning models could substantially reduce the lengthy 10 to 20-year timeline for material discovery and synthesis.</p><p>According to the publication, the AI developed by DeepMind underwent training using data sourced from the Materials Project, an international research consortium established at the Lawrence Berkeley National Laboratory in 2011. The data set comprised information on approximately 50,000 pre-existing materials.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-altman-returns-openai-ceo-microsoft-new-board\"><strong><em>12 days of unemployment later, Sam Altman is officially back at OpenAI</em></strong></a></p><p>The organization expressed its intention to distribute its data to the research community, aiming to expedite additional advancements in the field of material discovery. However, Kristin Persson, director of the Materials Project, said in the paper that the industry is cautious about cost increases, and new materials often take time to become cost-effective. According to Persson, shrinking this timeline would be the ultimate breakthrough.</p><p>After employing AI to forecast the stability of these novel materials, DeepMind has shifted its attention to predicting their synthesizability in laboratory conditions.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/real-ai-use-cases-crypto-3-ai-smart-contract-audits-cybersecurity/\"><strong><em>Real AI use cases in crypto, No. 3: Smart contract audits &amp; cybersecurity</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-30T11:48:11.000Z",
    "title": "Hong Kong Securities Association suggests ICO to boost island’s economy",
    "url": "http://cointelegraph.com/news/hong-kong-association-suggests-ico-boost-island-economy",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/794f706a-e9d2-4573-bc54-33ce74d15297.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Hong Kong Securities and Futures Association also suggested that Hong Kong’s authorities could implement Islamic Banking. </p>\n                    <p><p>The suggestion that Hong Kong could make an “Initial Coin Offering” (ICO) appeared in a list of propositions formulated by the Hong Kong Securities and Futures Association to revitalize Hong Kong's economy. </p><p>The document, signed by association president Chen Zhihua, was <a href=\"https://www.hksfpa.org/file.aspx?clid=143&amp;atid=1659&amp;lan=1\" target=\"_blank\" rel=\"noopener nofollow\">published</a> on Nov. 29 and included various measures, ranging from routine to bold. </p><p>The suggestions include the legal recognition of <a href=\"https://cointelegraph.com/news/islam-and-crypto-how-digital-assets-can-comply-with-islamic-financial-law\">Islamic finance</a>, and inviting stakeholders from the Islamic world to set up a committee to formulate “Islamic finance guidelines with Hong Kong characteristics.” The tenth point of the list contains only the following line without any details:</p><blockquote>“Consider launching an initial coin offering (ICO) mechanism.”</blockquote><p>As there is no further explanation, it is unclear whether the association is suggesting the crafting of a comprehensive framework for ICOs or creating an authorized platform. </p><p>The <a href=\"https://cointelegraph.com/news/the-death-of-the-ico-has-the-us-sec-closed-the-global-window-on-new-tokens\">era of ICOs is widely seen as having ended in 2020</a> due to regulatory pressure and the entrance of institutional investors into the crypto market. The capitalization of ICOs <a href=\"https://medium.com/fiatxs/what-happened-to-icos-4cc41d4c19e3\" target=\"_blank\" rel=\"noopener nofollow\">plummeted</a> 95% from its boom year in 2018 to 2019. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/the-death-of-the-ico-has-the-us-sec-closed-the-global-window-on-new-tokens\"><strong><em>The Death of the ICO. Has the US SEC Closed the Global Window on New Tokens?</em></strong></a></p><p>Cointelegraph sent a press request to the Hong Kong Securities and Futures Association for details on the initiative. </p><p>Meanwhile, the Hong Kong administration is busy setting in place crypto regulation. In November, it laid down the business requirements for <a href=\"https://cointelegraph.com/news/hong-kong-sfc-tokenized-investments-requirements\">offering tokenized securities</a> and other investment products. Providers are expected to take full responsibility for their tokenized products, ensure effective record-keeping, and demonstrate operational soundness, among other factors.</p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/outrage-chatgpt-wont-say-slurs-qstar-breaks-encryption-99-fake-web-ai-eye/\"><strong><em>Outrage that ChatGPT won’t say slurs, Q* ‘breaks encryption’, 99% fake web: AI Eye</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-30T11:46:12.000Z",
    "title": "Cathie Wood’s ARK buys $1.5M SOFI shares as SoFi exits crypto",
    "url": "http://cointelegraph.com/news/ark-buys-1-5-million-sofi-stock-crypto-exit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/5d371762-a45f-443b-8b29-cedd31aaeaea.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cathie Wood’s ARK has been actively accumulating shares of SoFi, which announced plans to terminate crypto services by the end of 2023.</p>\n                    <p><p>ARK Invest, a cryptocurrency investment firm founded by Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) advocate Cathie Wood, bought about $1.5 million of SoFi Technologies (SOFI) shares on Nov. 29, the day the latter announced its exit from crypto.</p><p>On Nov. 29, ARK bought 200,275 SOFI shares to allocate to its ARK Fintech Innovation ETF (ARKF), according to a trade notification seen by Cointelegraph. The amount is worth $1.47 million, based on SOFI’s closing price on Nov. 29, or $7.35 a share, <a href=\"https://www.tradingview.com/symbols/NASDAQ-SOFI/\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to data from TradingView.</p><p>ARK’s latest SOFI purchase came on the day <a href=\"https://cointelegraph.com/news/sofi-technologies-cease-crypto-services-december-19\">SoFi Technologies officially announced</a> its decision to terminate cryptocurrency services by Dec. 19, 2023.</p><p>“After careful consideration, we’ve made the decision to discontinue our crypto services by the end of this year,” SoFi said, directing its customers to migrate their crypto holdings to the online crypto wallet Blockchain.com.</p><p>ARK has been <a href=\"https://cointelegraph.com/news/ark-sells-43k-coinbase-shares-18-month-high\">actively buying SoFi shares</a> throughout the year, buying a total of 1,772,991 SOFI for ARKF so far. ARKF’s SoFi exposure is worth around $13 million at today’s prices.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-payment-alchemy-pay-sepa-eu-uk\"><strong><em>Binance will end support for BUSD stablecoin in December</em></strong></a></p><p>SoFi stock has seen some volatility in 2023, surging to $11.45 in July after starting the year at just $4.5. SoFi shares have been gradually declining since then, dropping below $7 in mid-November.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/d1ff99f2-e62d-472f-9a69-c4daa8da891c.png\"  /><figcaption style=\"text-align: center;\"><em>SoFi Technologies (SOFI) shares’ year-to-date price chart. Source: TradingView</em></figcaption></figure><p>In addition to buying SoFi, ARK has been actively buying Robinhood (HOOD) shares, bagging 221,759 HOOD on Nov. 29. Robinhood’s trading app allows one to buy and trade cryptocurrencies like Bitcoin in the United States. The platform officially <a href=\"https://cointelegraph.com/news/robinhood-united-kingdom-launch-stock-trading\">announced plans to expand its business into the U.K.</a> on Nov. 30, without mentioning whether cryptocurrency would be part of the offering.</p><p>While buying SoFi and Robinhood, ARK has continued to sell the Coinbase (COIN) stock. On Nov. 29, ARK sold around 38,000 COIN shares from the ARKF ETF, totaling nearly $5 million.</p><p>ARK did not immediately respond to Cointelegraph’s request for comment.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-30T12:07:24.000Z",
    "title": "Streamr Announces the Launch of Testnet 1 for Streamr 1.0 - A New Milestone in the Decentralized Data Economy",
    "url": "https://cryptodaily.co.uk/2023/11/streamr-announces-the-launch-of-testnet-1-for-streamr-10-a-new-milestone-in-the-decentralized-data-economy",
    "description": "Streamr Announces the Launch of Testnet 1 for Streamr 1.0 - A New Milestone in the Decentralized Data Economy"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-30T12:08:13.000Z",
    "title": "Injective (INJ) and Render (RNDR) lead the altcoin charge once again",
    "url": "https://cryptodaily.co.uk/2023/11/injective-inj-and-render-rndr-lead-the-altcoin-charge-once-again",
    "description": "When altcoins start moving, Injective (INJ) and Render (RNDR) are normally among the front runners. $INJ is up 7% and $RNDR is up 5% already on Thursday morning."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-30T12:06:35.000Z",
    "title": "South Korea’s Bithumb exchange introduces BIGTIME and STMX cryptocurrencies",
    "url": "https://www.cryptopolitan.com/bithumb-exchange-introduces-bigtime-and-stmx/",
    "description": "In a significant development in the world of cryptocurrency, two popular virtual assets, BIGTIME and STMX, have made their debut in the South Korean crypto market through the renowned local exchange, Bithumb. The official announcement from Bithumb indicates that users can begin trading both tokens as of November, utilizing the supported ERC-20 network. Introduction to ... <a title=\"South Korea&#8217;s Bithumb exchange introduces BIGTIME and STMX cryptocurrencies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bithumb-exchange-introduces-bigtime-and-stmx/\" aria-label=\"More on South Korea&#8217;s Bithumb exchange introduces BIGTIME and STMX cryptocurrencies\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-30T11:51:30.000Z",
    "title": "Realizing the Potential of AI in Manufacturing: A Guide to Maximal Returns",
    "url": "https://www.cryptopolitan.com/the-potential-of-ai-in-manufacturing/",
    "description": "The manufacturing industry is witnessing a transformative era with artificial intelligence (AI) integration. As Anna-Katrina Shedletsky, a former Apple engineer and an expert in the field, points out, AI may seem like a new buzzword. Still, its underlying technologies, such as computer vision, advanced statistics, and machine learning, have been around for decades. The key ... <a title=\"Realizing the Potential of AI in Manufacturing: A Guide to Maximal Returns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-potential-of-ai-in-manufacturing/\" aria-label=\"More on Realizing the Potential of AI in Manufacturing: A Guide to Maximal Returns\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-30T11:40:39.000Z",
    "title": "ASUS ROG Ally Handheld Console Hits Lowest-Ever Price in Cyber Week Deal",
    "url": "https://www.cryptopolitan.com/asus-rog-ally-handheld-console-hits-lowest-ever-price-in-cyber-week-deal/",
    "description": "In a surprising turn of events, the ASUS ROG Ally Ryzen Z1 handheld gaming console is currently available at its lowest-ever price of $399, down from its original price of $600. This remarkable Cyber Week deal offers gamers the chance to save a substantial $200, representing a 34% discount. However, potential buyers are urged to ... <a title=\"ASUS ROG Ally Handheld Console Hits Lowest-Ever Price in Cyber Week Deal\" class=\"read-more\" href=\"https://www.cryptopolitan.com/asus-rog-ally-handheld-console-hits-lowest-ever-price-in-cyber-week-deal/\" aria-label=\"More on ASUS ROG Ally Handheld Console Hits Lowest-Ever Price in Cyber Week Deal\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-30T11:47:57.000Z",
    "title": "A new government report claims most Canadians regret investing in crypto assets",
    "url": "https://crypto.news/a-new-government-report-claims-most-canadians-regret-investing-in-crypto-assets/",
    "description": "In 2023, the number of cryptocurrency owners in Canada decreased slightly, but the average holdings increased significantly. According to a report from the Ontario Securities Commission (OSC), 77% of respondents regret investing in crypto assets. While the number of Canadians&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-30T12:00:50.000Z",
    "title": "Rare Signal Predicts Next XRP Price Move: Crypto Analyst",
    "url": "https://www.newsbtc.com/analysis/xrp/rare-signal-predicts-next-xrp-price-move-crypto-analyst/",
    "description": "The XRP price has been treading water in recent days. After XRP rose by more than 52% in just 18 days from mid-October to early November, the price is currently in a clear consolidation phase in the shorter time frames. However, a look at the 1-month chart of the XRP/USD trading pair shows that the XRP price has exhibited strong bullish months. In this sense, Crypto analyst Egrag has drawn attention to an extremely rare phenomenon in the XRP monthly price chart. The pattern in question is a series of three consecutive monthly green candles, which have only been documented twice in the history of the cryptocurrency. As the market approaches the monthly close today, a confirmation by a close above $0.5987 could mean the third monthly green candle for XRP. “Get ready—within the next [few] hours, we&#8217;re poised to seal another trio of consecutive green candles,” Egrag noted. Here’s What This Could Mean For XRP Price Delving into the specifics, Egrag elucidates two distinct historical precedents post such formations. In the first scenario, a 5-month consolidation phase was observed after XRP recorded three consecutive green candles from March to May 2017. Related Reading: XRP Price Prediction: Analyst Identifies 3 Key Factors That Will Trigger Parabolic Move However, the consolidation phase had an extremely bullish effect. After it ended, the XRP price experienced a staggering 1,500% surge within just two months. Egrag suggests that if XRP&#8217;s price action were to emulate this historical pattern, investors can anticipate a potential surge to $10, starting from the 1st of April 2024. The second instance Egrag refers to the period from December 2015 to February 2016. During this time, the price rose by approximately 102% in three consecutive green months. What followed was a lengthier 12-month consolidation phase. But the wait was worth it again. In March 2018, the XRP price started an extraordinary 8,000% rally. A replication of this scenario would imply a potential skyrocketing of XRP&#8217;s price to $50, beginning on the 1st of November 2024. Notably, Egrag offers an average price target standing at $30. He stated, “XRP army stay steady, the average of these two targets lands at $30, you know that I always whisper to you my secret target of $27. Hallelujah, the anticipation is palpable!” Price Analysis: 1-Day Chart At press time, XRP was trading at $0.60333. A week ago, the price managed to break out of a downtrend channel. However, the bullish momentum quickly fizzled out after the price was rejected at the 0.382 Fibonacci retracement level at $0.627. Related Reading: Bitcoin Decouples with XRP, BNB But Correlates With Dogecoin and Cardano For four days now, the XRP price has been squeezed into a tight range between the 20-day and 50-day EMA (Exponential Moving Average), with a breakout to the downside or upside getting closer and closer. In the event of an upside breakout, the price level at $0.627 would be decisive. Then, the price could tackle the 0.5 Fibonacci retracement level at $0.688. However, if a breakout to the downside happens, a 100-day EMA at $0.575 would be the first support. This must hold to prevent the price from falling towards the 0.236 Fibonacci retracement level at $0.552, which is also close to the 200-day EMA. The convergence of both indicators signifies a price level that the bulls must defend at all costs. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-30T11:47:37.000Z",
    "title": "Your Next Smart Investment: $ROE, LINK, ADA",
    "url": "https://www.crypto-news-flash.com/your-next-smart-investment-roe-link-ada/?utm_source=rss&utm_medium=rss&utm_campaign=your-next-smart-investment-roe-link-ada",
    "description": "<img width=\"512\" height=\"219\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-113.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-113.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-113-300x128.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As a top crypto exchange, Coinbase has chosen to add support for Chainlink (LINK) and Cardano (ADA) perpetual future contracts by November 30. According to analysts, this move will drive more investors to these tokens, making them some of the best crypto investments in Q4 2023. Similarly, BorroeFinance ($ROE) plans to deliver massive returns to [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-30T11:41:43.000Z",
    "title": "Expert Says Ripple Not at Fault That XRP Only Grew 20% In 5 Years",
    "url": "https://coinedition.com/expert-says-ripple-not-at-fault-that-xrp-only-grew-20-in-5-years/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/633-XRP-Ripple-XRP-macro-BREAKDOWN-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Legal expert Bill Morgan has countered the view that Ripple’s monthly escrow XRP release contributed to XRP’s underwhelming price performance in the last five years. The recent conversation around XRP’s five-year-long poor performance erupted after a crypto enthusiast posted a comparison of XRP’s 2018 price with other prominent competing crypto projects. Per the image, as [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/expert-says-ripple-not-at-fault-that-xrp-only-grew-20-in-5-years/\">Expert Says Ripple Not at Fault That XRP Only Grew 20% In 5 Years</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]