[
  {
    "source": "CoinDesk",
    "date": "2023-06-16T14:26:48.000Z",
    "title": "Blockchain Anti-Counterfeiting Trials ‘Promising,’ EU Agency Says",
    "url": "https://www.coindesk.com/policy/2023/06/16/blockchain-anti-counterfeiting-trials-promising-eu-agency-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The European Union's intellectual property office EUIPO wants traders and customs authorities to use open-source tools to authenticate branded goods."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-16T14:25:35.000Z",
    "title": "Crypto platform Bakkt drops Cardano, Polygon, Solana as SEC scrutiny intensifies",
    "url": "https://cryptoslate.com/crypto-platform-bakkt-drops-cardano-polygon-solana-as-sec-scrutiny-intensifies/",
    "description": "<p>Bakkt is the latest U.S.-based crypto platform to delist Cardano, Polygon, and Solana because of the recent regulatory uncertainty surrounding these assets, Fortune reported on June 16. Bakkt&#8217;s general counsel and secretary Marc D’Annunzio reportedly said: &#8220;[Bakkt is taking this measure] until there is further clarity on how to compliantly offer a more extensive list [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/crypto-platform-bakkt-drops-cardano-polygon-solana-as-sec-scrutiny-intensifies/\">Crypto platform Bakkt drops Cardano, Polygon, Solana as SEC scrutiny intensifies</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-16T14:23:06.000Z",
    "title": "Coinbase Ups the Ante: USDC Rewards Leap to 4%",
    "url": "https://www.cryptoglobe.com/latest/2023/06/coinbase-ups-the-ante-usdc-rewards-leap-to-4/",
    "description": "Coinbase, the renowned digital currency exchange, has declared a twofold increase in its rewards for USD Coin (USDC) holders. The company made this announcement via a social media post on June 15, 2023, as reported by CryptoSlate. Previously, Coinbase customers who bought or stored USDC in their accounts were eligible for a 2% reward. Now, […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-16T14:30:00.000Z",
    "title": "Crypto Traders ask ChatGPT for price prediction: Binance coin, Bitcoin, Tradecurve",
    "url": "https://cryptodaily.co.uk/2023/06/crypto-traders-ask-chatgpt-for-price-prediction-binance-coin-bitcoin-tradecurve",
    "description": "<p>With the rise of Artificial Intelligence, companies are consistently pushing for new technological advancements and investing millions towards creating the best possible chatbot that users can utilize to get the information they need with ease, and one of the most recent use cases has been making price predictions for the crypto market.&nbsp;</p>\n<p>Cryptocurrency traders are now asking ChatGPT, the most popular AI-driven chatbot globally, to tell them everything they need to know surrounding the future value of Binance coin, Tradecurve, and Bitcoin during the current bear market.</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\nAsking ChatGPT About Binance coin\n<p>According to ChatGPT, the price of Binance coin at the end of 2023 is difficult to predict with 100% accuracy; however, based on the current market conditions and historical price data, the AI is able to make some educated guesses as to how far it can climb.</p>\n<p>On June 9, 2023, Binance coin traded at $259.21 per coin. This represents a lower point of value than the one Binance coin had at the start of the month, but there are factors that could impact its price in the future, including Binance's continued push towards creating new features and products, market demand, and overall regulatory compliance of the exchange.&nbsp;</p>\n<p>The price of Binance coin at the end of 2023, according to some piece predictions made for the Binance coin, places it at a value of $465.85.&nbsp;</p>\n<p></p>\nThe Answers ChatGPT Gave for Bitcoin\n<p>The price of Bitcoin as of June 9, 2023, is at $26,607.05. Analysts went to ChatGPT to get accurate predictions about the future of Bitcoin. However, the AI did note that nothing can be predicted with 100% certainty.&nbsp;</p>\n<p>The key factors that can affect the value of Bitcoin, according to ChatGPT, include the overall momentum of the market, mainstream adoption of the Bitcoin cryptocurrency, and the development of new, innovative features on top of the network or the creation of Layer-2 scaling solutions for it.&nbsp;</p>\n<p>The price of Bitcoin at the end of 2023 could see an increase, however, and based on estimates, BTC is expected to reach $65,000 by the end of the year.&nbsp;</p>\n<p></p>\nWhat ChatGPT Thinks about The Performance of Tradecurve\n<p>Investors and traders are also curious about new projects, and Tradecurve has stood out due to its popularity, appeal, and the freedom it provides investors as it does not require KYC checks whilst also having the lowest fees in the industry.</p>\n<p>Tradecurve is a hybrid exchange that combines the best elements of CEXs and DEXs to provide a truly unique, decentralized experience that will enable anyone on a global scale access to markets that are otherwise unavailable to them due to banking restrictions or regulations.&nbsp;</p>\n<p></p>\n<p>Each user of Tradecurve can effectively and effortlessly trade cryptocurrencies, as well as any other derivative, from one account while also maintaining privacy through the platform's DeFi capabilities.&nbsp;</p>\n<p>TCRV is the utility token behind the platform, and it is currently undergoing Stage 3 of its presale, where it is offered at $0.015.&nbsp;</p>\n<p>When asked about the future of the cryptocurrency, ChatGPT noted how it could climb to 100x at launch, bringing it to $1.5 in value, because of the increased demand for such a solution after heightened regulation of CEXs, and because of the fast sales of the TCRV tokens, where the team has already sold millions of tokens and can generate $20 million before the presale ends.&nbsp;</p>\nLearn more about Tradecurve and the TCRV token below:\n<p>Click Here For Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-16T14:30:00.000Z",
    "title": "Bitcoin Will 10x Says Michael Saylor, This New Hybrid Exchange Plans to Overtake Binance",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-will-10x-says-michael-saylor-this-new-hybrid-exchange-plans-to-overtake-binance",
    "description": "<p>The popular Bitcoin investor and permabull, Michael Saylor, has released a new prediction for Bitcoin. Saylor has said that under the right conditions, the price of Bitcoin will jump by 10x to set a new trading high at $250,000. In other news, Tradecurve, a new hybrid exchange has outlined plans to overtake Binance as the number one crypto exchange, and some experts believe it is possible.&nbsp;</p>\n<ul>\n<li>Michael Saylor has predicted a 10x price jump for Bitcoin, predicting the crypto will trade as high as $250,000 in the next bull run.</li>\n<li>According to Saylor, regulatory clarity will be the catalyst for the next bull run.</li>\n<li>While Binance suffers due to regulatory clarity, a new hybrid exchange has tapped into markets that could see it overtake the number one crypto exchange.</li>\n</ul>\n<p></p>\nMichael Saylor Predicts 10x Price Jump for Bitcoin (BTC)\n<p>In an interview with Bloomberg, Michael Saylor, the co-founder of Microstrategy, an enterprise business intelligence provider, predicted that the price of Bitcoin could jump by 10x. In explaining the reasoning for his prediction, Saylor said regulatory clarity in the U.S. will drive the next Bitcoin rally.</p>\n<p>The presence of regulatory clarity will encourage venture capitalists that have avoided cryptocurrencies to jump into the industry. He adds that the recent crackdown on many top crypto exchanges by the Securities and Exchange Commission (SEC) would lay the groundwork for the next major Bitcoin bull run.</p>\n<p>Congress is already working on a unified crypto regulatory framework and assigning crypto-specific roles to SEC and CFTC, meaning the next Bitcoin bull run couldn&rsquo;t be far away. If Saylor&rsquo;s prediction holds true, we would witness Bitcoin set a new all-time high at $250,000, beating its previous ATH at $68,789.</p>\n<p></p>\nBinance Has a New Challenger, And the Hybrid Exchange Could Overtake It\n<p>On the journey to regulatory clarity for the cryptocurrency industry, the leading crypto exchange, Binance, has been caught in the web of the SEC. The crackdown on centralized exchanges has opened a window for the newer hybrid exchanges, which many crypto experts have called the future of crypto trading because they combine the best features of centralized and decentralized exchanges.</p>\n<p>One hybrid exchange, Tradecurve, has set out to challenge the dominance of Binance by incorporating into its platform trading features that Binance lack, including more trading options (forex and derivatives), negative balance protection, self-management of private keys, low latency ultra-fast order execution, and algorithmic trading.&nbsp;</p>\n<p>By looking to offer wider assets for trading and features that will make for a seamless trading experience, Tradecurve plans to topple Binance as the number one crypto trading platform. With the current regulatory crackdown on Binance, many crypto analysts believe Tradecurve has a chance to steal market share from Binance to reduce its dominance.&nbsp;</p>\n<p>Tradecurve is on track to enact its plan, currently in the fourth presale phase expecting to raise $20 million to launch its platform. The project has enjoyed massive support from investors currently buying its native token, TCRV, at $0.018 per token.</p>\n<p>Visit the links below to get more information about Tradecurve and the TCRV token:</p>\n<p>Click Here For the Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-16T14:30:49.000Z",
    "title": "Coinex Settles With NY Attorney General, Pays $1.7M in Penalties; Announces Exit from US Market",
    "url": "https://news.bitcoin.com/coinex-settles-with-ny-attorney-general-pays-1-7m-in-penalties-announces-exit-from-us-market/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/james-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/james-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/james-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/james-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/james-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/james-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/james-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/james.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to a press release issued on June 15 by the Office of the New York State Attorney General, the cryptocurrency exchange Coinex has reached a settlement with Letitia James, the chief law enforcement officer. The attorney general stated that Coinex will pay $1.7 million in penalties and refunds and is barred from operating its [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T14:38:49.000Z",
    "title": "Binance tightens asset standards: PEPE excluded from borrowable assets",
    "url": "https://www.cryptopolitan.com/binance-tightens-asset-standards-pepe-excluded-from-borrowable-assets/",
    "description": "Binance, the leading cryptocurrency exchange, has recently announced a major decision that could have significant implications for its users. Starting from June 21, 2023, at 08:00 (UTC), Binance will cease accepting PEPE as collateral on its Flexible Loan platform. This move is part of Binance&#8217;s ongoing commitment to providing its customers access to reliable, high-quality ... <a title=\"Binance tightens asset standards: PEPE excluded from borrowable assets\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-tightens-asset-standards-pepe-excluded-from-borrowable-assets/\" aria-label=\"More on Binance tightens asset standards: PEPE excluded from borrowable assets\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T14:35:15.000Z",
    "title": "Asia lays a red carpet for crypto amid the SEC industry crackdown",
    "url": "https://www.cryptopolitan.com/asia-welcomes-crypto-amid-the-sec-crackdown/",
    "description": "The US Securities and Exchange Commission&#8217;s recent actions against two of the world&#8217;s largest crypto exchanges have created a significant opportunity for Asia, which has heralded its potential to leverage blockchain technology and digital assets to spur economic development.&#160; The SEC&#8217;s enforcement stance is to drive crypto enterprises elsewhere, as the East especially Asia provides ... <a title=\"Asia lays a red carpet for crypto amid the SEC industry crackdown\" class=\"read-more\" href=\"https://www.cryptopolitan.com/asia-welcomes-crypto-amid-the-sec-crackdown/\" aria-label=\"More on Asia lays a red carpet for crypto amid the SEC industry crackdown\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T14:21:39.000Z",
    "title": "Crypto community divided: BlackRock ETF’s impact on DeFi remains uncertain",
    "url": "https://www.cryptopolitan.com/blackrock-etfs-impact-on-defi-is-uncertain/",
    "description": "While US regulators are filing lawsuits against crypto platforms for alleged violations of securities laws, BlackRock, the world&#8217;s largest asset manager with over US$10 trillion under management, has filed to launch the first publicly traded spot Bitcoin exchange-traded fund (ETF) in the US. After weeks of gloom and a huge governmental onslaught, the crypto market ... <a title=\"Crypto community divided: BlackRock ETF&#8217;s impact on DeFi remains uncertain\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blackrock-etfs-impact-on-defi-is-uncertain/\" aria-label=\"More on Crypto community divided: BlackRock ETF&#8217;s impact on DeFi remains uncertain\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T14:16:14.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years, and there is no stopping it anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. Various APE price highlights unfold in this ApeCoin Price Prediction. How much is ApeCoin ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T14:13:39.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T14:12:46.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T14:12:31.000Z",
    "title": "Federal Reserve and SEC investigate Goldman Sachs’ actions in Silicon Valley Bank’s collapse",
    "url": "https://www.cryptopolitan.com/fed-and-sec-probe-goldman-sachs-on-svb-fall/",
    "description": "The Federal Reserve and Securities and Exchange Commission (SEC) are investigating Goldman Sachs for its participation in the unsuccessful capital raise and acquisition of Silicon Valley Bank&#8217;s securities portfolio before its failure. The Justice Department has issued a warrant, and the authorities are looking into possible inappropriate interactions and Goldman Sachs&#8217; dual status as buyer ... <a title=\"Federal Reserve and SEC investigate Goldman Sachs&#8217; actions in Silicon Valley Bank&#8217;s collapse\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fed-and-sec-probe-goldman-sachs-on-svb-fall/\" aria-label=\"More on Federal Reserve and SEC investigate Goldman Sachs&#8217; actions in Silicon Valley Bank&#8217;s collapse\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-16T14:30:34.000Z",
    "title": "Shiba Inu Lead Developer Unveils Shibacals, Advancing Shibarium Development",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-lead-developer-unveils-shibacals-advancing-shibarium-development/",
    "description": "In an exciting development for the Shiba Inu community, the top developer working behind the scenes has unveiled another project before the launch of Shibarium. The lead developer introduced their newest innovation, &#8216;Shibacals,&#8217; bringing them one step closer to their ambitious vision. Shiba Inu enthusiasts and investors can anticipate even greater possibilities with this new advancement. Shytoshi Kusama Unveils Shibacals, A Promising Step Towards Shibarium Launch Shiba Inu lead developer Shytoshi Kusama introduced ‘Shibacals,&#8217; sparking positive speculations and anticipation among the community. Kusama shared the hint in the Shibarium official Telegram group, directing the community to visit www.shibacals.com. Related Reading: Cardano (ADA) Price Sheds 19% As Bearish Sentiment Looms Large In a recent tweet, Shiba Inu’s content marketing specialist, Lucie, asked the community to follow Shibacal’s account with an attachment of Kusama’s statement. The news about the Shibacals followed hints that Lucie gave regarding an upcoming physical reveal. Shytoshi Kusama also hinted at the project&#8217;s launch, which he classified as &#8220;Something Physical.&#8221; However, a community member expresses displeasure with the launch of the Shibacals, raising questions regarding how the project will benefit the Shibarium community. He expressed his concern that this action may solely be focused on taking advantage of the community to generate profit: “t has nothing to do with decreasing the #Shib’s total supply or impacting the price by utility. If I am missing something, please educate me! What Does Shibacals Entail? As described on its official website, Shibacals brings a unique real-world feature to the Shiba Inu ecosystem. The project transforms digital NFTs into first-class, high-quality physical items like plushies or toys. Shibacals&#8217; primary goal is to add an extra touch of excitement and value to the community, bridging the digital and physical realms meaningfully. Shibacals aims to empower the wider crypto community through strategic partnerships with prominent manufacturers. Shibacals hopes to introduce various physical goods by collaborating with these manufacturers. According to Shibacals, its products will come with a ‘super-cool SHIB tag or classy white-labeled one” and an inbuilt NFC chip which they describe as a secret handshake for true-blue authenticity. Lucie also took to Twitter to share captivating images of a Shibacals hoodie, offering a sneak peek at one of their latest creations. Meanwhile, the Shibacals is hosting a contest titled Shibacals Hoodie Contest, where Shiba Inu community members are allowed to present 3 designs of their Shibacal Hoodie. A vote will be conducted to get the winner, and the winning design will be made available as a pre-sale item with the tag &#8220;Shiba Inu: 1st edition” for 5-7 days. According to Shibacals, each winner will receive a percentage of the proceeds they realize from the pre-sale. Featured image from Pixabay and chart from tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T14:25:13.000Z",
    "title": "Polygon Labs Unveils ‘The Value Prop’: The Ultimate Blockchain Use Case Encyclopedia",
    "url": "https://www.crypto-news-flash.com/polygon-labs-unveils-the-value-prop-the-ultimate-blockchain-use-case-encyclopedia/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-labs-unveils-the-value-prop-the-ultimate-blockchain-use-case-encyclopedia",
    "description": "Polygon has launched The Value Prop. The Value Prop is an open database that hosts a variety of blockchain use cases. Polygon has introduced a new open database dubbed The Value Prop that hosts blockchain use cases. The Value Prop is designed in such a way that it highlights the different positive use cases of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T14:12:03.000Z",
    "title": "Shiba Inu: Let’s Get Physical – Can a New Hardware Wallet or Physical Product Attract New Users and Drive Ecosystem Growth?",
    "url": "https://www.crypto-news-flash.com/shiba-inu-lets-get-physical-can-a-new-hardware-wallet-or-physical-product-attract-new-users-and-drive-ecosystem-growth/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-lets-get-physical-can-a-new-hardware-wallet-or-physical-product-attract-new-users-and-drive-ecosystem-growth",
    "description": "Shiba Inu&#8217;s leading developers and influencers drop teasers on an upcoming &#8220;physical product&#8221;, leaving the community with guesses.  More than 90 percent of SHIB investors are currently at a loss following the recent price fall and the decline in wallet addresses. The SHIB community has received frequent updates on some developments in the pipeline over [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-16T14:35:00.000Z",
    "title": "New York Attorney General Uncovers Tether’s Chinese Securities Link",
    "url": "https://coinedition.com/new-york-attorney-general-uncovers-tethers-chinese-securities-link/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/theter-3-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/theter-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/theter-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/theter-3.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>According to Bloomberg, recently disclosed documents from the New York Attorney General&#8217;s office shed light on Tether&#8217;s involvement with Chinese securities, contradicting the company&#8217;s persistent denial of such claims. Renowned corporations like China Construction Bank Corp. and Agricultural Bank of China Ltd issued these securities. Rumors surrounding Tether&#8217;s use of Chinese securities to back its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/new-york-attorney-general-uncovers-tethers-chinese-securities-link/\">New York Attorney General Uncovers Tether&#8217;s Chinese Securities Link</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-16T14:16:26.000Z",
    "title": "CIRI Revolutionizes Privacy in Messaging with Groundbreaking Anti-Recording Feature",
    "url": "https://coinedition.com/ciri-revolutionizes-privacy-in-messaging-with-groundbreaking-anti-recording-feature/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/CIRI_Revolutionizes_Privacy_in_Messaging_with_Groundbreaking_Anti-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/CIRI_Revolutionizes_Privacy_in_Messaging_with_Groundbreaking_Anti-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/CIRI_Revolutionizes_Privacy_in_Messaging_with_Groundbreaking_Anti-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/CIRI_Revolutionizes_Privacy_in_Messaging_with_Groundbreaking_Anti.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Decentralized messaging app, CIRI, introduces anti-recording technology to protect users&#8217; private data. Decentralized messaging app, CIRI, takes a giant leap forward in user privacy and data security with its latest anti-recording feature. This groundbreaking technology detects and prevents the unauthorized sharing or disclosure of users&#8217; private data, ensuring secure communication in today&#8217;s digital era. In [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ciri-revolutionizes-privacy-in-messaging-with-groundbreaking-anti-recording-feature/\">CIRI Revolutionizes Privacy in Messaging with Groundbreaking Anti-Recording Feature</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-16T14:30:24.000Z",
    "title": "Macro Guru Raoul Pal Predicts ‘Exponential Move’ for Crypto Over the Long Term, Says Current Selloff Is Noise",
    "url": "https://dailyhodl.com/2023/06/16/macro-guru-raoul-pal-predicts-exponential-move-for-crypto-over-the-long-term-says-current-selloff-is-noise/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Over-the-Long-Term.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Over-the-Long-Term.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Over-the-Long-Term.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Over-the-Long-Term.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Over-the-Long-Term.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Over-the-Long-Term.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Over-the-Long-Term.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Real Vision CEO Raoul Pal is predicting a huge move to the upside for the crypto market in the coming years. The former Goldman Sachs executive tells his 996,400 Twitter followers that crypto will likely see new all-time highs in what he calls the “Exponential Age,” a time of massive growth of tech and digital [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/16/macro-guru-raoul-pal-predicts-exponential-move-for-crypto-over-the-long-term-says-current-selloff-is-noise/\">Macro Guru Raoul Pal Predicts ‘Exponential Move’ for Crypto Over the Long Term, Says Current Selloff Is Noise</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]