[
  {
    "source": "Cointelegraph",
    "date": "2023-12-14T23:30:22.000Z",
    "title": " How the Ledger Connect hacker tricked users into making malicious approvals ",
    "url": "https://cointelegraph.com/news/how-the-ledger-connect-hacker-tricked-users-into-making-malicious-approvals",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMDA3YmJmZGUtZmRiOS00NDJkLWIxMWEtODNkNjJlNzNiNmUzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>According to Cyvers, the attacker caused malicious code to be inserted into multiple app user interfaces, allowing the exploiter to fool users into confirming transactions.</p>\n                    <p><p>The ‘Ledger hacker’ who siphoned away at least $484,000 from multiple Web3 apps on Dec. 14 did so by tricking Web3 users into making malicious token approvals, according to the team behind blockchain security platform Cyvers. </p><p>According to public statements made by multiple parties involved, the hack <a href=\"https://cointelegraph.com/news/multiple-dapps-using-ledger-connector-compromised\">occurred on the morning of Dec. 14</a>. The attacker used a phishing exploit to <a href=\"https://cointelegraph.com/news/decentralized-applications-pause-ledger-connect-as-exploit-fix-deployed\">compromise the computer of a former Ledger employee</a>, gaining access to the employee’s node package manager javascript (NPMJS) account. </p><p>When a developer first writes their app, they usually install a connect kit through Node Package Manager (NPM). After creating a build and uploading it to their site, their app will contain the connect kit as part of its code, which will then be downloaded into the user’s browser whenever the user visits the site.</p><p><a href=\"https://cointelegraph.com/news/how-the-ledger-connect-hacker-tricked-users-into-making-malicious-approvals\">Read more</a></p></p>\n                \n            "
  }
]