[
  {
    "source": "CryptoGlobe",
    "date": "2023-10-27T08:24:23.000Z",
    "title": "Atlanta Fed President: “I don’t Think We’ll Be Cutting Rates Before the Middle of Next Year at the Earliest”",
    "url": "https://www.cryptoglobe.com/latest/2023/10/atlanta-fed-president-i-dont-think-well-be-cutting-rates-before-the-middle-of-next-year-at-the-earliest/",
    "description": "Atlanta Federal Reserve President Raphael Bostic recently appeared on CNBC’s “Squawk Box” to discuss a range of topics, including public sentiment versus economic data, his views on Federal Reserve policy, and the current economic landscape. The interview began with a request to Bostic to contextualize recent comments made by the Federal Reserve Chairman. Bostic acknowledged […]\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-27T08:28:18.000Z",
    "title": "Australian police seize $50m in crypto money laundering scheme",
    "url": "https://crypto.news/australian-police-seize-50m-in-crypto-money-laundering-scheme/",
    "description": "The Australian Federal Police (AFP) has accused Changjiang Currency Exchange of a money laundering scheme. In a press release, the AFP said the operation, codenamed Ironside, resulted from a three-year investigation into the activities of the currency exchange business. Changjiang&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-27T08:30:15.000Z",
    "title": "PEPE Price Leaps 90% As Meme Coin Reaches Over 155,000 On-Chain Wallets",
    "url": "https://www.newsbtc.com/news/pepe-leaps-90-as-meme-coin-records-over-155000-on-chain-wallets/",
    "description": "In the meme coin realm, the last week has ignited fresh momentum, and the buzz revolves around Pepe Coin (PEPE), which has witnessed a remarkable surge over the weekend. This rally has set traders&#8217; minds racing, as they contemplate whether PEPE&#8217;s ascent could evolve into a formidable challenge to the supremacy of Shiba Inu (SHIB) and Dogecoin (DOGE). At the time of writing, PEPE was trading at $0.00000120, up 3.3% in the last 24 hours, and registered an impressive weekly increase of 90%, data from crypto market tracker Coingecko shows. Source: Coingecko Related Reading: Shiba Inu Reverses December Downtrend – Good Days Ahead For Investors? PEPE Reaches 155K On-Chain Wallets Just recently, Pepe had reached a market cap of $1.6 billion, sparking conversations about its potential to compete with the crypto market&#8217;s top meme coins. This rapid resurgence showcases its resilience and its enduring allure to traders and investors. Pepecoin, drawing inspiration from the iconic Pepe the Frog meme, has carved a noteworthy niche in the meme coin arena. Its remarkable journey in early 2023, achieving a staggering $1.6 billion market cap and a rapid 100% weekly growth, hints at the potential for a price surge in Q4 2023. 142,069 $PEPE pic.twitter.com/B0tp66Oq4u — Pepe (@pepecoineth) October 25, 2023 As this developed, the frog-themed meme coin also made headlines when its reach extended to over 155,000 on-chain wallets, encompassing all tokens bridged to both Arbitrum and BSC, underlining its widespread adoption and engagement within the cryptocurrency community. This impressive user base indicates a growing and vibrant ecosystem, poised to explore new horizons and opportunities in the digital asset space. Related Reading: XRP Shines Bright: 14% Weekly Gains And New Highs After August Dip PEPE currently trading at $0.00000120 on the daily chart:TradingView.com PEPE&#8217;s Robust Market Valuation The sudden and robust gains in PEPE&#8217;s price have captured the attention of traders and investors, highlighting its potential as an attractive investment within the volatile cryptocurrency market. Pepe (PEPE), a meme coin born during crypto winter, has witnessed an astonishing feat, doubling its price within a week to reach a $500 million market cap. This surge comes as traders anticipate the potential impact of a Bitcoin (BTC) spot ETF on the broader market. As market charts showed a 1% gain in the global crypto market value, reaching $1.28 trillion as of October 26, the prices of cryptocurrencies saw a little boost. Positive momentum from the &#8220;Uptober&#8221; surge caused the cryptocurrency market to rise significantly in the last few sessions on a global scale. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock/Linas Toleikis"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-27T08:30:12.000Z",
    "title": "ADA’s Potential Surge: Will It Break $0.40 for a $1 Rally?",
    "url": "https://www.crypto-news-flash.com/adas-potential-surge-will-it-break-0-40-for-a-1-rally/?utm_source=rss&utm_medium=rss&utm_campaign=adas-potential-surge-will-it-break-0-40-for-a-1-rally",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-103.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-103.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-103-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />ADA displays resilience, trading above $0.25 and showing potential for further gains. Upcoming Cardano Summit and updates around Djed stablecoin are crucial developments to watch. Blockchain enthusiasts and investors are closely monitoring Cardano (ADA), as its performance on the weekly timeframe reveals a bullish trend. Following the recent update from CNF, there is a palpable [...]"
  }
]