[
  {
    "source": "Cointelegraph",
    "date": "2023-11-29T13:22:26.000Z",
    "title": "IOTA launches $100 million Abu Dhabi foundation for Middle East expansion ",
    "url": "http://cointelegraph.com/news/iota-launches-100-million-abu-dhabi-foundation-for-middle-east-expansion",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/81122d83-60b8-46ae-b7b2-3415c3407177.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The IOTA Ecosystem DLT Foundation is the first to receive approval from regulators in Abu Dhabi after its financial authority passed a new, related law earlier in the month.  </p>\n                    <p><p>The open-source blockchain developer IOTA announced on Nov. 29 that it is launching a foundation, the IOTA Ecosystem DLT Foundation, based in Abu Dhabi to focus on the growth of its distributed ledger technology (DLT) in the Middle East region. </p><p>According to the announcement, the new foundation will be supported by $100 million IOTA digital tokens, which will be vested throughout the course of the next four years. </p><p>One of the primary goals of the foundation is to push for accelerated growth of its DLT and “convert real-world assets into digital ones” according to the company’s co-founder and chairman Dominik Schiener.</p><blockquote>\"The market right now is being reshuffled so we have a big opportunity to position ourselves by focusing on onboarding institutions, offering them to work on-chain because now it's more feasible to do that in the UAE.”</blockquote><p>In addition to growing its technology to support developments in the Middle East region, the network will begin “tokenizing” assets. </p><p>Hamad Sayah Al Mazrouei, the chief executive of the Registration Authority of the Abu Dhabi Global Market (ADGM), said the country aims to be “the leading jurisdiction for the blockchain industry.\"</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/siemens-microsoft-ai-adoption-industrial-sectors\"><strong><em>Siemens and Microsoft partner to push AI adoption in industrial sectors</em></strong></a></p><p>The IOTA Ecosystem DLT Foundation became among the first blockchain-focused organizations to be approved by regulators from the ADGM.</p><p>This development comes less than a month after <a href=\"https://cointelegraph.com/news/abu-dhabi-global-market-comprehensive-dlt-foundations-regulations\">ADGM introduced comprehensive regulations</a> on Nov. 2 targeting DLT foundations like IOTA. The regulations claim to provide opportunities for organizations to expand into DLT in the region. </p><p>According to the new regulations, compliance includes disclosing names of key figures, having a name that ends with “DLT Foundation,” a council consisting of two and 16 members, tokenholders being treated as beneficiaries, and not being allowed to conduct activities licensable by the ADGM.</p><p>This new framework also paves the ways for<a href=\"https://cointelegraph.com/news/abu-dhabi-pioneers-dlt-regulation-daos-web3-innovations\"> DAOs to legally operate and issue tokens</a> to its members.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-substance-abuse-traders-trading/\"><strong><em>This is your brain on crypto: Substance abuse grows among crypto traders</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-29T13:20:00.000Z",
    "title": "Huddle01 CEO explains why communications tech must be decentralized",
    "url": "http://cointelegraph.com/news/huddle01-ceo-explains-communications-tech-must-be-decentralized",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/8405dc00-a818-4519-85b2-5e62402cf5cf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Huddle01 CEO Ayush Ranjan tells The Agenda podcast why centralized communications technology is unreliable and requires a decentralized alternative.</p>\n                    <p><p>The means by which humans communicate and coordinate are ever-evolving. People went from sending smoke signals and messengers on horseback to sending letters and telegrams, and since the dawn of the digital era, the pace of innovation has exploded.</p><p>Today, hundreds or even thousands of people from around the world can gather in a Twitter Space or Zoom call and communicate in practically real-time. But people still primarily communicate via centralized platforms that retain and monetize user data, suffer from outages, have the power to censor speech, and face problems such as severe lag.</p><p>So, what would a decentralized Web3 version of a communications and meeting platform like Zoom or Google Meet look like? To find out, Jonathan DeYoung and Ray Salmond sat down with Ayush Ranjan, co-founder and CEO of Huddle01 — a Web3 meetings and communications platform — on Episode 24 of <em>The Agenda </em>podcast.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/3fd240b2-6455-4b41-88ea-23cc93335cfc.jpg\"  /></figure><h2>The problem with centralized communications</h2><p>Huddle01 offers a built-in set of Web3-native tools people can use when planning their meetings. For example, users can connect their wallets and use their <a href=\"https://cointelegraph.com/learn/what-are-nft-profile-pictures\">nonfungible token (NFT) profile pictures</a> as avatars, and meetings can be token-gated. In addition, video recordings can be stored on the <a href=\"https://cointelegraph.com/learn/what-is-the-interplanetary-file-system-ipfs-how-does-it-work\">InterPlanetary File System</a>. However, according to Ranjan, the company’s core focus is to make communications and coordination easier and more reliable through decentralization.</p><p>The major problem with tools such as Zoom is that they are “built with a very top-down approach,” meaning that every call from all around the world is routed through centralized servers. “Let’s suppose we are doing a call in India,” Ranjan posited. “The calls are still routed through a central server in North Virginia. That means all the audio and video packets are routed all the way from India to the U.S., and then coming back via speed of light via the [fiberoptic] cables. The more distance it travels, it leads to latency. It leads to jitter and buffer, and that’s why you get these robotic voices.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">For the last 2 years we’ve heavily  prioritized on team building to make the moonshot a reality. <br><br>Bringing a world class real-time communication application and infrastructure to you. <br><br>We are <a href=\"https://twitter.com/huddle01com?ref_src=twsrc%5Etfw\">@huddle01com</a>. <a href=\"https://t.co/1LKkE2IDC4\">pic.twitter.com/1LKkE2IDC4</a></p>&mdash; Ayush Ranjan  FILBangalore&#39;23 (@ranjan3118) <a href=\"https://twitter.com/ranjan3118/status/1561310623840931842?ref_src=twsrc%5Etfw\">August 21, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>Ranjan shared that during the height of the COVID-19 pandemic in India, when schooling went remote, his cousin could barely participate in his Zoom-based classes due to the extreme latency he experienced:</p><blockquote>“That made me realize how big a problem this is. Like if your three years of education can go completely bite down the dust just because your infrastructure is not ready, we need to change this.”</blockquote><p>This inspired him to co-found Huddle01, which he said can achieve significantly better performance by routing traffic through a distributed set of servers rather than one centralized location.</p><h2>Which comes first: Decentralization or a good product?</h2><p>Today, Huddle01 relies on Amazon Web Services, but its end goal is to transition to a fully decentralized protocol where individuals can run their own nodes (and get paid for it) through which call traffic will be routed.</p><template data-ct-widget=\"buzzsprout\" data-buzzsprout-podcast-id=\"2096305\"></template><p>Ranjan described this process as progressive decentralization. “We have followed an approach of solving demand first and then solving the supply side of things,” said the co-founder. “Instead of completely decentralizing the whole tech on day one itself, launching a network on day one itself, we are making sure that we do it progressively.”</p><p>He told <em>The Agenda</em> that because Huddle01 has focused on the user experience first, it has already clocked 2 million minutes of call time, meaning there will, theoretically, be guaranteed demand once the protocol actually goes live.</p><blockquote>“If you do it decentralized from day one, will that lead to users not using it because it’s so tough to use?”</blockquote><p>To hear more from Ranjan’s conversation with <em>The Agenda </em>— including how Huddle01 works with the Lens Protocol to empower creators, how it handles user privacy and its future plans for interplanetary communications — listen to the full episode on <a href=\"https://cointelegraph.com/podcasts/the-agenda\">Cointelegraph’s Podcasts page</a>, <a href=\"https://podcasts.apple.com/us/podcast/the-agenda/id1659393166\" target=\"_blank\" rel=\"noopener nofollow\">Apple Podcasts</a> or <a href=\"https://open.spotify.com/show/6azmkkIXj5LQbxTRAbAqXS\" target=\"_blank\" rel=\"noopener nofollow\">Spotify</a>. And don’t forget to check out Cointelegraph’s <a href=\"https://cointelegraph.com/podcasts\">full lineup</a> of other shows! </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/i-spent-a-week-working-in-vr-it-was-mostly-terrible-however/\"><strong><em>I spent a week working in VR. It was mostly terrible, however…</em></strong></a></p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-29T13:17:23.000Z",
    "title": "Santander appoints crypto custodian Taurus to safeguard Bitcoin, Ether: Report",
    "url": "http://cointelegraph.com/news/santander-appoints-crypto-custodian-taurus-safeguard-bitcoin-ether-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/f0534dae-679d-427c-9249-0c8a3ff3d7d7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>An unconfirmed report suggests Taurus will provide crypto custodial services to Spanish fin-serv giant Banco Santander.</p>\n                    <p><p>Spanish fin-serv giant Banco Santander has reportedly selected digital asset management firm Taurus to safeguard its Swiss clients’ Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>).</p><p>On Nov. 20, Santander Private Banking International’s Swiss private banking unit <a href=\"https://cointelegraph.com/news/santander-offers-bitcoin-eth-trading-swiss-account-holders-report\">rolled out a new Bitcoin and Ether trading service</a> for clients with Swiss accounts. A Santander spokesperson told Cointelegraph that clients will get access to crypto investment services only after requesting it through relationship managers.</p><p>A CoinDesk <a href=\"https://www.coindesk.com/business/2023/11/29/santander-selects-crypto-custody-firm-taurus-for-safeguarding-source/?utm_medium=referral&amp;utm_source=rss&amp;utm_campaign=headlines\" target=\"_blank\" rel=\"noopener nofollow\">report</a> citing ‘a person familiar with the arrangement’ stated that the bank has appointed crypto custody firm Taurus for the safekeeping of the crypto assets. Cointelegraph reached out for confirmation from Santander, which declined to comment, saying:</p><blockquote>“Unfortunately, it’s a no comment. We don’t comment on providers or possible providers.”</blockquote><p>On Sept 14, Taurus partnered with German banking giant Deutsche Bank to provide cryptocurrency custody options to its customers. </p><p>Taurus did not immediately respond to Cointelegraph’s request for comment. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/jp-morgan-apollo-plan-enterprise-mainnet-execs-reveal\"><strong><em>JPMorgan, Apollo plan for enterprise mainnet, execs reveal</em></strong></a></p><p>While some banks tap into existing players for custodial needs, DZ Bank, the third largest bank in Germany by asset size, launched its own digital assets custody platform built on the blockchain.</p><p>Holger Meffert, head of securities services and digital custody at DZ, expressed the bank’s interest in distributed ledger technology (DLT). The bank also hopes to offer institutional investors and private customers the facility to buy cryptocurrencies, “such as Bitcoin,” in the future. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/real-ai-use-cases-crypto-no-2-ai-can-run-dao/\"><strong><em>Real AI use cases in crypto, No. 2: AIs can run DAOs</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-29T13:29:44.000Z",
    "title": "Lawyers file $1B class action against Ronaldo 3 months after similarly templated $1B CZ suit",
    "url": "https://cryptoslate.com/lawyers-file-1b-class-action-against-ronaldo-3-months-after-similarly-templated-1b-cz-suit/",
    "description": "<p>Cristiano Ronaldo, the renowned football icon, has become the subject of a class-action lawsuit filed by the same two plaintiffs who previously sued Changpeng Zhao (CZ), the former CEO of Binance, for $1 billion. The Ronaldo suit, which also seeks a staggering $1 billion in damages, may raise questions, particularly given the striking similarities to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/lawyers-file-1b-class-action-against-ronaldo-3-months-after-similarly-templated-1b-cz-suit/\">Lawyers file $1B class action against Ronaldo 3 months after similarly templated $1B CZ suit</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-29T13:15:57.000Z",
    "title": "Bitcoin Technical Analysis: BTC Bulls Attempt to Break Upper Resistance",
    "url": "https://news.bitcoin.com/bitcoin-technical-analysis-btc-bulls-attempt-to-break-upper-resistance/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/bull20202077777-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Technical Analysis: BTC Bulls Attempt to Break Upper Resistance\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/bull20202077777-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/bull20202077777-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/bull20202077777-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/bull20202077777-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/bull20202077777-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/bull20202077777-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/bull20202077777.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The price of bitcoin is hovering just above the $38K range after a bullish trading day on Tuesday following U.S. Federal Reserve Governor Chris Waller&#x2019;s dovish speech. Bitcoin&#x2019;s 24-hour range has been between $37,156 to $38,450 and it currently has a market capitalization of around $745 billion. Bitcoin As bitcoin&#x2019;s price hovers around $38,275, a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T13:39:12.000Z",
    "title": "Taskmaster VR Game Set to Launch in 2024 for Meta Quest 2 and 3",
    "url": "https://www.cryptopolitan.com/taskmaster-vr-game-set-to-launch-in-2024/",
    "description": "In an exciting development for fans of the popular comedy panel show Taskmaster, a virtual reality (VR) game adaptation is on the horizon. Taskmaster has teamed up with Scallywag Arcade to bring the zany world of the show to VR headsets worldwide. Set to launch in 2024, the game, known as &#8220;Taskmaster VR,&#8221; promises an ... <a title=\"Taskmaster VR Game Set to Launch in 2024 for Meta Quest 2 and 3\" class=\"read-more\" href=\"https://www.cryptopolitan.com/taskmaster-vr-game-set-to-launch-in-2024/\" aria-label=\"More on Taskmaster VR Game Set to Launch in 2024 for Meta Quest 2 and 3\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-29T13:37:41.000Z",
    "title": "Solana Shines: SOL Token Surges Over 8% Amid Bullish Market Sentiment",
    "url": "https://www.crypto-news-flash.com/solana-shines-sol-token-surges-over-8-amid-bullish-market-sentiment/?utm_source=rss&utm_medium=rss&utm_campaign=solana-shines-sol-token-surges-over-8-amid-bullish-market-sentiment",
    "description": "<img width=\"1043\" height=\"575\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Jito\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana.jpg 1043w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana-300x165.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana-1024x565.jpg 1024w\" sizes=\"(max-width: 1043px) 100vw, 1043px\" />Solana (SOL) is one of the tokens leading a market bounceback and has registered 8 percent gains to trade back over the $60 mark for the first time in nearly two weeks. According to crypto analysts, the rise of SOL is down to the continued decoupling of the token from the FTX debacle and some [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-29T13:37:15.000Z",
    "title": "Binance with Challenges in Thailand Following Historic Settlement with U.S. DOJ.",
    "url": "https://www.crypto-news-flash.com/binance-with-challenges-in-thailand-following-historic-settlement-with-u-s-doj/?utm_source=rss&utm_medium=rss&utm_campaign=binance-with-challenges-in-thailand-following-historic-settlement-with-u-s-doj",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Binance faces regulatory hurdles in Thailand after landmark $4.3 billion U.S. legal settlement. Review ongoing, but Gulf Binance Co. remains confident with key regulatory approvals secured. Successful cryptocurrency exchange Binance is in the midst of a regulatory whirlwind as it attempts to establish operations in Thailand. A partnership with Gulf Energy Development to launch a [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-29T13:27:00.000Z",
    "title": "Grayscale Reports 24% Growth Sector Tracking NFTs, Web3 Games",
    "url": "https://coinedition.com/grayscale-reports-24-growth-sector-tracking-nfts-web3-games/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Grayscale-Introduces-Funding-Project-to-Manage-Financial-Products.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Grayscale Introduces Funding Project to Manage Financial Products\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Grayscale-Introduces-Funding-Project-to-Manage-Financial-Products.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Grayscale-Introduces-Funding-Project-to-Manage-Financial-Products-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Grayscale-Introduces-Funding-Project-to-Manage-Financial-Products-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Grayscale-Introduces-Funding-Project-to-Manage-Financial-Products-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Grayscale-Introduces-Funding-Project-to-Manage-Financial-Products-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Grayscale-Introduces-Funding-Project-to-Manage-Financial-Products-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent report, Grayscale noted that its Consumer and Culture Crypto Sector saw significant growth alongside major cryptocurrencies like Bitcoin. Crypto applications covered in the sector include entertainment, music, media, collectibles, sports, and art. Grayscale reported a 24% month-to-date growth in the sector as of November 27, 2023. The upward surge coincides with increased [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/grayscale-reports-24-growth-sector-tracking-nfts-web3-games/\">Grayscale Reports 24% Growth Sector Tracking NFTs, Web3 Games</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]