[
  {
    "source": "Cointelegraph",
    "date": "2023-10-31T22:54:39.000Z",
    "title": "3 things we might see from crypto as 2023 winds to an end",
    "url": "http://cointelegraph.com/news/3-things-crypto-2023-winds-end",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/127d9a0d-fb6b-48eb-a7cd-cf52bdb42df4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Don’t be surprised if we see more investment, more regulation and more artificial intelligence defining crypto during the last two months of 2023.</p>\n                    <p><p>As the holiday season approaches, anticipation in the cryptocurrency world heightens for the annual phenomenon known as the \"Santa rally.\" Amidst this festive period, market dynamics tend to shift. This season, there are several factors that could influence the last few months of the year.</p><h2>Institutional investment surge</h2><p><a href=\"https://cointelegraph.com/learn/what-is-a-cryptocurrency-a-beginners-guide-to-digital-money\">Cryptocurrency</a> prices spiked notably at the end of 2020 and 2021, driven by increased investor optimism and institutional interest. Major financial institutions and <a href=\"https://cointelegraph.com/news/the-emergence-of-cryptocurrency-hedge-funds\">hedge funds</a> began viewing Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) not just as a speculative asset but as a <a href=\"https://cointelegraph.com/explained/is-bitcoin-a-hedge-against-inflation\">hedge against inflation</a> and a potential store of value. Large companies like <a href=\"https://cointelegraph.com/news/square-bought-more-bitcoin-almost-doubling-its-holdings\">Square</a> and <a href=\"https://cointelegraph.com/news/microstrategy-expands-company-s-bitcoin-holdings-with-489m-purchase\">MicroStrategy added major Bitcoin holdings</a> to their balance sheets, further solidifying this image shift.</p><p>Additionally, <a href=\"https://cointelegraph.com/news/bitcoin-price-briefly-hits-69k-ath-before-plummeting-back-to-earth\">Bitcoin reached all-time highs</a>, igniting a positive sentiment throughout the market. Further, institutional investment was demonstrated when businesses like <a href=\"https://cointelegraph.com/news/moment-of-truth-tesla-purchase-is-the-moment-bitcoin-has-been-waiting-for\">Tesla made large-scale Bitcoin acquisitions</a> publicly known. Moreover, the introduction of a number of <a href=\"https://cointelegraph.com/news/what-is-a-cryptocurrency-etf-and-how-does-it-work\">cryptocurrency ETFs</a> and funds gave institutional investors a more convenient and familiar way to access the market.</p><p>Firms are catering to institutional investors looking for safe storage options for their cryptocurrency holdings in the quickly evolving financial landscape of 2022 by <a href=\"https://cointelegraph.com/news/state-street-backed-securrency-partners-with-gk8-for-custody-and-institutional-blockchain-infrastructure\">offering custody services</a>, which are essential for safeguarding digital assets.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-evolving-multi-asset-network\"><strong><em>Bitcoin is evolving into a multiasset network</em></strong></a></p><p>Despite some fluctuations, the trajectory was <a href=\"https://cointelegraph.com/news/microstrategy-subsidiary-adds-another-4-197-btc-to-balance-sheet\">generally upward in 2022</a>. Once skeptical, traditional financial institutions started to provide a variety of crypto services, such as lending, trading, and custody. Institutional actors have also recognized the emergence of <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> and <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a>, particularly <a href=\"https://cointelegraph.com/explained/venture-capital-financing-in-crypto-explained\">venture capital</a> firms and specialized funds searching for novel investment opportunities.</p><p>For example, <a href=\"https://cointelegraph.com/news/wall-street-mainstays-setting-up-digital-assets-exchange-with-on-chain-settlement\">prominent financial institutions collaborated</a> to establish EDX Markets (EDXM), a novel exchange designed for the trading of digital assets through reliable intermediaries. This platform will cater to both institutional and retail investors, ensuring a secure environment for digital asset trading. Noteworthy <a href=\"https://cointelegraph.com/news/wall-street-giants-back-edx-markets-cryptocurrency-exchange\">backers of this initiative</a> included renowned entities such as Charles Schwab, Fidelity Digital Assets, Paradigm, Sequoia Capital, Citadel Securities, and Virtu Financial, reinforcing the exchange's credibility and strength within the market.</p><p>In 2022, despite the <a href=\"https://cointelegraph.com/public/index.php/news/how-to-control-stress-and-depression-in-a-crypto-winter/amp\">crypto winter</a>, development in the crypto sector increased by 5%, indicating sustained interest in underlying technology. Additionally, a 2022 Celent survey <a href=\"https://www.celent.com/insights/189802044\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a> 91% of institutional investors are keen on investing in <a href=\"https://cointelegraph.com/learn/asset-tokenization\">tokenized assets</a>, highlighting strong demand.</p><p>The upcoming season might witness an even larger influx of institutional capital into the crypto domain, exemplified by entities like MicroStrategy, which is <a href=\"https://cointelegraph.com/news/microstrategy-adds-another-1-045-bitcoin-to-its-growing-crypto-treasury\">expanding its crypto holdings</a> by acquiring additional 1,045 Bitcoin for its growing treasury. Also, research by EY-Parthenon reveals that a majority of institutional investors <a href=\"https://www.ey.com/en_us/financial-services/how-institutions-are-investing-in-digital-assets\" target=\"_blank\" rel=\"noopener nofollow\">hold</a> a strong belief in the enduring value of blockchain technology and crypto assets, leading them to plan substantial scaling of digital asset investments over the next two to three years. </p><p>Moreover, there is a growing interest among investors to participate in <a href=\"https://cointelegraph.com/learn/tokenized-real-world-assets-rwa-in-defi\">tokenized financial assets</a>, prompting institutions to actively explore opportunities to tokenize their own assets in response to the evolving financial landscape. As the industry continues to mature and gain legitimacy, new financial products tailored specifically for institutional investors could emerge, further facilitating their entry into the market.</p><h2>Regulatory clarity</h2><p>In 2020, as the cryptocurrency market boomed, it inevitably <a href=\"https://cointelegraph.com/news/crypto-13-per-cent-of-applications-approved-british-regulator-discloses-crypto-registration-stats\">caught the attention of regulators worldwide</a>. Some nations responded by enacting complete prohibitions, but others adopted a more measured strategy and started the process of <a href=\"https://cointelegraph.com/news/the-us-has-already-lost-the-2020-crypto-regulation-race-to-europe\">developing regulatory frameworks</a> to monitor and control the rapidly expanding domain of digital assets. </p><p>In 2021, U.S. regulatory developments — particularly those pertaining to the SEC's position on cryptocurrencies — became central to the global narrative surrounding cryptocurrencies. The industry was alert due to the <a href=\"https://cointelegraph.com/news/sec-commissioner-says-safe-harbor-laws-would-ve-made-ico-problems-worse\">ongoing discussions</a> about cryptocurrency regulations and the push for approvals of <a href=\"https://cointelegraph.com/learn/bitcoin-etfs-a-beginners-guide-to-exchange-traded-funds\">Bitcoin ETFs</a>. Concurrently, there have been substantial market realignments and conversations regarding decentralization as a result of <a href=\"https://cointelegraph.com/news/china-s-crackdown-signals-an-oncoming-crypto-ban-bobby-lee-says\">China's crackdown on cryptocurrency mining and trading</a>.</p><p>The cryptocurrency regulatory environment began to evolve in 2022. After preliminary discussions, a number of nations established precise legislative frameworks with rules governing cryptocurrencies, <a href=\"https://cointelegraph.com/learn/initial-coin-offering\">initial coin offerings (ICOs</a>), and DeFi platforms. At the same time, there was a surge in the global movement to create <a href=\"https://cointelegraph.com/learn/what-are-cbdcs-a-beginners-guide-to-central-bank-digital-currencies\">central bank digital currencies (CBDCs)</a>, with many countries introducing or testing their own digital currencies.</p><p>This year, significant developments reshaped the global cryptocurrency landscape. For instance, Thailand’s Securities and Exchange Commission is poised to <a href=\"https://cointelegraph.com/news/thai-sec-wants-to-lift-restrictions-on-initial-coin-offerings\">ease restrictions on retail investments related to ICOs</a>, aiming to stimulate digital investments and foster market growth.</p><p>Meanwhile,the European Union took decisive action by <a href=\"https://cointelegraph.com/news/mica-good-bad-ugly-european-union-crypto-rules\">enacting the Markets in Crypto-Assets (MiCA) regulatory framework</a> in April 2023, ushering in a new era of comprehensive crypto regulations within the region.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/irs-proposes-unprecedented-data-collection-crypto-users\"><strong><em>IRS proposes unprecedented data-collection on crypto users</em></strong></a></p><p>A pivotal moment occurred in July 2023 when a ruling by U.S. Circuit Judge Analisa Torres affirmed Ripple's compliance with the law regarding XRP sales on public exchanges, marking a <a href=\"https://cointelegraph.com/learn/the-sec-vs-ripple-lawsuit-everything-you-need-to-know\">significant legal victory</a> for the cryptocurrency sector against U.S. regulators. However, she also clarified that Ripple had violated securities laws by offering XRP to hedge funds and institutional buyers.</p><p>In September, <a href=\"https://cointelegraph.com/news/lawmakers-call-sec-chair-approve-spot-bitcoin-etf\">four members of the United States Congress rallied</a> for immediate approval of spot Bitcoin listing by Securities and Exchange Commission Chair <a href=\"https://cointelegraph.com/learn/who-is-gary-gensler-regulating-crypto\">Gary Gensler</a>. As these events have unfolded, we’ve also seen growing anticipation of a <a href=\"https://cointelegraph.com/news/valkyrie-amends-spot-bitcoin-etf\">spot Bitcoin ETF</a>s. This potential milestone holds the prospect of introducing clearer regulatory frameworks, providing the cryptocurrency industry and investors with a more structured and defined trajectory ahead.</p><h2>The confluence of AI and Web3</h2><p>The <a href=\"https://cointelegraph.com/learn/web3-is-not-the-same-as-web-3-0\">convergence of Web3 and AI technology</a> started to dramatically alter the cryptocurrency environment in the waning months of 2020. Predictive analytics and AI-driven trading algorithms gained popularity, enabling institutional and individual investors to make data-driven choices in the erratic cryptocurrency market. With the use of this technology, market analysis was improved, allowing investors to predict price fluctuations and make the most of their trading tactics throughout the upswing.</p><p>The relationship between Web3 and <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/artificial-intelligence\">artificial intelligence (AI)</a> grew stronger in 2021. AI-powered DApps became more prevalent, providing innovative solutions in fields like NFTs and DeFi. The market gained momentum as a result of this integration, which made <a href=\"https://cointelegraph.com/learn/decentralized-finance-a-beginners-guide-to-earning-passive-income-with-defi\">yield farming</a>, and NFT creation and trading more effective. AI-driven sentiment analysis tools also played a crucial role, providing insights into market sentiment and trends, aiding investors in making informed decisions.</p><p>In 2022, we witnessed the maturation of AI and Web3 integration with projects like Aave using AI algorithms to streamline lending processes, Rarible’s use of AI to provide individualized NFT curation. These initiatives showcased secure, automated, and trustless transactions, boosting investor confidence.</p><p>The confluence of AI and <a href=\"https://cointelegraph.com/learn/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future\">Web3</a> is poised to redefine this Christmas season once again. AI algorithms will develop further, allowing for <a href=\"https://cointelegraph.com/news/defi-meets-ai-can-this-synergy-be-the-new-focus-of-tech-acquisitions\">proactive trading decisions</a> and real-time monitoring of market data. Web3 technologies are anticipated to support creative investment models and decision-making procedures, particularly in the areas of <a href=\"https://cointelegraph.com/learn/what-is-a-dao\">decentralized autonomous organizations (DAOs)</a> and AI-driven governance systems.</p><p>The incorporation of <a href=\"https://cointelegraph.com/innovation-circle/what-does-generative-ai-mean-for-web3\">AI-generated content</a> in crypto in the form of NFTs and AI-powered <a href=\"https://cointelegraph.com/learn/augmented-reality-vs-virtual-reality-key-differences\">virtual reality experiences</a> could be a driving force in the market in the months ahead. That enthusiasm could contribute to newfound liquidity in the markets, and development for the industry.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Guneet Kaur</strong> joined Cointelegraph as an editor in 2021. She holds a Master of Science in financial technology from the University of Stirling and an MBA from India’s Guru Nanak Dev University.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-31T22:56:43.000Z",
    "title": "SEC missed a step with its crypto safeguarding rule, U.S. government watchdog says",
    "url": "https://cryptoslate.com/sec-missed-a-step-with-its-crypto-safeguarding-rule-u-s-government-watchdog-says/",
    "description": "<p>The U.S. Government Accountability Office posted a complaint about a cryptocurrency-related bulletin from the country&#8217;s main securities regulator on Oct. 31. The accountability office said that the U.S. Securities and Exchange Commission (SEC) missed a key step when it issued guidance related to how companies should account for and disclose custodial obligations around safeguarding users&#8217; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-missed-a-step-with-its-crypto-safeguarding-rule-u-s-government-watchdog-says/\">SEC missed a step with its crypto safeguarding rule, U.S. government watchdog says</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-31T23:06:40.000Z",
    "title": "Floki and Bitget lock horns over TokenFi listing controversy",
    "url": "https://www.cryptopolitan.com/floki-bitget-lock-horns-over-tokenfi-listing/",
    "description": "The Floki protocol and Bitget crypto exchange have found themselves in a head-on collision over allegations of market manipulation. At the heart of this debacle is the mysterious TokenFi (TOKEN), a reward token that Floki recently introduced. Each side has pointed fingers at the other, using social media platforms and blog posts as battlefields. According ... <a title=\"Floki and Bitget lock horns over TokenFi listing controversy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-bitget-lock-horns-over-tokenfi-listing/\" aria-label=\"More on Floki and Bitget lock horns over TokenFi listing controversy\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-31T23:00:54.000Z",
    "title": "Cardano Bearish Signal: Dormant ADA Whales Are On The Move",
    "url": "https://www.newsbtc.com/news/cardano/cardano-dormant-ada-whales/",
    "description": "Cardano (ADA) may be turning bearish once more after whales began moving again. This activity was brought to light by the on-chain data tracker Santiment which showed unusual activity in dormant ADA wallets after the price crossed $0.3. Cardano Sharks And Whale Start Moving Coins In the report that was posted on X (formerly Twitter) by the on-chain data tracker, Cardano shark and whale addresses (that is addresses holding between 100,000 and 10 million ADA on their balances), as well as old coins, have been showing a lot of activity. Related Reading: Shiba Inu Burn Rate Nosedives Following 7,700% Jump, What Happened? Most of this activity could be detrimental to the current ADA recovery given that these large holders have been moving their previously dormant coins. The Santiment report shows that old ADA coins are moving back into circulation once more. Source: Santiment on X It showed that the crypto just marked its largest day of old coins being moved around. The last time that this metric was this high, as pointed out by the tracker, was back in April 2022, and historical performance does not spell good news following this. ADA price loses footing at $3 &#124; Source: ADAUSD on Tradingview.com What Happened To ADA Price Last Time? Back in April 2022 when a similar volume of old coins began moving back into circulation, it spelled doom for the ADA price. Looking at the chart in 2022 shows that ADA had finished out the month of March strong at a price of $1.21. However, once these coins began moving, it was game over. April 2022 saw the ADA price fall from $1.21 to $0.8 before the month was over, meaning a 33% drop in price. The downtrend would carry on into the later part of the year and by December 2022, the ADA price had fallen as low as $0.24. Related Reading: The End Is Near For Trellor (TRB): Crypto Analyst Says Prepare For 50% Drop If this were to repeat itself, then another 30% drop would send the ADA price below $0.1 in the coming month. This would take the price back to September 2020 levels. However, it is not all bad news for the digital asset given the activity of sharks and whales. In the same report, Sentiment revealed that Cardano sharks and whales have been buying up ADA rapidly. They had bought a total of 43.71 million ADA in the space of two weeks, now worth more than $131 million at the current price. This suggests bearish sentiment is limited given that large addresses are still accumulating coins. At this rate, whatever is being dumped on the open market by the dormant wallets will be picked up by the sharks and whales. As long as demand continues to match supply, then the sell-off could have next to a negligible effect on the price of ADA. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Shutterstock, chart from TradingView.com"
  }
]