[
  {
    "source": "Decrypt",
    "date": "2023-07-10T13:01:02.000Z",
    "title": "What is the Lightning Network? Bitcoin's Scalability Solution.",
    "url": "https://decrypt.co/resources/bitcoin-lightning-network",
    "description": "Lightning Network is a scaling solution that attempts to address Bitcoin's slow transaction speeds and high transaction costs."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-10T13:00:00.000Z",
    "title": "Implementing tokenized securities for regulatory compliance",
    "url": "https://cointelegraph.com/innovation-circle/implementing-tokenized-securities-for-regulatory-compliance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/b3636628-264f-4b15-974c-0539468231f8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>From enhancing investor protection to streamlining compliance processes, on-chain tokenized securities hold the potential to reshape the future of finance while maintaining adherence to regulatory frameworks. </p>\n                    <p><p>Tokenization, today, is no longer a buzzword but a phenomenon that needs more comprehension. Over the years, on-chain tokenized securities have gained acceptance among the big shots of the finance sector that want to leverage it for newer investment opportunities. </p> <p>As understood, converting traditional securities such as real estate assets, stocks, bonds, etc., into digital tokens over a blockchain is known as tokenized securities in the popular sense. </p> <p>Since they are programmable, tokenized securities enable the implementation of automated compliance rules and the execution of complex financial transactions.</p> <p>While we are at it, the idea that tokenized securities are used to bypass regulations is wrong. In reality, tokenization can help regulations work better by making things more transparent, automating compliance and keeping track of transactions. It can simplify regulatory processes and create a safer and more effective system for everyone involved. </p> <h2><strong>How can tokenized securities enable successful compliance? </strong></h2> <p>Blockchain’s immutability is valuable during audits and investigations, as it provides real-time visibility into transactions and ownership records. This enables regulators to monitor activities, identify frauds and ensure adherence to obligations.</p> <ul><li><strong>Streamlined reporting:</strong> This reduces the time and cost associated with manual reporting. This enables companies to stay compliant with reporting requirements and ensure that investors have access to timely and accurate financial information.</li><li><strong>Facilitates improved liquidity:</strong> It does this through faster settlements and automated trade execution. Traditional securities can have limited liquidity due to lengthy settlement periods and complex trading processes. </li><li><strong>Improved investor protection:</strong> It improves investor protection by providing greater transparency, reducing information asymmetry and enabling automated compliance measures. This helps mitigate fraudulent activities and ensures investors are better informed about the securities they hold.</li><li><strong>Enhanced data integrity: </strong>This helps prevent unauthorized alterations or tampering. This strengthens the accuracy and reliability of regulatory reporting, audits and investigations.</li><li><strong>Facilitate global regulatory harmonization:</strong> This can be achieved by establishing standardized compliance protocols and enabling interoperability between different regulatory frameworks. This can reduce regulatory fragmentation and enhance cross-border investment opportunities.</li><li><strong>Increased market efficiency:</strong> This can result in faster settlement times, enhanced liquidity and streamlined transferability. These benefits reduce transaction costs, mitigate counterparty risk and create a more fluid trading environment. </li></ul> <p>Moreover, regulatory frameworks embracing tokenized securities can foster innovation, attract more participants and cultivate opportunities for emerging business models. </p> <h2><strong>A quick run-through of the case studies</strong></h2> <p>The Monetary Authority of Singapore (MAS) has granted approvals for security token offerings (STOs) and <a href=\"https://www.mas.gov.sg/development/fintech/regulatory-sandbox\">established</a> a regulatory sandbox for blockchain-based financial services, fostering controlled experimentation. </p> <p>The European Commission’s whitepaper on distributed ledger technology (DLT) <a href=\"https://joinup.ec.europa.eu/collection/rolling-plan-ict-standardisation/blockchain-and-distributed-ledger-technologies\">proposes</a> regulatory measures to ensure compliance of DLT-based products and services with existing financial regulations. </p> <p>Additionally, the International Organization of Securities Commissions (IOSCO) acknowledges the potential of blockchain technology to enhance regulatory compliance in securities markets, as indicated in their <a href=\"https://www.iosco.org/library/pubdocs/pdf/IOSCOPD649.pdf\">report.</a></p> <p>These developments collectively reflect the increasing recognition and adoption of tokenized securities within regulatory frameworks worldwide.</p> <h2><strong>Regulatory compliance challenges resolved by tokenized securities</strong></h2> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://circle.cointelegraph.com/learn-more?utm_campaign=Coin&_ga=2.123197772.699257063.1649682515-719256619.1645538730\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <p>Tokenization offers enhanced transparency, automated compliance mechanisms and auditable transaction records, simplifying regulatory oversight. Additionally, tokenization enables efficient monitoring of ownership transfers, streamlined compliance checks and standardized protocols, facilitating cross-border regulatory harmonization and reducing administrative burdens.</p> <h3><strong>Know your customer (KYC) and anti-money laundering (AML) compliance</strong></h3> <p>One of the primary regulatory compliance challenges that financial institutions face is KYC and AML compliance. Tokenized securities can enable a seamless, transparent and immutable tracking of transactions and the ownership of assets. This can make it easier for institutions to comply with KYC and AML regulations.</p> <h3><strong>Cross-border transactions compliance</strong></h3> <p>Cross-border transactions often face a complex web of regulatory compliance challenges. Tokenized securities, being blockchain-based, can facilitate borderless transactions while complying with local regulations. This can help financial institutions to streamline their cross-border transactions.</p> <h3><strong>Securities regulations compliance</strong></h3> <p>Tokenized securities need to comply with securities regulations. However, the existing regulations often fail to consider the unique properties of blockchain-based securities. With tokenized securities, the compliance process can be simplified by automating regulatory checks and reporting, making it easier for financial institutions to comply with securities regulations.</p> <h3><strong>Fractional ownership compliance</strong></h3> <p>Tokenized securities enable fractional ownership, addressing the challenge of limited access due to high capital requirements. This promotes market inclusivity by allowing investors with lower capital amounts to participate in securities offerings. Additionally, tokenization facilitates automated compliance checks, simplifying regulatory compliance for financial institutions dealing with fractional ownership.</p> <h3><strong>Secondary market compliance</strong></h3> <p>The secondary market for traditional securities faces regulatory compliance challenges, such as trade matching and settlement. Tokenized securities can provide a transparent and efficient trading platform with automated compliance checks, making it easier for financial institutions to comply with secondary market regulations.</p> <h2><strong>On-chain tokenization has its share of challenges</strong></h2> <p>For example, complicated or sometimes unclear regulations discourage enterprises to go full throttle with on-chain tokenized products. The situation is no different in big markets such as the US, where the Securities and Exchange Commission (SEC) has yet to provide clear guidance on how tokenized assets should be regulated.</p> <p>Such regulatory uncertainty around tokenization discourages businesses to introduce on-chain tokenization in their portfolio. On top of it, the complexity increases when the business doesn’t have any prior experience in blockchain or they don’t have a tech partner to fill the gaps. </p> <p>Tokenization can involve a number of technical challenges, such as ensuring the security and reliability of the underlying blockchain network. These challenges complicate the implementation of tokenization in a way that meets regulatory requirements.</p> <p>Partnering with a blockchain consulting firm is a great start. A team proficient with tokenization and the underlying blockchains will foresee challenges around the flow of tokens and accurate recording of all transactions. The partner can also assist in hand-picking the right blockchain protocol for a fresh start. </p> <p>While in-house blockchain expertise is a temptation, it’s better done at the right time.</p> <h2><strong>Cracking the compliance code with tokenized securities </strong></h2> <p>Get ready for a seismic shift in regulatory compliance with the rise of tokenized securities. As they take the stage, traditional barriers will crumble, giving way to a future where compliance seamlessly blends with innovation. With tokenized securities leading the charge, expect a landscape that’s fortified with trust, efficiency and unprecedented opportunities. </p> <p><em>The information provided here is not legal advice and does not purport to be a substitute for the advice of counsel on any specific matter. For legal advice, you should consult with an attorney concerning your specific situation.</em></p> <p><em>Vikram Raj Singh is the CEO of <a href=\"https://www.antiersolutions.com/\">Antier Solutions</a>. </em></p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\" /> </div> </div> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://circle.cointelegraph.com/\"><em><strong>Learn more about Cointelegraph Innovation Circle and see if you qualify to join</strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-10T12:49:07.000Z",
    "title": "Sarah Silverman sues Meta and OpenAI for copyright violations ",
    "url": "https://cointelegraph.com/news/meta-and-open-ai-sued-for-copyright-violations-sarah-silverman",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/adc7bbf0-257b-4afd-80d8-39518d664d85.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Author Sarah Silverman and two others opened a lawsuit against OpenAI and Meta for using copyrighted work without permission to train their AI systems. </p>\n                    <p><p>The American comedian and author Sarah Silverman, along with two other authors Richard Kadrey and Christopher Golden, have filed lawsuits against Meta Platforms’ LLaMa and OpenAI’s ChatGPT over copyright infringement. </p><p><a href=\"https://s3.documentcloud.org/documents/23869675/kadrey-meta-complaint.pdf\" target=\"_blank\" rel=\"noopener nofollow\">Meta</a> and <a href=\"https://s3.documentcloud.org/documents/23869693/silverman-openai-complaint.pdf\" target=\"_blank\" rel=\"noopener nofollow\">OpenAI</a> are alleged to have used the plaintiffs’ content for training their respective artificial intelligence (AI) systems without obtaining any prior permission. </p><p>According to the court documents against Meta, many of the plaintiffs’ books under copyright appear in the dataset that “Meta has admitted to using to train LLaMA.”</p><p>Similarly, in the case against OpenAI, the lawsuit alleges that when ChatGPT generates summaries of the plaintiffs’ work it is an indication of the training via copyrighted content. </p><blockquote>“The summaries get some details wrong. This is expected since a large language model mixes together expressive material derived from many sources. Still, the rest of the summaries are accurate…” </blockquote><p>In order to obtain this data the suits claim that the companies retrieved the copyrighted data from what are known as “shadow libraries,” such as Bibliotik, Library Genesis, Z-Library, and others.</p><p><strong><em><u>Related: <a href=\"https://cointelegraph.com/news/japan-council-concern-ai-trained-copyright-material\">Japanese AI experts raise concern over bots trained on copyrighted material</a></u></em></strong></p><p>These shadow libraries are websites that use torrent systems to make books “available in bulk,\" says the lawsuit. Such sites are illegal and are unlike open-source data that comes from databases such as Gutenberg, which collects books that have copyrights that have run out. </p><blockquote>“These shadow libraries have long been of interest to the AI-training community because of the large quantity of copyrighted material they host.”</blockquote><p>Along with complaints about copyright infringement of their own personal work, the authors filed the complaint on behalf of a class of copyright owners across the United States whose works were also allegedly infringed. </p><p>Cointelegraph reached out to OpenAI and Meta for comment on the case, though neither responded prior to publication. </p><p>In May writers across the U.S. a part of the Writers Guild of America, took to the streets in an authorized strike -the first one in 15 years- which <a href=\"https://cointelegraph.com/news/hollywood-studios-reject-banning-ai-from-writer-s-rooms\">highlighted many issues</a> faced in the industry including the usage of AI.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/web3-gamer-ubisoft-sega-steam-ai-troubles-super-mario-crypto/\"><strong><em>Super Mario: Crypto Thief, Sega blockchain game, AI games rights fight — Web3 Gamer</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-10T12:56:25.000Z",
    "title": "DeFi Platform Arcadia Finance Hacked for $455K",
    "url": "https://cryptodaily.co.uk/2023/07/defi-platform-arcadia-finance-hacked-for-455k",
    "description": "<p>Another day, another DeFi hack. Arcadia Finance has reportedly been the victim of an exploit which allowed hackers to drain roughly $455,000. </p>\n<p>Decentralised finance (DeFi) platform Arcadia Finance has reportedly become the latest victim of a hack. Blockchain investigating firm PeckShields reported the exploit and said it was due to &ldquo;the lack of untrusted input validation.&rdquo;&nbsp;</p>\n\n<p dir=\"ltr\" lang=\"en\">#PeckShieldAlert Our community contributor has detected that @ArcadiaFi has been exploited on both #Ethereum and #Optimism for ~$455KThe exploiter on #Ethereum was frontrun by 0x5C75e94dD0Ab9c10BFd1B8073DafEF031D3c050dhttps://t.co/blGx5IEAkkThe exploiter on #optimism&hellip; pic.twitter.com/WDzF0XVcmL</p>\n&mdash; PeckShieldAlert (@PeckShieldAlert) July 10, 2023\n<p>\n\n</p>\n<p>PeckShields alerted about a code vulnerability that allowed a hacker to drain funds worth about $455,000 from Ethereum (darcWETH) and Optimism (darcUSDC) vaults. According to the firm, the code vulnerability lacked a validation mechanism to cross-check unverified inputs. It added, &ldquo;There is a lack of reentrancy protection, which allows for the instant liquidation to bypass the internal vault health check.&rdquo;</p>\n<p>PeckShields also reported the exploiter transferred roughly 179 ETH by bridging 148 ETH and swapping 59,000 USDC to crypto mixer Tornado Cash.</p>\nArcadia TVL Drops 76%\n<p>Following the hack, DeFiLlama reported that Arcadia&rsquo;s Total Value Locked (TVL) dropped by a staggering 76%, from $605,000 to $145,000.</p>\n<p>The exploit on Arcadia Finance comes only days after a $130 million hack on Multichain&rsquo;s MPC bridge platform.</p>\n<p>Observers noted $102 million worth of crypto was withdrawn from the Multichain Fantom bridge on the Ethereum side. $666,000 worth of Dogecoin (DOGE) and $5 million from Moonriver were also removed. An additional 7214 Wrapped Ether tokens, 1024 Wrapped Bitcoin, and $58 million worth of USDC tokens were drained from the Fantom bridge&rsquo;s Ethereum smart contract.</p>\nArcadia Acknowledges Exploit\n<p>Arcadia Finance acknowledged the exploit on their protocol but has yet to provide further information.</p>\n<p>The platform informed its users this morning that it had contacted the hacker.</p>\n\n<p dir=\"ltr\" lang=\"en\">We have initiated contact with the attacker. https://t.co/dh74gG90n6 https://t.co/O39Slsc1z5We will continue to work with our security partners, law enforcement, and the broader community to resolve this as best we can. Our number one priority is recovering funds for Arcadia&hellip;</p>\n&mdash; Arcadia Finance (@ArcadiaFi) July 10, 2023\n<p>\n\n</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-10T12:52:29.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Remains Near $30,000, as Traders Prepare for Key US Economic Data",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-remains-near-30000-as-traders-prepare-for-key-us-economic-data/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1457893238-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BTC Climbs Above $30,000, as Traders Prepare for Key U.S. Economic Data\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1457893238-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1457893238-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1457893238-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1457893238-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1457893238-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1457893238-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1457893238.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />After a recent slip, bitcoin moved back above $30,000 on Monday, ahead of a key week of U.S. economic data, with the headline being the inflation report. Inflation is expected to drop to 3.1% in June, which would be a nearly two-year low. Ethereum also slipped on Monday, remaining below $1,900. Bitcoin Bitcoin (BTC) started [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T12:46:34.000Z",
    "title": "Coinbase’s 50% surge amid ongoing SEC crypto war highlights advantage over Binance.US",
    "url": "https://www.cryptopolitan.com/coinbase-surges-50-amid-the-sec-crypto-war/",
    "description": "For a month now, Coinbase has been under SEC&#8217;s regulatory scrutiny. However, that does not seem to have a permanent damage effect on the crypto exchange. As a matter of fact, the recent surge in Coinbase&#8217;s (COIN) shares shows that the exchange has a better survival advantage over Binance.US. What a good week for Coinbase!! ... <a title=\"Coinbase&#8217;s 50% surge amid ongoing SEC crypto war highlights advantage over Binance.US\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-surges-50-amid-the-sec-crypto-war/\" aria-label=\"More on Coinbase&#8217;s 50% surge amid ongoing SEC crypto war highlights advantage over Binance.US\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T12:42:54.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.092. In the past 24 hours, it has seen a trading volume of $933,821 and its market capitalization stands at $35.14 million. Despite having a market dominance of 0.00%, the WRX price has experienced a decrease of 2.35% within ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-10T13:00:09.000Z",
    "title": "XRP FUD Spikes, Will This Trigger A Price Reversal?",
    "url": "https://www.newsbtc.com/altcoin/xrp-fud-spikes-will-this-trigger-a-price-reversal/",
    "description": "Data shows FUD related to XRP may be spreading on social media platforms right now, a sign that could potentially help the price reverse. XRP Social Dominance Has Spiked While The Price Has Been Declining According to data from the on-chain analytics firm Santiment, discussions around XRP have surged during the past day. The relevant indicator here is the &#8220;social volume,&#8221; which measures the total amount of unique social media text documents that are making mentions of a given cryptocurrency. The social media text documents here refer to a collection of posts, threads, and other forms of text-based data sourced from major platforms like Twitter, Reddit, Telegram, and 4chan. Since the metric only counts the &#8220;unique&#8221; number of such documents, it means that individual posts have the same weightage, regardless of how many times they mention the term (obviously, they will only be counted at all if they have at least one mention). This restriction has the benefit that a few posts with a large number of mentions of the asset can&#8217;t skew the social volume on their own. Thus, the indicator can provide us hints about the degree of discussion that a coin is receiving from the average social media users. Related Reading: Bitcoin Price Could Nosedive If It Continues To Struggle Below $31K Now, here is a chart that shows the trend in the XRP social volume over the past month: The value of the metric seems to have been quite high in recent days &#124; Source: Santiment on Twitter As displayed in the above graph, the XRP social volume has registered some high values during the past day or so. This would suggest that discussions around the cryptocurrency have become elevated in this period. In the chart, data for another indicator, &#8220;social dominance,&#8221; is also shown. This metric tells us what percentage of the combined social volume of the top 100 cryptocurrencies (by market cap) is being contributed by any individual coin. From the graph, it&#8217;s visible that the XRP social dominance has also observed a large spike recently. Naturally, this trend would suggest that the relative share of discussions on social media platforms related to this asset has gone up. Related Reading: Bitcoin Short-Term Holders Continue Exchange Inflows, But Price Holds On The implication here is that the latest social volume increase isn&#8217;t due to a general uplift in talks related to the cryptocurrency sector, but rather due to an increased interest in XRP specifically (if it was otherwise, the social dominance wouldn&#8217;t have changed too much even after the rise in the social volume). Since this high focus on the asset has come as the price has been declining, it would appear likely that these discussions are occurring due to the investors feeling fearful. Historically, markets have tended to move opposite to what the crowd is expecting, with the probability of such a reverse move going up as the investors assume a stronger opinion. So as a high amount of FUD is potentially going around among the XRP traders right now, the price may be able to benefit from this and experience a rebound. XRP Price At the time of writing, XRP is trading around $0.47, down 2% in the last week. Looks like the asset has observed a decline recently &#124; Source: XRPUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-10T13:00:55.000Z",
    "title": "Which Crypto Are Analysts Picking In 2023 – PancakeSwap, Lido Dao, or Tradecurve?",
    "url": "https://www.crypto-news-flash.com/which-crypto-are-analysts-picking-in-2023-pancakeswap-lido-dao-or-tradecurve/?utm_source=rss&utm_medium=rss&utm_campaign=which-crypto-are-analysts-picking-in-2023-pancakeswap-lido-dao-or-tradecurve",
    "description": "<img width=\"512\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T131516.358.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T131516.358.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-10T131516.358-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Institutional investors are returning to the crypto market, solidifying predictions of a major bull run in the second half of 2023. As in previous bull cycles, investors are keen on discovering the cryptos analysts are picking for the next bull cycle. In this article, we will discover the crypto analysts are picking between PancakeSwap (CAKE), [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-10T12:48:39.000Z",
    "title": "Ripple v. SEC: Law Veteran Supports Escrow Freeze for XRP, Adding Intrigue to the Case",
    "url": "https://www.crypto-news-flash.com/ripple-v-sec-law-veteran-supports-escrow-freeze-for-xrp-adding-intrigue-to-the-case/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-v-sec-law-veteran-supports-escrow-freeze-for-xrp-adding-intrigue-to-the-case",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/CBDC-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/CBDC-Ripple.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/CBDC-Ripple-300x158.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/CBDC-Ripple-1024x538.jpg 1024w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Experts have argued that the XRP&#8217;s vast real-world utility makes it a commodity rather than a security. The XRP market has an FDV of about $46.96 billion with Ripple holding the vast majority. The final ruling on SEC vs Ripple case is undeniably a huge turning point for the cryptocurrency market in the United States [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-10T13:01:00.000Z",
    "title": "Hong Kong Authorities Pursue Scammers in HK$1M Crypto Heist",
    "url": "https://coinedition.com/hong-kong-authorities-pursue-scammers-in-hk1m-crypto-heist/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Hong_Kong_accountant_swindled_out_of_HK1_million_in_digital_Tether-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Hong Kong authorities are pursuing a group of fraudsters involved in a cryptocurrency scam that resulted in an accountant losing HK$1 million (US$127,750). The incident occurred at a shop located in the basement of Chevalier House on Chatham Road South in Tsim Sha Tsui. Detectives are currently investigating whether the fraud syndicate specifically established the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/hong-kong-authorities-pursue-scammers-in-hk1m-crypto-heist/\">Hong Kong Authorities Pursue Scammers in HK$1M Crypto Heist</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-10T12:41:00.000Z",
    "title": "Voyager Digital Sees Significant Asset Withdrawals Exceeding $250M",
    "url": "https://coinedition.com/voyager-digital-sees-significant-asset-withdrawals-exceeding-250m/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Since_reopening_withdrawals_to_users_on_June_23_Voyager_has_seen-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto broker Voyager Digital is witnessing a significant outflow of funds, with withdrawals resuming after a year-long suspension. Creditors are swiftly moving to retrieve their money, resulting in a massive outflow exceeding $250 million. Having filed for Chapter 11 bankruptcy and halting investor withdrawals, Voyager Digital, a struggling crypto lender, recently reopened its withdrawal services [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/voyager-digital-sees-significant-asset-withdrawals-exceeding-250m/\">Voyager Digital Sees Significant Asset Withdrawals Exceeding $250M</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]