[
  {
    "source": "Decrypt",
    "date": "2023-10-26T02:48:52.000Z",
    "title": "AI-Generated Child Abuse Material Could ‘Overwhelm’ the Internet, UK Group Warns",
    "url": "https://decrypt.co/203327/ai-child-sexual-abuse-material-overwhelm-web-uk-internet-watch",
    "description": "The Internet Watch Foundation says over 20,000 AI-generated images were found on a single darkweb forum in just one month."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-26T02:58:28.000Z",
    "title": "Meta’s High-Stakes AI Spending Amidst Turbulent Advertising Market",
    "url": "https://www.cryptopolitan.com/metas-ai-spending-turbulent-advertising/",
    "description": "In a bold move, Meta Platforms Inc. has unveiled ambitious plans to allocate a substantial $30 billion to $35 billion for artificial intelligence infrastructure in the upcoming year, signaling a significant uptick from the current year&#8217;s target. This announcement, but, is not without its challenges, as Meta acknowledges the precarious nature of the advertising landscape, ... <a title=\"Meta&#8217;s High-Stakes AI Spending Amidst Turbulent Advertising Market\" class=\"read-more\" href=\"https://www.cryptopolitan.com/metas-ai-spending-turbulent-advertising/\" aria-label=\"More on Meta&#8217;s High-Stakes AI Spending Amidst Turbulent Advertising Market\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-26T03:00:32.000Z",
    "title": "Polygon’s POL Upgrade Live On Ethereum Mainnet, MATIC To $1?",
    "url": "https://www.newsbtc.com/news/polygon-pol-upgrade-ethereum-mainnet-matic-to-1/",
    "description": "After months of development and weeks after testnet deployment, the POL upgrade is now live on the Ethereum mainnet. According to an update on October 25, Polygon Labs, the team behind the Ethereum sidechain, Polygon, said the move is a milestone for the project. The team claims the release of POL &#8220;paves the way for the next series of milestones in the Polygon 2.0 roadmap.&#8221; Polygon 2.0 Taking Shape: What&#8217;s In Store? The Ethereum sidechain continues to build. Despite challenges in the last bear run, which saw MATIC, the platform&#8217;s native currency, drop below $1 before crashing to spot levels, the team announced the start of Polygon 2.0, reviving developer activity. The primary objective of the upgrade is to make the network more scalable, secure, and user-friendly. To achieve this, Polygon will leverage a new consensus mechanism, proof-of-stake liquidity (POSL), which the developer claims is more efficient.  Related Reading: Bitcoin Bounce Above $35,000 Puts Holder Profitability At Yearly Highs Notably, the team is developing key differences between this consensus system for Polygon 2.0. For instance, validators must stake their native tokens and liquidity to participate in the network.  The liquidity provided by participating validators will then be channeled to boost the liquidity of its decentralized exchanges (DEXes). Subsequently, once Polygon 2.0 goes live, exchanges running on the sidechain will be more liquid, meaning users can easily swap tokens in a low-fee, highly scalable environment.  Will MATIC Bulls Break $1? Moreover, POL will be critical for Polygon 2.0. With the token now being initiated on the Ethereum mainnet, Polygon Labs is jump-starting the process, setting the ball rolling for POL, which the team said will &#8220;power a vast ecosystem of ZK-based layer-2 chains.&#8221;  The team claims POL is a &#8220;hyperproductive token&#8221; primarily designed to power a multichain ecosystem. Besides, the token will be used to settle fees, and holders will participate in governance. At the same time, those who choose to stake it will be paid in the token.  Related Reading: Solana Epic Bounceback To Pre-FTX Heights: Brace Yourself For What’s Next Still, it is not clear whether this update will support MATIC prices in the long run. At present, the $1 psychological level remains elusive.  Looking at price charts, MATIC is already up 30% from October 2023 lows and continues to unwind losses. Moreover, bulls have reversed the dump of October 17 and continue to power higher.  From the daily chart, bull bars are banding along the upper BB, a volatility indicator. This suggests that the underlying momentum is building up, favoring optimistic buyers. Feature image from Canva, chart from TradingView"
  }
]