[
  {
    "source": "Cointelegraph",
    "date": "2023-06-19T19:30:00.000Z",
    "title": "Price analysis 6/19: SPX, DXY, BTC, ETH, BNB, XRP, ADA, DOGE, SOL, LTC",
    "url": "https://cointelegraph.com/news/price-analysis-6-19-spx-dxy-btc-eth-bnb-xrp-ada-doge-sol-ltc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/9bfdc25d-9ae4-4b61-92ba-10eeae499c01.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The strength in the S&P 500 and weakness in the U.S. dollar index could limit the short-term downside in Bitcoin and select altcoins. </p>\n                    <p><p>The S&amp;P 500 Index (SPX) has <a href=\"https://www.cnbc.com/2023/06/15/stock-market-today-live-updates.html\" target=\"_blank\" rel=\"noopener nofollow\">gained</a> for five consecutive weeks, the first such instance since November 2021. In comparison, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is trading well below its local high of $31,000 made on April 14. This shows a clear divergence between the performance of the two asset classes.</p><p>Some analysts expect Bitcoin’s range-bound action to continue for some more time. Cryptocurrency traders will be looking for some positive triggers that could push the price above the range. One such rumor floating in the markets is that after BlackRock filed for a Bitcoin spot exchange-traded fund, <a href=\"https://cointelegraph.com/news/bitcoin-price-this-week-fear-26k-key-5-things\">Fidelity Investments may also follow suit</a>. If that happens, it will be a positive sign for the markets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/47e632f4-304d-48ea-8308-f5eaf2f528ae.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>Another positive for the cryptocurrency markets has been that the United States dollar index (DXY) softened in the past week. Historically, the dollar index and Bitcoin have an inverse correlation, which may help limit the downside in Bitcoin and launch a relief rally.</p><p>Let’s look at the important resistance levels that need to be crossed to start a sustained recovery in Bitcoin and the major altcoins. Let’s analyze the charts to find out.</p><h2>S&P 500 Index price analysis</h2><p>The S&amp;P 500 Index is in a short-term uptrend. The rally of the past few days pushed the relative strength index (RSI) into the overbought territory, indicating that a minor correction or consolidation is possible.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/9ca161b2-a9ef-453a-8cf5-3ff9c76aaf3e.png\"  /><figcaption style=\"text-align: center;\"><em>SPX daily chart. Source: TradingView</em></figcaption></figure><p>The index could turn down and retest the breakout level of 4,325. If the price rebounds off this level, it will suggest that buyers have flipped 4,325 into support. That will enhance the prospects of a rally to 4,500 and thereafter to 4,650.</p><p>Contrary to this assumption, if the price turns down and breaks below the 20-day exponential moving average (4,283) it will suggest that the bullish momentum is weakening. That could pull the index to the 50-day simple moving average (4,180). Below this level, the advantage may tilt in favor of the bears.</p><h2>U.S. dollar index price analysis</h2><p>The failure of the bulls to sustain the U.S. dollar index back above the 20-day EMA (103) on June 12 accelerated selling. That pulled the index back below the 50-day SMA (102) on June 15.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/3000f6d6-2878-4c80-8323-52b4642daae4.png\"  /><figcaption style=\"text-align: center;\"><em>DXY daily chart. Source: TradingView</em></figcaption></figure><p>The 20-day EMA has started to turn down and the RSI is in the negative territory, indicating that bears have the upper hand. Sellers will try to sink the price to the crucial support at 100.82. A break and close below this level will signal the resumption of the downtrend.</p><p>Contrarily, if buyers quickly push the price back above the moving averages, it will suggest that the index could rise to the downtrend line. Buyers will have to drive the price above this level to open the gates for a possible rally to 106.</p><h2>Bitcoin price analysis</h2><p>Bitcoin has been correcting inside the descending channel pattern for the past several weeks.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/22cd7768-6dfa-413c-ba21-b4119c0bd8c3.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The 20-day EMA ($26,389) is flattening out and the RSI has climbed to the midpoint, indicating that the selling pressure could be reducing. Buyers will try to push the price to the resistance line of the channel. This is an important level for the bears to defend because a break and close above it could start a new up-move.</p><p>Alternatively, if the price turns down sharply from the current level, it will suggest that bears continue to sell on rallies. The BTC/USDT pair could then retest the strong support zone between $25,250 and $24,800.</p><h2>Ether price analysis</h2><p>Ether’s (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) attempt to start a recovery is facing selling at the 20-day EMA ($1,766) but a minor positive is that the bulls have not allowed the price to slip back below $1,700.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/bb245a2c-778a-4c40-9111-01f30f1e3606.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: TradingView</em></figcaption></figure><p>If the price turns up from $1,700, the ETH/USDT pair will again attempt to rally above the 20-day EMA. If that happens, it will suggest that the short-term corrective phase may be over. The pair may first rise to $1,928 and subsequently to $2,000.</p><p>Contrarily, if the price turns down from the current level and breaks below $1,700, it will indicate that bears remain in command. There is a minor support at $1,600 but if this level gets taken out, the pair may plunge to $1,352.</p><h2>BNB price analysis</h2><p>BNB’s (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) relief rally is facing selling at the 38.2% Fibonacci retracement level of $252.50 but a positive sign is that the bulls have not given up much ground.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/17bc2097-65a1-4fae-b422-03019b4bbeb9.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls will again try to thrust the price above the overhead resistance zone between $252.50 and the 20-day EMA ($259). If they can pull it off, the BNB/USDT pair may climb to the 61.8% retracement level of $272.50. The bears are expected to fiercely protect this level.</p><p>Contrary to this assumption, if the price turns down from the current level or the overhead resistance, it will suggest that the bears are not ready to give up their hold. The pair could then once again drop to the critical support at $220.</p><h2>XRP price analysis</h2><p>The bears repeatedly pulled XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) below the 50-day SMA ($0.47) between June 14 and 17 but they could not sustain the lower levels. This suggests buying on dips.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/48713ecf-1566-437e-bf88-685a6b501b44.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls are trying to push the price above the 20-day EMA ($0.49). If they achieve that, it will indicate that the XRP/USDT pair may swing between the 50-day SMA and $0.56 for some more time. The flattening 20-day EMA and the RSI near 50 also point to a possible consolidation in the short term.</p><p>If bears want to remain on top, they will have to quickly tug the price below $0.45. That could accelerate selling and sink the pair to $0.41.</p><h2>Cardano price analysis </h2><p>The bulls are struggling to start a relief rally in Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) even though the RSI is at deeply oversold levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/4108fce2-2ac4-4a1e-8d2e-ca6c78d4267c.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bears are trying to sink the price to the vital support at $0.24. This is an important support to keep an eye on because if it cracks, the ADA/USDT pair may skid to $0.22 and then extend the decline to $0.20.</p><p>Buyers are likely to have other plans. They will try to guard the zone between $0.24 and $0.22 with vigor. If the price turns up from this zone, it will suggest that the pair may consolidate between $0.24 and $0.30 for a while. The first sign of strength will be a break and close above the 20-day EMA ($0.30).</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/why-is-cardano-price-down-today\"><em>Why is Cardano price down today?</em></a></p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) has been trading inside a tight range between the 20-day EMA ($0.06) and the horizontal support at $0.06 for the past few days.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/511e17b4-8073-412e-8764-2c25ed22ab0a.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The failure of the DOGE/USDT pair to rise above the 20-day EMA suggests that the sentiment remains negative and the bears are selling on every minor rally. That increases the risk of a break below the vital support at $0.06. If this level gives way, the pair may collapse to $0.05.</p><p>On the upside, the 20-day EMA remains the key hurdle for the bulls to cross. If they sustain the price above this resistance, the pair could rally to $0.08. This level may pose a strong challenge to the bulls.</p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) is witnessing a tough battle near the $15.28 level. Buyers pushed the price above this level but they have not been able to overcome the barrier at $16.18. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/eedb177e-403f-4008-bc19-575373c1043c.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bears are trying to sink the price below $15.28. If they do that, the SOL/USDT pair could slide to $14.06 and later to the support at $12.80. This is an important level to watch out for because if it breaks down, the pair may tumble to $10.</p><p>The first sign of strength will be a break above the zone between $16.18 and the 20-day EMA ($17.03). That could clear the path for a potential retest of the breakdown level of $18.70. This level is likely to attract strong selling by the bears.</p><h2>Litecoin price analysis</h2><p>The bulls are trying to keep Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) above the immediate support at $75, which suggests that lower levels are being bought.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/a93650e7-232d-47c8-96e1-8dfe1c494066.png\"  /><figcaption style=\"text-align: center;\"><em>LTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls will try to push the price to the overhead resistance at the 20-day EMA ($81). This level is likely to witness strong selling by the bears as they will try to maintain their control. If the price turns down from the current level or the 20-day EMA, it will open the doors for a possible retest of the support zone between $75 and $70.</p><p>Contrary to this assumption, if bulls shove the price above the 20-day EMA, it will indicate that the bears may be losing their grip. The LTC/USDT pair could then rally to $90.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-19T19:20:00.000Z",
    "title": "UK government moves forward on financial markets bill for potential regulation of crypto",
    "url": "https://cointelegraph.com/news/uk-government-financial-markets-bill-crypto-regulation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/d14dc7f2-ce32-4f81-8d1d-5dc637ff71e5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Following a third reading in the House of Lords, the Financial Services and Markets Bill will return to the lower house of the U.K. Parliament for members to consider any changes.</p>\n                    <p><p>Lawmakers in the upper house of the Parliament of the United Kingdom are moving forward with legislation that could help support the adoption of crypto in the country.</p><p>In a meeting of the U.K. Parliament’s House of Lords on June 19, many members <a href=\"https://www.parliamentlive.tv/Event/Index/e6769c7e-cfa3-4e11-ae05-1cd2736a4831\" target=\"_blank\" rel=\"noopener nofollow\">advocated</a> for the passage of the Financial Services and Markets Bill — legislation aimed at strengthening the country’s financial services industry. The bill went through a third reading in the House of Lords, one of the final stages in passage before considering any additional amendments and being signed into law.</p><p>According to lawmakers, the June 19 proceedings were part of a plan to “<a href=\"https://www.parliament.uk/business/news/2023/january-2023/financial-services-and-markets-bill-in-the-lords/\" target=\"_blank\" rel=\"noopener nofollow\">tidy up</a>” the bill in an effort “to ensure it is effectual.” It will go back to the lower house of the U.K. Parliament, the House of Commons, where members can consider any changes proposed by the upper house.</p><p>“This bill delivers the outcomes of the future regulatory framework review, giving the regulators significant new rulemaking responsibilities, whilst balancing that additional responsibility with clear accountability, appropriate democratic input, and transparent oversight,” said Baroness Joanna Penn. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/HouseOfLords?src=hash&amp;ref_src=twsrc%5Etfw\">#HouseOfLords</a> conducts ‘tidy up’ of the <a href=\"https://twitter.com/hashtag/FinancialServicesBill?src=hash&amp;ref_src=twsrc%5Etfw\">#FinancialServicesBill</a> from 3.15pm before it is returned to <a href=\"https://twitter.com/HouseofCommons?ref_src=twsrc%5Etfw\">@HouseOfCommons</a> to consider Lords changes.<br><br> Find out more <a href=\"https://t.co/kZYuE22bId\">https://t.co/kZYuE22bId</a><br><br> Watch online <a href=\"https://t.co/MXe7B0XhMX\">https://t.co/MXe7B0XhMX</a> <a href=\"https://t.co/hPec0CXTm1\">pic.twitter.com/hPec0CXTm1</a></p>&mdash; House of Lords (@UKHouseofLords) <a href=\"https://twitter.com/UKHouseofLords/status/1670754069437136896?ref_src=twsrc%5Etfw\">June 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-cancels-registration-in-the-uk-amid-regulatory-scrutiny\"><strong><em>Binance cancels registration for inactive business in the UK</em></strong></a></p><p>First introduced to the U.K. Parliament in July 2022, the Financial Services and Markets Bill was <a href=\"https://cointelegraph.com/news/uk-financial-markets-bill-authorizes-regulation-of-stablecoins-service-providers\">aimed at ensuring the country</a> maintained its place in the financial world following Brexit. The original version of the bill <a href=\"https://publications.parliament.uk/pa/bills/cbill/58-03/0146/220146lp.pdf\" target=\"_blank\" rel=\"noopener nofollow\">included</a> granting authority on digital asset regulation, while the most recent amendments from the House of Lords seemingly did not include any changes relevant to the crypto industry.</p><p>Regulation of cryptocurrencies globally seems to be impacting where firms choose to do business. United States authorities have cracked down on both Coinbase and Binance, leading to the two exchanges becoming entangled in legal filings amid their ongoing business. Some companies, including Bybit, have <a href=\"https://cointelegraph.com/news/crypto-exchange-bybit-exits-canada-citing-recent-regulatory-development\">announced their departure</a> from Canada as well, specifically citing regulatory developments. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/us-enforcement-agencies-turning-up-heat-crypto-related-crime/\"><strong><em>US enforcement agencies are turning up the heat on crypto-related crime</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T19:36:00.000Z",
    "title": "VeChain Price Prediction 2023-2031: What’s the Growth Potential of VET?",
    "url": "https://www.cryptopolitan.com/vechain-price-prediction/",
    "description": "VeChain Price Prediction 2023-2032 Since its launch, Vechain’s focus has been building technologies that solve obstacles impeding the mass adoption of blockchain technology. Two mnths ago, one of the most important pieces of technology in this mission was officially launched — VORJ. VORJ is a no-code Web3-as-a-Service platform that enables anyone to create, deploy and ... <a title=\"VeChain Price Prediction 2023-2031: What&#8217;s the Growth Potential of VET?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/vechain-price-prediction/\" aria-label=\"More on VeChain Price Prediction 2023-2031: What&#8217;s the Growth Potential of VET?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T19:28:17.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T19:23:14.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? The live Aave price is $51.37, with a 24-hour trading volume of $30,458,543. AAVE is down by 1.03% in the last 24 hours. The current CoinMarketCap ranking is #49, with a live market cap of $741,155,594. It has a circulating supply of 14,434,127 AAVE coins and a max. Supply of ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T19:14:32.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-19T19:36:25.000Z",
    "title": "Binance announces support for USDC deposit and withdrawal via Arbitrum",
    "url": "https://crypto.news/binance-announces-support-for-usdc-deposit-and-withdrawal-via-arbitrum/",
    "description": "Binance crypto exchange has announced support for direct deposit and withdrawal of the USDC stablecoin via the Arbitrum network. "
  }
]