[
  {
    "source": "Crypto Briefing",
    "date": "2024-01-25T00:45:11.000Z",
    "title": "Rising attention on PYTH staking as airdrop fever hits the market",
    "url": "https://cryptobriefing.com/rising-attention-pyth-staking-airdrop-fever-hits-market/?utm_source=feed&utm_medium=rss",
    "description": "Users flock to PYTH staking, motivated by guides on X about qualifying for multiple airdrops of different dApps."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-25T01:04:50.000Z",
    "title": "Bitwise Leads the Way as First US Bitcoin ETF to Publicly Disclose Wallet Address",
    "url": "https://news.bitcoin.com/bitwise-leads-the-way-as-first-us-bitcoin-etf-to-publicly-disclose-wallet-address/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/bitwise-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitwise Leads the Way as First US Bitcoin ETF to Publicly Disclose Wallet Address\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/bitwise-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bitwise-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bitwise-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bitwise-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bitwise-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bitwise-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/bitwise.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Wednesday, Jan. 24, 2024, Bitwise, a leading digital asset manager, made a groundbreaking announcement as the first U.S. spot bitcoin exchange-traded fund (ETF) to reveal its bitcoin wallet address. Emphasizing its commitment to transparency, Bitwise stated, &#x201C;proud to walk the walk with BITB,&#x201D; and affirmed that &#x201C;onchain transparency is core to Bitcoin&#x2019;s ethos.&#x201D; Bitwise [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-25T01:00:26.000Z",
    "title": "Solana Unveils Token Extensions As SOL Bounces Back, Surging 5%",
    "url": "https://www.newsbtc.com/news/solana/solana-unveils-token-extensions-as-sol-bounces-back-surging-5/",
    "description": "The Solana Foundation, a non-profit organization dedicated to decentralization, adoption, and security on the Solana network, has launched token extensions.   Solana Token Extensions Gains Traction According to a January 24 announcement, token extensions provide developers, enterprises, financial institutions, and Solana-native development teams with a comprehensive suite of turnkey solutions for advanced token functionality. Anatoly Yakovenko, co-founder of Solana and CEO of Solana Labs, commented on the launch, stating:  Token extensions build on the characteristics that make Solana the ideal destination for developers. Solana is the first network to offer this level of integrated developer and user experience in a single token program. We&#8217;re already seeing the potential to build using token extensions via deployments from some of the most recognizable names in crypto. Related Reading: Bitcoin Goes To The Doctor: 5 Key Metrics For BTC In 2024 Industry giants Paxos and GMO-Z.com Trust Company Inc. (GMO Trust) are leading the way in adopting token extensions. As announced by the Solana Foundation, these companies are “leveraging the benefits” of token extensions to issue stablecoins on the Solana blockchain.  As previously reported, Paxos, a regulated blockchain and tokenization infrastructure platform, expanded its stablecoin issuance to the network in December. Similarly, GMO Trust announced the launch of the first regulated Japanese yen stablecoin and their own US dollar stablecoin on the Solana network.  New Standards For Blockchain Compliance?  Sheraz Shere, Head of Payments at the Solana Foundation, emphasized the appeal of the Solana network for enterprise-grade companies entering the web3 space. Shere stated:  Companies like Visa, Worldpay, Stripe, Google, and Shopify have already seen the performance advantages inherent to the Solana network and have launched solutions and applications that are only possible on Solana. With token extensions, we are expanding what is possible for enterprise adoption of blockchain by natively enabling features that matter to large regulated enterprises. Token extensions, designed to cater to builders across diverse industries such as stablecoins, real-world assets (RWA), and payments, offer a range of interesting features: Transfer Hooks: Enables token issuers to exert control over token interactions, empowering developers to create intricate and flexible token mechanisms. Transfer Fees: Provides the ability to charge fees for each token transfer, offering sustainable revenue models for different types of tokens built using token extensions. Confidential Transfers: Utilizes zero-knowledge proofs to encrypt the transfer amount while publicly sharing the source, destination, and token type. This ensures compliance while preserving privacy. Permanent Delegate Authority: Grants token issuers absolute authority over their tokens, particularly for those requiring revocation ability, such as licenses or credentials. Non-transferability: Restricts token transfers to the issuer only, making it ideal for unique user identification and credentialing purposes. Related Reading: Crypto Carnage: OKB Flash Crash Wipes 25% Off Value In Minutes – Here’s What Happened Ultimately, with the launch of token extensions, Solana aims to position itself as a force in blockchain development, offering builders the tools to create new applications across various industries.  The SOL token experienced a sharp drop of over 28% in the past 30 days, leading to a decline to the $79 level. However, the token has recovered in the past 24 hours with a 5% bounce, leading to a current trading price of $87. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-25T01:00:46.000Z",
    "title": "Trio of Crypto Analysts Flip Bearish on Solana, Unanimously Agree on Downside Price Target for SOL",
    "url": "https://dailyhodl.com/2024/01/24/trio-of-crypto-analysts-flip-bearish-on-solana-unanimously-agree-on-downside-price-target-for-sol/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/trio-solana-flip.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/trio-solana-flip.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/trio-solana-flip.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/trio-solana-flip.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/trio-solana-flip.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/trio-solana-flip.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/trio-solana-flip.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A trio of traders believe that the smart contract platform Solana (SOL) will head to much lower prices before regaining bullish momentum. Starting with pseudonymous crypto analyst Bluntz, the analyst tells his 237,900 followers on the social media platform X that SOL appears to be mirroring Bitcoin&#8217;s (BTC) late 2018 price action when it collapsed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/24/trio-of-crypto-analysts-flip-bearish-on-solana-unanimously-agree-on-downside-price-target-for-sol/\">Trio of Crypto Analysts Flip Bearish on Solana, Unanimously Agree on Downside Price Target for SOL</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]