[
  {
    "source": "CryptoSlate",
    "date": "2024-02-26T22:05:09.000Z",
    "title": "Bitcoin reclaims $54k two years after painful crash at the start of winter",
    "url": "https://cryptoslate.com/bitcoin-reclaims-54k-two-years-after-painful-crash-at-the-start-of-winter/",
    "description": "<p>Bitcoin (BTC) surged 6% on Feb. 26 to a new two-year high of $54,910 after US markets began trading, an indication of rising interest in the flagship crypto from retail and institutional investors. Bitcoin was trading at roughly $54,650 as of press time, up 5.6% on a daily basis, with a market cap of $1.07 [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-reclaims-54k-two-years-after-painful-crash-at-the-start-of-winter/\">Bitcoin reclaims $54k two years after painful crash at the start of winter</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-26T22:00:26.000Z",
    "title": "Will Worldcoin End In “Tears”? This Analyst Thinks So",
    "url": "https://www.newsbtc.com/news/worldcoin-end-in-tears-this-analyst-thinks-so/",
    "description": "One analyst on X is concerned about the long-term sustainability of Worldcoin (WLD), a project aiming to build a universal digital identity system. While acknowledging the project&#8217;s innovative approach and recent upswing that has seen WLD more than 4X, the analyst thinks &#8220;Worldcoin will end in tears.&#8221; FDV Versus Market Cap Soars Doubt: A Massive Price Dump Incoming? In a post, the analyst points to a significant discrepancy between Worldcoin&#8217;s fully diluted valuation (FDV) of $82.1 billion and its current market capitalization of around $1.1 billion, as seen from CoinMarketCap. To compare, Ethereum (ETH), the most valuable altcoin, has an FDV of $369 billion, slightly less than the current market cap of around $362.1 billion. The FDV shows the hypothetical market cap if all coins or tokens were in circulation. On the other hand, the market cap shows the total valuation of coins in circulation. Typically, the higher the FDV, the higher the chance of the coins in circulation being diluted when locked assets are released. Prices will likely take a hit with the deluge of coins hitting the secondary markets. The sell-off would especially be intense if demand doesn&#8217;t increase proportionally. Related Reading: Solana Poised For Major Comeback – Analysts Spot Breach Of $103 In Worldcoin&#8217;s case, the massive difference between FDV and the current market cap portends possible price dumps should a considerable chunk of WLD be released. And this will likely be the case, especially in light of what&#8217;s expected in the coming weeks. A breakdown of its tokenomics shows that besides coins airdropped to users, a big chunk was allocated to venture capital firms and individuals like Alameda Research and Three Arrows Capital (3AC). Token Unlocks data show that more WLD will be unlocked in less than five months. The release, observers note, could heap pressure on the coin, possibly pushing it lower from the current valuation. Worldcoin Is Expanding, Will WLD Bulls Succeed? Worldcoin plans to release a universal digital identity system. This solution will run on the blockchain and, to a small degree, rely on artificial intelligence (AI). Although the project faced regulatory challenges in multiple countries, including Kenya, Worldcoin recently expanded into Singapore.  Related Reading: XRP Price Soars: Analyst Predicts Surge Beyond $200 Even so, the analyst is concerned that the lack of demand-side drivers, specifically adoption, could slow down the uptrend. WLD is in a sharp uptrend, looking at the development in the daily chart. If the coin stays above $6, WLD could soar in the coming sessions. Feature image from Shutterstock, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-26T22:04:19.000Z",
    "title": "Mysterious ‘Mr. 100’ Quietly Buying Bitcoin in Massive Quantities, Say On-Chain Analysts – Here’s Who the Entity Might Be",
    "url": "https://dailyhodl.com/2024/02/26/mysterious-mr-100-quietly-buying-bitcoin-in-massive-quantities-say-on-chain-analysts-heres-who-the-entity-might-be/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/bitcoin-buyer-100.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/bitcoin-buyer-100.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/02/bitcoin-buyer-100.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/bitcoin-buyer-100.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/bitcoin-buyer-100.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/bitcoin-buyer-100.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/02/bitcoin-buyer-100.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>On-chain analysts are trying to figure out who owns a Bitcoin wallet that&#8217;s accumulating huge amounts of BTC at a relentless pace. The unknown entity dubbed &#8220;Mr. 100&#8221; has bought 100 BTC nearly every day including weekends since February 14th – accumulating a total of 3806.54 BTC worth $207,996,959 in that brief time frame. Zooming [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/26/mysterious-mr-100-quietly-buying-bitcoin-in-massive-quantities-say-on-chain-analysts-heres-who-the-entity-might-be/\">Mysterious &#8216;Mr. 100&#8217; Quietly Buying Bitcoin in Massive Quantities, Say On-Chain Analysts – Here&#8217;s Who the Entity Might Be</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]