[
  {
    "source": "CoinDesk",
    "date": "2023-06-09T20:27:21.000Z",
    "title": "Where the Mt. Gox Money Went: New Details in the BTC-e Exchange Case",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/09/where-the-mt-gox-money-went-new-details-in-the-btc-e-exchange-case/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Fresh court documents detail how two administrators of the now-defunct BTC-e exchange stole and laundered bitcoin from Mt.Gox, the hacked bitcoin exchange."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-09T20:30:00.000Z",
    "title": "US Justice Department charges two men in Mt. Gox Hack",
    "url": "https://cointelegraph.com/news/us-justice-department-charges-two-men-in-mt-gox-hack",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/3bed38ba-44c7-4f60-8f69-f87191fbbd99.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Justice Department claims Alexey Bilyuchenko and Aleksandr Verner took control of a Mt. Gox server and stole 647,000 Bitcoin from the exchange.</p>\n                    <p><p>The United States Justice Department has <a href=\"https://www.justice.gov/opa/pr/russian-nationals-charged-hacking-one-cryptocurrency-exchange-and-illicitly-operating-another\" target=\"_blank\" rel=\"noopener nofollow\">unsealed</a> charges against two men it says are responsible for the $400 million hack of former Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange Mt. Gox. According to the announcement, 43-year-old Alexey Bilyuchenko and 29 year old Aleksandr Verner allegedly conspired to launder 647,000 BTC they stole from Mt. Gox through a hack of the exchange’s servers. </p><p>Bilyuchenko is also charged with conspiring to operate the BTC-e exchange, which was <a href=\"https://cointelegraph.com/news/bitcoin-exchange-btc-e-still-offline-as-laundering-theories-begin-to-surface\">shut down in 2017</a> due to money laundering allegations.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The DOJ unsealed charges related to the 2011 hack of the cryptocurrency exchange Mt. Gox and the operation of the illicit cryptocurrency exchange BTC-e.<br><br>Alexey Bilyuchenko, 43, and Aleksandr Verner, 29, both Russian nationals, are charged with conspiring to launder approximately…</p>&mdash; db (@tier10k) <a href=\"https://twitter.com/tier10k/status/1667184706066997252?ref_src=twsrc%5Etfw\">June 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Prosecutors claim the hack occurred over a period of more than a year, from September 2011 until at least May 2014. During this time, the two men allegedly gained control of a Mt. Gox server located in Japan. They then proceeded to periodically make transfers of BTC from Mt. Gox to themselves, until the “vast majority” of customers’ BTC had been drained from the exchange.</p><p>After gaining possession of these Bitcoin, the men attempted to sell them through another exchange they controlled. To facilitate these sales, the two men entered into an allegedly fraudulent contract with a Bitcoin brokerage firm located in New York. The brokerage firm purchased the stolen BTC from the hackers by sending wire transfers to various offshore bank accounts. The Bitcoins themselves were left in the possession of the hackers’ exchange, but were credited to the brokerage firm’s account within it.</p><p>The announcement does not say whether BTC-e was the exchange used in the fraudulent deal, instead referring to the exchange used as “Exchange-1.” Prosecutors claim that the pair received approximately $6.6 million from the deal.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/mt-gox-repayment-registrations-closed-here-s-what-s-next\"><strong>Mt. Gox repayment registrations close: Here’s what’s next</strong></a></em></p><p>Mt. Gox was one of the first major cryptocurrency exchanges. It filed for bankruptcy in March 2014 after claiming the hack pushed it into insolvency.</p><p>BTC-e operated from 2011 to 2017. In 2017, the FBI <a href=\"https://cointelegraph.com/news/fbico-btc-e-considers-debt-tokens-and-ico-to-repay-users\">liquidated some of its cryptocurrency</a>, claiming that the funds were earned through money laundering. BTC-e’s founder, Alexander Vinnik, is currently serving prison time for his connection with the exchange. In May, Vinnik's attorney attempted to <a href=\"https://cointelegraph.com/news/btc-e-founder-seeks-prisoner-swap-deal-for-detained-wsj-journalist-report\">get him released</a> as part of a prisoner swap with the Russian Federation.</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-09T20:25:59.000Z",
    "title": "Real-World Asset protocols outperform DeFi blue-chips due to tokenization wave",
    "url": "https://cointelegraph.com/news/real-world-asset-protocols-outperform-defi-blue-chips-due-to-tokenization-wave",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/ba164002-b5c3-471b-929f-ae6aa0f14a56.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Traditional finance companies are boosting their engagement with Ethereum-based real-world asset protocols, resulting in RWAs outperforming DeFi blue chips.  </p>\n                    <p><p>Real-world asset (RWA) protocols have become a hot trend within DeFi circles.</p><p>A real-world asset (RWA) protocol is a decentralized application that allows entities to tokenize and trade real-world assets. These assets range from stocks and government bonds to real estate and commodities. They are also known as asset tokenization protocols.</p><p>DeFi provides certain advantages over TradFi by making the smart contracts transparent and enabling a wide degree of financialization of these assets by making them divisible, transferable, and tradable on decentralized platforms.</p><p>The top uncollateralized lending protocols for institutions in TrueFi and Maple increased by 26.6% and 117.8% in 2023. Centrifuge, a real-world asset tokenization platform, surged by 32% year-to-date.</p><p>In comparison, the gains recorded by the DeFi pulse index (DPI) in the same period was 13%. Whereas, Glassnode’s index of DeFi blue-chip tokens lost 7% since the year’s start.</p><p>Recent data from Nansen found that the governance tokens of RWA protocols surged significantly in January and April thanks to the rising interest in them.</p><p>Previously, experts had <a href=\"https://cointelegraph.com/news/defi-needs-more-tangible-assets-on-chain-to-see-a-successful-future\">suggested</a> that many “DeFi veterans have already implemented RWA-based strategies, however, the lack of sufficient RWA on-chain severely hinders the ecosystem development.”</p><p>This is changing due to increased tokenization of real-world assets.</p><h2>TradFi interest boost RWA activity</h2><p>The top RWA protocol by total locked value, Ondo Finance, is a DeFi platform that enables stablecoin holders to directly invest in exchange-traded funds (ETFs) managed by top-tier asset managers like BlackRock and Pimco. U.S. bonds of more than $100 million have been issued via Ondo, per <a href=\"https://defillama.com/protocols/rwa\" target=\"_blank\" rel=\"noopener nofollow\">DeFiLlama </a>data.</p><p>Goldman Sachs, Microsoft and Deloitte have eyed <a href=\"https://cointelegraph.com/news/goldman-sachs-boosts-tokenization-efforts-with-new-partnership\">digital asset tokenization</a> by partnering with the blockchain startup Digital Asset. German technology giant <a href=\"https://cointelegraph.com/news/siemens-issues-60m-digital-bond-on-a-public-blockchain\">Siemens issued a digital bond</a> on a public blockchain worth $64 million in February 2023.</p><p>The RWA assets account for 25% of the largest decentralized stablecoin DAI’s collateral, having increased from zero before the start of the year.</p><p>MakerDAO, the community-led DAO, has approved the conversion of centralized stablecoins like USDC to U.S. Treasury bonds. The DAO accepts tokenized government and corporate bonds and commodities as collateral for minting DAI.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/45c76786-8fc9-41f9-918a-0f9d0eb0b6fc.JPG\"  /><figcaption style=\"text-align: center;\"><em>The top RWA protocols by total locked value. Source: DefiLlama</em></figcaption></figure><p>So far, debt market protocols like Maple Finance, Truefi, Goldfinch and Clearpool have led the price action and activity among RWA protocols. These protocols enable non-collateralized lending for institutions.</p><p>Some of the top-ranked RWA protocols by TVL, like Ondo Finance, MatrixDock and RealT, do not have a governance token attached to them. Nevertheless, these protocols have attracted usage thanks to the chances of a potential airdrop in the future.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/defi-securitization-of-real-world-assets-poses-credit-risks-opportunities-s-p\">DeFi securitization of real-world assets poses credit risks, opportunities: S&amp;P</a></em></strong></p><p>Notably, the non-collateralized lending protocols carry the risk of debt default. FTX’s collapse led to a significant decline in Maple Finance’s price and pushed the protocol to the brink of insolvency.</p><p>The yields of the U.S. Treasury bonds are also set to fall once the Fed starts cutting its benchmark interest rates, which could make these assets less attractive.</p><p>Nevertheless, it is encouraging to see the increasing tokenization of real-world assets and their financialization through DeFi finally catching positive momentum as they gain institutional support.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-09T20:25:00.000Z",
    "title": "DeFi volumes surge 444% after Binance, Coinbase lawsuits: Finance Redefined ",
    "url": "https://cointelegraph.com/news/defi-volumes-surge-after-binance-coinbase-lawsuits-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/bf2e3131-f9a5-442f-80ef-67adb4b27678.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The top-100 DeFi tokens by market capitalization had a bearish week as the total value locked in these protocols fell below $50 billion again.</p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/defi-101/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>The United States Securities and Exchange Commission’s (SEC) lawsuits against two leading centralized crypto exchanges — Binance.US and Coinbase — have led to a surge in DeFi trading volume over the past week.</p><p>While SEC’s enforcement action against centralized exchanges has hogged the headlines, the securities regulator is actively pursuing cases against the decentralized exchange (DEX) ecosystem as well. Crypto venture capital firm Paradigm has slammed the SEC’s approach, reiterating that DEXs are not securities exchanges.</p><p>In another legal battle, a U.S. district court has dismissed a lawsuit against DeFi protocol PoolTogether. The community behind the protocol had funded its legal defense through a $1.4 million nonfungible token (NFT) sale in 2022.</p><p>The DeFi market had a bullish start to June, but the momentum didn’t last long due to the SEC enforcement action in the second week. Most of the top 100 DeFi tokens traded in the red, with the total value locked falling below $50 billion again.</p><h2>SEC crackdown on Binance and Coinbase surge DeFi trading volumes 444%</h2><p>The median trading volume across the top three DEXs jumped 444% in the past 48 hours as crypto investors reeled from the SEC’s recent legal actions against centralized cryptocurrency exchanges Coinbase and Binance.</p><p>According to aggregated data from CoinGecko, total daily trading volumes on Uniswap v3 (Ethereum), Uniswap v3 (Arbitrum) and PancakeSwap v3 (BNB Smart Chain) — which account for 53% of the total DEX trading volume in the last 24 hours — increased by more than $792 million between June 5 and June 7.</p><p><a href=\"https://cointelegraph.com/news/sec-coinbase-binance-lawsuits-surge-defi-trading-volumes\"><strong>Continue reading</strong></a></p><h2>U.S. federal court dismisses lawsuit against DeFi platform PoolTogether</h2><p>A United States judge recently dismissed a lawsuit against the <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> platform PoolTogether. According to the ruling, the federal court system is not the correct place to air concerns against the DeFi startup. </p><p>U.S. district court Judge Frederic Block said that despite having genuine concerns about the startup, a lawsuit in a federal court is not “an appropriate way to address them. The judge also said that the plaintiff, Joseph Kent, does not have standing to pursue a lawsuit because he “suffered no concrete harm at the hands of the defendants.”</p><p><a href=\"https://cointelegraph.com/news/us-federal-court-dismisses-lawsuit-against-defi-platform-pooltogether\"><strong>Continue reading</strong></a></p><h2>Paradigm slams SEC’s ‘incoherent’ attempt to police decentralized exchanges</h2><p>Crypto venture capital firm Paradigm has slammed the SEC’s attempt to redefine the term “exchange” — which, if accepted, would bring decentralized exchanges under its purview. </p><p>On June 8, the firm sent a lengthy 14-page letter to the SEC secretary, Vanessa Countryman, regarding the regulator’s proposed redefinition of the term “exchange” in the 1934 Securities Exchange Act.</p><p><a href=\"https://cointelegraph.com/news/paradigm-slam-sec-incoherent-redefinition-decentralized-exchange-dex\"><strong>Continue reading</strong></a></p><h2>Atomic Wallet hack losses top $35 million, on-chain sleuth reports</h2><p>At least $35 million worth of crypto has been stolen from Atomic Wallet users since June 2, according to an analysis from on-chain sleuth ZachXBT. The five largest losses account for $17 million. According to Atomic Wallet on Twitter, the cause of the attack is being investigated. Reports have surfaced of lost tokens, transaction histories being erased, and even entire crypto portfolios being stolen.</p><p>An independent investigation by pseudonymous Twitter ZachXBT, known for tracing crypto stolen funds and assisting hacked projects, found the largest victim lost $7.95 million in Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>). “Think it could surpass $50m. Keep finding more and more victims, sadly,” commented ZachXBT.</p><p><strong><u>Continue</u></strong><a href=\"https://cointelegraph.com/news/atomic-wallet-hack-losses-top-35\"><strong> reading</strong></a></p><h2>DeFi market overview</h2><p>DeFi’s total market value saw a bearish decline this past week. Data from <a href=\"https://pro.cointelegraph.com/users/sign_in?\">Cointelegraph Markets Pro</a> and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bearish week, with most tokens trading in the red, bleeding double digits. The total value locked in DeFi protocols fell below the $50 billion mark.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/a2e2e310-b444-4c4f-80ee-0e6a8c1eec84.png\"  /></figure><p>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-09T20:25:25.000Z",
    "title": "Crypto.com to halt US institutional exchange offering; retail users unaffected",
    "url": "https://cryptoslate.com/crypto-com-to-halt-us-institutional-exchange-offering-retail-users-unaffected/",
    "description": "<p>Crypto.com will soon end U.S. access to its institutional exchange, according to a statement from the company on June 9. That statement said the decision had been made due to limited demand in that market. Crypto.com said that the institutional exchange would remain available outside of the U.S. and that it would consider relaunching the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/crypto-com-to-halt-us-institutional-exchange-offering-retail-users-unaffected/\">Crypto.com to halt US institutional exchange offering; retail users unaffected</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-09T20:30:53.000Z",
    "title": "Binance.US Suspends USD Deposits And Withdrawals Amid SEC Pressure",
    "url": "https://www.newsbtc.com/binance/binance-us-suspends-usd-deposits-and-withdrawals-amid-sec-pressure/",
    "description": "Binance.US, in response to the aggressive tactics employed by the Securities and Exchange Commission (SEC) in its ideological campaign against the American digital asset industry, on its official Twitter handle has announced the suspension of USD deposits and impending fiat (USD) withdrawal pause. The exchange cites the need to protect its customers and platform amidst the challenges created by the SEC&#8217;s actions. While transitioning to a crypto-only exchange temporarily, Binance.US  assures its customers of maintaining 1:1 reserves for all customer assets, with crypto-related services remaining fully operational. Binance Prioritizing Customer Protection And Defending the Digital Asset Industry Binance.US&#8217;s proactive steps aim to prioritize customer interests and ensure the security of their assets. The suspension of USD deposits and notification regarding the impending pause in fiat withdrawal channels come as a defensive measure to address the challenges posed by the SEC&#8217;s aggressive tactics. The exchange encourages its customers to take appropriate action with their USD holdings in light of these developments. Related Reading: Former SEC Chairman Deserves Appreciation From Ripple, Alderoty States Despite the temporary suspension of USD-related services, Binance.US emphasizes that trading, staking, deposits, and withdrawals in cryptocurrencies will continue to operate without interruption. The exchange assures its customers that any potential downtime in processing withdrawals may be attributed to elevated volumes and weekend bank closures. ​&#8221;​Our priority is, and has always been, our customers. We are taking these proactive steps as we–for a time–transition to a crypto-only exchange,” the exchange said. “To be clear, we maintain 1:1 reserves for all customer assets. Any downtime in processing withdrawals may be the result of elevated volumes and weekend bank closures. Moreover, trading, staking, deposits and withdrawals in crypto remain fully operational.” BNB struggles to hold above $260 support &#124; Source: BNBUSD on TradingView.com While Binance.US expresses openness to a productive compromise that enables a thriving digital asset marketplace in America, it vows to vigorously defend itself, its customers, and the industry against what it considers meritless attacks by the SEC. The exchange remains committed to protecting its customers&#8217; interests and ensuring the continued growth and development of the digital asset ecosystem. Related Reading: Crypto Market Tension: ADA, BNB, MATIC, SOL Crash Over 10% In Past Week In conclusion,  the recent developments surrounding Binance.US and its response to the Securities and Exchange Commission (SEC) demonstrate the exchange&#8217;s unwavering commitment to its customers and the digital asset industry. Customers are urged to take appropriate action with their USD holdings in response to the SEC&#8217;s aggressive tactics as early as June 13,2023. Meanwhile, Binance’s native token BNB has continued to struggle in the market. The digital asset crashed over 10% when the SEC first announced its lawsuit and has seen mounting selling pressure since. It is currently trading at a price of $262.76, down 0.86% in the last 24 hours. Featured image from BBC, chart from TradingView.com"
  }
]