[
  {
    "source": "Cointelegraph",
    "date": "2023-06-17T07:55:23.000Z",
    "title": "​SEC and Binance.​​US strike a temporary agreement on asset access",
    "url": "https://cointelegraph.com/news/sec-and-binance-us-strike-deal-on-asset-access",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/88059839-4573-45dc-a444-1d44d47cd33a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Proposed measures include restricting Binance Holdings officials' access to private keys and disclosing business expenses.</p>\n                    <p><p>Binance, Binance.US, and the Securities and Exchange Commission (SEC) reportedly revealed an agreement, late Friday, June 16, temporarily limiting access to customer funds exclusively to Binance.US employees.</p><p><a href=\"https://www.coindesk.com/policy/2023/06/17/binance-sec-strike-deal-to-move-all-us-customer-funds-wallet-keys-back-onshore/\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to reports, the proposed <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.256060/gov.uscourts.dcd.256060.70.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">agreement</a>, pending approval from the overseeing federal judge, outlines measures for Binance.US to prevent any access by Binance Holdings officials to private keys of wallets, hardware wallets, or root access to Binance.US's Amazon Web Services tools. Additionally, the U.S.-based crypto trading platform will disclose comprehensive information on business expenses, including estimated costs, in the upcoming weeks.</p><p>The proposed agreement has emerged as a direct response to a motion filed by the SEC aiming to freeze the entirety of Binance.US's assets during the ongoing legal proceedings related to securities-related charges. The regulatory body expressed apprehension that without a granted TRO, there might be a risk of funds being transferred offshore or crucial records being deliberately destroyed. </p><p>However, Binance.US's legal representatives strongly opposed this notion, contending that imposing a complete freeze on all assets would essentially be equivalent to administering an excessively severe \"death penalty\" upon the company.</p><p>During a hearing earlier this week, Judge Amy Berman Jackson, presiding over the District Court for the District of Columbia, advised the involved parties that it would be more advantageous for them to <a href=\"https://cointelegraph.com/news/sec-binance-us-negotiate-deal-asset-freeze\">reach an agreement on a proposed</a> stipulation rather than relying on her to formulate a restraining order. The judge emphasized that a temporary restraining order carries a limited duration of two weeks, which might prove inadequate for a comprehensive and thorough hearing. This is particularly true considering the substantial volume of exhibits already submitted, amounting to over 4,000 pages.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-france-investigation-report\"><strong><em>Binance under investigation in France since February 2022: Report</em></strong></a></p><p>The proposed agreement includes additional provisions such as the creation of new crypto wallets by Binance.US, which will be inaccessible to employees of the global exchange. Furthermore, Binance.US commits to providing additional information to the SEC and agreeing to an accelerated discovery schedule. Notably, customers based in the United States will retain the ability to withdraw funds throughout this period.</p><p>If accepted, the proposed agreement will partially address the SEC's concerns while the broader lawsuit progresses. The SEC recently <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">sued Binance and Binance.US for trading unregistered securities</a> and alleged commingling of funds and poor practices. However, the proposed agreement does not encompass the broader lawsuit.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/binance-humilated-on-china-tv-hong-kong-100k-crypto-workers-chinese-ai-unicorn-asia-express/\"><strong><em>Binance humiliated, HK needs 100K crypto workers, China’s AI unicorn</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-17T07:49:15.000Z",
    "title": "Tether responds to account deactivation controversy, raises compliance checks",
    "url": "https://cointelegraph.com/news/tether-responds-to-account-deactivation-controversy",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/6c1a90a6-5ff2-4f41-bdc8-695d2cb18de2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Tether Holdings Inc has responded to claims that it deactivated the accounts of major crypto firms including Moonpay.</p>\n                    <p><p>Tether, the company responsible for issuing the stablecoin <a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>, has, at last, addressed certain concerns that have arisen regarding its operational choices.</p><p>Based on information revealed in documents released by the New York Attorney General (NYAG), it has been reported that the issuer of the stablecoin deactivated approximately 29 accounts belonging to prominent cryptocurrency players in 2021. It seems that the majority of individuals on the list had their accounts terminated for various reasons.</p><p>While the specific reasons for the account terminations were not explicitly disclosed, Tether has <a href=\"https://tether.to/en/Everything-You-Need-To-Know-About-What-We-Shared-With-NYAG/\" target=\"_blank\" rel=\"noopener nofollow\">responded</a> by indicating that they are unwilling to provide comments on individual relationships. However, they did clarify that all individuals had successfully undergone rigorous compliance checks during the onboarding process and ongoing monitoring, as mandated by Tether's compliance policies.</p><p>Among the accounts that were deactivated, notable entities such as MoonPay, BlockFi, CMS Holdings (a crypto investment firm), and Galois Capital (a crypto hedge fund that is no longer operational) were included.</p><p>It is worth mentioning that the NYAG investigation concluded as early as February 2021. However, it has come to light that certain documents in the investigation extend until around June of that same year. It should be noted that the user codes within these documents have already been redacted.</p><p>The Office of the New York Attorney General gathered these documents during its investigation into Tether and its sister company Bitfinex for the misappropriation of $850 million in funds. During this time, iFinex, the parent company of both entities, <a href=\"https://cointelegraph.com/news/tether-and-bitfinex-seek-further-30-days-to-produce-critical-trial-documents\">requested a 30-day extension</a> to produce the critical financial documents before NYAG a few days before the expiration of the previously scheduled date. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/usdt-tether-responds-to-chinese-securities-reports\"><strong><em>USDT issuer Tether responds to Chinese securities exposure reports</em></strong></a></p><p>Ultimately, the involved <a href=\"https://cointelegraph.com/news/tether-to-report-reserves-and-pay-18-5m-fine-after-settlement-with-nyag\">parties reached a settlement</a> in which they agreed to pay a penalty of $18.5 million and halt trading activities in New York. Subsequently, media outlets, including Coinbase, requested the NYAG to publicly disclose their initial quarterly report under the Freedom of Information Law (FOIL). However, Tether objected to this request, citing the need to safeguard its customers' confidential information from potential exploitation by malicious individuals.</p><p>Despite Tether's objection, the NYAG allowed media outlets access to the documents, revealing the deactivation of numerous cryptocurrency company accounts as one of the uncovered matters.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-17T07:57:22.000Z",
    "title": "Solana (SOL/USD) Price Analysis – 17 June 2023: ‘STRONG BUY’ Suggested by Technical Indicators and Moving Averages",
    "url": "https://www.cryptoglobe.com/latest/2023/06/solana-sol-usd-price-analysis-17-june-2023-strong-buy-suggested-by-technical-indicators-and-moving-averages/",
    "description": "Introduction This report provides a comprehensive analysis of Solana’s (SOL) price dynamics, covering technical indicators and moving averages. Price and Volume Overview As of 7:41 a.m. UTC on 17 June 2023, on Binance, the price of SOL is $15.810, which is an increase of $0.960 (+6.46%) from the previous close. The volume of SOL traded […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-17T07:43:12.000Z",
    "title": "Dogecoin (DOGE/USD) Price Analysis – 17 June 2023: ‘STRONG BUY’ Suggested by Technical Indicators and Moving Averages",
    "url": "https://www.cryptoglobe.com/latest/2023/06/dogecoin-doge-usd-price-analysis-17-june-2023-strong-buy-suggested-by-technical-indicators-and-moving-averages/",
    "description": "Introduction This report provides a comprehensive analysis of Dogecoin’s (DOGE) price dynamics, covering technical indicators and moving averages. Price and Volume Overview As of 07:30 a.m. UTC on 17 June 2023, on Binance, the price of DOGE is $0.062680, which is an increase of $0.000970 (+1.57%) from the previous close. The volume of DOGE traded […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-17T07:40:00.000Z",
    "title": "Wyre To Shut Down As Crypto Winter Claims Another Casualty",
    "url": "https://cryptodaily.co.uk/2023/06/wyre-to-shut-down-as-crypto-winter-claims-another-casualty",
    "description": "<p>San Francisco-based crypto payments firm Wyre has announced that it has begun the process of winding down its operations. It also noted that interested parties could begin inquiries about purchasing the firm&rsquo;s assets.&nbsp;</p>\n<p>The firm cited challenges arising from the prolonged bear market and not due to the regulatory conditions prevailing in the US markets.&nbsp;</p>\nBear Market Claims Another Victim&nbsp;\n<p>Wyre announced its decision to shutter operations in a tweet on Friday. The decision comes a few months after Bolt Financial canceled its planned $1.5 billion purchase of the crypto payments firm. Since the cancellation of the purchase, the digital asset markets have seen a number of high-profile bankruptcies, such as FTX, along with lawsuits against prominent exchanges, including Coinbase and Binance, from The United States Securities and Exchange Commission. The company also stressed that the decision was not due to any direction from regulatory agencies.&nbsp;</p>\n\n<p>&ldquo;After nearly a decade, Wyre is winding down. Due to market conditions, we made this decision to protect the best interest of our key stakeholders and customers. This decision is not due to any regulatory agency direction. Wyre continues to secure customer assets.&rdquo;</p>\n\n<p>Wyre also stated that customers have until Friday, 14th July 2023, to withdraw their assets via the Wyre dashboard. If customers miss this date, Wyre has laid down a separate process to enable the recovery of assets left on the platform. According to Wyre&rsquo;s blog post,&nbsp;</p>\n\n<p>&ldquo;Wyre continues to secure customer assets. If you have assets on the Wyre platform, you can continue to withdraw them via Wyre&rsquo;s dashboard until Friday, 14th July. After then, we will have a separate process to recover assets remaining on the platform. We will post details on the process on our website and blog.&rdquo;</p>\n\n<p>The Wyre team also seemed to suggest that the company&rsquo;s assets were up for sale and that interested parties could inquire about purchasing the firm or its assets.&nbsp;</p>\n\n<p>&ldquo;If you&rsquo;re interested in acquiring Wyre&rsquo;s or its subsidiaries&rsquo; assets, please reach out to 88 Partners.&rdquo;&nbsp;</p>\n\nWyre&rsquo;s Troubled Year&nbsp;\n<p>Wyre has been in the doldrums since Bolt Financial decided to cancel its planned purchase of the company for $1.5 billion in September 2022. A few months after the failed acquisition, more trouble began for the company as its fiat-to-crypto on-ramp solution provider Juno urged users to withdraw their crypto assets from the Juno platform and self custody them. Given the uncertainty surrounding its custodial partner, Wyre, Juno stated that such a step was necessary.&nbsp;</p>\n\n<p>&ldquo;Juno as a platform doesn&rsquo;t custody crypto assets &amp; relies on our crypto partner for these services. Due to uncertainty with our crypto partner, we have taken preemptive action in the interest of our customers.&rdquo;</p>\n\n<p>The very next day, MetaMask also announced that it was ending support of the Wyre platform, citing several reports that the company was planning to shut down. MetaMask announced the news on its official Twitter handle, asking users not to use the Wyre service on the mobile aggregator.&nbsp;</p>\nFalse Dawn&nbsp;\n<p>A few days after MetaMask shuttered support for Wyre, the company announced the imposition of a 90% withdrawal limit for all its users. However, this limit was quickly removed following an announcement that Wyre had secured funding from an unnamed strategic partner. However, despite securing funding, Wyre still let go of 75 employees in January 2023. The announcement to mark the firm shutting down operations marks the end of Wyre after the company had explored several strategic options in a bid to stay afloat. The company had stated in January,&nbsp;</p>\n\n<p>&ldquo;We sincerely appreciate the support and positive sentiments from our community as well as the crypto ecosystem at large as we pursue options that will enable Wyre to flourish. Our operations continue, and we will share information with the community as it is available.&rdquo;</p>\n\nA Growing List Of Bear Market Casualties&nbsp;\n<p>Wyre is the latest in a growing list of crypto companies and blockchain firms that have buckled under the pressure of an unending bear market. Just in May alone, several firms, including Lightning Network payments platform BottlePay, NFT platform Terressa, crypto exchange HotBit, and Digital Currency Group&rsquo;s institutional trading platform TradeBlock, all shuttered operations thanks to the prolonged crypto winter.&nbsp;</p>\n<p>EmpireDAO also ended its tenancy at 190 Bowery in New York, giving further evidence of a market downturn. The crypto-exclusive co-working space was founded by Mike Fraietta, with its office building often touted as the WeWork of Web3. Fraietta stated at the time,&nbsp;</p>\n\n<p>&ldquo;We tried every which way to get new sponsors, partnerships, and even crowdfunding. But we needed more help to sustain at 190 Bowery.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-17T07:50:08.000Z",
    "title": "Judge Replaced in SEC Lawsuit Against Coinbase as Crypto Market Remains Steadfast",
    "url": "https://www.cryptopolitan.com/judge-replaced-in-lawsuit-against-coinbase/",
    "description": "Judge Jennifer Rearden, who was presiding over the U.S. Securities and Exchange Commission (SEC) lawsuit against Coinbase, has been replaced by Judge Katherine Polk Failla. This unexpected development comes less than 10 days after the SEC filed charges against the popular cryptocurrency exchange. The regulatory agency had recently launched a fresh wave of lawsuits targeting ... <a title=\"Judge Replaced in SEC Lawsuit Against Coinbase as Crypto Market Remains Steadfast\" class=\"read-more\" href=\"https://www.cryptopolitan.com/judge-replaced-in-lawsuit-against-coinbase/\" aria-label=\"More on Judge Replaced in SEC Lawsuit Against Coinbase as Crypto Market Remains Steadfast\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-17T07:48:08.000Z",
    "title": "Crypto Vs Government: A Tag Team Match For The Future – Who Really Holds The Power?",
    "url": "https://nulltx.com/crypto-vs-government-a-tag-team-match-for-the-future-who-really-holds-the-power/",
    "description": "Governments around the world often view cryptocurrencies and blockchain technology with caution and skepticism. They tend to focus on the potential risks and challenges posed by these emerging technologies. However, it is crucial to recognize that governments actually stand to benefit significantly from embracing and incorporating cryptocurrencies into their existing systems. Here&#8217;s why the governments [&#8230;]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-17T07:46:16.000Z",
    "title": "Coinbase Seeks Redress via Mandamus Order for SEC Evasive Maneuvers",
    "url": "https://coinedition.com/coinbase-seeks-redress-via-mandamus-order-for-sec-evasive-maneuvers/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/COINBASE-1-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Coinbase Seeks Redress via Mandamus Order for SEC Evasive Maneuvers\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/COINBASE-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-1.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Coinbase, one of the leading crypto exchanges in the United States, has unleashed a scathing attack on the U.S. Securities and Exchange Commission (SEC), accusing the regulatory body of evasiveness, deliberate harm to the industry, and defying a direct question from a federal court. In a series of tweets, Paul Grewal, the Chief Legal Officer [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbase-seeks-redress-via-mandamus-order-for-sec-evasive-maneuvers/\">Coinbase Seeks Redress via Mandamus Order for SEC Evasive Maneuvers</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]