[
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T04:27:28.000Z",
    "title": "Reading the Elon Musk 'tea leaves' — Is Dogecoin coming for Twitter?",
    "url": "https://cointelegraph.com/news/elon-musk-dogecoin-price-twitter-x-rebrand",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/f093903d-b437-4532-b42d-6dc438762f90.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A subtle change in Elon Musk’s Twitter bio has reignited rumors Dogecoin may soon be used for payments on Musk’s “everything app.”</p>\n                    <p><p>A subtle change in Elon Musk’s Twitter bio after his <a href=\"https://cointelegraph.com/news/twitter-bluebird-elon-musk-rebrands-x\">platform’s rebrand to “X”</a> has again fanned the flames of speculation — that Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) may have a future on the platform.</p><p>On July 25, eagle-eyed Twitter (now X) users began pointing out that Elon Musk’s profile location now sports both an “X” and a “D” — with X referencing Twitter’s new branding, while D has been interpreted to mean Dogecoin — a memecoin he has been publicly supportive of in the past.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Anyone else notice the Dogecoin (Ɖ) symbol in Elon Musks location <a href=\"https://t.co/Y1OGT42hD2\">pic.twitter.com/Y1OGT42hD2</a></p>&mdash; Morgan (@Helloimmorgan) <a href=\"https://twitter.com/Helloimmorgan/status/1683607928169742336?ref_src=twsrc%5Etfw\">July 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Other observers, such as Real Vision CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2022/raoul-pal\">Raoul Pal</a> came to a similar conclusion, albeit with different reasoning. </p><p>In a July 25 tweet, Pal said Musk would most likely use Dogecoin to make global payments for creators on the platform, noting that the eccentric billionaire already “owns a big chunk anyway” and “he likes it.” </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Two things Ive said when Elon bought &quot;X&quot;:  <br><br>Elon bought it for the AI, and the free speech angle is to give it an unbiased model. He needs the AI to train the Optimus robot.<br><br>He will use crypto to be able to make global payments for creators etc. My guess is he uses Doge.  1/</p>&mdash; Raoul Pal (@RaoulGMI) <a href=\"https://twitter.com/RaoulGMI/status/1683618358380429312?ref_src=twsrc%5Etfw\">July 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>When asked why Musk wouldn’t create his own platform-specific token for these payments, Pal suggested that Dogecoin could help Musk get around securities laws, giving him “zero execution risk.”</p><p>Twitter’s rebrand to X came with little warning on July 24, officially making the crossover at 10 am UTC. Musk’s reference to Dogecoin and the resulting speculation managed to score a small price gain for the memecoin, which rose as high as 5%, according to <a href=\"https://www.tradingview.com/symbols/DOGEUSD/\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from TradingView. </p><p>It is currently trading at $0.07, up 9.5% over the last seven days. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/twitter-rebrand-to-x-elon-musk-everything-app\"><strong><em>Elon Musk to rebrand Twitter to X, but Crypto Twitter has other ideas</em></strong></a></p><p>In emailed comments to Cointelegraph, eToro market analyst Josh Gilbert said that while the rebrand may provide a short-term rally for Dogecoin, Musk’s move could also yield significant impacts for the crypto market in the long term. </p><p>“It does have implications for crypto in the short-term as it moves markets. But it's in the long-term as Musk looks to build out payment networks using his own platform that could soon compete with the likes of Ethereum, Bitcoin or others,” Gilbert explained.</p><p>“While the market reads the tea leaves of Musk’s choices, it's better for investors not to become distracted by short-term events and focus on the longer and wider trends,\" Gilbert said. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\"><strong><em>How smart people invest in dumb memecoins — 3-point plan for success</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-25T04:30:54.000Z",
    "title": "Economist Jim Rickards States BRICS Currency Will Leverage Gold to ‘Destroy the Dollar’",
    "url": "https://news.bitcoin.com/economist-jim-rickards-states-brics-currency-will-leverage-gold-to-destroy-the-dollar/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1153007306-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Economist Jim Rickards States BRICS Currency Will Leverage Gold to Destroy the Dollar\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1153007306-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1153007306-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1153007306-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1153007306-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1153007306-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1153007306-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1153007306.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Jim Rickards, economist and best-selling author, has explained the possible repercussions of issuing a BRICS bloc currency for the dollar. For Rickards, the &#8220;bric&#8221; (the name he gives to the BRICS currency) will be anchored (but not redeemable or backed) to a weight of gold and will be used for debasing the dollar by propping [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T04:36:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T04:10:06.000Z",
    "title": "Ethereum Price Struggles Below $1,900 – Can Bulls Save the Day?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-struggles-below-1900/",
    "description": "Ethereum price is showing bearish signs below the $1,900 resistance against the US Dollar. ETH could extend its decline toward the $1,780 support. Ethereum is showing bearish signs below the $1,900 level. The price is trading below $1,880 and the 100-hourly Simple Moving Average. There is a short-term bullish trend line forming with support near $1,845 on the hourly chart of ETH/USD (data feed via Kraken). The pair could decline further toward the $1,825 and $1,780 levels. Ethereum Price Drops Further Ethereum’s price remained in a bearish zone below the $1,900 level. ETH struggled to recover and extended its decline below the $1,880 level, similar to Bitcoin. The price declined below the $1,850 support level. A new weekly low is formed near $1,832 and the price is now consolidating losses. There was a minor recovery wave above the $1,850 level. The price climbed above the 23.6% Fib retracement level of the recent decline from the $1,904 swing high to the $1,832 low. Ether is now trading below $1,880 and the 100-hourly Simple Moving Average. There is also a short-term bullish trend line forming with support near $1,845 on the hourly chart of ETH/USD. On the upside, immediate resistance is near the $1,870 level. It is close to the 50% Fib retracement level of the recent decline from the $1,904 swing high to the $1,832 low. The first major resistance is near the $1,880 level or the 100-hourly Simple Moving Average. Source: ETHUSD on TradingView.com The next major resistance is near the $1,900 zone, above which the price might start a decent increase toward the $1,920 hurdle. Any more gains could send Ether toward the $2,000 resistance in the near term. An intermediate resistance might be $1,945. More Losses in ETH? If Ethereum fails to clear the $1,880 resistance, it could continue to move down. Initial support on the downside is near the $1,845 level and the trend line. The first major support is near the $1,825 level, below which the price might gain bearish momentum. The next major support is near the $1,780 support level. Any more losses could open the doors for a move toward the $1,720 level in the coming sessions. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,825 Major Resistance Level – $1,880"
  }
]