[
  {
    "source": "Decrypt",
    "date": "2023-11-30T23:24:58.000Z",
    "title": "Munger Was Right: Meme Coin That Generated Millions Off Bitcoin Hater's Death Implodes",
    "url": "https://decrypt.co/208184/munger-right-meme-coin-generated-millions-off-bitcoin-haters-death-implodes",
    "description": "The MUNGER token, which pumped 31,000% after Bitcoin critic Charlie Munger died Tuesday, has completely collapsed."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-30T23:21:00.000Z",
    "title": " Coinbase tracks 6% rise in info requests from law, government agencies ",
    "url": "https://cointelegraph.com/news/coinbase-crypto-exchange-rise-information-requests-law-government",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTEvZGNkNGYwOGMtOGJmYi00MjlmLTk0M2EtYzI4OTJlZDY2N2E1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The requests are increasing in number and coming from more jurisdictions every year. </p>\n                    <p><p>Crypto exchange Coinbase says it had recorded a 6% rise in requests from law enforcement and government agencies compared to 2022, with the number of jurisdictions issuing requests jumping by 19, <a href=\"https://www.coinbase.com/blog/transparency-report-2023\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to the exchange's annual Transparency Report.</p><p>Four countries — the United States, Germany, the United Kingdom, and Spain — made up nearly three-quarters (73%) of the 13,079 agency requests to Coinbase for information between Q4 202</p><p>The United States made 5,686 requests to Coinbase, up from 5,304 last year, with 90.4% of those from criminal enforcement agencies. </p><p>Meanwhile, Australia sent 262% more requests to Coinbase compared to the previous year, placing it sixth place at 453. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/5fa6410e-19fa-40c9-9c56-e7c1e0f10b66.png\"><figcaption style=\"text-align: center;\">Countries that sent Coinbase more information requests compared to the previous year. Source: Coinbase</figcaption></figure><p>The report covered the final quarter of 2022 and the first three of 2023. </p><blockquote>“Our obligation is to respond to these requests if they are valid under financial regulations and other applicable laws. […] Under certain circumstances, we may ask the government or law enforcement agency to narrow their request.”</blockquote><p>Coinbase <a href=\"https://www.coinbase.com/blog/announcing-phase-ii-of-our-international-expansion-strategy-83-of-major-hubs\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a blog post in September that 83% of “G20 members and major financial hubs” have crypto regulations in force or passed legislation on crypto. </p><p><a href=\"https://cointelegraph.com/news/coinbase-crypto-exchange-rise-information-requests-law-government\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-30T23:29:00.000Z",
    "title": "Chainlink Whales Move Millions in Largest Transaction Spike This Year: Here’s What’s Happening",
    "url": "https://www.cryptoglobe.com/latest/2023/11/chainlink-whales-move-millions-in-largest-transaction-spike-this-year-heres-whats-happening/",
    "description": "Decentralized oracle platform Chainlink ($LINK) has recently seen its largest spike in whale transactions so far this year, with over 2,600 transactions worth $100,000 each occurring over a short period of time, ahead of the launch of Chainlink Staking v0.2. As pointed out by popular cryptocurrency analyst Ali Martinez, there was recently a significant spike […]\n"
  }
]