[
  {
    "source": "Decrypt",
    "date": "2024-01-23T23:56:23.000Z",
    "title": "Is a Crypto Token Itself a Security? SEC Can't Make Up Its Mind",
    "url": "https://decrypt.co/213990/crypto-token-itself-security-sec-cant-make-up-mind-coinbase-binance",
    "description": "Apparent contradictions in the SEC’s arguments in the Coinbase and Binance lawsuits expose mounting legal troubles for the regulator, experts say."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-23T23:41:00.000Z",
    "title": "Shiba Inu’s Layer-2 Network Shibarium Hits 300 Million Transactions Even as $SHIB Price Struggles",
    "url": "https://www.cryptoglobe.com/latest/2024/01/shiba-inus-layer-2-network-shibarium-hits-300-million-transactions-even-as-shib-price-struggles/",
    "description": "Shiba Inu’s layer-2 scaling solution, Shibarium, has recently reached a new milestone after processing a total of over 300 million transactions since it was launched, as it saw a surge in daily transactions earlier this month to a peak near 8 million. According to data from Shibarium network explorer Shibariumscan,  the network’s daily transactions have […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-23T23:50:04.000Z",
    "title": "Bitcoin Evangelist Says Investors Will Be Crushed Expecting BTC At $30,000",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-evangelist-says-investors-will-be-crushed-expecting-bitcoin-at-30000/",
    "description": "In the midst of the tumultuous landscape of the price volatility of Bitcoin, a prominent figure stands out, exuding unwavering optimism amidst the chaos: Samson Mow, the self-proclaimed evangelist of the cryptocurrency. Recently transitioning from his Chief Strategy Officer role at Blockstream to assume the position of CEO at Jan3, an entity focused on facilitating Bitcoin adoption at a nation-state level, Mow is placing a substantial bet on the future of the digital gold. Related Reading: Celsius Dump Triggers Ethereum Dive: $35 Million Sell-Off Sends ETH Price Crashing Bitcoin Proponent Sees Investor Hopes Dashed Amidst whispers of a potential plunge below the $30,000 mark, Mow remains resolute in his positive outlook. Dismissing concerns, he took to Twitter, stating, &#8220;I think they&#8217;ll be disappointed.&#8221; This declaration comes in the wake of Bitcoin experiencing a dip below $38,000, attributed to a significant sell-off of Bitcoin Exchange Traded Funds (ETFs), particularly the Grayscale behemoth. A staggering 15,000 BTC, equivalent to $566 million, exited the market, leaving Grayscale with empty coffers. From what I&#8217;m hearing, a good amount of investors are thinking #Bitcoin will drop to the low $0.03M range and waiting to buy then. I think they&#8217;ll be disappointed. — Samson Mow (@Excellion) January 22, 2024 However, the cryptocurrency landscape is not devoid of conflicting sentiments. While Grayscale is shedding its BTC holdings, other ETF issuers are adopting a different stance. Notable among them is Fidelity, which acquired 9,755 BTC, amounting to $386 million. Fidelity emerged as the leading player, securing 5,312 BTC, valued at $210 million. This divergence in approaches indicates that not all market participants are hastily divesting their Bitcoin assets. BTC market cap at $761 billion on the daily chart: TradingView.com On Dips And Pains Within the community, opinions diverge, creating a symphony of mixed notes. Some participants, in response to Mow&#8217;s tweet, express enthusiasm for a potential bargain sale of the top crypto, eagerly anticipating an opportunity to accumulate more during the dip. Others brace themselves for what they term &#8220;max pain,&#8221; envisaging a scenario akin to Mow&#8217;s own predictions of a Bitcoin surge to $1 million. Related Reading: XRP Crash Fears Mount As Whale Dumps 26 Million Tokens – Details The concept of &#8220;max pain&#8221; is adapted from traditional financial markets and suggests that markets will likely follow the &#8220;Max pain theory,&#8221; which indicates that markets will likely follow the path that causes the maximum financial pain to the most significant number of market participants. Max Pain Theory indicates a flush of the #Bitcoin shorts is next. https://t.co/zuJe2vpEEX — Samson Mow (@Excellion) January 14, 2024 How About A Million For Bitcoin? In the context of Bitcoin, Mow believes that a quick rise to $1 million would disrupt the strategic plans of many, including nation-states and companies looking to invest in Bitcoin. In the area of monetary innovations, Mow has released a significant comment regarding Bitcoin and its significance for modern civilization. In instance, Mow boasted on Twitter that Bitcoin was a thousand times better than any other financial technology. There are no diminishing returns when a step change takes place. Bitcoin is not a marginally better $ or gold. #Bitcoin is a 1000x improvement on any monetary technology devised in all human history. Diminishing returns is an irrelevant concept when the entire game has changed. pic.twitter.com/0jbotFLDqc — Samson Mow (@Excellion) January 22, 2024 Mow forewarns of a crypto blitzkrieg to the million-dollar mark, a surge that would spell disappointment for various stakeholders, from Jan3 with its strategic plans to analyst PlanB and his stock-to-flow model, to MicroStrategy with its ambitious Bitcoin acquisitions, and even El Salvador, whose dreams of a Bitcoin-backed bond would dissipate beyond $100,000. In navigating the Bitcoin rollercoaster, the average investor is urged to brace themselves for a journey filled with hairpin turns, dizzying drops, and, if Mow&#8217;s predictions materialize, a potential ascent to the much-anticipated $1 million peak. Featured image from Freepik"
  }
]