[
  {
    "source": "CoinDesk",
    "date": "2024-04-08T15:54:50.000Z",
    "title": "Crypto Market Cap to Double to $5 Trillion by Year-End: Ripple CEO",
    "url": "https://www.coindesk.com/business/2024/04/08/crypto-market-cap-to-double-to-5-trillion-by-year-end-ripple-ceo/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Brad Garlinghouse highlighted several macroeconomic factors behind the potential growth of the total crypto market value."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-08T15:57:32.000Z",
    "title": "World's First Bitcoin DEX Satoshi DEX Announces $9 Million Reached in Presale",
    "url": "https://cryptodaily.co.uk/2024/04/worlds-first-bitcoin-dex-satoshi-dex-announces-9-million-reached-in-presale",
    "description": "World's First Bitcoin DEX Satoshi DEX Announces $9 Million Reached in Presale"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-08T15:43:33.000Z",
    "title": "Onboarding the Next Billion Users onto Web3: Exclusive Interview with Coinweb.com's CEO, Shawn Munir",
    "url": "https://cryptodaily.co.uk/2024/04/onboarding-the-next-billion-users-onto-web3-exclusive-interview-with-coinwebcoms-ceo-shawn-munir",
    "description": "Web3 is experiencing significant growth and is predicted to have 1.5 billion users by 2027. This will lead to 10% of the world's GDP being stored on blockchain technology, amounting to a $13.4 trillion USD market."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-08T15:53:39.000Z",
    "title": "Fractals of Destiny: A Fusion of RPG Styles Hits Steam",
    "url": "https://www.cryptopolitan.com/destiny-a-fusion-of-rpg-styles-hits-steam/",
    "description": "Soft Source Publishing, the mastermind behind the game, is hastening the release of Fractals of Destiny on PC via Steam. By Krakatoa Studios, this semi-open world and hybrid RPG will ensure you are swept away by its intriguing real-time sequences and turn-based combat. The gamers conquered a new sphere of gameplay. The game of Fractals [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-08T15:44:00.000Z",
    "title": "Tron Price Prediction 2024-2033: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2024-2033 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network. TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-04-08T16:05:08.000Z",
    "title": "VC crypto investments surge as market rebounds, hits $2.5b in Q1",
    "url": "https://crypto.news/crypto-investments-surge-market-rebounds-q1/",
    "description": "Following a challenging period for crypto startups, venture capital investments saw a significant uptick in 2024."
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-08T16:00:10.000Z",
    "title": "Polygon (MATIC) In Buy Zone That Earlier Led To 112% & 87% Surges",
    "url": "https://www.newsbtc.com/polygon/polygon-matic-buy-zone-112-87-surges/",
    "description": "On-chain data shows Polygon (MATIC) is currently inside the same buy zone that earlier led to rallies of around 112% and 87% for the asset. Polygon 30-Day MVRV Ratio Is Significantly Negative Currently As pointed out by analyst Ali in a post on X, MATIC is showing a historically bullish pattern in its 30-day MVRV ratio. The &#8220;Market Value to Realized Value (MVRV) ratio&#8221; here refers to an on-chain indicator that keeps track of the ratio between the Polygon market cap and realized cap. The realized cap is a capitalization model that calculates the total valuation of the cryptocurrency by assuming that the &#8220;real&#8221; value of any coin in circulation isn&#8217;t the current MATIC spot price, but rather the price at which it was last transferred on the blockchain. Related Reading: Dogecoin Whale Takes $52.3 Million In DOGE Off Binance, Sign Of Buying? Considering that the last movement of any coin was the last time it changed hands, the price at its time would serve as its current cost basis. As such, the realized cap essentially sums up the cost basis of every coin in circulation. Put another way, the realized cap is a measure of the total amount of capital the investors have put into the asset. Since the MVRV ratio compares the value the holders are carrying right now (that is, the market cap) against this initial investment, its value can tell us about the profit-loss status of the market as a whole. Now, here is a chart that shows the trend in the 30-day version of the Polygon MVRV ratio, which tells us about the profit-loss balance specifically for the investors who bought within the past month: The value of the metric seems to have been quite low in recent days &#124; Source: @ali_charts on X In the graph, the 30-day MVRV ratio has been displayed in terms of a percentage, with the 0% mark aligning with the scenario where the market cap and realized cap are equal. It&#8217;s visible that the indicator has registered some steep drawdown for Polygon recently and has dipped deep inside the negative territory. This would imply that the investors who bought within the last 30 days have entered into notable losses. The latest levels of the metric have been low enough to qualify for a zone that has provided profitable buying opportunities in the past. &#8220;Historically, the last two entries into this zone saw MATIC surge by 112% and 87%,&#8221; notes the analyst. Related Reading: Polygon Observes Buy Signal: Analyst Suggests MATIC Rebound To This Level A possible explanation behind this pattern could be the fact that as these 30-day investors enter into losses, the selling pressure in the market goes down as there aren&#8217;t many profit-takers left. This naturally facilitates for bottoms to take place. It now remains to be seen whether this past pattern would repeat for Polygon this time as well, and if it does, whether any resulting surge would be of a similar scale or not. MATIC Price Polygon has registered a 3% surge in the past day, with its price now floating above $0.93. Given the timing, it&#8217;s possible the MVRV ratio buy signal may already be in effect. Looks like the price of the coin has shot up over the past day &#124; Source: MATICUSD on TradingView Featured image from GuerrillaBuzz on Unsplash.com, Santiment.net, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-04-08T16:03:30.000Z",
    "title": "Bitcoin ETF Volume Tripled In March; Market Momentum Shifts To $RECQ Presale, Investors Expect 10x Gains",
    "url": "https://www.crypto-news-flash.com/bitcoin-etf-volume-tripled-in-march-market-momentum-shifts-to-recq-presale-investors-expect-10x-gains/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-etf-volume-tripled-in-march-market-momentum-shifts-to-recq-presale-investors-expect-10x-gains",
    "description": "<img width=\"1200\" height=\"752\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-08T094824.518.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-08T094824.518.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-08T094824.518-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-08T094824.518-768x481.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-08T094824.518-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-08T094824.518-450x282.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Bitcoin ETF volume has skyrocketed. Experts believe Bitcoin (BTC) can reach a price of $98,190 by the end of 2024. Rebel Satoshi’s $RECQ has gained momentum with an 85% price leap in its presale. Analysts believe $RECQ is one of the altcoins to watch for its 237% growth projections. Bitcoin ETF volume has witnessed a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-04-08T16:00:15.000Z",
    "title": "StakeLayer Surpasses $500,000 Milestone in $STAKE Presale, Paving the Way for the Bitcoin Evolution",
    "url": "https://www.crypto-news-flash.com/stakelayer-surpasses-500000-milestone-in-stake-presale-paving-the-way-for-the-bitcoin-evolution/?utm_source=rss&utm_medium=rss&utm_campaign=stakelayer-surpasses-500000-milestone-in-stake-presale-paving-the-way-for-the-bitcoin-evolution",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/presale_1_1712586430l8G8pXB2O7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/presale_1_1712586430l8G8pXB2O7.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/presale_1_1712586430l8G8pXB2O7-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/presale_1_1712586430l8G8pXB2O7-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/presale_1_1712586430l8G8pXB2O7-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/presale_1_1712586430l8G8pXB2O7-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />London, UK, April 8th, 2024, Chainwire StakeLayer, a pioneering Restaking platform operating on Bitcoin L2, has marked a significant milestone by successfully concluding two phases of its Presale, securing over $500,000 in funding. During the Presale, early participants have an opportunity to purchase $STAKE &#8211; native token of StakeLayer ecosystem. Holders will be able to [...]"
  }
]