[
  {
    "source": "CoinDesk",
    "date": "2023-06-26T11:26:04.000Z",
    "title": "Singapore's MAS Proposes Design Framework for Interoperable Digital Asset Networks ",
    "url": "https://www.coindesk.com/policy/2023/06/26/singapores-mas-proposes-design-framework-for-interoperable-digital-asset-networks/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Banking giants like Standard Chartered, HSBC and Citi are set to run multiple tokenization trials across financial asset classes."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-26T11:10:00.000Z",
    "title": "HSBC rolls out cryptocurrency services in Hong Kong: Report",
    "url": "https://cointelegraph.com/news/hsbc-reportedly-rolls-out-cryptocurrency-services-in-hong-kong",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a9369374-d0c3-44c4-a39f-3886e79a558f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Three crypto ETFs listed on the Stock Exchange of Hong Kong are now reportedly available for trading at Hong Kong’s largest bank.</p>\n                    <p><p>Hong Kong and Shanghai Banking Corporation (HSBC) — the biggest bank in Hong Kong — has reportedly introduced its first local cryptocurrency services.</p><p>HSBC has enabled its customers to buy and sell Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>)-based exchange-traded funds (ETFs), local journalist Colin Wu reported in a tweet on June 26.</p><p>According to the report, HSBC will specifically offer cryptocurrency ETFs listed on the Hong Kong Exchange (HKEX). At the time of writing, HKEX <a href=\"https://www.hkex.com.hk/Market-Data/Securities-Prices/Exchange-Traded-Products?sc_lang=en\" target=\"_blank\" rel=\"noopener nofollow\">lists</a> three crypto ETFs, including <a href=\"https://cointelegraph.com/news/hong-kong-crypto-futures-etfs-raise-over-70m-ahead-of-debut\">CSOP Bitcoin Futures ETF</a>, CSOP Ethereum Futures ETF and <a href=\"https://cointelegraph.com/news/samsung-investment-arm-to-launch-bitcoin-futures-etf-amid-rising-crypto-interest\">Samsung Bitcoin Futures Active ETF</a>.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">SCOOP: HSBC, the largest bank in Hong Kong, today allows its customers to buy and sell Bitcoin and Ethereum ETFs listed on the Hong Kong exchange, and is also the first bank in Hong Kong to allow it. The move will expand local users’ exposure to cryptocurrencies in Hong Kong. <a href=\"https://t.co/vH0LieSVGw\">pic.twitter.com/vH0LieSVGw</a></p>&mdash; Wu Blockchain (@WuBlockchain) <a href=\"https://twitter.com/WuBlockchain/status/1673263927780859904?ref_src=twsrc%5Etfw\">June 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The move aims to expand local users’ exposure to cryptocurrencies in Hong Kong. According to online reports, HSBC Hong Kong <a href=\"https://www.scmp.com/business/banking-finance/article/3172035/hsbc-hong-kongs-biggest-lender-records-increased-deposits\" target=\"_blank\" rel=\"noopener nofollow\">had</a> 1.7 million active mobile customers as of March 2022. About 95% of all retail transactions of HSBC in Hong Kong are reportedly processed online.</p><p>HSBC Hong Kong did not immediately respond to Cointelegraph’s request for comment. This article will be updated pending new information.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/hong-kong-legislator-invites-coinbase-to-the-region-amid-sec-scrutiny\"><strong><em>Hong Kong legislator invites Coinbase to the region despite SEC scrutiny</em></strong></a></p><p>The new services come alongside HSBC reportedly launching the Virtual Asset Investor Education Center. The initiative is designed to protect investors from cryptocurrency-related risks, requiring them to read and confirm educational materials and risk disclosures before starting investing.</p><p>The education center is reportedly available on HSBC’s virtual asset-related products like HSBC HK Easy Invest app, HSB CHK Mobile Banking app and online banking.</p><p>The news comes soon after some media reports suggested in mid-June that the Hong Kong Monetary Authority <a href=\"https://cointelegraph.com/news/hong-kong-government-pressures-bank-giants-accept-crypto-clients\">put pressure on major banks to accept crypto exchanges</a> as clients. The region’s central bank and regulator specifically questioned companies like HSBC and Standard Chartered why they were not taking any crypto exchanges as clients.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-miami-2023-shitcoins-for-bitcoin/\">Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-26T11:21:47.000Z",
    "title": "$18.6B privacy sector up 9% leading crypto market over past 24hours",
    "url": "https://cryptoslate.com/18-6b-privacy-sector-up-9-leading-crypto-market-over-past-24hours/",
    "description": "<p>CryptoSlate data shows privacy tokens grew 9% over the last 24 hours &#8211; as the broader crypto market cooled following its recent strong run of form. Since June 15, following BlackRock&#8217;s Bitcoin spot ETF filing, the total crypto market cap grew 18% to peak at $1.2 trillion on June 23. However, weekend price action failed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/18-6b-privacy-sector-up-9-leading-crypto-market-over-past-24hours/\">$18.6B privacy sector up 9% leading crypto market over past 24hours</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-26T11:30:25.000Z",
    "title": "Circle CEO Jeremy Allaire: ‘Other Governments Are Regulating Digital Dollars Before the US’",
    "url": "https://news.bitcoin.com/circle-ceo-jeremy-allaire-other-governments-are-regulating-digital-dollars-before-the-us/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1697650153-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Circle CEO Jeremy Allaire: &#039;Other Governments Are Regulating Digital Dollars Before the US&#039;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1697650153-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1697650153-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1697650153-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1697650153-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1697650153-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1697650153-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1697650153.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Jeremy Allaire, CEO of Circle, the company behind the issuance of usd coin (USDC), has expressed his worries about the state of stablecoin regulation in the U.S. In a congressional hearing, Allaire stated that other governments were already regulating the issuance of digital dollars (dollar-backed stablecoins) and called on the U.S. government to act by [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T11:26:20.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T11:15:56.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-26T11:32:23.000Z",
    "title": "Federal Reserve governor warns of regulatory gaps for digital assets",
    "url": "https://crypto.news/federal-reserve-governor-warns-of-regulatory-gaps-for-digital-assets/",
    "description": "Michelle Bowman, a governor of the Federal Reserve System, has raised concerns about the potential risks financial institutions face due to uncertainty surrounding digital assets and the impact of rising interest rates. During her speech at the Salzburg Global Seminar&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-26T11:15:41.000Z",
    "title": "OKX executive hints at expanding Dubai team after acquiring MVP license",
    "url": "https://crypto.news/okx-executive-hints-at-expanding-dubai-team-after-acquiring-mvp-license/",
    "description": "On June 15, the Seychelles-based crypto exchange OKX entered the Middle East after the Dubai Virtual Assets Regulatory Authority (VARA) granted its Minimal Viable Product (MVP) preparatory license. The exchange has also expanded services to Hong Kong, allowing users to&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-26T11:30:06.000Z",
    "title": "Bitcoin Bullish Signal: Exchange Whale Ratio Plunges",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bullish-signal-exchange-whale-ratio-plunges/",
    "description": "On-chain data shows that the Bitcoin exchange whale ratio has taken a plunge recently. Here&#8217;s why this may be bullish for the asset&#8217;s price. Bitcoin Exchange Whale Ratio Has Registered A Sharp Decline Recently As pointed out by an analyst in a CryptoQuant post, the selling pressure in the market may be diminishing right now. The &#8220;exchange whale ratio&#8221; is an indicator that measures the ratio between the sum of the top ten Bitcoin transactions to exchanges and the total exchange inflow. Generally, the 10 largest transactions to exchanges are coming from whale entities, so this metric can tell us how the inflows of these humongous holders compare with that of the entire market. When the value of this ratio is high, it means that the whales are making up a large part of the total inflows currently. As one of the main reasons why investors deposit to exchanges is for selling-related purposes, this kind of trend can be a sign that this cohort may be taking part in mass dumping right now. On the other hand, low values of the indicator imply the whales are contributing a relatively healthy portion toward the inflows at the moment. Since these large investors aren&#8217;t selling significantly more than the rest of the market during such periods, the price of the cryptocurrency can feel a bullish effect. Related Reading: Momentum: Why The Bitcoin Train Is Ready To Leave The Station Now, here is a chart that shows the trend in the 72-hour simple moving average (SMA) Bitcoin exchange whale ratio over the past several months: Looks like the 72-hour SMA value of the metric has taken a deep hit in recent days &#124; Source: CryptoQuant As displayed in the above graph, the 72-hour SMA Bitcoin exchange whale ratio has plummeted recently, implying that the whale deposits have dropped relative to the rest of the market. Before this plunge, the indicator had been in an overall uptrend since March, suggesting that these humongous investors were possibly slowly ramping up their selling. Related Reading: Bitcoin Resurgence: Three Reasons Why BTC Has Eyes Set on $50,000 Next During the recent period when the asset&#8217;s price was struggling, the metric had surged to around 0.88, meaning that around 88% of the total exchange inflows were coming from this cohort alone. Following the latest rapid decline, however, the 72-hour SMA Bitcoin exchange whale ratio has dropped to around 0.80. Interestingly, this drawdown in the indicator has come while the coin has seen a sharp rally that has now taken the price above the $30,000 level. Usually, whales may ramp up their selling a little during such periods, as at least some of these large investors might be enticed by the profit-taking opportunity. Since that doesn&#8217;t seem to have occurred yet, it may be a sign that these holders believe that there is more to come for this rally. From the chart, it&#8217;s visible that the indicator also saw a sharp plunge following the FTX collapse, which allowed the cryptocurrency to bottom out and eventually build up toward the rally. The current relatively low selling pressure from the whales may potentially allow the price of the cryptocurrency to grow in a similar fashion as well (which would only be, of course, given that the metric continues to be at these low values in the near future). BTC Price At the time of writing, Bitcoin is trading around $30,400, up 15% in the last week. BTC has stagnated since the sharp climb &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T11:30:02.000Z",
    "title": "USA was Playing the Long Crypto Game, Buying ICOs Now will Profit",
    "url": "https://www.crypto-news-flash.com/usa-was-playing-the-long-crypto-game-buying-icos-now-will-profit/?utm_source=rss&utm_medium=rss&utm_campaign=usa-was-playing-the-long-crypto-game-buying-icos-now-will-profit",
    "description": "The United States of America has been conspicuous in its never-ending battles to regulate crypto. Through the US Securities and Exchange Commission, the government has massively chased crypto-oriented entities such as centralized exchanges prompting a bear market. However, a limelight of hope has recently sent Bitcoin’s price surging towards its all-time high. US-based asset management [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-26T11:34:09.000Z",
    "title": "Top 5 Ways to Earn Passive Income With Crypto",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-5-ways-to-earn-passive-income-with-crypto/",
    "description": "<p>The bear market has lingered longer than anyone first imagined. We have the SEC, the collapse of Voyager, Terra, FTX, and a couple of other factors to thank for that. People are not just looking for the next big thing to invest in but also avenues to earn passive income. So, there are several ways [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-5-ways-to-earn-passive-income-with-crypto/\">Top 5 Ways to Earn Passive Income With Crypto</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-26T11:25:00.000Z",
    "title": "Macro Analyst: Chinese Liquidity and Bitcoin’s Price Are in Sync",
    "url": "https://coinedition.com/macro-analyst-chinese-liquidity-and-bitcoins-price-are-in-sync/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/btc-52.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/btc-52.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/btc-52-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/btc-52-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/btc-52-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/btc-52-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/btc-52-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/btc-52-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/btc-52-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/btc-52-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/btc-52-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/btc-52-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/btc-52-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/btc-52-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/btc-52-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/btc-52-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/btc-52-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A popular crypto analyst identified on Twitter as tedtalksmacro has observed a coincidence between the increasing Chinese liquidity and a surge in the price of Bitcoin. He projects that the trend will continue into the latter days of the year, considering the stalling post-pandemic recovery. The analyst noted an all-year coincidence between the Chinese liquidity [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/macro-analyst-chinese-liquidity-and-bitcoins-price-are-in-sync/\">Macro Analyst: Chinese Liquidity and Bitcoin’s Price Are in Sync</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]