[
  {
    "source": "NewsBTC",
    "date": "2023-06-12T03:03:25.000Z",
    "title": "Bitcoin Price At Significant Risk of Crash Below $25,400",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-at-significant-risk-25400/",
    "description": "Bitcoin price is struggling below the $26,150 support. BTC could start another decline if it breaks the key $25,400 support in the near term. Bitcoin is moving lower below the $26,150 support zone. The price is trading below $26,000 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance near $26,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could decline again if there is a move below the $25,400 support zone. Bitcoin Price Remains In Downtrend Bitcoin price struggled to settle above the $26,500 resistance zone. BTC declined below the $26,150 support to move into a bearish zone. The recent high was formed near $26,133 and the price is now moving lower. There was a break below the 50% Fib retracement level of the upward move from the $25,400 swing low to the $26,133 high. The price also traded below the $25,750 support. Bitcoin price is now trading below $26,000 and the 100 hourly Simple moving average. There is also a key bearish trend line forming with resistance near $26,000 on the hourly chart of the BTC/USD pair. It seems to be holding the $25,570 support level. It is close to the 76.4% Fib retracement level of the upward move from the $25,400 swing low to the $26,133 high. Immediate resistance is near the $26,000 level and the trend line region. The first major resistance is near the $26,150 level. A clear move above the $26,150 resistance might start a decent increase. The next major resistance is near the $26,500 level. A close above $26,500 might send the price further higher. Source: BTCUSD on TradingView.com The next key resistance is near the $27,000 level, above which Bitcoin might rise toward the $27,500 resistance. Any more gains above the $27,500 resistance zone might send the price toward the $28,500 resistance zone. More Losses in BTC? If Bitcoin’s price fails to clear the $26,000 resistance, it could continue to move down. another decline. Immediate support on the downside is near the $25,570 level. The next major support is near the $25,400 level, below which the price might accelerate lower. In the stated case, the price could drop toward the $25,000 support in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is below the 50 level. Major Support Levels – $25,570, followed by $25,500. Major Resistance Levels – $26,000, $26,150, and $26,500."
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-12T03:08:41.000Z",
    "title": "BRICS Ministers Say Rebalancing of Global Order Underway, Call Group a ‘Symbol of Change’: Report",
    "url": "https://dailyhodl.com/2023/06/11/brics-ministers-say-rebalancing-of-global-order-underway-call-group-a-symbol-of-change-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/brics-rebalancing-economy.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/brics-rebalancing-economy.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/brics-rebalancing-economy.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/brics-rebalancing-economy.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/brics-rebalancing-economy.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/brics-rebalancing-economy.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/brics-rebalancing-economy.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The top figureheads of the BRICS alliance say that the coalition represents a complete reconfiguration of global order as the old world fades away. The foreign ministers of BRICS, which currently represents the countries of Brazil, Russia, Iran, China and South Africa, just met in Cape Town for a summit. According to a report from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/11/brics-ministers-say-rebalancing-of-global-order-underway-call-group-a-symbol-of-change-report/\">BRICS Ministers Say Rebalancing of Global Order Underway, Call Group a ‘Symbol of Change’: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]