[
  {
    "source": "CryptoSlate",
    "date": "2024-01-24T03:00:12.000Z",
    "title": "Understanding the differences in Bitcoin futures on Binance and CME",
    "url": "https://cryptoslate.com/understanding-the-differences-in-bitcoin-futures-on-binance-and-cme/",
    "description": "<p>Open interest on Bitcoin futures listed on the Chicago Mercantile Exchange (CME) has been outpacing open interest on Binance futures since November 2023. As of Jan. 23, around 30% of the total open interest in the Bitcoin futures market is on CME. However, as spot Bitcoin ETFs begin to gain traction in the U.S., amassing [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/understanding-the-differences-in-bitcoin-futures-on-binance-and-cme/\">Understanding the differences in Bitcoin futures on Binance and CME</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-24T02:52:00.000Z",
    "title": "OKX’s $OKB Token Drops by Nearly 50% in Flash Crash, Exchange Offers Compensation",
    "url": "https://www.cryptoglobe.com/latest/2024/01/okxs-okb-token-drops-by-nearly-50-in-flash-crash-exchange-offers-compensation/",
    "description": "Popular cryptocurrency trading platform OKX has recently revealed it will reimburse users impacted by a sudden OKB token flash crash, which saw its native token plunge by nearly 50% in less than 15 minutes, from $46.8 to $25.1. According to available data, the flash crash saw the value of the token’s market capitalization briefly plunge […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-24T02:50:47.000Z",
    "title": "Bitcoin Price Faces Crucial Test, Indicators Suggest Many Roadblocks To Recovery",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-faces-crucial-test-38500/",
    "description": "Bitcoin price dived toward the $38,500 support zone. BTC is attempting a recovery wave and might struggle to climb above the $40,500 resistance. Bitcoin price extended its decline and tested the $38,500 support zone. The price is trading below $40,000 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance near $40,450 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair might struggle to recover above the $40,000 and $40,500 resistance levels. Bitcoin Price Turns Red Bitcoin price remained in a bearish zone below the $40,000 support zone. BTC extended its decline and traded below the $49,200 level. Finally, it tested the $38,500 support zone, as discussed in yesterday&#8217;s post. A new weekly low was formed near $38,518 and the price is now correcting losses. It is slowly recovering above the $39,000 level. It cleared the 23.6% Fib retracement level of the downward move from the $42,260 swing high to the $38,518 low. Bitcoin is now trading below $40,000 and the 100 hourly Simple moving average. Immediate resistance is near the $40,000 level. The first major resistance is near the $40,350 level or the 50% Fib retracement level of the downward move from the $42,260 swing high to the $38,518 low. Source: BTCUSD on TradingView.com There is also a key bearish trend line forming with resistance near $40,450 on the hourly chart of the BTC/USD pair. A clear move above the $40,450 resistance could send the price toward the $40,850 resistance. The next resistance is now forming near the $41,250 level. A close above the $41,250 level could push the price further higher. The next major resistance sits at $42,000. Another Decline In BTC? If Bitcoin fails to rise above the $40,450 resistance zone, it could start another decline. Immediate support on the downside is near the $39,400 level. The next major support is $39,000. If there is a close below $39,000, the price could gain bearish momentum. In the stated case, the price could revisit the $38,500 support in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $39,400, followed by $38,500. Major Resistance Levels – $40,350, $40,450, and $40,850."
  }
]