[
  {
    "source": "Cointelegraph",
    "date": "2023-11-29T08:34:51.000Z",
    "title": "Binance operates without license in Philippines, regulator says",
    "url": "http://cointelegraph.com/news/binance-operates-no-license-philippines",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/e6b8857e-a379-487c-9898-851e0b116a2a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to the Philippines SEC, entities involved in promoting or trading on Binance could face up to 21 years of imprisonment and $90,000 penalties.</p>\n                    <p><p>Cryptocurrency exchange Binance has been operating in the Philippines without the necessary approval or license, according to the local securities regulator.</p><p>The Philippines Securities and Exchange Commission (SEC) <a href=\"https://www.sec.gov.ph/advisories-2023/binancebinance-is-not-registered-as-a-corporation-in-the-philippines-and-operates-without-the-necessary-license-and-or-authority/#gsc.tab=0\" target=\"_blank\" rel=\"noopener nofollow\">issued</a> a warning against Binance on Nov. 28, informing the public that the exchange is not authorized to sell or offer securities in the country.</p><p>The announcement emphasized that an exchange like Binance must apply for registration and provide detailed information about offered securities before selling them to the public. Such detailed information includes the issuance price, the nature of securities and other data.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/philippines-sells-179-m-tokenized-treasury-bonds\"><strong><em>Philippines to sell $179M in tokenized treasury bonds for the first time</em></strong></a></p><p>The Philippines’ Securities Regulation Code (SRC) also requires securities issuers to be registered in the country before being offered for investment. The issuer should also acquire a secondary license to sell or offer securities to the public, the statement notes, adding:</p><blockquote>“Based on the Commission’s database, the operator of the platform Binance is not registered as a corporation in the Philippines and operates without the necessary license and/or authority to sell or offer any form of securities as defined under Section 3.1 of the SRC.”</blockquote><p>In addition to operating without the necessary license, the SEC argued that Binance has been illicitly promoting its services in the country. The regulator warned entities involved in promoting or trading on Binance may be held criminally liable under Section 28 of the SRC.</p><p>This is a criminal offense that carries the penalty of a fine of up to 5 million Philippine pesos ($90,300), or imprisonment of 21 years, or both, under Section 73 of the SRC, the statement notes.</p><p>Binance did not immediately respond to Cointelegraph’s request for comment.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T08:29:53.000Z",
    "title": "Pentagon’s Replicator Project Aims to Deploy Thousands of AI-Enabled Autonomous Vehicles by 2026",
    "url": "https://www.cryptopolitan.com/pentagons-replicator-project-aims-to-deploy-thousands-of-ai-enabled-autonomous-vehicles-by-2026/",
    "description": "The Pentagon is embarking on an ambitious project, known as Replicator, with the goal of deploying thousands of AI-enabled autonomous vehicles by 2026, as it seeks to keep pace with China&#8217;s military advancements in artificial intelligence. This move represents a significant shift in the U.S. military&#8217;s approach to future warfare, reflecting the global race towards ... <a title=\"Pentagon&#8217;s Replicator Project Aims to Deploy Thousands of AI-Enabled Autonomous Vehicles by 2026\" class=\"read-more\" href=\"https://www.cryptopolitan.com/pentagons-replicator-project-aims-to-deploy-thousands-of-ai-enabled-autonomous-vehicles-by-2026/\" aria-label=\"More on Pentagon&#8217;s Replicator Project Aims to Deploy Thousands of AI-Enabled Autonomous Vehicles by 2026\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T08:26:57.000Z",
    "title": "AI Token Market Sees 200% Surge in Trading Volume, Crossing $3B",
    "url": "https://www.cryptopolitan.com/ai-token-sees-200-surge-in-trading-volume/",
    "description": "In recent weeks, the cryptocurrency market has witnessed a remarkable surge in the trading volume of AI-related crypto assets, with trading activities crossing the $3 billion mark. Kaiko, a renowned on-chain analytics firm, reported this significant increase, highlighting the prominent role played by AI-focused projects such as Render (RNDR), Worldcoin (WLD), and Fetch.ai (FET) in ... <a title=\"AI Token Market Sees 200% Surge in Trading Volume, Crossing $3B\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-token-sees-200-surge-in-trading-volume/\" aria-label=\"More on AI Token Market Sees 200% Surge in Trading Volume, Crossing $3B\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T08:14:44.000Z",
    "title": "AI-Enhanced East African Crude Oil Pipeline Promises Safe and Efficient Operations",
    "url": "https://www.cryptopolitan.com/east-african-crude-oil-promises-safety/",
    "description": "In a significant development for the global energy industry, the developers of the East African crude oil pipeline (EACOP) are harnessing the power of artificial intelligence (AI) to monitor the over 1,400-kilometer pipeline, stretching from Kabaale in Hoima, Uganda, to the port of Tanga in Tanzania. The implementation of AI technology aims to enable real-time ... <a title=\"AI-Enhanced East African Crude Oil Pipeline Promises Safe and Efficient Operations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/east-african-crude-oil-promises-safety/\" aria-label=\"More on AI-Enhanced East African Crude Oil Pipeline Promises Safe and Efficient Operations\">Read more</a>"
  }
]