[
  {
    "source": "NewsBTC",
    "date": "2023-06-27T22:30:38.000Z",
    "title": "Cardano (ADA) Is Outperforming Previous Bear Cycle, Reveals ITC Crypto CEO",
    "url": "https://www.newsbtc.com/analysis/ada/cardano-ada-is-outperforming-previous-bear-cycle-reveals-itc-crypto-ceo/",
    "description": "In the continually evolving world of cryptocurrencies, market resilience often proves a key determiner of long-term value and growth. Benjamin Cowen, CEO and founder of ITC Crypto, recently underscored this premise and spotlighted Cardano (ADA) for its performance amid the prevailing crypto bear market. Related Reading: Cardano Poised For Consolidation In This Price Zone Prior To Attempting Reversal In a series of Twitter posts, Cowen shared insights comparing ADA&#8217;s current performance with its past trajectory, with implications for ADA&#8217;s investors and potential adopters. A Historical Perspective: ADA&#8217;s Bear Market Performance Cowen&#8217;s analysis brought to the fore an observation. According to Cowen, Cardano&#8217;s resilience in the current bear market outpaces its performance during the 2018-2020 bearish phase. He used a snapshot of ADA&#8217;s Return on Investment (ROI) to illustrate this, wherein two distinct trends emerged. Comparing #ADA bear markets Blue Line (Jan 2018 &#8211; Mar 2020) Orange Line ( Sep 2021-Present) So far, we are seeing diminishing losses as a function of time. The orange line will reach the length of the blue line on Nov. 13th, 2023. pic.twitter.com/XXKKSjiEmF — Benjamin Cowen (@intocryptoverse) June 26, 2023 The graphic showcased a blue line depicting the bear market spanning January 2018 to March 2020, while the orange line represented the ongoing bear market that commenced in September 2021. Notably, the orange line displayed a trend of diminishing losses over time. Navigating The Bear Market: Cardano&#8217;s Improved Resilience Cowen&#8217;s observations suggest a slower rate of decline for ADA price in this bear market compared to its previous cycle. Projections place at the end of the current cycle around November 13, 2023, when the orange line is anticipated to reach the same length as the blue line. These insights could signal a less severe impact on ADA&#8217;s price amid the existing bear market compared to the previous cycle. Although ADA has experienced a decrease in price over the last 24 hours, the broader analysis paints a picture of enhanced market resilience. Although the asset declined in the past day, it is worth noting that ADA has been bullish over the past week, up by nearly 10%. The asset currently trades at $0.28 with a trading volume above $185 million and a market cap of $9.8 billion. Over the past 7 days, more than $500 million has been added to ADA&#8217;s market cap following the asset market capitalization surge from $9.1 billion seen last Tuesday. ADA has also recorded a surge in its trading volume, indicating rising trading activity. Related Reading: Cardano (ADA) Soars 10% In The Last Week, More Rallies Ahead? Cardano&#8217;s ability to navigate bear markets with diminishing losses is a testament to its resilience and inherent value proposition. While the immediate trend reflects a downturn, the longer-term performance of ADA signals a pattern of robustness.  Featured image from Shutterstock, Chart from TradingView"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-06-27T22:09:53.000Z",
    "title": "Bitfinex lanza la plataforma peer-to-peer ‘Bitfinex P2P’ en Venezuela, Argentina y Colombia",
    "url": "https://blog.bitfinex.com/announcements/bitfinex-lanza-la-plataforma-peer-to-peer-bitfinex-p2p-en-venezuela-argentina-y-colombia/",
    "description": "<p>ROAD TOWN, Islas Vírgenes Británicas &#8211; 27 de junio de 2023 &#8211; Bitfinex (https://www.bitfinex.com/), una plataforma de negociación de activos digitales de última generación, está reafirmando su compromiso con la libertad financiera e inclusión en América Latina con el lanzamiento de &#8216;Bitfinex P2P&#8217;, una nueva...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/announcements/bitfinex-lanza-la-plataforma-peer-to-peer-bitfinex-p2p-en-venezuela-argentina-y-colombia/\">Bitfinex lanza la plataforma peer-to-peer &#8216;Bitfinex P2P&#8217; en Venezuela, Argentina y Colombia</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]