[
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T00:30:37.000Z",
    "title": "Judge’s Decision on Sam Bankman-Fried’s Motion to Dismiss Charges in FTX Case",
    "url": "https://www.cryptopolitan.com/judges-decision-on-sam-bankman-frieds-motion/",
    "description": "In a significant development in the ongoing legal battle involving FTX Derivatives Exchange founder Sam Bankman-Fried, United States Judge Lewis Kaplan from the District Court for the Southern District of New York has rejected motions to dismiss most charges levied against him. Bankman-Fried and his legal team had filed a motion last month seeking the ... <a title=\"Judge&#8217;s Decision on Sam Bankman-Fried&#8217;s Motion to Dismiss Charges in FTX Case\" class=\"read-more\" href=\"https://www.cryptopolitan.com/judges-decision-on-sam-bankman-frieds-motion/\" aria-label=\"More on Judge&#8217;s Decision on Sam Bankman-Fried&#8217;s Motion to Dismiss Charges in FTX Case\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T00:17:44.000Z",
    "title": "EDX Markets reportedly drops Paxos as custodian, in talks with Anchorage Digital for new partnership",
    "url": "https://www.cryptopolitan.com/edx-markets-reportedly-drops-paxos-as-custodian-talks-with-anchorage-digital/",
    "description": "New York-based cryptocurrency exchange, EDX Markets, has reportedly made a significant shift in custody arrangements, dropping its previous partnership with Paxos and entering final negotiations with Anchorage Digital for a new collaboration. The earlier pact with Paxos, announced in October, would have directed EDX&#8217;s clients to Paxos for the custody of their digital assets while ... <a title=\"EDX Markets reportedly drops Paxos as custodian, in talks with Anchorage Digital for new partnership\" class=\"read-more\" href=\"https://www.cryptopolitan.com/edx-markets-reportedly-drops-paxos-as-custodian-talks-with-anchorage-digital/\" aria-label=\"More on EDX Markets reportedly drops Paxos as custodian, in talks with Anchorage Digital for new partnership\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T00:14:35.000Z",
    "title": "Circle Introduces New Protocol to Enhance USDC Transactions on a Prominent Blockchain",
    "url": "https://www.cryptopolitan.com/circle-new-protocol-enhance-usdc-transaction/",
    "description": "Circle, the blockchain startup and stablecoin issuer, has unveiled its Cross Chain Transfer Protocol (CCTP) on the Arbitrum network. The launch of CCTP aims to enhance the accessibility and movement of the USDC stablecoin on the Ethereum Layer-2 scaling network. With the CCTP, Circle seeks to overcome the challenges of capital fragmentation and provide a ... <a title=\"Circle Introduces New Protocol to Enhance USDC Transactions on a Prominent Blockchain\" class=\"read-more\" href=\"https://www.cryptopolitan.com/circle-new-protocol-enhance-usdc-transaction/\" aria-label=\"More on Circle Introduces New Protocol to Enhance USDC Transactions on a Prominent Blockchain\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T00:30:00.000Z",
    "title": "Nigeria Leads The Pack: ConsenSys Study Shows Crypto Recognition At 92% Globally",
    "url": "https://www.newsbtc.com/crypto/nigeria-leads-the-pack-consensys-study-shows-crypto-recognition-at-92-globally/",
    "description": "There is no disputing that cryptocurrencies are now widely accepted. Cryptocurrencies are now firmly part of the global conversation; whether it be investors trading crypto, businesses accepting it as a mode of payment, or just reports about the latest surge or crash in the crypto market. And now, according to a new ConsenSys survey, an impressive 92% of people around the world are aware of cryptocurrencies like Bitcoin. Developing Regions Show Strong Crypto Recognition According to a recent poll conducted by the private blockchain software company ConsenSys and YouGov, 92% of people worldwide are aware of cryptocurrencies. Over 15,158 people in 15 nations, with an average age of 18, were surveyed for the report. However, while awareness of crypto is high, understanding is low. A total of 92% of respondents to the survey had heard of crypto, but only 8% could confidently say they were familiar with the general concept of Web3. Related Reading: BLUR Up By 11% Following This Announcement Interestingly, developing regions of the world actually show some of the strongest recognition and interest in cryptocurrencies. Nigeria, South Africa, and Brazil lead in the pack in crypto awareness, with 99% of Nigerian respondents demonstrating awareness of crypto and over 70% accurately guessing the definition of a blockchain. While developed nations debate regulating crypto, developing regions seem more open to innovation. Cryptocurrencies like Bitcoin and Ethereum have helped to address the inherent risks of unstable currencies leading to high inflation rates and the lack of financial infrastructure for money movement that many people face in developing nations. This stands in stark contrast to the larger level of mistrust toward cryptocurrency displayed by European nations and Asian nations like Japan and South Korea. In Japan and Indonesia, only 1 in 3 respondents claim to understand what cryptocurrency is. Total market cap recovers as Bitcoin rebounds &#124; Source: Crypto Total Market Cap on TradingView.com Only 8% Of Respondents Very Familiar With The Concept Of Web3 In a country like Argentina, whose currency has been through a significant devaluation and instability in recent years, 56% of respondents indicated a higher likelihood of owning cryptocurrency as a store of value.  While crypto and blockchain have gained mainstream awareness, most people still have a lot to learn about web3, the decentralized internet of the future. 36% and 34% of respondents were familiar with the Metaverse and NFTs, but only 24% are aware of Web3, with only 8% saying they are “very familiar” with the concept. Related Reading: PEPE Coin Shines Among Top Gainers, Tallies 78% In Last Week As web3 projects emerge and gain traction, crypto literacy rates should rise. ConsenSys predicts broader understanding will come through a more practical understanding and utilization of web3 technologies. Featured image from Freebitcoin, chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T00:19:17.000Z",
    "title": "Bitcoin Starts To Bite Back Says Reptilian Technical Signal",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-starts-to-bite-back-says-reptilian-technical-signal/",
    "description": "A reptilian technical signal is back in Bitcoin, and it has started to feast upon a new uptrend, according to how the tool works. Take a closer look below at the one-week BTCUSD Williams Alligator, and learn more about what it says about the king of the cryptocurrency market. Bye Crypto Bear Market. See You Later, Says Alligator Bitcoin price is back above $30,000 and the recent push higher has possibly changed the trend. That is according to the one-week Williams Alligator, which has started “eating with its mouth open.” Related Reading: Bitcoin Price Breaks Above $30,000: Is The Bull Run Back On? The Williams Alligator consists of three smoothed moving averages, set at 5, 8, and 13-periods. These averages represent what creator Bill Williams has labeled the Lips, Teeth, and Jaw of the gator, respectively. When the three moving averages are moving upward, and the Lips are above the Teeth and Jaw, it suggests that an asset is trending. As such, the chart below suggests that Bitcoin is once again trending up. The Alligator is hungry for BTC &#124; BTCUSD/NDX on TradingView.com Bitcoin Could Be Trending For A While Crocodile As the image depicts, after Bitcoin begins trending according to the technical tool and timeframe, it continues until a climax. At that point the Alligator is sated and begins “sleeping”. Given the recent macro environment, regulatory pressure, and more, investors might still be sleeping on the crypto market. But if you read the Williams Alligator correctly, it suggests that the gator has awakened, and an uptrend is here. Related Reading: Momentum: Why The Bitcoin Train Is Ready To Leave The Station Upon examining the last three major uptrends, the current most closely resembles the 2020 rally. In 2019 the Aligator ate for 50 days before a peak. In 2021, it lasted 75 days. But the big one in 2020 lasted a full 350 days before a reversal. Thus far, the Alligator started eating 125 days ago, surpassing 2019 and 2021 combined. Yet it’s not even halfway done with its meal if the rally is as strong as 2020. How long will the Williams Alligator stay hungry for BTC? The 1W Williams Alligator 🐊 is hungry for more expensive #Bitcoin It has started eating with an open mouth, thus following the trend It is done dining when the 5, 8, and 13 (Fib numbers) period smoothed MAs cross and turn down Eat, or be eaten pic.twitter.com/V12PykySYr — Tony &#8220;The Bull&#8221; (@tonythebullBTC) June 27, 2023 Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  }
]