[
  {
    "source": "Decrypt",
    "date": "2023-08-14T18:50:58.000Z",
    "title": "Institutional Investors Continue to Bet Big on XRP Following Ripple's Partial SEC Win",
    "url": "https://decrypt.co/152421/institutional-investors-continue-bet-big-xrp-following-ripple-partial-sec-win",
    "description": "Major investors are still showing interest in XRP, pouring cash into it for the 16th week running per data from CoinShares."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-14T18:45:12.000Z",
    "title": "$BTC: Analyst Explains How Fitch’s Downgrade of US Government’s Credit Rating Could Hurt the Bitcoin Price",
    "url": "https://www.cryptoglobe.com/latest/2023/08/btc-analyst-explains-how-fitchs-downgrade-of-us-governments-credit-rating-could-hurt-the-bitcoin-price/",
    "description": "Fitch Ratings, one of the world’s leading credit rating agencies, announced on August 1, 2023, that it had downgraded the U.S. government’s long-term foreign-currency issuer default rating. This decision, which has been closely watched by investors and analysts alike, has sparked a flurry of discussions about its potential implications, especially for the cryptocurrency market. Fitch […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-14T18:53:11.000Z",
    "title": "Singapore Red Cross To Accept Donations in Crypto",
    "url": "https://cryptodaily.co.uk/2023/08/singapore-red-cross-to-accept-donations-in-crypto",
    "description": "<p>Humanitarian aid organisation Singapore Red Cross announced it will now accept donations in the form of cryptocurrencies. Donors can contribute in Bitcoin, Ether, Tether and USD Coin. </p>\n<p>The Singapore Red Cross recently announced that it will now accept donations in cryptocurrencies via a partnership with Triple-A.</p>\nSingapore Red Cross Enables Anonymous Crypto Donations\n<p>In an effort to secure contributions from a whole new generation, the Singapore Red Cross entered into a partnership with Triple-A to enable the option of anonymous crypto donations. According to a press release, the organisation accepts Bitcoin, Ether, Tether and USD Coin.</p>\n<p>The Singapore Red Cross explained:</p>\n\n<p>&lsquo;Powered by Triple-A, payment is compatible with all wallets and provides locked-in exchange rates. You can pre-define an amount (in fiat) that you would like to give and the system will automatically do the conversion for you.&rdquo;</p>\n\n<p>Triple-A is the first crypto payment gateway licensed by the Monetary Authority of Singapore. The platform was sanctioned as a Digital Payment Token Provider by the MAS in November 2021.</p>\n<p>Secretary general and CEO of the Singapore Red Cross, Benjamin William, commented:</p>\n\n<p>&ldquo;By accepting digital currencies, we open our doors to a new segment of donors who are tech-savvy and wish to make a difference through their digital assets.&rdquo;</p>\n<p>&ldquo;Enabling cryptocurrency donations also opens more opportunities for the new generation of donors who are&nbsp;au fait&nbsp;with digital currencies to consider philanthropy and helping the vulnerable.&rdquo;</p>\n\n<p>Donors can contribute with the four above tokens or donate via a separate solution from a Binance digital wallet.</p>\n<p>Currently, crypto donations are not tax deductible.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T18:59:50.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T18:49:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T18:44:25.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices to consider when investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-14T19:00:10.000Z",
    "title": "HBAR Token Spikes 16% In One Day, Can Bulls Sustain the Momentum?",
    "url": "https://www.newsbtc.com/trending-projects/hbar-token-spikes-16-in-one-day-can-bulls-sustain-the-momentum/",
    "description": "HBAR has soared with momentum after the US Federal Reserve adopted the Hedera Hashgraph-based Dropp micropayments platform. According to the announcement, Dropp is now on the list of service providers on Fed’s FedNow instant payment system.  Following this news, HBAR&#8217;s market sentiment improved, causing a rapid price surge that propelled the token from $ 0.0561 to $0.06544. This represents an over 16% increase in the last 24 hours. However, HBAR price has crossed the overbought region, raising questions about how long the current rally can last. FedNow Adds Hedera Hashgraph-Powered Dropp To Its List Of Service Providers On July 20, the US Federal Reserve launched the FedNow instant payment system. This payment system allows banks and credit unions to transfer money for customers any time, any day, instantly. However, according to the latest development, FedNow adopted Dropp, a micropayment platform built on Hedera as a service provider. Dropp allows users to use micropayments for small-valued transactions in USD Coin (USDC), HBAR, and US dollars. Related Reading: SHIB, PEPE, APE Gain Against Bitcoin, Santiment Explains What This Means Adopting Dropp as a FedNow service provider implies that banks and other financial service providers can use the micropayment platform for real-time payments. This feat marks a milestone for Hedera as FedNow indirectly supports the token, granting the Hedera blockchain support from traditional finance companies.  Similarly, Hedera is already benefiting from this partnership as its price has increased by over 16% in the last 24 hours. Also, Hedera garnered massive investor attention in the past week due to increased partnerships, such as South Korean automobile companies Kia and Hyundai, which have adopted Hedera’s infrastructure to track vehicle carbon emissions. HBAR Price Outlook; How Long Can The Bulls Hold? HBAR soared over 16% within a few hours after the FedNow support announcement. That brought the token’s seven-day price increase to nearly 17%. In addition, HBAR’s valuation is now 25% higher than its price 30 days ago. HBAR trades at $0.065, with a day high of $0.06625 and a low of $0.05046. One remarkable thing about HBAR’s performance is the massive surge in trading volume, which signifies increased network activity and investor interest. As of the time of writing, HBAR has recorded an over 1,219% surge in 24-hour trading volume, after securing its position as the highest-gaining cryptocurrency today.  According to the daily chart, HBAR trades above two key support levels at $0.063035 and $0.06005. Moreover, the bulls have formed green bars above the support levels as they vie to push HBAR to higher highs. The Relative Strength Index is at 72. But while this signifies increased buying pressure, the sideways movement of the RSI graph suggests a weakening trend. So HBAR buyers have reached saturation and are probably about to lose momentum. Related Reading: Shiba Inu (SHIB) Poised For Golden Cross – How Will Prices React? Additionally, the faded green histogram bars show the buying demand for HBAR tokens has dwindled slightly. If this continues, the HBAR rally could stall, allowing the bears to push prices downward. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-14T19:08:15.000Z",
    "title": "Solana Competitor Hedera Welcomes Innovative Billion-Dollar Social Network – HBAR Price Skyrockets; Is It Still a Good Investment? All Details",
    "url": "https://www.crypto-news-flash.com/solana-competitor-hedera-welcomes-innovative-billion-dollar-social-network-hbar-price-skyrockets-is-it-still-a-good-investment-all-details/?utm_source=rss&utm_medium=rss&utm_campaign=solana-competitor-hedera-welcomes-innovative-billion-dollar-social-network-hbar-price-skyrockets-is-it-still-a-good-investment-all-details",
    "description": "<img width=\"1280\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Solana-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Solana-1.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Solana-1-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Solana-1-1024x576.jpg 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The Hedera chain has recorded exponential growth in DeFi protocols with over $35 million in TVL amid the mainstream adoption of digital assets. Hedera (HBAR) price gained approximately 15 percent in the past 24 to trade around $0.064 on Monday following the launch of the Calaxy social media app. The race for mainstream adoption of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-14T19:00:46.000Z",
    "title": "Bitcoin (BTC), Ethereum (ETH), and Dogecoin (DOGE) Experience Strong Volatility; Analysts Forecast 100x Price For InQubeta (QUBE) By 2024",
    "url": "https://www.crypto-news-flash.com/bitcoin-btc-ethereum-eth-and-dogecoin-doge-experience-strong-volatility-analysts-forecast-100x-price-for-inqubeta-qube-by-2024/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-btc-ethereum-eth-and-dogecoin-doge-experience-strong-volatility-analysts-forecast-100x-price-for-inqubeta-qube-by-2024",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-31.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-31.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-31-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-31-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Volatility is a common characteristic of the crypto market, causing significant price fluctuations and influencing investment decisions. Cryptocurrencies like Bitcoin (BTC), Ethereum (ETH), and Dogecoin (DOGE) are currently experiencing intense market volatility, prompting investors to seek out alternative assets. Amidst this uncertain landscape, InQubeta (QUBE) emerges as an enticing option, with analysts foreseeing a potential [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-14T18:45:28.000Z",
    "title": "Visa Tests New System for Paying Ethereum Gas Fees via Credit Card",
    "url": "https://dailyhodl.com/2023/08/14/visa-tests-new-system-for-paying-ethereum-gas-fees-via-credit-card/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Goes-Long-on-Ethereum.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Goes-Long-on-Ethereum.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Goes-Long-on-Ethereum.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Goes-Long-on-Ethereum.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Goes-Long-on-Ethereum.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Goes-Long-on-Ethereum.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Goes-Long-on-Ethereum.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Payments giant Visa is testing out a new system that would allow for the payment of Ethereum (ETH) gas fees with a credit or debit card. In a new post on Visa&#8217;s website, the firm&#8217;s researchers say that one of the biggest problems with utilizing the Ethereum network for payments is the need to settle [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/14/visa-tests-new-system-for-paying-ethereum-gas-fees-via-credit-card/\">Visa Tests New System for Paying Ethereum Gas Fees via Credit Card</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-14T18:41:53.000Z",
    "title": "Bitcoin (BTC) Dominates Attention of Institutional Investors As Capital Flows Jump: CoinShares",
    "url": "https://dailyhodl.com/2023/08/14/bitcoin-btc-dominates-attention-of-institutional-investors-as-capital-flows-jump-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/BTC-Breakout-According-pop.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/BTC-Breakout-According-pop.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/BTC-Breakout-According-pop.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/BTC-Breakout-According-pop.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/BTC-Breakout-According-pop.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/BTC-Breakout-According-pop.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/BTC-Breakout-According-pop.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says that after three weeks of outflows, digital assets finally enjoyed a week of heavy inflows from institutional investors. In its latest Digital Asset Fund Flows Weekly Report, CoinShares finds that digital assets took in $29 million last week, ending a three-week run of outflows. &#8220;Digital asset investment products saw inflows this week [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/14/bitcoin-btc-dominates-attention-of-institutional-investors-as-capital-flows-jump-coinshares/\">Bitcoin (BTC) Dominates Attention of Institutional Investors As Capital Flows Jump: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]