[
  {
    "source": "Crypto Daily",
    "date": "2023-07-16T12:00:00.000Z",
    "title": "Crypto Weekly Roundup: $XRP Soars After SEC Victory And More",
    "url": "https://cryptodaily.co.uk/2023/07/crypto-weekly-roundup-xrp-soars-after-sec-victory-and-more",
    "description": "<p>The most exciting news in the industry this week has been Ripple&rsquo;s partial win in the SEC case. Experts are opining that it could shake the market out of its rut. Let&rsquo;s find out more.&nbsp;</p>\nBitcoin\n<p>Judge Analise Torres of the Southern District of New York handed a partial win over to Ripple Labs after its three-year-long battle with the SEC.</p>\n<p>Bitcoin miners may face significant challenges due to the upcoming halving event, according to a new report by analysts from banking and finance firm JP Morgan.</p>\n<p>Europe&rsquo;s highly anticipated and long-delayed spot Bitcoin ETF is finally set to debut later this year amidst huge anticipation surrounding its imminent arrival.</p>\n<p>The US Department of Justice is finally moving the BTC reserves it seized from the Silk Road, the notorious online marketplace predominantly used for illicit activities.</p>\n<p>Vanguard Group, which manages $7.2 trillion in assets, has significantly ramped up its investments in the bitcoin mining sector, with its total stake now exceeding $560 million.</p>\n<p>The UK&rsquo;s FCA has shut down 26 cryptocurrency ATMs this year following a coordinated investigation with other law enforcement agencies.</p>\n<p>Standard Chartered Bank has presented an optimistic forecast for Bitcoin, suggesting that the leading cryptocurrency could touch the $50,000 milestone by the end of 2021.</p>\n<p>Satoshis are now being given out as rewards on Satlantis, a unique Bitcoin-themed Minecraft server.&nbsp;</p>\n<p>Democratic presidential candidate Robert F. Kennedy Jr had recently stated that he has not invested in Bitcoin, even though financial records prove otherwise.&nbsp;</p>\nEthereum\n<p>The transactions per second on the Etheruem blockchain will receive a significant boost now that Starknet&rsquo;s Quantum Leap upgrade has been deployed on the Ethereum mainnet.&nbsp;</p>\n<p>The Aave community members will be voting on whether to finally deploy gho ($GHO) on the Ethereum chain.</p>\n<p>DeFi protocol, Rodeo Finance, lost $1.53 million in Ethereum due to a code vulnerability exploitation in its Oracle.</p>\n<p>ConsenSys has announced the launch of its layer-2 network Linea, as the Ethereum ecosystem welcomed yet another scaling solution.&nbsp;</p>\nDeFi\n<p>20-year-old Argentinian Federico Jaime has publicly claimed responsibility for the $200 million Euler Finance exploit and is now under arrest in a Paris prison.</p>\n<p>Kain Warwick, the founder of the Synthetix derivatives protocol, has introduced Infinex, a new decentralized perpetuals exchange.</p>\n<p>Uniswap users can now start swapping their Avalanche tokens on the Uniswap website, as the decentralized exchange has now launched on the Avalanche network.&nbsp;</p>\n<p>DeFi platform Arcadia Finance has reportedly been the victim of an exploit which allowed hackers to drain roughly $455,000.</p>\nAltcoins\n<p>The pronouncement by the SDNY judge that XRP can only be partially classed as a security led to a massive market surge.&nbsp;</p>\n<p>Polygon, the prominent Ethereum layer 2 scaling solution, is making strides towards a significant upgrade, changing its token from $MATIC to $POL.&nbsp;</p>\nTechnology\n<p>Polkadot's founder, Gavin Wood, has proposed a major shift in how the blockchain network allocates resources.</p>\n<p>Coinbase has launched an encrypted messaging service on its self-custodial wallet app, using the open-source Web3 messaging network of Texas-based startup XMTP.&nbsp;</p>\nBusiness\n<p>Indonesia&rsquo;s Futures and Commodity Trading Regulatory Agency will launch a national cryptocurrency exchange this month.</p>\n<p>Court documents have revealed that Zac Prince, CEO of bankrupt crypto lending firm BlockFi, ignored warnings from the company&rsquo;s risk management team regarding exposure to FTX and Alameda Research.&nbsp;</p>\n<p>After a significant downturn in the crypto market, it appears that in the first half of 2023, the venture investment market, much like the price of Bitcoin, has found its bottom.&nbsp;</p>\n<p>Sam Altman&rsquo;s Worldcoin has surpassed 2 million sign-ups for its World ID program in half the time it took to reach the first million sign-ups.&nbsp;</p>\n<p>Failed cryptocurrency exchange FTX recently launched its claims portal, allowing users from around the world to file a claim.&nbsp;</p>\n<p>Crypto data firm Arkham Intelligence is under fire after privacy-conscious users discovered that the firm has been irresponsible about user data.&nbsp;</p>\nRegulation\n<p>Ripple&rsquo;s XRP skyrocketed by around 70% in the 24 hours after its landmark partial win over the SEC.&nbsp;</p>\n<p>Australian crypto investment firm, Monochrome Asset Management is working to introduce spot Bitcoin ETF on the Australian Securities Exchange.</p>\n<p>Coinbase has paused its staking operations in California, New Jersey, South Carolina, and Wisconsin as it continues discussions with their respective regulators.</p>\n<p>Alex Mashinsky, the former CEO of cryptocurrency lending platform Celsius Network, appeared in federal court last week, pleading not guilty to numerous charges, including securities fraud, commodities fraud, and wire fraud.</p>\n<p>Ripple CEO Brad Garlinghouse recently made statements which predicted a long wait before the SEC can file an appeal following Judge Torres' ruling on the Ripple case.</p>\nNFT\n<p>Starbucks&rsquo; Web3 loyalty program Odyssey has announced a collaboration with the Aku NFT collection.&nbsp;</p>\nSecurity\n<p>Blockchain security and analytics firm Chainalysis has suggested that the multimillion-dollar exploit of the Multichain Protocol could be indicative of a rug pull.&nbsp;</p>\n<p>Approval management platform Revoke introduced a new feature to combat a new crypto scam after users reported receiving \"fake approval\" requests that led to exuberant transaction fees.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-16T12:00:52.000Z",
    "title": "XRP Supporters Celebrate, Kiyosaki Says Dollar ‘Will Die,’ RFK Jr Holds Bitcoin, and More — Week in Review",
    "url": "https://news.bitcoin.com/xrp-supporters-celebrate-kiyosaki-says-dollar-will-die-rfk-jr-holds-bitcoin-and-more-week-in-review/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2222099581-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2222099581-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2222099581-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2222099581-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2222099581-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2222099581-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2222099581-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2222099581.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />This past week has been a big one for Ripple supporters, who are now celebrating what they view as at least a partial win for the digital asset XRP in the legal battle against the U.S. Securities and Exchange Commission (SEC). In other news, Rich Dad Poor Dad author Robert Kiyosaki says the USD &#x201C;will [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-16T11:48:20.000Z",
    "title": "How Companies Strike the Right Balance In Managing AI Initiatives",
    "url": "https://www.cryptopolitan.com/strike-right-balance-managing-ai-initiatives/",
    "description": "As companies embrace the potential of artificial intelligence (AI) and its transformative impact on various white-collar functions, they are faced with a critical question: Who should be responsible for managing these AI initiatives? Determining the appropriate teams and departments to oversee AI projects can be challenging, as striking the right balance between enabling experimentation and ... <a title=\"How Companies Strike the Right Balance In Managing AI Initiatives\" class=\"read-more\" href=\"https://www.cryptopolitan.com/strike-right-balance-managing-ai-initiatives/\" aria-label=\"More on How Companies Strike the Right Balance In Managing AI Initiatives\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-16T11:57:29.000Z",
    "title": "‘Crypto Queen’ Cynthia Lummis applauds XRP ruling",
    "url": "https://crypto.news/crypto-queen-cynthia-lummis-applauds-xrp-ruling/",
    "description": "Republican lawmaker and self-described crypto HODLer, Senator Cynthia Lummis, has expressed her support for the recent judgment in the SEC vs. Ripple case. Sen. Cynthia Lummis is one of crypto’s most prominent supporters on Capitol Hill. She posted on Twitter&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-16T12:02:03.000Z",
    "title": "As Monero (XMR) Volumes decline, Polygon (MATIC), Litecoin (LTC), and InQubeta (QUBE) Experience Bullish Momentum",
    "url": "https://www.crypto-news-flash.com/as-monero-xmr-volumes-decline-polygon-matic-litecoin-ltc-and-inqubeta-qube-experience-bullish-momentum/?utm_source=rss&utm_medium=rss&utm_campaign=as-monero-xmr-volumes-decline-polygon-matic-litecoin-ltc-and-inqubeta-qube-experience-bullish-momentum",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Monero.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Monero.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Monero-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Monero-343x215.jpg 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Monero-326x205.jpg 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Monero-163x102.jpg 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency market is renowned for its ever-changing and volatile characteristics. Monero (XMR) has recently witnessed a decline in trading volumes due to regulatory scrutiny of its privacy feature. Amidst Monero&#8217;s slump, other digital assets such as Polygon (MATIC), Litecoin (LTC), and InQubeta (QUBE) are currently experiencing positive market momentum. These projects offer a range [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-16T11:45:27.000Z",
    "title": "‘Crazy’ 2025 Crypto Rally Approaching, Says Investor Who Called 2022 Market Bottom",
    "url": "https://dailyhodl.com/2023/07/16/crazy-2025-crypto-rally-approaching-says-investor-who-called-2022-market-bottom/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Could-Be-Wiped.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Could-Be-Wiped.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Could-Be-Wiped.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Could-Be-Wiped.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Could-Be-Wiped.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Could-Be-Wiped.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Could-Be-Wiped.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Venture capital investor Chris Burniske says that a new crypto bull market is coming in the next couple of years which will make previous cycles look modest. Burniske, a current partner at Placeholder Capital and former analyst at ARK Invest, says that a new bull cycle is brewing, backed by a slew of new projects [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/16/crazy-2025-crypto-rally-approaching-says-investor-who-called-2022-market-bottom/\">‘Crazy’ 2025 Crypto Rally Approaching, Says Investor Who Called 2022 Market Bottom</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]