[
  {
    "source": "NewsBTC",
    "date": "2023-07-17T23:30:11.000Z",
    "title": "Bearish Signal: BNB Open Interest Skyrockets To New Highs",
    "url": "https://www.newsbtc.com/analysis/bnb/bnb-open-interest-new-highs/",
    "description": "Crypto exchange Binance has been the subject of intense regulatory scrutiny over the last few months and BNB has suffered as a result. Even now, as it seems the crypto exchange is beginning to find its footing once more amid regulatory wolves circling, its native token is still under immense selling pressure. This is evidenced by the BNB open interest, which has now skyrocketed to new all-time highs. BNB Open Interest Reaches New All-Time High In an interesting turn of events, BNB shorts are ramping up even at a time when the crypto market seems to be on a recovery trend. According to a Twitter post by analyst Dylan LeClair, this has caused the open interest in the digital asset to rise exponentially. Related Reading: Crypto Liquidations Cross $300 Million Amid Massive Market Recovery The chart shared by LeClair shows that BNB&#8217;s open interest is now sitting at $400 million. This is over four times higher than the previous all-time high for the digital asset which was $50 million back in 2020. And unlike then, the surge in open interest right now is more bearish than it is bullish. Hmmm, some interesting flow in $BNB futures: &#8211; Perpetual futures open interest is seeing new highs as funding rates have gone deeply negative (-200% APR for next funding period) (Chart #1) &#8211; looks as if someone is getting ahead of some bad news flow. &#8211; The last time BNB… pic.twitter.com/1B27OkjvPx — Dylan LeClair 🟠 (@DylanLeClair_) July 17, 2023 This current increase has seen funding rates move above negative 200% and yet traders continue to short the altcoin. The fact that traders are choosing this route despite the high cost to do so points to the expectations of a massive crash coming for the digital asset. As LeClair points out, this could mean that the United States Department of Justice (DoJ) is finally leveling charges against the crypto exchange. “And people in the know are positioning accordingly.” Will The Altcoin Survive a DoJ Lawsuit? As already demonstrated by the Securities and Exchange Commission’s (SEC) lawsuit against the Binance crypto exchange, a lawsuit from regulators would have an adverse impact on the price of BNB. When the SEC sued the exchange in early June, the price of BNB plummeted by over 20% over a few days period.  BNB price continues to hold above $240 &#124; Source: BNBUSD on TradingView.com Given such a response, a lawsuit from the DoJ would be even worse because of its implications. And if this were to happen this week, then another 20% decline from here would see the digital asset lose its footing above $200. Related Reading: Polygon Upgrade Proposal Pushes Price Over 5%, Is It Too Late To Buy? For right now, the price of BNB is still holding up nicely above $240. One reason for this could be the Arkham sale being carried out on the Binance launchpad. As this sale requires BNB for subscriptions to participate, it has provided temporary buy pressure for investors to participate. However, once the sale ends on July 18, this temporary plug would be eliminated and the cryptocurrency will likely fall back to the $230 territory. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from Currency.com, chart from TradingView.com"
  }
]