[
  {
    "source": "NewsBTC",
    "date": "2024-03-17T06:51:30.000Z",
    "title": "MATIC Price Slumps 10% Amidst Market Downturn – Here Are Key Levels To Watch",
    "url": "https://www.newsbtc.com/matic/matic-price-slumps-10-amidst-market-downturn-here-are-key-levels-to-watch/",
    "description": "MATIC, the native token of the Polygon network, has witnessed a significant decline in its value. It has fallen by more than 10% in the past week and 8% in less than 24 hours as the general cryptocurrency market continues to grapple with a cloud of negative sentiment. Fortunately, the latest on-chain analysis has revealed the important levels that investors should look out for following the latest decline in the MATIC price. Over 10,900 Addresses Bought 600 Million Polygon Tokens At This Price According to a recent post on X by crypto pundit Ali Martinez, the price of MATIC has established a key support around its current price point. This evaluation is based on analytics firm IntoTheBlock’s on-chain data, which tracks the average acquisition price for any given wallet address. &#160; The distribution of the Polygon token supply across various price ranges &#124; Source: Ali_charts/X Above is the chart highlighted by Martinez that shows the distribution of the Polygon token supply across various price ranges. The size of the dots in the chart represents the magnitude of coins purchased around the corresponding price range. Related Reading: Post-Halving Pressure: Marathon Digital Anticipates Bitcoin Break-Even Price Of $43,000 Most notably, over 10,900 wallet addresses bought a whopping 608 million MATIC around the $1.02 and $1.05 zone. According to the crypto analyst, this massive buying activity has supported the establishment of crucial support around this price region. #Polygon has found crucial support between $1.02 and $1.05, supported by 10,900 addresses holding around 608 million #MATIC. Should this support falter, the next essential demand zone lies near $0.91, where 35,700 addresses collectively hold 394.6 million $MATIC. pic.twitter.com/rLn4ymcQf7 — Ali (@ali_charts) March 16, 2024 While the large size of the dot reflects the strength of this particular level, sustained bearish pressure could cause the price of MATIC to breach and fall beneath this support. In this case, investors could see the cryptocurrency drop to around $0.91. This makes the $0.89 and $0.92 price range another level to watch, as it represents the next vital support area, where 35,680 wallet addresses purchased nearly 400 million Polygon tokens. MATIC Price Overview As of this writing, the price of MATIC stands at $1.04, reflecting an 8% decline in the past 24 hours. This price dip comes after the altcoin printed a multi-month high of $1.28 on Thursday, March 14. According to data from CoinGecko, the Polygon coin has suffered a 9.7% price slump in the last seven days. From a broader perspective, though, the cryptocurrency has had a fairly positive performance in the past month. Related Reading: XRP Records Massive 80% Surge In Trading Volume – Can Price Reach A New ATH? With a market capitalization of more than $9.7 billion, the MATIC token ranks as the 18th-largest cryptocurrency in the sector. MATIC price finds support around $1.04 on the daily timeframe &#124; Source: MATICUSDT chart on TradingView Featured image from Getty Images, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-17T07:04:55.000Z",
    "title": "Top Trader Says Bitcoin Trend Showing Change in Character, Warns BTC Flashing Multiple Bearish Signals",
    "url": "https://dailyhodl.com/2024/03/17/top-trader-says-bitcoin-trend-showing-change-in-character-warns-btc-flashing-multiple-bearish-signals/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Highly-Convinced-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Highly-Convinced-Bitcoin.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Highly-Convinced-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Highly-Convinced-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Highly-Convinced-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Highly-Convinced-Bitcoin.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Highly-Convinced-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A trader who rode the 2023 crypto breakout is warning that Bitcoin&#8217;s (BTC) strong uptrend is flashing signs of weakness for the first time since the spot market exchange-traded funds (ETFs) were approved in January. In a new strategy session, pseudonymous trader DonAlt tells his 58,000 YouTube subscribers that BTC&#8217;s strong uptrend this year is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/17/top-trader-says-bitcoin-trend-showing-change-in-character-warns-btc-flashing-multiple-bearish-signals/\">Top Trader Says Bitcoin Trend Showing Change in Character, Warns BTC Flashing Multiple Bearish Signals</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]