[
  {
    "source": "Cointelegraph",
    "date": "2023-06-12T08:15:45.000Z",
    "title": "Attacker drains $800K from DeFi protocol Sturdy Finance",
    "url": "https://cointelegraph.com/news/attacker-drains-800k-from-defi-protocol-sturdy-finance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a684befe-d0c9-4c73-ab8a-fc1cf586525e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The lending platform responded by pausing all markets and assuring its community that no additional funds were at risk.</p>\n                    <p><p><a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">Decentralized finance (DeFi)</a> protocol Sturdy Finance has lost 442 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), worth almost $800,000 when writing, to a security exploit. The attacker exploited a vulnerability that eventually manipulated a faulty price oracle, allowing them to drain funds from the protocol. </p><p>On June 12, blockchain security firm PeckShield <a href=\"https://twitter.com/peckshield/status/1668067645638299648\" target=\"_blank\" rel=\"noopener nofollow\">alerted</a> Sturdy Finance and reported a transaction that seemed to be related to price manipulation. Almost an hour later, the DeFi protocol said that they were aware of the exploit and responded by pausing all their markets and assuring its users that no additional funds were at risk. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We are aware of the reported exploit of the Sturdy protocol. All markets have been paused; no additional funds are at risk and no user actions are required at this time.<br><br>We will be sharing more information as soon as we have it.</p>&mdash; Sturdy  (@SturdyFinance) <a href=\"https://twitter.com/SturdyFinance/status/1668080627030315009?ref_src=twsrc%5Etfw\">June 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Despite a swift response from the DeFi lending platform, PeckShield <a href=\"https://twitter.com/PeckShieldAlert/status/1668070638819606528\" target=\"_blank\" rel=\"noopener nofollow\">confirmed</a> that the attacker was able to transfer almost $800,000 in ETH to the crypto mixer Tornado Cash. The security firm also noted that the “root cause” of the exploit was a faulty price oracle.</p><p>Additionally, the blockchain security company BlockSec highlighted that the hack was done through a reentrancy attack, which is a common method hackers use to withdraw funds from DeFi protocols. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ <a href=\"https://twitter.com/SturdyFinance?ref_src=twsrc%5Etfw\">@SturdyFinance</a> was attacked and the loss is ~442 ETH. The root cause is due to the typical Balancer&#39;s read-only reentrancy, while the price of B-stETH-STABLE was manipulated! <a href=\"https://t.co/5l9mVfhpQN\">pic.twitter.com/5l9mVfhpQN</a></p>&mdash; BlockSec (@BlockSecTeam) <a href=\"https://twitter.com/BlockSecTeam/status/1668084629654638592?ref_src=twsrc%5Etfw\">June 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Through the method, hackers exploit the ability to repeatedly call a function in a single transaction before the initial function call is complete. With this, hackers can withdraw more funds than should be possible. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/atomic-wallet-hacker-sends-crypto-mixer-elliptic\"><strong><em>Atomic Wallet hacker sends crypto to mixer used by Lazarus Group: Elliptic</em></strong></a></p><p>Meanwhile, scammers were able to <a href=\"https://cointelegraph.com/news/scammers-steal-almost-1m-after-hijacking-8-prominent-crypto-twitter-accounts\">take control of eight Twitter accounts</a> of prominent crypto community members and promote crypto scams. According to blockchain detective ZachXBT, the scammers have stolen almost $1 million in crypto after taking control of the accounts of famous DJ Steve Aoki, Pudgy Penguins founder Cole Villemain, and even crypto hater Peter Schiff. </p><p>In other news, the United States Justice Department has recently charged two men who are allegedly <a href=\"https://cointelegraph.com/news/us-justice-department-charges-two-men-in-mt-gox-hack\">involved in the Mt. Gox hack</a>. According to the department, 43-year-old Alexey Bilyuchenko and 29-year-old Aleksandr Verner allegedly stole and conspired to launder 647,000 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/3-4-billion-bitcoin-popcorn-tin-silk-road-hacker/\"><strong><em>$3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-12T08:30:34.000Z",
    "title": "Iran and Russia Talk Crypto Cooperation, Unveil Tool Streamlining Trade in National Currencies",
    "url": "https://news.bitcoin.com/iran-and-russia-talk-crypto-cooperation-unveil-tool-streamlining-trade-in-national-currencies/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1352404121-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Iran and Russia Talk Crypto Cooperation, Unveil Tool Streamlining Trade in National Currencies\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1352404121-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1352404121-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1352404121-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1352404121-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1352404121-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1352404121-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1352404121.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Experts and business representatives from Iran and Russia have discussed the potential uses of cryptocurrencies and blockchain. The two countries are also collaborating on implementing new financial instruments facilitating bilateral trade in their national fiats. Financial Expo Brings Together Crypto Experts From Russia and Iran Business leaders and industry professionals from Iran and Russia have [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T08:37:39.000Z",
    "title": "How to Apply Network Models for Automated Cryptocurrency Portfolio Management",
    "url": "https://www.cryptopolitan.com/network-models-automated-cryptocurrency-portfolio-management/",
    "description": "Cryptocurrencies have recently gained significant attention and popularity, attracting individual investors and institutional players. As the cryptocurrency market continues to evolve, so does the need for effective portfolio management strategies that can adapt to these digital assets&#8217; volatile and complex nature. Automated portfolio management systems have emerged as a promising solution to manage and optimize ... <a title=\"How to Apply Network Models for Automated Cryptocurrency Portfolio Management\" class=\"read-more\" href=\"https://www.cryptopolitan.com/network-models-automated-cryptocurrency-portfolio-management/\" aria-label=\"More on How to Apply Network Models for Automated Cryptocurrency Portfolio Management\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T08:32:32.000Z",
    "title": "Winklevoss twins warn democrats of alienating youth voters with anti-crypto stance",
    "url": "https://www.cryptopolitan.com/winklevoss-twins-warn-democrats-of-alienating-youth-voters-with-anti-crypto-stance/",
    "description": "Renowned crypto billionaires Cameron and Tyler Winklevoss have issued a cautionary message to the Democratic Party, emphasizing the risk of losing crucial youth voters due to their perceived &#8220;war on crypto.&#8221; The twin brothers, who co-founded the Gemini cryptocurrency exchange, contend that the party&#8217;s anti-crypto stance, championed by figures like Senator Elizabeth Warren and SEC ... <a title=\"Winklevoss twins warn democrats of alienating youth voters with anti-crypto stance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/winklevoss-twins-warn-democrats-of-alienating-youth-voters-with-anti-crypto-stance/\" aria-label=\"More on Winklevoss twins warn democrats of alienating youth voters with anti-crypto stance\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T08:23:38.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T08:20:35.000Z",
    "title": "How Cryptos Dancing In Co-Movement Can Help You Diversify Your Portfolio",
    "url": "https://www.cryptopolitan.com/high-frequency-volatility-co-movement/",
    "description": "In the ever-evolving realm of digital finance, cryptocurrencies have emerged as a revolutionary force, captivating the imagination of investors and technologists alike. Beyond the allure of decentralized transactions and cutting-edge blockchain technology, the volatile nature of cryptocurrency markets has become a subject of intense fascination. One intriguing phenomenon that has garnered significant attention is the ... <a title=\"How Cryptos Dancing In Co-Movement Can Help You Diversify Your Portfolio\" class=\"read-more\" href=\"https://www.cryptopolitan.com/high-frequency-volatility-co-movement/\" aria-label=\"More on How Cryptos Dancing In Co-Movement Can Help You Diversify Your Portfolio\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T08:12:16.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the runoff on the FTX cryptocurrency exchange and the failed attempt of a takeover by Binance. The entire fiasco started after Binance’s CZ expressed doubts about the integrity of Almeda&#8217;s research, a trading affiliate of FTX. The tweet ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-12T08:12:08.000Z",
    "title": "TMS Network (TMSN): The Unwavering Titan Defying BNB (BNB) and Solana (SOL)’s Hasty Retreat",
    "url": "https://nulltx.com/tms-network-tmsn-the-unwavering-titan-defying-bnb-bnb-and-solana-sols-hasty-retreat/",
    "description": "It is no news that the cryptocurrency world is very competitive, and newer projects are always struggling to survive, as the old ones usually have all the advantages. This is not the case for TMS Network (TMSN), though, as its entry into the crypto space has defied rules and caused serious upset that has disturbed [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-12T08:34:56.000Z",
    "title": "Pepecoin Price Drops, Breaking Key Support Level – Further Downfall Ahead?",
    "url": "https://www.newsbtc.com/news/pepecoin-price-drops-breaking-key-support-level-further-downfall-ahead/",
    "description": "Pepecoin (PEPE) has been grappling with a prolonged correction trend, finding itself caught in the midst of heightened selling pressure prevailing throughout the cryptocurrency market.  As the downtrend persists, new lower lows and lower highs have solidified the notion of an established downward trajectory for this peculiar meme coin. In the latest turn of events, the price of PEPE recently breached yet another local support level, dropping below $0.00000096.  With this significant breach, an ominous question arises: Is the frog-themed token headed for further downfall or could there be a potential reversal in store for this once-popular coin. Pepecoin Price Takes A Beating As Social Volume Declines Pepecoin (PEPE) has undergone a substantial price decline, as evidenced by data provided by CoinGecko, which indicates a decrease of 4.9% within the past 24 hours. Moreover, PEPE has witnessed a significant slump of 25.7% over the course of the last seven days, further emphasizing the cryptocurrency&#8217;s continued downward trajectory. Source: Coingecko Despite the disappointing state of PEPE&#8217;s value, its social volume has remained relatively high throughout the previous week. However, this metric has reached its lowest point at the time of writing, marking a trend that began on June 8. Related Reading: BNB Displays Short-Term Bullish Momentum Amidst Massive Binance Outflows Social volume refers to the measurement of search volume associated with an asset. Therefore, the recent decrease in social volume suggests that the fervent pursuit of this meme-based coin has diminished. PEPE Social Volume. Source: Santiment Declining Network Growth Raises Concerns For PEPE PEPE’s potential for another price hike is further challenged as on-chain data reveals a decline in network growth. Traditionally, network growth serves as a metric to monitor the number of new addresses adopting a token. Related Reading: Bleak Dogecoin (DOGE) Social Sentiment Raises Questions About Price Reversal As of June 10, the network growth indicator was recorded at 287, signaling a notable decrease. This decline suggests that PEPE&#8217;s previous effective strategy for gaining popularity has lost its effectiveness. The recent development in the PEPE market reveals a rather modest increase in the number of holders, with approximately 7,000 new individuals joining the ranks. Although this figure may seem relatively small in the grand scheme of things, it does provide a glimmer of positivity for the short-term price outlook of PEPE. Crypto total market cap currently at $1.01 trillion on the daily chart at TradingView.com The addition of these new holders suggests that there is a certain level of interest or confidence in the market, which could be influenced by various factors such as positive news developments or favorable market sentiment. However, it&#8217;s important to note that the impact of these new holders on the price of PEPE may not be substantial on its own, as other market dynamics and external factors will also come into play. Uncertain Outlook For PEPE Amidst Challenging Market Conditions Looking ahead, Pepecoin faces an uphill battle in revitalizing its fortunes. The figures below show that the coin has been soaked in red since the last month, a sign that more pain could be on the horizon. Source: Coingecko Meanwhile, with limited growth in the number of holders and minimal positive expectations for the short-term price, PEPE must navigate the challenging landscape of the crypto market.  It will require innovative strategies and unique value propositions to regain investor confidence and attract new participants. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk) Featured image from Brian Gray/Aquarium of the Pacific"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-12T08:20:55.000Z",
    "title": "Andreessen Horowitz (a16z) Plans U.K. Office Amid U.S. Crypto Tensions",
    "url": "https://coinedition.com/andreessen-horowitz-a16z-plans-u-k-office-amid-u-s-crypto-tensions/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Andreessen_Horowitz_announces_first_international_expansion—a_U-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Andreessen_Horowitz_announces_first_international_expansion—a_U-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Andreessen_Horowitz_announces_first_international_expansion—a_U-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Andreessen_Horowitz_announces_first_international_expansion—a_U.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>VC firm Andreessen Horowitz (a16z) is venturing into the U.K. crypto scene, establishing its first overseas office in London. This move comes amidst rising regulatory tensions in the U.S., leading to the firm eyeing the U.K. as a potentially more hospitable environment for cryptocurrency ventures. The new branch will spearhead a16z&#8217;s crypto fund operations under [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/andreessen-horowitz-a16z-plans-u-k-office-amid-u-s-crypto-tensions/\">Andreessen Horowitz (a16z) Plans U.K. Office Amid U.S. Crypto Tensions</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]