[
  {
    "source": "CryptoGlobe",
    "date": "2023-10-17T21:46:39.000Z",
    "title": "Cardano ($ADA): Forging the Future of Decentralized Finance",
    "url": "https://www.cryptoglobe.com/latest/2023/10/cardano-ada-forging-the-future-of-decentralized-finance/",
    "description": "Influencers from the crypto community often provide unique insights into Cardano’s journey. Yesterday, Dan Gambardello, Founder of Crypto Capital Venture, as well as the host of the very popular YouTube channel “Crypto Capital Venture,” wrote that the crypto market’s strong rally in response to the fake news about the U.S. SEC approving the first-ever spot Bitcoin […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-17T22:07:34.000Z",
    "title": "Expert Price Breakdown: The Truth Behind Dogecoin (DOGE), Shiba Inu (SHIB), Pepe (PEPE) Upcoming Trends",
    "url": "https://cryptodaily.co.uk/2023/10/expert-price-breakdown-the-truth-behind-dogecoin-doge-shiba-inu-shib-pepe-pepe-upcoming-trends",
    "description": "Explore expert insights on the future of meme coins: Dogecoin (DOGE), Shiba Inu (SHIB), and PEPE. From price predictions to strategic moves and controversies, get the in-depth analysis on where these tokens are headed in the crypto market."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T21:46:07.000Z",
    "title": "From Wall Street to crypto: The lure of spot Bitcoin ETFs",
    "url": "https://www.cryptopolitan.com/wall-street-crypto-lure-of-spot-bitcoin-etfs/",
    "description": "Ever get the feeling that Wall Street&#8217;s venerable giants are lured, just like the rest of us, to the siren call of cryptocurrencies? Not so long ago, traditional finance wouldn&#8217;t touch Bitcoin with a ten-foot pole. Now, they&#8217;re clamoring to jump on the Bitcoin ETF bandwagon. Why? Let&#8217;s dive into the muck and dissect what&#8217;s ... <a title=\"From Wall Street to crypto: The lure of spot Bitcoin ETFs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wall-street-crypto-lure-of-spot-bitcoin-etfs/\" aria-label=\"More on From Wall Street to crypto: The lure of spot Bitcoin ETFs\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-17T22:00:25.000Z",
    "title": "Chinese Developers Eager To Build On Solana: Will SOL Breeze Past $30?",
    "url": "https://www.newsbtc.com/news/solana/chinese-developers-build-solana-sol-30/",
    "description": "China developers are active and willing to build on leading blockchain platforms if statistics from Solana Hyperdrive Hackathon submission details are anything to go by. In an X post on October 17, Matty Taylor, the Head of Growth at the Solana Foundation, said there were far more developers from China who submitted applications, willing to participate in the Solana Hyperdrive hackathon than from the United States.  Solana Attracting Chinese Developers The hackathon has a prize pool of $1 million, and all submissions had to be submitted by October 15. It is an online event aiming to &#8220;nurture and expand&#8221; the Solana ecosystem.  Developers from 68 countries submitted, with the highest numbers coming from China and Vietnam. The rest were mainly from the United States, India, Mexico, Turkey, and Germany. That notable participation from Chinese developers can be a massive boost for Solana, indicating that the blockchain could be popular in the Asian economic powerhouse. China remains pro-blockchain and believes that the technology can give them an edge and even improve efficiency in some critical sectors, like agriculture, healthcare, governance, and finance, that the country seeks to enhance gradually.  Related Reading: Ripple Job Posting Sparks IPO Rumors, Will XRP Price Finally Cross $100? However, China has banned crypto trading and mining, citing the &#8220;need to go green, protect consumers, and ensure financial stability.&#8221; The Chinese central bank, PBoC, said cryptocurrencies could pose a risk to the country&#8217;s financial system. Unlike Ethereum, Solana permits fast transaction processing and is relatively scalable with decent activity. Although the project suffered following the collapse of FTX in November 2022, there has been a revival in price and on-chain activity. The Revival, Will SOL Breach $30? To illustrate, non-fungible token (NFT) trading activity on Solana has steadily risen over the past few months. While there was a spike, the network didn&#8217;t halt, as in previous instances, especially in 2022.  Related Reading: Polkadot Road To Recovery – Will $4 Mark The Turning Point? Instead, the high reliability seems to have inspired activity, directly helping revive SOL prices that collapsed by over 90%, worsened by news that Sam Bankman-Fried and Alameda Research allegedly embezzled customer funds. FTX had invested in Solana and has a considerable share of SOL, which will be liquidated and reimbursed to impacted clients. At spot rates, SOL is up 36% from September 2023 lows and overly firm. Looking at the candlestick arrangement in the daily chart, SOL is trading at October and 2023 highs and could break higher if bulls press on. The October 16 bull bar is wide-ranging, has marked trading volumes, and could anchor the next leg towards July 2023 highs of around $32. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-17T22:08:00.000Z",
    "title": "Global Banking Regulators Introduce New Rules for Crypto Asset Disclosure",
    "url": "https://coinedition.com/global-banking-regulators-introduce-new-rules-for-crypto-asset-disclosure/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Analyst-Warns-About-Traditional-Banking-System-Turning-on-Itself.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Global Banking Regulators Introduce New Rules for Crypto Asset Disclosure\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Analyst-Warns-About-Traditional-Banking-System-Turning-on-Itself.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Analyst-Warns-About-Traditional-Banking-System-Turning-on-Itself-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Analyst-Warns-About-Traditional-Banking-System-Turning-on-Itself-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Analyst-Warns-About-Traditional-Banking-System-Turning-on-Itself-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Analyst-Warns-About-Traditional-Banking-System-Turning-on-Itself-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Analyst-Warns-About-Traditional-Banking-System-Turning-on-Itself-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Basel Committee of Banking, regulated by the world’s main financial centers, proposed a standardized format for major banks to disclose their holdings of crypto assets. The proposal would be implemented in January 2025. Reuters reported that the global banking regulators announced on October 17 that if major banks disclosed their crypto asset holdings, it [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/global-banking-regulators-introduce-new-rules-for-crypto-asset-disclosure/\">Global Banking Regulators Introduce New Rules for Crypto Asset Disclosure</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-17T22:01:10.000Z",
    "title": "Fantom Foundation Hacked for Over $7,000,000 Worth of Ethereum (ETH) and FTM: Report",
    "url": "https://dailyhodl.com/2023/10/17/fantom-foundation-hacked-for-over-7000000-worth-of-ethereum-eth-and-ftm-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/01/fantom-gunning-for-highs.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/01/fantom-gunning-for-highs.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/01/fantom-gunning-for-highs.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/01/fantom-gunning-for-highs.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/01/fantom-gunning-for-highs.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/01/fantom-gunning-for-highs.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/01/fantom-gunning-for-highs.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The foundation behind the Ethereum (ETH) rival Fantom (FTM) just suffered a major exploit, according to blockchain security experts. According to posts on social media platform X from CertiK Alert, wallets belonging to the Fantom Foundation have just been drained of ETH and FTM. &#8220;Fantom Foundation wallets have been drained on Ethereum and Fantom So [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/17/fantom-foundation-hacked-for-over-7000000-worth-of-ethereum-eth-and-ftm-report/\">Fantom Foundation Hacked for Over $7,000,000 Worth of Ethereum (ETH) and FTM: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]