[
  {
    "source": "NewsBTC",
    "date": "2023-06-08T02:00:45.000Z",
    "title": "Binance Coin (BNB) At Risk: $200 Million Liquidation Looms",
    "url": "https://www.newsbtc.com/analysis/bnb/binance-coin-bnb-at-risk-200-million-liquidation-looms/",
    "description": "Binance Coin (BNB) has been one of the top-performing cryptocurrencies in recent years, with its value rising significantly since its launch in 2017. However, the coin has experienced a sharp decline in value following the recent Securities and Exchange Commission (SEC) complaint against Binance.US and increased regulatory oversight by the US watchdog. Currently, BNB is trading at $260, down by over 7% and 14% in 24 hours and the last seven days, respectively. This drop has been attributed to the recent regulatory scrutiny, as well as broader market trends. Related Reading: Bitcoin 24-Hour Volatility Soars, Why Bulls Could Win Fight In Short-Term BNB Price Drop Spells Trouble The BNB bridge suffered an exploit that has put Binance Coin in a precarious position, with a potential liquidation of $200 million on Venus Decentralized Autonomous Organization (DAO) looming if the price drops by 14% to $220.  Venus DAO is a community-driven organization that governs the Venus Protocol, which is a decentralized lending and borrowing platform built on the Binance Smart Chain. The Venus Protocol allows users to borrow and lend cryptocurrencies, and earn interest on their holdings. According to the researcher DeFi Ignas, the exploit occurred on October 7th, 2022, when an attacker minted 2 million BNB ($593 million)) and deposited 900,000 BNB as collateral to Venus. They then borrowed other assets on Venus to launder as much money as possible. This is the single largest potential liquidation in all of Decentralized Finance (DeFi) and cannot be closed. Following the exploit, BNB Chain was halted to upgrade the network, and the Binance Bridge hack now ranks as the third-largest overall hack. All three of the top hacks have been cross-chain bridge exploits, highlighting the vulnerabilities of the DeFi ecosystem. According to Ignas, to prevent any cascading liquidations, the BNB Chain will liquidate the position itself. However, the good news is that Venus DAO has voted to whitelist BNB Chain as the sole liquidator of the BNB exploiter address. This move should help to prevent any further market disruptions and provide some stability to the market. Binance.US Netflow Plummets Blockchain and data research firm Nansen has reported that the net outflows from major cryptocurrency exchanges Binance and Coinbase have decreased in the 24 hours following the news of the SEC&#8217;s lawsuit against Coinbase. The outflows retraced to $491.9M and $105.3M, respectively. This is in contrast to the situation 24 hours after the SEC sued Binance when Binance&#8217;s netflow was $78M positive. However, after the SEC filed to seek a temporary restraining order to freeze Binance&#8217;s US assets, Binance&#8217;s netflow turned negative, dropping to -$123.6M. Related Reading: Late Evidence In Criminal Trial Irks SBF, FTX Explores Options For AI Stock Sale The decrease in net outflows from Binance and Coinbase suggests that investors are becoming more cautious in light of the SEC&#8217;s legal actions against major cryptocurrency exchanges. The SEC&#8217;s lawsuit against Coinbase, in particular, has raised concerns about the regulatory scrutiny faced by the crypto industry as a whole. Featured image from Unsplash, chart from TradingView.com  &#160;"
  }
]