[
  {
    "source": "CoinDesk",
    "date": "2024-01-02T21:53:36.000Z",
    "title": "Coinbase Buckles 10% as Crypto Stocks Falter Despite Bitcoin Topping $45K",
    "url": "https://www.coindesk.com/markets/2024/01/02/coinbase-buckles-10-as-crypto-stocks-falter-despite-bitcoin-topping-45k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The decline happened as bitcoin spiked above $45,000 during the day as traders anticipate an imminent spot BTC ETF decision in the U.S."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-02T21:43:54.000Z",
    "title": "Solana NFT Sales Skyrocket, Topping Ethereum in Monthly Volume for First Time",
    "url": "https://decrypt.co/211547/solana-nft-sales-skyrocket-ethereum-monthly-volume",
    "description": "Rising momentum around Solana catapulted NFT sales above Ethereum in December, according to data from CryptoSlam."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-02T22:00:54.000Z",
    "title": "Spot Bitcoin ETFs could get end-of-week approval, FOX reporters say",
    "url": "https://cryptoslate.com/spot-bitcoin-etfs-could-get-end-of-week-approval-fox-reporters-say/",
    "description": "<p>FOX Business reporters suggested on Jan. 1 that various pending spot Bitcoin ETFs could be approved by the end of the week. Journalist and producer Eleanor Terrett said that the U.S. Securities and Exchange Commission (SEC) has more work to do prior to approvals, writing: &#8220;&#8230; It would surprise me if approvals were to happen [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/spot-bitcoin-etfs-could-get-end-of-week-approval-fox-reporters-say/\">Spot Bitcoin ETFs could get end-of-week approval, FOX reporters say</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-02T22:00:17.000Z",
    "title": "Survey: Crypto voters prefer Democrats for Congress, favor Trump for president",
    "url": "https://crypto.news/survey-crypto-voters-prefer-democrats-for-congress-favor-trump-for-president/",
    "description": "A recent poll by the Crypto Council for Innovation offers insights into the political preferences of crypto voters, potentially influencing the 2024 elections."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-02T21:55:19.000Z",
    "title": "Bitcoin ETF will attract pension funds and RIAs, says CBOE digital chief",
    "url": "https://crypto.news/bitcoin-etf-will-attract-pension-funds-and-rias-says-cboe-digital-chief/",
    "description": "John Palmer, the president of crypto clearing house CBOE Digital, anticipates a significant influx of institutional investment into Bitcoin as soon as the SEC greenlights the first-ever spot ETF. "
  },
  {
    "source": "BTCManager",
    "date": "2024-01-02T21:52:53.000Z",
    "title": "Vitalik Buterin made $19m within week amid market enthusiasm",
    "url": "https://crypto.news/vitalik-buterin-made-19m-within-week-amid-market-enthusiasm/",
    "description": "The total value of cryptocurrencies held by Ethereum co-founder Vitalik Buterin has increased by $19 million over the past week amid a broader resurgence in the digital asset markets."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-02T21:47:32.000Z",
    "title": "China experiencing increased crypto-related corruption, bribery cases",
    "url": "https://crypto.news/china-experiencing-increased-crypto-related-corruption-bribery-cases/",
    "description": "China is currently facing a significant increase in corruption and criminal activities linked to cryptocurrencies and digital financial instruments. "
  },
  {
    "source": "BTCManager",
    "date": "2024-01-02T21:43:55.000Z",
    "title": "K33 Research: Approval of Bitcoin ETFs will cause bearish trend",
    "url": "https://crypto.news/k33-research-approval-of-bitcoin-etfs-will-cause-bearish-trend/",
    "description": "As the verdict on spot Bitcoin ETFs approaches between Jan. 8 and Jan. 10, market analysts, including K33 Senior Analyst Vetle Lunde, predict a sell-the-news scenario."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-02T22:00:29.000Z",
    "title": "Sei V2 Code Is “Functionally” Complete, Audit Ongoing: New All-Time High Incoming?",
    "url": "https://www.newsbtc.com/altcoin/sei-v2-code-functionally-complete-audit-ongoing/",
    "description": "Taking to X on January 2, Jay Jog, the co-founder of Sei, Sei V2, is functionally &#8220;code complete&#8221; with Zellic and OtterSec, two blockchain security firms, auditing the code base. This development comes as the platform&#8217;s native coin, SEI, continues to surge, reaching all-time highs just four months after the launch of the high-performance blockchain in August. What&#8217;s The Big Deal About Sei V2? Once it launches in Q1 2024, Sei V2 will introduce a parallelized Ethereum Virtual Machine (EVM). According to developers, this model combines the best features of Solana and Ethereum, possibly driving Sei adoption and propping up SEI prices. Of note, the Sei V2 code base will introduce three major upgrades. One is that Sei Network will now be compatible with Ethereum following the planned support for the EVM. Herein, Sei aims to leverage Ethereum&#8217;s popularity, especially among developers, tooling, and wallets.  Related Reading: $3,830 &#38; $5,100 Next Major Ethereum Targets According To This Model The goal, Jog explained in a post on X, is to ensure the integration is smooth without compatibility issues. With V2, Sei users will connect with the mainnet using popular Ethereum and EVM-compatible wallets like MetaMask. However, a big addition in Sei V2 will be the actualization of Optimistic Parallelization. This feature will give developers more flexibility and leeway, preventing them from defining dependencies between transactions. Instead, Sei developers say this option allows the blockchain to automatically handle parallelization for transactions to be processed efficiently and cheaply. To enhance full node efficiency and mitigate state bloat, Sei V2 introduces SeiDB as a new storage method. Implementing this update is expected to maintain Sei Network&#8217;s resilience while improving its performance. Sei To Outperform Ethereum Layer-2s, Will Prices Follow Suit? How SEI prices will react once this update is integrated remains to be seen. For now, developers are upbeat, claiming that Sei V2 will drastically enhance the mainnet capability, allowing it to process transactions faster than Ethereum layer-2 solutions like Base and Arbitrum. In November, Jog claimed that Sei V2 had a theoretical throughput of 12,500 TPS. Related Reading: Crypto Analyst Predicts XRP Price Breakout To $22.39, Here’s When Ahead of this, SEI bulls are resilient, and prices continue to trend higher. SEI is already up 11X after launching in August 2023, trading around all-time highs.  Looking at the candlestick arrangement in the daily chart, buyers are pushing higher, with the bull bar of January 1 thrusting the coin to new levels. For traders, key support levels to watch in the days ahead are $0.55, marking January 1 lows, and $0.40, if there is a cool-off. Feature image from Canva, chart from TradingView"
  }
]