[
  {
    "source": "Bitcoin.com",
    "date": "2023-12-15T05:00:57.000Z",
    "title": "Coinbase International Exchange Launching Spot Crypto Trading",
    "url": "https://news.bitcoin.com/coinbase-international-exchange-launching-spot-crypto-trading/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/coinbase-international-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/coinbase-international-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/coinbase-international-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/coinbase-international-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/coinbase-international-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/coinbase-international-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/coinbase-international-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/coinbase-international.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Coinbase International is launching spot crypto trading for non-U.S. customers. &#x201C;The launch and expansion of spot trading on Coinbase International Exchange will occur over several phases,&#x201D; Coinbase detailed. &#x201C;Our primary focus at the outset will be to build liquidity and create a robust foundation. In the coming months, we plan to expand the product to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-15T04:54:25.000Z",
    "title": "AI Enhances Global Climate Models for Accurate Extreme Precipitation Forecasting",
    "url": "https://www.cryptopolitan.com/ai-enhances-global-climate-models/",
    "description": "Researchers at the Karlsruhe Institute of Technology (KIT) have harnessed the power of artificial intelligence (AI) to significantly improve the precision of global climate models in predicting extreme precipitation events. These advancements respond to the increasing challenges of climate change, particularly the elevated risk of natural disasters such as floods and landslides resulting from intense [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-15T04:41:49.000Z",
    "title": "Memeinator or Dogelon Mars: What Is the Next Big Crypto For 2024?",
    "url": "https://www.cryptopolitan.com/memeinator-or-dogelon-mars-what-is-the-next-big-crypto-for-2024/",
    "description": "In the dynamic battleground of meme coins, two forces stand ready to duel for dominance in 2024 for the title of the next big crypto. Memeinator (MMTR) is where imagination merges with financial growth, while Dogelon Mars gears up for its most significant challenge yet.&#160; Read on to find out which digital titan will reign [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-15T04:41:06.000Z",
    "title": "Ledger CEO Pascal Gauthier Addresses Recent Hacking Incident",
    "url": "https://www.cryptopolitan.com/ledger-ceo-pascal-gauthier-hacking-incident/",
    "description": "Pascal Gauthier, the CEO of Ledger, a prominent player in the Decentralized Finance (DeFi) ecosystem, has recently addressed the community regarding a hacking incident that affected their systems. In a message that brought relief to users and stakeholders, Gauthier confirmed that the hacking threat has been successfully neutralized. The incident involved the injection of malicious [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-15T04:41:35.000Z",
    "title": "Ethereum Price Holds 100 SMA But Needs To Clear This For More Gains",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-holds-2200/",
    "description": "Ethereum price is consolidating above $2,250. ETH could start a fresh increase if there is a clear move above the $2,320 resistance zone. Ethereum started a fresh increase above the $2,200 and $2,220 levels. The price is trading above $2,240 and the 100-hourly Simple Moving Average. There is a key rising channel with support near $2,275 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a steady increase if there is a close above $2,320 and $2,350. Ethereum Price Eyes More Upsides Ethereum price started a steady increase above the $2,180 resistance. ETH gained bullish momentum after there was a close above the $2,200 resistance. The price even spiked above the $2,300 level and settled above the 100-hourly Simple Moving Average. A high was formed near $2,332 and the price is consolidating gains. There was a minor bearish wave below the $2,300 level. However, Ethereum is still above $2,240 and the 100-hourly Simple Moving Average. There is also a key rising channel with support near $2,275 on the hourly chart of ETH/USD. The channel support and the 100 hourly SMA are close to the 23.6% Fib retracement level of the upward move from the $1,980 swing low to the $2,332 high. Source: ETHUSD on TradingView.com On the upside, the price is facing resistance near the $2,320 level. The next key resistance is near the $2,350 level. The main resistance is still near $2,400. A clear move above the $2,400 zone could send the price toward the $2,500 level. The next resistance sits at $2,520. Any more gains could start a wave toward the $2,580 level. Fresh Decline in ETH? If Ethereum fails to clear the $2,320 resistance, it could start a fresh decline. Initial support on the downside is near the $2,275 level or the 100-hourly Simple Moving Average and the channel trend line. The next key support is $2,165. The main support is now near $2,120 or the 61.8% Fib retracement level of the upward move from the $1,980 swing low to the $2,332 high. A downside break below $2,120 might start another major decline. In the stated case, Ether could revisit the $2,000 support. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $2,275 Major Resistance Level – $2,320"
  }
]