[
  {
    "source": "CoinDesk",
    "date": "2023-08-14T23:00:00.000Z",
    "title": "Immutable, Web3 Gaming Platform, Launches zkEVM Testnet in Bid to Diversify Infrastructure",
    "url": "https://www.coindesk.com/tech/2023/08/14/immutable-web3-gaming-platform-launches-zkevm-testnet-in-bid-to-diversify-infrastructure/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The ZK rollup is built on Polygon Supernets, a program designed to make it easier for developers to spin up new application-specific blockchains."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-14T23:02:02.000Z",
    "title": "Here Are 5 Games Building on Ethereum Scaler Immutable zkEVM",
    "url": "https://decrypt.co/152481/games-building-on-ethereum-scaler-immutable-zkevm",
    "description": "Immutable zkEVM's testnet launched today. From strategy games to shooters, here are five of the biggest NFT games coming to the network."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-14T23:00:00.000Z",
    "title": "Immutable zkEVM begins testnet phase with 12 Web3 games in development",
    "url": "https://cointelegraph.com/news/immutable-zkevm-begins-testnet-phase-with-polygon",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/09492212-96cd-49d6-81a9-ef7cda66413d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Web3 gaming company announced that its fully Ethereum-compatible network is now available for public testing.</p>\n                    <p><p>Web3 gaming platform Immutable has commenced public testing of its Immutable zkEVM in collaboration with Polygon Labs.</p><p>Work on the zero-knowledge Ethereum virtual machine (zkEVM) network began in March after Immutable announced a partnership with Polygon Labs. Polygon's own 'holy grail' Ethereum-scaling zkEVM hit mainnet on March 27. </p><p>In an Aug. 14 announcement, Immutable said its zkEVM will give game developers access to lower development costs, and the security and network effects that come with the Ethereum ecosystem.  In March, Immutable co-founder and president Robbie Ferguson said the zkEVM is aimed at increasing ownership rights for Web3 gamers. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/b0f57c16-9054-40bf-983d-36156436db54.png\"  /><figcaption style=\"text-align: center;\"><em>Immutable zkEVM developer documents. Source: Immutable.</em></figcaption></figure><p>Over 20 gaming companies have partnered with Immutable to support the launch, including GameStop, TokenTrove marketplace, Web-based game distributor Kongregate, game designer iLogos, and others, according to Immutable.</p><p>At least 12 games have already started building their Web3 titles on zkEVM, it added. These include CoinArcade, Galaxy Commanders, Medieval Empires, MetalCore, Meta Toy, DragonZ SAGA, Rune Realms, Shardbound, Infinite Victory, EF Defense, and SimWin Football. MetalCore in particular has announced a beta launch date of September 15 on Immutable zkEVM.</p><p>Immutable zkEVM testnet will use <a href=\"https://cointelegraph.com/explained/zero-knowledge-proofs-explained\">zero-knowledge proofs</a> to secure transfers between itself and Sepolia Ethereum, allowing developers to test out how the mainnet version will work once it launches. </p><p>The network is fully compatible with Ethereum applications, meaning that developers can port Ethereum projects over to it with minimal changes, Immutable stated. The team will also be deploying an “Immutable Relayer for currency abstraction and gas sponsorship” soon, which will allow developers to create gas-less wallet accounts.</p><p>Immutable chief technology officer and co-founder Alex Connolly expressed his view that the new network will be “irresistible” to developers, stating:</p><blockquote>“This chain, combined with our suite of platform products, is the first end-to-end EVM solution dedicated exclusively to making games successful. We’re already seeing a massive influx from games, players and partners that will make the Immutable ecosystem irresistible for the next generation of web3 games.\"</blockquote><p>Immutable is the developer of the <a href=\"https://cointelegraph.com/news/what-is-gods-unchained-and-how-to-play-it\">Gods Unchained</a> Web3 trading card game, which was originally launched on Ethereum. In April 2021, the company launched its first zero-knowledge-based layer 2 network Immutable X in an attempt to lower transaction fees for players of its games.</p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/immutable-s-gods-unchained-launches-epic-games-store\"><strong>Immutable’s Gods Unchained launches on Epic Games Store</strong></a></p><p>However, that network is not fully compatible with the Ethereum virtual machine (EVM), the computation engine that Ethereum uses. For this reason, users of Immutable X must create derivative keys through a web interface in order to use the network. By contrast, users should now be able to simply switch networks within their wallets to access Immutable zkEVM.</p><p>Ethereum founder Vitalik Buterin <a href=\"https://cointelegraph.com/news/buterin-weighs-in-on-zk-evms-impact-on-decentralization-and-security\">has recently weighed in</a> on the benefits and disadvantages of zkEVMs, saying that they may cause data inefficiency and latency issues but may also greatly improve the scalability of Ethereum.</p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2023-08-14T22:56:44.000Z",
    "title": "Coinbase Won’t Leave The US; Next-Gen Wealth Awaits QUBE Presale Investors After Superior Gains",
    "url": "https://nulltx.com/coinbase-wont-leave-the-us-next-gen-wealth-awaits-qube-presale-investors-after-superior-gains/",
    "description": "According to research, more than 23% of global crypto users use Coinbase for their transactions. While the Security and Exchange Commission (SEC) threatens Coinbase&#8217;s operation in the US, the digital platform is highly esteemed by investors who want to maximize profits with new generational cryptos like InQubeta (QUBE). According to crypto experts, next-generation wealth awaits [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-08-14T22:52:54.000Z",
    "title": "As Bitcoin and XRP Grapple with Selling Pressure, Borroe ($ROE) Celebrates Presale Triumph!",
    "url": "https://nulltx.com/as-bitcoin-and-xrp-grapple-with-selling-pressure-borroe-roe-celebrates-presale-triumph/",
    "description": "Bitcoin (BTC) may soon enter an extended bull run after El-Salvador welcomed Binance into its country. Also, Ripple&#8217;s (XRP) CTO has defended a new PayPal initiative. However, both tokens still bowed to selling pressure in the last few weeks, while Borroe ($ROE) impressed investors. Borroe ($ROE) sold 25 million tokens and raised $250,000 within five [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-08-14T22:50:26.000Z",
    "title": "Huobi Faces $2.5 billion TVL Drop and China’s Investigations Intensify, DigiToads (TOADS) Presale Stands as a Promising Investment",
    "url": "https://nulltx.com/huobi-faces-2-5-billion-tvl-drop-and-chinas-investigations-intensify-digitoads-toads-presale-stands-as-a-promising-investment/",
    "description": "Amid the unfolding turmoil surrounding the financial troubles of the Huobi Token (HT) and mounting investigations in China, the cryptocurrency landscape remains dynamic and full of opportunities. As Huobi faces a staggering $2.5 billion drop in Total Value Locked (TVL) amidst regulatory scrutiny, DigiToads (TOADS) offers an amalgamation of non-fungible tokens (NFTs) and play-to-earn (P2E) [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-14T23:00:16.000Z",
    "title": "Bitcoin Price Supported By Thin $40 Million Bid Pool, But For How Long?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-price-supported-by-thin-40-million-bid-pool-but-for-how-long/",
    "description": "In the ongoing market turbulence on higher timeframes, Bitcoin (BTC) is at a crucial juncture as a great consolidation phase persists. Research and analysis firm Material Indicators closely monitored the recent weekly candle close/open, paying particular attention to two key factors: the trend line and the 21-day, 21-week, and 21-month moving averages (MA) – all of which are currently influential in shaping market dynamics.  Uncertainty And Potential Turning Point For Bitcoin The opening of the weekly candle below the trend line triggered a “subsequent nosedive,” amplifying concerns. While the 21-week and 21-month moving averages continue to serve as robust support, the 21-day MA has faced a rigorous seven-day testing period, according to the firm’s analysis.  Notably, the tight correlation of the 21-MA across three distinct time frames is rare, indicating that the market is at a critical inflection point.  Despite the compressed volatility witnessed in recent days, the price action observed over the past 24 hours exemplifies the market&#8217;s attempt to shake out weak hands. According to Material Indicators, given the complexity of the current price action, it is prudent to zoom out and gain a broader perspective. Both Trend Precognition algorithms identified these moves on the four-hour chart, emphasizing the significance of adopting a comprehensive outlook. Moreover, according to Materials, the order book reveals a concerning trend in bid liquidity, with less than $40 million holding the price up.  The absence of substantial liquidity below this level raises fundamental worries. However, it also suggests that there may not be sufficient sentiment to drive prices significantly lower – at least not yet.  Related Reading: XRP Volume Jolt: How Did The $3 Billion Surge Impact Price Action? In addition, Material Indicators highlights that the examination of liquidity movements within the order book over the past month paints a picture of continued price volatility with a potential upward bias.  However, the lack of volume raises concerns about the market&#8217;s overall health. Despite a $13 million buy wall at $27,900, the bottom of the channel at $28,300 remains a critical threshold for BTC to extend its current trend. The firm claims: &#8230; the bottom of the channel at $28.3k remains my line in the sand for BTC to extend the trend, and I maintain that we must see weekly candles printing above the 100-Week MA to even consider a bull breakout. BCT Faces Renewed Pressure Amid Strengthening US Dollar As Bitcoin enters a new week of trading, market participants closely monitor the potential impact of the strengthening US Dollar Index ($DXY) on the world&#8217;s leading cryptocurrency.  According to Yan Alleman, co-founder of blockchain analytics firm Glassnode, recent developments suggest that BTC may face renewed pressure due to the upward momentum of the $DXY. Alleman highlights that the $DXY&#8217;s renewed strength could exert downward pressure on Bitcoin&#8217;s price. Historically, there has been an inverse correlation between the value of the US Dollar and the price of BTC, meaning that when the dollar strengthens, Bitcoin often faces headwinds.  However, options pricing indicates a bullish sentiment for Bitcoin in the coming month. Options are financial derivatives that allow traders to speculate on the future price of an underlying asset, in this case, Bitcoin.  The pricing of options contracts suggests an expectation of a bullish move shortly. This aligns with the technical analysis indicating potential upside for Bitcoin. Related Reading: Base TVL Surges 900% In 2 Weeks, What’s Driving The Growth? Analyzing the potential price movements, Alleman notes that it would require nearly twice as much selling pressure to push Bitcoin down to the low $28,000 range compared to the buying pressure needed to surpass the $30,000 level.  This observation suggests that there may be greater support and buying interest at higher price levels, making a sustained drop less likely. As of the time of writing, Bitcoin (BTC) is trading at $29,500, reflecting a marginal 0.4% increase over the past 24 hours. Featured image from iStock, chart from TradingView.com"
  }
]