[
  {
    "source": "Cointelegraph",
    "date": "2023-09-15T21:52:51.000Z",
    "title": "Government objects to ‘unnecessary,’ ‘prejudicial’ SBF jury selection questions ",
    "url": "https://cointelegraph.com/news/us-government-objects-unnecessary-prejudicial-sam-bankman-fried-jury-selection-questions",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/9a29bb24-0e74-4423-926d-516ed4a5b891.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The U.S. attorney sees no reason for potential jurors to discuss effective altruism or ADHD, among other things, before trying SBF. </p>\n                    <p><p>On Sept. 15, the United States government responded to questions the defense has suggested posing to potential jurors during their selection for the case against former FTX CEO Sam Bankman-Fried. He faces seven charges of fraud and money laundering in connection with the collapse of the cryptocurrency exchange that could land him in prison for decades.</p><p>The sides submitted their proposed questions to the court on Sept. 11 and showed drastically different standards for selection.</p><p>In a letter addressed to Judge Lewis Kaplan of the U.S. District Court for the Southern District of New York, U.S. Attorney Damian Williams objected to questions in four of the 14 sections of voir dire proposed by the defense. Voir dire is the process of questioning potential jurors. Williams wrote:</p><blockquote>“The defendant’s proposed voir dire contains numerous unnecessary and time-consuming questions, often soliciting open-ended discussion, as well as questions that are repetitive, prejudicial, and argumentative.” </blockquote><p>Specifically, Williams objects to the questions in sections concerning pretrial publicity, the effective altruism philosophical movement, political donations and lobbying, and attention-deficit/hyperactivity disorder (ADHD). </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/sam-bankman-fried-leaked-docs-revealed\">Sam Bankman-Fried says, ‘I did what I thought was right,' in leaked docs: Report</a></em></strong></p><p>The pretrial publicity section has a shaky legal foundation, while questions about effective altruism “are a thinly veiled attempt to advance a defense narrative.” Questions about political donations are irrelevant and those about ADHD are irrelevant and prejudicial, Williams wrote. Bankman-Fried <a href=\"https://cointelegraph.com/news/sam-bankman-fried-return-depression-without-medication-say-defense-lawyers\">is said to suffer from ADHD</a>. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">SBF&#39;s jury selection delayed by one day to Oct 3. <a href=\"https://t.co/twfb5b69Q9\">pic.twitter.com/twfb5b69Q9</a></p>&mdash; Amy Castor (@ahcastor) <a href=\"https://twitter.com/ahcastor/status/1702034723948912772?ref_src=twsrc%5Etfw\">September 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The government’s questions, in contrast, <a href=\"https://cointelegraph.com/news/sam-bankman-fried-bids-to-ask-jurors-crypto-altruism-stance\">are “standard, neutral, and appropriate,”</a> Williams wrote. Both sides propose asking future jurors about their attitudes toward cryptocurrency. Among the defense questions is: </p><blockquote>“If a company involved in the cryptocurrency industry or the financial industry fails, do you feel that only the owners of the company must be to blame?”</blockquote><p>Bankman-Fried <a href=\"https://cointelegraph.com/news/ftx-s-sam-bankman-fried-pleads-not-guilty-to-fraud-charges-report\">has pleaded not guilty</a> to the charges against him. His trial will begin in New York on Oct. 3. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/sbf-game-decentraland-pyramid-destroyed-animoca-brands-mma-game/\">‘Ethical’ SBF game axed, Web3 games sign-up process sucks, Tomb Chaser: Web3 Gamer</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-15T22:00:03.000Z",
    "title": "RedStone redefines blockchain oracle scene with innovative design",
    "url": "https://cryptoslate.com/redstone-redefines-blockchain-oracle-scene-with-innovative-design/",
    "description": "<p>The focus on blockchain Oracle protocols, such as Chainlink (LINK), has been growing, reflecting the rapid adoption of smart contracts. These Oracle protocols are vital to the crypto industry, acting as channels for external data that drive the automation of smart contracts. As the worlds of DeFi and traditional finance converge, the significance of oracles [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/redstone-redefines-blockchain-oracle-scene-with-innovative-design/\">RedStone redefines blockchain oracle scene with innovative design</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-15T21:47:55.000Z",
    "title": "Weekly Crypto Price Analysis: BTC, ETH, BNB, XRP, ADA, DOGE, And SOL",
    "url": "https://www.cryptopolitan.com/weekly-crypto-price-analysis-2023-09-16/",
    "description": "Weekly crypto price analysis for 15th September 2023 reveals that most of the cryptocurrencies have been trading in mixed signals, with bullish and bearish trends visible in individual crypto coins. The top coins like Bitcoin, Ethereum, and XRP have been the most volatile in the past few days, with selling and buying activities occurring in ... <a title=\"Weekly Crypto Price Analysis: BTC, ETH, BNB, XRP, ADA, DOGE, And SOL\" class=\"read-more\" href=\"https://www.cryptopolitan.com/weekly-crypto-price-analysis-2023-09-16/\" aria-label=\"More on Weekly Crypto Price Analysis: BTC, ETH, BNB, XRP, ADA, DOGE, And SOL\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-15T21:42:16.000Z",
    "title": "HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?",
    "url": "https://www.cryptopolitan.com/hbar-price-prediction/",
    "description": "HBAR Price Prediction 2023-2032 Hedera Hashgraph is a trending cryptocurrency focused on providing a sustainable, enterprise-grade blockchain.&#160; The asset has been performing extremely well recently, prompting investors everywhere to search for a Hedera Hashgraph price prediction. So that is a heads-up in crypto winter despite the doom which tends to pull everyone else connected to ... <a title=\"HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hbar-price-prediction/\" aria-label=\"More on HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-15T22:00:07.000Z",
    "title": "Bye Bye Birdie: Binance Begins Process Of Axing BUSD Stablecoin",
    "url": "https://www.newsbtc.com/stablecoin/binance-busd-stablecoin/",
    "description": "Binance crypto exchange announced in late August that it is moving to end support for its beloved BUSD stablecoin. This move comes amid the stablecoin’s run-in with regulators, leading to a halt in its production. And now, the exchange has started moving to begin the end of support for the stablecoin. Binance Starts Burning Tokens Binance took to its official X (formerly Twitter) account on Thursday, September 14, to announce that it would begin burning a number of Binance-pegged tokens. Among the five tokens listed to be burned, four were BUSD tokens across different blockchains. Related Reading: Analyst’s Ultra Bullish Prediction Puts XRP Price At $10,000, But When? According to the announcement, the Binance-pegged tokens would be burned on the listed blockchains, and then the exchange would release the equivalent amount of tokens that were initially used as collateral on their native networks. Later today, #Binance will burn a number of idle Binance-pegged tokens. The equivalent amount of tokens on their native networks, which were used as collateral, will then be released. Tokens: 🔸TUSDOLD (BSC) 🔸BUSD (MATIC) 🔸BUSD (BSC) 🔸BUSD (BNB) 🔸BUSD (TRX) — Binance (@binance) September 14, 2023 The BUSD tokens listed across four networks include BUSD on the Polygon (MATIC) network, BUSD on the Tron (TRX) network, BUSD on BSC, and BUSD (BNB). In addition to these, the exchange also revealed that the TUSDOLD on BSC would be burned as well, making it the only token on this list that is not BUSD. The collateral in this case will be the equivalent of the Binance-pegged tokens that are burned. So if 1,000 BUSD on the MATIC network is burned, then the equivalent on the native blockchain will be released by the exchange. Fire In The BUSD Camp The BUSD stablecoin first came under fire in early 2023 when the United States Securities and Exchange Commission (SEC) issued a Wells Notice to issuer Paxos alleging that the stablecoin was an unregistered security. The regulator, through this, made its intention to pursue legal action known. Following the move by the SEC, the New York State Department of Financial Services (NYDFS) asked the issuer to stop printing new tokens. The NYDFS’s concern mainly bordered on Paxos’ relationship with Binance, and eventually, the BUSD issuer decided to cut ties with the crypto exchange. Since the initial move by regulators, the stablecoin has suffered in terms of usage and market cap. The stablecoin which was once a top 10 crypto by market cap has since seen its market cap decline to $2.5 billion, making it the 26-largest cryptocurrency as of the time of this writing. Related Reading: New Reports Shows How Much Capital Was Pulled Out Of Crypto In August Binance has also announced plans to stop offering support for the stablecoin completely by 2024. Paxos also revealed that it will cease all BUSD redemptions in February 2024, and Binance’s complete withdrawal is expected to come shortly after this. Nevertheless, the stablecoin continues to maintain its dollar peg quite well. It is still trading at a 1:1 parity with the United States dollar and has rarely dipped below $1 amid the regulatory storm. Market cap suffers amid regulatory crackdown &#124; Source: Market Cap BUSD on Tradingview.com Featured image from Zipmex, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-15T21:44:00.000Z",
    "title": "XRP is Under Pressure From a Descending Trend line: Analyst",
    "url": "https://coinedition.com/xrp-is-under-pressure-from-a-descending-trend-line-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Will-XRP-Price-Soar-or-Decline-in-the-Unforeseeable-Future.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Will XRP Price Soar or Decline in the Unforeseeable Future\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Will-XRP-Price-Soar-or-Decline-in-the-Unforeseeable-Future.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Will-XRP-Price-Soar-or-Decline-in-the-Unforeseeable-Future-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Will-XRP-Price-Soar-or-Decline-in-the-Unforeseeable-Future-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Will-XRP-Price-Soar-or-Decline-in-the-Unforeseeable-Future-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Will-XRP-Price-Soar-or-Decline-in-the-Unforeseeable-Future-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Will-XRP-Price-Soar-or-Decline-in-the-Unforeseeable-Future-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>EGRAG CRYPTO has provided insight into the XRP price&#8217;s development. A crucial pattern on the XRP daily chart is influencing traders’ sentiments. There are possibilities that could lead to a bullish trend based on technical indicators. A renowned crypto analyst known as EGRAG CRYPTO on X has provided insight into the XRP price&#8217;s development. EGRAG [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-is-under-pressure-from-a-descending-trend-line-analyst/\">XRP is Under Pressure From a Descending Trend line: Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-15T22:01:01.000Z",
    "title": "Enterprise Blockchain Altcoin VeChain (VET) Jumps After New Coinbase Listing",
    "url": "https://dailyhodl.com/2023/09/15/enterprise-blockchain-altcoin-vechain-vet-jumps-after-new-coinbase-assets-listing/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/veteren-correctly-updates.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/veteren-correctly-updates.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/veteren-correctly-updates.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/veteren-correctly-updates.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/veteren-correctly-updates.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/veteren-correctly-updates.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/veteren-correctly-updates.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An enterprise-focused altcoin is surging after being listed by top US-based crypto exchange Coinbase. In June, Coinbase added VeChain (VET), a crypto project that uses blockchain technology to offer logistical solutions, to its listing roadmap. The crypto exchange announced earlier this week that VET and its gas token VeThor (VTHO) were available for trading. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/15/enterprise-blockchain-altcoin-vechain-vet-jumps-after-new-coinbase-assets-listing/\">Enterprise Blockchain Altcoin VeChain (VET) Jumps After New Coinbase Listing</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]