[
  {
    "source": "CryptoGlobe",
    "date": "2023-09-16T01:00:00.000Z",
    "title": "Ethereum Marks One Year of PoS Transition: $1.5 Billion ETH Burned and Other Key Changes",
    "url": "https://www.cryptoglobe.com/latest/2023/09/ethereum-marks-one-year-of-pos-transition-1-5-billion-eth-burned-and-other-key-changes/",
    "description": "The Ethereum ($ETH) network has transitioned from a Proof-of-Work into a Proof-of-Stake consensus algorithm one year ago, in a move that has helped the network’s circulating supply start dropping and significantly reduced its environmental impact. Ethereum transactions started burning ETH after the London hard fork, which included the implementation of Ethereum Improvement Proposal (EIP) 1559. The […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-16T01:09:07.000Z",
    "title": "Japan start-ups to ditch stocks for crypto – Details",
    "url": "https://www.cryptopolitan.com/japan-start-ups-to-ditch-stocks-for-crypto/",
    "description": "Shifting gears in the financial landscape, Japan is breaking from its conservative stance on cryptocurrency. A nation traditionally seen as a stronghold of stock-driven fundraising for startups now stands on the cusp of a revolutionary transformation. Instead of going the stock route, young enterprises in the Land of the Rising Sun are gearing up to ... <a title=\"Japan start-ups to ditch stocks for crypto &#8211; Details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/japan-start-ups-to-ditch-stocks-for-crypto/\" aria-label=\"More on Japan start-ups to ditch stocks for crypto &#8211; Details\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-16T01:01:08.000Z",
    "title": "Binance sparks outrage with Morocco crypto donations",
    "url": "https://www.cryptopolitan.com/binance-outrage-with-morocco-crypto-donation/",
    "description": "Binance, the crypto giant, recently ignited a firestorm of criticism for its choice to donate in-house cryptocurrency to Moroccan earthquake victims. As if navigating the aftermath of a deadly quake wasn&#8217;t challenging enough, this donation move has been largely viewed as a self-serving PR stunt, doing more to boost Binance&#8217;s image than to help those ... <a title=\"Binance sparks outrage with Morocco crypto donations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-outrage-with-morocco-crypto-donation/\" aria-label=\"More on Binance sparks outrage with Morocco crypto donations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-16T00:55:11.000Z",
    "title": "Bank of England’s inflation strategy shatters public trust",
    "url": "https://www.cryptopolitan.com/bank-of-england-shatters-public-trust/",
    "description": "The Bank of England, long a beacon of monetary stability, finds itself on shaky ground. A precipitous dip in public trust showcases widespread disapproval of the bank&#8217;s handling of inflation, an economic monster that continues to threaten the pocketbooks of countless Britons. Public Discontent Reaches Unprecedented Levels Recent data paints a bleak picture of the ... <a title=\"Bank of England&#8217;s inflation strategy shatters public trust\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bank-of-england-shatters-public-trust/\" aria-label=\"More on Bank of England&#8217;s inflation strategy shatters public trust\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-16T01:00:32.000Z",
    "title": "Bitcoin Dominates Ethereum In Daily Active Addresses Despite Lagging In TX Count",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-ethereum-daily-active-addresses-lagging-tx-count/",
    "description": "Ethereum might be the king of smart contracts and the world&#8217;s primary hub for decentralized finance (DeFi) and non-fungible tokens (NFTs) activity but onchain data suggests that Bitcoin is ahead in user engagement, interpreted by the number of daily active users, and network activity is at acceptable, healthy levels, reading from the number of daily transactions confirmed.  Bitcoin Leads Ethereum In Daily Active Addresses According to Artemis Terminal data on September 15, Bitcoin, despite being predominantly a transactional layer, enabling the peer-to-peer (P2P) transfer of value between addresses, has more daily active users than Ethereum. This observation is even as Ethereum serves as a conduit of value since assets can be moved, just like in Bitcoin, and a smart contract platform for deploying trustless and automated decentralized applications (dapps). Some, like Uniswap, a decentralized exchange (DEX), process billions worth of transactions every month. Related Reading: Artist Stages Crypto Protest In Front Of US SEC With “Rug Pull” Exhibit On September 15, Bitcoin had over 800,000 daily active addresses (DAA), more than twice those in Ethereum, which stood at slightly over 378,000. The only time there was a slight change was on September 13, when over 1 million addresses were activated on Ethereum. Then, the number of DAA on Bitcoin also fell to around 743,000. However, the DAA on Ethereum has fallen sharply while Bitcoin has maintained an upward trajectory since late August. During this time, Ethereum&#8217;s DAA has been fluctuating heavily, as evidenced by the rise and fall on Sep 13 and through to today. Ethereum Processes Over 1 Million Transactions Everyday Ethereum shines in the number of daily transactions processed. When writing on September 15, the smart contract platform had processed over 1 million transactions while Bitcoin lagged, confirming less than 600,000. Even at this level, Ethereum has processed less than half of what it did on September 13, when the network processed over 2.3 million transactions. On the other hand, Bitcoin&#8217;s daily transactions have been steady, while those of Ethereum have, on average, risen over the past three months, as Artemis Terminal data shows. DAA and daily transaction count are important metrics that on-chain analysts use to analyze the level of engagement and health of public blockchains. Over the past 18 months, activity has rapidly shrunk as asset prices fall in the crypto winter. Ethereum&#8217;s drop from around $5,000 in late November 2021 to as low as $1,500 in 2022 weighed negatively on DeFi and NFT activity.  Related Reading: Dogecoin Price Prediction for 2023, 2024, 2025, 2030 &#38; Beyond According to DeFiLlama, the total value locked (TVL) of DeFi protocols has stabilized below $50 billion, down from around $180 billion in 2021. Meanwhile, trading volume has crashed by over 90%, dragging the value of NFT-related projects, including Immutable X and ApeCoin. To illustrate, APE is down 96% from peaks. Feature image from Canva, chart from TradingView"
  }
]