[
  {
    "source": "CryptoGlobe",
    "date": "2023-06-28T04:18:00.000Z",
    "title": "Bitcoin Boosts Crypto Investment Products to $199 Million Inflows After Nine Weeks of Outflows",
    "url": "https://www.cryptoglobe.com/latest/2023/06/bitcoin-boosts-crypto-investment-products-to-199-million-inflows-after-nine-weeks-of-outflows/",
    "description": "Cryptocurrency investment products have seen a significant uptick as they record the largest single weekly inflows since July 2022, with $199 million being invested in these products in a correction of the prior nine consecutive weeks of outflows. According to CoinShares’ Digital Asset Fund Flows report, the flagship cryptocurrency Bitcoin ($BTC) saw the lion’s share […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T04:21:19.000Z",
    "title": "Monero (XMR) Higher 13 Days In A Row: What’s Next?",
    "url": "https://www.newsbtc.com/news/monero/monero-xmr-higher-13-days-in-a-row-whats-next/",
    "description": "An altcoin with a long and storied history, Monero is currently running to the upside in a way it never has before. After closing higher for twelve consecutive days &#8211; a new record for the privacy-focused altcoin &#8211; Monero looks poised to once again make history with a thirteenth straight higher close. What&#8217;s happened after other Monero winning streaks in the past? Let’s take a closer look at the price history to find out. Monero Win Streak Making History Monero&#8217;s current winning streak of twelve consecutively higher closes breaks the previous record set in 2021 of ten straight higher closes. While the price advance is clearly impressive, its unprecedented nature means we&#8217;ll have to look at earlier and shorter win streaks to get an understanding of what might be ahead for Monero in the future. In other words, we&#8217;ll use the prior shorter historical win streaks to generate enough occurrences to make a more statistically meaningful conclusion. Monero 2023 Winning Streak &#124; XMRUSD on TradingView.com &#160; Monero 2021 Winning Streak &#124; XMRUSD on TradingView.com Related Reading: After Raising $3M, HedgeUp (HDUP) Receives Influx of Shiba Inu (SHIB) and Monero (XMR) Investors Because the number of occurrences varies based on holding time, we’ll start by listing the number of times that six straight higher closes has happened next to our several hypothetical hold times of 7 days through 365 days. Holding time is defined as the amount of time one held the asset before exiting. For example, if one hypothetically purchased Monero following the trigger event (i.e., 6 straight higher closes) and sold it 30 days later, this would be a holding time of 30 days. Monero Occurrences of Six Consecutive Higher Closes by Holding Time (May 2014 &#8211; Present) 12 occurrences using a 7-day hold time 12 occurrences using a 15-day hold time 12 occurrences using a 30-day hold time 11 occurrences using a 60-day hold time 11 occurrences using a 90-day hold time 7 occurrences using a 180-day hold time 5 occurrences using a 356-day hold time While the number of occurrences remains limited even with the shorter win streak, past Monero winning streaks of six consecutively higher closes provides enough data to examine so let&#8217;s dive into the analysis. Past Monero Win Streaks Suggest More Strength Ahead The hypothetical average trade results for Monero (XMR) show a consistent positive edge across all holding times from 7 days through one year. Please note that even though the average historical trade results are positive for each hold time we examine, losses have also occurred for each hold time. Monero Hold Time Results for Six Straight Higher Closes &#124; SOURCE: Tableau Going out to a roughly three-month hold time, the past win streaks have delivered far greater gains on average, with an average trade of +65.1% with a 90-day hold, +121.7% with a 180-day hold, to an impressive +373.8% with a 365-day hold. Related Reading: Solana (SOL), Monero (XMR), and DigiToads (TOADS) Form an Unbeatable Trio for Crypto Investors While we&#8217;ve certainly never seen a streak of consecutively higher closes to match the current twelve and nearly thirteen, Monero&#8217;s long price history suggests that more strength could be ahead, especially going out to three months and beyond. DB the Quant is the author of the REKTelligence Report newsletter on Substack. Follow @REKTelligence on Twitter for evidence-based crypto market research and analysis. Important Note: This content is strictly educational in nature and should not be considered investment advice. Featured images created with Tableau. Charts from TradingView.com."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T04:13:47.000Z",
    "title": "LINK Price Prediction: Chainlink Could Lift-off Toward $8",
    "url": "https://www.newsbtc.com/analysis/link/link-price-prediction-chainlink-to-8-2/",
    "description": "Chainlink’s LINK price is showing positive signs above $6.00. The price could rise further if it clears the $6.30 and $6.50 resistance levels. Chainlink token price is showing positive signs and rising from $5.00 against the US dollar. The price is trading above the $6.00 level and the 100 simple moving average (4 hours). There was a break above a major bearish trend line with resistance near $5.10 on the 4-hour chart of the LINK/USD pair (data source from Kraken). The price could extend its recovery and rally toward the $8.0 resistance zone. Chainlink (LINK) Eyes More Gains After a major decline, LINK price found support near the $5.0 zone against the US Dollar. A low was formed near $5.004 and the price started a fresh increase, similar to Bitcoin and Ethereum. There was a clear move above the $5.10 and $5.50 resistance levels. Besides, there was a break above a major bearish trend line with resistance near $5.10 on the 4-hours chart of the LINK/USD pair. The upward move gained pace above the $5.80 resistance. LINK even jumped above $6.0 before the bears appeared. A high is formed near $6.37 and the price is now consolidating gains. Chainlink price is now trading above the $6.00 level and the 100 simple moving average (4 hours). It is also showing positive signs above the 23.6% Fib retracement level of the upward move from the $5.00 swing low to the $6.37 high. On the upside, the price is facing resistance near the $6.35 zone. Source: LINKUSD on TradingView.com The first major resistance is near the $6.50 zone. A clear break above $6.50 may possibly start a fresh increase toward the $7.20 and $7.25 levels. The next major resistance is near the $7.80 level, above which the price could revisit $8.0. Dips Supported? If chainlink’s price fails to climb above the $6.50 resistance level, there could be a downside correction. Initial support on the downside is near the $6.05 level. The next major support is near the $5.70 level, below which the price might test the 61.8% Fib retracement level of the upward move from the $5.00 swing low to the $6.37 high at $5.50. Any more losses could lead the price toward the $5.00 level in the near term. Technical Indicators 4 hours MACD – The MACD for LINK/USD is losing momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for LINK/USD is now above the 50 level. Major Support Levels – $6.05 and $5.70. Major Resistance Levels – $6.35 and $6.50."
  }
]