[
  {
    "source": "CoinDesk",
    "date": "2023-07-11T17:25:22.000Z",
    "title": "The Big Robert F. Kennedy Jr. Bitcoin Nothingburger",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/11/the-big-robert-f-kennedy-jr-bitcoin-nothingburger/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The candidate isn’t necessarily biased just because he owns BTC."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-11T17:30:00.000Z",
    "title": "BlackRock Bitcoin ETF could unlock $30 trillion worth of wealth, Bloomberg analyst says ",
    "url": "https://cointelegraph.com/news/blackrock-bitcoin-etf-could-unlock-30-trillion-worth-of-wealth-bloomberg-analyst-says",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/94b686dd-ac6a-40f3-91e9-86afde9d49b7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Following the Blackrock application, a Bitcoin spot ETF was never so close to being approved and it could be a game changer for the crypto industry, explains ETF analyst Eric Balchunas. </p>\n                    <p><p>$30 trillion worth of capital could suddenly unlock for the Bitcoin market if a Bitcoin spot ETF is approved by the U.S. Securities and Exchange Commission, according to Bloomberg ETF analyst Eric Balchunas. </p><p>That is the estimated amount of assets controlled by financial advisors in the U.S., who would be willing to get exposure to Bitcoin through a regulated exchange-traded fund.  </p><p>\"ETF is the format in which the boomers and the financial advisors prefer their investments delivered in”, Balchunas explained in an exclusive Cointelegraph interview. </p><p>Blackrock's application for a Bitcoin spot ETF last month sparked a new wave of optimism around the crypto market which led other major firms such as ARK Investment, Valkyrie, and Fidelity to file their own applications for a Bitcoin ETF. </p><p>The involvement of Blackrock, the world's largest asset manager, was enough to raise the chances of a Bitcoin spot ETF approval from 1% to 50%, according to Balchunas. </p><p>\"They're very smart and they don't just throw filings out willy nilly”, the analyst said. \"They clearly see something out there that they think they can get through the regulators”, he added. </p><p>To find out more about the implications of the Blackrock Bitcoin ETF filing, watch the full interview on our YouTube channel, and don’t forget to subscribe! </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/UkJ3JYFpxjA\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-11T17:25:30.000Z",
    "title": "Singaporean sovereign fund Temasek exits crypto altogether amid regulatory crackdown",
    "url": "https://cryptoslate.com/singaporean-sovereign-fund-temasek-is-out-of-crypto-amid-regulatory-crackdown/",
    "description": "<p>Singapore sovereign fund Temasek said it is not planning to invest in crypto companies due to the current regulatory environment, its Chief investment officer, Rohit Sipahimalani, told CNBC in a July 11 report. &#8220;There&#8217;s a lot of regulatory uncertainty in this environment. And I do think that it will be very difficult for us to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/singaporean-sovereign-fund-temasek-is-out-of-crypto-amid-regulatory-crackdown/\">Singaporean sovereign fund Temasek exits crypto altogether amid regulatory crackdown</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-11T17:15:00.000Z",
    "title": "Rodeo Finance Exploited for $1.5m in Ethereum $ETH",
    "url": "https://cryptodaily.co.uk/2023/07/rodeo-finance-exploited-for-1-5m-in-ethereum-eth",
    "description": "<p class=\"md-end-block md-p\">Rodeo Finance, an Arbitrum-based decentralized finance (DeFi) protocol, suffered a significant blow, losing $1.53 million in Ethereum due to a code vulnerability exploitation in its Oracle. This is the second exploit that the DeFi platform has endured in a span of a week, underscoring the escalating security issues facing such protocols.</p>\n<p class=\"md-end-block md-p md-focus\">The attacker manipulated a key function to siphon funds from Rodeo's interest-bearing USDC pool, taking advantage of a vulnerability that enabled them to force a swap. Initially, 290 Wrapped Ethereum (WETH) was taken, before being bridged to the Ethereum network. The infiltrator used oracle manipulation to inflate their ETH value by swapping it for unshETH, a DeFi project aimed at promoting validator decentralization.</p>\nUnderlying Vulnerabilities Exploited\n<p class=\"md-end-block md-p\">The oracle manipulation permitted the conversion of WETH to unshETH at a rate not reflecting fair market value. The exploiter then seized the opportunity to return to the Ethereum network, further draining 230 WETH from the Rodeo vault. </p>\n<p class=\"md-end-block md-p\">Before returning to the Ethereum network, they sent 150 ETH into Tornado Cash, effectively masking their tracks. The remaining balance of 371 ETH was left in the wallet. Although 520 WETH was extracted from the Rodeo vault, only 472 WETH is counted as losses, due to the attacker initially funding the wallet with 50 ETH to facilitate the exploit. </p>\nRepeating Exploits\n<p class=\"md-end-block md-p\">This episode of Rodeo Finance&rsquo;s exploitation comes shortly after the protocol suffered another security breach just last week, where a vulnerability in their mintProtocolReserves function led to a loss of approximately $89,000. </p>\n<p class=\"md-end-block md-p\">Rodeo Finance isn't alone in facing these security issues. The Arbitrum network in 2023 alone has witnessed a total of 21 recorded incidents of some form of exploit, leading to a collective loss of over $20 million. The recent Rodeo Finance exploit, causing a $1.53 million loss, is the fifth-largest recorded on Aribitrum this year.</p>\n<p class=\"md-end-block md-p\">After the exploit, the total value locked (TVL) in the DeFi protocol, initially at $20 million, fell below $500. Notably, the price of the native token of the DeFi protocol plummeted by over 53% in the last 24 hours.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-11T17:30:32.000Z",
    "title": "Bots Sending BTC — Lightning Labs Releases New Tools for AI-Bitcoin Integration",
    "url": "https://news.bitcoin.com/bots-sending-btc-lightning-labs-releases-new-tools-for-ai-bitcoin-integration/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcbots-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bots Sending BTC — Lightning Labs Releases New Tools for AI-Bitcoin Integration\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcbots-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcbots-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcbots-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcbots-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcbots-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcbots-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcbots.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On July 6, Lightning Labs released new developer tools to enhance the intersection of artificial intelligence (AI) and Bitcoin. The layer two (L2) startup introduced a new specification known as L402 and tools that enable AI systems to conduct transactions over the Lightning Network. The Fusion of AI and Bitcoin Artificial intelligence (AI) and Bitcoin, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T17:37:53.000Z",
    "title": "India poised to overtake US as second-largest economy, forecasts Goldman Sachs",
    "url": "https://www.cryptopolitan.com/india-poised-to-overtake-us-as-second-largest-economy-forecasts-goldman-sachs/",
    "description": "Goldman Sachs Research has projected that India&#8217;s economy is on track to surpass the United States and become the second-largest in the world, trailing only China within a few decades. According to the investment bank&#8217;s analysis, India is expected to claim the third position by 2075, with a gross domestic product (GDP) estimated to reach ... <a title=\"India poised to overtake US as second-largest economy, forecasts Goldman Sachs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/india-poised-to-overtake-us-as-second-largest-economy-forecasts-goldman-sachs/\" aria-label=\"More on India poised to overtake US as second-largest economy, forecasts Goldman Sachs\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T17:31:29.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T17:18:10.000Z",
    "title": "Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices considering investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it brings. For ... <a title=\"Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T17:17:14.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? Today&#8217;s live Aave price is $72.94, with a 24-hour trading volume of $105,551,486. Aave is up 4.09% in the last 24 hours. The current CoinMarketCap ranking is #40, with a live market cap of $1,055,640,426. It has a circulating supply of 14,472,270 AAVE coins and ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  }
]