[
  {
    "source": "Crypto Daily",
    "date": "2023-07-29T17:44:05.000Z",
    "title": "LBank Exchange Will List DBear Coin (DBC) on July 31, 2023",
    "url": "https://cryptodaily.co.uk/2023/07/lbank-exchange-will-list-dbear-coin-dbc-on-july-31-2023",
    "description": "<p>Road Town, BVI, July 29th, 2023, Chainwire</p><p>LBank Exchange, a global digital asset trading platform, will list DBear Coin (DBC) on July 31, 2023. For all users of LBank Exchange, the DBC/USDT trading pair will be officially available for trading at 6:00 UTC on July 31, 2023.</p><p>DBear Coin (DBC) is a lifestyle Blockchain-Commerce for the MZ generation, characterized by Web3.0, Metaverse, and customized NFT. All DBC platforms are interconnected like a universe, enabling users to learn, play, and shop. Its native token, DBC, will be listed on LBank Exchange at 6:00 UTC on July 31, 2023, with the goal of expanding its global footprint and supporting the realization of its forward-thinking objectives.</p><p>Introducing DBear Coin</p><p>DBear Coin (DBC) is a lifestyle Blockchain-Commerce for the MZ generation, characterized by Web3.0, Metaverse, and customized NFT. All DBC platforms are interconnected like a universe, enabling users to learn, play, and shop. DBC serves as both a membership point and a medium of exchange within the D:Bear universe, facilitated through the DMNC NRT card, while also acting as a rewarding mechanism. Leading the BDC project is Man-won Chung, the former CEO of SK Telecom, a company with a market capitalization of $8 billion and the creator of the widely successful OKcashbag point system, which boasts 21 million users.</p><p>The Dbear Universe project aims to provide a comprehensive \"Character-Based Lifestyle Commerce'' experience for the MZ (Millennial and Gen Z) generation. By becoming a member of the Dbear Universe, individuals will receive a Dbear Member's NFT Card (DMNC), granting them access to various lifestyle platforms within the Dbear ecosystem. Holding the NFT card allows members to enjoy exclusive consumer rewards and benefits. B-Commerce (Blockchain Commerce) is at the core of the project, introducing an innovative consumer benefit NFT model. Dbear Universe stands out as the sole NFT commerce initiative in the rapidly growing global character market. Through attractive items and features, members can create their unique NFTs through the MCM (Members Creating &amp; Minting) process, potentially increasing the value of their digital assets. Additionally, Dbear Universe offers access keys to BEARMANSION, a metaverse within the Dbear ecosystem.</p><p>The project envisions utilizing innovative technologies and ideas to improve the quality of life for humanity, fostering a richer and happier family life. Its mission is to suggest common interests and hobbies for parents and children to share and empathize with, while building a user-friendly and accessible system for everyone. Additionally, it aims to reduce financial stress in households through an effective reward system and integrate blockchain into daily life, creating an encompassing ecosystem. The project emphasizes practical liquidity, freedom of choice, and rational decision-making. It strives to establish a fair hierarchy based on levels of interest and participation and ensures sustainability through proactive system management and investment in development.</p><p>About DBC Token</p><p>The main mission of D-Bear Coin (DBC) is to establish a stable B-Commerce Economy within the D-Bear Universe ecosystem. The project team aims to implement inflation-deflation prevention policies to ensure the stable function of DBC as a currency and minimize significant price fluctuations. Through platform development, marketing, and supply policies, the project aims to increase the holding value of DBC progressively, providing enhanced lifestyle opportunities for members of the D-Bear Universe.&nbsp;</p><p>Based on ERC20, DBC has a total supply of 4 billion (i.e. 4,000,000,000). The token distribution consists of 15% for the team, 10% for marketing, 7.5% for promotion and others, 30% for Member Rewards, and 18.75% each for LMNC SWAP and Point SWAP. It will be listed on LBank Exchange at 6:00 UTC on July 31, 2023, investors who are interested in DBC can easily buy and sell it on LBank Exchange by then. The listing of DBC token on LBank Exchange will undoubtedly help it further expand its business and draw more attention in the market.</p><p>Learn More about DBC Token:</p><p>Official Website: https://www.dbear.io/</p><p>Contract: https://etherscan.io/token/0xe1C6785660eB3C1b2744BfF7504dF5F6ad6276E3</p><p></p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users' funds and aims to contribute to the global adoption of cryptocurrencies.</p><p>Start Trading Now: lbank.com</p><p>Community &amp; Social Media:&nbsp;&nbsp;Telegram l&nbsp;Twitter l&nbsp;Facebook l&nbsp;LinkedIn l&nbsp;Instagram l&nbsp;YouTube</p><p>Press contact:&nbsp;</p><p>press@lbank.info</p>ContactLBK Blockchain Co. Limitedmarketing@lbank.info"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-29T18:04:05.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-29T17:56:59.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-29T17:55:41.000Z",
    "title": "How Autonomous Mobile Robots (AMRs) and Drones Upgrade Warehousing Processes",
    "url": "https://www.cryptopolitan.com/how-autonomous-mobile-robots-amrs-and-drones-upgrade-warehousing-processes/",
    "description": "The exponential growth of online retail has led to a surge in warehouse demand. However, with the scarcity of available labor, the warehouse industry is turning to autonomous robots and drones to optimize operations. These advanced machines, equipped with intelligent sensor technologies, are revolutionizing the way goods are handled, enabling smoother inventory management, pick and ... <a title=\"How Autonomous Mobile Robots (AMRs) and Drones Upgrade Warehousing Processes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-autonomous-mobile-robots-amrs-and-drones-upgrade-warehousing-processes/\" aria-label=\"More on How Autonomous Mobile Robots (AMRs) and Drones Upgrade Warehousing Processes\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-29T18:00:01.000Z",
    "title": "ALERT! This Exciting Meme Coin Will Change Your Financial Fortunes Forever",
    "url": "https://www.crypto-news-flash.com/alert-this-exciting-meme-coin-will-change-your-financial-fortunes-forever/?utm_source=rss&utm_medium=rss&utm_campaign=alert-this-exciting-meme-coin-will-change-your-financial-fortunes-forever",
    "description": "<img width=\"512\" height=\"307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-29T160701.089.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-29T160701.089.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-29T160701.089-300x180.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-29T160701.089-336x200.png 336w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The global cryptocurrency market revenue is expected to clock a growth rate of 14.40% by 2027 – that&#8217;s an increase of around $64 billion. The magnitude of these figures reflects the potential of cryptocurrencies and why they have evolved as a dependable financial instrument. With no taxes or hidden charges, cryptocurrencies can drive financial inclusion [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-29T17:44:09.000Z",
    "title": "LBank Exchange Will List DBear Coin (DBC) on July 31, 2023",
    "url": "https://www.crypto-news-flash.com/lbank-exchange-will-list-dbear-coin-dbc-on-july-31-2023/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-exchange-will-list-dbear-coin-dbc-on-july-31-2023",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1600-900endbc_16906448910BeoivhImv.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1600-900endbc_16906448910BeoivhImv.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1600-900endbc_16906448910BeoivhImv-300x180.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1600-900endbc_16906448910BeoivhImv-1024x614.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1600-900endbc_16906448910BeoivhImv-768x461.jpeg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Road Town, BVI, July 29th, 2023, Chainwire LBank Exchange, a global digital asset trading platform, will list DBear Coin (DBC) on July 31, 2023. For all users of LBank Exchange, the DBC/USDT trading pair will be officially available for trading at 6:00 UTC on July 31, 2023. DBear Coin (DBC) is a lifestyle Blockchain-Commerce for [...]"
  }
]