[
  {
    "source": "BTCManager",
    "date": "2023-08-31T22:08:54.000Z",
    "title": "US SEC postpones ruling on 6 spot Bitcoin ETF applications",
    "url": "https://crypto.news/us-sec-postpones-ruling-on-6-spot-bitcoin-etf-applications/",
    "description": "The SEC has delayed its decision on six spot Bitcoin ETF applications from WisdomTree, Invesco Galaxy, Valkyrie, VanEck, Fidelity, and BlackRock"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-31T21:49:22.000Z",
    "title": "Live mishap: crypto YouTuber accidentally displays private keys, loses $60k",
    "url": "https://crypto.news/live-mishap-crypto-youtuber-accidentally-displays-private-keys-loses-60k/",
    "description": "Brazilian streamer loses $60K in crypto on live YouTube broadcast, after mistakenly showing his private keys on screen"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-31T22:00:05.000Z",
    "title": "Bitcoin Unveiled Trail: Q4 Tumble, ETF Battles, Mt. Gox Drama, And Economic Shivers Await",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-unveiled-trail-q4-tumble-etf-battles-mt-gox-drama-and-economic-shivers-await/",
    "description": "In a recent legal win for Grayscale against the US Securities and Exchange Commission (SEC), Bitcoin (BTC) soared to $27,000. However, the bullish sentiment seems to have waned as the cryptocurrency has retraced to $26,000.  QCP Capital, a cryptocurrency analysis firm, has provided valuable insights into the implications of this ruling and the overall market outlook. BTC’s Short-Term Challenges Persist According to QCP, while the ruling is a positive outcome for the industry, the firm notes that its near-term impact on spot prices is “inconsequential.”  The firm cautions against getting caught up in the short-term “knee-jerk pump” in spot prices and volatility, suggesting it may present an opportunity to fade such fluctuations. Related Reading: Court Says Yes To Binance Request In Case Against SEC It is important to note that the ruling does not equate to approval of Grayscale&#8217;s application nor guarantees approval for the refilling of GBTC. The SEC still holds the authority to reject the refilling on new grounds.  However, QCP Capital believes that the ruling solidifies the likelihood of an eventual approval for a Bitcoin spot exchange-traded Fund (ETF) while increasing the probability that the SEC will defer the decision to the March 2023 final deadline. What’s concerning, is that QCP Capital&#8217;s wave count analysis, previously shared in their update two weeks ago, suggests that a final push higher to conclude the B wave correction is probable in the coming weeks.  This, coupled with positive developments in the Artificial Intelligence (AI) sector led by companies like NVIDIA and recent strength in traditional proxies such as Gold and Rates, creates a more favorable environment for cryptocurrencies. Despite these positive factors, QCP Capital anticipates a potential Q4 2023 start near the market lows. They attribute this to fading optimism surrounding the spot ETF due to SEC delays and a perceived lack of innovation within the cryptocurrency sector compared to other technology sectors.  Additionally, the upcoming Mt. Gox payout is expected to exert short-term bearish pressure on the market. However, QCP Capital remains optimistic about a significant rally in Q1 of 2024. They anticipate the likely approval of the ETF in March, coinciding with the upcoming Bitcoin halving in April, and a potential US economic slowdown in Q2.  To capitalize on this outlook, the firm suggests considering a topside end March 2024 option structure, which offers limited loss and the potential for a substantial payout if the bullish scenario unfolds. Bitcoin Faces Downside Pressure According to Material Indicators, a prominent analysis firm&#8217;s algorithmic models, called Trend Precognition, indicate a downside trend on multiple timeframes for Bitcoin (BTC).  The Daily chart, which closes in less than 9 hours, the Weekly chart, which closes in 3 days, and the Monthly chart, which closes in less than 9 hours, all point towards a potential test of support shortly. Related Reading: Dogecoin And Bitcoin Become Latest Additions To Robinhood Wallet Per the firm’s analysis, the Weekly signal would be invalidated if BTC’s price moves and holds below the $25,350 level. However, if support holds above the lower low (LL) at $24,750, it would provide a solid foundation for a potential rally and a retest of resistance. Overall, both QCP Capital and Material Indicators concur that the analysis points towards continuing Bitcoin&#8217;s current downtrend in the short term.  Presently, Bitcoin is trading at $26,100, reflecting a 3% decline over the past 24 hours. The upcoming days will reveal whether these projected scenarios materialize or if the cryptocurrency manages to consolidate at its current level, resulting in sideways price action. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-31T22:01:14.000Z",
    "title": "Mysterious Shiba Inu Whale Abruptly Moves 4,642,530,677,374 SHIB – Here’s Where the Crypto’s Headed",
    "url": "https://dailyhodl.com/2023/08/31/mysterious-shiba-inu-whale-abruptly-moves-4642530677374-shib-heres-where-the-cryptos-headed/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/whales-favoring-shiba.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/whales-favoring-shiba.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/whales-favoring-shiba.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/whales-favoring-shiba.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/whales-favoring-shiba.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/whales-favoring-shiba.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/whales-favoring-shiba.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A mysterious Shiba Inu (SHIB) whale is suddenly moving trillions of the memecoin after its developers brought the project’s layer-2 scaling solution Shibarium back online. New data from whale-surveying platform Whale Alert reveals that an anonymous deep-pocketed SHIB investor abruptly shifted a staggering 4,642,530,677,374 tokens, worth about $38 million, from one unknown wallet to another [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/31/mysterious-shiba-inu-whale-abruptly-moves-4642530677374-shib-heres-where-the-cryptos-headed/\">Mysterious Shiba Inu Whale Abruptly Moves 4,642,530,677,374 SHIB – Here’s Where the Crypto’s Headed</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]