[
  {
    "source": "Cointelegraph",
    "date": "2023-06-13T00:56:43.000Z",
    "title": "eToro halts ALGO, MANA, MATIC and DASH purchases for US customers",
    "url": "https://cointelegraph.com/news/etoro-algo-mana-matic-dash-purchases-us-customers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/f026a359-a72c-4139-b274-e58ee3b66e1f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The firm said it remains a “supporter” of the crypto sector and suggested that the move was purely to avoid any potential regulatory non-compliance. </p>\n                    <p><p>Retail trading platform eToro has halted purchases of Algorand (<a href=\"https://cointelegraph.com/algorand-algo-price-index\">ALGO</a>), Decentraland (<a href=\"https://cointelegraph.com/decentraland-mana-price-index\">MANA</a>), Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>), and Dash (<a href=\"https://cointelegraph.com/dash-price-index\">DASH</a>) for customers in the United States in response to their labeling as securities in <a href=\"https://cointelegraph.com/news/sec-charges-binance-coinbase-terrible-defi\">recent SEC lawsuits</a>.</p><p>The move comes just a few days after competitor <a href=\"https://cointelegraph.com/news/robinhood-will-end-support-for-3-tokens-named-in-sec-lawsuits\">Robinhood also halted support</a> for MATIC and two other SEC-deemed <a href=\"https://cointelegraph.com/news/sol-is-not-a-security-says-the-solana-foundation\">securities</a> — Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>), and Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>). </p><p>In a June 12 Twitter thread, eToro US noted that it had reviewed its crypto listings ”in light of the rapidly evolving regulatory landscape” and “recent developments” with the SEC. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">eToro has a framework in place which reviews the cryptoassets we offer in light of the rapidly evolving regulatory landscape. Due to recent developments, we will be making some changes to our crypto offering for US customers. (1/5)</p>&mdash; eToro US (@eToroUS) <a href=\"https://twitter.com/eToroUS/status/1668323755435622405?ref_src=twsrc%5Etfw\">June 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The assets were officially delisted as of 6:00 am ET on July 12, however, eToro US users will still be able to hold and sell these assets. </p><p>“We remain a supporter of crypto assets and believe in the importance of offering our users access to a diversified range of asset classes, which includes stocks, ETFs, and options. We are committed to working closely with regulators around the world to shape the future of the crypto industry and champion access for the ordinary investor,“ the firm stated.</p><p>The firm has essentially opted to err on the side of caution, given that the SEC has now asserted in<a href=\"https://cointelegraph.com/news/sec-s-binance-suit-contains-heady-mix-of-predictable-charges-novel-revelations\"> lawsuits against Binance</a> and Coinbase that major assets such as ADA, SOL, MATIC, MANA, ALGO, and several others are securities. </p><p> <strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/breaking-us-lawmakers-file-sec-stabilization-act-to-fire-gary-gensler\"><strong><em>Breaking: US lawmakers file ‘SEC Stabilization Act’ to fire Gary Gensler</em></strong></a></p><p>Notably, eToro hasn’t mentioned anything about Solana or Cardano, which were also deemed as securities in the recent lawsuits.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">interesting<br><br>eToro is removing Polygon and Algorand but not Solana <a href=\"https://t.co/ZjigTmLmO0\">pic.twitter.com/ZjigTmLmO0</a></p>&mdash; lightspeed mert | helius.dev (@0xMert_) <a href=\"https://twitter.com/0xMert_/status/1668375373757796359?ref_src=twsrc%5Etfw\">June 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>This isn’t the first time eToro US has moved to halt access to certain assets in response to the litigation-friendly SEC. In December 2020, the <a href=\"https://cointelegraph.com/news/us-exchanges-are-suspending-or-delisting-xrp-left-and-right\">firm also delisted Ripple</a> (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) following the SEC’s lawsuit against Ripple Labs. </p><p>Cointelegraph has reached out to eToro US over the halting of certain assets and the choice to not halt others, and will update the story if the firm responds. </p><p> <strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong>Crypto regulation — Does SEC Chair Gary Gensler have the final say?</strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-13T01:00:30.000Z",
    "title": "Apple’s Vision Pro Launch Impacts Metaverse, Why This Token Recorded 160% In Profits",
    "url": "https://www.newsbtc.com/news/apple-vision-pro-launch-impacts-metaverse-why-this-token-recorded-160-in-profits/",
    "description": "The crypto market has been flowing in a sea of red as major assets experienced a correction over the weekend, but tech giant Apple could offer relief. Every cryptocurrency, except for Bitcoin, trended to the downside, but some sectors have bloomed amidst the panic and selling pressure. Related Reading: Cardano Price Falls Below Key Support Levels, Will It Continue To Fall? In particular, some tokens in the Metaverse sector have seen important profits. The assets’ positive price action, defying the overall trend in the crypto market, seems related to Apple’s launch of its new product the Vision Pro. Metaverse Tokens Bloom As Hype For The Apple Vision Pro Growths Apple’s Vision Pro is the company’s first “spatial computer,” the headset will allow users to blend the physical with the digital world. In that sense, people will have the capacity to interact with applications, content, media across different formats, and more. The Metaverse and the projects using blockchain technology to support their platforms want to achieve the same objectives. Thus, there has been a growing correlation between Metaverse tokens and announcements from big tech companies related to the sector. According to a study from CoinGecko, the Apple Vision Pro highlighted the positive performance of Metaverse and Augmented Reality tokens. At its publication, the study showed that Ovr and its native Metaverse token (OVR) saw a 168.6% increase on the back of the announcement. By late May and early June, the token climbed from a low of around $0.28 to $0.74. Other small-cap tokens in the sector experienced similar gains. VFOX recorded a 62% profit between May 15 and June 7, and virtual reality token CUBE from the Metaverse project Somnium rose by around 40% over the same period. Metaverse tokens with larger market caps appreciated pre and after the Apple announcement, although they registered fewer profits. The Sandbox (SAND) saw an 18% increase between mid-May and June 5, and Decentraland (MANA) saw fewer gains, with an 11% profit mostly registered during the announcement. As seen in the chart below, SAND, OVR, and VFOX were just some of the tokens that benefited from the launch of the Vision Pro. Related Reading: Insights On ADA’s Security Concerns: Cardano Founder And Ripple CTO Exchange Views However, the Metaverse has been partially affected by the current trend in the overall crypto market. Some tokens retraced some of their gains on the back of the most recent downturn, but the current price dip could be favorable for long-term investors, as these tokens could continue to benefit from similar announcements."
  }
]