[
  {
    "source": "Decrypt",
    "date": "2023-07-13T08:15:29.000Z",
    "title": "Fractionalized NFT Project Particle Loans $12.9M Banksy Artwork to Global Museums",
    "url": "https://decrypt.co/148406/fractionalized-nft-project-particle-loans-12-9m-banksy-artwork-global-museums",
    "description": "The 10,000 co-owners of the artwork voted for the loan, which will send it to London, Amsterdam, and Barcelona. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-13T08:29:18.000Z",
    "title": "U.S. industry watchdogs oppose draft bill on crypto market structure",
    "url": "https://cointelegraph.com/news/crypto-u-s-industry-watchdogs-oppose-draft-bill-on-crypto-market-structure",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/0f9ece2b-988a-4404-99a9-77f48ee7ed1b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The group sent a detailed letter to the U.S. House Committee on Financial Services accusing the crypto market of seeking favorable legislation under the guise of crypto innovation.</p>\n                    <p><p>An alliance of industry watchdogs based in the United States has united to express their opposition to the proposed draft bill on the <a href=\"https://cointelegraph.com/category/market-analysis\">crypto market</a> structure by the United States House Financial Services Committee.</p><p>In a detailed correspondence addressed to the U.S. House Committee on Financial Services, groups including Americans for Financial Reform and the Center for Responsible Lending <a href=\"https://ourfinancialsecurity.org/wp-content/uploads/2023/07/Crypto-Markets-Bill.-Org-Opposition-Letter.July-11-2023.pdf\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> that stakeholders in the crypto industry had actively lobbied in support of the Committee's draft proposal, known as the 'Digital Asset Market Structure Discussion Draft' bill. The watchdogs asserted that the crypto industry failed to demonstrate any practical use cases beyond speculative investment.</p><p>The letter accused the crypto market of seeking favorable legislation under the guise of crypto innovation:</p><blockquote>\"Of particular concern is the proposed bill's provision that would alter the SEC's evaluation of regulatory rulemaking in all securities markets, compelling the agency to assess new rules based on the criterion of 'innovation.'\"</blockquote><p>The intention behind the comprehensive digital asset bill was to <a href=\"https://cointelegraph.com/news/us-lawmakers-aim-for-crypto-regulatory-clarity-with-proposed-bill-putting-the-screws-to-sec\">establish a regulatory framework</a> in the United States, encompassing well-defined rules and guidelines for the crypto industry. Earlier, Cointelegraph reported that the committee Chair, Patrick McHenry<a href=\"https://cointelegraph.com/news/us-financial-services-committee-sets-date-to-discuss-future-of-crypto\"> planned to hold a committee vote</a> in July 2023. The focal point of the draft bill revolves around the involvement of the U.S. Securities and Exchange Commission (SEC) in overseeing the regulatory framework.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/2a82d17d-9f25-4ffa-be2c-77a5516ee82c.JPG\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of the Crypto Markets Bill opposition sign-on letter. Source: Our Financial Security</em></figcaption></figure><p>In June 2023, the SEC launched individual <a href=\"https://cointelegraph.com/news/sec-lawsuit-binance-coinbase-crypto-industry-comments\">legal actions against two prominent crypto exchanges</a>, Coinbase and Binance, both known for their substantial trading volumes. Surprisingly, traders swiftly assimilated this news, resulting in minimal impact on the price of Bitcoin.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/what-to-expect-from-coinbase-sec-first-hearing\"><strong><em>What to expect from the first Coinbase-SEC hearing</em></strong></a></p><p>In opposition to widespread demand, the watchdogs asserted that Congress should actually back the ongoing enforcement actions of the SEC as a means to \"safeguard consumers.\" Conversely, various jurisdictions in Europe and Asia are <a href=\"https://cointelegraph.com/innovation-circle/europe-and-asia-not-the-us-will-lead-in-blockchain\">actively striving to accommodate crypto businesses</a> relocating away from the United States.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-13T08:25:51.000Z",
    "title": "LBank Labs joins Draper and INCE Capital in investing in LunarCrush",
    "url": "https://cryptodaily.co.uk/2023/07/lbank-labs-joins-draper-and-ince-capital-in-investing-in-lunarcrush",
    "description": "<p>Road Town, BVI, July 13th, 2023, Chainwire</p><p>LBank Labs, a leading blockchain venture fund, is excited to announce its investment in LunarCrush, a social intelligence platform for crypto, NFTs, and stocks. LBank Labs is known for its protocol and exchange-agnostic approach and provides support to projects through direct funding, acceleration, incubation, and networking.</p><p>With a versatile $100 Million Web3 fund, LBank Labs invests in diverse opportunities, including Fund of Fund investments, Liquid projects, and Direct Investments in promising early-stage endeavors. The team at LBank Labs comprises Web3 veterans from respected entities like Binance Labs, Binance NFT, Bitmain, Huobi Listing, Consensys, and other industry pioneers, bringing together extensive expertise and networks.</p><p>LBank Labs takes pride in its innovative strategy for identifying promising prospects in the Web3 space. The fund's primary focus is on the Platform Standard Ecosystem (PSE), and LunarCrush stands out as an exceptional example of user acquisition, retention, and aggregation. LunarCrush sets the standard for industry giants like Coinbase and Kraken, aggregating data and surpassing expectations.</p><p>Unlike other players in the industry, LBank Labs takes a nuanced and sophisticated approach, emphasizing projects with a proven track record of adoption and recognition. Projects with robust platforms that drive user adoption and engagement are prioritized, as they serve as benchmarks for others and contribute to sustainable growth.</p><p>In 2022, LunarCrush analyzed over 1 trillion data parameters, establishing itself as a leader in the field. With an impressive monthly active user base of 400,000 to 600,000, LunarCrush is becoming the go-to platform for analyzing cryptocurrencies and stock investments. The platform attracted 100 million visitors in 2022, showcasing its growing popularity and influence.</p><p>LunarCrush offers multiple revenue models, including API integrations, traditional advertising, and its native token $Lunr, which supports the ecosystem's growth. In 2023, LunarCrush plans to introduce a trading capitalization component to further enhance its offerings. Notably, LunarCrush provides data to prominent companies like Coinbase and Kraken's CryptoWatch.</p><p>Joe Vezzanie, CEO of Lunar Crush, expressed excitement about the collaboration with LBank Labs, highlighting the synergy between their analytics expertise and LBank Labs' scale across the trading market.</p>&ldquo;We are excited to have a strategic investor like LBank Labs join the Series A at LunarCrush. Their scale across the trading market along with our expertise in analytics creates synergy and allows both of our businesses to scale together.&rdquo;<p>LBank Labs joins a prestigious group of blockchain technology investors supporting LunarCrush, including Draper Ventures, INCE Capital, TRGC, MoonPay Ventures, and Techstars. LBank Labs has been a strong supporter of LunarCrush since their initial investment in 2020, providing consistent support over the years.</p><p>Valeria Kholostenko, Principal Investor for the US at LBank Labs, praised LunarCrush's growth and product, expressing confidence in its future success:</p>&ldquo;In 2020, I met Joe Vezzani during LunarCrush's early development. His professionalism and dedication have fueled the company's impressive growth. With their exceptional achievements and top-tier product, LunarCrush is poised for great success!&rdquo;<p>With LunarCrush's impressive growth trajectory, strong team, and expanding product, it is positioned to become an essential tool for investment research. The platform's broad user base across social channels caters to investors, companies, newcomers, and professionals alike.</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users&rsquo; funds and aims to contribute to the global adoption of cryptocurrencies.</p><p>Community &amp; Social Media:&nbsp;l&nbsp;Telegram&nbsp;l&nbsp;&nbsp;Twitter&nbsp;l&nbsp;&nbsp;Facebook&nbsp;l&nbsp;&nbsp;LinkedIn&nbsp;l&nbsp;&nbsp;Instagram&nbsp;l&nbsp;&nbsp;YouTube</p>ContactLBankpress@lbank.info"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-13T08:30:53.000Z",
    "title": "Temasek Has No Immediate Intentions to Invest in Crypto Exchanges After FTX Loss",
    "url": "https://news.bitcoin.com/temasek-has-no-immediate-intentions-to-invest-in-crypto-exchanges-after-ftx-loss/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2181535989_s-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Temasek Has No Immediate Intentions to Invest in Crypto Exchanges After FTX Loss\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2181535989_s-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2181535989_s-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2181535989_s-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2181535989_s-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2181535989_s-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2181535989_s-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2181535989_s.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Singapore’s state-owned investment fund Temasek does not plan to put money into crypto firms amid the current regulatory uncertainty, according to a top executive. The statement comes months after Temasek lost $275 million from its involvement in the failed cryptocurrency exchange FTX. Temasek to Refrain From Investments in Crypto Companies for Now The sovereign wealth [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-13T08:10:36.000Z",
    "title": "Algorand Receives Collaboration Proposal from Blockchain Founder for Cardano Partnership",
    "url": "https://www.cryptopolitan.com/collaboration-between-cardano-and-algorand/",
    "description": "In a surprising move within the blockchain industry, Charles Hoskinson, the founder of Cardano, has extended a proposition to Algorand, a competing blockchain protocol. Hoskinson has suggested that Algorand transfer its codes onto the Cardano platform, presenting the potential benefits of becoming a sidechain. This proposal emerged following a tweet from John Woods, the CTO ... <a title=\"Algorand Receives Collaboration Proposal from Blockchain Founder for Cardano Partnership\" class=\"read-more\" href=\"https://www.cryptopolitan.com/collaboration-between-cardano-and-algorand/\" aria-label=\"More on Algorand Receives Collaboration Proposal from Blockchain Founder for Cardano Partnership\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-13T08:30:44.000Z",
    "title": "Whales Accumulates Stablecoins, Eyes Bitcoin Price Range",
    "url": "https://nulltx.com/whales-accumulates-stablecoins-eyes-bitcoin-price-range/",
    "description": "Recent information suggests that both sharks (experienced traders with large capital) and whales (entities with substantial cryptocurrency holdings) are closely observing the price range of Bitcoin, specifically in the $30k to $31k range. This indicates that these market participants are interested in this particular price level and are likely assessing the market conditions before making [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-13T08:11:40.000Z",
    "title": "US government transfers BTC worth $300m from Coinbase",
    "url": "https://crypto.news/us-government-transfers-btc-worth-300m-from-coinbase/",
    "description": "The US government moved over $297 million worth of bitcoin (BTC) seized from the Silk Road hacker in March. The total amount captured from the hacker was worth over $1 billion — 49,000 bitcoins — in March. At the current&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-13T08:25:54.000Z",
    "title": "LBank Labs joins Draper and INCE Capital in investing in LunarCrush",
    "url": "https://www.crypto-news-flash.com/lbank-labs-joins-draper-and-ince-capital-in-investing-in-lunarcrush/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-labs-joins-draper-and-ince-capital-in-investing-in-lunarcrush",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1280X1280_1689234362noWUxsvHu9.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1280X1280_1689234362noWUxsvHu9.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1280X1280_1689234362noWUxsvHu9-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1280X1280_1689234362noWUxsvHu9-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1280X1280_1689234362noWUxsvHu9-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Road Town, BVI, July 13th, 2023, Chainwire LBank Labs, a leading blockchain venture fund, is excited to announce its investment in LunarCrush, a social intelligence platform for crypto, NFTs, and stocks. LBank Labs is known for its protocol and exchange-agnostic approach and provides support to projects through direct funding, acceleration, incubation, and networking. With a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-13T08:12:07.000Z",
    "title": "Bitcoin ETFs and this 5 things will push Bitcoin and cryptocurrencies Prices to a massive bull run in Q3- Repost",
    "url": "https://www.crypto-news-flash.com/bitcoin-etfs-and-this-5-things-will-push-bitcoin-and-cryptocurrencies-prices-to-a-massive-bull-run-in-q3-repost/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-etfs-and-this-5-things-will-push-bitcoin-and-cryptocurrencies-prices-to-a-massive-bull-run-in-q3-repost",
    "description": "<img width=\"1000\" height=\"647\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF-300x194.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/lentamart-Bitcoin-ETF-768x497.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Bitcoin&#8217;s price surge in the first half of 2023 has set the stage for a potential bull run in Q3. Five key factors, including Bitcoin ETFs and strong market fundamentals, contribute to the positive outlook. In line with the recent report by Nasdaq.com, Bitcoin ETFs and these five factors are expected to propel Bitcoin and [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-13T08:33:14.000Z",
    "title": "The Nª 1 Analytics Platform for Crypto Traders and Investors",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-number-1-analytics-platform-for-crypto-traders-and-investors/",
    "description": "<p>DexCheck is a strategy-based sports game that is having interesting developments. Nowadays, they are launching their native token in 5 launchpads from July 17 to 19th.  📢 DexCheck IDO Dates have changed! Mark your calendars for the new IDO dates: 👉 July 17th &#8211; @Chain_GPT and @enjinstarter 👉 July 18th &#8211; @SeedifyFund and @decubate 👉 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/the-number-1-analytics-platform-for-crypto-traders-and-investors/\">The Nª 1 Analytics Platform for Crypto Traders and Investors</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]