[
  {
    "source": "CoinDesk",
    "date": "2023-09-20T13:18:47.000Z",
    "title": "South Koreans Hold $99B of Digital Assets Overseas: Tax Service",
    "url": "https://www.coindesk.com/policy/2023/09/20/south-koreans-hold-99b-of-digital-assets-overseas-tax-service/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The crypto held in overseas accounts for about 70% of all assets held outside the country."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-20T13:30:00.000Z",
    "title": "‘AI has killed the industry’: EasyTranslate boss on adapting to change",
    "url": "https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/magazine-EasyTranslate-boss-says-AIs-have-killed-the-industry-Heres-his-Plan-B-scaled.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>If you’re not transforming your business to take advantage of AI now, you’ll be left behind, says Easy Translate boss Frederik Pedersen.</p>\n                    <p><p>The launch of generative AI products over the past nine months has the world talking about how it will change the future. Many are frightened. Others are excited about the opportunity.</p><p>A report last month from Next Move Strategy Consulting <a href=\"https://www.nextmsc.com/report/artificial-intelligence-market\" target=\"_blank\" rel=\"nofollow\" >predicts</a> the AI industry will grow 20x in the next seven years, creating a $2 trillion business, up from its current value of $100 billion. It might sound like wild hype, but other analysts from McKinsey, Morgan Stanley and BlackRock all map out a similar trajectory. AI is here to stay, and a lot of human lives will be upended. But its also the chance of a lifetime.</p><p>Frederik Pedersen, the co-founder of Danish AI company <a href=\"http://easytranslate.com\" target=\"_blank\" rel=\"nofollow\" >EasyTranslate</a> and son of one of Denmarks most famous men, is approaching the future head-on.</p><blockquote class=\"wp-block-quote\"><p>I have been saying for a long time that translation is dead and AI has killed the industry as we know it, but that hasnt gone down particularly well with my competitors. Now, however, those same people are listening and are realising that they may be too late if they want to transform their business.</p></blockquote><h2 class=\"wp-block-heading\" id=\"h-son-of-danish-politician-klaus-riskaer-pedersen\">Son of Danish politician Klaus Riskr Pedersen</h2><p>Its not easy to be the child of a powerful person, as has been recently and brilliantly illustrated by the TV series <em>Succession. </em>If theres a Logan Roy in the family, its difficult for the child to be their own person.</p><p>Some crash and burn; some, such as singers Justin Bieber and Miley Cyrus, try to shock their parents by being outlandish and independent. Its rarely a good look.</p><p>Others, however, do it in smarter ways and emerge from that parental shadow by adopting different mechanisms to build their own reputation. </p><p>In the case of Pederson, now 35, it was technology that enabled him to do so. First, with translation software, and now, generative AI has overtaken it.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/easytranslate-1.jpg\" alt=\"Frederik Pederson knows how to pivot\" class=\"wp-image-23916\" width=\"300\" height=\"409\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/easytranslate-1.jpg 600w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/easytranslate-1-220x300.jpg 220w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><figcaption class=\"wp-element-caption\"><em>Pederson knows how to pivot. (Supplied)</em></figcaption></figure><p>His dad, Klaus Riskr Pedersen, is a controversial Danish political party leader, entrepreneur, businessman and author. Everybody in Denmark knows his name.</p><p>His chequered career includes being a member of the European Parliament for the Liberal Party, writing books, developing, building and selling around 15 companies over three decades. He set up his own political party in 2018.</p><p>But there have been controversies. He has several convictions for fraud and has spent different spells in jail, as well as splitting Danish public opinion and having the social life that goes with such apparent conviviality. </p><p>At first, (Frederik) Pedersen suffered. In and out of schools, he tried to find a way of acceptance and struggled. He didnt make it to university, but he did know about technology and became interested in its power and consequently found a way to plow his own furrow.</p><p>It took me some time to find a direction, but slowly I realized that the world was all about communication. I knew I was from a privileged family, but educators always seemed to have a lack of empathy and communication when I was a child. I was made to feel different, and it was a difficult place to be.</p><p>But I came through it, and those life lessons set me up for all the changes that life throws at you. So I set up a translation company, and now Im pivoting the company into <a href=\"https://cointelegraph.com/magazine/ai-eye-is-ai-a-threat-why-ai-advance/\" target=\"_blank\" rel=\"nofollow\" >generative AI</a> because of the huge opportunity it offers humanity, not least the same elements of communication, says Pedersen.</p><section class=\"adv-banner adbutler-ad adbutler-ad__desktop\"><div class=\"container\"><!-- 1456x180 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><section class=\"adv-banner adbutler-ad adbutler-ad__mobile\"><div class=\"container\"><!-- 600x500 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><h2 class=\"wp-block-heading\">Early access to OpenAIs ChatGPT</h2><p>The AI light started to dawn on him back in 2020.</p><p>That year, Pedersen applied to the Danish Innovation Fund for a 65,000 euro grant to create a content generator engine that would enable him to create a new form of translation:</p><p>I realized that the biggest issue in e-commerce when it came to languages was not translation in itself, but creating localized content for retailers different products that customers could relate to, he explains, adding the company spent the money to train neural networks to create these product descriptions.<br><br><strong>Also read: <em><a href=\"https://cointelegraph.com/magazine/ai-eye-real-ai-usecases-crypto-gemini-gpt-4-rival-roblox-assistant-ai-cheating/\" target=\"_blank\" rel=\"nofollow\" >AI Eye  Real uses for AI in crypto, Googles GPT-4 rival, AI edge for bad employees</a></em></strong></p><p>A neural network is a type of machine learning process called deep learning that uses interconnected nodes or neurons in a layered structure that resembles the human brain.</p><p>We branded it content-as-a-service and couldnt believe we were one of the first companies to do it, he says, though it ended up proving the old adage that being early is the same as being wrong.</p><blockquote class=\"wp-block-quote\"><p>Ultimately we were ahead of the technology and while our technology could build sentences, it just wasnt good enough for our customers.</p></blockquote><p>This first effort was not wasted time and money, however, as it meant the company was able to hit the ground running when large language models were released publicly. EasyTranslate obtained early access to ChatGPT because it already had an account with OpenAI and was able to adopt and execute the technology instantly.</p><p>From that point, EasyTranslate pivoted to a generative AI content future based on Pedersens thesis that traditional translation was indeed dead.</p><figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\"><blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Are we \"sunsetting\" translation?<br>And will human copywriters go extinct?<br><br>Read our take on the role of humans in this new era and check out this thought-provoking article about <a href=\"https://twitter.com/hashtag/translation?src=hash&ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >#translation</a> and <a href=\"https://twitter.com/hashtag/AI?src=hash&ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >#AI</a><a href=\"https://t.co/8rOYQBKriu\" target=\"_blank\" rel=\"nofollow\" >https://t.co/8rOYQBKriu</a></p>— EasyTranslate (@EasyTranslate) <a href=\"https://twitter.com/EasyTranslate/status/1673068601740238848?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >June 25, 2023</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></figure><h2 class=\"wp-block-heading\"><strong>Translation meets technology</strong></h2><p>It was not the first change in direction for Pedersens company. Formed in 2010 without venture capital, the translation service grew quickly.</p><p>In 2016, it went after bigger fish and started offering interpretation services to the Danish government after realizing there was an opportunity with the launch of Apples FaceTime. According to Pedersen, interpreters were super-expensive, inefficient and slow, and travel for in-person events wasnt exactly climate change-friendly. </p><p>Pedersen created a video interpretation app that streamlined costs and increased efficiency by offering a marketplace and matching service for interpreters as well as remote interpreter services. </p><p>Danish municipalities signed up for the service, including the Danish Ministry of Justice, recognizing that bringing an interpreter to a court was a very expensive business, especially due to the often last-minute nature of such needs.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/blockchain-startups-think-justice-can-be-decentralized-but-the-jury-is-still-out/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Blockchain Startups Think Justice Can Be Decentralized, but the Jury Is Still Out</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Experts want to give AI human souls so they dont kill us all</p>                        </a>                    </div></div></div><h2 class=\"wp-block-heading\">Danish operation a success, but the patient died</h2><p>At its height, the company was running 1,000 interpretation meetings a day, and between 2017 and 2019, it was responsible for more than 70% of the Danish governments interpretation business.</p><p>However, Pedersen says the Danish government had never outsourced such business, and the relationship turned sour.</p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"600\" height=\"439\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/easytranslate-2.jpg\" alt=\"Pedersen believes that AI and humans can work together in harmony\" class=\"wp-image-23917\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/easytranslate-2.jpg 600w, https://cointelegraph.com/magazine/wp-content/uploads/2023/09/easytranslate-2-300x220.jpg 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" /><figcaption class=\"wp-element-caption\"><em>Pedersen believes that AI and humans can work together in harmony. (Supplied)</em></figcaption></figure><p>It was a very mutual and fruitful relationship for a long time, but we realized that working with governments was more difficult than we imagined. It was like the cliche of a heavy tanker not being able to turn around.</p><p>Again, it was the first learning curve for me. Yes, our data processing wasnt as good as it could have been and working with antiquated systems and reasoning was very difficult.</p><p>Eventually, the Danish government decided they didnt want to carry on with our relationship. It was hard at the time, but I still believe we succeeded, and we learned a lot, he says. </p><blockquote class=\"wp-block-quote\"><p>Lets just say, the operation was a success, but the patient died. There was also a lot of opposition from the strong Danish trade unions who thought we were putting people out of jobs.</p></blockquote><p>But it was not about putting people out of jobs, it was working with technology in the same way we work with AI now. Our interpreters who decided to join our community were extremely happy with our software. They said it was like having a PA that coordinated their calendar and ensured them productive days with the highest possible earnings  they managed to increase those earnings.</p><figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\"><blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">If your book is in the ChatGPT training data, did they steal it? If you make something with Midjourney, do you own it? Old questions and new arguments.<a href=\"https://t.co/aA2aZp1hpd\" target=\"_blank\" rel=\"nofollow\" >https://t.co/aA2aZp1hpd</a></p>— Benedict Evans (@benedictevans) <a href=\"https://twitter.com/benedictevans/status/1697545899252011143?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >September 1, 2023</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></figure><h2 class=\"wp-block-heading\">Impact of AI on jobs</h2><p>The impact of AI technology on employment is a source of great anxiety for many, with some predicting entire industries will be wiped out, while others suggest jobs will change and evolve rather than disappear.</p><p>A recent <a href=\"https://www.businessinsider.com/ai-unlikely-destroy-jobs-admin-workers-greatest-risk-chatgpt-2023-8\" target=\"_blank\" rel=\"nofollow\" >study</a> by the International Labour Organization found that women will be disproportionately affected by automation, with around 7.8% of jobs held by women in high-income countries (or 21 million) likely to be automated, but only 2.9% of jobs held by men (9 million).</p><p>Translation is a highly gendered industry too, with women accounting for around 67% of translators.</p><p>Pedersens thinking about the essential human element in technology  be that content generation or generative AI  is now central to EasyTranslates business.</p><p><strong>Also read: <em><a href=\"https://cointelegraph.com/magazine/ai-eye-better-results-being-nice-to-chatgpt-ai-fake-child-porn-debate-amazons-ai-reviews/\" target=\"_blank\" rel=\"nofollow\" >AI Eye  Get better results being nice to ChatGPT, AI fake child porn debate, Amazons AI reviews</a></em></strong></p><p>He believes that the combination of humans and AI is more powerful than just letting the AI do everything, using the example of a hard-working high school student who was angry at classmates for using AI to cheat.</p><p>Instead of cheating herself, she asked ChapGPT to mark her already-written essay. It sorted out the grammar and typos, and it gave her extra resources and links to improve her work beyond that of the cheater.</p><p>In business, everybody is looking for the magic of balance in the marketplace, that sweet spot where pricing, innovation and technology are aligned. We are also doing that when it comes to AI and humans; we want that magic balance there as well, he says.</p><figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\"><blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Blockchain and crypto empowers regular people to collectively own AI and will \"keep humans in the loop\".<br><br>(Via <a href=\"https://twitter.com/CointelegraphZN?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >@CointelegraphZN</a>) <a href=\"https://t.co/F4LVUDK9ES\" target=\"_blank\" rel=\"nofollow\" >https://t.co/F4LVUDK9ES</a></p>— Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1653463291480424461?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >May 2, 2023</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></figure><h2 class=\"wp-block-heading\"><strong>Humans still required in the loop</strong></h2><p>He cites humans in the loop as the way forward for humans and machines. Generative AI can do the heavy lifting, and <a href=\"https://www.forbes.com/sites/amyguttman/2023/07/18/meet-a-founder-putting-humans-at-the-center-of-his-ai-startup/\" target=\"_blank\" rel=\"nofollow\" >humans</a> can finish and finesse the job. It creates content in any language generated by AI but enhanced by humans.</p><p>There are others in business, such as <a href=\"https://www.thebaron.info/news/article/2023/07/12/ai-to-create-golden-age-of-news-reuters-boss\" target=\"_blank\" rel=\"nofollow\" >Reuters, </a>who also profess the humans in the loop phrase. Again, Ive been saying for a long time that this is the way forward to make both technology and humans better.</p><p>By harnessing the power of both and increasing machine learning in the process, I believe that the current dominance of LLMs will be replaced by small language models that can be tailored exactly for the customer  open source generative AI  that will be the future.</p><p>Thats what were planning for and how the whole AI sector will play out. Those companies that are prepared for that will prosper; those who arent will fail, he says.</p><p>Since Pedersens pivot to AI at the end of 2022, there has been increased investor interest in EasyTranslate, and the company <a href=\"https://tech.eu/2023/06/20/easytranslate-is-using-generative-ai-to-drill-down-to-client-specific-language-models/?hss_channel=tw-194509387\" target=\"_blank\" rel=\"nofollow\" >raised</a> 2.75 million euros earlier this year</p><p>We think that weve been ahead of our time, and that thinking has led us to embrace AI and take us to the next level. AI itself is just the mirror of what humanity has already created; AI is really the technological history of human knowledge.</p><p>I think its obvious that the two are perfectly compatible, that magic balance, so as generative AI evolves, so will those humans in the loop. Nobody with a good and adaptive brain will lose their job; their jobs and roles will be better and more creative, he concludes.</p><p>His father should be proud.</p><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.7\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-20T13:29:24.000Z",
    "title": "The Author's Guild launches class-action lawsuit against OpenAI ",
    "url": "https://cointelegraph.com/news/authors-guild-class-action-lawsuit-open-ai",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/7b5a5198-529a-4d8e-aef6-e86b9af99655.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>: The Author’s Guild opened a lawsuit against OpenAI alleging misuse of copyrighted material in training of its AI models.   </p>\n                    <p><p>The Author’s Guild in the United States opened a class-action <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.606655/gov.uscourts.nysd.606655.1.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">lawsuit</a> against the Microsoft-backed OpenAI on Sept. 19 due to its alleged misuse of copyrighted material in the training of its artificial intelligence (AI) models. </p><p>According to court documents, the oldest and largest professional organization for writers in the U.S. is operating under the Copyright Act and seeking “redress” for what it calls “flagrant and harmful infringement” of registered copyrights in written works of fiction. </p><p>It goes on to argue that works were copied wholesale and without permission or “consideration” by feeding them into large language models (LLMs). </p><blockquote>“These algorithms are at the heart of Defendants’ massive commercial enterprise. And at the heart of these algorithms is systematic theft on a mass scale.”</blockquote><p>The Author’s Guild said it represents a class of professional fiction writers whose “works spring from their own minds and their creative literary expression. ” It says therefore, since their livelihoods derive from these creative works, the LLMs “endanger” the ability of fiction writers to make a living. </p><p>It suggested that the AI models could’ve been trained via public domain or OpenAI could have paid a licensing fee for the usage of the copyrighted works. </p><p>“What Defendants could not do was evade the Copyright Act altogether to power their lucrative commercial endeavor, taking whatever datasets of relatively recent books they could get their hands on without authorization.”</p><p>On Sept. 11, the Guild posted an article on X about how it suggests authors can protect their work from AI web crawlers. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Did you know that you can block OpenAI&#39;s web crawler from accessing their website? We&#39;ve gathered some practical tips for authors to utilize so that they may protect their work from AI. <a href=\"https://t.co/6PwAre6hFt\">https://t.co/6PwAre6hFt</a></p>&mdash; The Authors Guild (@AuthorsGuild) <a href=\"https://twitter.com/AuthorsGuild/status/1701249277446537508?ref_src=twsrc%5Etfw\">September 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Pinned to the top of its profile the Author’s Guild has a link to its <a href=\"https://authorsguild.org/advocacy/artificial-intelligence/\" target=\"_blank\" rel=\"noopener nofollow\">advocacy</a> work in regards to AI technologies. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/elon-musk-sam-altman-bill-gates-discusses-ai-with-congress\"><strong><em>Elon Musk, Mark Zuckerberg and Sam Altman talk AI regs in Washington</em></strong></a></p><p>This filing from the Author’s Guild follows updates in a similar lawsuit against Meta and OpenAI and their respective AI models using copyrighted material in training. </p><p>Author <a href=\"https://cointelegraph.com/news/meta-and-open-ai-sued-for-copyright-violations-sarah-silverman\">Sarah Silverman and others</a> opened the lawsuit in July, however, now both companies have asked judges to <a href=\"https://cointelegraph.com/news/meta-refutes-copyright-infringement-claims-for-ai-training\">dismiss the claims</a>. </p><p>In August, the U.S. Copyright Office<a href=\"https://cointelegraph.com/news/us-copyright-office-issues-notice-of-inquiry-on-artificial-intelligence\"> issued a notice of inquiry</a> on AI seeking public comment on topics related to AI content production and how it should be handled by policymakers when AI content mimics that made by human creators. </p><p>Prior to the inquiry, U.S. District Judge Beryl Howell ruled that<a href=\"https://cointelegraph.com/news/u-s-judge-denies-copyright-for-ai-art\"> artwork created solely by AI</a> is not eligible for copyright protection.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/nft-collapse-and-monster-egos-feature-in-new-murakami-exhibition/\"><strong><em>NFT collapse and monster egos feature in new Murakami exhibition</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-09-20T13:30:00.000Z",
    "title": "‘AI has killed the industry’: EasyTranslate boss on adapting to change",
    "url": "https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/09/magazine-EasyTranslate-boss-says-AIs-have-killed-the-industry-Heres-his-Plan-B-scaled.jpg\"></p><p>If you’re not transforming your business to take advantage of AI now, you’ll be left behind, says Easy Translate boss Frederik Pedersen.</p>\n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-20T13:30:25.000Z",
    "title": "The Barak Tank: Modernizing Israel’s Armored Corps for the Future",
    "url": "https://www.cryptopolitan.com/the-barak-tank-modernizing-israels-armored/",
    "description": "The Israeli Ministry of Defense has officially introduced a cutting-edge main battle tank known as the &#8220;Barak.&#8221; This advanced armored vehicle represents the fifth generation of the renowned Merkava battle tank, a staple in the arsenal of the Israeli Defense Forces (IDF). In development for over five years, the Barak tank boasts artificial intelligence (AI) ... <a title=\"The Barak Tank: Modernizing Israel&#8217;s Armored Corps for the Future\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-barak-tank-modernizing-israels-armored/\" aria-label=\"More on The Barak Tank: Modernizing Israel&#8217;s Armored Corps for the Future\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-20T13:37:44.000Z",
    "title": "Crypto Analyst Forecasts Over 20% Gain for Chainlink (LINK) and Updates Dogecoin (DOGE) Projections",
    "url": "https://www.crypto-news-flash.com/crypto-analyst-forecasts-over-20-gain-for-chainlink-link-and-updates-dogecoin-doge-projections/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-analyst-forecasts-over-20-gain-for-chainlink-link-and-updates-dogecoin-doge-projections",
    "description": "Chainlink (LINK) shows the recovery, rising by nearly 18% after hitting a low point of $5.76, potentially aiming for a 20.5% increase toward $8.186. Dogecoin (DOGE) maintains stability amid market fluctuations, with the crypto analyst noting DOGE&#8217;s ability to hold the support channel bottom. In the world of cryptocurrency, recent developments have caught the attention [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-20T13:11:42.000Z",
    "title": "Want to Help Make Crypto-Friendly Laws in the US? Here is How",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/want-to-help-make-crypto-friendly-laws-in-the-us-here-is-how/",
    "description": "<p>The use of cryptos has surged in the US. A recent study by Consensys shows that the US is one of the most crypto-aware and active nations. Other studies have shown that one out of six US citizens is either involved with or has been involved with cryptocurrencies. If you live in the US, there [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/want-to-help-make-crypto-friendly-laws-in-the-us-here-is-how/\">Want to Help Make Crypto-Friendly Laws in the US? Here is How</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-20T13:28:47.000Z",
    "title": "ETH Holdings Shrink, Leaving the Altcoin at the Mercy of Bears",
    "url": "https://coinedition.com/eth-holdings-shrink-leaving-the-altcoin-at-the-mercy-of-bears/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Holding-100-ETH-Low.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Holding 100+ ETH Low\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Holding-100-ETH-Low.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Holding-100-ETH-Low-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Holding-100-ETH-Low-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Holding-100-ETH-Low-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Holding-100-ETH-Low-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Holding-100-ETH-Low-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>On-chain analytic platform Glassnode shared that the number of addresses holding 1,000 Ethereum (ETH) coins hit a 5-year low. According to the disclosure, the decrease caused the number of addresses with such an amount in their portfolio to fall to 6,082. A simple interpretation of the data means that some long-term holders of ETH have [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/eth-holdings-shrink-leaving-the-altcoin-at-the-mercy-of-bears/\">ETH Holdings Shrink, Leaving the Altcoin at the Mercy of Bears</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]