[
  {
    "source": "CoinDesk",
    "date": "2023-12-19T00:15:11.000Z",
    "title": "Small ESG-Focused Crypto Asset Manager Is Another Late Entrant to Bitcoin ETF Race",
    "url": "https://www.coindesk.com/business/2023/12/19/small-esg-focused-crypto-asset-manager-is-another-late-entrant-to-bitcoin-etf-race/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A small ESG-focused crypto asset manager, 7RCC, is the latest applicant to join the race for a spot-bitcoin exchange traded fund (ETF), a filing with the Securities and Exchange Commission (SEC) shows."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-19T00:15:21.000Z",
    "title": "Crypto Tax Planning: Merging Tax-Loss Harvesting With Charitable Giving",
    "url": "https://news.bitcoin.com/crypto-tax-planning-merging-tax-loss-harvesting-with-charitable-giving/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/tax-loss_harvesting-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto Tax Planning: Merging Tax-Loss Harvesting With Charitable Giving\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/tax-loss_harvesting-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/tax-loss_harvesting-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/tax-loss_harvesting-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/tax-loss_harvesting-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/tax-loss_harvesting-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/tax-loss_harvesting-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/tax-loss_harvesting.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />As the year winds down, cryptocurrency investors can combine tax-loss harvesting with cryptocurrency donations to charities, a move that optimizes tax benefits while supporting worthy causes. Embrace Year-End Tax Strategy With Charitable Giving Twist As the end of the year rapidly approaches, crypto investors are not only focusing on tax-loss harvesting but also exploring the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-19T00:30:08.000Z",
    "title": "Solana-Based Aurory Suffers Devastating Exploit: 80% Of Liquidity Gone",
    "url": "https://www.newsbtc.com/news/solana-based-aurory-suffers-devastating-exploit-80-of-liquidity-gone/",
    "description": "Aurory (AURY), a blockchain-based tactical Japanese role-playing game built on Solana (SOL), recently experienced a significant liquidity loss in its Camelot&#8217;s AURY-USDC pool.  The incident occurred due to a hack on the SyncSpace bridge, which resulted in the unauthorized withdrawal and subsequent market sale of approximately 600,000 AURY tokens on the Arbitrum (ARB) network.  Aurory SyncSpace Bridge Hacked In an official statement released on December 17, Aurory&#8217;s team disclosed the details of the incident. The team detected unusual activity on their marketplace and promptly initiated an investigation, which revealed that a malicious actor had exploited the marketplace&#8217;s buy endpoint.  Related Reading: Solana Threatens To Unseat Ethereum In Trade Volume With $1 Billion In Single Day This exploit allowed the attacker to inflate their AURY balance in SyncSpace, enabling them to withdraw around 600,000 tokens to the Arbitrum network. The attacker then liquidated the stolen amount by selling it in the market. To protect user funds, SyncSpace was promptly disabled for maintenance, temporarily suspending deposits and withdrawals. Importantly, the statement assured that no user funds or non-fungible tokens (NFTs) were lost or at risk during the incident.  The AURY tokens originated from a team wallet, facilitating withdrawals for accounts not previously deposited AURY. Exploit Mitigated The Aurory statement emphasized that the exploit is no longer ongoing, as SyncSpace remains offline for maintenance. As a result, there is currently no risk of further exploits. Additionally, it was confirmed that the attacker has exhausted their AURY supply and no longer possesses any tokens to sell. Moreover, SyncSpace will investigate further to determine how the exploit went undetected despite the previous expert audit.  The team also plans to release a comprehensive post-mortem report once the necessary fixes have been implemented and the investigation concludes. They expect SyncSpace to be back online in the coming days. Related Reading: VanEck CEO Predicts When The Bitcoin Price Will Reach $69,000 Again Since October 30, the price of Aurory&#8217;s token, AURY, has experienced a significant upward trend, culminating in a yearly high of $1.9008 on December 12. However, following the recent exploit, the price of AURY has retraced to $1.0868, marking a decline of 23.5% over the past 24 hours and 36.5% over the past seven days.  Despite this setback, AURY still boasts substantial gains of 74% and 70% over the 30-day and one-year periods, respectively. The market now awaits to see whether the token&#8217;s support lines at $0.9681 and $0.9086 will be able to halt the potential continuation of the price drop or if they will succumb to the prevailing downtrend, putting a significant portion of its 2023 gains at risk. Featured image from Shutterstock, chart from TradingView.com"
  }
]