[
  {
    "source": "Cointelegraph",
    "date": "2023-10-20T12:24:00.000Z",
    "title": "Bitcoin price shrugs off bears, but mining stocks take a beating: Report",
    "url": "https://cointelegraph.com/news/bitcoin-price-shrugs-bears-mining-stocks-take-beating",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/a9acd7e1-56d1-4393-afb0-4b860d6b0d59.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto mining sector is becoming increasingly competitive, as hash rate shows no sign of slowing down and Bitmain releases a new rig. </p>\n                    <p><p>Until Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) breaks its long-established $25-30k trading range, the crypto market is arguably in what some analysts have called a “crab market”. It is likely that a decisive macroeconomic or crypto-specific catalyst will be necessary to break out of it. This failed to occur in the month of September. </p><p>BTC price briefly tested the lower end of the established trading range and touched $25,200. In the second half of the month, however, the price recovered to $26,900 and posted a monthly close of +3.92%. This both bucked the historical trend of negative closes in September and went against traditional markets. The S&amp;P 500 was down 5.4% over the same time frame. </p><p>However, Bitcoin’s relative resilience did not stabilize the industry as a whole. Crypto stocks were hit with an even bigger correction than the S&amp;P, and altcoins continued their <a href=\"https://cointelegraph.com/news/ethereum-bitcoin-15-months-eth-price-reverse\">month-long losing streak against BTC</a>. As every month, the Cointelegraph Research Monthly Trends report provides an overview of industry-wide developments. It is an invaluable resource, especially in bear market conditions when many of the less mature sectors of the industry drop out of the news headlines. </p><p class=\"post-content__accent post-content__accent_small\"><a href=\"https://research.cointelegraph.com/reports/investor-insights-september-2023\"><em>The report is available for Pro subscribers on the Cointelegraph Research Terminal.</em></a></p><h2>Major mining companies down 30%</h2><p>Most publicly traded crypto companies faced a challenging month in September and their stocks underperformed. In many cases, share prices dropped by 10%–40% and the sector averaged a decline of 22.4%. Especially the crypto mining stocks were hit hard. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/fc9c72cd-8904-4be8-9949-5eec7fe03623.png\"  /></figure><p>TeraWulf, Marathon Digital and Iris Energy Limited all lost almost one-third of their valuation. The miners affected by these large corrections had rallied massively in the first half of the year, sometimes gaining +300%. However, share prices started to decline in July and have now mostly erased these previous gains. Some of the reasons for this correction are specific to the mining sector and are unlikely to affect crypto more widely.</p><h2>Bitmain releases new Antminer iteration</h2><p>The large corrections in the stocks of the mining stocks can, among other things, be attributed to a tightening of mining economics. In April of next year, the next Bitcoin halving event will occur, which will slash rewards for validating votes in half overnight. Despite this outlook, network hashrate and difficulty show no signs of slowing down and keep hitting all-time highs. </p><p>The result is that Bitcoin mining is becoming increasingly competitive by the day and profit margins are becoming slimmer. Once mining companies exhaust their ability to raise new capital, they could be financially squeezed after the halving unless Bitcoin puts in a significant rally.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/cd4e3280-0931-4bb6-8726-d7deee5d4b58.png\"  /></figure><p>In September, Bitmain, the largest producer of ASIC mining hardware, announced a new model of Antminer rigs that will intensify this competition further in the coming months. The new S21 rigs will have a mining efficiency of 17.5 J/TH — a more than 20% increase compared to the previous front-runner. Miners who manage to raise the capital for an upgrade quickly will be able to price out their competition once the effects of the halving kick in.</p><h2>The Cointelegraph Research team</h2><p>Cointelegraph’s Research department comprises some of the best talents in the blockchain industry. Bringing together academic rigor and filtered through practical, hard-won experience, the researchers on the team are committed to providing the most accurate, insightful content available on the market.</p><p>With decades of combined experience in traditional finance, business, engineering, technology and research, the <a href=\"https://research.cointelegraph.com/\">Cointelegraph Research team</a> is perfectly positioned to put its combined talents to proper use with the latest Investor Insights Report. </p><p><em>The opinions expressed in this article are for general informational purposes only and are not intended to provide specific advice or recommendations for any individual or on any specific security or investment product.</em></p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-20T12:13:45.000Z",
    "title": "Chamber of Digital Commerce opposes SEC’s overreach in Binance lawsuit",
    "url": "https://cointelegraph.com/news/chamber-digital-commerce-opposes-sec-overreach-binance-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/0aad1c69-42e8-488b-afa8-7f916070211c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>United States-based advocacy group, the Chamber of Digital Commerce, claims the SEC employs the enforcement-based method to classify digital assets as securities and impose penalties on cryptocurrency businesses.</p>\n                    <p><p>The United States-based Chamber of Digital Commerce has aligned with various digital assets firms, associations, legal experts and legislators in a collective effort to challenge the <a href=\"https://cointelegraph.com/news/binance-and-cz-sued-by-the-sec\">U.S. Securities and Exchange Commission (SEC) vs. Binance</a> lawsuit.</p><p>Through a recently <a href=\"https://digitalchamber.wpenginepowered.com/wp-content/uploads/2023/10/Chamber-Amicus-Brief-BinanceUS.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> amicus brief, the blockchain trade association seeks to thwart the SEC’s endeavor to oversee the cryptocurrency sector without explicit authorization from the U.S. Congress, halting the SEC’s method of regulation through enforcement.</p><p>Cody Carbone, vice president of policy at the Chamber of Digital Commerce, <a href=\"https://twitter.com/CodyCarboneDC/status/1715143891819610496\" target=\"_blank\" rel=\"noopener nofollow\">stated</a>:</p><blockquote>“The SEC continues to try to regulate the entire digital asset ecosystem through enforcement actions, instead of issuing guidance or going through the proper notice and comment rulemaking channels. The enforcement actions are paralyzing the market and sending digital asset innovation overseas.”</blockquote><p>The Chamber of Digital Commerce asserts that the SEC employs the enforcement-based method to classify digital assets as securities and impose penalties on cryptocurrency businesses. This approach not only hampers innovation but also compels crypto companies to relocate abroad.</p><p>Furthermore, the Chamber states, the SEC lacks the congressional authority to oversee all digital assets as securities. While legislative bodies endeavor to establish a regulatory framework, the SEC's actions pose risks to the industry and its stakeholders, it wrote.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/109d8a43-7ce4-4aa0-ada0-30db7ce253b2.JPG\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of the amicus brief.        Source: Chamber of commerce</em></figcaption></figure><p>The Chamber of Digital Commerce appealed to the court for the dismissal of the lawsuit based on various claims, such as the SEC exceeding its jurisdiction, digital assets not constituting investment contracts and token transactions not meeting the criteria for Exchange Act registration requirements.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/chamber-digital-commerce-launches-bitcoindigital-power-network-miners-coalition\"><strong><em>Chamber of Digital Commerce launches Digital Power Network miners’ coalition</em></strong></a></p><p>Binance.US, along with Binance Holdings and CEO CZ, <a href=\"https://cointelegraph.com/news/binance-ceo-chanpgeng-zhao-asks-court-dismiss-sec-lawsuit\">submitted a motion to dismiss the lawsuit,</a> asserting that the SEC has exceeded its jurisdiction. Binance.US has also criticized the SEC's recent document discovery and deposition requests as \"unreasonable.\"</p><p>BAM Management US Holdings and BAM Trading Services (Binance.US) have requested permission to <a href=\"https://cointelegraph.com/news/binance-calls-sec-court-requests-unreasonable-new-filing\">submit confidential documents</a>. While the specifics are kept confidential, it appears that Binance.US is sharing certain documents with the SEC.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-20T12:15:44.000Z",
    "title": "Binance withdrawals spike to $1.4B in 24 hours amid continued executive departure and regulatory struggles",
    "url": "https://cryptoslate.com/binance-withdrawals-spikes-to-1-4b-in-24-hours-amid-continued-executive-departure-and-regulatory-struggles/",
    "description": "<p>Binance, the largest crypto exchange by trading volume, has endured more than $1 billion of net outflows in the past 24 hours, according to DeFillama CEX&#8217;s transparency dashboard. The outflows are coming on the heels of the exit of another top executive from the crypto trading firm. According to DeFillama&#8217;s data, Binance endured $1.4 billion [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-withdrawals-spikes-to-1-4b-in-24-hours-amid-continued-executive-departure-and-regulatory-struggles/\">Binance withdrawals spike to $1.4B in 24 hours amid continued executive departure and regulatory struggles</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-20T12:10:11.000Z",
    "title": "Bitcoin Back Above $30K for First Time Since July 23, Comes 50 Days After Former SEC Chair Said a Bitcoin Spot ETF Is ‘Inevitable’",
    "url": "https://www.cryptoglobe.com/latest/2023/10/bitcoin-back-above-30k-for-first-time-since-july-23-comes-50-days-after-former-sec-chair-said-a-bitcoin-spot-etf-is-inevitable/",
    "description": "During an interview with CNBC’s “Squawk Box” on September 1, former SEC Chair Jay Clayton acknowledged that regulating crypto is a challenging task. He pointed out that when crypto first entered retail markets, many people used it to develop products that were not compliant with U.S. securities laws and that the SEC had to intervene […]\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-20T12:33:18.000Z",
    "title": "Polygon’s Governance Evolution: Meet the Protocol Council Shaping the Future",
    "url": "https://www.crypto-news-flash.com/polygons-governance-evolution-meet-the-protocol-council-shaping-the-future/?utm_source=rss&utm_medium=rss&utm_campaign=polygons-governance-evolution-meet-the-protocol-council-shaping-the-future",
    "description": "<img width=\"960\" height=\"540\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg.jpg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg-768x432.jpg 768w\" sizes=\"(max-width: 960px) 100vw, 960px\" />Polygon has unveiled a protocol council that will help define a framework of decentralized, community-led governance for existing and future Polygon protocols. Polygon continues to make adjustments and upgrades that will lead to the full realization of Polygon 2.0. Polygon Labs, the growth and development team behind the Polygon blockchain, has announced the creation of a [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-20T12:14:00.000Z",
    "title": "ALGO’s Dip Nears End: Oversold Indicators Signal Potential Rebound",
    "url": "https://coinedition.com/algos-dip-nears-end-oversold-indicators-signal-potential-rebound/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Why Is There Inconsistency in ALGO’s Market Cap Calculations\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Why-Is-There-Inconsistency-in-ALGOs-Market-Cap-Calculations-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A bearish trend has dominated the Algorand (ALGO) market in the previous seven days after bulls failed to break above the intra-week high of $0.096183. Consequently, bearish sentiment has prevailed, with the price falling to a 30-day low of $0.08881. Profit-taking by investors intending to profit from the prior bullish run has exacerbated the current [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/algos-dip-nears-end-oversold-indicators-signal-potential-rebound/\">ALGO&#8217;s Dip Nears End: Oversold Indicators Signal Potential Rebound</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]