[
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T15:49:28.000Z",
    "title": "NYDFS calls for public feedback on proposed crypto regulatory guidance",
    "url": "https://cointelegraph.com/news/nydfs-calls-public-feedback-proposed-crypto-regulatory-guidance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/f343bc70-04ce-438b-bd3d-b3d74fe2b221.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The proposals included stricter standards on risk assessments for crypto firms as well as a framework for designating token projects to the NYDFS' greenlist</p>\n                    <p><p>The New York State Department of Financial Services, or NYDFS, has called on the public to provide feedback to a proposal aiming to strengthen regulatory requirements for crypto firms operating in the state.</p><p>In a Sept. 18 notice, the NYDFS <a href=\"https://www.dfs.ny.gov/reports_and_publications/press_releases/pr202309181\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Superintendent Adrienne Harris had released proposals on guidance for “enhanced criteria for coin-listing and delisting procedures” in addition to a framework \"for designating coins or tokens” to the regulator’s greenlist. The proposal included recommendations for heightened standards focusing on illicit finance, legal, reputational, market and liquidity, and regulatory risks. </p><p>“Since joining DFS, I have made it a priority to ensure the Department’s regulatory and operational capabilities keep pace with industry developments to protect consumers and markets,” said Harris. “In less than two years, we’ve built our team to over sixty experienced professionals, created and enhanced consumer and industry safeguards, and engaged with policymakers around the world.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">NEW: Superintendent Harris Announces Update on Two-Year Transformational Initiative to Strengthen NYDFS’ Nation Leading <a href=\"https://twitter.com/hashtag/VirtualCurrency?src=hash&amp;ref_src=twsrc%5Etfw\">#VirtualCurrency</a> Oversight. <br><br>More: <a href=\"https://t.co/llh9K3dM13\">https://t.co/llh9K3dM13</a> <a href=\"https://t.co/nOJvfuel00\">pic.twitter.com/nOJvfuel00</a></p>&mdash; NYDFS (@NYDFS) <a href=\"https://twitter.com/NYDFS/status/1703766505026994448?ref_src=twsrc%5Etfw\">September 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/new-york-residents-own-cryptocurrency-coinbase-report\"><strong><em>19% of New Yorkers own cryptocurrency: Coinbase report</em></strong></a></p><p>At the time of publication, the NYDFS greenlist for tokens included Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), and several stablecoins issued by Gemini and PayPal. The announcement also <a href=\"https://cointelegraph.com/news/nydfs-adopts-regulation-to-assess-supervisory-costs-for-licensed-crypto-firms\">followed the adoption of rules</a> allowing the NYDFS to assess supervisory costs from licensed crypto firms operating in New York. </p><p>Since 2015, crypto firms operating in New York have largely been required to apply for a BitLicense through the NYDFS. The regulator’s list <a href=\"https://www.dfs.ny.gov/virtual_currency_businesses\" target=\"_blank\" rel=\"noopener nofollow\">showed</a> trading platform eToro was the most recent to receive a license in February, making more than 30 firms licensed in the state. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-city-guide-to-new-york/\"><strong><em>Crypto City: Guide to New York</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-18T16:00:30.000Z",
    "title": "Toncoin – A web3 ecosystem for Telegram",
    "url": "https://cryptoslate.com/project-reports/toncoin-a-web3-ecosystem-for-telegram/",
    "description": "<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/project-reports/toncoin-a-web3-ecosystem-for-telegram/\">Toncoin &#8211; A web3 ecosystem for Telegram</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-18T15:57:36.000Z",
    "title": "Bitget's Inaugural EmpowerX Summit: Igniting Future of Web3 and Crypto with 1900 Attendees",
    "url": "https://cryptodaily.co.uk/2023/09/bitgets-inaugural-empowerx-summit-igniting-future-of-web3-and-crypto-with-1900-attendees",
    "description": "Bitget proudly hosted its inaugural flagship event, EmpowerX Summit, in Singapore on September 12, 2023."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T15:54:15.000Z",
    "title": "Kazakhstan forms new agency to oversee its CBDC implementation",
    "url": "https://www.cryptopolitan.com/kazakhstan-agency-oversee-cbdc/",
    "description": "The National Bank of the Republic of Kazakhstan (NBK) has taken significant steps toward the development and implementation of its central bank digital currency (CBDC), known as the digital tenge. In an official statement released on September 15th, the NBK announced the establishment of a new entity called the National Payment Corporation (NPC), which will ... <a title=\"Kazakhstan forms new agency to oversee its CBDC implementation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kazakhstan-agency-oversee-cbdc/\" aria-label=\"More on Kazakhstan forms new agency to oversee its CBDC implementation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T15:45:12.000Z",
    "title": "SkyBridge Capital CEO leads bidding for SVB Capital",
    "url": "https://www.cryptopolitan.com/skybridge-capital-ceo-leads-bidding-for-svb/",
    "description": "Silicon Valley Bank’s venture capital arm, SVB Capital, is attracting attention from prominent asset management firms as the sale of the institution approaches. SVB Financial Group, the former parent company of Silicon Valley Bank, is moving closer to finalizing a deal to divest SVB Capital. Among the leading bidders in this pivotal transaction are Anthony ... <a title=\"SkyBridge Capital CEO leads bidding for SVB Capital\" class=\"read-more\" href=\"https://www.cryptopolitan.com/skybridge-capital-ceo-leads-bidding-for-svb/\" aria-label=\"More on SkyBridge Capital CEO leads bidding for SVB Capital\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-18T16:01:03.000Z",
    "title": "Chainlink slips despite oracle adoption, InQubeta offers an alternative",
    "url": "https://crypto.news/chainlink-slips-despite-oracle-adoption-inqubeta-offers-an-alternative/",
    "description": "Amid ongoing market challenges Chainlink (LINK) face, InQubeta aims to provide a transparent alternative in crowdfunding. QUBE presale is ongoing"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-18T15:52:27.000Z",
    "title": "Crypto wallet market to grow by $686m by 2026: report",
    "url": "https://crypto.news/crypto-wallet-market-to-grow-by-686m-by-2026-report/",
    "description": "The market research firm Technavio&#8217;s new report shows that the crypto wallet market will grow by $686 million by 2026. The report is called &#8220;Crypto Wallet Market by Product and Geography &#8211; Forecast and Analysis 2022-2026.&#8221; Technavio estimates that the&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-18T15:41:55.000Z",
    "title": "Tether launches testing phase for Bitcoin mining platform",
    "url": "https://crypto.news/tether-launches-testing-phase-for-bitcoin-mining-platform/",
    "description": "Paolo Ardoino, chief technology officer of Tether, announced the launch of the testing phase for Moria, the company&#8217;s Bitcoin mining platform. In a posting on X (formerly Twitter), Ardoino declared the platform has achieved a significant milestone during this phase&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-18T16:00:29.000Z",
    "title": "Coinbase’s BASE Shows Teeth As TVL Nears Solana",
    "url": "https://www.newsbtc.com/news/defi/coinbase-base-tvl-solana/",
    "description": "Ethereum-based Layer 2 network &#8220;Base&#8221; has put on an impressive performance yet again, with its Total Value Locked (TVL) coming close to one of the most notable blockchains. Coinbase&#8217;s BASE Has Outperformed Solana Coinbase&#8217;s layer 2 blockchain network, Base, has seen an upward trajectory movement since it was introduced to the public, outperforming some of the notable blockchains in the crypto market. The network is now drawing close to Solana in terms of TVL, indicating remarkable growth within the network. Related Reading: Ethereum Holesky Testnet Already Seeing Issues, What’s Wrong This Time? Data from DeFiLlama shows that the blockchain network now sits a little above $407 million in TVL, while Solana sits a little above $650 million in TVL. The uptick in Base&#8217;s TVL is due to the significant number of users and developers currently settling on Base for their decentralized applications (dApps) and other financial protocols.  BASE TVL crosses $400 million &#124; Source: DeFiLlama The blockchain network also managed to surpass Solana in terms of transaction volume and number of unique addresses. In the past two months, the blockchain network has experienced an immense increase in transaction volume and number of unique addresses more than that of Solana. Data from IntoTheBlock shows an impressive increase of 1.88 million daily transactions on September 16, 2023. Base&#8217;s immense increase in transaction volume and number of unique addresses can be traced back to the growing user base of Base’s Friend.tech, a social platform that allows users to buy and sell shares in public figures. &#8220;In just 2 months, Coinbase&#8217;s Base L2 has skyrocketed, topping the charts in transactions and unique addresses. Much of this growth is fueled by the new social app, FriendTech,&#8221; IntoTheBlock stated on X. Base operates as a layer 2 network on Ethereum that came about due to the combined effort from Coinbase and Optimism. Incubated by Coinbase, Base was created to provide its users with a faster transaction process, improved scalability, and lower gas fees. Currently, Base surpassing Solana in transaction volume, and the number of unique addresses is one of the most impressive achievements of the blockchain network, due to Solana being one of the most notable blockchains in the crypto ecosystem known for its speed and scalability. During the first week of its mainnet launch, the blockchain network also surpassed Cardano in terms of TVL, transaction speed, and number of successful transactions. The blockchain saw more successful transactions in one week than Cardano&#8217;s successful transactions in one month. SOL price tops $19.8 &#124; Source: SOLUSD on Tradingview.com Social App Friend.tech Attributed To Base&#8217;s Achievements You can&#8217;t rule out Friend.tech when talking about Base&#8217;s achievement in the crypto market. The social app is well-known among users and investors and has become an eminent topic of discussion in the community. Related Reading: Jordan Peterson Sparks Debate On How Bitcoin Can Solve Major Banking Problem During its official launch on August 10, 2023, the invite-only social app recorded over 4,400 ETH ($8.1 million) in trading volume in just 24 hours after its launch. The social app has also reportedly accumulated more than 130,000 daily users since its release. Base also saw a surge in Transactions Per Second (TPS) as more investors engaged in the social app. Featured image from Tapchibitcoin, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T16:00:34.000Z",
    "title": "Bitcoin Spark vs Bitcoin: The New Age of Cryptocurrency Investment",
    "url": "https://www.crypto-news-flash.com/bitcoin-spark-vs-bitcoin-the-new-age-of-cryptocurrency-investment/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-spark-vs-bitcoin-the-new-age-of-cryptocurrency-investment",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-76.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-76.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-76-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-76-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As digital assets evolve, the emergence of new cryptocurrencies with top-notch technology challenges the prominence of established players. Making waves in the crypto landscape is Bitcoin Spark (BTCS), a Bitcoin fork addressing scalability, speed, fair reward distribution, and mining accessibility. Bitcoin Spark (BTCS) Bitcoin Spark is an advanced project addressing issues in the Bitcoin ecosystem [...]"
  }
]