[
  {
    "source": "Decrypt",
    "date": "2023-08-03T17:24:05.000Z",
    "title": "New York Times Pushes Back Against Sam Bankman-Fried Gag Order",
    "url": "https://decrypt.co/151169/nyt-pushes-back-against-sam-bankman-fried-gag-order",
    "description": "The Gray Lady’s letter follows a report that landed Bankman-Fried back in court."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-03T17:27:36.000Z",
    "title": "Unibot maintains first mover status among Telegram crypto trading bots",
    "url": "https://cointelegraph.com/news/unibot-maintains-first-mover-status-among-telegram-crypto-trading-bots",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/6be1a0b0-db25-4dfb-9e1d-6ae38bd15171.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Unibot price could be over-extended, but notable user base growth and real yields paid to token holders are a reflection of the project’s strong fundamentals.</p>\n                    <p><p>Unibot (UNIBOT) token was among the top crypto gainers in July as its price rallied by 400% in a month to reach an all-time high of $199.90 on July 28. The project defied the market’s negative trend as both Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) dropped by nearly 4%.</p><p>However, by August 3, 2023, the token's price retraced 44% from its peak, leading to doubts about whether this surge was merely a fleeting trend. Nevertheless, it is essential to consider the project's fundamentals, which seem to suggest otherwise.</p><p>The project is a harbinger of a newfound bullish narrative around decentralized Telegram bots for trading on DEXs. The total market capitalization of the sector surged above $150 million from around $20 million at the start of July, per Coingecko.</p><p>While a number of copycats have launched in the market, Unibot has a dominant market share, with 72.3% of the total market for decentralized Telegram bots for trading on DEXs. Since May 2023, Unibot has gained popularity with increased usage and price. </p><p>It provides features such as limit orders, MEV protection and snipping. Snipping enables instant purchase of newly listed token pools on Uniswap, which is preferred among high-frequency traders.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Sniping LPs &amp; reading the chain used to give a huge edge for short-term trading<br><br>Now that we have tools like <a href=\"https://twitter.com/search?q=%24UNIBOT&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$UNIBOT</a>, that edge is fading<br><br>What&#39;s the edge now?</p>&mdash; 0xPajke (@0xPajke) <a href=\"https://twitter.com/0xPajke/status/1683999530939817984?ref_src=twsrc%5Etfw\">July 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Unibot has become popular among sophisticated <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">DeFi</a> users, reflected in its increased usage. The token has a low PE ratio compared to other DeFi protocols, providing fundamental strength to its price despite the astronomical price surge.</p><h2>Telegram bots trading could be a lucrative DeFi niche </h2><p>Although Unibot's design may not be revolutionary or feature any technological breakthroughs, the Telegram bot offers a superior trading experience on Uniswap, making it increasingly popular among traders.</p><p>Unibot’s trading volumes nearly tripled in July, reaching a high of $7.63 million on July 23, per a Dune <a href=\"https://dune.com/whale_hunter/unibot-revenue\" target=\"_blank\" rel=\"noopener nofollow\">dashboard</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/6adff2cb-d8b8-445a-8174-420532e45955.JPG\"  /><figcaption style=\"text-align: center;\"><em>Uniswap bot trading volumes. Source: </em><a href=\"https://dune.com/whale_hunter/unibot-revenue\" target=\"_blank\" rel=\"noopener nofollow\"><em>Dune</em></a></figcaption></figure><p>The cumulative user base of Unibot crossed 7,000 unique wallets as the bot’s usage continued to grow. </p><p>Unibot developing team has also <a href=\"https://twitter.com/TeamUnibot/status/1682134433250557952\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> a new iteration of the bot on July 21, Unibot X, which comes with mobile compatibility, a better user interface, and advanced features.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/217a585e-3314-4f41-b898-b3a094f0c04c.JPG\"  /><figcaption style=\"text-align: center;\"><em>The number of unique users interacting with Unibot. Source: Dune</em></figcaption></figure><p>On top of that, its tokenomics project has strong yields for token holders due to its revenue-sharing model with a fixed supply of tokens. A fixed supply eliminates dilution risks in the token from investor or private sale tokens.</p><p>The UNIBOT token is actually a governance token that receives 40% of the bot's revenue in trading fees and access exclusive features. </p><p>Currently, it projects an annual yield of 49.1% and has a profit-to-earning (PE) ratio (the ratio of the token's fully diluted market capitalization and annualized earnings) is 2.91. A lower PE ratio means higher earnings relative to market price.</p><p>UNIBOT’s PE ratio is more favorable than most DeFi tokens which have a PE ratio of 20 or higher. For instance, <a href=\"https://cointelegraph.com/news/3-reasons-why-maker-mkr-hint-at-further-price-upside\">MakerDAO</a> (<a href=\"https://cointelegraph.com/maker-price-index\">MKR</a>) has a PE ratio of 20, while GMX, a leading real-yield platform, gives a PE ratio of 35.85 per Token Terminal <a href=\"https://tokenterminal.com/terminal/projects/gmx\" target=\"_blank\" rel=\"noopener nofollow\">data</a><em>.</em></p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/telegram-wallet-bot-enables-in-app-payments-in-bitcoin-usdt-and-ton\"><strong><em>Telegram Wallet bot enables in-app payments in Bitcoin, USDT and TON</em></strong></a></p><p>However, the project entails smart contract risks, as multiple contracts interact with Uniswap to execute trades via Telegram, increasing the attack vector for hackers.</p><p>The Unibot and other Telegram bots store the private keys of its user wallets, which may become vulnerable to theft.</p><h2>UNIBOT market analysis </h2><p>After reaching a peak value of $199.80 on July 28, UNIBOT's price dropped by over 30% in a week, likely due to early buyers rushing to take profit and some FOMO buyers panic selling.</p><p>Nevertheless, given that strong fundamentals back the token, so far, the uptrend doesn’t seem like a <a href=\"https://cointelegraph.com/news/how-to-identify-and-avoid-a-crypto-pump-and-dump-scheme\">pump-and-dump</a> scheme.</p><p>Nansen’s analysis shows that the UNIBOT token has a “diversified token ownership, long-term holders are taking some profits and smart money is growing.” </p><p>The on-chain analytics firm <a href=\"https://twitter.com/nansen_ai/status/1684893161603338240\" target=\"_blank\" rel=\"noopener nofollow\">tweeted</a> that “19 smart money addresses own more than 50 Unibot,” which represents their interest in revenue sharing. Smart money wallets represent prolific and highly profitable traders.</p><p>Exchanges like Huobi, Gate and Bitget also hold significant amounts of UNIBOT tokens. Nansen’s tweet also reported that on-chain movements show one “address funded by Binance, which has been buying relatively small amounts of UNIBOT consistently,” which could allude to listing on Binance.</p><p>The UNIBOT has rebounded from support around the July low of $100.86. If the buyers continue to build support above this level, UNIBOT’s positive rally could continue as usage increases.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/ca25bed0-0d35-48ab-9722-3859723adbed.JPG\"  /><figcaption style=\"text-align: center;\"><em>UNIBOT price action. Source: CoinGecko</em></figcaption></figure><p>While Unibot’s fundamentals and on-chain distribution of the token look promising, the project faces </p><p>Nevertheless, if the worst doesn’t happen, Unibot’s utility and real yield from the UNIBOT token will likely continue to push its price higher.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-03T17:36:56.000Z",
    "title": "Ilya Lichtenstein admits to 2016 Bitfinex hack while entering guilty plea to money laundering charges",
    "url": "https://cryptoslate.com/ilya-lichtenstein-admits-to-2016-bitfinex-hack-while-entering-guilty-plea-to-money-laundering-charges/",
    "description": "<p>A New York man, Ilya “Dutch” Lichtenstein, has admitted to the 2016 Bitfinex hack while entering his guilty plea to charges of money laundering associated with the hack. His confession on Thursday has shed light on a $4.5 billion cyber heist that remained anonymous until now. Lichtenstein&#8217;s plea hearing took place in Washington, D.C., federal [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ilya-lichtenstein-admits-to-2016-bitfinex-hack-while-entering-guilty-plea-to-money-laundering-charges/\">Ilya Lichtenstein admits to 2016 Bitfinex hack while entering guilty plea to money laundering charges</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-03T17:30:40.000Z",
    "title": "Saudi Arabia Extends Oil Production Cuts, Further Irking US Officials ",
    "url": "https://news.bitcoin.com/saudi-arabia-extends-oil-production-cuts-further-irking-us-officials/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sa-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sa-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sa-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sa-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sa-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sa-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sa-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sa.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Saudi Arabia announced it will continue limiting oil production through September, extending output reductions that have drawn criticism from Washington. Riyadh Holds Firm on Oil Output Limits Saudi Arabia said Thursday it will keep oil production nearly one million barrels per day below its quota for another month, according to a statement from the Saudi [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T17:38:11.000Z",
    "title": "BRICS finally abandons USD for global trade settlement",
    "url": "https://www.cryptopolitan.com/brics-abandons-usd-global-trade-settlement/",
    "description": "The line has been drawn in the sand, and BRICS nations have made a stand that could shake the global financial landscape. The alliance of Brazil, Russia, India, China, and South Africa (BRICS) is putting forth an initiative to abandon the U.S. dollar for global trade, opting instead to strengthen their local economies through cross-border ... <a title=\"BRICS finally abandons USD for global trade settlement\" class=\"read-more\" href=\"https://www.cryptopolitan.com/brics-abandons-usd-global-trade-settlement/\" aria-label=\"More on BRICS finally abandons USD for global trade settlement\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-03T17:37:00.000Z",
    "title": "As Filecoin (FIL) Loses Investors, Borroe ($ROE) Presale Captures the Spotlight",
    "url": "https://nulltx.com/as-filecoin-fil-loses-investors-borroe-roe-presale-captures-the-spotlight/",
    "description": "The cryptocurrency market is a dynamic and ever-changing landscape, with investors constantly seeking the next big opportunity. Recently, Filecoin (FIL), a once-promising crypto coin, has faced challenges that led to a loss of investor confidence. However, in the midst of this, a new player has emerged and captured the market spotlight &#8211; Borroe ($ROE). The [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-08-03T17:15:57.000Z",
    "title": "Buy These Gaming Related Coins Stepn, the Sandbox and Pomerdoge",
    "url": "https://nulltx.com/buy-these-gaming-related-coins-stepn-the-sandbox-and-pomerdoge/",
    "description": "Gaming-related coins like Stepn (GMT) and The Sandbox (SAND) are gaining significant attention as they offer unique opportunities. But, one project currently in its presale run has also made headlines recently &#8211; Pomerdoge (POMD). Discover why these coins are poised to reshape the gaming landscape and why you should invest in them. Click Here To [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-08-03T17:12:40.000Z",
    "title": "Neo and The Sandbox See Decline, Tradecurve Faces 5,000% Upsurge in 2023, Says Analyst",
    "url": "https://nulltx.com/neo-and-the-sandbox-see-decline-tradecurve-faces-5000-upsurge-in-2023-says-analyst/",
    "description": "The cryptocurrency market is ripe with opportunities and challenges, and a prominent analyst is predicting a contrasting trajectory for Tradecurve compared to Neo and The Sandbox. While the latter face bearish market dynamics, Tradecurve, currently in its presale phase, is projected to experience a staggering 5,000% upsurge in 2023. &#62;&#62;Register For The Tradecurve Presale&#60;&#60; Tradecurve [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-03T17:30:41.000Z",
    "title": "The Rise of a New Leader: This Chainlink (LINK) Contender Prepares to Outshine Aave (AAVE) and Chainlink in 2023",
    "url": "https://www.crypto-news-flash.com/the-rise-of-a-new-leader-this-chainlink-link-contender-prepares-to-outshine-aave-aave-and-chainlink-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=the-rise-of-a-new-leader-this-chainlink-link-contender-prepares-to-outshine-aave-aave-and-chainlink-in-2023",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T105630.061.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T105630.061.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T105630.061-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T105630.061-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />A new contender has risen within blockchain technology, poised to disrupt the status quo and potentially overshadow even the industry giants. InQubeta (QUBE), a rising star in decentralized finance (DeFi) and the challenger to Chainlink (LINK), has gained a spotlight within the crypto market as it prepares to outshine established players like Aave (AAVE) and [...]"
  }
]