[
  {
    "source": "CryptoSlate",
    "date": "2023-08-11T10:00:05.000Z",
    "title": "Deciphering the latest CPI data causing a conundrum for Powell",
    "url": "https://cryptoslate.com/insights/deciphering-the-latest-cpi-data-causing-a-conundrum-for-powell/",
    "description": "<p>Quick Take The most recent U.S. Consumer Price Index (CPI) data unveils a clear reacceleration in headline inflation, marking a first in over a year. As per data from SuperMacro, the &#8216;super-core&#8217; measure &#8211; essentially inflation excluding core services and shelter &#8211; has edged up to 4% from the previous 3.9%. This swell, although marginal, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/deciphering-the-latest-cpi-data-causing-a-conundrum-for-powell/\">Deciphering the latest CPI data causing a conundrum for Powell</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-11T10:00:19.000Z",
    "title": "Huobi battles on amidst FUD allegations",
    "url": "https://cryptodaily.co.uk/2023/08/huobi-battles-on-amidst-fud-allegations",
    "description": "<p>Huobi is doing its best to dispel the arrest and financial stability rumours that have led to a flight of funds.</p>\n<p>Huobi Global, a prominent Asian crypto exchange, has found itself at the centre of some negative speculation recently. Over the past week the exchange has suffered from whispers of employee arrests, potential insolvency, and fraud allegations.</p>\nThe FUD\n<p>The saga first unfolded when a tweet by Wu Blockchain hinted at investigations into several crypto exchange leaders by mainland authorities. At least one other Twitter account reported that multiple Huobi executives were apprehended by mainland police, with some staff even advised to exit the country.</p>\n<p>In a swift response, Huobi refuted the claims. The company's representative made a request to the mentioned websites to rectify the \"misinformation\" and hinted at possible legal actions.</p>\n<p>In a Kitco article on the subject, a message conversation between a spokesperson from Huobi and Adam Cochran of Cinneamhain Ventures was recorded. While the Huobi representative sought to avoid FUD, Cochran replied that his source was verified as a senior Tron executive, and repeated his claim that the spokesperson&rsquo;s &lsquo;colleagues&rsquo; were &ldquo;under criminal investigation&rdquo;.</p>\n<p>Despite these claims, Huobi has remained steadfast, dismissing the insolvency speculations as mere attempts to spread \"fear, uncertainty, and doubt.\"</p>\nThe positives\n<p>In the face of the ongoing turbulence, a Huobi representative confirmed the exchange&rsquo;s intention to pursue a VAT licence, highlighting the recent example of the introduction of a Hong Kong trading app for retail investors.</p>\n<p>A substantial inflow to Huobi in USDT and USDC on August 8 and 9, as per data from Defi llama, was speculated to be from a wallet associated with Justin Sun, and has appeared to bolster investor confidence as Huobi's total locked assets made a notable rise from previous figures.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T10:07:20.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 How much is Bitcoin (BTC) worth? Today, the price of Bitcoin stands at $29,355, with a 24-hour trading volume totalling $38.62 billion. It boasts a market capitalization of $564 billion and commands 48.09% of the cryptocurrency market. Over the past day, Bitcoin’s price experienced a decrease of 0.23%. Currently, there are ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T09:59:52.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T09:52:00.000Z",
    "title": "Binance Labs invests $10 million in Helio Protocol",
    "url": "https://www.cryptopolitan.com/binance-lab-invest-10-million-helio-protocol/",
    "description": "Binance Labs, the venture arm of cryptocurrency exchange Binance, has made a substantial investment of $10 million into Helio Protocol, a move aimed at supporting Helio’s transition into a liquid staking platform. While currently operating on the proof-of-stake network BNB Chain, this funding will enable Helio to extend its presence to other blockchain networks. The ... <a title=\"Binance Labs invests $10 million in Helio Protocol\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-lab-invest-10-million-helio-protocol/\" aria-label=\"More on Binance Labs invests $10 million in Helio Protocol\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T09:40:26.000Z",
    "title": "Post Malone raises concerns over CBDC on the Joe Rogan podcast",
    "url": "https://www.cryptopolitan.com/post-malone-concerns-cbdc-rogan-podcast/",
    "description": "Central Bank Digital Currencies (CBDCs) have sparked discussions across the mainstream landscape, drawing attention from both supporters and skeptics. The recent backlash against CBDCs by United States politicians and prominent public figures like Joe Rogan and Post Malone underscores the growing concerns over the implications of government-backed digital currencies. Post Malone states the potential risk ... <a title=\"Post Malone raises concerns over CBDC on the Joe Rogan podcast\" class=\"read-more\" href=\"https://www.cryptopolitan.com/post-malone-concerns-cbdc-rogan-podcast/\" aria-label=\"More on Post Malone raises concerns over CBDC on the Joe Rogan podcast\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-11T09:46:31.000Z",
    "title": "Reasons why investors are watching Borroe in August 2023",
    "url": "https://crypto.news/reasons-why-investors-are-watching-borroe-in-august-2023/",
    "description": "Borroe is an AI-powered funding marketplace that helps content creators and web3 participants convert future earnings into immediate cash flow"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-11T09:45:27.000Z",
    "title": "Bittrex and ex-CEO agree to $24m settlement with SEC",
    "url": "https://crypto.news/bittrex-and-ex-ceo-agree-to-24m-settlement-with-sec/",
    "description": "Digital assets exchange, Bittrex, alongside its former CEO William Shihara, has reached a $24 million agreement with the US SEC amid registration issues. The SEC lodged its complaint in the US District Court for the Western District of Washington on&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-11T10:00:42.000Z",
    "title": "Bittrex, SEC Reach Settlement In Securities Violation Case",
    "url": "https://www.newsbtc.com/crypto/bittrex-sec-reach-settlement/",
    "description": "Another crypto firm, Bittrex, bites the dust in the SEC’s continued clampdown on major players in the crypto industry amidst regulatory uncertainty. The regulator has been known to come hard at these crypto firms because it believes they aren’t toeing an almost non-existent regulatory framework.  Bittrex Succumbs To SEC In a press release dated August 10, the United States Securities and Exchange Commission (SEC) announced that crypto exchange Bittrex and its former CEO William Shihara have agreed to a $24 million monetary settlement with the regulator. According to the statement, Bittrex’s international affiliate company Bittrex Global GmbH also agreed to settle the charge of failing to register as a national securities exchange. Related Reading: New Milestone For Ethereum Could Spell Good News For ETH Price The SEC had alleged that the crypto exchange and its former CEO operated an “unregistered national securities exchange, broker, and clearing agency.” It argued that the exchange violated securities laws when it offered and allowed US investors to invest in crypto assets, which it deems as securities (The SEC has continued to allege that tokens like MATIC, SOL, ADA, and XRP are securities).  Furthermore, the agency accused the firm and its former CEO of going as far as to cover their tracks in order to escape regulatory scrutiny. The SEC’s complaint stated Shihara directed token issuers, who wanted their tokens listed on the exchange, to remove “problematic statements,” which could lead any regulator to investigate whether or not the company offered and sold securities on the platform. The settlement news may come as a surprise considering many thought the SEC was going to experience a pushback from the crypto exchange. This is because Bittrex had earlier argued that the SEC had no authority to regulate tokens traded on its platform due to a lack of clear-cut law by Congress authorizing the regulator to do so.  SEC Might Be Killing The Crypto Economy Besides Bittrex, the SEC is currently embroiled in legal battles against the world’s biggest cryptocurrency exchanges, Binance and Coinbase. Similarly, it accuses these exchanges of offering and selling securities on their platform without registering with the agency. While many may argue that the SEC is simply doing its job of protecting the interests of US investors, others may take a different point of view by arguing that the SEC is simply killing the Web3 economy in the country. For instance, Bittrex, before filing bankruptcy in the US, had earlier shut down its US operations due to “continued regulatory uncertainty.”  Related Reading: The Spoils Of Victory: XRP Daily Transactions Surpass Ethereum This unfavorable regulatory environment is undoubtedly one of the reasons why some other crypto firms have also chosen to take their operations abroad instead of being domiciled in the US, especially with the fact that other countries are putting crypto-friendly guidelines in place on how crypto exchanges should conduct their operations.  For this reason, Congress needs to step in and pass clear-cut laws that stipulate whether or not crypto exchanges fall under the purview of the SEC, and if yes, it needs to also address whether crypto assets are securities or not.  Total market cap down to $1.133 trillion amid regulatory concerns &#124; Source: Crypto Total Market Cap on Tradingview.com Featured image from Business Insider, chart from Tradingview.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-11T09:47:06.000Z",
    "title": "URGENT | Avoid Buying These 2 Altcoins RIGHT NOW!",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/urgent-avoid-buying-these-2-altcoins-right-now/",
    "description": "<p>I know Bull Run is coming and we are all tempted to buy our favorite tokens. But right now you must stay away from buying these two high-potential tokens. WHY? Because more than 300 Million tokens are about to unlock. How does that affect you or me? Should I expect the token price to drop [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/urgent-avoid-buying-these-2-altcoins-right-now/\">URGENT | Avoid Buying These 2 Altcoins RIGHT NOW!</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]