[
  {
    "source": "Cointelegraph",
    "date": "2023-11-21T21:46:09.000Z",
    "title": "Binance charges prove 'following the rules' was the right decision: Coinbase CEO",
    "url": "http://cointelegraph.com/news/binance-charges-prove-following-rules-right-decision-coinbase-ceo",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/e2bba96d-0efb-4386-a727-2491d63040f8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Brian Armstrong reflected on the announcement of criminal charges against Binance, stating that Coinbase’s decision to get licenses was correct.</p>\n                    <p><p>Brian Armstrong, CEO of crypto exchange Coinbase, <a href=\"https://twitter.com/brian_armstrong/status/1727054176763756826\" target=\"_blank\" rel=\"noopener nofollow\">thinks</a> that his company made the right decision to comply with U.S. money transmitter licensing laws.</p><p>In a Nov. 21 social media post, Armstrong weighed in on the news that rival exchange Binance is pleading guilty to criminal charges, stating that he is glad his own exchange decided to obtain money transmitter licenses, even though it put the company at a competitive disadvantage.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Since the founding of Coinbase back in 2012 we have taken a long-term view. I knew we needed to embrace compliance to become a generational company that stood the test of time. We got the licenses, hired the compliance and legal teams, and made it clear our brand was about trust…</p>— Brian Armstrong ️ (@brian_armstrong) <a href=\"https://twitter.com/brian_armstrong/status/1727054176763756826?ref_src=twsrc%5Etfw\">November 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“I knew we needed to embrace compliance to become a generational company that stood the test of time,” Armstrong stated, adding that his team “got the licenses, hired the compliance and legal teams, and made it clear our brand was […] Following the rules.”</p><p>Armstrong acknowledged that his team's compliance strategy slowed the growth of the company, stating that “we couldn't always move as quickly as others,” as it’s “more difficult and expensive to take a compliant approach.” However, Armstrong claimed his team’s approach was correct because “we believe in the rule of law.”</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/sec-raises-concerns-over-coinbase-in-objection-to-celsius-restructuring-plan\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-raises-concerns-over-coinbase-in-objection-to-celsius-restructuring-plan/amp\"><strong>SEC raises concerns over Coinbase in objection to Celsius restructuring plan</strong></a></em></p><p>Armstrong also took aim at what he sees as a lack of regulatory clarity in the U.S., which he claims is pushing users to offshore exchanges like Binance. “Americans should not have to go to offshore unregulated exchanges to benefit from this technology,” he stated. However, he also struck a positive tone, claiming that the resolution of the U.S. criminal case against Binance may finally be the “catalyst” for more regulatory clarity.</p><p>Armstrong has claimed that U.S. regulations lack clarity and have <a href=\"https://cointelegraph.com/news/unclear-regulations-drove-95-of-trading-activity-offshore-coinbase-ceo\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/unclear-regulations-drove-95-of-trading-activity-offshore-coinbase-ceo/amp\">driven “95%” of crypto transactions offshore</a>. The Securities and Exchange Commission has <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-sues-coinbase-crypto-exchange/amp\">filed suit against Coinbase</a> for allegedly violating U.S. securities laws. However, these claims aren't related to violations of the Bank Secrecy Act or money transmitter licensing issues.</p><p>On Nov. 21, the Department of Justice announced that Binance <a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-officials-announce-binance-settlement/amp\">has agreed to plead guilty</a> to violations of the U.S. Bank Secrecy Act and to serving U.S. customers without obtaining the proper money transmitter licenses.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-21T21:59:27.000Z",
    "title": "Binance’s Changpeng Zhao pleads guilty to money laundering, comments on resignation",
    "url": "https://cryptoslate.com/binances-changpeng-zhao-pleads-guilty-to-money-laundering-comments-on-resignation/",
    "description": "<p>Now-former Binance CEO Changpeng Zhao has pleaded guilty to money laundering charges, according to reports from The New York Times on Nov. 21. Zhao reportedly entered his guilty plea in federal court in Seattle today and agreed to pay a $50 million fine as part of the plea deal. That fine is separate from Binance&#8217;s [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/binances-changpeng-zhao-pleads-guilty-to-money-laundering-comments-on-resignation/\">Binance&#8217;s Changpeng Zhao pleads guilty to money laundering, comments on resignation</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-21T21:52:30.000Z",
    "title": "Binance CEO Changpeng Zhao steps down with response to the SEC following guilty plea",
    "url": "https://crypto.news/binance-ceo-changpeng-zhao-steps-down-with-response-to-the-sec-following-guilty-plea/",
    "description": "Binance faces a pivotal change as CEO Changpeng Zhao agrees to step down and the company prepares to pay $4.3 billion in fines, following a settlement with the U.S. SEC over anti-money laundering violations."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-21T22:00:47.000Z",
    "title": "Analyst Predicts Chainlink Rally To $20 Based On This Pattern",
    "url": "https://www.newsbtc.com/chainlink-news/analyst-predicts-chainlink-rally-20-based-pattern/",
    "description": "An analyst has pointed out how Chainlink might be breaking out of a bull flag right now, which could suggest a rally toward $20. Chainlink Is Escaping Out Of A Bull Flag Pattern Currently In a new post on X, analyst Ali pointed out a breakout that may be forming in the LINK price chart. The relevant technical pattern here is the &#8220;bull flag,&#8221; which, as its name implies, looks like a flag on a pole. This pattern forms when the asset&#8217;s price goes through a pullback after seeing a sharp rally and consolidates inside a region. The initial trend acts as the &#8220;pole,&#8221; while the parallel trendlines of the consolidation region make up the &#8220;flag.&#8221; Related Reading: Solana Forms Sell Signal, Decline To $30 Ahead? The flag&#8217;s length (the distance between the parallel trendlines) is always at most half the length of the pole. If it&#8217;s not, then the pattern isn&#8217;t that of a bull flag. Inside the flag, the price feels resistance at the upper line and support at the lower one. A successful break out of the resistance zone generally indicates that the asset is ready to continue the initial uptrend. According to the analyst, the chart below shows that such a pattern is forming for Chainlink. The bull flag pattern that the price of LINK is displaying right now &#124; Source: @ali_charts on X As displayed in the graph, Chainlink had earlier been consolidating inside what seems to have been a bull flag, but with the recent surge, the asset has seen a break out of the pattern. When Ali shared the chart, LINK had been trading just under the $15 mark. The analyst had noted that a retest of the breakout zone could happen soon, around $14. The cryptocurrency has indeed made such a retest since then, as its price has observed some retrace. Ali believes the price could rally towards the $20 mark, continuing the bullish momentum from earlier. From the current asset price, such a jump would imply profits of almost 42% for Chainlink. It remains to be seen whether the bull flag pattern holds for the cryptocurrency this time and if a return to a bullish trend occurs. LINK Has Seen A Rally Of 185% In The Past Month Regardless of the recent pullback that the asset has seen from above the $16 mark, its returns for the last 30 days are still incredible, as they currently stand at a whopping 85%. Related Reading: Bitcoin Fees Soar Above Ethereum’s As Investors Flock To Ordinals-Backed Assets The below chart shows what the performance of the asset has looked like during this period. The value of the cryptocurrency has shot up during the past few weeks &#124; Source: LINKUSD on TradingView With such large returns, Chainlink has naturally outperformed most of the other top assets recently, and it&#8217;s no wonder that the cryptocurrency has also significantly improved its standing in the market cap list. Looks like LINK has a market cap of almost $7.9 billion at the moment &#124; Source: CoinMarketCap Featured image from Shutterstock.com, charts from TradingView.com"
  }
]