[
  {
    "source": "Decrypt",
    "date": "2024-03-08T00:01:43.000Z",
    "title": "Degens Who Missed Out on Wormhole Airdrop Are Coping by Trading ‘L’",
    "url": "https://decrypt.co/220692/degens-missed-wormhole-airdrop-coping-trading-l",
    "description": "Didn’t get in on the upcoming Wormhole (W) token airdrop? Take this “L” instead—or rather trade this L token, like Solana degens are."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-07T23:55:02.000Z",
    "title": "AI crypto market cap doubles to $25 billion in 20 days",
    "url": "https://cryptoslate.com/ai-crypto-market-cap-doubles-to-25-billion-in-20-days/",
    "description": "<p>The AI blockchain sector&#8217;s combined market cap has more than doubled to $25.1 billion in less than a month as the world remains engrossed in developments in AI technology, according to CryptoSlate data. Overall, the market has increased roughly 150% from $9.64 billion on Feb. 16. The sector has also seen short-term growth, with gains [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ai-crypto-market-cap-doubles-to-25-billion-in-20-days/\">AI crypto market cap doubles to $25 billion in 20 days</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-07T23:49:30.000Z",
    "title": "Parallel structures can transform blockchain for users: Neon EVM software engineer",
    "url": "https://cryptobriefing.com/parallel-structures-transform-blockchain-users/",
    "description": "Andrei Dragnea makes a deep dive into the complexities and advantages of constructing a parallel architecture blockchain."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-08T00:00:09.000Z",
    "title": "Rocket Pool Stands To Reap Big From Ethereum’s Dencun Upgrade, RPL Flying",
    "url": "https://www.newsbtc.com/news/defi/rocket-pool-ethereum-dencun-upgrade-rpl-flying/",
    "description": "The Ethereum liquidity staking protocol Rocket Pool is on the brink of a massive transformation with the incoming Dencun upgrade. As one community advocate points out, this change is primarily due to the enhancements the Houston upgrade will tag. Eyes On Dencun Upgrade In a recent post on X, the advocate explained that the Dencun upgrade, scheduled to go live in mid-March 2024, will pave the way for the implementation of the Houston upgrade. The Houston upgrade, in turn, aims to improve Rocket Pool&#8217;s scalability and efficiency.  The Dencun upgrade must first be successfully implemented so that the Houston enhancements can take effect and improve Rocket Pool&#8217;s performance.  Related Reading: Super Tuesday Crypto Craze: Biden-Related Memecoin Stuns Markets With 5,000% Surge This hard fork update requires all Ethereum node operators to upgrade their software. Once the network is updated, developers predict that transaction costs, particularly in layer-2 networks, will decrease significantly.  EIP-4788 And Why It Is Crucial For Rocket Pool However, the Dencun upgrade will also execute a crucial enhancement, Ethereum Improvement Proposal (EIP) 4788. This proposal is designed to optimize communication between the execution layer, where all smart contracts and transactions occur, and the consensus layer, which includes validators like Rocket Pool.  A crucial aspect of this proposal is enabling the execution layer to access consensus layer information without needing third-party oracles, thereby enhancing the mainnet&#8217;s security and efficiency. With the activation of the Houston upgrade, Rocket Pool users can anticipate a series of enhancements designed to improve their experience.  Once Houston goes live, the protocol will automatically lower the minimum ETH staking amount, allowing more users to stake. Additionally, introducing a delegated mini-pool contract will streamline the distribution of fees and rewards. In Rocket Pool, a mini pool is a virtual pool combining all the ETH from stakers.  However, over time, the activation of EIP-4788 allows Rocket Pool to innovate on ETH staking. Looking at the price chart, this expectation has been well received. So far, RPL, the native token of the liquidity staking platform, has been ripping higher. On March 6, the token broke above February highs above $33. Traders expect bulls to build on recent gains, pushing the token towards January 2024 highs of around $40.  Related Reading: 14-Year Old Dormant Bitcoin Wallet Wakes Up To Crash BTC Price When written on March 7, the token was up nearly 110% from its October 2023 lows. Even so, RPL has yet to recover from the bear run of 2022. In April 2023, the token rose to as high as $65. Feature image from DepositPhotos, chart from TradingView"
  }
]