[
  {
    "source": "CoinDesk",
    "date": "2023-10-25T22:47:37.000Z",
    "title": "Lesser-known Johnson Wins Speaker Job as Crypto-focused Lawmakers Return to Old Roles",
    "url": "https://www.coindesk.com/policy/2023/10/25/lesser-known-johnson-wins-speaker-job-as-crypto-focused-lawmakers-return-to-old-roles/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "After several failed attempts, Republicans in the U.S. House of Representatives dug deep into their roster to elevate a less prominent and less controversial lawmaker, Rep. Mike Johnson (R-La.), as the new Speaker of the House."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-25T22:45:51.000Z",
    "title": "Elliptic counters WSJ report on the scale of Hamas’ crypto fundraising",
    "url": "https://cryptoslate.com/elliptic-counters-wsj-report-on-the-scale-of-hamas-crypto-fundraising/",
    "description": "<p>Crypto analytics firm Elliptic said in an Oct. 25 blog post that, contrary to mainstream reports, terrorist groups have not received significant crypto donations. On Oct. 10, The Wall Street Journal reported that Hamas, Palestinian Islamic Jihad, and Hezbollah raised hundreds of millions of dollars in crypto between August 2021 and June 2023, in part [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/elliptic-counters-wsj-report-on-the-scale-of-hamas-crypto-fundraising/\">Elliptic counters WSJ report on the scale of Hamas&#8217; crypto fundraising</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-25T22:45:00.000Z",
    "title": "Jim Cramer Says Investors Should Wait for Higher Interest Rates and Lower Stock Prices Before Buying",
    "url": "https://www.cryptoglobe.com/latest/2023/10/jim-cramer-says-investors-should-wait-for-higher-interest-rates-and-lower-stock-prices-before-buying/",
    "description": "The host of CNBC’s “Mad Money” and well-known market analyst Jim Cramer has recently suggested that investors may want to hold out on buying assets until interest rates rise again, believing an ensuing sell-off will lower prices. Per his words, it may now be a better bet to “wait for the next move up in […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-25T22:45:56.000Z",
    "title": "Binance Blasts CFTC for Trying to Be World’s Derivatives Police, Seeks to Dismiss Lawsuit",
    "url": "https://news.bitcoin.com/binance-blasts-cftc-for-trying-to-be-worlds-derivatives-police-seeks-to-dismiss-lawsuit/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2358252223-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance Blasts CFTC for Trying to Be World’s Derivatives Police, Seeks to Dismiss Lawsuit\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2358252223-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2358252223-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2358252223-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2358252223-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2358252223-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2358252223-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2358252223.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Binance has submitted a new motion to dismiss the lawsuit filed by the U.S. Commodity Futures Trading Commission (CFTC) against it. The leading cryptocurrency exchange urges the court to reject the agency’s attempt to expand its territorial reach beyond the United States. Binance Accuses CFTC of Using U.S. Lawsuit as a ‘Trojan Horse’ to Gain [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-25T23:00:49.000Z",
    "title": "Bitcoin Resumes Rally After Brief Hiatus, Here’s What Happened",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-resumes-rally-hiatus/",
    "description": "Bitcoin saw a brief stall in its rally which triggered a decline back down to $33,700. This decline, seemingly out of nowhere, may have not been random given some developments in the crypto space. As the rally resumes once more, here’s a look at these developments. BlackRock Spot Bitcoin ETF Listing Taken Down The BlackRock Spot Bitcoin ETF was first listed on the Depository Trust and Clearing Corporation’s (DTCC) on Tuesday, triggering the first wave of the Bitcoin rally. However, in the same day, crypto community members noticed that the listing on DTCC had been mysteriously taken down. Related Reading: Bitcoin Price Crosses $35,000, Here’s Why The listing would remain off the site for several hours while community members speculated on what could be the cause of this. Around this time, the price of Bitcoin began to fall, seemingly driven by the fact that investors saw the removal of the BlackRock listing as a sign that a Spot Bitcoin ETF wasn’t coming as soon as they expected. Hours later, Bloomberg Analyst Joe Light revealed that the listing was back up on the site. Apparently, the initial listing and the subsequent ones had carried one small change in detail which was a change in the Create/Redeem section from a “Y” to a “N.” Another Bloomberg analyst James Seyffart explained that this likely meant that it was to indicate whether the ETF listing was open to creations/redemptions. When Light asked if this change could point out a launch without using that attribute, to which Seyffart said: “I personally don’t think this means all that much if I’m being honest. Think it indicates Blackrock is getting everything ready to launch if and when they get an SEC approval. And that the N just means it’s not open for create redeem because it’s not live yet.” BTC recovers to $34,400 &#124; Source: BTCUSD on Tradingview.com BTC Price Bounces Back The return of the BlackRock Spot Bitcoin ETF on the DTCC sparked enthusiasm across the space once more than it did before. The price of Bitcoin quickly started to recover and by Wednesday morning, was back above the $34,000 mark once more. Related Reading: ARK Invest’s Cathie Wood Reveals Why Bitcoin Will Reach $1.48 Million These events outline the importance of a Spot ETF and how it is the major driver behind the most recent price rally. So an approval or a rejection would both have a major impact on the digital asset’s price. For one, an approval would likely see Bitcoin clear above $40,000. However, a rejection would be detrimental to the rally, and will probably send it back below $30,000. Presently, Bitcoin is maintaining bullish momentum above $34,100. But it is seeing small losses of 0.99% on the 24-hour chart, and its daily trading volume is down 34.58%. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Forbes, chart from TradingView.com"
  }
]