[
  {
    "source": "Cointelegraph",
    "date": "2023-10-08T10:39:35.000Z",
    "title": "Ripple CTO seeks community consensus for XRPL AMM feature adoption",
    "url": "https://cointelegraph.com/news/ripple-cto-seeks-community-consensus-for-xrpl-amm-feature-adoption",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/6ec1b27a-8dfe-4659-9a87-2807feab8de8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Schwartz stated that if the majority supports the amendment, the changes could be implemented in as little as two weeks.</p>\n                    <p><p>Ripple chief technical officer (CTO), David Schwartz has advocated for XRP Ledger (XRPL) validators to support the automated market maker (AMM) feature, but only if there is consensus within the community.</p><p>On X (formerly known as Twitter), Ripple's CTO <a href=\"https://twitter.com/JoelKatz/status/1710202072052969841\" target=\"_blank\" rel=\"noopener nofollow\">initiated</a> a discussion on the XRPL's AMM feature. In his initial post, Schwartz referred to AMMs as the intriguing decentralized finance (DeFi) innovation gaining attention, sparking queries for more details.</p><p>The XRP Ledger is a decentralized blockchain-based ledger that powers the XRP cryptocurrency. known for its speed and scalability, making it suitable for various financial applications, including cross-border payments and remittances.</p><p>In response to a community member's question about the timeline for AMMs going live on the XRPL after governance voting, Schwartz stated that if the majority supports the amendment, the changes could be implemented in as little as two weeks.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In general though, validators shouldn&#39;t vote YES individually. The community should make a decision and then validators should nearly all vote YES when they believe the community is on board and enough nodes support the change.<br><br>The amendment voting process is intended to…</p>&mdash; David &quot;JoelKatz&quot; Schwartz (@JoelKatz) <a href=\"https://twitter.com/JoelKatz/status/1710202072052969841?ref_src=twsrc%5Etfw\">October 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Expanding on the significance of a majority vote, Schwartz emphasized that to the best of his knowledge, no validators are currently endorsing the vote. The introduction of the AMM feature occurred with the release of rippled version 1.12.0, which also brought the potential Clawback feature. This addition of AMM is not limited to the introduction of a new trading engine; it will also enable integration with the XRPL DEX.</p><p>Despite the significance attributed to this feature, Schwartz advised validators against voting independently to promote these modifications. Instead, he emphasized that \"the community should reach a consensus first, and then validators should overwhelmingly vote YES when they perceive that the community is in agreement and sufficient nodes endorse the adjustment.\"</p><p>In addition to his prominent role within the Ripple ecosystem, David Schwartz is renowned for his informative articles and his commitment to championing decentralization.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/lawyers-debate-over-ripple-case-judge-reject-sec-motion-appeal\"><strong><em>Lawyers debate over Ripple case after rejection of SEC’s motion for appeal</em></strong></a></p><p>Lately, he <a href=\"https://twitter.com/JoelKatz/status/1709269004668596255\" target=\"_blank\" rel=\"noopener nofollow\">dispelled</a> misunderstandings concerning the Clawback feature, often seen as an intrusion on XRPL users. He clarified that the Clawback feature's purpose is to safeguard developers from potential legal liabilities within the ecosystem. Schwartz consistently advocates for the advancement of the XRPL and is outspoken about his position.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/pro-xrp-lawyer-john-deaton-10x-more-into-btc-4x-more-into-eth-hall-of-flame/\"><strong><em>Pro-XRP lawyer John Deaton ‘10x more into BTC, 4x more into ETH’: Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-08T11:00:23.000Z",
    "title": "US considering application of Electronic Fund Transfer Act to crypto accounts",
    "url": "https://cryptoslate.com/us-considering-application-of-electronic-fund-transfer-act-to-crypto-accounts/",
    "description": "<p>The US Consumer Financial Protection Bureau (CFPB) is evaluating the application of the Electronic Fund Transfer Act (EFTA) to cryptocurrency platforms. The move aims to bolster consumer protections in a market plagued by recent significant hacks on platforms like Axie Infinity, Crypto.com, and FTX. EFTA regulations mandate that electronic fund facilitators inform users of their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/us-considering-application-of-electronic-fund-transfer-act-to-crypto-accounts/\">US considering application of Electronic Fund Transfer Act to crypto accounts</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-08T11:05:51.000Z",
    "title": "Jamie Dimon Foresees AI Integration Across Every Operational Facet at JPMorgan",
    "url": "https://www.cryptopolitan.com/ai-integration-operational-facet-jpmorgan/",
    "description": "In a recent Bloomberg interview, JPMorgan CEO Jamie Dimon laid bare the transformative potential of artificial intelligence (AI), stating unequivocally that it could revolutionize the global workforce. The financial giant is already deeply embedded in AI experimentation, particularly in trading and research, where the technology now handles the entirety of equity hedging. Dimon, acknowledging the ... <a title=\"Jamie Dimon Foresees AI Integration Across Every Operational Facet at JPMorgan\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-integration-operational-facet-jpmorgan/\" aria-label=\"More on Jamie Dimon Foresees AI Integration Across Every Operational Facet at JPMorgan\">Read more</a>"
  }
]