[
  {
    "source": "CoinDesk",
    "date": "2023-08-08T14:43:30.000Z",
    "title": "Paxos Has Other 'White Label' Stablecoin Opportunities in the Works in Addition to PayPal USD",
    "url": "https://www.coindesk.com/business/2023/08/08/paxos-has-other-white-label-stablecoin-opportunities-in-the-works-in-addition-to-paypal-usd/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto infrastructure provider Paxos Trust is already working on other stablecoin projects similar to PayPal’s new PYUSD, said Paxos’ head of strategy Walter Hessert on CoinDesk TV on Tuesday."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-08T15:00:00.000Z",
    "title": "10 obstacles to cross-chain interoperability (and how they can be overcome)",
    "url": "https://cointelegraph.com/innovation-circle/10-obstacles-to-cross-chain-interoperability-and-how-they-can-be-overcome",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/55abdd4a-e659-4009-a9c5-57cc8db5974b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cross-chain operability may only be achieved when there’s not only a way, but a will to move forward.</p>\n                    <p><p>Even crypto industry outsiders are gaining clarity on the benefits of blockchain technology, which is a significant step forward for the ecosystem. However, a challenge remains: The industry still struggles with interoperability between blockchain networks. </p> <p>Unless different chains can safely and efficiently communicate and exchange data, the full power of blockchain — including true decentralization, new use cases, lower costs and, ultimately, further innovation — can’t be achieved. Here, 10 members of <a href=\"https://circle.cointelegraph.com/?_ga=2.198681135.1484442309.1667485998-1927108766.1652715111\" target=\"_blank\" rel=\"noreferrer noopener\">Cointelegraph Innovation Circle</a> discuss some of the challenges still standing in the way of achieving cross-chain interoperability and how they can be overcome.</p> <h2>The lack of standardized protocols</h2> <p>A key challenge that our industry still faces in terms of cross-chain interoperability is the lack of standardized protocols and consensus. Development of interoperable protocols like cross-chain bridges and atomic swaps is one way to address this. Such efforts are already being seen in the industry, with brands like Polygon coming up with the Polygon bridge, which transfers tokens from Ethereum to Polygon. –<a href=\"https://circle.cointelegraph.com/u/1d9f8b61-2e77-4452-a837-4db4245d01ca\" target=\"_blank\" rel=\"noreferrer noopener\"> Abhishek Singh</a>,<a href=\"http://acknoledger.com/\" target=\"_blank\" rel=\"noreferrer noopener\"> Acknoledger</a></p> <h2>The challenging user experience</h2> <p>In my view, the main challenge is not so much the technical aspect of different protocols, bridges or atomic swaps. It is in the user experience, which dictates adoption. Currently, to cross-chain, you need to be a power user with a highly complex setup of wallets — even if it’s just MetaMask with multiple chains configured. True interoperability only happens when the experience becomes seamlessly simple. –<a href=\"https://circle.cointelegraph.com/u/16cde551-5395-4ca9-8281-7152cbb88396\" target=\"_blank\" rel=\"noreferrer noopener\"> Tiago Serôdio</a>, ​​<a href=\"https://partisiablockchain.com/\" target=\"_blank\" rel=\"noreferrer noopener\">Partisia Blockchain</a></p> <h2>The lack of efficient cross-chain markets</h2> <p>A lack of efficient cross-chain markets severely limits the adoption of cross-chain technologies. Better markets could help the space cut away the centralized services that to this point have powered most user activity in the sector. Interoperability itself is only possible to a limited extent without breaking trust assumptions due to the diverse varieties of blockchains out there in the wild. –<a href=\"https://circle.cointelegraph.com/u/a3aa146d-9b06-4b6a-9fe8-9330016ac800\" target=\"_blank\" rel=\"noreferrer noopener\"> Simon Harman</a>,<a href=\"http://chainflip.io/\" target=\"_blank\" rel=\"noreferrer noopener\"> Chainflip Labs</a></p> <h2>The lack of a cohesive understanding in the ecosystem</h2> <p>As a global space, the crypto ecosystem is an amalgamation of coding languages, algorithms, protocols and, ultimately, visions for what our digital future could become. But much like the Tower of Babel, we lack a cohesive understanding that unifies all participants under a single, seamless experience. Whether created or adopted from existing architecture, such a solution could rectify this issue. –<a href=\"https://circle.cointelegraph.com/u/83c71aad-8be6-470a-aaf9-7f146821217c\" target=\"_blank\" rel=\"noreferrer noopener\"> Oleksandr Lutskevych</a>,<a href=\"http://cex.io/\" target=\"_blank\" rel=\"noreferrer noopener\"> CEX.IO</a></p> <h2>The lack of demand</h2> <p>I don’t believe there is much standing in the way in terms of technology; the question is what is standing in the way in terms of demand. Bridges are an extra step, but they’re easy enough to execute if doing so adds value. I’d say that as long Ether gas fees remain relatively high, then demand should grow for bridging as the market gains steam and yield farmers become more aggressive, escalating the ex-ETH DeFi transaction volume. –<a href=\"https://circle.cointelegraph.com/u/313a59f1-efb9-465c-aee3-750eaa69f776\" target=\"_blank\" rel=\"noreferrer noopener\"> Timothy Enneking</a>,<a href=\"http://www.digital-capital-management.com/\" target=\"_blank\" rel=\"noreferrer noopener\"> Digital Capital Management</a></p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://hubs.ly/Q0152XyT0\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <h2>The difficulty of ensuring valid proofs</h2> <p>Chains have trouble convincing each other their own proofs are valid. Imagine two lawyers trying to convince a jury beyond a reasonable doubt, all while arguing in different languages. The uncertainty can grind business to a halt, or conversely, regrettable decisions are made to save time. It’s a difficult but familiar problem. The internet has taught us that standardized protocols promote effective communication. –<a href=\"https://circle.cointelegraph.com/u/565d28ae-aad2-4ed9-bc34-a68b9954700e\" target=\"_blank\" rel=\"noreferrer noopener\"> Stephanie So</a>,<a href=\"http://geeq.io/\" target=\"_blank\" rel=\"noreferrer noopener\"> Geeq</a></p> <h2>Complexity</h2> <p>Complexity is the biggest challenge for cross-chain Web3 interoperability. Bridges and communication protocols are both built on highly complex underlying technology that can cause issues and disrupt regular operations. Diversification is therefore crucial for reducing risk. A multibridge system, for example, helps to limit your project’s dependence on a single cross-chain solution. –<a href=\"https://circle.cointelegraph.com/u/abc0e9e1-b580-49da-b9fb-105caa752b79\" target=\"_blank\" rel=\"noreferrer noopener\"> Wolfgang Rückerl</a>,<a href=\"https://entity.global/\" target=\"_blank\" rel=\"noreferrer noopener\"> ENT Technologies AG</a></p> <h2>High computational loads</h2> <p>High transaction computational load is a core challenge when it comes to cross-chain interoperability. It happens when an increased number of transactions received from multiple networks clog one blockchain’s throughput. To address this, techniques like sharding (as employed by Polkadot and Cosmos) divide whole blockchain storage into several smaller and unique shards to process transactions without losing scalability. –<a href=\"https://circle.cointelegraph.com/u/a27b7ccb-dfb8-468f-83ae-4aac596f0a40\" target=\"_blank\" rel=\"noreferrer noopener\"> Vinita Rathi</a>,<a href=\"https://www.systango.com/\" target=\"_blank\" rel=\"noreferrer noopener\"> Systango</a></p> <h2>The potential for hacks</h2> <p>Hacks often happen when interoperability is achieved using wrapped tokens — the hack is carried out on the bridge between two blockchains. Different design choices that lead to different accounting methods, as well as other variations, complicate matters. Different chains can interoperate, but the process is cumbersome and prone to hacks unless the chains have been designed to interoperate from the very start. –<a href=\"https://circle.cointelegraph.com/u/008ee5ae-3d26-4c82-a558-db3e57e4c769\" target=\"_blank\" rel=\"noreferrer noopener\"> Zain Jaffer</a>,<a href=\"http://www.zain-ventures.com/\" target=\"_blank\" rel=\"noreferrer noopener\"> Zain Ventures</a></p> <h2>Scalability</h2> <p>Scalability complicates cross-chain interoperability. Large data transfers between chains are slow and inefficient. Sidechains and state channels enable faster transactions, and sharding and off-chain computation boost scalability. However, these solutions require collaboration and innovation to succeed. –<a href=\"https://circle.cointelegraph.com/u/8179044f-5f09-469d-8c72-d17fd6274257\" target=\"_blank\" rel=\"noreferrer noopener\"> Arvin Khamseh</a>,<a href=\"http://soldoutnfts.io/\" target=\"_blank\" rel=\"noreferrer noopener\"> SOLDOUT NFTs</a></p> <hr class=\"wp-block-separator\" /> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://hubs.ly/Q0152XyT0\"><em><strong><u>Learn more about Cointelegraph Innovation Circle and see if you qualify to join.</u></strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-08T14:48:00.000Z",
    "title": "Free Bitcoin on Zaps experiment — but what are Zaps? ",
    "url": "https://cointelegraph.com/news/free-bitcoin-on-zaps-experiment-what-are-zaps",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/68245b36-d72a-4ade-8082-af69a3bb13cb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Why a Canadian Bitcoin advocate is giving out free Bitcoin tips, or Zaps, to people around the globe–and why the Zap trend is catching on.</p>\n                    <p><p>A Bitcoin advocate based in Canada has “Zapped” 600 people a total of 300 <a href=\"https://cointelegraph.com/learn/bitcoin-vs-satoshi-key-differences-explained\">Satoshis</a> ($0.09 or 0.000003 BTC) each in a Bitcoin-inspired (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) social media experiment. </p><p>To date, marketing executive Michael Degroot has doled out over $50 in Bitcoin to people around the globe. He has since been Zapped back more than 40 times, receiving more than $6. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Doing an experiment on <a href=\"https://twitter.com/orangepillapp?ref_src=twsrc%5Etfw\">@orangepillapp</a> I’m going to be zapping & connecting with everyone who has their lightning wallet attached. ~700 people, if you aren’t on there already here’s my referral code. <a href=\"https://t.co/ADO92uEDqr\">https://t.co/ADO92uEDqr</a> I’ll be updating this thread while I zap people <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&ref_src=twsrc%5Etfw\">#Bitcoin</a></p>— Michael Degroot (@_mikedegroot) <a href=\"https://twitter.com/_mikedegroot/status/1686083487760277507?ref_src=twsrc%5Etfw\">July 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>But what are Zaps, and how is it possible to send money around the world without an intermediary?</h2><p>Degroot recently signed up to the Orange Pill App, a social media platform that connects Bitcoin users from around the world. The app works similarly to Tinder or Meetups.com: the mission is to <a href=\"https://cointelegraph.com/news/new-social-apps-want-to-help-bitcoiners-connect-in-real-life\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/new-social-apps-want-to-help-bitcoiners-connect-in-real-life/amp\">connect Bitcoiners in real life. </a></p><p>The app recently integrated Zaps or Bitcoin tips, and according to founder Matteo Pellegrini, 20% of users have added Zaps to their profiles. </p><p>Zaps use the layer-2 <a href=\"https://cointelegraph.com/learn/what-is-the-lightning-network-in-bitcoin-and-how-does-it-work\">Lightning Network</a> which runs on top of Bitcoin. Zaps are typically small or tiny amounts of Bitcoin, measured in Satoshis, and they are sent peer-to-peer. </p><p>To Zap, <a href=\"https://cointelegraph.com/news/how-to-send-and-receive-payments-on-the-lightning-network\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/how-to-send-and-receive-payments-on-the-lightning-network/amp\">users have two choices</a>. Create a non-custodial lightning wallet using a lightning node, or open a custodial lightning wallet. When users opt for a custodial solution, a third party such as Wallet of Satoshi, Blink or CoinCorner manages the Bitcoin. They take care of routing, lightning channels, and liquidity. </p><p>Users can then create a lightning address, known as an LNURL, to receive zaps. Think of the LNURL as an email address but for money. By adding this address to profiles on platforms including Orange Pill App, <a href=\"https://cointelegraph.com/news/crowdfunding-gets-leg-up-from-lightning-addresses-on-bitcoin\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crowdfunding-gets-leg-up-from-lightning-addresses-on-bitcoin/amp\">Geyser Fund</a> or Nostr, users can now receive Bitcoin from users all around the world, instantly and at almost no cost. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2022-03/280488e2-3314-46e2-82d6-36446e27c5c3.jpg\" alt=\"\" title=\"Free Bitcoin on Zaps experiment–but what are Zaps? \"><figcaption style=\"text-align: center;\">Bitcoin tipping, or Zapping is mobile-first </figcaption></figure><p>Crucially, there is seldom a Zapping middleman and it works well with micropayments, such as Degroot’s 300 Sats payment. Money remitters such as Paypal, Western Union or Wire Transfer charge a fee to route money around the world but are ineffective for micropayments due to high fees. </p><p>Zapping removes the need for a middleman, which also removes a money-making opportunity. Pellegrini explained: “It doesn't cost us anything when users Zap each other and we don't, nor shouldn’t, make any money off it.” </p><p>Brian Armstrong, the CEO of Coinbase, the United States’ largest crypto exchange, <a href=\"https://cointelegraph.com/news/brian-armstrong-owes-me-100-in-bitcoin-here-s-why\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/brian-armstrong-owes-me-100-in-bitcoin-here-s-why/amp\">recently confused a Lightning Address</a>–or Zap address–for an email address. It’s fair to say that Zaps are yet to light up the mainstream crypto conversation.</p><h2>Zapathon</h2><p>Back to Degroot’s Zapathon. The Canadian “Messaged and zapped every single person on the Orange Pill App who has a lightning wallet attached to their profile,” he disclosed to Cointelegraph.</p><blockquote>“I want to contribute to the community more and I thought this was a way I could contribute and I could increase bitcoiners in my network. A way to find more signal.”</blockquote><p>But while Degroot expanded his network, gaining hundreds of X (formerly known as Twitter) followers, the generous act also demonstrated the power of the Lightning Network’s money transfer mechanism. Degroot Zapped 300 Sats (less than 10 cents) to someone living 16,000 km away in South Africa, expressing: “It settled in a second and there was no fee for it.”</p><blockquote>“I used to own a business and if someone paid us with a credit card before a weekend it could take up to 5 days for those funds to reach our bank account, and cost ~2.5%.”</blockquote><p>Degroot also Zapped me (please note this was NOT a bribe to write this article!). It cost nothing despite that we are separated by the Atlantic Ocean. </p><h2>Zapping on NOSTR </h2><p>While Orange Pill App, Geyser Fund (a crowdfunding platform) and Stacker News are Zap-arenas, the tipping feature is increasingly popularised by Nostr, short for or Notes and Other Stuff Transmitted by Relays. In its present form, Nostr is a decentralized alternative to centralized social media platforms such as Twitter or Reddit. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/30a0ff62-982a-47a6-b92c-e5d56859b001.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Zaps sent on Nostr over the past 6 months. Source: Stats.Nostr.Band</em></figcaption></figure><p>Nostr is a protocol that comes to life by integrating with <a href=\"https://cointelegraph.com/news/decentralized-twitter-alternative-goes-live-on-apple-s-app-store\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/decentralized-twitter-alternative-goes-live-on-apple-s-app-store/amp\">clients such as Damus (for iPhone)</a>, or Snort (for desktop). Nostr recently reached 4 million users while hundreds of thousands of dollars worth of Bitcoin has been zapped across the world. Curiously, the “like” button does exist on Nostr platforms, but Zaps are sometimes favored over likes. </p><h2>Why are people giving out free money on the Internet?</h2><p>Zapping is a Bitcoiner behavior that, at first glance, doesn’t make a lot of sense. Why give out Bitcoin to strangers on the internet, knowing that Bitcoin is a scarce asset? There are only 21 million Bitcoin, or 21 quadrillion Sats and it’s highly unlikely that more will be mined. </p><p>Jeff Booth, founder of <a href=\"https://cointelegraph.com/news/bitcoin-transition-how-hodlers-can-become-changemakers-and-drive-adoption\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-transition-how-hodlers-can-become-changemakers-and-drive-adoption/amp\">Ego Death Capital told Cointelegraph</a>: “So for people in Bitcoin and on Nostr, that economy is emerging, and it’s really early.”</p><blockquote>“For people that aren’t in that world, they wouldn’t see what we’re talking about. If you’re measuring from the existing system, you don’t know what we’re talking about.”</blockquote><p>I asked Nostr users why they sent Sats. The responses were light-hearted, fun and moving. BitcoinSandy a Nostrich (a Nostr user), explained that “It is a really good feeling sending instant value to someone likeminded who values freedom.” </p><p>Manlikeweks explained that Nostr’s borderless and censorship-resistant properties are awesome, particularly “As a person based in Tanzania and being funded worldwide without any restrictions.”</p><p>Zapping also taps into the trend of Value for Value or creator compensation. Digital creators can monetize content directly, without the need for a middleman. </p><p>BitcoinBarry explained how it works in practice: “I often try to give answers where I can and am rewarded to give better than suboptimal answers too.” I.e - if you post useful content on Nostr, you may be rewarded with a bountiful Zap — much like you would tip a waiter in a restaurant for excellent service. </p><p>Nostrich JoeLibertarian spelled it out: “Sats speak louder than likes.” You can like a post on Nostr, or you can send the post Sats to truly express satisfaction and gratitude. </p><h2>Nostr-ings attached?</h2><p>Nostr is not without hiccups. Apple <a href=\"https://cointelegraph.com/news/apple-to-delist-nostr-based-damus-app-for-bitcoin-tip-feature\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/apple-to-delist-nostr-based-damus-app-for-bitcoin-tip-feature/amp\">recently delisted Damus from the App Store</a> due to the Bitcoin tipping feature. Apple said Zaps violate payment policies: “If they [users] are connected to or associated with receiving digital content, they must use in-app purchase in accordance with guideline 3.1.1.” </p><p>Nonetheless, Nostr is a protocol, not a centralized service. Clients similar to Damus have since popped up on the Apple App Store, such as Plebstr. </p><p>Regarding Orange Pill App, Pellegrini explained to Cointelegraph that there is no risk of being de-platformed by Apple. Why? Pellegrini explains, “We gave Tim Cook [Apple CEO] a free Orange Pill App membership!”</p><blockquote>“Joking aside, there's no feed on the app so the zapping is via profiles, that are not classified as content unlike notes / tweets.”</blockquote><p>Apple can continue its crusade of Nostr platforms where content can be easily monetized, but as a popular Nostr-Creator Walker points out, Nostr is“A freedom-loving hydra.” If you remove one Nostr-playground others will pop up: </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Apple bends the knee to the CCP and removes <a href=\"https://twitter.com/damusapp?ref_src=twsrc%5Etfw\">@damusapp</a> from the App Store in China after one day…<br><br>They will soon discover <a href=\"https://twitter.com/hashtag/nostr?src=hash&ref_src=twsrc%5Etfw\">#nostr</a> is a freedom-loving hydra…<br><br>Cut off one head and two will grow in its place.<br><br>You cannot kill it; fighting it only makes it stronger. <a href=\"https://t.co/D3UTFtx2mR\">pic.twitter.com/D3UTFtx2mR</a></p>— Walker⚡️ (@WalkerAmerica) <a href=\"https://twitter.com/WalkerAmerica/status/1621239174182440960?ref_src=twsrc%5Etfw\">February 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Meanwhile, Degroot’s quest continues. He hopes to Zap every user on Orange Pill App, buoyed by the enthusiasm he’s met with from fellow users: </p><blockquote>“My Favorite response was ‘Thank you for sending me those sats I have never been zapped before you made my day!’”</blockquote><p>He concluded the experiment on August 7, telling the Zap-curious to \"DO IT\". </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I sent ~600 zaps for a total of 180,000 sats and was zapped back ~40 times with many people telling me they would pay it forward. Had one person send me back 50x what I sent them & another 80x to support the cause. If you have the chance to zap someone for the first time DO IT⚡️</p>— Michael Degroot (@_mikedegroot) <a href=\"https://twitter.com/_mikedegroot/status/1688668501589086209?ref_src=twsrc%5Etfw\">August 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ultimately, Degroot regularly zapped profiles who received their first-ever Sats. Pellegrini summed it up sweetly: “After all, who doesn't like some sweet sweet sats?”</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-08T15:05:58.000Z",
    "title": "Binance’s Regulatory Win: Dual Crypto Licenses Secured in El Salvador",
    "url": "https://cryptobriefing.com/binance-now-successfully-licensed-in-el-salvador/?utm_source=feed&utm_medium=rss",
    "description": "Binance has proudly announced its achievement as the first crypto exchange to obtain full licensing in El Salvador."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-08T15:04:13.000Z",
    "title": "Mahjong Meta Unveils Revolutionary Web3 Esports Platform, Official Launch on August 7th",
    "url": "https://cryptodaily.co.uk/2023/08/mahjong-meta-unveils-revolutionary-web3-esports-platform-official-launch-on-august-7th",
    "description": "<p>Hong Kong, Hong Kong, August 8th, 2023, Chainwire</p><p>Mahjong Meta, the web3 Riichi Mahjong esports platform, is excited to announce the official launch of its highly anticipated game on August 7th. After a successful two-month Open Beta test that captured the hearts of mahjong enthusiasts, the platform is set to revolutionize the mahjong gaming experience on-chain with its immersive and decentralized gaming experience.</p><p>In Mahjong Meta, players can not only participate in various matches such as Ranking, Tournaments, or Playgrounds with other real players, but they can also deploy their pets, known as \"Tama,\" equipped with customized AI strategies for automatic mahjong battles. This feature has greatly reduced the barrier for new mahjong players and Web3 users, making the gaming experience more accessible and enjoyable.</p><p>During the Open Beta period, Mahjong Meta attracted over 15,000 players who collectively participated in more than 490,000 matches, showcasing the game's immense popularity and potential in the crypto-gaming world. The integration of web3 ownership economics, innovative AI-based gameplay, and stylish graphic design proved to be a winning combination, setting the stage for an extraordinary gaming experience.</p><p>Additionally, during the Beta phase, Mahjong Meta introduced 0xMahjong and 0xTama NFTs, with a total trading volume on Opensea approaching 500ETH, further highlighting the growing interest and confidence from the community.</p><p>The game's initial success at this stage can be attributed to its experienced core team which comprises professionals from renowned gaming companies like Tencent, NetEase, Lilith, etc. Inspired by the ancient classic and beloved game Mahjong, which continues to be popular among over 600 million players worldwide, Brice, the game designer of Mahjong Meta reveals that the idea of the game comes from the inherent mathematical beauty of Riichi Mahjong, blending strategy and probability, along with its enduring appeal in strategy, social engagement, gameplay deduction, and cultural significance. Mahjong Meta embraces the \"Play to Own &amp; Skill to Earn\" philosophy, aiming to establish a blockchain-based Riichi Mahjong esports community and a Mahjong-themed gaming park, co-built with players and supported by asset ownership through blockchain and token-based economy.</p><p>The concept of Mahjong Meta, current development progress, and the platform's immense potential have attracted significant investments from prominent venture capital firms. Dragonfly and Folius led the funding round, underscoring their belief in Mahjong Meta's vision and potential in the gaming industry. Other notable investors include Meteorite Labs, Find Satoshi Lab, Parallel Ventures, and Emoote. The accumulated investment exceeds $12 million.</p><p>Upon its official launch on August 7th, Mahjong Meta unveiled all game-related features, including Ranking, Tama Master, Friends Room, and all NFT markets including Mahjong House, Tama, Fashion, Furniture, etc., offering players a more immersive game-fi experience within the ecosystem. In conjunction with the launch, Mahjong Meta will also offer additional community rewards with its vault system and additional referral rewards for players, encouraging more Mahjong enthusiasts to participate in this exciting gaming experience.</p><p>Join Mahjong Meta now as the game sets a new standard for Mahjong gaming, leveraging ownership economy from Web3 to create a real Meta for Mahjong players.</p><p>About Mahjong Meta</p><p>Mahjong Meta is a game created by former Tencent and Netease employees. With the game, they intend to nurture a community of mahjong lovers while offering a stable and secure game environment. Mahjong fans may now test their talents in novel gameplay modes and compete for potential rewards at stake.</p><p>Twitter | Website | DC</p>ContactBrice VongMahjong Metabrice@mjmeta.io"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T15:07:17.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T15:00:19.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-08T14:49:48.000Z",
    "title": "PayPal’s stablecoin has wallet freezing and wiping functions",
    "url": "https://crypto.news/paypals-stablecoin-has-wallet-freezing-and-wiping-functions/",
    "description": "An analysis of the smart contract of the just-launched PayPal stablecoin PYUSD revealed the presence of so-called &#8220;centralization attack vectors.&#8221; Smart contract security auditor Pashov pointed out in a recent Twitter thread that PYUSD&#8217;s contract has an &#8216;assetProtection&#8217; role. It&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-08T15:00:05.000Z",
    "title": "Bitcoin Miners Show Accumulation Again, Bullish Sign?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-miners-show-accumulation-again-bullish-sign/",
    "description": "On-chain data shows that Bitcoin miners have been expanding their reserves recently, a sign that could be bullish for the asset&#8217;s price. Bitcoin Miner Reserve Has Been Trending Up Recently As pointed out by an analyst in a CryptoQuant post, BTC miners have been accumulating during the past 48 days. The indicator of interest here is the &#8220;miner reserve,&#8221; which measures the total amount of Bitcoin that all miners are holding in their wallets right now. Related Reading: These Bitcoin Metrics Are At Important Retests, Will Bullish Trend Prevail? When the value of this metric goes down, it means that the miners are withdrawing coins from their wallets currently. Generally, these chain validators only transfer coins out of their reserve whenever they want to sell them, so this kind of trend can have bearish implications for the price. On the other hand, the indicator increasing in value implies the miners are adding a net amount of BTC to their wallets. Such a trend can be a sign that these investors are accumulating at the moment, and hence, can be bullish for the cryptocurrency. Now, here is a chart that shows the trend in the Bitcoin miner reserve over the last couple of months: The value of the metric has been steadily going up in recent days &#124; Source: CryptoQuant As shown in the above graph, the Bitcoin miner reserve had observed a large rise back in May, but soon after this increase, this cohort started selling as the asset&#8217;s price continued to show struggle. After the rally had taken place in June, however, the indicator&#8217;s value had stabilized, meaning that these investors were selling the same amount as they were adding to their holdings. In the last few weeks, this sideways trend has slowly turned into an uptrend, as the miners have been gradually expanding their reserves. In the past 48 days, these chain validators have added a total of around 4,060 BTC to their holdings. This amount is worth around $118 million at the current exchange rate, which isn&#8217;t a ton given the scale of the total miner reserve, but it&#8217;s still nonetheless a positive sign that the miners have been accumulating despite the cryptocurrency&#8217;s price observing some decline recently. A notable portion of this latest accumulation by the miners has come from one mining pool, AntPool, as the below chart displays. Looks like miners belonging to this pool have been accumulating &#124; Source: CryptoQuant In the past 52 days, the AntPool Bitcoin mining pool has added a total of about 1,020 BTC to their reserves, which is more than 25% of the total accumulation that all the miners have participated in during this period. Related Reading: Shiba Inu Sees 10% Pullback, But Here’s Why Rally Can Still Continue The quant has also attached the data for the exchange flows (as well the normal outflows/inflow) for this mining pool. Earlier, there was some concern around the market that these miners may have been selling as they were depositing to exchanges, but as it turned out, this cohort was merely transferring their coins back and forth from these platforms. BTC Price At the time of writing, Bitcoin is trading around $29,100, up 1% in the last week. BTC has been moving sideways recently &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-08T14:46:06.000Z",
    "title": "Circle CEO Reveals 70% of USDC Adoption Beyond US Amid PayPal’s Stablecoin Launch",
    "url": "https://www.crypto-news-flash.com/circle-ceo-reveals-70-of-usdc-adoption-beyond-us-amid-paypals-stablecoin-launch/?utm_source=rss&utm_medium=rss&utm_campaign=circle-ceo-reveals-70-of-usdc-adoption-beyond-us-amid-paypals-stablecoin-launch",
    "description": "<img width=\"1306\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/USDC_1666017094KC9UrWxcFL.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/USDC_1666017094KC9UrWxcFL.png 1306w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/USDC_1666017094KC9UrWxcFL-300x165.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/USDC_1666017094KC9UrWxcFL-1024x565.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/USDC_1666017094KC9UrWxcFL-768x423.png 768w\" sizes=\"(max-width: 1306px) 100vw, 1306px\" />Stablecoin adoption is rapidly growing in Asia, Latin America, and Africa, reflecting global demand for reliable digital currencies.  US Congressman McHenry endorses stablecoin regulation, aiming for US leadership in digital finance. Jeremy Allaire, Circle&#8217;s CEO, and co-founder, has disrupted conventional perceptions regarding the adoption pattern of USDC, unveiling that the majority of its utilization takes [...]"
  }
]