[
  {
    "source": "Cointelegraph",
    "date": "2023-06-07T14:17:07.000Z",
    "title": "Binance says it's 'different' from other exchanges amid SEC lawsuit",
    "url": "https://cointelegraph.com/news/binance-says-its-different-from-other-exchanges-amid-sec-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/7c964124-c869-4da8-8e82-615627677594.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>\"We are different than ___,\" the crypto exchange said in a statement. </p>\n                    <p><p>On June 7, cryptocurrency exchange Binance published a statement on its Chinese social channels with the hashtag #StrongTogether. Amid ongoing litigation with the United States Securities and Exchange Commission (SEC), Binance said its wallet addresses are transparent and that the exchange never \"siphoned consumers' funds\" nor has \"any collateralized borrowings.\"</p><p>Additionally, Binance said it never gave \"large donations\" to political candidates nor made \"large sponsorships\" to entertainment and media entities. A translated version of the exchange's message said:</p><blockquote>\"Our community comes from many different races, ethnicities, and beliefs; we will continue to BUILD for our users and stand up for the industry. We are different than ___. We are Binance.\"</blockquote><p>Though Binance did not specifically name the cryptocurrency exchange it is trying to differentiate from, troubled cryptocurrency exchange FTX has been accused of mismanaging consumers' assets and lending money to its sister hedge fund Alameda Research.</p><p>The exchange founder, Sam Bankman-Fried, is currently under house arrest awaiting trial on wire fraud charges. Bankman-Fried was the second-largest donor to the U.S. Democratic Party between 2020 and 2022 — alleging doing so by giving away clients' assets. </p><p>In addition, FTX was formerly the <a href=\"https://cointelegraph.com/news/miami-dade-gains-right-to-remove-ftx-name-from-heat-arena\">$135 million sponsor</a> of the Miami Heat arena. The exchange is undergoing bankruptcy proceedings, with an estimated balance sheet gap of $8 billion, and <a href=\"https://cointelegraph.com/news/irs-claiming-44b-from-ftx-bankruptcy-report\">owing an estimated $44 billion</a> to the U.S. Internal Revenue Service through its subsidiaries. </p><p>On June 5, the <a href=\"https://cointelegraph.com/news/sec-s-binance-suit-contains-heady-mix-of-predictable-charges-novel-revelations\">SEC sued Binance</a>, alleging the sale of unregistered securities to U.S. users and operating an unregistered exchange in the U.S. The lawsuit accused Binance of \"commingling\" and \"diverting\" investors' crypto and fiat funds. Data compiled by blockchain analytics firm Nansen <a href=\"https://portfolio.nansen.ai/dashboard/binance\" target=\"_blank\" rel=\"noopener nofollow\">currently shows</a> Binance has a net worth of $59 billion. </p><blockquote class=\"twitter-tweet\"><p lang=\"zh\" dir=\"ltr\">币安始终与我们的社区在一起。行业团结，共同BUILD。<a href=\"https://twitter.com/hashtag/StrongTogether?src=hash&amp;ref_src=twsrc%5Etfw\">#StrongTogether</a> <a href=\"https://twitter.com/hashtag/Binance?src=hash&amp;ref_src=twsrc%5Etfw\">#Binance</a> <a href=\"https://twitter.com/hashtag/%E5%B8%81%E5%AE%89?src=hash&amp;ref_src=twsrc%5Etfw\">#币安</a> <a href=\"https://t.co/l3q7A2rVC3\">pic.twitter.com/l3q7A2rVC3</a></p>&mdash; 币安Binance中文频道 (@binancezh) <a href=\"https://twitter.com/binancezh/status/1666400605559214080?ref_src=twsrc%5Etfw\">June 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/us-and-china-try-to-crush-binance-sbfs-40m-bribe-claim-asia-express/\">US and China try to crush Binance, SBF’s $40M bribe claim</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-07T14:18:24.000Z",
    "title": "Binance.US’ Bitcoin price shows significant divergence",
    "url": "https://cryptoslate.com/insights/binance-us-bitcoin-price-shows-significant-divergence/",
    "description": "<p>Quick Take After the SEC sued Binance on Monday, Binance users started withdrawing coins from the exchange. Late last night, the price of Bitcoin on Binance U.S. started to diverge from BTCUSD on Coinbase. Currently, the price is at $28,500, which suggests the price is up almost 5% today, while the BTCUSD price is -1.62% [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/binance-us-bitcoin-price-shows-significant-divergence/\">Binance.US&#8217; Bitcoin price shows significant divergence</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-07T14:30:00.000Z",
    "title": "Uwerx (WERX) Emerges Strong in the Crypto Market, but What's Next for DeFi Coins Maker (MKR) and Polkadot (DOT)?",
    "url": "https://cryptodaily.co.uk/2023/06/uwerx-werx-emerges-strong-in-the-crypto-market-but-whats-next-for-defi-coins-maker-mkr-and-polkadot-dot",
    "description": "<p>The crypto market appears to be rebounding, while Polkadot (DOT) and Chainlink (LINK) saw significant drops in market value in 2022. They still have a long way to go before regaining their losses from last year. If you are banking on either of these cryptocurrencies gaining value, you might consider looking for alternatives. </p>\n<p>Uwerx (WERX) has stolen the spotlight in the crypto industry and has the potential to grow into a significant cryptocurrency asset. Read on as we explore these projects one after the other. </p>\nPolkadot and the Web3 Revolution \n<p>One key distinction is Polkadot's (DOT) involvement in the visionary Web3 project, which seeks to create a decentralized, user-controlled internet. Polkadot's (DOT) design prioritizes interoperability, making it possible for several blockchains to communicate with one another without any hitches. </p>\n<p>Polkadot's (DOT) unique characteristics set it apart as a significant player in the evolving Web3 market. The rise of decentralized apps and services is changing how we interact with the internet.</p>\n<p>Polkadot (DOT) is the digital equivalent of glue, holding this idea together. It appears to be a formidable competitor in the crypto sector; however, no one can predict the future with certainty. </p>\nChainlink (LINK) Stuck? \n<p>Chainlink (LINK) is a fundamental Web2-to-Web3 data interface that allows critical off-chain data integration in blockchains. Like Polkadot (DOT), its value has decreased over time. Currently, Chainlink (LINK) is trading at $6.49, a significant decline from its high point 20 months ago. </p>\n<p>During the 2021 bull run, the project also had a considerable uptick, with Chainlink (LINK) hitting an all-time high of $52.25 at that time. However, hope is not entirely gone. Many industry experts believe that as the current market improves, Chainlink (LINK) will as well. The Proof-of-Reserves strategy is also gaining traction in the business world. </p>\n<p>However, even the most bullish analysts predict Chainlink (LINK) won't go higher than $11. That is a somewhat lower expected performance than Polkadot (DOT), with Chainlink (LINK) achieving a maximum of 60%. </p>\nThe Value of Uwerx (WERX) Soars on the Cryptocurrency Market \n<p>UWERX (WERX) is a freelancing platform that competes with large-scale traditional platforms by providing more affordable and transparent ways to work in the gig economy. According to reports, 70% of small to medium-sized organizations have used freelancers at least once. </p>\n<p>Transparent third-party audits by Interfi Network and SolidProof at prelaunch, a liquidity lock of 25 years after presale, and contract ownership renunciation on the books make this one of the safest investment choices available right now. </p>\n<p>The present presale performance demonstrates its credibility, as Presale Phase 4 exceeded expectations by selling out its allotted 77,500,000 WERX in record time. Uwerx is now in Presale Phase 5 with over 5,546 coin holders. Additionally, a test airdrop is in the works, and the newly released platform's Alpha version will bring in even more investors. </p>\n<p>In addition to its innovative features, Uwerx revealed the Uwerx Vault. This original and unique new feature is meant to optimize sustainability as well as reward and enhance user engagement. </p>\n<p>WERX is now trading at $0.041and is expected to rise to $1.03 by Q3 2023; it has also provided a 15% discount to early investors who wish to participate. Hop onboard the Uwerx train so that you may reap the rewards of the anticipated x100 growth over the coming months. </p>\n<p class=\"s10\">Presale: invest.uwerx.network</p>\n<p class=\"s10\">Telegram: https://t.me/uwerx_network</p>\n<p class=\"s10\">Twitter: https://twitter.com/uwerx_network</p>\n<p class=\"s10\">Website: https://www.uwerx.network/</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T14:29:13.000Z",
    "title": "SEC’s probe on Binance.US was initiated in 2020, recent court filings reveal",
    "url": "https://www.cryptopolitan.com/sec-probe-binance-us-was-initiated-in-2020/",
    "description": "Binance.US, the American arm of the global cryptocurrency exchange Binance, is under investigation by the U.S. Securities and Exchange Commission (SEC) for possible violations of federal securities laws. Court filings released on Tuesday revealed that the SEC has been scrutinizing Binance.US since 2020, with evidence pointing to hundreds of millions of dollars in illicit profits. ... <a title=\"SEC&#8217;s probe on Binance.US was initiated in 2020, recent court filings reveal\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-probe-binance-us-was-initiated-in-2020/\" aria-label=\"More on SEC&#8217;s probe on Binance.US was initiated in 2020, recent court filings reveal\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T14:15:37.000Z",
    "title": "Polygon Makes History: Niti-Aayog Collaborates with Zupple for Maharashtra’s Blockchain Caste Certification Pilot, Transforming E-Governance",
    "url": "https://www.crypto-news-flash.com/polygon-makes-history-niti-aayog-collaborates-with-zupple-for-maharashtras-blockchain-caste-certification-pilot-transforming-e-governance/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-makes-history-niti-aayog-collaborates-with-zupple-for-maharashtras-blockchain-caste-certification-pilot-transforming-e-governance",
    "description": "<p>NITI-Ayog, the public policy think-tank of the Indian government, is conducting a pilot test for Maharashtra&#8217;s blockchain caste certification in partnership with Web3 company Zupple. These certificates are anchored on the polygon POS blockchain, providing instant authentication through publicly auditable data. Ethereum&#8217;s Layer-2 scalability platform Polygon has been one of the most-preferred blockchain networks by [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/polygon-makes-history-niti-aayog-collaborates-with-zupple-for-maharashtras-blockchain-caste-certification-pilot-transforming-e-governance/\">Polygon Makes History: Niti-Aayog Collaborates with Zupple for Maharashtra&#8217;s Blockchain Caste Certification Pilot, Transforming E-Governance</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-07T14:25:33.000Z",
    "title": "KyberSwap Launches KyberAI",
    "url": "https://www.altcoinbuzz.io/defi/kyberswap-launches-kyberai/",
    "description": "<p>Crypto projects are successfully merging artificial intelligence (AI) with blockchain technology. And the results have been incredible. KyberSwap has launched a unique product to simplify DeFi trading for its users.  The crypto market is no doubt fast-paced and competitive. There are also a lot of hurdles that traders experience. This includes staying updated through various [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/defi/kyberswap-launches-kyberai/\">KyberSwap Launches KyberAI</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-07T14:38:00.000Z",
    "title": "Bitcoin Defies Market Turmoil, Eyes $35K Price Target",
    "url": "https://coinedition.com/bitcoin-defies-market-turmoil-eyes-35k-price-target/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Defies-Market-Turmoil-Eyes-35K-Price-Target-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin-Defies-Market-Turmoil,-Eyes-$35K-Price-Target\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Defies-Market-Turmoil-Eyes-35K-Price-Target-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Defies-Market-Turmoil-Eyes-35K-Price-Target-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Bitcoin-Defies-Market-Turmoil-Eyes-35K-Price-Target.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>According to Kaiko, Bitcoin has recovered nearly all the losses incurred during the recent market slump. The crypto market fell after reports emerged of the SEC/Binance lawsuit. However, the pioneer crypto’s liquidity on Binance remained volatile and below average. On Monday, June 5, 2023, Bitcoin’s price dropped sharply after the United States Security Exchange (SEC) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-defies-market-turmoil-eyes-35k-price-target/\">Bitcoin Defies Market Turmoil, Eyes $35K Price Target</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-07T14:30:51.000Z",
    "title": "Analyst Warns Bitcoin Flashing Big Red Signal, Forecasts Major BTC Correction",
    "url": "https://dailyhodl.com/2023/06/07/analyst-warns-bitcoin-flashing-big-red-flag-signal-predicts-major-btc-correction/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Big-Red-Flag-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Big-Red-Flag-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Big-Red-Flag-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Big-Red-Flag-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Big-Red-Flag-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Big-Red-Flag-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Big-Red-Flag-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is predicting that Bitcoin (BTC) is headed for a major correction based on a flashing bear signal. In a new video update, Nicholas Merten, the host of DataDash, tells his 511,000 YouTube subscribers that Bitcoin’s performance against the NASDAQ is weakening, indicating a downward trend for the crypto king. Merten [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/07/analyst-warns-bitcoin-flashing-big-red-flag-signal-predicts-major-btc-correction/\">Analyst Warns Bitcoin Flashing Big Red Signal, Forecasts Major BTC Correction</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]