[
  {
    "source": "Cointelegraph",
    "date": "2023-10-10T08:41:50.000Z",
    "title": "Sam Bankman-Fried just like Bernie Madoff, Cardano founder says",
    "url": "https://cointelegraph.com/news/sbf-like-madoff-cardano-founder-says-media-giving-him-free-pass",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/79562986-b6a5-4091-9571-6c6838a284d0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Charles Hoskinson likened SBF to Bernie Madoff, the mastermind behind the largest Ponzi scheme in history, and says the media is giving him a “free pass.” </p>\n                    <p><p>Cardano founder Charles Hoskinson has likened former FTX CEO Sam “SBF” Bankman-Fried to infamous American fraudster Bernie Madoff and accused the media of giving the former FTX CEO a “free pass.”</p><p>Bernard Lawrence Madoff was the mastermind behind the largest known Ponzi scam in history, estimated to be worth $64.8 billion. At one point, Madoff served as the Nasdaq stock exchange’s chairman.</p><p>Hoskinson said that the media’s attention to SBF, despite public evidence about SBF and FTX being involved in misappropriating and stealing customer funds, shows how corrupt the whole system has become.</p><p>In an X (formerly Twitter) post on Oct. 9, Hoskinson lashed out at the media frenzy around SBF after the FTX collapse. Hoskinson first called out author Michael Lewis, whose book on SBF has gained a lot of media traction just days leading up to the former FTX CEO’s trial, labeling it an “apology tour.”</p><p>The Cardano founder noted that there seems to be a “group of people who want to get a public exoneration for SBF,” <a href=\"https://x.com/IOHK_Charles/status/1711200924436172973?s=20\" target=\"_blank\" rel=\"noopener nofollow\">adding</a>:</p><blockquote>“We saw this with the kid gloves treatment by the New York Times and now a book that’s an apology tour. It’s extraordinary to me that the Bernie Madoff of my generation is getting a free pass from the media. It does show you how profoundly corrupt things have become especially if you have the right friends.”</blockquote><p>FTX was the third-largest crypto exchange at the time of its crash in November 2022, having raised a multimillion-dollar funding round in the first quarter. SBF at the time blamed external market conditions and a liquidity crunch for the downfall. However, as multiple United States enforcement agencies began investigations into the failed crypto exchange, they reflected a very different picture.</p><p>As a result of the probes, Bankman-Fried was charged with seven counts of conspiracy and fraud related to the fall of FTX, to which he has pleaded not guilty. Judge Lewis Kaplan is overseeing the case.</p><p>The <a href=\"https://cointelegraph.com/news/sbf-sam-bankman-fried-ftx-fraud-trial-second-week\">jury trial</a> began last week. Testimony during the first week of the trial showed that Alameda Research, a trading company set up by SBF before he started the FTX exchange, had a secret backdoor into FTX for funneling customers’ funds as early as 2019.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-goes-on-trial-week-review\"><strong><em>Sam Bankman-Fried goes on trial: A week in review</em></strong></a></p><p>Fresh information emerging from the criminal trial against Bankman-Fried has revealed that he lavished millions of dollars on creating an image through aggressive PR spending. The former CEO reportedly paid the likes of Tom Brady and businessman Kevin O’Leary millions of dollars to buy a few days of their time.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">“He didn’t buy a yacht, did he?”<br><br>Things SBF did buy:<br><br>$100 million naming rights to a stadium<br>$25 million Super Bowl ad<br>$55 million for Tom Brady’s time<br>$10 million for Larry David’s time<br>$300 million in luxury real estate<br>$80 million for politicians<br>$30 million for private jets</p>&mdash; H.E. Cas Piancey (@CasPiancey) <a href=\"https://twitter.com/CasPiancey/status/1710104530837549115?ref_src=twsrc%5Etfw\">October 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Other extravagances included private jets, Super Bowl ads and paying politicians. One excerpt from Lewis’ book claimed SBF was pondering paying Donald Trump $5 billion not to run for office.</p><p>The <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-goes-on-trial-week-review\">first week of the trial</a>, which began on Oct. 3, focused on the disappearance of $8 billion of FTX customer funds. In addition to testimony from Gary Wang, the first week saw both the prosecution and the defense state their arguments, as well as testimony from Adam Yedidia on Oct. 5.</p><p>Cointelegraph reporters are on the ground in New York for the trial of former FTX CEO Sam “SBF” Bankman-Fried. As the saga unfolds, <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\">check here for the latest updates</a>.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\">Blockchain detectives — Mt. Gox collapse saw the birth of Chainalysis</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-10T08:46:09.000Z",
    "title": "Crypto slumps on war news but bounce incoming",
    "url": "https://cryptodaily.co.uk/2023/10/crypto-slumps-on-war-news-but-bounce-incoming",
    "description": "The crypto market suffered quite a slump on Monday, perhaps on news of the renewed conflict between Israel and Palestine. The market is staging a recovery early on Tuesday."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-10T09:03:11.000Z",
    "title": "New research proposes off-chain computations on Bitcoin",
    "url": "https://crypto.news/new-research-proposes-off-chain-computations-on-bitcoin/",
    "description": "A new research paper titled \"BitVM: Compute Anything on Bitcoin\" proposes a novel method for executing complex computations and smart contracts on the Bitcoin network."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-10T08:46:46.000Z",
    "title": "Bullish crypto sentiment drops with the marketwide plunge",
    "url": "https://crypto.news/bullish-crypto-sentiment-drops-with-the-marketwide-plunge/",
    "description": "After a short-term bullish moment at the start of October, the crypto market has turned red again. The Israel-Palestine war might be one of the reasons for the bearish sentiment. According to the data provided by Santiment, the “bullish” trend&#8230;"
  }
]