[
  {
    "source": "Decrypt",
    "date": "2023-09-20T12:55:36.000Z",
    "title": "What is Google Bard, and Can it Compete with ChatGPT?",
    "url": "https://decrypt.co/resources/what-is-google-bard-and-can-it-compete-with-chatgpt",
    "description": "In a simple interface, a question to Bard will retrieve and display blocks of information, ChatGPT does the same but in a single text prompt."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-20T12:52:12.000Z",
    "title": "Ex-FCA Chair: UK Regulator Faced 'Political Pressure' to Welcome Crypto Firms",
    "url": "https://decrypt.co/197965/ex-fca-chair-uk-regulator-faced-political-pressure-to-welcome-crypto-firms",
    "description": "Charles Randell said that some crypto firms that the FCA was pressured to approve now face criminal investigations in the U.S."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-20T13:02:51.000Z",
    "title": "Grayscale files for new Ether Futures ETF: Official",
    "url": "https://cointelegraph.com/news/grayscale-files-for-new-ethereum-futures-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/6a70de6e-145f-4794-983d-ea29229a75dc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Grayscale debuted its first two Ethereum futures contracts in 2021, and is now planning to launch the new Grayscale Ethereum Futures Trust ETF.</p>\n                    <p><p>Digital currency investment company Grayscale is the latest firm to file for a new Ethereum futures’ exchange-traded fund (ETF) with the Securities and Exchange Commission (SEC).</p><p>Grayscale on Sept. 19 officially <a href=\"https://www.nyse.com/publicdocs/nyse/markets/nyse-arca/rule-filings/filings/2023/SR-NYSEArca-2023-63.pdf\" target=\"_blank\" rel=\"noopener nofollow\">proposed</a> to list and trade shares of the Grayscale Ethereum Futures Trust (ETH) ETF under the New York Stock Exchange (NYSE) Arca Rule 8.200-E.</p><p>The proposal is pursuant to the provisions of the Securities Exchange Act of 1934 and rule change submitted by NYSE to the SEC. The ETF is managed by Grayscale Advisors, also referred to as the “sponsor” in the filing.</p><p>“The Sponsor is in the process of becoming registered as a commodity pool operator with the Commodity Futures Trading Commission and is in the process of becoming a member of the National Futures Association,” the document reads. It also states that Grayscale Advisors has engaged Videnct Advisory as subadviser, to serve as the trust’s commodity trading adviser.</p><p>The Grayscale Ethereum Futures Trust seeks to maintain its holdings in Ether futures contracts with a “roughly constant expiration profile,” the filing reads, adding that it will “never carry futures positions all the way to cash settlement.”</p><p>The nature of the Ether futures contracts in the ETF will not require the trust to use an Ether custodian, the filing reads, adding:</p><blockquote>\"The trust will deposit an initial margin amount to initiate an open position in futures contracts. A margin deposit is like a cash performance bond. It helps assure the trader’s performance of the futures contracts that he or she purchases or sells.”</blockquote><p>The latest filing mentions that Grayscale currently offers two Ethereum futures contracts, with one representing 50 Ether and referred to as “ETH contracts”, and another contract representing 0.1 Ether and known as Micro Ether Futures, or MET contracts.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/grayscale-abandons-post-merge-pow-ethereum-tokens\"><strong><em>Grayscale officially abandons post-Merge PoW Ethereum tokens</em></strong></a></p><p>ETH contracts <a href=\"https://www.cmegroup.com/media-room/press-releases/2021/2/08/cme_group_announceslaunchofetherfutures.html\" target=\"_blank\" rel=\"noopener nofollow\">started</a> trading on the Chicago Mercantile Exchange (CME) Globex trading platform on Feb. 8, 2021 under the ticker symbol “ETH” and are cash-settled in U.S. dollars. MET contracts <a href=\"https://www.cmegroup.com/articles/2021/micro-ether-futures-frequently-asked-questions.html\" target=\"_blank\" rel=\"noopener nofollow\">began</a> trading on the CME Globex trading platform on Dec. 6, 2021 under the ticker symbol “MET” and are also cash-settled in U.S. dollars.</p><p>The news comes a few weeks after the digital asset management firm Valkyrie also <a href=\"https://cointelegraph.com/news/breaking-valkyrie-files-for-ether-futures-etf-with-the-sec\">filed for an Ether futures ETF</a> with the SEC in mid-August, following a dozen of other firms filing for ETH futures ETFs. On Aug. 17, Bloomberg reported that the <a href=\"https://cointelegraph.com/news/sec-to-approve-ethererum-eth-futures-etf\">SEC was set to allow the first ETFs</a> based on Ether futures, spurring a lot of optimism on the Ethereum market.</p><p>Last <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">month Grayscale scored </a>a major, though partial, victory against the SEC in its efforts to convert its over-the-counter Grayscale Bitcoin Trust (GBTC) into a listed Bitcoin exchange-traded fund (ETF). The SEC had rejected its GBTC application, after which Grayscale sued. The appeals court ordered that Grayscale’s petition for review be granted and the SEC’s order to deny the GBTC listing application be vacated. This victory, despite not guaranteeing the eventual listing of a Grayscale spot Bitcoin ETF, was still greeted with enthusiasm by the community.</p><p><strong><em>Magazine:</em></strong> <a href=\"https://cointelegraph.com/magazine/ethereum-is-woefully-undervalued-but-growing-more-powerful-defi-dad-hall-of-flame/\"><strong><em>DeFi Dad, Hall of Flame: Ethereum is ‘woefully undervalued’ but growing more powerful</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-20T13:00:00.000Z",
    "title": "Wormhole integrates native USDC transfers for four blockchain networks",
    "url": "https://cointelegraph.com/news/wormhole-integrates-native-usdc-transfers-blockchain-networks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/030713f2-ac49-4579-b7fe-274a4431d654.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Wormhole integrated with Circle’s Cross-Chain Transfer Protocol, allowing USDC to be sent between Ethereum, Avalanche, Arbitrum and Optimism.</p>\n                    <p><p>Wormhole has integrated Circle’s Cross-Chain Transfer Protocol (CCTP), allowing USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) to be transferred between Ethereum, Avalanche, Arbitrum and Optimism via Wormhole-based bridges, according to a Sept. 20 announcement.</p><p>The new feature is available to end-users via the Portal bridge, and developers can integrate it into their own apps using Wormhole Connect.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/b0beb73e-23a6-4402-bdf3-c78a4ed58e53.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Portal USDC bridge. Source: Portal</em></figcaption></figure><p>The Wormhole team claimed that the new integration will reduce liquidity issues and user confusion. “On these new and emerging chains, multiple versions of these bridged USDC tokens can exist,” it stated, “which can lead to fragmented liquidity, poor pricing, and a confusing experience for users and developers alike.” CCTP will help fix this problem by “creating a natively cross-chain USDC that can be burned and minted across connected chains,” it stated.</p><p>When Circle first issued USDC, it was only available on Ethereum. If a user wanted to transfer USDC to another chain, they needed to use a bridge to lock up their native USDC on Ethereum and <a href=\"https://cointelegraph.com/explained/blockchain-bridges-explained\">mint a derivative version on the other chain</a>. However, multiple bridging protocols with various derivative versions of USDC could sometimes cause confusion among end-users.</p><p>In 2021, Circle <a href=\"https://cointelegraph.com/news/stellar-becomes-new-home-of-usdc-as-integration-goes-live\">launched its stablecoin on a second chain</a>, Stellar. It continued to launch on additional chains afterward, <a href=\"https://cointelegraph.com/news/circle-launches-usdc-stablecoin-polkadot-asset-hub\">bringing the number of compatible networks to 14</a> as of Sept. 20.</p><p>But for a user to transfer native USDC from one network to another, they still needed to deposit their coins to a Circle partner’s account and then withdraw them to another network using that account. Partially because of this complexity, many users continued to use bridged versions of the coin instead of its native version.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/usdc-dai-depegged-more-than-usdt-sp-global-research\"><strong>Stablecoin depegging plagued USDC and DAI more than others: Analysts</strong></a></em></p><p>On April 26, <a href=\"https://cointelegraph.com/news/circle-launches-cross-chain-usdc-transfer-protocol-for-ethereum-avalanche\">Circle launched CCTP</a>, which is a set of smart contracts and an application programming interface (API) that can be used to burn USDC on one chain and have it be re-minted on another chain without the user needing to deposit to a Circle partner account.</p><p>At the time of its launch, CCTP only allowed transfers between Ethereum and Avalanche or vice-versa. Since then, it’s been expanded to support Optimism and Arbitrum networks as well. Circle plans to add additional networks in 2023, according to the protocol’s documents.</p><p>The Sept. 20 announcement states that CCTP has now been integrated into the Wormhole bridge interface, allowing Wormhole users to transfer native USDC between CCTP-supported chains for the first time. These networks currently include Ethereum, Optimism, Avalanche and Arbitrum.</p><p>Wormhole is not the only bridge that has implemented or intends to integrate with CCTP. Wanchan provides a similar feature, and according to Circle’s April 26 announcement, Celer, Hyperlane, LayerZero and LI.FI have also stated that they intend to implement it soon.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-20T13:00:18.000Z",
    "title": "UK passes online safety bill that stirred encryption concerns",
    "url": "https://cryptoslate.com/uk-passes-online-safety-bill-that-stirred-encryption-concerns/",
    "description": "<p>U.K.&#8217;s Online Safety Bill passed its last parliamentary reading on Sept. 19 and is ready to become law, according to a Sept. 20 statement. The bill is designed to protect children from harmful and illegal internet content. It requires social media companies to create measures to boost online freedom and safety. Per the press statement: [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/uk-passes-online-safety-bill-that-stirred-encryption-concerns/\">UK passes online safety bill that stirred encryption concerns</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-20T13:00:45.000Z",
    "title": "FTX Sues Founder Bankman-Fried’s Parents Over Millions In Gifts",
    "url": "https://cryptodaily.co.uk/2023/09/ftx-sues-founder-bankman-frieds-parents-over-millions-in-gifts",
    "description": "Bankrupt cryptocurrency exchange FTX has initiated legal proceedings against the parents of its co-founder, Sam Bankman-Fried, alleging that they misused company funds for personal gain"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-20T12:47:27.000Z",
    "title": "Algorand Foundation Announces Build-A-Bull Hackathon in collaboration with AWS",
    "url": "https://cryptodaily.co.uk/2023/09/algorand-foundation-announces-build-a-bull-hackathon-in-collaboration-with-aws",
    "description": "The Algorand Foundation, the organization focused on growing the ecosystem for the world's most advanced, secure and reliable layer-1 blockchain, announces the opening of registration for Build-A-Bull, a global virtual hackathon with $200,000 (USD) in prizes."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-20T12:54:12.000Z",
    "title": "New York regulator NYDFS introduces coin listing policy to address centralization concerns",
    "url": "https://www.cryptopolitan.com/new-york-nydfs-new-coin-listing-policy/",
    "description": "The New York Department of Financial Services (NYDFS), the regulatory body overseeing the state&#8217;s BitLicense regime, has released updated guidance for licensed digital asset entities. This guidance introduces a formalized coin-delisting policy requirement and outlines comprehensive criteria for coin listings. The move comes as regulatory scrutiny of the digital asset industry continues to evolve. Coin ... <a title=\"New York regulator NYDFS introduces coin listing policy to address centralization concerns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/new-york-nydfs-new-coin-listing-policy/\" aria-label=\"More on New York regulator NYDFS introduces coin listing policy to address centralization concerns\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-20T12:49:26.000Z",
    "title": "Deep Genomics to Showcase Cutting-Edge AI Technology at 2023 Elevate Festival",
    "url": "https://www.cryptopolitan.com/deep-genomics-to-showcase-ai-technology/",
    "description": "Toronto, September 20, 2023 &#8211; Deep Genomics, a pioneering AI-driven drug development company focused on unlocking the secrets of biology to craft life-altering medicines, is set to make a significant appearance at the 2023 Elevate Festival in Toronto. Dr. Brendan Frey, the company&#8217;s Founder and Chief Innovation Officer, will deliver a keynote presentation titled &#8220;Beacons ... <a title=\"Deep Genomics to Showcase Cutting-Edge AI Technology at 2023 Elevate Festival\" class=\"read-more\" href=\"https://www.cryptopolitan.com/deep-genomics-to-showcase-ai-technology/\" aria-label=\"More on Deep Genomics to Showcase Cutting-Edge AI Technology at 2023 Elevate Festival\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-20T13:00:00.000Z",
    "title": "Ethereum-Based Balancer Under Attack, Users Receive Warning",
    "url": "https://www.newsbtc.com/news/ethereum-based-balancer-under-attack-users-receive-warning/",
    "description": "Across their social media channels, Ethereum-based decentralized exchange (DEX) Balancer reported an attack against its front end. The platform confirmed that a Domain Name System (DNS) attack targeted the DEX, preventing users from accessing the DEX. Related Reading: Ripple Stirs Debate By Shuffling $260 Million In XRP: What’s Behind The Move? Ethereum DeFi Under Siege According to an official post, a team is investigating the DNS attack against Balancer. In the meantime, users were asked to avoid interacting with the DEX’s front end to prevent them from falling victim to the bad actors. In a DNS attack, bad actors can employ different strategies to compromise the security of a website and drain the users’ crypto wallets. Until the investigation is concluded, the team behind Balancer cannot guarantee that the attackers won’t target users. The team behind the DEX added the following, confirming the protocol’s Decentralized Autonomous Organization (DAO) involvement in resolving the current situation: The Balancer DAO is actively addressing the current DNS attack and is working with all relevant parties to ensure the full recovery of the Balancer UI. In the meantime, please DO NOT interact with http://balancer.fi or http://app.balancer.fi until further notice. Independent crypto investigator ZachXBT reported that over $238,000 had been stolen from the DEX. The investigator confirmed that the funds were sent to this Ethereum address: 0x645710Af050E26bB96e295bdfB75B4a878088d7E. Further data from Etherscan confirms that the bad actors have begun moving the funds. The individuals use Tornado Cash, another decentralized exchange, to “launder” the stolen funds to gain anonymity. Pseudonym user Defi_Hanzo was the first to report this development and the first to lose money to the hackers to confirm the DNS attack theory. As seen below, the bad actors took over the Balancer front-end and asked users to change input in the chain where they hold most of their funds. Once this transaction was completed, bad actors could drain the user’s wallet. DeFi_Hanzo asked the team behind Balancer for a refund after falling victim to the attack. DeFi’s Public Enemy Number One Balancer is just one of the many DEX or DeFi applications that have been the victim of some strategy to steal their funds. As Bitcoinist reported, hacks, scams, and other criminal activities in the nascent sector were up 75% by the end of H2 2023 compared to 2022. Bad actors stole over $650 million over that period, which has continued to rise in the coming months. Of all of the sectors in the crypto industry, DeFi has been the most affected. The different protocols and applications supported by DeFi platforms lost almost $300 million by the end of H2, 2023. The North Korean affiliate hacker group “Lazarus” has been responsible for many attacks. Related Reading: Is $10,000 Possible For XRP Price? Crypto Analysts Weigh In As of this writing, Ethereum (ETH) trades at $1,600 with sideways movement in the last 24 hours. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-20T13:00:58.000Z",
    "title": "Vara Network Births a New Era For Blockchain Gaming and DApps",
    "url": "https://www.crypto-news-flash.com/vara-network-births-a-new-era-for-blockchain-gaming-and-dapps/?utm_source=rss&utm_medium=rss&utm_campaign=vara-network-births-a-new-era-for-blockchain-gaming-and-dapps",
    "description": "<img width=\"400\" height=\"400\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/vara.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/vara.jpg 400w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/vara-300x300.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/vara-150x150.jpg 150w\" sizes=\"(max-width: 400px) 100vw, 400px\" />Introducing the Vara Network, the Layer-1 blockchain network designed with the Gear Protocol stack. Vara Network is designed to revolutionize the gaming sector with influence across all blockchain aspects. The emergence of Vara Network mainnet, an innovative stand-alone Layer-1 decentralized network built on the robust Gear Protocol is poised to make a lot of difference [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-20T13:00:28.000Z",
    "title": "Can a $75 Bet on Domini.art 20x Your Gains After Its Launch?",
    "url": "https://www.crypto-news-flash.com/can-a-75-bet-on-domini-art-20x-your-gains-after-its-launch/?utm_source=rss&utm_medium=rss&utm_campaign=can-a-75-bet-on-domini-art-20x-your-gains-after-its-launch",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-121.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-121.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-121-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-121-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-121-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-121-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The search for the next profitable cryptocurrency investment opportunity is endless. Among the myriad options, Domini.art ($DOMI) offers a lucrative investment approach and a potential ticket to substantial gains. In exploring the budding DeFi crypto list, Domini.art&#8217;s unique attributes for remarkable growth have made it take center stage in discussions in the crypto community. The [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-20T12:40:37.000Z",
    "title": "Ripple (XRP) Rich List: 478 Wallets Now Boast 5.7M+ Tokens Each",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-rich-list-478-wallets-now-boast-5-7m-tokens-each/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-xrp-rich-list-478-wallets-now-boast-5-7m-tokens-each",
    "description": "<img width=\"1280\" height=\"819\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-1024x655.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-768x491.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />XRP’s top 0.01% wallets increase to 478, each holding at least 5.7 million XRP. Number of millionaire XRP wallets drops slightly from 1,997 to 1,994. Shifts in XRP&#8217;s Aristocracy XRP, the cryptocurrency that has consistently garnered attention, is revealing some interesting patterns among its top holders. Rich-List.info, an insightful community-driven XRP Ledger (XRPL) data resource, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-20T13:01:52.000Z",
    "title": "Digital Assets and Commodity Platform SLEX Makes a Strong Showing at TOKEN2049",
    "url": "https://coinedition.com/digital-assets-and-commodity-platform-slex-makes-a-strong-showing-at-token2049/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/PR1-156.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/PR1-156.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/PR1-156-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/PR1-156-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/PR1-156-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/PR1-156-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/PR1-156-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/PR1-156-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/PR1-156-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/PR1-156-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/PR1-156-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/PR1-156-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/PR1-156-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/PR1-156-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/PR1-156-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/PR1-156-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/PR1-156-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The TOKEN2049 conference, held this year, witnessed a remarkable gathering of over 10,000 confirmed attendees. TOKEN2049, renowned as a convergence point for industry leaders spanning traditional finance, banking, digital assets, AI, and Web3, has undeniably established itself as the most eagerly anticipated event of the year within these sectors.  Among the prominent participants that graced [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/digital-assets-and-commodity-platform-slex-makes-a-strong-showing-at-token2049/\">Digital Assets and Commodity Platform SLEX Makes a Strong Showing at TOKEN2049</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-20T12:56:11.000Z",
    "title": "Litigations May Box Government Agencies Crypto Overreach: Expert",
    "url": "https://coinedition.com/litigations-may-box-government-agencies-crypto-overreach-expert/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/blockchain2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/blockchain2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/blockchain2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/blockchain2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/blockchain2-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/blockchain2-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/blockchain2-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bill Morgan, a lawyer and digital assets enthusiast, thinks Caitlin Long, the CEO of Custodia Bank, is right about certain developments in the crypto industry. Morgan believes Long was spot on on the risks posed by agencies pushing the crypto industry into litigation. According to Long, such risks could result in jurisdictional gray areas being [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/litigations-may-box-government-agencies-crypto-overreach-expert/\">Litigations May Box Government Agencies Crypto Overreach: Expert</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-20T12:49:08.000Z",
    "title": "Crypto Market Today: SOL, XRP, GAL Stand Out as Market Fails to Reach Consensus",
    "url": "https://coinedition.com/crypto-market-today-sol-xrp-gal-stand-out-as-market-fails-to-reach-consensus/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/Crypto-Market-Today-SOL-XRP-GAL-Lead-in-Terms-of-24H-Gains-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Solana (SOL), Ripple (XRP), and Galxe (GAL) emerged as some of the top performers in the market throughout the past day of trading. During this same period, the total market cap of the cryptocurrency market increased by 0.62%, according to CoinMarketCap. Despite this increase, investors were not able to reach a consensus regarding which way [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-market-today-sol-xrp-gal-stand-out-as-market-fails-to-reach-consensus/\">Crypto Market Today: SOL, XRP, GAL Stand Out as Market Fails to Reach Consensus</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-20T12:47:07.000Z",
    "title": "Cardano (ADA) Price Prediction: What to Expect in the Next 48 Hours",
    "url": "https://coinedition.com/cardano-ada-price-prediction-what-to-expect-in-the-next-48-hours/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Cardano-Price-Analysis-What-to-Expect-in-the-Next-48-Hours.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano Price Analysis: What to Expect in the Next 48 Hours\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Cardano-Price-Analysis-What-to-Expect-in-the-Next-48-Hours.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Cardano-Price-Analysis-What-to-Expect-in-the-Next-48-Hours-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Cardano-Price-Analysis-What-to-Expect-in-the-Next-48-Hours-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Cardano-Price-Analysis-What-to-Expect-in-the-Next-48-Hours-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Cardano-Price-Analysis-What-to-Expect-in-the-Next-48-Hours-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Cardano-Price-Analysis-What-to-Expect-in-the-Next-48-Hours-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In an X post published on Monday, the co-founder of Cardano (ADA), Charles Hoskinson, shared his take on the long-standing debate surrounding Ethereum’s relationship with the U.S. Securities and Exchange Commission (SEC). Hoskinson’s post was a response to renewed discussions sparked by an early advisor to the Ethereum network. In his post, Hoskinson recalled Ethereum’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/cardano-ada-price-prediction-what-to-expect-in-the-next-48-hours/\">Cardano (ADA) Price Prediction: What to Expect in the Next 48 Hours</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]