[
  {
    "source": "Cryptopolitan",
    "date": "2023-07-02T09:24:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-02T09:20:06.000Z",
    "title": "TMS Network (TMSN)’s Explosive Dream Gains, Climbs Beyond Uniswap (UNI) and Dogecoin (DOGE)",
    "url": "https://www.cryptopolitan.com/tms-network-tmsns-explosive-dream-gains-climbs-beyond-uniswap-uni-and-dogecoin-doge/",
    "description": "TMS Network (TMSN), a decentralized trading hub, has taken the crypto sphere by storm, defying expectations and ascending to unimaginable heights. For months, Uniswap (UNI) has been wobbling in technical issues while Dogecoin (DOGE) loses hype due to its lack of utility. However, TMS Network (TMSN) offers promising potential and unwavering determination to provide traders ... <a title=\"TMS Network (TMSN)&#8217;s Explosive Dream Gains, Climbs Beyond Uniswap (UNI) and Dogecoin (DOGE)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tms-network-tmsns-explosive-dream-gains-climbs-beyond-uniswap-uni-and-dogecoin-doge/\" aria-label=\"More on TMS Network (TMSN)&#8217;s Explosive Dream Gains, Climbs Beyond Uniswap (UNI) and Dogecoin (DOGE)\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-02T09:19:19.000Z",
    "title": "PolyNetwork allegedly hacked, massive transactions detected",
    "url": "https://crypto.news/polynetwork-allegedly-hacked-massive-transactions-detected/",
    "description": "PolyNetwork has allegedly been hacked again, according to PeckShield Inc., an on-chain data analytics and security company. The hackers appear to have made several transactions in huge assets on several chains. PolyNetwork assets have reportedly been hacked, and the perpetrators&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-02T09:11:50.000Z",
    "title": "Compound (COMP) Grows 33% In 7 Days As Whale Activities Soar",
    "url": "https://www.newsbtc.com/news/compound-comp-grows-33-in-7-days-as-whale-activities-soar/",
    "description": "Compound (COMP), the governance token of the Compound protocol, has experienced a remarkable surge in value over the past week, positioning itself as one of the top gainers in the cryptocurrency market. The token&#8217;s price has risen by an impressive 33% within a span of just seven days.  Whale Activity Behind Price Increase The recent surge in COMP&#8217;s price can be attributed to several factors. One significant catalyst is the presence of whale activity and potential institutional investors. Blockchain analytics firm Lookonchain shed some light on this phenomenon, revealing that a notable wallet identified as &#8216;0x0D5&#8217; has been involved in substantial transactions involving COMP.  Related reading: ENS Rises 10% As Ethereum Name Service Considers Expanding To Layer-2 The wallet transferred 3 million USDT to Binance and extracted 50,000 COMP, equivalent to around $2.26 million, just two days ago. Shortly after, the same entity withdrew an additional 120,000 COMP, valued at approximately $5.53 million, from Binance. This also followed the activities of other whales who moved significant volumes of COMP during this period. These significant transfers often indicate bullish behavior and can have an impact on the token&#8217;s supply and demand dynamics, thus influencing its price. COMP Current Price And Future Prospects The recent price surge and increased trading activity indicate growing investor interest in COMP. The token has surpassed multiple resistance levels and is currently trading above $54.68, boasting a market capitalization of $424 million.  Moreover, COMP has added over $200 million to its market cap in recent weeks, surging from less than $200 million to its current valuation. The token&#8217;s daily trading volume has also witnessed a significant surge, indicating heightened market participation. Over the past two weeks, COMP has exhibited a substantial growth pattern, recording a 70% gain. Starting last month at a low of $25 per token, COMP now commands a price of $55.01. Related Reading: Ethereum Co-Founder Thinks The Over $40 Billion Staked ETH Can Be Stolen As Compound continues to attract attention and recognition in the cryptocurrency market, the token&#8217;s future prospects appear promising. The presence of whale activity, increased market capitalization, and trading volume suggest that COMP may continue its upward trajectory. However, it is crucial to exercise caution and conduct thorough research before making any investment decisions.  The cryptocurrency market is highly volatile, and prices can fluctuate rapidly. Monitoring market conditions and staying informed about the latest developments is essential for making informed investment choices regarding COMP or any other digital asset. Despite a slight decline of 1.40% in the last 24 hours, COMP saw a growth of 0.26% in the past hour. Currently trading at $53.06 per COMP, the token is still 94.00% below its all-time high of $911.20. (This site’s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock and charts from Tradingview and Coingecko.com."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-02T09:30:21.000Z",
    "title": "Pressing Success: How Media Coverage Can Benefit Dogecoin, Shiba Inu and DogeMiyagi",
    "url": "https://www.crypto-news-flash.com/pressing-success-how-media-coverage-can-benefit-dogecoin-shiba-inu-and-dogemiyagi/?utm_source=rss&utm_medium=rss&utm_campaign=pressing-success-how-media-coverage-can-benefit-dogecoin-shiba-inu-and-dogemiyagi",
    "description": "In the years since the great reaches of technology grasped every major industry in the world, media has become a vital tool in ensuring the success of many businesses. Media has had a significant impact on the world and for businesses, it allows them to connect with their audience much easier than ever before. In [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-02T09:16:04.000Z",
    "title": "SEC Shakedown: 4 Solutions For US Crypto Investors",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/sec-shakedown-4-solutions-for-us-crypto-investors/",
    "description": "<p>Crypto is under attack in the US. And although as the saying goes “the horse is out of the barn”, the US Government and its agencies can still do LOTS of damage to the industry and American users. So today, we begin a new series. Cryptos Americans can use. The 4 solutions today anyone almost [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/sec-shakedown-4-solutions-for-us-crypto-investors/\">SEC Shakedown: 4 Solutions For US Crypto Investors</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-02T09:32:00.000Z",
    "title": "SEC Bitcoin ETF Denial Led Investors To Toxic Options Like GBTC: Winklevoss",
    "url": "https://coinedition.com/sec-bitcoin-etf-denial-led-investors-to-toxic-options-like-gbtc-winklevoss/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SEC Bitcoin ETF Denial Led Investors To Toxic Options Like GBTC: Winklevoss\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/SEC-5-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Gemini co-founder Cameron Winklevoss took to Twitter to express his frustration on the 10th anniversary of his and Tyler Winklevoss’ initial filing for a Bitcoin exchange-traded fund (ETF) with the U.S. regulator. Winklevoss argued that the Securities and Exchange Commission’s (SEC) continuous refusal to approve such products had been a disastrous outcome for U.S. investors. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sec-bitcoin-etf-denial-led-investors-to-toxic-options-like-gbtc-winklevoss/\">SEC Bitcoin ETF Denial Led Investors To Toxic Options Like GBTC: Winklevoss</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-02T09:15:50.000Z",
    "title": "Trillions of Dollars Could Flow Into Altcoin Markets As Crypto Flashes ‘Gorgeous’ Chart: Macro Guru Raoul Pal",
    "url": "https://dailyhodl.com/2023/07/02/trillions-of-dollars-could-flow-into-altcoin-markets-as-crypto-flashes-gorgeous-chart-macro-guru-raoul-pal/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/the-Crypto-Bull-Market.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/the-Crypto-Bull-Market.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/the-Crypto-Bull-Market.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/the-Crypto-Bull-Market.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/the-Crypto-Bull-Market.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/the-Crypto-Bull-Market.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/the-Crypto-Bull-Market.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Former Goldman Sachs executive Raoul Pal believes that a deluge of capital will likely flow into crypto as the altcoin markets gear up for a potential breakout. The macro guru tells his 997,100 Twitter followers that he&#8217;s keeping a close watch on TOTAL3, a chart that tracks the total market capitalization of crypto assets excluding [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/02/trillions-of-dollars-could-flow-into-altcoin-markets-as-crypto-flashes-gorgeous-chart-macro-guru-raoul-pal/\">Trillions of Dollars Could Flow Into Altcoin Markets As Crypto Flashes ‘Gorgeous’ Chart: Macro Guru Raoul Pal</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]