[
  {
    "source": "CoinDesk",
    "date": "2023-07-28T20:25:21.000Z",
    "title": "Arbitrum DAO’s First Grants Programs Take Shape",
    "url": "https://www.coindesk.com/business/2023/07/28/arbitrum-daos-first-grants-programs-take-shape/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Two governance proposals are collectively requesting nearly $5 million worth of ARB tokens to launch grants programs."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T20:25:00.000Z",
    "title": "Another week of DeFi hacks, but ZK-proof development heats up: Finance Redefined",
    "url": "https://cointelegraph.com/news/another-week-of-defi-hacks-but-zk-proof-development-heats-up-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/2e8fa968-ba61-4ece-8d69-70aac94b34eb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The total value locked in DeFi protocols remained below $50 billion after another week of exploits.</p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance/amp\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>The past week in DeFi was dominated by exploits and hacks, with three DeFi platforms losing nearly $39 million. Alphapo’s hot wallets were exploited for over $32 million, Era Lend was drained for $3.4 million, and the decentralized finance protocol Conic Finance was exploited for almost $3.5 million.</p><p>In better news, the DeFi ecosystem was buzzing with developments in zero-knowledge-proof (ZK-proof) scaling solutions as the layer-2 sector heats up despite the bear market.</p><p>The exploits and bearish market condition took their toll on DeFi protocols, with the total value locked in DeFi protocols seeing a significant drop over the past week.</p><h2>Alphapo hot wallets hacked for over $31 million</h2><p>Crypto payment platform Alphapo had roughly $31 million drained from its Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), TRON (<a href=\"https://cointelegraph.com/tron-price-index\">TRX)</a> and Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC)</a> hot wallets, security experts reported on July 22. Since the amount of Bitcoin stolen is uncertain, the figures may be even higher. </p><p>According to on-chain sleuth ZachXBT, the funds have been stolen on the Ethereum network, then swapped for ETH before being bridged to the Avalanche and Bitcoin blockchains. DeDotFi’s security team said a leak of private keys may have caused the hack. Investigations are still in progress.</p><p><a href=\"https://cointelegraph.com/news/alphapo-hot-wallets-hacked-for-over-31-million\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/alphapo-hot-wallets-hacked-for-over-31-million/amp\"><strong>Continue reading</strong></a></p><h2>Era Lend on zkSync exploited for $3.4 million in reentrancy attack</h2><p>The lending zkSync lending app, Era Lend, has been exploited for $3.4 million in crypto, according to a July 25 report from blockchain security firm CertiK. The attacker used a “read-only reentrancy attack” to drain the funds, which is an attack that interrupts a multistep process and then causes it to continue after a malicious action has been performed. Specifically, a “read-only” reentrancy does not update the state of a contract.</p><p>According to the report, the attacker drained funds in two transactions using the externally owned account 0xf1D076c9Be4533086f967e14EE6aFf204D5ECE7a. The attacker relied on a vulnerability in “the callback and _updateReserves function” to manipulate a contract into reporting old values that had not yet been updated.</p><p><a href=\"https://cointelegraph.com/news/era-lend-zksync-exploited-reentrancy-attack\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/era-lend-zksync-exploited-reentrancy-attack/amp\"><strong>Continue reading</strong></a></p><h2>Zero-knowledge tech development heats up amid bear market</h2><p>ZK-proofs are cryptographic methods allowing one party to prove to another party that something is true without revealing any sensitive underlying private information. The technology has been a hot topic of discussion among crypto veterans in recent times. On July 19, at the zkDay event — part of the Ethereum Community Conference in Paris — over 2,000 attendees arrived at a small venue by Rue l’Aubrac to catch a glimpse of the latest ZK projects on display. P0x Labs, the developer behind ZK protocol Manta Network, even <a href=\"https://cointelegraph.com/news/manta-network-developer-raises-25m-in-series-a-launches-layer-2-for-zk-apps\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/manta-network-developer-raises-25m-in-series-a-launches-layer-2-for-zk-apps/amp\">announced a $25 million raise</a> during the event. </p><p>Currently, the technology is playing a critical role in powering layer-2 scaling solutions. By computing a simple cryptographic proof on layer 2, transactions can be finalized nearly instantly, and the record is sent back to the underlying blockchain as a succinct proof. At the same time, ZK-proofs can enable private transactions that do not relay sensitive information to observers.</p><p><a href=\"https://cointelegraph.com/news/zero-knowledge-tech-development-heats-up-amid-bear-market\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/zero-knowledge-tech-development-heats-up-amid-bear-market/amp\"><strong>Continue reading</strong></a></p><h2>Optimism transaction volumes surpass Abitrum’s for the first time in six months</h2><p>The Optimism network has <a href=\"https://app.artemis.xyz/dashboard\" target=\"_blank\" rel=\"noopener nofollow\">surpassed</a> Arbitrum in transaction volume for the first time in six months, according to July 27 data from blockchain analytics platform Artemis. Both networks are Ethereum layer 2s that use optimistic rollup technology, which compresses and batches transactions before submitting them to Ethereum, potentially lowering transaction fees.</p><p>Volume on Optimism fell behind Arbitrum in January, as season one of its “quest” feature ended. However, it recovered the top spot on July 25 as Worldcoin launched.</p><p><a href=\"https://cointelegraph.com/news/optimism-transaction-volumes-surpass-abitrum-first-time-six-months\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/optimism-transaction-volumes-surpass-abitrum-first-time-six-months/amp\"><strong>Continue reading</strong></a></p><h2>DeFi market overview</h2><p>DeFi’s total market value saw a bullish surge after three bearish weeks. Data from <a href=\"https://pro.cointelegraph.com/users/sign_in?\">Cointelegraph Markets Pro</a> and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bullish week, with most tokens trading in the green. The total value locked in DeFi protocols remained below $50 billion.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/f7ef494b-39cc-4058-9b24-89ace3382903.png\"></figure><p>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T20:09:40.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting the Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Sam Bankman-Fried's lawyers are trying to seal documents related to an interview he gave The New York Times, citing a \"need to avoid\" their public dissemination. Meanwhile, the United States Senate passed a national defense bill that includes a provision targeting crypto mixers, anonymity-enhancing coins and institutions engaging in crypto trading Investments. Grayscale has penned a letter to the United States securities regulator, urging it to approve all spot Bitcoin ETF applications at the same time, to avoid any of them having a \"first mover advantage.\"</p><p>Lawyers representing former FTX CEO Sam Bankman-Fried have requested a New York District Court to seal documents related to his interviews with the New York Times. </p><p>Bankman-Fried, also known as SBF, wants the documents sealed because they reveal important details about his relationship with girlfriend-turned-business-partner Caroline Ellison. Ellison was the head of Alameda Research when SBF’s house of cards began to unravel. She <a href=\"https://cointelegraph.com/news/alameda-s-caroline-ellison-escapes-potentially-110-years-in-jail-via-plea-deal\">escaped a potential 110-year prison sentence</a> after reaching a plea deal with the State Attorney for the Sourthern District of New York.</p><p>SBF’s legal team said his interview with the New York Times could expose details about Ellison’s private journals. As such, they’ve requested Judge Lewis Kaplan file the documents under a seal to “avoid their public dissemination.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">SBF&#39;s lawyer: No objection, your Honor.<br>Judge Kaplan: Who should go first with a written submission? The government. When?<br>AUSA Sassoon: Friday or tomorrow.<br>Judge Kaplan: Friday is fine with me. Careful attention to the statute and case law</p>&mdash; Inner City Press (@innercitypress) <a href=\"https://twitter.com/innercitypress/status/1684280054753140736?ref_src=twsrc%5Etfw\">July 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>SBF is currently under a gag order that prevents him from making extrajudicial statements related to his criminal proceedings. Although Judge Kaplan is <a href=\"https://cointelegraph.com/news/sam-bankman-fried-campaign-contribution-charge-dropped-by-prosecutors\">expected to drop</a> a criminal charge of campaign finance violations, the former FTX CEO still faces 12 criminal counts. His court proceedings begin in October. </p><h3>SBF’s legal counsel requests NYT documents to be sealed</h3><h3>US Senate approves national defense bill that also targets crypto mixers</h3><p>The United States Senate passed the 2024 National Defense Authorization Act (NDAA) worth $886 billion on July 27. The bill includes a provision targeting crypto mixers, anonymity-enhancing coins and institutions engaging in crypto trading.</p><p>The NDAA is a bill that helps authorize how the country’s defense department can utilize federal funding. Within the bill, a crypto-related amendment was advanced by a group of senators, including Cynthia Lummis, Elizabeth Warren, Kirsten Gillibrand and Roger Marshall.</p><p>The amendment was created with provisions taken from the Digital Asset Anti-Money Laundering Act, which was introduced back in 2022, and the Responsible Financial Innovation Act, which aims to establish guardrails to prevent another FTX-style event from happening within the industry.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">seems pretty obvious that democrats have abandoned any stablecoin bill in favor of sneaking through this provision in the NDAA must pass bill. <br><br>anyone wanna guess what janet yellen will decide about whether KYC-less transfers of USDC are allowed? <a href=\"https://t.co/sys38GI31z\">pic.twitter.com/sys38GI31z</a></p>&mdash; Spreek (@spreekaway) <a href=\"https://twitter.com/spreekaway/status/1684610906456457235?ref_src=twsrc%5Etfw\">July 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>More specifically, the amendment will require establishing examination standards for crypto. This would help assess risk and ensure that businesses comply with related sanctions and money laundering laws.</p><p>Apart from this, it compels the U.S. Treasury Department to perform a study aimed at cracking down on anonymous crypto transactions. This includes the use of crypto mixers like Tornado Cash, which are used to make transactions private.</p><p>In 2022, the Treasury issued sanctions against the crypto mixer Tornado Cash, barring residents from using the crypto mixer. While the mixer was designed for people to anonymize their crypto transactions, it was often utilized by malicious actors to hide their ill-gotten crypto from hacks and exploits. According to the Treasury, the mixer failed to impose controls that disallow money laundering from bad actors in the space.</p><p>Meanwhile, the NDAA also includes an amendment that will require companies in the U.S. to disclose investments in China. U.S. Senator Bob Casey said that this notification is necessary for the government to understand how much “critical technology” is being transferred to “adversaries.“</p><h3>Grayscale urges SEC to approve all Bitcoin ETFs simultaneously</h3><p>Grayscale Investments is urging the Securities and Exchange Commission to <a href=\"https://cointelegraph.com/news/grayscale-sec-approve-all-bitcoin-etfs-together\">approve all the currently proposed spot Bitcoin ETFs</a> at the same time to avoid one having an advantage.</p><p>A July 27 post by Grayscale Chief Legal Officer Craig Salm said its legal team submitted a letter regarding eight spot Bitcoin ETF filings — including its own — arguing the SEC shouldn’t pick “winners and losers” and instead make a fair and orderly decision.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The SEC should approve spot <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a> ETFs to trade in the US. <br>What’s more, their previous approval of bitcoin futures ETFs shows that they are already in a position to do so. <br>Read more about the latest from our legal team: <a href=\"https://t.co/UC8ksqNcwy\">https://t.co/UC8ksqNcwy</a> <a href=\"https://twitter.com/search?q=%24GBTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$GBTC</a> <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a></p>&mdash; Grayscale (@Grayscale) <a href=\"https://twitter.com/Grayscale/status/1684681713962921986?ref_src=twsrc%5Etfw\">July 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The letter claimed the SEC could approve the spot ETFs based on its <a href=\"https://cointelegraph.com/news/grayscale-lawyers-sec-approval-volatility-shares-etf-lawsuit\">approvals for Bitcoin futures ETFs</a>, saying the two fund types are “inextricably linked.”</p><p>ETF applications currently awaiting SEC approval include those from Invesco, BlackRock, Valkyrie, VanEck, Wisdom, Fidelity and ARK Invest, which were recently updated to include SSAs with Coinbase.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-28T20:15:14.000Z",
    "title": "Stablecoin decline as ETH staking, Layer-2s see major growth in Q2 2023",
    "url": "https://cryptoslate.com/stablecoin-decline-as-eth-staking-layer-2s-see-major-growth-in-q2-2023/",
    "description": "<p>During a relatively stable second quarter, Bitcoin and Ethereum have expanded their shares to over 70% of the total cryptocurrency market capitalization for the first time since April 2021 During the same period, the recently released Crypto Market Insights Report 2023Q2 by TokenInsight indicates the crypto market saw a decrease in the total market capitalization [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/stablecoin-decline-as-eth-staking-layer-2s-see-major-growth-in-q2-2023/\">Stablecoin decline as ETH staking, Layer-2s see major growth in Q2 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T20:35:15.000Z",
    "title": "Crypto self-custody bill clears US House Committee",
    "url": "https://www.cryptopolitan.com/self-custody-bill-clears-house-committee/",
    "description": "Sailing through the legislative storms of the United States, a significant piece of legislation, the &#8220;Keep Your Coins Act of 2023,&#8221; managed to clear the House Financial Services Committee. This step marks a profound development for the digital assets industry, one that might just shake the underpinnings of crypto regulatory norms. House Committee shaping the ... <a title=\"Crypto self-custody bill clears US House Committee\" class=\"read-more\" href=\"https://www.cryptopolitan.com/self-custody-bill-clears-house-committee/\" aria-label=\"More on Crypto self-custody bill clears US House Committee\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T20:33:43.000Z",
    "title": "Japanese blockchain developer HashPort Group raises $8.5M for global expansion",
    "url": "https://www.cryptopolitan.com/hashport-raises-8-5m-for-global-expansion/",
    "description": "In a remarkable stride towards its global expansion plans amidst tough regulatory challenges, Japanese blockchain developer HashPort Group has successfully raised 1.2 billion Japanese yen (approximately $8.5 million) in a Series C funding round. The funding was led by prominent institutions such as Sumitomo Mitsui Banking Corporation, The University of Tokyo Edge Capital Partners, and ... <a title=\"Japanese blockchain developer HashPort Group raises $8.5M for global expansion\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hashport-raises-8-5m-for-global-expansion/\" aria-label=\"More on Japanese blockchain developer HashPort Group raises $8.5M for global expansion\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T20:26:06.000Z",
    "title": "Top food brands embrace NFTs for marketing",
    "url": "https://www.cryptopolitan.com/top-food-brands-embrace-nfts-for-marketing/",
    "description": "Look alive, folks! The food and beverage industry is getting a savory taste of the digital revolution, with Non-Fungible Tokens, or NFTs, as the main course. Renowned food brands have started cooking up a storm, mixing up traditional marketing with a sprinkle of this exciting, albeit complex, digital asset. NFTs are finding their way onto ... <a title=\"Top food brands embrace NFTs for marketing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-food-brands-embrace-nfts-for-marketing/\" aria-label=\"More on Top food brands embrace NFTs for marketing\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T20:19:03.000Z",
    "title": "US Senate approves $886 billion defense bill, targets crypto mixers with AML provisions",
    "url": "https://www.cryptopolitan.com/us-senate-approves-886-billion-defense-bill-targets-crypto-mixers-with-aml-provisions/",
    "description": "The United States Senate recently approved an $886 billion defense bill, a move that resonates across various sectors, including the cryptocurrency industry. The legislation, known as the National Defense Authorization Act (NDAA), includes anti-money laundering (AML) provisions targeting cryptocurrency mixers. Cryptocurrency mixers, or tumblers, are privacy tools designed to mix potentially identifiable or &#8216;tainted&#8217; cryptocurrency ... <a title=\"US Senate approves $886 billion defense bill, targets crypto mixers with AML provisions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-senate-approves-886-billion-defense-bill-targets-crypto-mixers-with-aml-provisions/\" aria-label=\"More on US Senate approves $886 billion defense bill, targets crypto mixers with AML provisions\">Read more</a>"
  }
]