[
  {
    "source": "CoinDesk",
    "date": "2023-07-06T17:20:21.000Z",
    "title": "Thank BlackRock’s Clients For Larry Fink’s Change Of Heart",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/07/thank-blackrocks-clients-for-larry-finks-change-of-heart/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BlackRock's CEO once called Bitcoin an “index of money laundering.” Now he’s changed his tune."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-06T17:30:45.000Z",
    "title": "Mawson Infrastructure Group Deploys 2,600 Bitcoin Miners at Newly Secured Pennsylvania Site",
    "url": "https://news.bitcoin.com/mawson-infrastructure-group-deploys-2600-bitcoin-miners-at-newly-secured-pennsylvania-site/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/mawsonnnnnn-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Mawson Infrastructure Group Deploys 2,600 Bitcoin Miners at Newly Secured Pennsylvania Site\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/mawsonnnnnn-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/mawsonnnnnn-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/mawsonnnnnn-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/mawsonnnnnn-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/mawsonnnnnn-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/mawsonnnnnn-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/mawsonnnnnn.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Mawson Infrastructure Group, a publicly-listed bitcoin mining operation, announced on Thursday that it has acquired a new mining site in Bellefonte, Pennsylvania. The company detailed that it has swiftly deployed 2,600 bitcoin miners at the location. Mawson Secures Pennsylvania Site, Deploys 2,600 Bitcoin Miners for Self-Mining Operations Bitcoin mining companies are experiencing ongoing expansion in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T17:18:36.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-06T17:30:39.000Z",
    "title": "Dormant Bitcoin Supply Peaks As Institutional Investors Show Increased Involvement",
    "url": "https://www.newsbtc.com/bitcoin-news/dormant-bitcoin-supply-peaks-as-institutional-investors/",
    "description": "According to recent hedge fund Ark Invest data, a historical amount of the Bitcoin supply has remained dormant for at least a year, with roughly 70% of the circulating supply unmoved in June 2023. Despite looming economic uncertainty, this dynamic occurs alongside a surge in institutional interest in the cryptocurrency.  In June, several factors contributed to the increased robustness of the Bitcoin price action. Ark Invest, a renowned asset management firm, highlighted this trend in its recent Bitcoin report. Their data sheds light on the risen support from steadfast holders and a noticeable shift in institutional sentiment towards Bitcoin. Bitcoin Holder Base Strength According to Ark Invest&#8217;s analysis, around 70% of Bitcoin&#8217;s circulating supply has not changed hands for at least one year. This statistic signifies an increase in the confidence of long-term Bitcoin investors, contributing to a sturdier holder base.  As seen in the chart below, there has been a spike in Over-the-Counter Transactions (OTC) that hint at growing institutional demand. A one-year high was seen in the balance of BTC held on over-the-counter (OTC) trading desks, typically used as a gauge for institutional activity. The 60% increase in the OTC Bitcoin balance by quarter-end insinuates that institutions and capital allocators are concentrating more on Bitcoin as an investment avenue. The report stated the following: In our view, increased balances on OTC desks suggest that institutions and other large capital allocators are focused increasingly on bitcoin. Meanwhile, diverging trends were noted between USDC and Tether, two prominent stablecoins. While USDC&#8217;s supply shrunk by 37% year-to-date, Tether&#8217;s supply increased by 25%, hitting a record high in June. Ark Invest attributes this divergence to the uncertain U.S. regulatory climate, which might drive some crypto activity overseas. Rising Institutional Activity Amid Market Dynamics An interesting development in June was the Grayscale Bitcoin Trust (GBTC) discount reduction went from 42% to 30% following BlackRock&#8217;s Bitcoin spot Exchange Traded Fund (ETF) filing. According to Ark Invest&#8217;s report, this lower discount implies market anticipation for a Bitcoin spot ETF approval, subsequently enhancing the possibility of GBTC transitioning into an ETF. Ark Invest&#8217;s report cautioned about potential economic challenges despite these positive indications. According to the Purchasing Managers &#8216; Index, manufacturing sector data suggests a plunge in new orders. Concurrently, the U.S. Gross Domestic Income (GDI) shows signs of contraction, indicating the possibility of an impending recession. BTC is trading above $30,000, following its recovery from last month when its value dipped below that. The asset&#8217;s downturn was largely spurred by a legal challenge launched by the U.S. Securities and Exchange Commission (SEC) against Binance and Coinbase, the two foremost crypto exchanges. Related Reading: Analyst’s Forecast: Bitcoin (BTC) To Hit $310,000 If This Happens Nonetheless, Bitcoin&#8217;s recent rally comes on the heels of endorsement from heavyweight financial institutions such as BlackRock. This embrace of the digital currency market has injected a dose of optimism, driving Bitcoin&#8217;s substantial growth. Related Reading: Bitcoin Could Soar To $140,000 In Next Bull Cycle, Crypto Analysis Channel Yesterday, the asset reclaimed its $31,000 mark. However, over the past 24 hours, BTC has retraced and currently trades for $30,400 at the time of writing. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T17:32:11.000Z",
    "title": "Pepe, Binance Coin, and Innovative Altcoin Poised for an Incoming Rally – Time to Load Up?",
    "url": "https://www.crypto-news-flash.com/pepe-binance-coin-and-innovative-altcoin-poised-for-an-incoming-rally-time-to-load-up/?utm_source=rss&utm_medium=rss&utm_campaign=pepe-binance-coin-and-innovative-altcoin-poised-for-an-incoming-rally-time-to-load-up",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/crypto-gc4755b4a5_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/crypto-gc4755b4a5_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/crypto-gc4755b4a5_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/crypto-gc4755b4a5_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/crypto-gc4755b4a5_1920-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />A crypto analyst makes short-term predictions for BNB, MATIC, PEPE, and other altcoins.  According to him, BNB has enough capacity to stage a rally from its current price to hit between $300 to $350. The past few days have been an incredible period for some altcoins including Binance coin (BNB), Solana (SOL), and polygon (MATIC). [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T17:21:15.000Z",
    "title": "Breaking News: Terraform Labs Advances LUNC/USTC Swaps with Pull Request Integration on TerraSwap",
    "url": "https://www.crypto-news-flash.com/breaking-news-terraform-labs-advances-lunc-ustc-swaps-with-pull-request-integration-on-terraswap/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-news-terraform-labs-advances-lunc-ustc-swaps-with-pull-request-integration-on-terraswap",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"The long-awaited LUNC/USTC swaps may soon be available on TerraSwap, which would be great for the Terra Classic (LUNC) community.\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-1536x864.png 1536w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />Terraform Labs has taken the initiative and is working on the Pull Request (PR) required for simple integration. The LUNCBurnArmy has further confirmed that the merging process is currently in progress. The long-awaited LUNC/USTC swaps may soon be available on TerraSwap, which would be great for the Terra Classic (LUNC) community. Terraform Labs has taken [...]"
  }
]