[
  {
    "source": "Decrypt",
    "date": "2023-08-31T08:01:02.000Z",
    "title": "Airline Giant Lufthansa Launches NFT Loyalty Program on Polygon",
    "url": "https://decrypt.co/154390/lufthansa-airline-travel-nft-polygon-uptrip",
    "description": "Lufthansa’s Uptrip loyalty program offers special perks for passengers who collect sets of NFT-based trading cards."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-31T08:00:00.000Z",
    "title": "Cambridge Bitcoin Electricity Consumption Index updated to reflect hardware distribution and hashrate increases",
    "url": "https://cointelegraph.com/news/cambridge-bitcoin-electricity-consumption-index-revised",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/dff77503-406c-4e71-8481-d198f7727b36.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cambridge researchers revise the widely-cited index in response to evidence indicating periodic overestimation of Bitcoin mining’s electricity consumption. </p>\n                    <p><p>Researchers behind the well-known Cambridge Bitcoin Electricity Consumption Index (<a href=\"https://ccaf.io/cbnsi/cbeci\" target=\"_blank\" rel=\"noopener nofollow\">CBECI</a>) have officially revised its methodology to enhance the accuracy and reliability of the Index’s estimates for the first time since its inception in 2019.</p><p>The CBECI was launched in July 2019 in an effort to provide reliable data-driven insights to questions about Bitcoin mining’s energy-intensive nature and associated environmental impact. </p><p>Speaking exclusively to Cointelegraph ahead of announcement of the revision, head researcher Alexander Neumueller unpacked the Index’s role in providing a relatively accurate estimate of the Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) network’s electricity consumption and contextualizing the data in a way that is digestible for the layman on the street.</p><p>Key takeaways from the revised methodology included a focus on recent developments in <a href=\"https://cointelegraph.com/tags/bitcoin-mining\">Bitcoin mining</a> hardware and hash rate and whether the CBECI was accurately reflecting the changing landscape. The researchers honed in on questions around what had driven substantial increases in hash rate in recent years as newer mining equipment eclipsed older models in computing power.</p><p><a href=\"https://cointelegraph.com/news/nuclear-and-gas-fastest-growing-energy-sources-for-bitcoin-mining-data\"><strong><em>Related: Nuclear and gas fastest growing energy sources for Bitcoin mining: Data</em></strong></a></p><p>Neumueller and his fellow researchers noted that the scarcity of hardware-related data posed a significant challenge as it limited the CBECI’s ability to accurately assess the types of hardware that miners use as well as their ubiquity. </p><p>This led the researchers to previously create a methodology that simulates a daily hardware distribution based on performance and power usage data of real hardware. Neumeuller notes that the backbone of the previous CBECI methodology assumed that every profitable hardware model released less than five years ago equally fuelled the total network hashrate.</p><p>This in turn led to a “disproportionally large number” of older mining hardware compared to newer models in the methodology’s assumed hardware distribution during exceptionally profitable mining periods.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/nvidia-iris-energy-buys-nvidia-gpus-worth-10-m-for-generative-ai\">Iris Energy buys 248 Nvidia GPUs worth $10M for generative AI and Bitcoin mining</a></em></strong></p><p>The researchers subsequently discovered that more recently released equipment appeared to be underrepresented while equipment nearing the end of its life cycle was overrepresented. This prompted the change in the CBECI methodology.</p><p>Neumeller then explained how his team began comparing hashrate increases with United States import data reflecting recent Bitcoin mining hardware deliveries. This was combined with an examination of publicly available sales data from mining hardware manufacturer Canaan.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/54854590-a8e1-41d1-89c0-84e48b64ec86.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>CBECI looked at U.S. import records on Bitcoin mining equipment (left) and estimated computing power derived from import data (right). Researchers used the hash rate (in TH/s) and gross weight stated by the manufacturer and applied an equally weighted mix of the following models from Canaan’s Avalon A1246, Avalon A1266, Avalon A1346 and Avalon A1366.</em></figcaption></figure><p>The analysis, which considered a number of in-depth factors, was used to test the hypothesis that increases in network hash rate can be attributed to more recently released mining hardware.</p><blockquote>“This hypothesis was based on U.S. import data, and we sought additional evidence to validate it. If Canaan's sales data is representative of the industry, it corroborates this claim.”</blockquote><p>Neumueller highlighted a divide in opinion, with critics suggesting that Bitcoin “jeopardizes environmental advancements and could exacerbate climate change,” while supporters argue that the mining industry could combat climate change and provide other societal benefits. </p><blockquote>“However, the intricate nature of the industry and the lack of information are often under-recognised, making room for cherry-picked data points and biased perspectives.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/0bdf98c4-5da5-4b6a-a314-1f7b8f3cc6b1.png\"  /></figure><p>The CBECI includes a wide range of rich data points and visualizations, including the index’s Bitcoin network power demand, a mining map reflecting the geographic distribution of Bitcoin’s mining hash rate as well as a greenhouse gas emissions index. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f54075a4-b29c-4136-ab0e-409a2163fc66.png\"  /></figure><p>The CBECI and greenhouse gas emissions indexes provide three different estimates for both sectors, providing a hypothetical range for these specific metrics. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/cambridge-bitcoin-electricity-consumption-index-revised&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><em><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/recursive-inscriptions-bitcoin-supercomputer-defi-aws-possible/\">Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon</a></strong></em></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-31T07:59:42.000Z",
    "title": "Binance scouts art for Pierre Gasly’s F1 helmet at Abu Dhabi GP",
    "url": "https://cointelegraph.com/news/binance-pierre-gasly-f1-helmet-art-abu-dhabi-gp",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/886a3c97-5c7d-4e89-aa11-38593f399887.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance announced a helmet design competition to shortlist the winning art, which will be used as the helmet artwork of Gasly, who was the winner of the 2020 Italian Grand Prix.</p>\n                    <p><p>The winner of a new art competition hosted by Binance will see their design featured on the helmet of the racing driver Pierre Gasly from the Alpine Formula One team during the Abu Dhabi Grand Prix, slated for Nov. 26, 2023.</p><p>Crypto exchange Binance announced a helmet design competition to shortlist the winning art, which will be used as the helmet artwork of Gasly, who was the winner of the 2020 Italian Grand Prix.</p><p>Gasly described the collaboration with Binance as an opportunity “to engage with both the F1 and crypto communities in a creative and innovative way.” Participants need not be Binance users, opening up the floor to non-crypto F1 fans as well. The last date for submitting helmet designs is on Sept. 8 and the winner will be declared by Sept. 15.</p><p>According to the crypto exchange, helmet designs that reflect Binance’s values and innovative ethos while engaging the motorsport community stand the greatest chance of winning the contest. Gasly stated:</p><blockquote>“I can’t wait to show off the winning design that will showcase our shared innovative spirit that will accompany me in the race at the prestigious Abu Dhabi Grand Prix.”</blockquote><p>The winner will also receive a replica helmet personally signed by Gasly. Binance has also partnered with other influential celebrities such as soccer legend Cristiano Ronaldo and leading football clubs to help improve fan engagement. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-excludes-banco-de-venezuela-from-p2p-payments\"><strong><em>Binance excludes Banco de Venezuela from P2P payments</em></strong></a></p><p>Amid massive regulatory hurdles that grip Binance, the crypto exchange continues to collaborate with A-list celebrities to maintain relevance among crypto investors. </p><p>On Aug. 21, Binance revealed a <a href=\"https://www.binance.com/en-AU/blog/nft/the-weeknd-to-perform-in-australia-powered-by-binance-3698700940859320081\" target=\"_blank\" rel=\"noopener nofollow\">partnership</a> with legendary singer The Weekend, to facilitate a Web3-powered concert tour — After Hours Til Dawn.</p><p>Fans in Australia will be offered two <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a> — Souvenir NFTs and Tour NFTs — that would allow for new avenues of engagement with The Weekend. As part of the deal, Binance committed to donating $2 million to The Weeknd’s XO Humanitarian Fund.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\">How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-31T08:01:19.000Z",
    "title": "Worldcoin Registers Record Single-Day Sign-Ups In Argentina",
    "url": "https://cryptodaily.co.uk/2023/08/worldcoin-registers-record-single-day-sign-ups-in-argentina",
    "description": "Worldcoin reported that an astonishing 9500 users had completed the verification process for World ID, a significant surge in demand."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-31T07:57:36.000Z",
    "title": "Legal Thunder: Uniswap Case Judge Declares Ethereum a Commodity, Holds Reins in Coinbase Showdown – Can ETH Price Reach $2,500?",
    "url": "https://www.crypto-news-flash.com/legal-thunder-uniswap-case-judge-declares-ethereum-a-commodity-holds-reins-in-coinbase-showdown-can-eth-price-reach-2500/",
    "description": "<img width=\"1201\" height=\"601\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Uniswap\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card.png 1201w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card-300x150.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card-1024x512.png 1024w\" sizes=\"(max-width: 1201px) 100vw, 1201px\" />Judge Katherine Polk Failla declares Ethereum and Bitcoin as &#8220;crypto commodities&#8221; while dismissing the Uniswap lawsuit, offering a definitive stance in the ongoing SEC vs. CFTC jurisdiction battle. Ethereum experiences a 4% price surge, with a single whale purchasing 8,000 ETH at $1,708. In a move that has sent shockwaves through the cryptocurrency community, United [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-31T07:53:55.000Z",
    "title": "TOP 3 Coins That Gained Most In August’s 3rd Week",
    "url": "https://www.altcoinbuzz.io/spotlight/top-3-coins-that-gained-most-in-augusts-3rd-week/",
    "description": "<p>August was a pretty busy month for the entire crypto market. Bitcoin and Ethereum struggled to maintain a stable price. Each week featured a new set of cryptocurrencies that enjoyed the bulk of attention and investors’ interest. In this article, we’ll show three coins that were the top winners during the 3rd week of August. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/spotlight/top-3-coins-that-gained-most-in-augusts-3rd-week/\">TOP 3 Coins That Gained Most In August’s 3rd Week</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]