[
  {
    "source": "CoinDesk",
    "date": "2023-07-26T16:00:00.000Z",
    "title": "Crypto Must Take Fraud Prevention Seriously: Crypto Long & Short",
    "url": "https://www.coindesk.com/policy/2023/07/26/crypto-must-take-fraud-prevention-seriously-crypto-long-short/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Countries that enable regulatory technology while avoiding reliance on legacy bureaucratic approaches will be a breakaway leader in cryptocurrencies."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-26T16:00:00.000Z",
    "title": "A Wall Street (Crypto) Analyst’s Take on ChainLink: Crypto Long & Short",
    "url": "https://www.coindesk.com/business/2023/07/26/a-wall-street-crypto-analysts-take-on-chainlink-crypto-long-short/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "If the LINK token were a stock, here’s what an analyst might say."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-26T16:00:49.000Z",
    "title": "Long-term holders seem unfazed by Bitcoin’s dip to $29K",
    "url": "https://cryptoslate.com/long-term-holders-seem-unfazed-by-bitcoins-dip-to-29k/",
    "description": "<p>The recent drop in Bitcoin&#8217;s price to $29,200 has sparked significant liquidations, with the market witnessing nearly $50 million in realized losses, most coming from short-term holders. The behavior of long-term holders (LTH) and short-term holders (STH) is crucial to understanding market dynamics. LTHs are those who have held their Bitcoin for more than 155 days, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/long-term-holders-seem-unfazed-by-bitcoins-dip-to-29k/\">Long-term holders seem unfazed by Bitcoin’s dip to $29K</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-26T15:58:19.000Z",
    "title": "Worldcoin Paid Hong Kong Onboarders $60, But Paid Test Subjects in Indonesia $15",
    "url": "https://cryptobriefing.com/worldcoin-paid-hk-onboarders-60/?utm_source=feed&utm_medium=rss",
    "description": "ChatGPT creator Sam Altmans cryptocurrency venture, Worldcoin, is stirring up more controversy as it reveals stark discrepancies in user payouts, according to a South China Morning Post report. Hong Kong..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T16:01:14.000Z",
    "title": "Maximize Your Earnings: How Golden Cask Club’s (GCC) New Cryptocurrency Outperforms Fantom (FTM) and EOS (EOS) with Fine Wine and Spirits Investments",
    "url": "https://www.cryptopolitan.com/maximize-your-earnings-how-golden-cask-clubs-gcc-new-cryptocurrency-outperforms-fantom-ftm-and-eos-eos-with-fine-wine-and-spirits-investments/",
    "description": "Alternative investments have been on the rise around the globe, promising stable returns to investors in times of inflation. Fine wine and spirits, in particular, have been attracting investor interest, and now, they have made their way into crypto through the Golden Cask Club (GCC).&#160; This article discusses the potential of Golden Cask Club (GCC) ... <a title=\"Maximize Your Earnings: How Golden Cask Club&#8217;s (GCC) New Cryptocurrency Outperforms Fantom (FTM) and EOS (EOS) with Fine Wine and Spirits Investments\" class=\"read-more\" href=\"https://www.cryptopolitan.com/maximize-your-earnings-how-golden-cask-clubs-gcc-new-cryptocurrency-outperforms-fantom-ftm-and-eos-eos-with-fine-wine-and-spirits-investments/\" aria-label=\"More on Maximize Your Earnings: How Golden Cask Club&#8217;s (GCC) New Cryptocurrency Outperforms Fantom (FTM) and EOS (EOS) with Fine Wine and Spirits Investments\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T16:01:02.000Z",
    "title": "KuCoin Token (KCS) Isn’t as Appealing as VC Spectra (SPCT) or Optimism (OP) – Here’s Why Investors Think So",
    "url": "https://www.cryptopolitan.com/kucoin-token-kcs-isnt-as-appealing-as-vc-spectra-spct-or-optimism-op-heres-why-investors-think-so/",
    "description": "While KuCoin (KCS) seeks to enhance its security features through KYC authentication, VC Spectra (SPCT) and Optimism (OP) have been gaining traction with their unique propositions and positive market indicators. VC Spectra (SPCT) has garnered investors&#8217; attention with its remarkable achievement in the seed private sale, raising an impressive $2.4 million within a mere two ... <a title=\"KuCoin Token (KCS) Isn’t as Appealing as VC Spectra (SPCT) or Optimism (OP) &#8211; Here’s Why Investors Think So\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kucoin-token-kcs-isnt-as-appealing-as-vc-spectra-spct-or-optimism-op-heres-why-investors-think-so/\" aria-label=\"More on KuCoin Token (KCS) Isn’t as Appealing as VC Spectra (SPCT) or Optimism (OP) &#8211; Here’s Why Investors Think So\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T15:58:20.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T15:44:51.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-26T16:00:40.000Z",
    "title": "Maker (MKR) Shows Positive Moves As Top Coins Land In The Red",
    "url": "https://www.newsbtc.com/analysis/mkr/maker-mkr-shows-positive-moves-as-top-coins-land-in-the-red/",
    "description": "MakerDAO’s (MKR) posted positive moves today even as the broader market saw a slight correction. While top coins painted charts red with bearish moves, MKR added over 3% in the last 24 hours, bringing its price to $1,139.92 at 9:25 am EST. This bullish momentum coming amid a bear market trend suggests that special factors might be behind it.  Maker (MKR) Soars Amid New Governance Proposals Maker made the top gainers’ list on Wednesday, July 26, closely behind Compound (COMP) with 3.18% 24-hour price growth and XDC Network with an over 16% seven-day gain.  Related Reading: Litecoin Bulls Barrel Back Toward $92 Level – Will They Succeed? Maker’s price saw a boost due to increased ecosystem activities as the Maker Governance votes to approve or reject the new Spark Protocol changes commence. This vote was a result of Phoenix Labs&#8217; proposed key adjustments to Spark Protocol DAI market parameters to enhance user experience.  Among Phoenix Labs’ recommendations is the adjustment Wrapped Ether (WETH) Variable Rate Slope from 1% to 3%. This adjustment is touted to encourage a healthy utilization of the DAI market, enhancing supplier return and incentivizing deposits.  It also proposed to set the DAI market loan-to-value and liquidation threshold (LTV/LT) to 0.01% and adjust the WETH market reserve factor to 5%. The adjustments will reduce the protocol fee on the ETH market and give suppliers a larger APY.  If approved, the proposed changes will raise Spark D3M&#8217;s debt ceiling to 200 million DAI and set DAI Market LTV/LT to zero. Given the potential benefits these changes could provide DAI borrowers, market activity would increase, boosting MKR’s demand as the Maker protocol utility token. The voting started on July 24 and has attracted much attention from Maker community members. Maker&#8217;s trading activity has increased as community members hurry to participate in the poll before the deadline on Thursday, July 27. Moreover, as the governance token of the Maker protocol and MakerDAO, the ongoing poll has increased trading activity and demand for MKR. The increased MKR trading volume confirms this assumption. Whale Alerts Draw More Investor Attention To Maker As of July 26—9:25 EST, MKR’s trading volume stood at $121.71 million, an over 47% rise from the previous day’s value, according to CoinMarketCap data. MKR traded at a high of $1,172.12 and a low of $1,118.93 over the past 24 hours.  Lookonchain also observed a significant exchange inflow and outflow on July 25. According to the on-chain sleuth, a whale dumped 1,598 MKR, worth approximately $1.8 million, after amassing chunks of tokens since June 22, when prices were below $1,000. The whale withdrew 2,760 MKR, approximately $2.5 million, from Binance from July 7 to July 17 at an average value of $918 per token and discharged them when the price increased. Related Reading: Binance Coin (BNB) Price Poised For A Major Breakout – Which Way Will It Go? While the whale effect pushed MKR&#8217;s price down 2%, it also reflected the massive investor interest in the token and drew more attention to MKR. As such, the token soared higher in the days following the transaction and continued bullish with the governance vote. This demonstrates the high demand for the token given that it soaked up the supply from the whale without issue. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-26T16:05:39.000Z",
    "title": "Tokenizing Real-World Assets: Ripple’s Role in Unleashing the Potential and Influence of Carbon Credits as Financial Instruments",
    "url": "https://www.crypto-news-flash.com/tokenizing-real-world-assets-ripples-role-in-unleashing-the-potential-and-influence-of-carbon-credits-as-financial-instruments/?utm_source=rss&utm_medium=rss&utm_campaign=tokenizing-real-world-assets-ripples-role-in-unleashing-the-potential-and-influence-of-carbon-credits-as-financial-instruments",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T145500.196.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T145500.196.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T145500.196-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-19T145500.196-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ripple invests $100 million into the carbon markets for carbon credit removal and support projects and strategic partnerships. This is part of its plan of going carbon neutral by 2030, interestingly, this can be achieved before the targeted period.  Tokenized Real World Assets (RWA) are predicted to have an estimated value of $16T by 2030 [...]"
  }
]