[
  {
    "source": "CoinDesk",
    "date": "2023-07-25T23:00:00.000Z",
    "title": "Mashinsky's Arrest, Ripple Ruling, Etc.",
    "url": "https://www.coindesk.com/policy/2023/07/25/mashinskys-arrest-ripple-ruling-etc/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "I was on vacation for the last week-and-a-half but before I left, I sent a list of things to watch for to my colleagues that in hindsight, was wholly inadequate. Anyway, here's my effort to catch up."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-25T22:41:12.000Z",
    "title": "You Can Earn Bitcoin for Walking Around Major Cities—Here's How",
    "url": "https://decrypt.co/150026/you-can-earn-bitcoin-walking-around-major-cities-heres-how",
    "description": "The sMiles app's new location-based \"Bitcoinverse\" game offers another way to earn Bitcoin rewards beyond racking up steps and shopping."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-25T21:32:00.000Z",
    "title": "Bitcoin Whales Moved Nearly $60 Million In Five Days",
    "url": "https://decrypt.co/150027/bitcoin-whales-moved-nearly-60-million-in-five-days",
    "description": "More than 2,000 BTC are on the move after years of inactivity. "
  },
  {
    "source": "Decrypt",
    "date": "2023-07-25T21:28:28.000Z",
    "title": "EDX Markets Crypto Exchange Taps Talos to Broaden Reach",
    "url": "https://decrypt.co/150025/edx-markets-talos-trading-wall-street-banks-crypto-trading",
    "description": "The exchange, which began trading last month, seeks to bring more liquidity to market for its clients."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T21:40:00.000Z",
    "title": "Trademark attorney predicts legal fights ahead with Twitter’s rebrand to X",
    "url": "https://cointelegraph.com/news/trademark-attorney-predicts-legal-fights-ahead-twitter-rebrand-x",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/ce61b96f-49e1-432e-871b-5714d42def98.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to Josh Gerben, the social media platform could be embroiled in lawsuits over its “X” branding for years, costing upward of millions of dollars. </p>\n                    <p><p>Josh Gerben, a trademark attorney with Gerben Intellectual Property, has suggested the company formerly known as Twitter could spend upward of $100 million in dealing with litigation as a result of the X rebranding.</p><p>In a July 25 X thread, Gerben <a href=\"https://twitter.com/JoshGerben/status/1683917707152875525\" target=\"_blank\" rel=\"noopener nofollow\">predicted</a> that lawsuits against X related to trademark infringement could appear in United States courtrooms “in the next few weeks,” with legal problems on the international stage likely to be a “very big issue” for years. U.S.-based companies including Microsoft and Meta already own similar “X\" trademarks for different products and services, and many others may have grounds for a lawsuit against X.</p><p>“To cast aside an asset this valuable [the blue bird] in favor of a new trademark is unprecedented in history,” said Gerben. “If Elon had stuck with the Twitter brand, his company would likely not spend a dime to justify its Twitter trademark on just about anything he wanted to do with the brand.”</p><p>Former Twitter CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/elon-musk-and-crypto-twitter\">Elon Musk</a> announced the rebranding <a href=\"https://cointelegraph.com/news/twitter-bluebird-elon-musk-rebrands-x\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/twitter-bluebird-elon-musk-rebrands-x/amp\">would be taking place</a> on July 23, with the company’s iconic blue bird being replaced by a black and white “X” logo. X Corp is the parent company of Twitter, established by Musk in March. The platform’s search bar still bears its former namesake at the time of publication, as does the blue “tweet\" button and retweet counter. </p><p>Many on the platform have criticized the rebranding as not well thought out. Musk himself was <a href=\"https://twitter.com/elonmusk/status/1683369794760761345\" target=\"_blank\" rel=\"noopener nofollow\">unable</a> to provide a definitive answer as to the new name of a retweet in a July 24 thread. He has also <a href=\"https://cointelegraph.com/news/elon-musk-says-x-will-offer-an-entire-financial-world-in-the-coming-months\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/elon-musk-says-x-will-offer-an-entire-financial-world-in-the-coming-months/amp\">hinted that users</a> should expect to conduct their “entire financial world” on the X platform with plans to offer services affecting “half of the global financial system.”</p><p>The move is the latest controversy by one of the biggest social media platforms in the world. Musk took over Twitter in October 2022 following a $44 billion agreement, later firing members of the company’s executive team and phasing out the platform’s legacy verification system — blue checkmarks — in favor of various paid options. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/elon-musk-dogecoin-price-twitter-x-rebrand\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/elon-musk-dogecoin-price-twitter-x-rebrand/amp\"><strong><em>Reading the Elon Musk ‘tea leaves’ — Is Dogecoin coming for Twitter?</em></strong></a></p><p>Though Musk briefly <a href=\"https://cointelegraph.com/news/elon-musk-changes-twitter-icon-to-doge-after-seeking-lawsuit-dismissal\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/elon-musk-changes-twitter-icon-to-doge-after-seeking-lawsuit-dismissal/amp\">changed the Twitter logo</a> to that of the Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) shiba inu in April, many on the platform speculated at the time that the decision was only temporary. For the rebranding to X, the company’s logo on its brick-and-mortar headquarters in San Francisco may soon change from a bird to a letter:</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">After 17 years with the iconic blue bird logo, billionaire Elon Musk had the Twitter sign removed from the San Francisco, California headquarters as the social media company rebrands to X. <a href=\"https://t.co/ZJdgeOV3uV\" data-amp=\"https://www-cbsnews-com.cdn.ampproject.org/c/s/www.cbsnews.com/amp/news/twitter-trademark-x-com-rebrand/\">https://t.co/ZJdgeOV3uV</a> <a href=\"https://t.co/UIie1S5T1j\">pic.twitter.com/UIie1S5T1j</a></p>— CBS News (@CBSNews) <a href=\"https://twitter.com/CBSNews/status/1683922568997134345?ref_src=twsrc%5Etfw\">July 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Under Musk, U.S. advertising revenue for Twitter reportedly <a href=\"https://www.nytimes.com/2023/06/05/technology/twitter-ad-sales-musk.html\" target=\"_blank\" rel=\"noopener nofollow\">dropped</a> roughly 59% from April to May compared to that over the same period in 2022. Former NBCUniversal exec Linda Yaccarino <a href=\"https://cointelegraph.com/news/nbcuniversal-veteran-could-replace-elon-musk-as-twitter-ceo-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/nbcuniversal-veteran-could-replace-elon-musk-as-twitter-ceo-report/amp\">took over as CEO</a> in May, while Musk continues to actively post on the social media site.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/musk-hints-suing-microsoft-us-rep-wants-gensler-fired-a-hodlers-digest-april-16-22/\"><strong><em>Musk hints at suing Microsoft, US Rep. wants Gensler fired, and more: Hodler’s Digest, April 16-22</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T21:30:00.000Z",
    "title": "Researcher envisions smart education system built with blockchain, DAOs, NFTs and AI",
    "url": "https://cointelegraph.com/news/researcher-envisions-smart-education-system-built-on-blockchain-dao-nft-and-ai",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/b461cb93-3bbc-4316-beb2-0e0cb242f3e2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to the research, combining the technologies will result in 12 distinct advantages over the traditional educational system. </p>\n                    <p><p>Mehmet Fırat, a researcher at Anadolu University in Turkey, recently <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4515129\" target=\"_blank\" rel=\"noopener nofollow\">published</a> research envisioning a multi-tech solution to the problems challenging the traditional educational system called the “Smart Open Education Ecosystem” (SOEE).</p><p>The research combines blockchain, decentralized autonomous organizations (DAOs), nonfungible tokens (NFTs), multimodal learning analytics and artificial intelligence (AI) to form a self-contained educational ecosystem.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/4ecacefc-31a0-4468-b9d1-5eca2205e171.jpg\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>The interconnected learning system, screenshot. Source: Fırat</em></figcaption></figure><p>Per a research paper authored by Fırat and published on July 25, “Equity, fair opportunity, and access issues can be considered among the most significant handicaps of education in today's world.”</p><p>Fırat proposes an “open education” system running a blockchain that uses generative AI systems such as ChatGPT or the like to interface with students and personalize learning experiences. Lessons, learning resources and credentials would be crafted as NFTs, and the entire process would be governed by a DAO.</p><p>According to Firat, the ultimate goal of open education is not just to democratize learning and make education accessible, but also to provide personalized learning experiences for everyone. Per the research paper: </p><blockquote>“Even if the systems we have seen [as] examples of open universities and other structures support this philosophy and approach, they are far from this common goal because they have not yet been able to integrate artificial intelligence, blockchain and big data.”</blockquote><p>While Fırat’s research isn’t the first endeavor to <a href=\"https://theconversation.com/how-blockchain-could-help-the-world-meet-the-uns-global-goals-in-higher-education-152885\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://theconversation-com.cdn.ampproject.org/c/s/theconversation.com/amp/how-blockchain-could-help-the-world-meet-the-uns-global-goals-in-higher-education-152885\">explore</a> open education on the blockchain, it is among the most ambitious. According to the paper, “the convergence of these technologies can […] pave the way for singularity in education.” Fırat adds that “this could be the first social organization of humanity to reach singularity.\"</p><p>In the technological sense, a singularity is a paradigm wherein technology exceeds the capacity of its creators to control its evolution. An educational singularity based on technological convergence would, <a href=\"https://www.researchgate.net/publication/344900363_Transformation_of_the_Educational_Ecosystem_in_the_Singularity_Environment\" target=\"_blank\" rel=\"noopener nofollow\">theoretically</a>, be the point where lifelong free education becomes universal. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/universities-use-blockchain-based-storage-to-protect-and-democratize-data\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/universities-use-blockchain-based-storage-to-protect-and-democratize-data/amp\"><strong><em>Universities use blockchain-based storage to protect and democratize data</em></strong></a></p><p>“Before this distant goal,” however, writes Fırat, “there will be 12 main benefits of the SOEE.” These benefits include accessibility, personalization, education quality, security and transparency, democratic governance, intellectual property and content value, global cooperation and integration, equality and equal opportunity, reusability of educational resources, preservation and promotion of cultural and linguistic diversity, innovation and experimental learning in education, and support for student success and career planning. </p><p>According to Fırat, the potential benefits of SOEE merit further investigation by educational stakeholders and policymakers. </p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T21:20:20.000Z",
    "title": "OpenAI creator launches Worldcoin",
    "url": "https://cointelegraph.com/news/openai-creator-launches-worldcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/cf51a213-795c-4196-ac72-fead46bca516.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>On this week’s episode of “The Market Report,\" Cointelegraph’s resident expert discusses the launch of the Worldcoin token by OpenAI creator Sam Altman and why it's controversial.</p>\n                    <p><p>In the latest episode of <em>The Market Report</em>, analyst and writer Marcel Pechman discusses the <a href=\"https://cointelegraph.com/news/worldcoin-launch-raises-eyebrows-as-wld-price-notches-a-double-digit-gain\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/worldcoin-launch-raises-eyebrows-as-wld-price-notches-a-double-digit-gain/amp\">Worldcoin token launch</a>, why it is controversial, and the differences between it and most altcoins. According to the analysis, investors should take time to understand the project before even considering an investment.</p><p>Looking at the tokenomics of the Worldcoin token, launched on July 24, there are two absolute outliers. Firstly, the extremely high volume overtook the market cap, as the token reportedly traded 1.6 times its entire capitalization in the first 24 hours. How’s that even possible?</p><p>According to Pechman, one must understand that the project has lent 100 million tokens to market makers. Only 8 million coins were handed out to users, who may or may not have flipped their positions, but this does not justify the $400 million reported volume.</p><p>Now, on to the second part of the story, which Pechman finds even more concerning. Some 40% of the tokens will be unlocked between July 2024 and July 2025, and that’s 500x more than the 8 million currently awarded to users via airdrop.</p><p>Ultimately, to maintain a market capitalization below Chainlink, for example, at $4 billion, the Worldcoin token price in July 2025 would have to be below $1, or 58% below the current level.</p><p>That’s a huge risk for traders who are trying to capture 20% gains in the short term, given that there’s a huge amount of tokens from venture capitalists that paid much lower prices.</p><p>Now, on to the show’s next topic: Pechman explores the <a href=\"https://cointelegraph.com/news/deribit-bitcoin-btc-price-volatility-record-low\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/deribit-bitcoin-btc-price-volatility-record-low/amp\">Deribit Bitcoin volatility index</a>, which reached its lowest level in two years. According to some analysts, that indicates a possible lack of price turbulence for Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) in the near future. But there’s a catch here, according to Pechman, as he does not believe the most likely outcome is lateral movement for Bitcoin.</p><p>Want to know the rationale behind Pechman’s counterintuitive reading for the volatility indicator and how to position in this situation? Get those answers in the latest <em>The Market Report</em>, a show that runs exclusively on the new <a href=\"https://www.youtube.com/@cointelegraphmarketresearch\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets & Research</a> YouTube channel.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/Q4ADNqO5698\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-25T23:00:44.000Z",
    "title": "US Accountability Office says regulators need ‘coordination mechanism’ to tackle crypto oversight",
    "url": "https://cryptoslate.com/us-accountability-office-says-regulators-need-coordination-mechanism-to-tackle-crypto-oversight/",
    "description": "<p>The U.S. Accountability Office (GAO) believes significant regulatory gaps in the crypto industry — specifically related to spot cryptocurrency markets and stablecoins — need to be addressed via a government-wide approach before they become a risk to financial stability. The watchdog said in a report titled &#8220;Blockchain in Finance&#8221; that blockchain technology offers significant improvements [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/us-accountability-office-says-regulators-need-coordination-mechanism-to-tackle-crypto-oversight/\">US Accountability Office says regulators need ‘coordination mechanism’ to tackle crypto oversight</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-25T22:18:00.000Z",
    "title": "New $XRP Price Prediction Suggests Retail Investors May Soon Be Priced Out",
    "url": "https://www.cryptoglobe.com/latest/2023/07/new-xrp-price-prediction-suggests-retail-investors-may-soon-be-priced-out/",
    "description": "Popular cryptocurrency personality and Treasury Management professional Shannon Thorp has recently voiced her opinion on the various $XRP price predictions that have been made over time, arguing the cryptocurrency’s current affordability may be fleeting, due to a potential surge in value as it gains acceptance among institutional investors. Acknowledging the speculative nature of the digital […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-25T22:00:54.000Z",
    "title": "Putin Signs Digital Ruble Law Allowing CBDC Payments in Russia",
    "url": "https://news.bitcoin.com/putin-signs-digital-ruble-law-allowing-cbdc-payments-in-russia/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2329478001-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2329478001-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2329478001-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2329478001-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2329478001-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2329478001-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2329478001-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2329478001-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />President Vladimir Putin has signed into law a bill on the introduction of the digital ruble in the Russian Federation. The new legislation, which legalizes and regulates the use of Bank of Russia’s digital currency for payments and other transactions, will enter into force on Aug. 1. President Putin Greenlights Law Introducing Digital Ruble as [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T23:03:34.000Z",
    "title": "HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?",
    "url": "https://www.cryptopolitan.com/hbar-price-prediction/",
    "description": "HBAR Price Prediction 2023-2032 Hedera Hashgraph is a trending cryptocurrency focused on providing a sustainable, enterprise-grade blockchain.&#160; The asset has been performing extremely well recently, prompting investors everywhere to search for a Hedera Hashgraph price prediction. So that is a heads-up in crypto winter despite the doom which tends to pull everyone else connected to ... <a title=\"HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hbar-price-prediction/\" aria-label=\"More on HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T22:12:25.000Z",
    "title": "Filecoin Price Prediction 2023-2032: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2023-2032 How much is Filecoin (FIL) worth? The live Filecoin price today is $4.38 USD with a 24-hour trading volume of $114,276,875 USD. Filecoin is down 2.82% in the last 24 hours. The current CoinMarketCap ranking is #30, with a live market cap of USD 1,918,829,715. It has a circulating supply of ... <a title=\"Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/filecoin-price-prediction/\" aria-label=\"More on Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T21:37:59.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T23:00:00.000Z",
    "title": "Crypto Analyst Says It’s Time To Buy Dogecoin, Here’s Why",
    "url": "https://www.newsbtc.com/news/dogecoin/analyst-says-its-time-to-buy-dogecoin/",
    "description": "Dogecoin remains one of the popular coins despite the crypto bear market and its resilience has seen it garner a significant following. And now, after a long and stretched-out downtrend, a crypto analyst has sounded the buy alarm for the meme coin, giving reasons for this. Time To Buy Dogecoin? According to a crypto analyst known as Kaleo on Twitter, Dogecoin’s current range is a good place to buy. The reasoning for this revolves around expectations that billionaire Elon Musk will integrate the meme coin as a payment method for Twitter. Related Reading: Ethereum Whale Transfers To Exchanges Suggest More Selling Pressure For ETH This comes after the billionaire recently incorporated the infamous DOGE logo on his Twitter profile, placing it next to X, the new symbol for the social media platform. And as Kaleo points out, “There’s a solid chance he actually does something this time though, and him including it in his bio at the same time as the X rebrand isn’t just a coincidence.” However, the analyst also points to the fact that this may not be a completely smooth ride for the altcoin. For example, Kaleo explains that Dogecoin’s current rally could reach a cool-off period where it falls in line with the general crypto market trend. But he added that it would be a good idea to “accumulate on any dips we get from here.” DOGE surges 9% to $0.077 &#124; Source: DOGEUSD on Tradingview.com What Happens To DOGE If It Is A Payment Method On Twitter? Dogecoin becoming a payment method on the Twitter platform (now X) has been long-awaited by not just the DOGE community but the broader crypto market. This is because such an integration will give the cryptocurrency its most significant use case to date, while also exposing it to the hundreds of millions of users of the social media platform. Historically, whenever Elon Musk has tweeted about the meme coin, it has led to a rapid increase in price. So it is expected that such an announcement of Dogecoin being a verified payment method on Twitter will lead to an at least 100% rally for the digital asset. Related Reading: Bullish Signal: Whales Accumulate Massive Amounts Of ARB If DOGE were to be integrated as an accepted form of payment on Twitter, it is possible that the price of the meme coin will rally toward $0.2. However, “it’ll happen fast, and the entire timeline will say it was obvious in retrospect,” Kaleo explains. For now, DOGE’s price is still trending at  $0.077, a 9% increase from its Monday price, according to data from Coinmarketcap. Nevertheless, DOGE remains the 7th-largest cryptocurrency with a market cap of $10.89 billion. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-25T22:01:42.000Z",
    "title": "Eye-Scanning Worldcoin (WLD) Project To Face Inquiry From UK Watchdog: Report",
    "url": "https://dailyhodl.com/2023/07/25/eye-scanning-worldcoin-wld-project-to-face-inquiry-from-uk-watchdog-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/08/eye-on-crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/08/eye-on-crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/08/eye-on-crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/08/eye-on-crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/08/eye-on-crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/08/eye-on-crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/08/eye-on-crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto project co-founded by OpenAI&#8217;s Sam Altman will face an inquiry from a UK data watchdog. According to a new Reuters report, Britain&#8217;s data regulator says it will examine Worldcoin (WLD), a crypto ID project that utilizes iris scanners to verify users&#8217; identities. &#8220;We note the launch of WorldCoin in the UK and will be [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/25/eye-scanning-worldcoin-wld-project-to-face-inquiry-from-uk-watchdog-report/\">Eye-Scanning Worldcoin (WLD) Project To Face Inquiry From UK Watchdog: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]