[
  {
    "source": "CryptoSlate",
    "date": "2023-05-29T11:46:30.000Z",
    "title": "Buoyant weekend price action sees Bitcoin recapture $27,000: CryptoSlate wMarket Update",
    "url": "https://cryptoslate.com/buoyant-weekend-price-action-sees-bitcoin-recapture-27000-cryptoslate-wmarket-update/",
    "description": "<p>Since last Friday&#8217;s wMarket report, the cryptocurrency market saw net inflows of $47.2 billion and currently stands at $1.16 trillion — up 4.2% from $1.12 trillion. Over the weekend, the market caps of Bitcoin (BTC) and Ethereum (ETH) grew 5.5% and 5% to $540.34 billion and $228.76 billion, respectively. Over the last 24 hours, all [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/buoyant-weekend-price-action-sees-bitcoin-recapture-27000-cryptoslate-wmarket-update/\">Buoyant weekend price action sees Bitcoin recapture $27,000: CryptoSlate wMarket Update</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-29T12:00:00.000Z",
    "title": "Crypto AI narrative is the strongest right now",
    "url": "https://cryptodaily.co.uk/2023/05/crypto-ai-narrative-is-the-strongest-right-now",
    "description": "<p>As the crypto bull market sputters into action one niche that looks strong right now is crypto AI.</p>\nBitcoin makes it possible\n<p>Bitcoin has broken out of its slow grind to the downside, and positive price action saw the king of the cryptocurrencies correcting back to the upside from last Thursday, culminating in a strong green candle on Sunday that took bitcoin back above $28,000.</p>\n<p>While bitcoin has been doing its part in regaining lost momentum for the crypto sector, a certain niche within crypto looks to be the one to lead the rest into the next crypto bull market - economic factors allowing.</p>\nAI is a strong crypto niche\n<p>This is the niche of artificial intelligence (AI). Obviously, in the traditional financial world outside of crypto, AI is just about the strongest narrative there is, with the likes of ChatGPT becoming even more powerful, and other competitors now coming into the AI field.</p>\n<p>Artificial intelligence has its own niche within crypto with the likes of data marketplaces, graphic rendering, and the utilisation of global computing power providing compelling use cases.</p>\n<p>The crypto sector has already experienced how AI can drive the industry forward, given that from early January it did just that by hugely outperforming all other niches in crypto.</p>\n<p>The likes of SingularityNET (AGIX), Fetch.ai (FET), and Ocean (OCEAN) made gains of 1400%, 575%, and 400% respectively from the beginning of 2023, and made those gains in only around five weeks. Render (RNDR) is another cryptocurrency that is becoming a giant in the AI niche, putting on 445% for the same period, but increasing that to 635% from early March until now.</p>\nAI crypto coins with potential to go much higher\n<p>There are various other AI coins in the niche that are also primed to break out and potentially storm higher over the next few weeks and months, as long as sufficient liquidity remains in the crypto sector.</p>\n<p>Matrix AI (MAN) put on nearly 1300% since mid November of 2022, and following a 76% correction it looks primed to move higher again. MAN broke through a trend line going back to mid March earlier today. It has since come back to retest this line so it will be interesting to see if it now moves higher.</p>\n<p>Artificial Liquid Intelligence (ALI) was another powerfully thrusting AI crypto and gains of 1230% were an excellent return for only five weeks. A deep, nearly 85% correction followed, and now ALI has woken up and has broken up through the downward trendline in force since its top in early February this year. A retest of the trendline has already taken place and ALI has seen a cross up from the bottom on the large weekly timeframe of the Stochastic RSI momentum indicator. This coin may have the potential to go much higher now.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-29T11:45:00.000Z",
    "title": "DWF Labs Commits Seven-Figure Investment to Outer Ring MMO: A New Era of Gaming Begins",
    "url": "https://cryptodaily.co.uk/2023/05/dwf-labs-commits-seven-figure-investment-to-outer-ring-mmo-a-new-era-of-gaming-begins",
    "description": "<p>In an exciting development, DWF Labs has pledged long-term financial support to the Outer Ring MMO, injecting a substantial seven-figure investment. This strategic funding infusion will accelerate the development of their groundbreaking video game and propel the growth of their immersive blockchain ecosystem. Prepare for an exhilarating 3rd-person shooter MMORPG experience like never before.⁣</p>\n<p>Having already raised an impressive $15M in 2022, Outer Ring MMO continues to forge ahead with their ambitious plans to create a massively multiplayer online game (MMO) enriched with a tokenized layer. Boasting a dedicated team of over 250 talented individuals, they are now poised to expand into a flourishing ecosystem centered around the $GQ token. The timing of this long-term financial support couldn't be better, coinciding with the eagerly anticipated Early Access Pre-Alpha playable on June 28th.⁣</p>\n<p></p>\n<p>Daniel Vald&eacute;s, CEO of Maniac Panda Games, expressed his gratitude and excitement, stating, \"It is a pleasure and a privilege to have the DWF Labs team working around the $GQ ecosystem and lending their expertise and capital to the development of Outer Ring MMO.\"⁣</p>\n<p>Outer Ring MMO's Dapp already incorporates a wide array of impressive features. Their Decentralized Exchange empowers players to stake $GQ and in-game tokens, unlocking rewards through various yield farming methods. Additionally, the team has successfully developed their own NFT Marketplace and recently concluded two rounds of NFT Lands auctions, generating over $300K in volume.&nbsp;</p>\n<p>With the support of DWF Labs, Outer Ring MMO will further fortify its growing ecosystem, attracting new players and introducing them to the numerous advantages of blockchain technology.⁣</p>\n<p>About Outer Ring MMO</p>\n<p>Outer Ring MMO is an immersive 3rd-person sci-fi action MMORPG for PC. Powered by Unreal Engine 5 and set across a vast universe, players embark on an epic journey spanning galaxies to explore new worlds, unravel ancient mysteries, and confront the perils of deep space.⁣</p>\n<p>Over 300 talented game developers work together at Maniac Panda Games, one of Europe's largest game studios with its headquarters in Spain. Their mission is to transport players to a new dimension of gaming by offering an exciting selection of titles, ranging from arcade and racing games to action-adventure genres, along with innovative web3-powered experiences.</p>\n<p>Outer Ring Links:⁣</p>\n<p>Dapp: https://dapp.outerringmmo.com</p>\n<p>Web: https://outerringmmo.com</p>\n<p>Twitter: @outerringmmo⁣</p>\n<p>Instagram: @outerringmmo⁣</p>\n<p>Youtube: @outerringmmo⁣</p>\n<p>Discord: https://discord.com/invite/outerringmmo⁣</p>\n<p>Telegram EN group: https://t.me/outerringocialeng⁣</p>\n<p>Contact:⁣</p>\n<p>Marketing Department&nbsp;</p>\n<p>marketing@nexxyolabs.com</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T11:55:53.000Z",
    "title": "TMS Network (TMSN) Delivering 2000% Gains: Aptos (APT) and Shiba Inu (SHIB) Battle to Keep Up",
    "url": "https://www.cryptopolitan.com/tms-network-tmsn-delivering-2000-gains-aptos-apt-and-shiba-inu-shib-battle-to-keep-up/",
    "description": "Historically, popular crypto projects like Shiba Inu (SHIB)-themed tokens and scalable networks Aptos (APT) entered the limelight for their&#160;huge potential as a blue chip investment. However,&#160;TMS Network (TMSN)&#160;has taken the spotlight with the allure of its astronomical gains. Even Aptos (APT) and Shiba Inu (SHIB) are locked in a fierce battle, desperately striving to match ... <a title=\"TMS Network (TMSN) Delivering 2000% Gains: Aptos (APT) and Shiba Inu (SHIB) Battle to Keep Up\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tms-network-tmsn-delivering-2000-gains-aptos-apt-and-shiba-inu-shib-battle-to-keep-up/\" aria-label=\"More on TMS Network (TMSN) Delivering 2000% Gains: Aptos (APT) and Shiba Inu (SHIB) Battle to Keep Up\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-29T11:53:53.000Z",
    "title": "There are now nearly 10 million holders of Reddit NFTs",
    "url": "https://crypto.news/there-are-now-nearly-10-million-holders-of-reddit-nfts/",
    "description": "Dune Analytics data shows that nearly 10m users own \"Reddit NFTs\" on Polygon, an Ethereum sidechain"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-29T12:00:10.000Z",
    "title": "HedgeUp (HDUP) Offers Biggest Presale ROI, Here’s why Cosmos (ATOM) and Uniswap (UNI) Whales are Flocking",
    "url": "https://www.crypto-news-flash.com/hedgeup-hdup-offers-biggest-presale-roi-heres-why-cosmos-atom-and-uniswap-uni-whales-are-flocking/?utm_source=rss&utm_medium=rss&utm_campaign=hedgeup-hdup-offers-biggest-presale-roi-heres-why-cosmos-atom-and-uniswap-uni-whales-are-flocking",
    "description": "<p>In the crypto world, the initial presale phase often offers a peek into a token&#8217;s future performance. HedgeUp&#8217;s (HDUP) presale recently became a hot topic among crypto enthusiasts, mainly due to its potential for colossal returns on investment (ROI). Cosmos (ATOM) and Uniswap (UNI) investors, colloquially known as whales, seem to be making a beeline [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/hedgeup-hdup-offers-biggest-presale-roi-heres-why-cosmos-atom-and-uniswap-uni-whales-are-flocking/\">HedgeUp (HDUP) Offers Biggest Presale ROI, Here&#8217;s why Cosmos (ATOM) and Uniswap (UNI) Whales are Flocking</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-29T11:50:38.000Z",
    "title": "Monero and Dash Competitor ZCash Restructures to Lead Privacy Coin Race, Battling CBDCs and Governments Worldwide",
    "url": "https://www.crypto-news-flash.com/monero-and-dash-competitor-zcash-restructures-to-lead-privacy-coin-race-battling-cbdcs-and-governments-worldwide/?utm_source=rss&utm_medium=rss&utm_campaign=monero-and-dash-competitor-zcash-restructures-to-lead-privacy-coin-race-battling-cbdcs-and-governments-worldwide",
    "description": "<p>The team behind the ZCash protocol is restructuring the startup. The rebranded firm will be focused on realigning its core missions including building a secure system for everyone&#8217;s use. ZCash development team Electric Coin Co. (ECC) has announced plans to restructure the organization to ensure that it is still aligned with the mission of the [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/monero-and-dash-competitor-zcash-restructures-to-lead-privacy-coin-race-battling-cbdcs-and-governments-worldwide/\">Monero and Dash Competitor ZCash Restructures to Lead Privacy Coin Race, Battling CBDCs and Governments Worldwide</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-29T11:39:45.000Z",
    "title": "Solana (SOL) And Cardano (ADA) Continue To Plummet In 2023, While Tradecurve Expected To Grow 100x",
    "url": "https://www.crypto-news-flash.com/solana-sol-and-cardano-ada-continue-to-plummet-in-2023-while-tradecurve-expected-to-grow-100x/?utm_source=rss&utm_medium=rss&utm_campaign=solana-sol-and-cardano-ada-continue-to-plummet-in-2023-while-tradecurve-expected-to-grow-100x",
    "description": "<p>Although 2023 brought some respite to the crypto market, Solana (SOL) and Cardano (ADA) have not been able to perform well, and have succumbed to the prevailing bearish market conditions.  On the contrary, a new crypto project, Tradecurve, has won investors’ trust with its gravity-defying presale growth. Even experts have predicted that this platform will [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/solana-sol-and-cardano-ada-continue-to-plummet-in-2023-while-tradecurve-expected-to-grow-100x/\">Solana (SOL) And Cardano (ADA) Continue To Plummet In 2023, While Tradecurve Expected To Grow 100x</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-29T12:03:30.000Z",
    "title": "Bitcoin Surges After Hong Kong’s Retail Trading Launch: Crypto Analysts",
    "url": "https://coinedition.com/bitcoin-surges-after-hong-kongs-retail-trading-launch-crypto-analysts/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/WHY-Bitcoin-And-Global-Markets-Are-About-to-SURGE-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/WHY-Bitcoin-And-Global-Markets-Are-About-to-SURGE-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/WHY-Bitcoin-And-Global-Markets-Are-About-to-SURGE-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/WHY-Bitcoin-And-Global-Markets-Are-About-to-SURGE-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/WHY-Bitcoin-And-Global-Markets-Are-About-to-SURGE-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/WHY-Bitcoin-And-Global-Markets-Are-About-to-SURGE-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/WHY-Bitcoin-And-Global-Markets-Are-About-to-SURGE.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a recent interview, Crypto Banter founder Ran Neuner sat with crypto analyst Sheldon the Sniper to discuss the spike in Bitcoin&#8217;s price. The duo highlighted the recent announcement made by Hong Kong&#8217;s Securities and Futures Commission, which unveiled plans to permit retail investors to trade select crypto assets from June 1. According to Neuner, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-surges-after-hong-kongs-retail-trading-launch-crypto-analysts/\">Bitcoin Surges After Hong Kong&#8217;s Retail Trading Launch: Crypto Analysts</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-29T11:43:19.000Z",
    "title": "XRP Price Prediction: What to Expect in the Next 48 Hours",
    "url": "https://coinedition.com/xrp-price-prediction-what-to-expect-in-the-next-48-hours/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/01/XRP-Price-Prediction-What-To-Expect-in-the-Next-48-Hours.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The ongoing XRP SEC case has been the subject of intense speculation and conjecture, especially when it comes to the potential for an XRP settlement. However, recent statements made by legal expert Jeremy Hogan and Ripple CEO Brad Garlinghouse have added an additional layer of complexity to the already intriguing situation, leaving observers of the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-price-prediction-what-to-expect-in-the-next-48-hours/\">XRP Price Prediction: What to Expect in the Next 48 Hours</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-29T11:45:07.000Z",
    "title": "Solana (SOL) Could See Massive Upside in the Future, According to VanEck Digital Assets Research",
    "url": "https://dailyhodl.com/2023/05/29/solana-sol-could-see-massive-upside-in-the-future-according-to-vaneck-digital-assets-research/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/solana-whale-moves-secures.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/solana-whale-moves-secures.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/solana-whale-moves-secures.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/solana-whale-moves-secures.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/solana-whale-moves-secures.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/solana-whale-moves-secures.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/solana-whale-moves-secures.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ethereum (ETH) rival Solana (SOL) has huge upside potential if certain conditions are met, according to VanEck&#8217;s digital asset research department. Last week, VanEck released a research report detailing its forecast for the price of Ethereum in 2030. VanEck based its forecast, which places ETH at $51,000 in its &#8220;bull case,&#8221; on the thesis that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/29/solana-sol-could-see-massive-upside-in-the-future-according-to-vaneck-digital-assets-research/\">Solana (SOL) Could See Massive Upside in the Future, According to VanEck Digital Assets Research</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]