[
  {
    "source": "Decrypt",
    "date": "2023-12-20T22:01:02.000Z",
    "title": "Saga Blockchain Launches ‘Play-to-Airdrop’ Game Tournaments—Here's How to Earn",
    "url": "https://decrypt.co/210472/saga-blockchain-launches-play-airdrop-game-tournaments-heres-how-earn",
    "description": "The Saga Protocol airdrop is coming. Players can earn a share of SAGA tokens by performing well in crypto game competitions."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-20T22:00:39.000Z",
    "title": "EU intensifies clampdown on Russian crypto executives with new sanctions",
    "url": "https://cryptoslate.com/eu-intensifies-clampdown-on-russian-crypto-executives-with-new-sanctions/",
    "description": "<p>Earlier this week, the EU announced new sanctions against Russian nationals leading cryptocurrency firms and projects. The relevant section of the new sanctions list, published on Dec. 18, reads: &#8221; &#8230; Today’s decision includes a ban on Russian nationals from owning, controlling or holding any posts on the governing bodies of the legal persons, entities [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/eu-intensifies-clampdown-on-russian-crypto-executives-with-new-sanctions/\">EU intensifies clampdown on Russian crypto executives with new sanctions</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-20T21:46:02.000Z",
    "title": "China focuses on Crypto development, brings 50,000 developers to its state-run blockchain",
    "url": "https://cryptobriefing.com/china-focuses-on-crypto-development-brings-50000-developers-to-its-state-run-blockchain/?utm_source=feed&utm_medium=rss",
    "description": "China's push aids web3 goals yet centers power with state; concerns persist around digital yuan despite tech giant and developer momentum."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T21:56:51.000Z",
    "title": "UK is planning a crypto revolution – But will it succeed?",
    "url": "https://www.cryptopolitan.com/uk-is-planning-a-crypto-revolution/",
    "description": "The United Kingdom stands on the cusp of a bold adventure, eyeing a seismic shift in the financial world with its ambitious plan to become a global hub for the crypto industry. This isn&#8217;t just about adopting new technology; it&#8217;s about reshaping the financial landscape, where traditional securities and cutting-edge digital innovations collide. But as [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-20T22:00:51.000Z",
    "title": "Ethereum Exchange Balances Drop Drastically, What This Means For ETH Price",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-exchange-eth-price/",
    "description": "Ethereum is currently ranging around $2,200, with its price undergoing a calm volatility in the past 7 days. New data from Santiment has revealed the current sentiment among Ethereum whale addresses, as the total supply on exchanges recently hit a new low. According to the on-chain analytics platform, more than 240,000 ETH have left 10 of the biggest ETH exchange wallets in the past 24 hours.  As a result, the cumulative number of ETH deposited across crypto exchanges dropped from 8.03 million ETH to 7.79 million ETH in a single day, one of the largest it has ever seen. With the current price of ETH hovering around $2,200, this represents a drop of over $528 million worth of ETH in exchange balances.  Ethereum Exchange Supply Plummets Ethereum is currently down by 1.74% in the past 24 hours and is currently retesting its breakout level of around $2,200 which seems to have turned into a support. However, the drastic drop in Ethereum balances on exchanges is a very bullish sign for ETH. With less ETH available on exchanges, supply is reduced. Related Reading: Institutional Investors Increase Bitcoin Appetite Ahead Of Spot ETF, Report Shows ETH whales have been on a buying spree since the beginning of the month, as many look forward to an extended bull run at the dawn of the new year. Data from IntoTheBlock put a 98.52% increase in exchange outflow volume in the past 30 days. Just last week alone, whales bought more than 100,000 ETH worth $230 million.  This sentiment continued into this week, with 240,000 ETH leaving exchanges in 24 hours, leading to a 2.99% drop in coins held on exchanges. According to Santiment, only 8.07% of Ethereum&#8217;s total supply currently sits on exchanges, the lowest it has ever been.   👍 As #Ethereum&#8216;s market value hangs just above $2,170, the largest exchange wallets continue to move coins into smaller wallets or off exchanges entirely. 240K $ETH has been collectively moved from these wallets in 24 hours, a 2.99% drop in coins held. https://t.co/Fw7lKcVZan pic.twitter.com/AMFPDL4BXp — Santiment (@santimentfeed) December 19, 2023 ETH has failed to clear the $2,250 price level, falling to $2,120 in the late hours of December 19. At the time of writing, ETH is now trading at $2,208. Price action suggests the crypto is still yet to gain strong traction among retail investors and is ongoing a retest. Related Reading: Matrixport Says 95% Chance Of Bitcoin Spot ETF In January, Sets BTC Price Target According to crypto analyst Ali Martinez, Ethereum is bouncing around its breakout zone from an ascending triangle. If this consolidation continues, we could see a price range between $2,150 and $1,900 before a breakout to a target of $3,500.   #Ethereum is currently retesting its breakout zone from an ascending triangle, hinting at preparation for a further climb. The price range between $2,150 and $1,900 could be the ideal zone for accumulation before #ETH sets its sights on a higher target of $3,500. pic.twitter.com/6lGZT0ZKgv — Ali (@ali_charts) December 20, 2023 Ethereum is up by 82.67% this year and the outlook for 2024 remains bullish. According to crypto analyst Altcoin Daily, ETH&#8217;s journey to $10,000 seems sure at the moment, pending Ethereum Spot ETFs a major catalyst for this price growth. ETH bulls continue to maintain control &#124; Source: ETHUSD on Tradingview.com Featured image from Cointribune, chart from Tradingview.com"
  }
]