[
  {
    "source": "CoinDesk",
    "date": "2023-07-11T09:11:50.000Z",
    "title": "Midday Mover: BNB, SOL Outperform as Bitcoin Clings to $30K",
    "url": "https://www.coindesk.com/markets/2023/07/11/midday-mover-bnb-sol-outperform-as-bitcoin-clings-to-30k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "PLUS: Mantle Network is mulling a $200 million ecosystem fund for its new layer-2 blockchain."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-11T09:35:38.000Z",
    "title": "MATIC Soars 9% Ahead of Polygon 2.0 Rollout, Rebounding Network Growth",
    "url": "https://decrypt.co/148047/matic-soars-9-ahead-polygon-2-0-rollout-rebounding-network-growth",
    "description": "Polygon’s uptick can likely be attributed to rebounding on-chain growth and the completion of a $66 million sell-off by bankrupt Celsius."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-11T09:25:41.000Z",
    "title": "China to require a license to release generative AI tools ",
    "url": "https://cointelegraph.com/news/china-to-require-generative-ai-tools-to-obtain-license",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/bf65462b-9006-4380-9721-8948224a7a29.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sources close to Chinese officials say the draft rules for AI developers have been updated to include obtaining a license prior to releasing generative AI systems.  </p>\n                    <p><p>The Chinese government is now considering additional regulations on artificial intelligence (AI) development that emphasize content control and licensing. </p><p>A July 11 <a href=\"https://www.ft.com/content/1938b7b6-baf9-46bb-9eb7-70e9d32f4af0\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from the Financial Times revealed that China’s Cyberspace Administration (CAC) wants to impose a system that would require local companies to obtain a license prior to releasing generative AI systems, according to sources close to regulators. </p><p>This move signals a tightening of<a href=\"https://cointelegraph.com/news/chinese-authorities-to-enforce-security-reviews-for-ai-services\"> initial draft regulations</a> that Chinese officials released in April, which gave companies 10 working days after the product launch to register it with authorities. </p><p>The new licensing scheme is expected to be included as a part of forthcoming regulations that are anticipated to be released as early as the end of this month, the sources said in the FT report. </p><p>Also included in the April draft of the regulations were mandatory security reviews of AI-generated content. </p><p>The government said in its draft that all content should “embody core socialist values,” and that it does not “subvert state power, advocate the overthrow of the socialist system, incite splitting the country or undermine national unity.”</p><p>Cointelegraph has reached out to CAC for comment, to which CAC has yet to respond.</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/china-is-developing-ai-without-us-chips-here-s-how\"><strong><em>China is developing AI without US chips — Here’s how</em></strong></a></p><p>Chinese tech and e-commerce companies <a href=\"https://cointelegraph.com/news/tech-giant-alibaba-to-roll-out-chatgpt-competitor-ai\">Baidu and Alibaba both released AI tools</a> this year, the latter rivaling that of the popular AI chatbot ChatGPT. </p><p>According to the sources in the FT report, both companies have been in contact with regulators in the last few months to keep their products in line with the new rules. </p><p>Along with the above-mentioned implications in the upcoming regulations, the draft is also said that Chinese authorities have deemed tech companies making AI models fully responsible for any content created using their products. </p><p>Regulators across the world have been calling for regulating AI-generated content. In the United States, Senator Michael Bennet recently <a href=\"https://cointelegraph.com/news/us-senator-pushes-companies-to-label-ai-generated-content\">authored a letter to tech companies</a> developing the technology to label AI-generated content.</p><p>The European Commission’s vice president for values and transparency, Vera Jourova, also told the media recently that she believes generative AI tools with the “potential to generate disinformation”<a href=\"https://cointelegraph.com/news/us-senator-pushes-companies-to-label-ai-generated-content\"> need to label the content created</a> to stop the spread of disinformation.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/hk-crypto-etfs-binance-maverick-poly-network-hacked-asia-express/\"><strong><em>HK crypto ETFs on fire, Binance warns on Maverick FOMO, Poly hack: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-11T09:10:00.000Z",
    "title": "How to actually spend your Bitcoin, Explained",
    "url": "https://cointelegraph.com/explained/how-can-you-actually-spend-your-bitcoins-explained",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/79fdc276c1ecba12968c8ea15336e86b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>                        Learn how to spend Bitcoin by directly paying merchants or using Bitcoin debit cards, as well as utilizing peer-to-peer platforms for transactions with other individuals.                    </p>\n                    <p><h2>What are the prerequisites for spending Bitcoin?</h2><p></p><p><em>Spending Bitcoin involves obtaining a wallet, acquiring Bitcoin, finding accepting businesses, making payments using wallet details or QR codes, waiting for transaction confirmation, and keeping records of transactions for accounting purposes.</em></p><p>Spending Bitcoin involves a few steps and requires the following:</p><h3>Obtain a Bitcoin wallet</h3><p>Get a <a href=\"https://cointelegraph.com/learn/bitcoin-wallets-a-beginners-guide-to-storing-btc\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/bitcoin-wallets-a-beginners-guide-to-storing-btc/amp\">Bitcoin wallet</a> first, which is a digital wallet that enables the storage, sending and receiving of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). Wallets come in a <a href=\"https://cointelegraph.com/explained/crypto-wallets-explained\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/crypto-wallets-explained/amp\">variety of forms</a>, such as software wallets (available on mobile, desktop or web platforms) and hardware wallets (physical devices).</p><h3>Acquire Bitcoin</h3><p>There are several <a href=\"https://cointelegraph.com/learn/how-to-buy-bitcoin-a-step-by-step-guide-to-buy-btc\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/how-to-buy-bitcoin-a-step-by-step-guide-to-buy-btc/amp\">ways to acquire Bitcoin</a>, including buying it on cryptocurrency exchanges, getting paid with it, or <a href=\"https://cointelegraph.com/learn/how-to-mine-bitcoin-a-beginners-guide-to-mine-btc\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/how-to-mine-bitcoin-a-beginners-guide-to-mine-btc/amp\">mining it yourself</a>.</p><h3>Locating businesses that accept Bitcoin</h3><p>Look for businesses or service providers who accept Bitcoin as a form of payment. Find companies that accept Bitcoin payments using online merchant directories, such as Coinmap, SpendBitcoins and Bitcoin.org. </p><h3>Payment process</h3><p>When making a purchase, the vendor normally offers a QR code or a <a href=\"https://cointelegraph.com/explained/are-bitcoin-transactions-anonymous-and-traceable\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/are-bitcoin-transactions-anonymous-and-traceable/amp\">Bitcoin payment address</a>. Users can enter the payment amount, recipient’s address and QR code, using their Bitcoin wallet. The next step is to confirm the payment and see the transaction details.</p><h3>Transaction confirmation</h3><p>The <a href=\"https://cointelegraph.com/learn/what-is-bitcoin-a-beginners-guide-to-the-worlds-first-cryptocurrency\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/what-is-bitcoin-a-beginners-guide-to-the-worlds-first-cryptocurrency/amp\">Bitcoin network</a> requires payment transmission and transaction confirmation. Miners verify the transaction during this step, and then they add it to the blockchain. Depending on network congestion, confirmation timeframes can change, although they normally range from a few minutes to an hour.</p><h3>Recording transactions</h3><p>For accounting and tax purposes, keep a record of your Bitcoin transactions. Typically, one’s wallet will offer a transaction history that they can access as needed.</p><h2>What can you buy with Bitcoin?</h2><p></p><p><em>Bitcoin is accepted by various online merchants, travel companies, gift card retailers, food establishments and online service providers, offering diverse options for using cryptocurrency in transactions. While physical stores accepting Bitcoin are less common, they can be found in cryptocurrency-friendly locations.</em></p><h3>Online merchants</h3><p>Bitcoin is a common payment option <a href=\"https://cointelegraph.com/learn/how-to-accept-bitcoin-a-guide-to-getting-paid-in-btc\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/how-to-accept-bitcoin-a-guide-to-getting-paid-in-btc/amp\">accepted by many online merchants</a>. Electronics, apparel, home goods and many other products are among the many things you can buy with Bitcoin. Major retailers that accept Bitcoin include Microsoft, Overstock and Newegg.</p><h3>Travel and lodging</h3><p>A number of travel companies, airlines and hotel booking websites now <a href=\"https://cointelegraph.com/news/travala-adds-600-000-hotels-to-their-crypto-booking-platform\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/travala-adds-600-000-hotels-to-their-crypto-booking-platform/amp\">accept BTC payments</a> from customers. Customers can use Bitcoin as an alternate payment method when making reservations for travel-related services, such as hotels, airlines or holiday packages.</p><h3>Gift cards</h3><p>You may <a href=\"https://cointelegraph.com/explained/what-are-gift-card-scams-and-how-to-avoid-them\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/what-are-gift-card-scams-and-how-to-avoid-them/amp\">buy gift cards</a> with Bitcoin at a number of venues. These gift cards are redeemable at well-known stores, eateries and online services. </p><h3>Online services</h3><p>A variety of online services, including web hosting, domain registration, VPN services and gaming subscriptions, can all be paid for with Bitcoin. Many online service providers accept Bitcoin as a form of payment.</p><p>AT&T, one of the major mobile carriers in the United States, has partnered with BitPay, a reputable cryptocurrency payment processor, to enable customers to make online bill payments using cryptocurrency. </p><h3>Charity donations</h3><p>Bitcoin can be used to donate to a number of charities and organizations. You can donate Bitcoin to social and humanitarian causes by using one of the many organizations and charity institutions that accept it.</p><h3>Physical stores</h3><p>The acceptance of Bitcoin in physical stores can vary widely depending on the location. Therefore, you must verify with the specific store before making a purchase.</p><p>For instance, All Star Pizza in Miami, Florida <a href=\"https://spendbitcoins.com/places/c/restaurants/serving/All\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">accepts</a> BTC via Menufy, an online food ordering and delivery platform that allows restaurants to integrate with their existing websites, allowing customers to browse menus, place orders and make payments online.</p><p dir=\"ltr\"><strong><em>Related: <a href=\"https://cointelegraph.com/explained/how-can-uk-based-businesses-accept-bitcoin\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/how-can-uk-based-businesses-accept-bitcoin/amp\">How can UK-based businesses accept Bitcoin?</a></em></strong></p><h2>How to spend Bitcoin using a peer-to-peer (P2P) marketplace</h2><p></p><p><em>To spend Bitcoin on a peer-to-peer marketplace, find sellers who accept Bitcoin, negotiate terms, transfer the agreed-upon amount, and receive the goods or services upon confirmation of payment.</em></p><p>Find a trustworthy P2P platform that supports Bitcoin transactions. After deciding on a platform, look through the vendor listings to identify those <a href=\"https://cointelegraph.com/explained/who-accepts-bitcoin-as-payment\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/who-accepts-bitcoin-as-payment/amp\">who accept Bitcoin as a payment method</a>. </p><p>To discuss the conditions of the transaction, such as the price and quantity, get in touch with the seller. Following the provided payment instructions, transfer the agreed-upon sum of Bitcoin to the seller’s specified wallet address after you agree to the terms.</p><p>The merchant will make the agreed-upon deliveries of the products or services after receiving payment confirmation. Be sure to stay in touch with the vendor and monitor the transaction at all times. </p><p>Before making any Bitcoin transactions through a P2P marketplace, it is essential to use prudence, confirm the seller’s reputation, and check the platform’s security and costs.</p><h2>How to spend BTC using a Bitcoin ATM</h2><p></p><p><em>To spend BTC using a Bitcoin ATM, find a nearby ATM, have a Bitcoin wallet, select the “Sell” option, scan your wallet’s QR code, specify the amount to sell, and collect the cash once the transaction is confirmed.</em></p><p>To <a href=\"https://cointelegraph.com/news/how-to-use-a-bitcoin-atm\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/how-to-use-a-bitcoin-atm/amp\">use a Bitcoin ATM</a> to spend BTC, you must first find one nearby, which may be done via online directories, such as CoinATMRadar or CoinFlip ATM Locator. Make sure the ATM allows both cash withdrawals and Bitcoin sales. Next, get a Bitcoin wallet prepared to receive money. This could be a hardware wallet or a mobile wallet.</p><p>When a user arrives at the <a href=\"https://cointelegraph.com/learn/bitcoin-atms-a-beginners-guide-to-bitcoin-teller-machines\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/bitcoin-atms-a-beginners-guide-to-bitcoin-teller-machines/amp\">Bitcoin ATM</a>, they need to choose “Sell” and scan the QR code of the address of their Bitcoin wallet. Indicate how much Bitcoin you wish to sell or withdraw in cash, then complete the transaction. The amount of time it takes for the transaction to be confirmed will depend on how congested the Bitcoin network is. After verification, the ATM will dispense a quantity of cash equal to the sold BTC.</p><p>However, it is important to educate yourself on the precise instructions and expenses associated with the ATM you are using because different Bitcoin ATMs may have different interfaces and fees.</p><h2>How to use Bitcoin remittance services to spend Bitcoin</h2><p></p><p><em>To use Bitcoin remittance services, one must first open an account, deposit Bitcoin, and, if necessary, convert it. Then, users can use their linked debit cards or partner retailers to spend Bitcoin.</em></p><p>Utilizing Bitcoin <a href=\"https://cointelegraph.com/news/will-crypto-remittances-be-the-future-of-global-money-transfers\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/will-crypto-remittances-be-the-future-of-global-money-transfers/amp\">remittance services</a> normally involves following a few steps. Finding a trustworthy Bitcoin remittance service with spending alternatives is the first step. Create an account by supplying the essential information and going through any necessary verification processes after selecting a service. </p><p>After that, deposit your Bitcoin into your account on the remittance service platform. Typically, this involves moving your Bitcoin from an external wallet. If desired, utilize the conversion tool provided by the service to convert Bitcoin to your local currency for spending purposes. </p><p>Some services may also allow the option to link a traditional payment method, such as a bank account or credit card, to your account, enabling direct purchases using your Bitcoin balance. </p><p>Alternatively, request a <a href=\"https://cointelegraph.com/news/blockchain-com-partners-with-visa-to-offer-crypto-debit-card\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/blockchain-com-partners-with-visa-to-offer-crypto-debit-card/amp\">Bitcoin debit card</a> that is connected to your account if the remittance service provides a debit card feature. You can use this card anywhere that accepts payment cards, and it will be loaded with the same amount in fiat money based on your Bitcoin balance.</p><p>Finally, keep track of your spending and review costs and stay current on your Bitcoin transactions by keeping an eye on your balances and transactions using the remittance service’s portal. Before using the selected Bitcoin remittance service to spend Bitcoin, ensure to read over all of its individual features, conditions and restrictions.</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-11T09:30:28.000Z",
    "title": "Navigating Bitcoin’s cyclical patterns",
    "url": "https://cryptoslate.com/insights/navigating-bitcoins-cyclical-patterns/",
    "description": "<p>Quick Take Historically Bitcoin follows a cyclical pattern of bull and bear phases interspersed with periods of stagnation. Currently, we are in a stagnation period where the price is trending sideways. This period often has investors on edge, as they are unsure whether the price could surge or plummet. Glassnode&#8217;s analyst, James Check, draws our [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/navigating-bitcoins-cyclical-patterns/\">Navigating Bitcoin&#8217;s cyclical patterns</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-11T09:24:46.000Z",
    "title": "Algorand’s largest DeFi protocol Algofi to shut operations",
    "url": "https://cryptoslate.com/algorands-largest-defi-protocol-algofi-to-shut-operations/",
    "description": "<p>Algorand&#8217;s (ALGO) largest decentralized finance protocol, Algofi, will wind down because current events have made its continued operations non-viable, according to a July 10 statement. &#8220;A confluence of events has taken place that no longer makes building and maintaining the Algofi platform to the highest standards a viable path for our company.&#8221; The Algofi team [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/algorands-largest-defi-protocol-algofi-to-shut-operations/\">Algorand’s largest DeFi protocol Algofi to shut operations</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-11T09:15:01.000Z",
    "title": "Shiba Inu Showing Breakout Potential As SHIB Whales Abruptly Come to Life: Analytics Firm Santiment",
    "url": "https://dailyhodl.com/2023/07/11/shiba-inu-showing-breakout-potential-as-shib-whales-abruptly-come-to-life-analytics-firm-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Inu-Showing-Breakout-Potential.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Inu-Showing-Breakout-Potential.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Inu-Showing-Breakout-Potential.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Inu-Showing-Breakout-Potential.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Inu-Showing-Breakout-Potential.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Inu-Showing-Breakout-Potential.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Inu-Showing-Breakout-Potential.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Dogecoin (DOGE) rival Shiba Inu (SHIB) is flashing signs of a potential breakout, according to the crypto analytics firm Santiment. Santiment says that the memecoin&#8217;s levels of whale transactions and token circulation are on the up and up. According to the analytics firm, the rise in network activity bodes well for Shiba Inu. &#8220;Shiba Inu [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/11/shiba-inu-showing-breakout-potential-as-shib-whales-abruptly-come-to-life-analytics-firm-santiment/\">Shiba Inu Showing Breakout Potential As SHIB Whales Abruptly Come to Life: Analytics Firm Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]