[
  {
    "source": "CoinDesk",
    "date": "2023-10-02T15:57:25.000Z",
    "title": "Chainalysis: Hong Kong and China’s OTC Markets Remain Active Despite Crypto Winter",
    "url": "https://www.coindesk.com/business/2023/10/02/chainalysis-hong-kong-and-chinas-otc-markets-remain-active-despite-crypto-winter/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "East Asia represents almost 8.8% of all transactions globally, a report from the research firm says."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-02T15:55:25.000Z",
    "title": "Parliamentary committee calls for shutdown of Worldcoin in Kenya",
    "url": "https://cointelegraph.com/news/kenya-parliamentary-committee-shutdown-worldcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/43d5340f-64e1-4ce0-8d1b-16f6eff31d74.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The committee’s recommendations included having the Kenyan government consider implementing a comprehensive framework for digital assets and virtual asset service providers.</p>\n                    <p><p>A parliamentary committee in Kenya’s government tasked with investigating Worldcoin has recommended that regulators shut down the project’s operations in the country.</p><p>According to a report released on Sept. 30 by Kenya’s parliament, Worldcoin has <a href=\"http://www.parliament.go.ke/sites/default/files/2023-09/AD%20HOC%20COMMITTEE%20ON%20INQUIRY%20INTO%20THE%20ACTIVITIES%20OF%20WORLD%20COIN%281%29.pdf\" target=\"_blank\" rel=\"noopener nofollow\">continued</a> to collect personal data of Kenya’s residents “in total disregard” of an <a href=\"https://cointelegraph.com/news/worldcoin-kenya-suspends-local-activities-of-worldcoin\">order to stop</a> issued in May — potentially including information from minors. The committee recommended that Kenyan authorities “disable the virtual platforms” of Worldcoin as well as investigate its companies for potential criminal charges.</p><p>\"The registration of Kenyans by Worldcoin online App is still going on despite the pendency of a court order and other administrative directions halting the same in entirety,” said the report.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/d33c7cf3-7f61-4747-8fb7-4ed39d3ab8a9.png\"  /><figcaption style=\"text-align: center;\"><em>Sept. 27 parliamentary report on Worldcoin's activities in Kenya: <a href=\"http://www.parliament.go.ke/sites/default/files/2023-09/AD%20HOC%20COMMITTEE%20ON%20INQUIRY%20INTO%20THE%20ACTIVITIES%20OF%20WORLD%20COIN%281%29.pdf\" target=\"_blank\" rel=\"noopener nofollow\">Source</a></em></figcaption></figure><p>The report cited privacy concerns for Kenya’s residents, but added it was difficult or impossible to determine the number of ‘orbs’ in the country — the devices the Worldcoin project uses to allow users to submit scans of their irises for verification. The committee’s recommendations included having the government consider implementing a comprehensive framework for digital assets and virtual asset service providers in Kenya, as well as amend existing regulations to consider cybercrimes and tax reporting requirements. </p><p>Lawmakers added:</p><blockquote>“The unregulated adoption and use of cryptocurrency as an attempt to fully decentralize the global monetary systems, poses threat to statehood.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/worldcoin-launch-sparks-debate-over-data-privacy-and-future-of-ai\"><strong><em>Worldcoin launch sparks debate over data privacy and future of AI</em></strong></a></p><p>Worldcoin, launched with the stated intention of distinguishing real people from bots online by providing retinal scans for identity verification, had millions of sign-ups by July. However, the project has <a href=\"https://cointelegraph.com/news/argentine-agency-investigation-worldcoin-biometric-data\">drawn the scrutiny of regulators</a> globally who claim it is circumventing regulations and guidelines on data protection and user privacy.</p><p>Authorities in Germany, Argentina, France and the United Kingdom have either <a href=\"https://cointelegraph.com/news/worldcoin-may-face-uk-data-regulators-enquiry-days-after-launch-report\">raised concerns about Worldcoin</a> or launched inquiries into its activities. Cointelegraph reached out to Worldcoin, but did not receive a response at the time of publication. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-etf-optimist-and-worldcoin-skeptic-gracy-chen-hall-of-flame/\"><strong><em>Bitcoin ETF optimist and Worldcoin skeptic Gracy Chen: Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-02T15:50:38.000Z",
    "title": "Bitcoin, Solana products lead first crypto investment inflow since mid-August",
    "url": "https://cryptoslate.com/bitcoin-solana-investment-products-lead-first-crypto-inflow-since-mid-august/",
    "description": "<p>Crypto investment products have recorded their first inflows since mid-August, as $21 million flowed into these products in the past week. CoinShares analyst James Butterfill said the inflows were a &#8220;reaction to a combination of positive price momentum, fears over US government debt prices and the recent quagmire over government funding.&#8221; However, he noted that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-solana-investment-products-lead-first-crypto-inflow-since-mid-august/\">Bitcoin, Solana products lead first crypto investment inflow since mid-August</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-02T16:04:39.000Z",
    "title": "Grayscale Ethereum Trust Seeks SEC Approval to Convert to Spot ETF",
    "url": "https://cryptobriefing.com/grayscale-ethereum-trust-seeks-sec-approval-spot-etf/?utm_source=feed&utm_medium=rss",
    "description": "Grayscale seeks SEC approval to convert $5B Ethereum Trust into spot ETF, advancing Ether further into regulatory perimeter."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-02T15:42:50.000Z",
    "title": "Peter Schiff: ‘We Are Still Early in the Biggest Bond Market Crash in U.S. History’",
    "url": "https://www.cryptoglobe.com/latest/2023/10/peter-schiff-we-are-still-early-in-the-biggest-bond-market-crash-in-u-s-history/",
    "description": "On 2 October 2023, Peter Schiff, the Chief Executive Officer of Euro Pacific Capital, issued a warning about what he believes to be the early stages of the largest bond market crash in the history of the United States. The statement was made on social media platform X, which was formerly known as Twitter. Schiff […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-02T15:49:19.000Z",
    "title": "Biggest Movers: BCH Races to 2-Month High, SOL Nears $25",
    "url": "https://news.bitcoin.com/biggest-movers-bch-races-to-2-month-high-sol-nears-25/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2098979248-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: BCH Races to 2-Month High, SOL Nears $25\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2098979248-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2098979248-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2098979248-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2098979248-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2098979248-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2098979248-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2098979248.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin cash rose to a multi-month high to start the week, as traders pushed the cryptocurrency above a key resistance level. The move came on the heels of the &#x201C;Uptober&#x201D; trend, and ahead of a big week of U.S. economic data, headlined by the nonfarm payrolls report. Solana rose to its highest level since mid-August. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-02T16:03:23.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-02T15:40:58.000Z",
    "title": "The Rise of ‘AI Anxiety’ and How to Manage It",
    "url": "https://www.cryptopolitan.com/the-rise-of-ai-anxiety-and-how-to-manage-it/",
    "description": "Artificial intelligence (AI) has made significant strides in recent years, often outperforming humans in various tasks. A recent study published in Scientific Reports revealed that AI programs surpassed the average human in tasks requiring originality, as evaluated by human reviewers. This study asked participants to develop imaginative uses for everyday objects. AI responses demonstrated remarkable ... <a title=\"The Rise of &#8216;AI Anxiety&#8217; and How to Manage It\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-rise-of-ai-anxiety-and-how-to-manage-it/\" aria-label=\"More on The Rise of &#8216;AI Anxiety&#8217; and How to Manage It\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-02T16:00:35.000Z",
    "title": "XRP Price Disappoints: Crypto Analyst Reveals Why He Will No Longer Accumulate",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-disappoints-analyst/",
    "description": "The sentiment around the XRP price has been mostly bullish lately with numerous predictions coming through for a potential rally. However, not everyone has joined the bull bandwagon after being disappointed by the XRP price performance. One analyst in particular has expressed its displeasure at XRP’s performance over the years, and as a result of this, the analyst wants to abandon the token. XRP Price Value Weakens One analyst who goes by CryptoCheck on the TradingView platform has put forward reasons for why he is no longer bullish on the XRP price. The analysis shows how XRP has underperformed the rest of the crypto market over the years, leading to the belief that the value of the token has weakened. Related Reading: IPO Frenzy: What Happens To XRP Price If Ripple Stock Climbs To $600? CryptoCheck points to the fact that XRP has been unable to reclaim its first and only all-time high even though Bitcoin and a lot of altcoins have been able to do the multiple times. The crypto trader refers to this price performance as unusual when compared to other assets in the industry. The analyst laments the inability of XRP to put on the same kind of performance as other coins over the years despite its value proposition as being a cryptocurrency for institutions. “Other coins have long surpassed their ATH&#8217;s. But XRP made one high, and never again. This speaks of weakness in terms of value. And that can no longer be ignored,” the analyst writes. Furthermore, CryptoCheck compares the token to the likes of Dogecoin (DOGE) which is widely known for having no value and being a meme coin. Nevertheless, DOGE has hit multiple all-time highs while the XRP price continues to lag behind. “The truth is, if I bought as much DOGE as I did XRP, my portfolio would have been up x100 compared to now,” CryptoCheck adds. Weak support and stronger resistance &#124; Source: Tradingview.com Will No Longer Accumulate XRP The culmination of CryptoCheck’s analysis comes from the fact that he will no longer be buying the token. According to the crypto trader, he had been religiously buying XRP due to his strong belief and ideology about the value proposition of the token. However, the XRP price performance has been nothing to write home about. The analyst attributes this to low trading volume for the token and investors not being interested in buying the token. Also, CryptoCheck points to what he referred to as a “Pump and Dump” price action which has led to XRP constantly forming “weak support zones and strong resistance zones.” Related Reading: XRP Price Threatened As Ripple Unlocks 1 Billion Coins Additionally, he explains that the rising unpopularity of XRP translates to weak confidence. As such, investors who are already holding the tokens are looking for a good opportunity to sell and exit, especially short-term traders. As for the analyst, he explained that the next course of action was to sell. “I have decided I will no longer accumulate. Instead, as soon as the price reaches higher than what I bought for, I will be looking to sell my bags,” he revealed. XRP bulls take control of performance &#124; Source: XRPUSD On Tradingview.com Featured image from Eightify, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-02T16:03:45.000Z",
    "title": "Shiba Inu’s Shibarium: Is a Price Surge on the Horizon?",
    "url": "https://www.crypto-news-flash.com/shiba-inus-shibarium-is-a-price-surge-on-the-horizon/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-shibarium-is-a-price-surge-on-the-horizon",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shibarium\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-2048x1152.jpg 2048w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Shiba Inu (SHIB) has experienced a 5 percent price increase in the last week with a strong response to the Shibarium launch. The Shiba Inu ecosystem has seen a notable increase in its token-burning program, with over 2.3 billion SHIB tokens burned last month. Shiba Inu seems to be gaining momentum once again with the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-02T15:45:37.000Z",
    "title": "Chainlink’s 670 Billion-Dollar Partnership: The Future of Finance Unveiled",
    "url": "https://www.crypto-news-flash.com/chainlinks-670-billion-dollar-partnership-the-future-of-finance-unveiled/?utm_source=rss&utm_medium=rss&utm_campaign=chainlinks-670-billion-dollar-partnership-the-future-of-finance-unveiled",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-300x158.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-1024x538.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-768x403.jpeg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-351x185.jpeg 351w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-24x13.jpeg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-36x19.jpeg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-48x25.jpeg 48w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Chainlink secures a partnership agreement with Australia and New Zealand Banking Group (ANZ). This bank was recently involved in Chainlink&#8217;s case study that involved it&#8217;s CCIP.  Chainlink (LINK) has, according to the latest announcement, sealed a partnership agreement with leading giant Australia and New Zealand Banking Group (ANZ). ANZ has $670 billion in assets and [...]"
  }
]