[
  {
    "source": "CoinDesk",
    "date": "2023-10-30T13:52:54.000Z",
    "title": "LIVE: Sam Bankman-Fried Takes the Stand for a Third Day in FTX Fraud Trial",
    "url": "https://www.coindesk.com/policy/2023/10/30/live-sam-bankman-fried-takes-the-stand-for-a-third-day-in-ftx-fraud-trial/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Sam Bankman-Fried will continue his defense Monday against allegations he committed fraud and conspired to commit other forms of fraud in operating FTX and Alameda Research."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-30T14:01:02.000Z",
    "title": "Email Phishing Attacks Up 1,265% Since ChatGPT Launched: SlashNext",
    "url": "https://decrypt.co/203564/since-chatgpt-launch-phishing-emails-are-up-1265-slashnext",
    "description": "The CEO of the cybersecurity firm said potential victims should go on the offensive and fight AI with AI."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-30T13:59:15.000Z",
    "title": "Biden Administration Issues ‘Sweeping’ Executive Order to Reign in AI",
    "url": "https://decrypt.co/203659/biden-administration-issues-sweeping-executive-order-reign-ai",
    "description": "The White House has issued an executive order that includes a 26-point mandate for firms working on artificial intelligence."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-30T13:44:50.000Z",
    "title": "How to Invest Using Tokenomics",
    "url": "https://decrypt.co/resources/how-to-invest-using-tokenomics",
    "description": "Tokenomics is the study of how cryptocurrencies work within the broader ecosystem. This includes such things like token distribution as well as how they can be used to incentivize positive behaviour in the network. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-30T13:54:29.000Z",
    "title": "Biden administration releases executive order for new AI safety standards ",
    "url": "http://cointelegraph.com/news/biden-administration-executive-order-ai-safety-standards",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/e81fe1ba-9dab-4b17-b5cb-8790ea3aa50b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The U.S. government’s executive order establishes six new standards for AI safety and security and its intentions for ethical AI usage within the government.  </p>\n                    <p><p>The administration of United States President Joe Biden released an executive <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2023/10/30/fact-sheet-president-biden-issues-executive-order-on-safe-secure-and-trustworthy-artificial-intelligence/\" target=\"_blank\" rel=\"noopener nofollow\">order</a> on Oct. 30 establishing new standards for artificial intelligence (AI) safety and security. </p><p>Biden’s address said it is building off previous actions taken, including AI safety <a href=\"https://cointelegraph.com/news/ai-companies-commit-safe-and-transparent-ai-white-house-reports\">commitments from 15 leading companies</a> in the industry. The new standards have six primary touch points for the new AI standards, along with plans for the ethical use of AI in the government, privacy practices for citizens, and steps for protecting consumer privacy.</p><p>The first standard requires developers of the most powerful AI system to share safety test results and “critical information” with the government. Secondly, the National Institute of Standards and Technology will develop standardized tools and tests for ensuring AI’s safety, security and trustworthiness.</p><p>The administration also aims to protect against the risk of AI usage to engineer “dangerous biological materials” through new biological synthesis screening standards.</p><p>Another standard includes working toward protection from AI-enabled fraud and deception. It says standards and best practices for detecting AI-generated content and authenticating official content will be established. </p><p>It also plans to build on<a href=\"https://cointelegraph.com/news/us-launches-ai-challenge-to-strengthen-critical-infrastructure\"> the administration’s ongoing AI Cyber Challenge</a> that was announced in August, by advancing a cybersecurity program to develop AI tools to find and fix vulnerabilities in critical software. Finally, it ordered the development of a national security memorandum, which will further direct actions on AI security. </p><p>The order also touched on privacy risks of AI saying that: </p><blockquote>“Without safeguards, AI can put Americans’ privacy further at risk. AI not only makes it easier to extract, identify, and exploit personal data, but it also heightens incentives to do so because companies use data to train AI systems.” </blockquote><p>To this, the president officially called on Congress to pass bipartisan data privacy legislation to prioritize federal support for the development and research of privacy techniques and technologies. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/adobe-ibm-nvidia-join-biden-prevent-ai-misuse\"><strong><em>Adobe, IBM, Nvidia join US President Biden’s efforts to prevent AI misuse</em></strong></a></p><p>Officials in the U.S. also plan to focus efforts on advancements in equity and civil rights in regards to AI, employ the responsible use of AI to bring benefits to consumers and monitor the technology’s impact on the job market, among other social-related topics. </p><p>Lastly, the order laid out the administration's plans for involvement with AI regulations worldwide. The U.S. was one of the seven<a href=\"https://cointelegraph.com/news/g7-countries-ai-code-of-conduct-report\"> G7 countries that recently agreed</a> on a voluntary AI code of conduct for AI developers. </p><p>Within the government itself, it says it plans to release clear standards to “protect rights and safety, improve AI procurement, and strengthen AI deployment” and provide AI training for all employees in relevant fields. </p><p>In July, U.S. Senators held <a href=\"https://cointelegraph.com/news/us-senators-to-have-classified-ai-briefing\">a classified meeting at the White House</a> to discuss regulations for the technology and the Senate has held a series of “AI Insight Forums” to hear from top AI experts in the industry. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/\"><strong><em>‘AI has killed the industry’: EasyTranslate boss on adapting to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-30T13:45:49.000Z",
    "title": "Bitcoin’s October surge leaves one buyer group in the cold",
    "url": "https://cryptoslate.com/insights/bitcoins-october-surge-leaves-one-buyer-group-in-the-cold/",
    "description": "<p>Quick Take Bitcoin (BTC) has seen a noteworthy surge in October, marking a 28% increase and paving the way for it to be the second most lucrative month of the year, tailing behind January&#8217;s 40% ascension. One key metric that provides an insightful perspective is the &#8216;realized price&#8216;, a concept that reveals the mean purchase [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoins-october-surge-leaves-one-buyer-group-in-the-cold/\">Bitcoin&#8217;s October surge leaves one buyer group in the cold</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-30T13:47:48.000Z",
    "title": "SushiSwap community suggests abandoning Kanpai 2.0",
    "url": "https://crypto.news/sushiswap-community-suggests-abandoning-kanpai-2-0/",
    "description": "Members of the SushiSwap community want to abandon the Kanpai 2.0 model, as it has become the reason for the weak tokenomics of the crypto exchange."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-30T14:00:12.000Z",
    "title": "DOGE Breaks Free From Multi-year Descending Order, What’s Next?",
    "url": "https://www.newsbtc.com/news/dogecoin/doge-breaks-free-from-multi-year-descending-order-whats-next/",
    "description": "Dogecoin has also benefited from the general crypto market rally, gaining over 7% in the past week. DOGE has settled at the $0.069 price range today, with its market cap above $9 billion, showing its massive adoption. Also, on the weekly chart, DOGE shows signs of a breakout pattern as more buyers continue to accumulate the tokens. According to crypto analyst Ali Chart, Dogecoin has broken out of a multi-year descending triangle pattern on the weekly chart. The analyst believes this confirms a buy signal for the asset on the weekly timeframe, making its future outlook bullish.  DOGE Breaks Out Of Descending Triangle Pattern DOGE entered a descending triangle pattern from July 2023 as bearish conditions in the market forced a decline. However, the buyers forced a breakout from this pattern in October as the general market moved into an uptrend.  Remarkably, DOGE flipped the $0.067 resistance level into support, rallying to the $0.071 resistance level. Furthermore, DOGE has formed two consecutive green candles on the weekly chart, confirming its break out of the descending triangle.  Related Reading: Ethereum Resilient Above $1,800 Pre-FOMC Meeting – Details Additionally, the Relative Strength Index (RSI) displays a value of 51.8 in the neutral zone and moving sideways. It implies that while the buyers are dominant, some traders are beginning to make a profit, leading to a slight decline. However, if the RSI moves to 55, the buyers will likely resume the accumulation phase.  Also, the Moving Average Convergence/Divergence (MACD) is above its signal line, displaying a buy signal on the weekly chart. Moreover, the green Histogram bars confirm that the buyers are not yet done with the accumulation of DOGE. If DOGE breaks above the $0.071 resistance level, it will likely continue on its rally in the coming weeks.  Whale Movement Aiding Dogecoin’s Price Gains According to the crypto tracking platform Whale Alert, a dormant address holding over 5.39 million DOGE tokens valued at $372,461 has been reactivated. Notably, this address remained inactive for almost 10 years, with its last activity in 2013 when DOGE launched in the public market.  Whale Alert confirmed that this whale transferred 392,000 DOGE to a new blockchain address. Also, a massive 350 million DOGE tokens were transferred to the crypto exchange Robinhood on October 27 from a whale address.  These transfers are likely aiding Dogecoin’s rally in the past week due to increased on-chain activity. Also, the general price uptick in the crypto market led to a rally for meme coins.  Related Reading: Crypto Analyst Presents Uniswap’s UNI As The Next Coin Primed For Breakout Furthermore, Dogecoin’s profile as one of the largest cryptocurrencies by market cap is aiding its price rally. Therefore, DOGE&#8217;s uptrend may continue in the coming weeks if the general market sentiment remains positive. Featured image from Shutterstock and chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-30T13:59:00.000Z",
    "title": "Zodia Custody Opens in Hong Kong, Taps Into $10M+ Institutional Deals",
    "url": "https://coinedition.com/zodia-custody-opens-in-hong-kong-taps-into-10m-institutional-deals/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Over-12-Firms-Interested-in-Security-Token-Offering-Hong-Kong.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Over 12 Firms Interested in Security Token Offering Hong Kong\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Over-12-Firms-Interested-in-Security-Token-Offering-Hong-Kong.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Over-12-Firms-Interested-in-Security-Token-Offering-Hong-Kong-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Over-12-Firms-Interested-in-Security-Token-Offering-Hong-Kong-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Over-12-Firms-Interested-in-Security-Token-Offering-Hong-Kong-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Over-12-Firms-Interested-in-Security-Token-Offering-Hong-Kong-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The crypto security firm Zodia Custody, owned by the renowned British banking giant Standard Chartered, further solidifies its presence in Asia by launching in Hong Kong. This move marks Zodia&#8217;s latest venture following successful expansions in Japan, Singapore, and Australia earlier this year. Unlike many markets where retail customers often dominate the demand for digital [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/zodia-custody-opens-in-hong-kong-taps-into-10m-institutional-deals/\">Zodia Custody Opens in Hong Kong, Taps Into $10M+ Institutional Deals</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]