[
  {
    "source": "CoinDesk",
    "date": "2023-10-18T19:41:47.000Z",
    "title": "Spot Bitcoin ETF Approval Is Coming, but Analysts Differ on Possible Price Reaction",
    "url": "https://www.coindesk.com/markets/2023/10/18/spot-bitcoin-etf-approval-is-coming-but-analysts-differ-on-possible-price-reaction/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A fake report about BlackRock's spot BTC ETF approval Monday spurred a short-lived bitcoin rally to $30,000."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-18T19:59:25.000Z",
    "title": "ECB officials move to 'preparation phase' for digital euro",
    "url": "https://cointelegraph.com/news/ecb-preparation-phase-digital-euro",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/976be4a1-ddc0-43c2-8e60-2007e40bdc62.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Though the issuance of a digital euro is not a certainty, officials with the European Central Bank are moving to next phase of the project.</p>\n                    <p><p>The governing council of the European Central Bank (ECB) has announced it will begin the ”preparation phase” for the digital euro project following a two-year investigation.</p><p>In an Oct. 18 notice, the ECB <a href=\"https://www.ecb.europa.eu/press/pr/date/2023/html/ecb.pr231018~111a014ae7.en.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it plans to “start laying the foundation for the possible issuance of a digital euro” beginning on Nov. 1, adding the issuance of a central bank digital currency (CBDC) was not a foregone conclusion. The announcement followed the release of a 44-page <a href=\"https://www.ecb.europa.eu/paym/digital_euro/investigation/profuse/shared/files/dedocs/ecb.dedocs231018.en.pdf\" target=\"_blank\" rel=\"noopener nofollow\">report</a> on a potential digital euro’s design and distribution. </p><p>The preparation phase, as the ECB refers to it, will last two years and focus on finalizing rules for the digital currency as well as selecting possible issuers. Officials said the next phase will include “testing and experimentation” in accordance with user feedback as well as requirements under the central bank.</p><p>“After two years, the Governing Council will decide whether to move to the next stage of preparations, to pave the way for the possible future issuance and roll-out of a digital euro,” said the ECB. “The launch of the preparation phase is not a decision on whether to issue a digital euro. That decision will only be considered by the Governing Council once the European Union’s legislative process has been completed.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Our Governing Council has decided to move to the next phase of the digital euro project.  <br><br>In November 2023 we will start laying the foundation for the possible issuance of a digital euro. A decision on issuing a digital euro will come at a later stage.<a href=\"https://t.co/xuKklame0U\">https://t.co/xuKklame0U</a> <a href=\"https://t.co/Nn0Z8RggVn\">pic.twitter.com/Nn0Z8RggVn</a></p>&mdash; European Central Bank (@ecb) <a href=\"https://twitter.com/ecb/status/1714641566667563326?ref_src=twsrc%5Etfw\">October 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/digital-euro-eu-financial-chief-don-t-rush-before-july-2024\"><strong><em>EU finance chief: Don’t rush digital euro before new Commission in June 2024</em></strong></a></p><p>In June, the European Commission <a href=\"https://cointelegraph.com/news/european-commission-aims-universal-acceptance-digital-euro-proposal\">proposed a legislative plan</a> for a digital euro, aiming to have users access the CBDC through their banks. Fabio Panetta, an executive board member with the ECB, <a href=\"https://cointelegraph.com/news/dao-future-limited-by-lack-of-regulatory-framework-ecb-occasional-paper\">reiterated his goal</a> of having a digital euro available alongside cash, with many of the same privacy features.</p><p>Many in the crypto space criticized ECB President Christine Lagarde for claiming that a digital euro could be <a href=\"https://cointelegraph.com/news/cbdc-will-be-used-for-control-ecb-president-admits-in-vid-chat-with-fake-zelensky\">used to control user payments</a> in a prank video in which she believed she had been speaking to Ukraine President Volodymyr Zelensky. The rollout of any digital euro is likely to get the <a href=\"https://cointelegraph.com/news/eu-finance-chief-says-digital-euro-bill-coming-in-early-2023\">attention of regulators</a> and policymakers, who will have their  election for the European Parliament in June 2024.</p><p><strong><em> Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/cbdcs-kryptonite-for-crypto/\"><strong><em>Are CBDCs kryptonite for crypto?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-18T19:50:00.000Z",
    "title": "Meta makes progress towards AI system that decodes images from brain activity",
    "url": "https://cointelegraph.com/news/meta-makes-progress-towards-ai-system-decodes-images-brain-activity",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/7ea416f6-5152-4db3-9b3f-73c71507fad6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The system is entirely non-invasive and could have near-term applications for some. </p>\n                    <p><p>The new system <a href=\"https://ai.meta.com/blog/brain-ai-image-decoding-meg-magnetoencephalography/\" target=\"_blank\" rel=\"noopener nofollow\">combines</a> a non-invasive brain scanning method called magnetoencephalography (MEG) with an artificial intelligence system.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/2a74560f-b0fb-4027-9a2c-4e657a446c0b.jpg\"><figcaption style=\"text-align: center;\">A typical MEG imaging machine. Image public domain, source: <a href=\"https://en.wikipedia.org/wiki/Magnetoencephalography#/media/File:NIMH_MEG.jpg\" target=\"_blank\" rel=\"noopener nofollow\">NIMH/Wikipedia</a></figcaption></figure><p>This work leverages the company’s previous work <a href=\"https://www.nature.com/articles/s42256-023-00714-5\" target=\"_blank\" rel=\"noopener nofollow\">decoding</a> letters, words, and audio spectrograms from intracranial recordings. </p><p>According to a Meta blog post, </p><blockquote>“This AI system can be deployed in real time to reconstruct, from brain activity, the images perceived and processed by the brain at each instant.”</blockquote><p>A post from the AI at Meta account on X, formerly Twitter, showcased the real-time capabilities of the model through a demonstration depicting what an individual was looking at and how the AI decoded their MEG-generated brain scans.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today we're sharing new research that brings us one step closer to real-time decoding of image perception from brain activity.<br><br>Using MEG, this AI system can decode the unfolding of visual representations in the brain with an unprecedented temporal resolution.<br><br>More details ⬇️</p>— AI at Meta (@AIatMeta) <a href=\"https://twitter.com/AIatMeta/status/1714635316554772716?ref_src=twsrc%5Etfw\">October 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>It’s worth noting that, despite the progress shown, this experimental AI system requires pre-training on an individual’s brainwaves. In essence, rather than training an AI system to read minds, the developers train the system to interpret specific brain waves as specific images. There’s no indication that this system could produce imagery for thoughts unrelated to pictures the model was trained on. </p><p>However, Meta AI also notes that this is early work and that further progress is expected. As such, the team has specifically noted that this research is part of the company’s ongoing initiative to unravel the mysteries of the brain. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/neuralink-gets-fda-approval-for-in-human-trials-of-its-brain-computer-interface\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/neuralink-gets-fda-approval-for-in-human-trials-of-its-brain-computer-interface/amp\"><strong><em>Neuralink gets FDA approval for ‘in-human’ trials of its brain-computer interface</em></strong></a></p><p>And, while there’s no current reason to believe a system such as this would be capable of invading someone’s privacy, under the current technological limitations, there is reason to believe that it could provide a quality of life upgrade for some individuals. </p><p>“We're excited about this research,” read a post by the Meta AI team on X, adding that they “hope that one day it may provide a stepping stone toward non-invasive brain-computer interfaces in a clinical setting that could help people who have lost their ability to speak.”</p><p>Meta AI unveiled a new artificial intelligence (AI) system designed to decode imagery from human brain waves on Oct. 18 via a blog post. </p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-18T19:40:02.000Z",
    "title": "European Central Bank advances CBDC to preparation stage, but still not committed to implementation",
    "url": "https://cryptoslate.com/european-central-bank-advances-cbdc-to-preparation-stage-but-still-not-committed-to-implementation/",
    "description": "<p>The European Central Bank (ECB) announced on Oct. 18 that its project to develop a digital form of the euro is progressing to the preparation phase. Christine Lagarde, President of the ECB, said on Twitter/X: &#8220;We need to prepare our currency for the future. While we haven’t yet decided whether to issue a digital euro, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/european-central-bank-advances-cbdc-to-preparation-stage-but-still-not-committed-to-implementation/\">European Central Bank advances CBDC to preparation stage, but still not committed to implementation</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T20:03:31.000Z",
    "title": "Sen. Elizabeth Warren joins over 100 U.S. lawmakers urging for swift action on crypto-financed terrorism",
    "url": "https://www.cryptopolitan.com/sen-elizabeth-warren-100-u-s-lawmakers-urging-swift-action-crypto-financed-terrorism/",
    "description": "Senator Elizabeth Warren, a Democrat from Massachusetts, and over a hundred lawmakers from both sides of the aisle have raised alarms about the role of cryptocurrency in funding terrorist activities. The group sent a letter to the Biden administration this week, urging immediate action to curb the use of digital currencies for illicit purposes. Moreover, ... <a title=\"Sen. Elizabeth Warren joins over 100 U.S. lawmakers urging for swift action on crypto-financed terrorism\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sen-elizabeth-warren-100-u-s-lawmakers-urging-swift-action-crypto-financed-terrorism/\" aria-label=\"More on Sen. Elizabeth Warren joins over 100 U.S. lawmakers urging for swift action on crypto-financed terrorism\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T19:59:47.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: ARB breaks key barrier",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the blockchain world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain‘s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: ARB breaks key barrier\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: ARB breaks key barrier\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T19:47:20.000Z",
    "title": "SHIB in 2025: Setting sail or sinking ship? An in-depth analysis",
    "url": "https://www.cryptopolitan.com/shib-2025-setting-sail-or-sinking-ship/",
    "description": "With 2025 on the horizon, the question on every investor&#8217;s mind is whether SHIB, the popular dog-themed cryptocurrency, is setting sail to greener pastures or sinking rapidly into the abyss of market uncertainty. Once hailed as a promising newcomer, its recent performance has raised more than a few eyebrows. What&#8217;s in store for SHIB by ... <a title=\"SHIB in 2025: Setting sail or sinking ship? An in-depth analysis\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shib-2025-setting-sail-or-sinking-ship/\" aria-label=\"More on SHIB in 2025: Setting sail or sinking ship? An in-depth analysis\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T19:41:11.000Z",
    "title": "Central Banks to probe Crypto: Opportunity or overreach?",
    "url": "https://www.cryptopolitan.com/central-banks-crypto-opportunity-overreach/",
    "description": "Central banks are increasingly turning their attention to the crypto space, getting deeper into this industry that once sat on the periphery of their vision. But as they seek clarity in a world known for its opacity, we must ask: are they genuinely looking for answers, or is this just another power grab in an ... <a title=\"Central Banks to probe Crypto: Opportunity or overreach?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/central-banks-crypto-opportunity-overreach/\" aria-label=\"More on Central Banks to probe Crypto: Opportunity or overreach?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-18T20:00:44.000Z",
    "title": "Expert Trader Identifies 6 High-Potential Altcoins To Watch",
    "url": "https://www.newsbtc.com/altcoin/expert-trader-identifies-6-high-potential-altcoins-to-watch/",
    "description": "In its latest update on October 18, renowned crypto analyst Rekt Capital has highlighted six altcoins that have caught his attention, showing potential for the remainder of 2023, Ocean Protocol (OCEAN), Dogecoin (DOGE), Woo Network (WOO), Verasity (VRA), Stellar (XLM), and Injective (INJ). Mixed Signals For Dogecoin Rekt Capital&#8217;s analysis suggests a crucial moment for the Ocean Protocol. Whether the current price deviation will result in a downside wick below the red channel placed at $0.2763 or if the price will close below it weekly.  Related Reading: Shiba Inu Burn Rate Takes A Steep Dive: 91% Decrease In 24 Hours While a downside wick followed by a recovery could lead to a move toward the Channel Top at $0.3247, a weekly close below the Channel Bottom would necessitate keen observation for price rejection as new resistance. On the other hand, Rekt Capital notes that Dogecoin has been meandering at the bottom of its channel at $0.058890. However, recent price developments indicate that the potential bullish divergence in its 1-week chart is likely no longer valid.  The lower low has shifted from support to resistance, confirmed by price action and a breakdown in the RSI&#8217;s trendline. Although a scenario of DOGE reclaiming its lower low remains possible, Rekt believes that a more definitive reaction is needed to confirm a potential fake breakdown. Injective Dominates The Altcoins Market Woo Network has experienced a relatively subdued quarter compared to the first half of 2023. Despite the uncertain macro outlook, WOO Network remains confident in its vision and mission.  Notably, the network successfully negotiated the repurchase of shares and tokens from the estate of Three Arrows Capital, alleviating uncertainty for WOO Network&#8217;s community and investors. Verasity is a protocol and product layer platform for esports, video entertainment, and digital content management. Rekt Capital acknowledges the breakout from the mid-term downtrend structure in Verasity&#8217;s native token.  The token has been establishing higher lows after reaching a low point on October 4, indicating a potential shift in momentum. Stellar is a blockchain-based payments network that facilitates global, efficient digital asset issuance and exchange. XLM has recently displayed sideways price action, trading below its 50-day and 200-day moving averages. Nonetheless, Rekt Capital includes Stellar in their altcoin watchlist, suggesting it is one to watch. Injective is an open and interoperable blockchain optimized for DeFi applications, utilizing the Tendermint PoS consensus mechanism. Rekt Capital highlights the significant uptrend in INJ&#8217;s native token in the past 24 hours and over the past year, with a remarkable surge of 290%. As Rekt Capital&#8217;s analysis indicates, these six altcoins &#8211; OCEAN, DOGE, WOO, Verasity VRA, XLM, and INJ &#8211; have caught the attention of the crypto analyst.  Related Reading: Binance Traders Go Bearish On Bitcoin, But Here’s Why They Might Regret It While each cryptocurrency presents its unique opportunities and challenges, investors and enthusiasts can look forward to monitoring their performances and assessing their potential for the remainder of 2023.  Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-18T20:00:12.000Z",
    "title": "Top Trader Says One Compelling Bullish Argument for Bitcoin (BTC) Now in Play – Here’s What He Means",
    "url": "https://dailyhodl.com/2023/10/18/top-trader-says-one-compelling-bullish-argument-for-bitcoin-btc-now-in-play-heres-what-he-means/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/top-one-now-play.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/top-one-now-play.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/top-one-now-play.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/top-one-now-play.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/top-one-now-play.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/top-one-now-play.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/top-one-now-play.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular analyst says that after an abrupt move to the upside, Bitcoin (BTC) could remain in an uptrend. Pseudonymous analyst Cred tells his 53,500 subscribers of the TechnicalRoundup YouTube channel that if Bitcoin holds above a key level, it could indicate continued bullish momentum for the king crypto. BTC soared to as high as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/18/top-trader-says-one-compelling-bullish-argument-for-bitcoin-btc-now-in-play-heres-what-he-means/\">Top Trader Says One Compelling Bullish Argument for Bitcoin (BTC) Now in Play – Here’s What He Means</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-18T19:55:37.000Z",
    "title": "Don’t Count on Bitcoin Collapse to Previous Lows, Says Crypto Analyst Jason Pizzino – Here’s Why",
    "url": "https://dailyhodl.com/2023/10/18/dont-count-on-bitcoin-collapse-to-previous-lows-says-crypto-analyst-jason-pizzino-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-Into-Loss-Territory.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-Into-Loss-Territory.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-Into-Loss-Territory.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-Into-Loss-Territory.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-Into-Loss-Territory.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-Into-Loss-Territory.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Bitcoin-Into-Loss-Territory.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says the odds are looking good that Bitcoin (BTC) will not revisit its prior cycle lows. In a new strategy session, crypto trader Jason Pizzino tells his 290,000 YouTube subscribers that based on Bitcoin’s four-year cycle history, the king crypto will likely hold its key support levels and head into [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/18/dont-count-on-bitcoin-collapse-to-previous-lows-says-crypto-analyst-jason-pizzino-heres-why/\">Don’t Count on Bitcoin Collapse to Previous Lows, Says Crypto Analyst Jason Pizzino – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]