[
  {
    "source": "Decrypt",
    "date": "2023-09-11T22:59:43.000Z",
    "title": "Ethereum Is Losing Favor Among Institutional Investors: CoinShares",
    "url": "https://decrypt.co/155964/ethereum-is-losing-favor-among-institutional-investors-coinshares",
    "description": "With $108 million worth of selling in 2023, it is the “least loved digital asset.”"
  },
  {
    "source": "Decrypt",
    "date": "2023-09-11T22:45:10.000Z",
    "title": "Gensler Decries ‘Wide-Ranging Noncompliance’ In Crypto Ahead of Oversight Testimony",
    "url": "https://decrypt.co/155967/gensler-cites-wide-ranging-noncompliance-ahead-of-oversight-testimony",
    "description": "Despite bipartisan criticism for his agency’s approach to crypto, SEC Chair Gary Gensler is doubling down."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T22:58:54.000Z",
    "title": "Brace yourself for massive losses – Crypto trends on dangerous waters",
    "url": "https://www.cryptopolitan.com/crypto-trends-on-dangerous-waters-and-losses/",
    "description": "The crypto market is not doing well. And it may take on this sentiment for the whole week if not the whole month. As we navigate the volatile seas of the crypto market, it&#8217;s becoming increasingly clear that storm clouds are gathering on the horizon.&#160; For both seasoned investors and newcomers alike, the tides have ... <a title=\"Brace yourself for massive losses &#8211; Crypto trends on dangerous waters\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-trends-on-dangerous-waters-and-losses/\" aria-label=\"More on Brace yourself for massive losses &#8211; Crypto trends on dangerous waters\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-11T23:00:30.000Z",
    "title": "Analysts Are Bullish On ADA But Price Keeps Tanking, What’s Going On?",
    "url": "https://www.newsbtc.com/analysis/ada/ada-price-tanking/",
    "description": "One coin that analysts seem to still be bullish on is Cardano’s native token ADA. However, despite all of the faith that remains in the digital asset, the price continues to tank and has fallen below multiple important support levels. Analyst Goes Deep On Cardano In an interview hosted by Altcoin Daily, crypto analyst Hashoshi shares very bullish views on the Cardano network. He starts out by explaining that the design decisions being made by the Cardano network have been some of the better ones in the space. Going further, Hashoshi lauds the development rate of protocols on the blockchain as projects continue to build. Related Reading: Ethereum Whales Send $486 Million To Coinbase, Time To Exit? “Cardano’s done things almost completely different from the start,” the analyst said. “They’re in a good position right now, despite what people might believe, to make a resurgence if the conditions are correct,” he further added. For the price of ADA, the analyst explains that with liquidity coming back into the crypto space, the price of the digital asset could reach above its previous all-time high of $3.10.  “The community is still strong… and I think then you see them outstrip that previous all-time high.” Hashoshi is not the only analyst bullish on the price of ADA going forward. Another analyst Kara Szabo has predicted that the price of the digital asset could climb to $5. Szabo also bought $20,000 worth of ADA at the start of September, signaling the analyst’s conviction on the altcoin’s bullish performance going forward. “My conservative price estimate for the next bull run is $5,” Szabo said on X. “I know some people will think this is low, but this is a 20x from the current price!! For a large market cap alt, this very well may be one of the best plays in crypto at the current price point.” Here is my in-depth #Cardano $ada price prediction for the upcoming bull market. This very well may be the best performing large market cap that investors are sleeping on: ✅ Ada has a max supply of 45,000,000,000 tokens with approximately 35,045,020,830 of those tokens in… pic.twitter.com/k4Hs89q1lG — Kara Szabo (@kararesurrect) September 9, 2023 Cardaon's token plunges to $0.24 &#124; Source: ADAUSD on Tradingview.com But Why Is ADA Price Falling? Despite the bullish sentiment that has enveloped the digital asset, the ADA price has continued to struggle in the market. The reason for this decline can be attributed to a significant amount of ADA being unstaked from smart contracts, causing the total staked ADA to slide downward. Data from DeFi tracker DeFiLlama shows that the total tokens staked on the Cardano network dropped from above 777 million on September 2 to 733 million on September 11. This meant that over 43 million ADA were unstaked and likely made their way to the open market as these holders sold their stash. Staked tokens nosedive in September &#124; Source: DeFiLlama Such a large amount being dumped into the market in a period of low liquidity could see the altcoin continue to drop, especially if more ADA is unstaked to be sold in the open market. Related Reading: Why The Shiba Inu Price Cannot Realistically Get To $0.001 However, ADA’s long-term outlook remains bullish as the Cardano network remains one of the networks with the most developments taking place. As developers flock to the network, investors are expected to follow. At the time of writing, ADA is struggling at $0.24, down 2.33% in the last day and 5.10% in the last week. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]