[
  {
    "source": "Decrypt",
    "date": "2023-09-05T18:49:59.000Z",
    "title": "Epic Games Embraces AI In Games, In Break With Steam",
    "url": "https://decrypt.co/155023/epic-games-embraces-ai-in-games-in-break-with-steam",
    "description": "The two leading online game stores are split over artificial intelligence, setting the stage for a showdown."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-09-05T18:46:28.000Z",
    "title": "Visa Partners With Solana for USDC Payments Integration",
    "url": "https://cryptobriefing.com/visa-partners-with-solana-for-usdc-payments-integration/?utm_source=feed&utm_medium=rss",
    "description": "Visa's new pilot program uses Solana's high-speed blockchain for sending and receiving USDC."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T18:56:25.000Z",
    "title": "MetaMask unveils new feature allowing users to cash out crypto to fiat",
    "url": "https://www.cryptopolitan.com/metamask-unveils-new-feature-allowing-users-to-cash-out-crypto-to-fiat/",
    "description": "In a significant update, MetaMask Portfolio has rolled out a new Sell feature that enables users to easily convert their cryptocurrencies into fiat currencies like USD, EUR, and GBP. This addition aims to provide a more self-sufficient Web3 experience by reducing the number of intermediaries involved in the conversion process. A diverse array of vetted ... <a title=\"MetaMask unveils new feature allowing users to cash out crypto to fiat\" class=\"read-more\" href=\"https://www.cryptopolitan.com/metamask-unveils-new-feature-allowing-users-to-cash-out-crypto-to-fiat/\" aria-label=\"More on MetaMask unveils new feature allowing users to cash out crypto to fiat\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-05T19:00:29.000Z",
    "title": "Crypto Analyst Presents Bull Case For XRP Price To Hit $130, Here’s When",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-130/",
    "description": "The XRP price has been showing promises of a price spike since Ripple’s victory against the US SEC. Many community members are currently keeping a close eye on the cryptocurrency, and hoping for a significant price increase. One crypto analyst, in particular, has predicted a massive run for the altcoin that could see its price hit triple-digits. XRP Predicted To Reach $130 In Next Bull Run Following its partial victory against the United States Securities and Exchange Commission (SEC) in July after Judge Analisa Torres ruled in favor of Ripple labs, XRP, the native token of Ripple, has fluctuated heavily despite the positive sentiment surrounding it. Nevertheless, an analyst sees a potential bull run for the altcoin. Related Reading: Can Ripple Control The XRP Price? Crypto Analysts Weigh In Crypto analyst and XRP influencer, XRP Captain, has predicted a significant price jump for the XRP token on an X (formerly Twitter) post.  XRP Captain shared a chart with a symmetrical triangle pattern which he used to predict XRP’s $130 future price movement. Apparently, XRP has a history of symmetrical triangle patterns. In 2017, the cryptocurrency broke out of a similar symmetrical triangle pattern which pushed the token to new all-time highs. As for when this will happen, the analyst points toward the expected 2024 bull run. Can You Imagine The Magnitude When This Breakout Happens💥💥?? I Won&#8217;t Be Surprised If #XRP Hit 100$ To 130$ In Next Bullrun🚀🚀🚀. #XRP Consolidation 2014 To 2017 VS 2018 To 2024. Full Throttle #XRPHolders #XRPCommunity pic.twitter.com/gm9hLiqh6M — XRP CAPTAIN (@UniverseTwenty) September 3, 2023 The analyst is not the only one who has predicted a bull run for the altcoins. Earlier in August, a pseudonymous analyst also predicted a massive rally for XRP that could see the token reaching its previous all-time high of $3.  In this case, the analyst highlighted that the XRP/BTC pair had finally reclaimed the 20-day and 50-day moving averages, and the last time this had happened had also been back in 2017. This led to an over 500% increase in the price of the altcoin at the time. This is the first time we have seen this for $XRP in 5 years! 😱$XRP / $BTC on the monthly timeframe has reclaimed the 20 and 50 SMA. 📈 Not only this, but it has also wicked back to the 50 SMA to test it as support (if we continue to hold out the month). 🎯 The last time we… pic.twitter.com/d5zjzwcTvm — Cryptoinsightuk (@Cryptoinsightuk) August 13, 2023 Token continues to fluctuate above $0.5 &#124; Source: XRPUSD on Tradingview.com Crypto Community Uncertain About Analyst XRP Price Prediction Following XRP Captain’s prediction of XRP&#8217;s possible bull run, other crypto analysts have also shared their thoughts on the sheer incredulity of the prediction.  Another crypto trader and chartist, JD was enthusiastic about the technical patterns XRP price charts were displaying. He explained that the symmetrical triangle was accurately represented. However, he could not see the price of XRP reaching three digits. “I just can&#8217;t see that 3 digit target. $20s are still in the cards though,” he stated.  Related Reading: Pro-XRP Legal Expert Takes The Spotlight With Daring Ripple Vs SEC Settlement Theory XRP price has also been notably down. However, XRP Whales are not deterred as these large investors are taking advantage of the market downturns and buying up hundreds of millions worth of tokens.  XRP is currently looking toward a reversal with its price seeing meager gains of 0.02% in the last day. However, it is still struggling on the weekly chart with losses of 2.61%. Featured image from Zipmex, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-05T19:00:10.000Z",
    "title": "Robinhood Adds Dogecoin (DOGE) and Bitcoin (BTC), VC Spectra Generates Massive ROI",
    "url": "https://www.crypto-news-flash.com/robinhood-adds-dogecoin-doge-and-bitcoin-btc-vc-spectra-generates-massive-roi/",
    "description": "<img width=\"512\" height=\"301\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T210652.879.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T210652.879.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T210652.879-300x176.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Although Robinhood&#8217;s wallet users can now engage in sending and receiving Bitcoin (BTC) and Dogecoin (DOGE), investors are eyeing relatively novel promising coins like VC Spectra (SPCT).  VC Spectra (SPCT) is one of the best DeFi projects positioned to bring 900% ROI to its early investors. Let’s see if it can overtake the well-established BTC [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-05T19:00:05.000Z",
    "title": "*NEW* As Cardano Profits Slide, Investors Look to Optimism and Domini for Fresh Gains",
    "url": "https://www.crypto-news-flash.com/new-as-cardano-profits-slide-investors-look-to-optimism-and-domini-for-fresh-gains/",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T202828.996.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T202828.996.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T202828.996-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T202828.996-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T202828.996-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T202828.996-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cardano ($ADA) showed bearish movement in the days leading up to September 1, 2023. Optimism ($OP) followed suit by declining significantly during the same period. While both coins struggled, Domini ($DOMI) emerged as a good crypto to buy with its ongoing presale. But before we discuss Domini, let’s take a closer look at Cardano and [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-05T18:45:29.000Z",
    "title": "London Stock Exchange Operator in Talks With Government To Launch New Blockchain-Powered Trading Venue: Report",
    "url": "https://dailyhodl.com/2023/09/05/london-stock-exchange-operator-in-talks-with-government-to-launch-new-blockchain-powered-trading-venue-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/talks-new-trading-venue.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/talks-new-trading-venue.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/talks-new-trading-venue.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/talks-new-trading-venue.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/talks-new-trading-venue.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/talks-new-trading-venue.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/talks-new-trading-venue.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The London Stock Exchange Group (LSEG) is developing a new blockchain-powered trading venue, according to a new report. Murray Roos, a group head of capital markets at LSEG, tells the Financial Times that his company is &#8220;definitely not building anything around crypto assets.&#8221; Rather, Roos says they plan to use blockchain technology to make traditional [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/05/london-stock-exchange-operator-in-talks-with-government-to-launch-new-blockchain-powered-trading-venue-report/\">London Stock Exchange Operator in Talks With Government To Launch New Blockchain-Powered Trading Venue: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]