[
  {
    "source": "Decrypt",
    "date": "2024-02-16T19:26:18.000Z",
    "title": "Craig Wright Liked Karate So He Must Have Invented Bitcoin, Sister Testifies",
    "url": "https://decrypt.co/217891/craig-wright-sister-karate-eccentric-satoshi-nakamoto",
    "description": "“Being associated with Wright is not great for marketing,” an nChain patent attorney also told the court."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-16T19:25:00.000Z",
    "title": " Starknet’s airdrop dilemma, ETH gas fees hit 8-month high: Finance Redefined ",
    "url": "https://cointelegraph.com/news/starknet-airdrop-eth-gas-fees-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNmE1MDBiMDctNjg4Yi00YTIxLTk1NzktNTRlMzNjYTA0ZDUyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>ETH gas fees hit an eight-month-high amid the ERC-404 token craze, while the Starknet network deals with an ongoing airdrop frenzy.</p>\n                    <p><p data-ct-non-breakable=\"true\">Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>Last week in DeFi witnessed the Starknet airdrop frenzy, with many users claiming to have received a bare minimum of the expected airdrop or none. Meanwhile, Uniswap’s founder warned against a new Ethereum Name Service (ENS) domain scam.</p><p>Ethereum gas fees hit a new 8-month high amid the ERC-404 craze, while EigenLayer became the fourth-largest restaking protocol with $7 billion in total value locked (TVL).</p><p><a href=\"https://cointelegraph.com/news/starknet-airdrop-eth-gas-fees-finance-redefined\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-16T19:12:59.000Z",
    "title": " Your right to bear AI could soon be infringed upon ",
    "url": "https://cointelegraph.com/news/right-bear-ai-artificial-intelligence-infringed-upon",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZGViMTRhOTctMzM3MC00NDc5LWIxYzctYjlhZWU2MWEzZmNlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The more powerful artificial intelligence becomes, the more challenging it will be to regulate it without restricting civil liberties. </p>\n                    <p><p>The only way to combat the malicious use of artificial intelligence (AI) may be to continuously develop more powerful AI and put it in government hands.</p><p>That seems to be the conclusion a team of researchers came to in a recently published paper <a href=\"https://www.cser.ac.uk/media/uploads/files/Computing-Power-and-the-Governance-of-AI.pdf\" target=\"_blank\" rel=\"noopener nofollow\">entitled</a> “Computing power then governance of artificial intelligence.”</p><p>Scientists from OpenAI, Cambridge, Oxford, and a dozen other universities and institutes conducted the research as a means of investigating the current and potential future challenges involved with governing the use and development of AI.</p><p><a href=\"https://cointelegraph.com/news/right-bear-ai-artificial-intelligence-infringed-upon\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-16T19:30:36.000Z",
    "title": "BRICS Watch: When can we expect Saudi Arabia’s entry?",
    "url": "https://www.cryptopolitan.com/when-can-we-expect-saudi-arabia-brics-entry/",
    "description": "As the BRICS alliance unfurls its welcoming banner to new members, the world watches with bated breath, particularly for Saudi Arabia&#8217;s pivotal decision on joining this economic powerhouse bloc. The 15th summit of BRICS, held in August of last year, marked a significant expansion with invitations extended to six nations, including the heavyweight oil titan, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-16T19:28:00.000Z",
    "title": "Binance Coin Price Prediction 2024-2033: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2024-2033 After notable changes in its executive team, Binance has shown notable resilience and prospects for recovery. The departure of Changpeng Zhao, Binance&#8217;s CEO, who was also embroiled in legal challenges, initially caused a decline in the value of Binance Coin (BNB). Despite this initial setback, the cryptocurrency has shown a [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-16T19:19:00.000Z",
    "title": "Starknet futures surge ahead of 700m token airdrop",
    "url": "https://crypto.news/starknet-futures-surge-ahead-of-700m-token-airdrop/",
    "description": "As Starknet gears up for its highly anticipated STRK token airdrop on Feb. 20th, the perpetual futures market for STRK is witnessing a surge in trading activity. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-16T19:30:48.000Z",
    "title": "Cardano (ADA) To Break $8 In Bull Run: Analyst Predicts Timeline",
    "url": "https://www.newsbtc.com/news/cardano/cardano-ada-break-8-bull-run-analyst-timeline/",
    "description": "An analyst has explained that if history repeats for Cardano (ADA), its price could break $8. Here&#8217;s when this might happen for the asset. Cardano Has Been Mirroring Past Price Pattern Recently In a new post on X, analyst Ali has discussed a potential breakout happening in the weekly price of Cardano. ADA has appeared to have surged above a long parallel consolidation channel in this latest breakout. Related Reading: These Are The Altcoins Drawing Whale Interest, Santiment Reveals Below is the chart shared by the analyst that shows this recent pattern in the price of cryptocurrency. The pattern that the ADA weekly price has been displaying recently &#124; Source: @ali_charts on X As the graph shows, ADA had been moving inside a parallel channel until the recent surge toward the upside came. In technical analysis, a &#8220;parallel channel&#8221; refers to the region enclosed by two parallel trendlines. This pattern forms when the asset trades sideways inside a specific range. The upper line of the channel can be a source of resistance for the asset; thus, reversals towards the downside can likely take place after retests of it. Similarly, the lower line can be a probable point for bottoms to take form. However, breaks out of either of these lines imply a potential strong continuation of the trend in that direction. This means an escape above the channel can be a bullish signal for the price, while a drawdown under it can be a bearish predictor. During 2019-2020, Cardano was also stuck in consolidation inside a parallel channel similar to the one witnessed recently, as Ali highlighted in the chart. In this previous period, the cryptocurrency had eventually managed to break above the channel, leading to the 2021 bull run. In total, the asset enjoyed a rally of 3,200% back then. The coin&#8217;s trajectory inside the latest channel ended up being similar to that one, and recently, the ADA price has also broken beyond the channel in a fashion that has been reminiscent of the break of the previous one. After the previous break, the coin rallied for a bit and then returned to retest the upper level of the channel, which has been repeated this time as well. The difference this time, however, is that Cardano appears to be heading up now, which took a bit more time to happen last time around. Related Reading: Bitcoin Signal That Has Held Since December Says It’s Time To Sell &#8220;The Cardano breakout may come earlier than expected!&#8221; notes the analyst. &#8220;Still, if history repeats itself, we are anticipating ADA to rise to $0.80, retrace to $0.60, and then enter a bull run toward $8 by January 2025!&#8221; If the cryptocurrency follows this path set by history, the rally toward the $8 level would mean a total uplift of more than 1,200% from the coin&#8217;s current price. ADA Price Cardano has enjoyed a surge of more than 11% in the past week and has risen to the $0.60 mark. Looks like the price of the coin has been rapidly moving up in the last few days &#124; Source: ADAUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com"
  }
]