[
  {
    "source": "Cointelegraph",
    "date": "2023-11-30T09:43:47.000Z",
    "title": "Binance settlement ‘net positive’ for cryptocurrency industry — Mike Novogratz",
    "url": "http://cointelegraph.com/news/binance-settlement-positive-for-cryptocurrency-industry-mike-novogratz",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/4f336abb-c2ac-4454-85cb-61c505e4f97b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Galaxy Digital CEO Mike Novogratz believes Binance has satisfied regulators and users after its $4.3 billion settlement with United States authorities.</p>\n                    <p><p>Binance’s $4.3 billion <a href=\"https://cointelegraph.com/news/binance-timeline-settlement-us-government\"></a><a href=\"https://cointelegraph.com/news/binance-timeline-settlement-us-government\">settlement with the United States Department of Justice (DOJ)</a> is being hailed as a positive move for the company and the wider cryptocurrency industry, according to Galaxy Digital’s <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/mike-novogratz\">Mike Novogratz</a>.</p><p>In an <a href=\"https://www.bloomberg.com/news/audio/2023-11-29/mike-novogratz-talks-markets-binance\" target=\"_blank\" rel=\"noopener nofollow\">interview</a> with Bloomberg on Nov. 29, the CEO of the cryptocurrency investment firm expressed his belief that the high-profile settlement should assuage concerned investors and users of the global exchange:</p><blockquote>“I think they’re de-risked in lots of ways. People were worried about dealing with Binance. There’s a lot less to worry about now.”</blockquote><p>Novogratz also weighed in on the considerations for major investment firms dealing with exchanges, as well as traditional finance (TradFi) players, with regulatory oversight continuing to take center stage in the United States.</p><h2>Binance didn’t steal money</h2><p>The Galaxy Digital CEO said that a reasonable approach underpinned by investments and relationships with companies that “take their jobs seriously” remains key while stressing that mainstream finance has also found itself on the wrong side of regulators in recent years.</p><p>“If you went through the list of TradFi banks who have been sanctioned or fined by different regulators in the last 24 months, it’s a shocking list. So you’re not looking for zero mistakes, otherwise, there’d be no one to deal with,” Novogratz said.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/crypto-exchange-failures-present-strong-case-for-mica-regulation\">FTX collapse, Binance’s US settlement provide strong case for MiCA regulations</a></em></strong></p><p>He added that concerns over Binance potentially being shut down or that the exchange had “stolen people’s money” in a situation <a href=\"https://cointelegraph.com/news/ftx-bankruptcy-court-approval-selling-trust-assets-grayscale-bitwise\">similar to FTX</a> simply was not the case:</p><p>“It came down to some pretty serious violations of KYC [Know Your Customer] protocols, and they’ve worked to correct them, they paid their fine, and they’re moving on,” the Galaxy Digital CEO said.</p><blockquote>“I think it’s a net positive for their company. I think it’s a net positive for our industry.”</blockquote><h3>Bitcoin price “will be significantly higher”</h3><p>Novogratz also <a href=\"https://cointelegraph.com/news/bitcoin-etf-will-drive-adoption-in-2024-mike-novogratz\">weighed in continued anticipation</a><a href=\"https://cointelegraph.com/news/bitcoin-etf-will-drive-adoption-in-2024-mike-novogratz\"></a> of a Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) <a href=\"https://cointelegraph.com/bitcoin-price\">being approved in the U.S.</a> and the looming mining reward halving in 2024.</p><p>“There’s a bunch of good things happening for Bitcoin. We are going to get an ETF. There’s a lot of anticipation, and some of that’s built into the price,” Novogratz said.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/binance-us-plea-deal-crypto-adoption\">Why Binance’s US plea deal could be positive for crypto adoption</a></em></strong></p><p>The investor added that if and when an ETF is approved, a number of investment and asset managers, including the likes of BlackRock, Fidelity, ARK Invest and Galaxy Digital, will mobilize their sales forces to convince people to adopt Bitcoin:</p><blockquote>“The price is going to be significantly higher, especially at a time when the Fed is probably cutting rates. Could we go to old highs by this time next year? Of course we could.”</blockquote><p>Novogratz also noted that the Bitcoin halving sets things up for “a wonderful story,” while the 2024 U.S. elections could also play a role.</p><p>“That uncertainty should help Bitcoin in the fact that the U.S., Europe and Japan still can’t come close to being fiscally responsible is why people got invested in Bitcoin in the first place,” Novogratz said.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/cuba-bitcoin-revolution-adoption-embargo/\">The truth behind Cuba’s Bitcoin revolution: An on-the-ground report</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-30T09:59:48.000Z",
    "title": "Sam Altman retakes OpenAI helm with a reshaped board featuring Microsoft visibility",
    "url": "https://cryptoslate.com/sam-altman-retakes-openai-helm-with-a-reshaped-board-featuring-microsoft-influence/",
    "description": "<p>Sam Altman has officially returned as OpenAI&#8217;s CEO, one week after the AI company reached an agreement in principle to reinstate him, with new changes to the board composition granting Microsoft a seat on the table. In a Nov. 29 memo, Altman revealed that Mira Murati will return to her previous role as chief technology [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/sam-altman-retakes-openai-helm-with-a-reshaped-board-featuring-microsoft-influence/\">Sam Altman retakes OpenAI helm with a reshaped board featuring Microsoft visibility</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-30T10:00:00.000Z",
    "title": "NEO’s GAS surges 182%: exploring possible drivers",
    "url": "https://crypto.news/neos-gas-surges-182-exploring-possible-drivers/",
    "description": "NEO's GAS rose 182% last month. Analysts are now looking at other projects, like Galaxy Fox, assessing their growth potential"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-30T09:45:24.000Z",
    "title": "Online bank SoFi exits crypto market, urges customers to withdraw assets",
    "url": "https://crypto.news/online-bank-sofi-exits-crypto-market-urges-customers-to-withdraw-assets/",
    "description": "Online banking firm SoFi Technologies is leaving the crypto market, urging customers to migrate assets to Blockchain.com. SoFi Technologies Inc., an online banking platform, is set to leave the cryptocurrency market as the firm has notified its customers they need&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-30T09:43:18.000Z",
    "title": "Whales move over 5,500 BTC as the price falls below $38k",
    "url": "https://crypto.news/whales-move-over-5500-btc-as-the-price-falls-below-38k/",
    "description": "Two major Bitcoin (BTC) whales have moved over 5,500 coins as the asset falls below the $38,000 mark.&#160; According to data provided by Whale Alert, an unknown Bitcoin whale moved 3,000 coins from an old address to a new wallet&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-30T09:40:23.000Z",
    "title": "USTC Explodes 335% In Fresh Bullish Streak – What’s Pushing The Price Up?",
    "url": "https://www.newsbtc.com/news/ustc-explodes-335-in-fresh-bullish-streak-whats-pushing-the-price-up/",
    "description": "USTC experienced an impressive surge this week, propelled by two key catalysts: a newly introduced Binance perpetuals contract listing and the unveiling of a bitcoin-focused makeover along with an enticing airdrop initiative. Notably, TerraClassicUSD&#8217;s value has nearly quadrupled within this period. It&#8217;s essential to contextualize this surge, however, as even with the substantial rally, the price of USTC has reached only $0.05, a stark contrast to its initial pegged value of $1. Related Reading: Mark Your Calendars: Bitcoin To Hit $100,000 By End Of 2024, Standard Chartered Says USTC Meteoric Rise: Navigating The Volatility Of The Crypto The developments surrounding USTC underscore the dynamic and evolving nature of the cryptocurrency market, where a combination of strategic listings and innovative plans can significantly impact token valuations. Source: Coingecko The value of the coin has increased significantly during the past day. Coingecko statistics shows that USTC surged a massive 32% to $0.05 in the previous day. Even more astonishingly, the cryptocurrency gained a commanding 335% over the previous seven days. During the specified period, its trading volume increased by 2,284%, with $1.21 billion exchanged. Between November 25 and 27, the crypto surged over 400% before falling down to $0.04. USTC has increased by +71% to its current level since then. A significant increase in trading volume in the hours preceding the sibling token Terra Luna Classic (LUNC) listing on Binance Futures earlier this week helped the cryptocurrency. USTCUSDT currently trading at $0.05314 on the daily chart: TradingView.com &#160; Now that Binance has disclosed that USTC will have more trading pairs available on the spot market, the purchase pressure is still present. The Turkish Lira (TRY) and First Digital USD (FDUSD), two more stablecoins, are now immediately tradeable with USTC with fiat cash. Additionally, the development team disclosed a few days ago that they are developing an airdrop strategy for holders of LUNC and USTC. $ust &#38; anchor making a return, this time backed by bitcoin will be interesting to see the stablecoin experiment continue airdropped planned for pre-crash $luna &#38; $ust holders and also new $ustc holders via some sort of lockdrop could be a decent play for $ustc here just in… https://t.co/7BWe8MXkoq — IAN (@cryptoian) November 25, 2023 The token has become the subject of a speculative frenzy due to recent developments. According to CoinGecko data, trading volume with USTC has increased dramatically over the past few days, reaching a peak of over $1 billion in 24-hour activity and dwarfing the less than $10 million average earlier this month. Related Reading: Is $20 On The Cards? LINK Price Rides High With Chainlink Staking v0.2 Rollout The Influence Of Binance Perpetual Contract And Social Media Buzz USTC has been rising sharply since the weekend. Its price started a run on Nov. 25, not long after what looked to be a golden cross on its chart. Strong price increases ensued, with USTC hitting a high of $0.075 during today&#8217;s trading session. If you are thinking about how this #LUNC and #USTC pump is gonna end, well, the news is that it won&#8217;t And it&#8217;s visible here why $42M of contracts are pending right now while people are adding onto this The meaning of Open Interest is also written here Check for yourself 😎🍷 pic.twitter.com/q9fEIv42Rs — Aru Basu (@klothtweets) November 27, 2023 There is no denying that the euphoria around Binance&#8217;s introduction of a perpetual contract contributed to the rise of the USTC coin. Social media has also been a big part of making this excitement even bigger. It&#8217;s created a wave of interest and energy that has put USTC at the top of the crypto market. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Freepik"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-30T09:58:39.000Z",
    "title": "2 Positive Signals Before Bitcoin’s Halving",
    "url": "https://www.altcoinbuzz.io/spotlight/2-positive-signals-before-bitcoins-halving/",
    "description": "<p>Recent indicators suggest a robust improvement in Bitcoin&#8217;s network health ahead of the upcoming halving in April. Notably, the network&#8217;s hash rate reached a record 500 exahashes per second, spotlighting the current high level of mining activity and, consequently, the network&#8217;s safety. So, here are some positive signs that the market is giving us before [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/spotlight/2-positive-signals-before-bitcoins-halving/\">2 Positive Signals Before Bitcoin&#8217;s Halving</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-30T10:03:12.000Z",
    "title": "BTC Transaction Surge Causes Service Disruption in Trust Wallet",
    "url": "https://coinedition.com/btc-transaction-surge-causes-service-disruption-in-trust-wallet/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/Crypto-Wallet-2-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Trust Wallet, the self-custody crypto wallet provider, announced disruptions to its Bitcoin services and warned users may experience failed transactions following a surge in activity on the Bitcoin blockchain.  In a post shared on X, Trust Wallet said the company is experiencing a BTC node issue caused by an increase in transactions per block on [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/btc-transaction-surge-causes-service-disruption-in-trust-wallet/\">BTC Transaction Surge Causes Service Disruption in Trust Wallet</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]