[
  {
    "source": "CoinDesk",
    "date": "2023-09-04T09:19:34.000Z",
    "title": "Larry David’s Superbowl Ad Casts Doubt on FTX.US Separation, DOJ Says",
    "url": "https://www.coindesk.com/policy/2023/09/04/larry-davids-superbowl-ad-casts-doubt-on-ftxus-separation-doj-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Sam Bankman-Fried says the FTX exchange’s bankruptcy isn’t relevant to the October fraud trial"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-04T09:30:42.000Z",
    "title": "FTX founder Sam Bankman-Fried fights against prosecutors’ evidence in upcoming fraud trial",
    "url": "https://cryptoslate.com/ftx-founder-sam-bankman-fried-fights-against-prosecutors-evidence-in-upcoming-fraud-trial/",
    "description": "<p>Lawyers for FTX founder Samuel Bankman-Fried filed court papers Friday, Sept. 1, opposing several motions by federal prosecutors to admit specific evidence at his upcoming trial on fraud and conspiracy charges. Bankman-Fried&#8217;s attorneys argued prosecutors should not be allowed to introduce evidence related to charges previously dropped or severed from the case. Those include alleged [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ftx-founder-sam-bankman-fried-fights-against-prosecutors-evidence-in-upcoming-fraud-trial/\">FTX founder Sam Bankman-Fried fights against prosecutors&#8217; evidence in upcoming fraud trial</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-04T09:14:33.000Z",
    "title": "Ripple’s “Victory Party” Unlikely to Feature IPO or SEC Settlement Announcements, Says Crypto Lawyer John Deaton",
    "url": "https://www.cryptoglobe.com/latest/2023/09/ripples-victory-party-unlikely-to-feature-ipo-or-sec-settlement-announcements-says-crypto-lawyer-john-deaton/",
    "description": "As Ripple prepares for its “community celebration” on September 29 in New York City, speculation has been rife about whether the event will feature significant announcements like an IPO or a full settlement with the U.S. Securities and Exchange Commission (SEC). John Deaton, an American who has been closely monitoring the SEC v. Ripple Labs […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-04T09:30:13.000Z",
    "title": "Latam Insights: Worldcoin Breaks Records in Argentina, Circle Brings USDC to Chile",
    "url": "https://news.bitcoin.com/latam-insights-worldcoin-breaks-records-in-argentina-circle-brings-usdc-to-chile/",
    "description": "<img width=\"696\" height=\"392\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1827932012-1.webp\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Latam Insights: Worldcoin Registers Records in Argentina, Circle Brings USDC to Chile\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" />Welcome to Latam Insights, a compendium of Latin America&#8217;s most relevant crypto and economic news during the last week. In this issue: Worldcoin reaches record verifications in Argentina, Circle partners with Mercado Pago to bring USDC to Chile, and Binance launches a Latam-focused remittance solution. Worldcoin Reaches Record Verifications in Argentina Worldcoin, the biometric ID [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-04T09:37:49.000Z",
    "title": "China’s digital yuan gets a game-changing makeover",
    "url": "https://www.cryptopolitan.com/chinas-digital-yuan-gets-a-makeover/",
    "description": "Changchun Mu, the director of the Digital Currency Research Institute of the People&#8217;s Bank of China, made an intriguing announcement regarding China&#8217;s central bank digital currency (CBDC), also known as the digital yuan on September 3. Speaking at the annual China International Service Trade Fair, Mu highlighted the ongoing technological and business model upgrades that ... <a title=\"China&#8217;s digital yuan gets a game-changing makeover\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chinas-digital-yuan-gets-a-makeover/\" aria-label=\"More on China&#8217;s digital yuan gets a game-changing makeover\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-04T09:17:38.000Z",
    "title": "Advanced AI Poised to Reshape Key Australian Industries: Groundbreaking Study",
    "url": "https://www.cryptopolitan.com/ai-to-reshape-industries-in-australia/",
    "description": "Pioneering AI technology is on the verge of bringing sweeping alterations to several crucial sectors in Australia, as per the latest research by Deloitte Access Economics in collaboration with the Deloitte AI Institute. This groundbreaking investigation unveils that Finance, ICT and media, professional services, education, and wholesale trade constitute nearly 26 percent of the Australian ... <a title=\"Advanced AI Poised to Reshape Key Australian Industries: Groundbreaking Study\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-to-reshape-industries-in-australia/\" aria-label=\"More on Advanced AI Poised to Reshape Key Australian Industries: Groundbreaking Study\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-04T09:21:27.000Z",
    "title": "Chainlink partners with SWIFT while Ethereum stumbles, investors eyeing Domini",
    "url": "https://crypto.news/chainlink-partners-with-swift-while-ethereum-stumbles-investors-eyeing-domini/",
    "description": "Domini was widely explored by investors as Chainlink partnered with SWIFT and Ethereum posted losses"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-04T09:30:42.000Z",
    "title": "Pro-XRP Legal Expert Takes The Spotlight With Daring Ripple Vs SEC Settlement Theory",
    "url": "https://www.newsbtc.com/ripple-2/xrp-ripple-sec-settlement/",
    "description": "There have been talks about the US Securities and Exchange Commission (SEC) and Ripple Labs reaching a settlement following the ruling that XRP isn’t a security. Following this, Pro-XRP lawyer John Deaton has stated a key factor that could lead to a settlement between both parties. Coinbase’s Motion Key To Settlement In a tweet released on the X (formerly Twitter) platform, Deaton stated that the “only way” the SEC and Ripple can settle this year is if Judge Failla grants Coinbase’s motion to dismiss the SEC’s lawsuit against it.  Related Reading: Shiba Inu Marketing Lead Sends Important Message To SHIB Holders The lawyer believes that the key is for Judge Failla to find that token sales on an exchange as part of a programmatic sale do not fall under US securities laws. If that happens, the Commission and its chair, Gary Gensler, may have no choice but to “pivot,” according to Deaton.  He further noted that Judge Failla’s ruling may be final as he doubts the Solicitor General would allow an appeal as the case could end up reaching the Supreme Court, which could “strip away” the SEC’s powers and that of other federal agencies. The SEC had filed a lawsuit against Coinbase, alleging that the biggest crypto exchange in the US was operating as an unregistered securities exchange by offering several cryptocurrencies on its platform without first registering with the SEC.  In response, Coinbase filed a motion to dismiss the case, stating that the regulator was stepping outside its jurisdiction with such an action. The exchange said the token sales weren’t investment contracts but more commodity sales, with “obligations on both sides discharged” once the transaction occurred. Interestingly, Coinbase cited Judge Torres’ ruling in favor of Ripple that programmatic sales, such as ones on exchanges, didn’t constitute investment contracts.  XRP price remains volatile as legal battle continues &#124; Source: XRPUSDT on Tradingview.com How Deaton’s Ripple Settlement Theory Could Play Out Going by Deaton’s theory, it is believed that the SEC would want to settle with Ripple if the court ruled that the Commission has no jurisdiction over token sales on exchanges. This is plausible because Judge Failla granting Coinbase’s request represents a setback for the Commission in its case against Ripple.  The SEC argues that Ripple’s programmatic sales constituted an investment contract, making XRP a security.  However, a win for Coinbase ultimately makes the programmatic sales argument baseless, and it can no longer further the argument since token sales on exchanges are outside its purview.  Related Reading: New Job Listing Indicates What Ripple Is Focusing On Next Regarding the SEC and Gensler wanting to “pivot,” as mentioned by Deaton, this could mean the Commission solely focusing on Ripple’s sale to institutional investors, which the court ruled constituted an investment contract.  Considering that the regulator still has a long way to go to prove which institutional sales were made to domestic investors (the only ones the SEC has jurisdiction over), it may settle with Ripple rather than prolong a case it may eventually lose.  Featured image from Unsplash, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-04T09:15:09.000Z",
    "title": "Ethereum Creator Vitalik Buterin Sells All Remaining MKR Tokens After Two Years of Inactivity: On-Chain Data",
    "url": "https://dailyhodl.com/2023/09/04/ethereum-creator-vitalik-buterin-sells-all-remaining-mkr-tokens-after-two-years-of-inactivity-on-chain-data/",
    "description": "<img width=\"1024\" height=\"585\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Names-Crypto-Use-Cases.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Names-Crypto-Use-Cases.jpg 1568w, https://dailyhodl.com/wp-content/uploads/2023/03/Names-Crypto-Use-Cases.jpg?resize=300,171 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Names-Crypto-Use-Cases.jpg?resize=768,439 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Names-Crypto-Use-Cases.jpg?resize=1024,585 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Names-Crypto-Use-Cases.jpg?resize=1536,878 1536w, https://dailyhodl.com/wp-content/uploads/2023/03/Names-Crypto-Use-Cases.jpg?resize=750,429 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Names-Crypto-Use-Cases.jpg?resize=1140,651 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ethereum (ETH) co-founder Vitalik Buterin has sold off the rest of his Maker (MKR) tokens after not making any moves for two years, on-chain data shows. First spotted by blockchain tracking firm Lookonchain, Etherscan data shows Buterin&#8217;s Ethereum address trading 500 MKR for 353 ETH, worth about $580,000. The trade came 861 days after Buterin&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/04/ethereum-creator-vitalik-buterin-sells-all-remaining-mkr-tokens-after-two-years-of-inactivity-on-chain-data/\">Ethereum Creator Vitalik Buterin Sells All Remaining MKR Tokens After Two Years of Inactivity: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]