[
  {
    "source": "Decrypt",
    "date": "2023-05-26T20:16:42.000Z",
    "title": "There's Now a Dollar-Backed Stablecoin on Bitcoin Using Ordinals Protocol",
    "url": "https://decrypt.co/142548/usd-backed-stablecoin-on-bitcoin-using-ordinals-protocol",
    "description": "Stably debuted Stably USD in 2019. It's got a $7 million market capitalization across 11 blockchains, according to its April attestation."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-26T20:30:00.000Z",
    "title": "a16z releases anonymous voting system for Ethereum",
    "url": "https://cointelegraph.com/news/a16z-releases-anonymous-voting-system-for-ethereum",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/84dbea8a-82d3-400d-98c9-dcf0f32a79da.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> The system uses “time-lock puzzles” to encrypt the contents of votes, making them unreadable until balloting has finished.</p>\n                    <p><p>Venture capital fund Andreessen Horowitz, also known as “a16z,” has released a Solidity library that can be used for anonymous voting on Ethereum. Called “Cicada,” the library <a href=\"https://a16zcrypto.com/posts/article/building-cicada-private-on-chain-voting-using-time-lock-puzzles/\" target=\"_blank\" rel=\"noopener nofollow\">prevents</a> an individual voter’s choice from being known before polling ends. When combined with zero-knowledge (ZK) group membership systems like Semaphore, it can also make the identity of the voter permanently unknowable, according to a May 24 blog post from a16z engineer Michael Zhu.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Excited to announce Cicada: a new building block for private on-chain voting.  <a href=\"https://t.co/hxE4KL4Se6\">https://t.co/hxE4KL4Se6</a></p>&mdash; moodle zoup (@moodlezoup) <a href=\"https://twitter.com/moodlezoup/status/1661404731254915073?ref_src=twsrc%5Etfw\">May 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Cicada relies on time-lock puzzles, a type of cryptography that allows users to encrypt secret values that can only be decrypted after a specific period of time has passed, Zhu stated. </p><p>These puzzles have been around since 1996. But before 2019, they would have required users to reveal their secret values once the time period had passed. In voting systems, this could have caused problems with users submitting votes and then going offline, preventing all the votes from being countable.</p><p>In 2019, the concept of “homomorphic” time-lock puzzles was <a href=\"https://eprint.iacr.org/2019/635.pdf\" target=\"_blank\" rel=\"noopener nofollow\">proposed</a> by cryptographers Malavolta and Thyagarajan. This allowed the puzzles to be added together to produce a final puzzle that was much easier to solve than the sum of the individual puzzles. The solution to the final puzzle reveals only the sum of the individual values, without revealing the individual values making up this sum.</p><p>According to the a16z post, Cicada uses these homomorphic puzzles, allowing votes to be counted even if users go offline.</p><p>When attempting to transfer Malavolta and Thyagarajan’s system to the blockchain, a16z researchers ran into an obstacle to creating a fair voting system: each choice needed to be encoded as a boolean value of “1” or “0.” This meant that an attacker could try to increase their voting power by incorrectly encoding the vote, by encoding “100” as their value, for example.</p><p>To solve this problem, Cicada requires voters to submit a zero-knowledge proof of ballot validity along with each ballot, the post said. The proof shows that the vote was encoded correctly, but without revealing the contents of the vote. </p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/anchorage-digital-uses-snapshot-governance-voting\"><strong>Anchorage Digital opens up DeFi voting for custody clients</strong></a></em></p><p>Cicada only prevents votes from being known while the poll is being conducted. Once the “poll has closed” or the time-lock period has passed, any person can determine the contents of a vote by brute-forcing the solution to the puzzle. However, a16z suggested that this problem can be solved by combining Cicada with zero-knowledge group membership systems like Semaphor, Semacaulk, or ZK state proofs. In this case, brute forcing the puzzle will only reveal that the vote was cast by an eligible voter, but will not reveal the credentials used to prove the voter’s eligibility.</p><p>As an example, Zhu provided a link to a sample contract produced using Cicada that also relies on Semaphor to prove voter eligibility.</p><p>Voting systems have long been a component of decentralized autonomous organizations (DAOs), the governing bodies that often manage blockchain apps. But in most cases, DAOs use tokens to represent votes, which means that an individual user can have an outsized influence if they hold a large number of tokens. For example, on May 22, an attacker <a href=\"https://cointelegraph.com/news/attacker-hijacks-tornado-cash-governance-via-malicious-proposal\">took control of Tornado Cash</a> by creating extra votes for themselves through a malicious proposal, using it to drain all of the governance contract’s funds. The attacker later offered to <a href=\"https://cointelegraph.com/news/tornado-cash-attacker-to-potentially-giveback-governance-control-proposal-reveals\">give back control</a> to users.</p><p>Waves Network Founder Sasha Ivanov <a href=\"https://cointelegraph.com/news/daos-will-never-work-without-fixing-governance\">has argued that</a> DAOs must move to a more democratic voting system if governance attacks like these are to be avoided.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-26T20:22:00.000Z",
    "title": "A week filled with exploits and uncertainty for DeFi: Finance Redefined",
    "url": "https://cointelegraph.com/news/finance-redefined-week-filled-with-exploits-and-uncertainty-for-defi",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/cbf517aa-3e6d-43bd-8aa9-0b06908afc28.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>DeFi saw another multimillion-dollar rug pull this past week, and the Multichain saga continues to spiral out of control.</p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/defi-101/defi-a-comprehensive-guide-to-decentralized-finance\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance/amp\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>After a bullish April, May was another month of exploits, rug pulls and hacks, bringing back uncertainty to DeFi. The most prominent headline marker in the past week was the Multichain protocol. The cross-chain DeFi protocol’s delayed node upgrade created a spiral impact and tanked its token price by 30%.</p><p>The Multichain protocol saga impacted multiple DeFi protocols, forcing Binance to suspend deposits for ten bridged tokens on May 25 after days of stuck transactions.</p><p>Multichain aside, the week was dominated by hacks, exploits and rug pulls. A crypto project allegedly ran off with $32 million of customer’s funds, DeFi protocol WDZD Swap was exploited for $1.1 million, and a bug in Aave v2 on Polygon led to the freezing of some assets in the contract. </p><p>The top 100 DeFi tokens had another bearish week, with a slight change from the previous week and most DeFi tokens trading red on the weekly charts.</p><h2>Multichain token plunges 30% on backend upgrade delay</h2><p>On May 24, the price of cross-chain router protocol Multichain’s native MULTI token fell by 30% in 24 hours to trade at $4.97 when reported by Cointelegraph. It has since dropped under the $4 mark. The sell-off came after users reported their multichain funds had not arrived due to a backend node upgrade “taking longer than expected.”</p><p>At the same time, a wallet address linked to layer-1 blockchain developer Fantom Foundation reportedly removed 449,740 MULTI ($2.4 million) from liquidity on the decentralized exchange SushiSwap. Rumors also appear to have fueled the sell-off. In a <a href=\"https://twitter.com/0xfleet/status/1661331752210804736/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">tweet</a> viewed over 300,000 times since publication, one user wrote, “It’s rumored that the multichain team has been arrested by the Chinese police, with 1.5 billion dollars of contract funds under control.” The same day, blockchain analytics firm Lookonchain reported at least $3 million worth of MULTI outflows linked to smart money accounts.</p><p><a href=\"https://cointelegraph.com/news/multichain-token-plunges-30-on-backend-upgrade-delay\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/multichain-token-plunges-30-on-backend-upgrade-delay/amp\"><strong>Continue reading</strong></a></p><h2>Binance suspends deposits for bridged tokens, seeks clarity from Multichain team</h2><p>On May 25, crypto exchange Binance suspended deposits for 10 bridged tokens after days of stuck transactions that sparked uncertainty surrounding the Multichain protocol. </p><p>Affected token pairs include Polkastarter (POLS), Alpaca Finance (ALPACA), Travala.com (AVA), Spell (SPELL), Fantom (<a href=\"https://cointelegraph.com/fantom-ftm-price-index\">FTM</a>), Alchemy (ACH), Beefy (BIFI), SuperVerse (SUPER), Harvest Finance (FARM) and DeXe (DEXE). The move impacts users of bridged tokens on the BNB Smart Chain, Fantom, Ethereum and Avalanche blockchain networks.</p><p><a href=\"https://cointelegraph.com/news/binance-suspends-deposits-for-bridged-tokens-seeks-clarity-from-multichain-team\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-suspends-deposits-for-bridged-tokens-seeks-clarity-from-multichain-team/amp\"><strong>Continue reading</strong></a></p><h2>Project takes off with $31.6 million in alleged exit scam</h2><p>A crypto project called Fintoch — which claimed to be backed by investment banking firm Morgan Stanley — appears to have taken off with almost $32 million of users’ funds, according to on-chain detective ZachXBT. </p><p>In a thread, the crypto sleuth showed a diagram detailing the movement of funds. The on-chain detective alleged that the project had likely conducted an exit scam. The fund promised a 1% daily interest for investments from users. However, users of the platform have started to report that they are now unable to withdraw their funds from Fintoch.</p><p><strong><u></u></strong><a href=\"https://cointelegraph.com/news/project-takes-off-with-31-6m-in-alleged-exit-scam\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/project-takes-off-with-31-6m-in-alleged-exit-scam/amp\"><strong>Continue</strong> </a><a href=\"https://cointelegraph.com/news/project-takes-off-with-31-6m-in-alleged-exit-scam\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/project-takes-off-with-31-6m-in-alleged-exit-scam/amp\"><strong>reading</strong></a></p><h2>DeFi protocol WDZD Swap exploited for $1.1 million: CertiK</h2><p>On May 19, DeFi protocol WDZD Swap was exploited for $1.1 million worth of Binance-Peg Ethereum Token, according to a May 21 report from blockchain security firm CertiK. Binance-Peg Ethereum Token represents Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) bridged to the BNB Smart Chain.</p><p>According to the report, an attacker conducted nine malicious transactions that drained 609 Binance-Peg Ethereum Tokens — worth $1.1 million at the time of the attack — from a contract associated with the WDZD project.</p><p><a href=\"https://cointelegraph.com/news/defi-protocol-wdzd-swap-exploited-for-1-1m-certik\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/defi-protocol-wdzd-swap-exploited-for-1-1m-certik/amp\"><strong>Continue reading</strong></a><strong> </strong></p><h2>Bug in Aave v2 on Polygon causes some assets to become stuck in contracts</h2><p>A bug in an older version of crypto lending protocol Aave is blocking users from interacting with Wrapped Ether (WETH), Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>), Wrapped Bitcoin (WBTC) or Wrapped Matic (WMATIC) pools on Aave v2 on Polygon, preventing assets from being withdrawn from them, according to a May 19 proposal that attempts to fix the bug through a patch. The proposal says that users are currently unable to “supply more of those assets, borrow, repay, or withdraw.“</p><p>Although withdrawals are currently impossible, the team stated that funds are “perfectly safe,” as the bug can be fixed after a governance vote.</p><p><a href=\"https://cointelegraph.com/news/bug-in-aave-v2-polygon-causes-some-assets-to-become-stuck-in-contracts\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bug-in-aave-v2-polygon-causes-some-assets-to-become-stuck-in-contracts/amp\"><strong>Continue reading</strong></a></p><h2>DeFi market overview</h2><p>DeFi’s total market value saw a minor increase this past week. Data from Cointelegraph Markets Pro and TradingView shows that DeFi’s top 100 tokens by market capitalization had another bearish week, with most tokens trading in the red. The total value locked in DeFi protocols remained below the $50 billion mark.</p><p>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T20:35:04.000Z",
    "title": "BBC Studios and Reality+ collaborate to bring iconic brands to The Sandbox metaverse",
    "url": "https://www.cryptopolitan.com/bbc-studios-reality-partner-on-the-sandbox/",
    "description": "The Sandbox comes live on BBC. Reality+ and BBC Studios have teamed up with the aim of bringing immersive experiences from beloved brands like Doctor Who and Top Gear into the rapidly growing metaverse. Fans can now anticipate engaging with their favorite material in The Sandbox&#8217;s dynamic atmosphere and obtaining access to a private BBC ... <a title=\"BBC Studios and Reality+ collaborate to bring iconic brands to The Sandbox metaverse\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bbc-studios-reality-partner-on-the-sandbox/\" aria-label=\"More on BBC Studios and Reality+ collaborate to bring iconic brands to The Sandbox metaverse\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T20:32:55.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T20:21:18.000Z",
    "title": "Gulf Binance receives nod from Thai Ministry of Finance for digital asset operation",
    "url": "https://www.cryptopolitan.com/gulf-binance-receives-nod-from-thai-ministry-of-finance/",
    "description": "Gulf Binance, the alliance between the global cryptocurrency exchange Binance and Gulf Energy&#8217;s innovation arm, Gulf Innova, recently secured a coveted digital asset operator license from Thailand&#8217;s Ministry of Finance. This major development sets the stage for the company to introduce a regulated crypto exchange and broker in Thailand, with a launch anticipated by the ... <a title=\"Gulf Binance receives nod from Thai Ministry of Finance for digital asset operation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gulf-binance-receives-nod-from-thai-ministry-of-finance/\" aria-label=\"More on Gulf Binance receives nod from Thai Ministry of Finance for digital asset operation\">Read more</a>"
  }
]