[
  {
    "source": "CryptoSlate",
    "date": "2023-10-18T20:55:39.000Z",
    "title": "Gensler takes questions on spot Bitcoin ETFs, but keeps cards close to chest",
    "url": "https://cryptoslate.com/gensler-takes-questions-on-spot-bitcoin-etfs-but-keeps-cards-close-to-chest/",
    "description": "<p>U.S. Securities and Exchange Commission (SEC) chair Gary Gensler spoke to Bloomberg about several pending spot Bitcoin (BTC) ETFs on Oct. 18. In his interview, Gensler acknowledged that around ten Bitcoin exchange-traded fund (ETF) proposals are currently awaiting a decision from SEC staff. He noted that he personally cannot pre-judge those proposals and declined to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/gensler-takes-questions-on-spot-bitcoin-etfs-but-keeps-cards-close-to-chest/\">Gensler takes questions on spot Bitcoin ETFs, but keeps cards close to chest</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T21:09:00.000Z",
    "title": "SBF trial shines spotlight on Binance rivalry",
    "url": "https://www.cryptopolitan.com/sbf-trial-shine-spotlight-on-binance-rivalry/",
    "description": "The intense heat from the fraud trial of Sam Bankman-Fried, often referred to as SBF, reveals more than just the alleged misconduct of a crypto magnate. It uncovers a gripping narrative of corporate skirmishes, backhanded maneuvers, and the turbulent downfall of the FTX crypto exchange. The chronicles of SBF&#8217;s fierce contest with Changpeng Zhao, the ... <a title=\"SBF trial shines spotlight on Binance rivalry\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sbf-trial-shine-spotlight-on-binance-rivalry/\" aria-label=\"More on SBF trial shines spotlight on Binance rivalry\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T21:01:33.000Z",
    "title": "How the UK became the Crypto King of Europe",
    "url": "https://www.cryptopolitan.com/how-the-uk-became-the-crypto-king-of-europe/",
    "description": "Dominating the charts, the UK has firmly secured its position as the leading force in cryptocurrency throughout Central, Northern, and Western Europe (CNWE). But what exactly spurred this remarkable rise? What factors steered the UK to the forefront of the crypto race, and what does this signify for the larger global ecosystem? The Numbers Speak ... <a title=\"How the UK became the Crypto King of Europe\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-the-uk-became-the-crypto-king-of-europe/\" aria-label=\"More on How the UK became the Crypto King of Europe\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T20:55:24.000Z",
    "title": "Vitalik Buterin’s $15m crypto transfer: What’s the play?",
    "url": "https://www.cryptopolitan.com/vitalik-buterin-15m-crypto-transfer-the-play/",
    "description": "Cryptocurrency&#8217;s glitzy world always finds itself agog when the heavyweights pull audacious stunts, even if those maneuvers are well within the norms of the digital finance realm. Enter Buterin. In a brash move that had eyebrows raising and tongues wagging, the Ethereum co-creator recently orchestrated a whopping transfer to the tune of $14.9 million in ... <a title=\"Vitalik Buterin&#8217;s $15m crypto transfer: What&#8217;s the play?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/vitalik-buterin-15m-crypto-transfer-the-play/\" aria-label=\"More on Vitalik Buterin&#8217;s $15m crypto transfer: What&#8217;s the play?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T20:48:15.000Z",
    "title": "SEC’s Gensler weighs in on pending Bitcoin ETF applications: Details",
    "url": "https://www.cryptopolitan.com/secs-gensler-weighs-in-on-pending-bitcoin-etf-applications-details/",
    "description": "Securities and Exchange Commission (SEC) Chair Gary Gensler offered a few new insights into the highly-anticipated approval process for spot Bitcoin Exchange-Traded Funds (ETFs) during a recent interview with Bloomberg TV. Without delving into specifics, Gensler stated that the SEC staff is &#8220;doing work on those multiple filings.&#8221; Moreover, the SEC Chair declined to offer ... <a title=\"SEC&#8217;s Gensler weighs in on pending Bitcoin ETF applications: Details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/secs-gensler-weighs-in-on-pending-bitcoin-etf-applications-details/\" aria-label=\"More on SEC&#8217;s Gensler weighs in on pending Bitcoin ETF applications: Details\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-18T20:49:43.000Z",
    "title": "FTX founder Sam Bankman-Fried’s trial day 11: Recap ",
    "url": "https://crypto.news/ftx-founder-sam-bankman-frieds-trial-day-11-recap/",
    "description": "On the 11th day of FTX founder Bankman-Fried’s historic trial, an expert witness reveals how several investments and loans were made from FTX’s customer funds. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-18T21:00:05.000Z",
    "title": "Uniswap Is Decentralizing: Why Are DeFi Users Worried About This Feature?",
    "url": "https://www.newsbtc.com/news/uniswap/uniswap-decentralizing-defi-worried-feature/",
    "description": "Devin Walsh, Executive Director of the Uniswap Foundation, a non-profit organization supporting the growth and decentralization of the Uniswap decentralized exchange (DEX), believes that Uniswap is decentralizing. Walsh even compares the current state of the DEX to that of Ethereum. The executive also acknowledged that the DEX&#8217;s current level of success is due to the active participation and contribution of the developer community. Uniswap Becoming More Decentralized? The Executive Director responded to a thread on X where Antonio Juliano, the founder of dYxX, a layer-2 DEX on Ethereum, insinuated that Uniswap is now centralized. However, it started on a decentralized path.  With centralization, Juliano added, the protocol can iterate quickly, mainly to boost revenue. On the other hand, by being more decentralized, dapps allow users to enjoy the full advantages of decentralized finance (DeFi). Decentralization of protocols launching on public ledgers, like Ethereum or Cardano, is crucial. Usually, the community will gauge how well a dapp is decentralized by looking at, among other factors, how decisions are made and which party spearheads development.  Related Reading: Analyst Predicts XRP Price To Hit $100: Here’s How To Become A Millionaire In the case of Ethereum, Walsh pointed out that the community has taken over from where Vitalik Buterin, the co-founder; and Consensys, a technology company developing solutions for Ethereum, left. Since then, multiple developers have been refining the network and ensuring it is secure and robust to anchor dapps. Uniswap is one of the most popular DEXes on Ethereum, looking at total value locked (TVL). DeFiLlama data shows that the exchange manages over $3 billion of assets and is primarily active on Ethereum. However, the exchange enables trustless swapping on layer-2 platforms like OP Mainnet, and public ledgers like the BNB Chain. Preparing For Hooks And KYC? Presently, Uniswap Labs leads the development of Uniswap. Nonetheless, Walsh said more developers are now building and contributing solutions. This, the Uniswap Foundation executive further observed, is especially considering the scheduled launch of Hooks in v4. There is no specific timeline for when Uniswap will deploy the latest iteration, but the release of the Cancun upgrade on Ethereum will play a role. The protocol will be more customizable with Hooks since the feature acts more like a plugin.  Related Reading: Binance Traders Go Bearish On Bitcoin, But Here’s Why They Might Regret It Even so, there have been concerns that Hooks, though being developed by community developers, will be the basis for Uniswap to censor liquidity providers (LP) or traders who don&#8217;t verify by adhering to know-your-customer rules (KYC). UNI prices remain under pressure at spot rates and may break lower, registering new 2023 lows. Feature image from Canva, chart from TradingView"
  }
]