[
  {
    "source": "CoinDesk",
    "date": "2023-08-03T16:00:43.000Z",
    "title": "Patreon, Platform for Creators, Disables Payouts After ‘Issue’ With Payoneer System",
    "url": "https://www.coindesk.com/tech/2023/08/03/patreon-platform-for-creators-disables-payouts-after-issue-with-payoneer-system/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The issue was first identified on Aug. 2. Crypto developers monitor payments glitches on major platforms partly because a key premise of the blockchain industry is to build infrastructure that improves on the current options."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-03T16:00:00.000Z",
    "title": "More Money For Creators: NFT Minting Platform Zora Initiates New Revenue Split ",
    "url": "https://www.coindesk.com/web3/2023/08/03/more-money-for-creators-nft-minting-platform-zora-initiates-new-revenue-split/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "As the debate about creator royalty rages on, Zora has pledged to pay creators a portion of platform fees collected on every new free mint."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-03T15:59:20.000Z",
    "title": "Kenya Appears to Have Flip-Flopped on Worldcoin's Data Practices",
    "url": "https://www.coindesk.com/policy/2023/08/03/kenya-appears-to-have-flip-flopped-on-worldcoins-data-practices/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Kenya's data watchdog found Worldcoin is compliant with its data protection laws, but has now find different problems with Sam Altman's project."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-03T15:54:01.000Z",
    "title": "Binance Boosts First Digital's Stablecoin With Zero Fees to Buy and Sell Bitcoin, Ether",
    "url": "https://www.coindesk.com/markets/2023/08/03/binance-boosts-first-digitals-stablecoin-with-zero-fees-to-buy-and-sell-bitcoin-ether/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The crypto exchange listed the Hong Kong-regulated First Digital's FDUSD stablecoin last week."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-03T15:45:00.000Z",
    "title": "Assessing Custody Solutions in Digital Assets",
    "url": "https://www.coindesk.com/business/2023/08/03/assessing-custody-solutions-in-digital-assets/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "With the right diligence, digital asset custody can offer more safety, transparency, and cost efficiency than traditional models."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-03T15:41:26.000Z",
    "title": "Latin American Crypto Company Ripio Launches U.S. Dollar-Pegged Stablecoin",
    "url": "https://www.coindesk.com/business/2023/08/03/latin-american-crypto-company-ripio-launches-us-dollar-pegged-stablecoin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The cryptocurrency is hosted on LaChain, a recently started blockchain focused on the region."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-03T16:06:31.000Z",
    "title": "Gala Games Titles Arrive on Elixir Games Launcher",
    "url": "https://decrypt.co/151150/gala-games-titles-arrive-on-elixir-games-launcher",
    "description": "The partnership between Gala Games and Elixir Games will see titles like Town Star and Spider Tanks launch on the Web3 games platform."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-03T15:47:47.000Z",
    "title": "3 Opportunities NFT Games Should Seize to Achieve Mass Adoption",
    "url": "https://decrypt.co/151093/3-opportunities-web3-games-should-seize-to-achieve-mass-adoption",
    "description": "Games developers are ignoring opportunities that are unique to Web3, according to industry veteran Sam Barberie."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-03T16:02:25.000Z",
    "title": "NY Times defends article on Caroline Ellison: the public has a 'legitimate interest'",
    "url": "https://cointelegraph.com/news/ny-times-defends-caroline-ellison-article-public-legitimate-interest",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/7a444904-d74e-47b6-ab3c-cae3cf7be363.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The media outlet claimed the public and press had a right to receive information on a \"central participant in a financial scheme that defrauded investors of billions of dollars\".</p>\n                    <p><p>The New York Times has submitted a filing in the criminal case against former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a> (SBF), arguing the court should defend First Amendment rights by allowing certain parties to provide information to members of the media.</p><p>In an Aug. 2 letter to Judge Lewis Kaplan of United States District Court for the Southern District of New York, NY Times vice president and deputy general counsel David McCraw expressed concerns about the gag order placed upon Bankman-Fried and what participants in his criminal trial were allowed to say to journalists. On July 20, The New York Times <a href=\"https://www.nytimes.com/2023/07/20/technology/ftx-caroline-ellison-bankman-fried.html\" target=\"_blank\" rel=\"noopener nofollow\">published</a> an article revealing details of former Alameda Research CEO Caroline Ellison’s private journals, including her professional and personal relationship with SBF.</p><p>McCraw argued that as Bankman-Fried was a ‘non-lawyer’, the standard for imposing a gag order aimed at preventing harm to other parties connected to the criminal case was stricter than for lawyers. As Judge Kaplan removed language from the order suggesting it wasn’t necessary to prevent “interfer[ing] with a fair trial\", the NY Times claimed the public and members of the Fourth Estate had a right to receive information according to the First Amendment.</p><p>“While the current round of motion practice was prompted by a Times article about Caroline Ellison, and the Government argues that the article was part of Defendant’s effort to interfere with the trial, that overlooks the public’s legitimate interest—independent of this prosecution—in Ms. Ellison and her activities at her cryptocurrency trading firm,” said McCraw. “She has confessed to being a central participant in a financial scheme that defrauded investors of billions of dollars—a scheme that was not detected by government regulators and law enforcement agencies until the public’s money had disappeared.” </p><p>He added:</p><blockquote>“It is not surprising that the public wants to know more about who she is and what she did and that news organizations would seek to provide to the public timely, pertinent, and fairly reported information about her.”</blockquote><p>Lawyers for Bankman-Fried <a href=\"https://cointelegraph.com/news/sam-bankman-fried-legal-team-turns-over-docs-related-nyt-story-requests-sealed\">turned over documents</a> connected to the NY Times interview – seemingly including Ellison’s journals — to the court on July 27. SBF is expected to appear in court on Aug. 3 as prosecutors push to have his <a href=\"https://cointelegraph.com/news/judge-warns-sam-bankman-fried-take-seriously-prosecutors-push-revoke-bail\">$250-million bail revoked</a>, claiming the interview was intended to intimidate Ellison and affect her testimony.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/was-sam-bankman-fried-behind-another-scam-project\"><strong><em>Was Sam Bankman-Fried behind a scam project?</em></strong></a></p><p>Since his arrest and indictment in December 2022, Bankman-Fried has returned to the New York courthouse several times to address issues related to his bail conditions, which largely require him to stay in his parents’ California home. He is already barred from using messaging apps, virtual private networks and certain technology.</p><p>Justice Department officials announced on July 27 they expected to drop the charge concerning violations of campaign finance against SBF due to the conditions of the extradition agreement with the Bahamas — Bankman-Fried was originally arrested in the island nation before being transferred to U.S. custody. The former FTX CEO still faces 12 criminal counts, which will be spread across two trials scheduled for October 2023 and March 2024.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-03T16:00:12.000Z",
    "title": "Options implied volatility drops but market still expects turbulence",
    "url": "https://cryptoslate.com/insights/options-implied-volatility-drops-but-market-still-expects-turbulence/",
    "description": "<p>The implied volatility (IV) for Bitcoin options decreased significantly in July. The IV for Bitcoin options on Aug. 3 is as follows: Expiry Period Percentage 1-Month Expiry 32.73% 3-Month Expiry 37.78% 6-Month Expiry 44.07% Implied volatility is a metric that represents the expected percentage change in the price of Bitcoin over a year, with a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/options-implied-volatility-drops-but-market-still-expects-turbulence/\">Options implied volatility drops but market still expects turbulence</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-03T15:40:00.000Z",
    "title": "Is an XRP ETF on the Horizon?",
    "url": "https://www.cryptoglobe.com/latest/2023/08/is-an-xrp-etf-on-the-horizon/",
    "description": "On 13 July 2023, a significant ruling was delivered in the ongoing SEC v. Ripple Labs lawsuit. The U.S. Securities and Exchange Commission (SEC) had accused Ripple Labs and its two senior executives, Bradley Garlinghouse and Christian A. Larsen, of unlawfully offering and selling securities. The case was presided over by Hon. Analisa Torres, a district judge […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-03T16:00:00.000Z",
    "title": "Coinbase Sets the Date for Its Base Mainnet Launch",
    "url": "https://cryptodaily.co.uk/2023/08/coinbase-sets-the-date-for-its-base-network-mainnet-launch",
    "description": "<p>Crypto exchange Coinbase will open its Layer-2 blockchain Base to the general public on August 9; the Ethereum bridge is already released.</p>\nBase Mainnet Is about to Go Live, Open for Bridging\n<p>On August 3, 2023, crypto exchange platform Coinbase announced the date of its Layer-2 blockchain Base launch. After opening it for builders on July 13, Coinbase will make the Base network available to everyone else on August 9, 2023.</p>\n\n<p>&ldquo;Since we announced Base, our mission has been clear and consistent: bring the next million builders and billion users onchain,&rdquo; Base creators wrote in the blog post.</p>\n\n<p>Besides, the platform&rsquo;s official bridge for moving tokens between the Base and Ethereum networks starts operating today, a week before the mainnet&rsquo;s public release.&nbsp;</p>\n<p>Base is built upon the OP software stack and functions as a Layer-2 blockchain. It was created as an alternative way to use Ethereum, which offers lower transaction fees and serves a wider range of customers, including both regular Coinbase users and DeFi participants.</p>\nOnchain Summer\n<p>To celebrate the release of the long-awaited network, Coinbase is also launching a dedicated month-long festival called &ldquo;Onchain Summer'' which is presented by 50 chosen builders, brands, products, artists, and creators. Every day in August, Coinbase will feature a wide array of onchain activities, related to art, music, gaming, advocacy, and more.</p>\n<p>Additionally, to get more people involved in the celebration, Coinbase in collaboration with PropHouse, are ready to fund other projects built and created on Base, by offering over 100 ETH in grants.&nbsp;</p>\nHow to Bridge to Base?&nbsp;\n<p>To prepare for Onchain Summer and Base Mainnet, one needs to have a crypto wallet with ETH on Base. Coinbase highlighted wallets that could be bridged to the Layer-2 network: Coinbase Wallet, Rainbow, Safe, Brave, Rabby, Frame, Exodus, Trust Wallet, rhino.fi, and Frontier.</p>\n<p>The team has also outlined six easy ways to bridge to Base which include Onchain Summer, Base Bridge, Quests on Coinbase, Galxe, Layer-3, and Mint.fun.&nbsp;</p>\nCoinbase Secret Master Plan\n<p>The official Base website states that the team has been building towards this network for the last 10 years, according to the Coinbase secret master plan which consists of four stages. The company has repeatedly claimed that its mission is to create an open financial system for increasing economic freedom around the world. The launch of Base is one of the key steps in the process.&nbsp;</p>\n\n<p>&ldquo;Base is our &ldquo;all in&rdquo; commitment to onchain.</p>\n<p>We believe that the onchain platform is the most important builder platform since the internet (&ldquo;online&rdquo;). We believe that the onchain platform should be open source, free to use, and globally available. And we believe that in order to make it really work, we need all hands on deck, working together to scale in a secure, safe, easy-to-use way.&rdquo; states the message on the Base website.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-03T15:42:33.000Z",
    "title": "Biggest Movers: XRP, DOGE Bear Run Continues, Sending Prices to Multi-Week Lows",
    "url": "https://news.bitcoin.com/biggest-movers-xrp-doge-bear-run-continues-sending-prices-to-multi-week-lows/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2274516117-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers:XRP, DOGE Bear Run Continues, Sending Prices to Multi-Week Lows\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2274516117-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2274516117-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2274516117-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2274516117-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2274516117-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2274516117-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2274516117.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />XRP was one of Thursday&#x2019;s notable movers, as the token dropped to a multi-week low in today&#x2019;s session. The decline comes as the global market cap fell by as much as 2% over the course of the day. Dogecoin also declined, falling for a third consecutive session. XRP XRP, formerly ripple, remained in the red [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T16:07:39.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T16:00:51.000Z",
    "title": "Binance appoints new compliance officer amid intense regulatory scrutiny",
    "url": "https://www.cryptopolitan.com/binance-appoints-new-compliance-officer/",
    "description": "Binance has appointed Kristen Hecht, the previous global head of corporate compliance at the exchange, as the newly appointed deputy chief compliance and global money laundering reporting officer. This newly created position aims to oversee compliance and anti-money laundering efforts as the company faces potential fraud allegations from U.S. regulatory authorities.&#160; Despite recent reports of ... <a title=\"Binance appoints new compliance officer amid intense regulatory scrutiny\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-appoints-new-compliance-officer/\" aria-label=\"More on Binance appoints new compliance officer amid intense regulatory scrutiny\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T15:58:05.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T15:53:02.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T15:41:46.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-03T16:04:41.000Z",
    "title": "Will Dogecoin recover in 2023 or will Investors prefer high-potential blockchains like Bitcoin Spark?",
    "url": "https://nulltx.com/will-dogecoin-recover-in-2023-or-will-investors-prefer-high-potential-blockchains-like-bitcoin-spark/",
    "description": "Crypto enthusiasts always consider many investment choices as they explore the factors that could influence their value. One of the questions lingering on many a DOGE investor’s mind is whether the internet-famous meme coin will regain its former glory as high-potential blockchains like Bitcoin Spark offer a better alternative. Will Dogecoin go up? The meme [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-03T15:51:36.000Z",
    "title": "Crypto.com rolls out euro deposits and withdrawals for retail traders",
    "url": "https://crypto.news/crypto-com-rolls-out-euro-deposits-and-withdrawals-for-retail-traders/",
    "description": "Crypto.com has made euro deposits and withdrawals available for retail traders on its web platform"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-03T16:00:27.000Z",
    "title": "Ukraine Government Reveals Crypto Firms Have Cost The Country $81 Million In Lost Taxes",
    "url": "https://www.newsbtc.com/crypto/ukraine-81-million-in-lost-crypto-taxes/",
    "description": "According to data released by the Ukrainian government, cryptocurrency firms offering services in Ukraine have failed to contribute over $81 million in taxes to the country’s budget in the past decade. This comes after the country passed a crypto bill into law in 2022 that amends its tax code to allow the country to generate taxes from cryptocurrency transactions. A Huge Loss In Revenue For Ukraine In a notice released on Wednesday, the Economic Security Bureau of Ukraine stated that unrelated cryptocurrency exchanges were responsible for the loss of approximately 3 billion hryvnia in taxes (roughly $81 million) between 2013 to 2023.  Related Reading: MicroStrategy’s Michael Saylor Says Spot ETF Approvals Have No Bearing On Bitcoin Strategy The country’s foremost regulator noted that it had evaluated the trading actions of exchanges founded by residents of the country, which had $55 billion in Bitcoin (BTC), Ether (ETH), and Tether (USDT) volume in rough estimates over the same period.  Speaking to local media following the announcement, Deputy Director of the Economic Security Bureau Andriy Pashchuk stated that there were different perspectives on “how these transactions should be taxed and (the bureau) will act in accordance with the provisions adopted by the deputies.” He opined that while these issues drag on, the country keeps losing “..tens of millions in taxes every month.” Crypto Tax Losses Follow Passage Of Landmark Bill The recent loss of revenue follows the recent passage of the legislation “On Virtual Assets” by the Ukrainian parliament in 2022. The law was enacted amid the growing adoption of cryptocurrencies as a valid means for conducting transactions.  The bill, which was signed into law in March 2022 by Ukrainian President Volodymyr Zelenskyy,  sought to create a regulatory framework for cryptocurrency transactions in the country. Total market cap continues to decline &#124; Source: Crypto Total Market Cap on Tradingview.com At the time of passing the bill, the government stated that it was looking to amend the country’s civil and tax codes to accommodate the new legal framework. However, as of August 2023, no such amendments have been executed.  Ukraine also brought some minor amendments to the legislation in September 2022 to ensure that the law was in sync with the European Union’s Markets in Crypto Asset (MiCA) regulation.  Related Reading: Here’s Where The Price Of LUNC Will Land This August, According To This Algorithm Since then, many crypto users in Ukraine have taken to Telegram to ask whether they would be mandated to provide “backpay” of taxes based on transactions over the last decade. Some noted the government’s failure to properly adopt the regulations despite the passage of the law in 2022. According to one Telegram user with the username Vini2010w, had the government adopted the law, “everything would have been settled a long time ago.”  Ukraine has been heavily reliant on cryptocurrency donations amid the ongoing war with Russia. About $225 million in cryptocurrency donations have been pledged in support of the country since 2022 following Russia’s invasion. The vast majority of the donations were made in Ethereum and Bitcoin, the two most popular cryptocurrencies and the largest by market cap.  Featured image from Bitcoinist, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-03T16:00:51.000Z",
    "title": "Is Dogecoin Dead? Meet the New Meme coin Sensation Ready to Claim The Number 1 Position: DigiToads",
    "url": "https://www.crypto-news-flash.com/is-dogecoin-dead-meet-the-new-meme-coin-sensation-ready-to-claim-the-number-1-position-digitoads/?utm_source=rss&utm_medium=rss&utm_campaign=is-dogecoin-dead-meet-the-new-meme-coin-sensation-ready-to-claim-the-number-1-position-digitoads",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T101909.194.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T101909.194.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T101909.194-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T101909.194-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Bearish turns taken by the markets condemned some crypto projects to the fringes of the crypto market. Notably, holders of Dogecoin (DOGE) have been in the dark about the project&#8217;s future, which started as a joke in 2013. DigiToads, on the other hand, has been on a good run, defying some market expectations and giving [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-03T15:46:05.000Z",
    "title": "Shiba Inu Emerges as Major Payment Option with 5.5M Users Spend SHIB at Over 81 Million Retailers Worldwide",
    "url": "https://www.crypto-news-flash.com/shiba-inu-emerges-as-major-payment-option-with-5-5m-users-spend-shib-at-over-81-million-retailers-worldwide/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-emerges-as-major-payment-option-with-5-5m-users-spend-shib-at-over-81-million-retailers-worldwide",
    "description": "<img width=\"1200\" height=\"600\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/shib-shiba-inu-1200x600-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shiba Inu\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/shib-shiba-inu-1200x600-1.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/shib-shiba-inu-1200x600-1-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/shib-shiba-inu-1200x600-1-1024x512.jpg 1024w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Shiba Inu (SHIB) celebrates its third anniversary with remarkable growth and praise from users and partners.  Activity surges, reaching an all-time high in new SHIB addresses and nonempty wallets.  On its third anniversary, Shiba Inu (SHIB), launched in August 2020, received praise from various users and partners for its remarkable growth. Among those celebrating was [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-03T15:47:00.000Z",
    "title": "Crypto Trader Stays Bullish on Binance Despite Recent FUD",
    "url": "https://coinedition.com/crypto-trader-stays-bullish-on-binance-despite-recent-fud/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/048.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/048.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/048-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/048-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/048-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/048-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/048-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/048-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/048-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/048-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/048-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/048-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/048-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/048-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/048-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/048-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/048-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto Tony, a trader popular among crypto circles online, recently stated that he was bullish on the Binance token (BNB) in the long term. According to the trading expert, there was considerable demand for BNB through the market, and he was waiting for the right opportunity to load up BNB. Crypto Tony told his followers [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-trader-stays-bullish-on-binance-despite-recent-fud/\">Crypto Trader Stays Bullish on Binance Despite Recent FUD</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]