[
  {
    "source": "CoinDesk",
    "date": "2024-01-11T15:44:42.000Z",
    "title": "Grayscale’s GBTC Discount Closes to Zero for First Time Since February 2021",
    "url": "https://www.coindesk.com/markets/2024/01/11/grayscales-gbtc-discount-closes-to-zero-for-first-time-since-february-2021/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Grayscale received the regulatory green light to convert its flagship product into an ETF on Wednesday."
  },
  {
    "source": "CoinDesk",
    "date": "2024-01-11T16:00:33.000Z",
    "title": "Protocol Village: DePIN and DeWi Come to Sui Through Partnership with Karrier One",
    "url": "https://www.coindesk.com/tech/2024/01/11/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Jan. 11-17."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-11T16:06:17.000Z",
    "title": "Got a Solana Saga Before They Sold Out? Here Are All the Airdrops You Can Claim",
    "url": "https://decrypt.co/210634/solana-saga-airdrops-tokens-nfts-you-can-claim",
    "description": "UPDATED: Solana Saga owners keep racking in the perks, including valuable Saga Monkes NFTs and SAMO tokens. Here's everything you can claim."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-11T16:07:23.000Z",
    "title": " Bitcoin is now a ‘public good’ — ARK Invest president ",
    "url": "https://cointelegraph.com/news/bitcoin-now-public-good-ark-invest-president",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZDdiNzIxN2YtYjAyMS00YzRmLTkxZDgtOTdiOWM1YjE4ZjliLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>ARK's Tom Staudt believes Bitcoin has become a \"public good\" and should be available to all investors.</p>\n                    <p><p>The approval of Bitcoin exchange-traded funds (ETFs) in the United States establishes the cryptocurrency as a “public good,” <a href=\"https://www.cnbc.com/2024/01/11/ark-invest-president-says-bitcoin-is-now-a-public-good.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> ARK Invest president Tom Staudt.</p><p>According to him, the Bitcoin investment vehicle is not about “maximizing profit” but rather a way to introduce new audiences to cryptocurrencies. “I think that that’s ultimately the most important thing [...] This [Bitcoin] has become a public good that we want to make sure all investors have access to,” noted Staudt.</p><p>ARK Invest is among the asset managers <a href=\"https://cointelegraph.com/news/sec-spot-bitcoin-etf-approvals\">approved by the U.S. Securities and Exchange Commission</a> to launch Bitcoin ETFs, allowing investors to buy and hold BTC in portfolios just like stocks and shares of mutual funds.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-now-public-good-ark-invest-president\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-11T15:52:26.000Z",
    "title": " WEF identifies AI and quantum computing as emerging global threats ",
    "url": "https://cointelegraph.com/news/wef-ai-quantum-threats-global-risks-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZGM5MjM0NjgtMWMxMC00YjI3LWI2NGMtYjA3ZGRlZDBhNTA4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The WEF also noted that AI offers productivity benefits and breakthroughs in fields as diverse as healthcare, education and climate change.</p>\n                    <p><p data-ct-non-breakable=\"true\">The World Economic Forum (WEF) has published its 19th Global Risks Report, highlighting a novel global threat — artificial intelligence (AI) — and exploring its diverse implications in a dedicated section.</p><p>The WEF report <a href=\"https://www3.weforum.org/docs/WEF_The_Global_Risks_Report_2024.pdf\" target=\"_blank\" rel=\"noopener nofollow\">explores</a> the varied impact of AI. It outlines the adverse outcomes of AI technologies, some intended or unintended negative consequences of advances in AI and related technological capabilities (including generative AI) on individuals, businesses, ecosystems and economies.</p><p>The report also identifies quantum computing, a system reliant on AI, as a potential disruptor, posing risks to the existing tech landscape and introducing substantial security concerns. It categorizes the adverse outcomes of AI in frontier technologies to include quantum computing, biotechnology and geoengineering.</p><p><a href=\"https://cointelegraph.com/news/wef-ai-quantum-threats-global-risks-report\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-11T15:41:39.000Z",
    "title": "USDC issuer Circle eyes public market debut with SEC filing for IPO",
    "url": "https://cryptoslate.com/usdc-issuer-circle-eyes-public-market-debut-with-sec-filing-for-ipo/",
    "description": "<p>USD Coin (USDC) issuer Circle has &#8220;confidentially&#8221; filed an initial public offering with the U.S. Securities and Exchange Commission (SEC) today, Jan. 11. The company submitted a draft registration statement on Form S-1 with the financial regulator as part of its &#8220;proposed initial public offering of its equity securities.&#8221; However, the number of shares to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/usdc-issuer-circle-eyes-public-market-debut-with-sec-filing-for-ipo/\">USDC issuer Circle eyes public market debut with SEC filing for IPO</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-11T16:06:53.000Z",
    "title": "Ripple set to buy back $285 million shares, rejects IPO path",
    "url": "https://cryptobriefing.com/ripple-set-to-buy-back-285-million-shares-rejects-ipo-path/?utm_source=feed&utm_medium=rss",
    "description": "Ripple spending up to $500M on share buybacks for investors, values company at $11.3B amid ongoing SEC legal battle."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-11T15:50:46.000Z",
    "title": "World’s Richest Man on Bitcoin: ‘It Would Be Difficult To Use It a Lot on Mars’",
    "url": "https://www.cryptoglobe.com/latest/2024/01/worlds-richest-man-on-bitcoin-it-would-be-difficult-to-use-it-a-lot-on-mars/",
    "description": "In a recent Space on X (formerly Twitter) titled “ARK 21Shares Bitcoin ETF (ARKB) Approved,” Elon Musk, CEO of Tesla and SpaceX, engaged in a thought-provoking conversation with Cathie Wood, CEO of ARK Invest, about the use of money on Mars. Wood’s Query on Martian Currency The discussion began with Cathie Wood posing a question […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-11T16:05:19.000Z",
    "title": "Is Ripple (XRP) About to Make Crypto History? Insider Scoop on Its Rally Potential Post-SEC Approval",
    "url": "https://cryptodaily.co.uk/2024/01/is-ripple-xrp-about-to-make-crypto-history-insider-scoop-on-its-rally-potential-post-sec-approval",
    "description": "Discover the latest surge in Ripple (XRP) following the SEC's Bitcoin ETF approval! Uncover the insider predictions on XRP's future in our exclusive analysis. Will Ripple's transparency in dealings boost its value? Stay ahead in the crypto game with our cutting-edge insights on XRP's market potential!"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-11T16:00:59.000Z",
    "title": "Pullix (PLX) Races Into Stage 6 Of Presale In Under Four Weeks, Is It Set To Challenge Binance Coin (BNB) and Solana (SOL)?",
    "url": "https://cryptodaily.co.uk/2024/01/pullix-plx-races-into-stage-6-of-presale-in-under-four-weeks-is-it-set-to-challenge-binance-coin-bnb-and-solana-sol",
    "description": "The cryptocurrency landscape is currently experiencing a seismic shift with the entry of Pullix (PLX), a burgeoning new player making waves in its presale phase."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-11T15:55:33.000Z",
    "title": "Is Pushd (PUSHD) Going To Be The Best Crypto Investment This Year? Top Analyst Thinks So Over Litecoin (LTC) And Internet Computer (ICP)",
    "url": "https://cryptodaily.co.uk/2024/01/is-pushd-pushd-going-to-be-the-best-crypto-investment-this-year-top-analyst-thinks-so-over-litecoin-ltc-and-internet-computer-icp",
    "description": "Experts and analysts are always speculating on which coins are likely to do well, rise or fall based on market conditions, historical patterns and trends."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-11T15:49:40.000Z",
    "title": "Bitcoin Price Prediction: Will 1 Satoshi Hit $1 in 2024? AI Powered Option2Trade Set to Provide Investors 20x Returns",
    "url": "https://cryptodaily.co.uk/2024/01/bitcoin-price-prediction-will-1-satoshi-hit-1-in-2024-ai-powered-option2trade-set-to-provide-investors-20x-returns",
    "description": "The Price of Bitcoin (BTC) has spiked recently with the leading cryptocurrency experiencing unprecedented growth over the last couple of months."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-11T15:44:27.000Z",
    "title": "Crypto Analyst Guy Turner Forecasts Cardano To $1, Investors Rush To NuggetRush Despite Shiba Inu Network Growth",
    "url": "https://cryptodaily.co.uk/2024/01/crypto-analyst-guy-turner-forecasts-cardano-to-1-investors-rush-to-nuggetrush-despite-shiba-inu-network-growth",
    "description": "Top crypto analyst Guy Turner has made a bold prediction, foreseeing Cardano's price rising to $1.00. Meanwhile, investors have shown massive interest in two top altcoins,"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-11T15:57:44.000Z",
    "title": "BCP Webinar Unveils Key Trends Shaping Wholesale Industry in 2024",
    "url": "https://www.cryptopolitan.com/bcp-webinar-unveils-trends-shaping-wholesale/",
    "description": "BCP, a frontrunner in innovative technology solutions for the wholesale sector, is set to host a live webinar on February 7th, titled &#8220;Emerging Wholesale Trends in 2024.&#8221; The event brings together industry stalwarts to explore and dissect pivotal themes influencing the wholesale landscape throughout the year. A game-changer in wholesale operations The webinar&#8217;s first focal [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-11T15:57:09.000Z",
    "title": "Coinbase Dilate in Africa with Yellow Card Collaboration",
    "url": "https://www.cryptopolitan.com/coinbase-dilate-in-africa-with-yellow-card-collaboration/",
    "description": "Coinbase has announced a major expansion in Africa, covering 20 countries in partnership with Yellow Card, an African stablecoin exchange arena. This move marks a significant step in making blockchain technology more accessible in emerging economies. It introduces millions Africans to the US Dollar Coin (USDC), facilitating swifter and more cost-effective transactions. Beginning in February, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-11T15:48:01.000Z",
    "title": "Breakthrough in Fingerprint Analysis Challenges Conventional Beliefs",
    "url": "https://www.cryptopolitan.com/breakthrough-in-fingerprint-analysis-challenges-conventional-beliefs/",
    "description": "Undergraduates at Columbia Engineering have conducted groundbreaking research challenging the long-standing belief that all fingerprints are unique. The widely accepted notion, often depicted in crime novels and TV shows, has been scrutinized by these students, revealing unexpected insights that could reshape forensic science. Unearthing surprising patterns in fingerprint analysis The research, set to be published [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-11T16:01:07.000Z",
    "title": "Coinbase’s Bitcoin OTC trading volume reaches second-highest level in history",
    "url": "https://crypto.news/coinbases-bitcoin-otc-trading-volume-reaches-second-highest-level-in-history/",
    "description": "According to a Jan. 11 report by CryptoQuant, an on-chain and market analytics tool, Coinbase’s Bitcoin OTC trading volume reached $7.7 billion today."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-11T15:50:33.000Z",
    "title": "Web3 gaming token Creo Engine trends with 63% gains ",
    "url": "https://crypto.news/web3-gaming-token-creo-engine-trends-with-63-gains/",
    "description": "Following a series of partnership announcements, the Creo Engine token has reached a notable 651% price increase in the past 30 days."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-11T15:41:15.000Z",
    "title": "Bitcoin ETF Approval Triggers $1.2 Billion Trading Volume And New Highs For BTC Price",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-etf-approval-triggers-1-2-billion-trading-volume-and-new-highs-for-btc-price/",
    "description": "In a highly anticipated move, the United States Securities and Exchange Commission (SEC) approved all 11 Bitcoin ETF applications, and the market response has been nothing short of remarkable. The approval has led to significant trading volume and propelled Bitcoin to a new 22-month high. Within minutes of the Bitcoin ETFs going live, Bitcoin surged over 8% to reach $48,400, representing a new record since the end of the crypto bear market. The early price movement aligns with the predictions made by the majority of experts in the crypto industry. Bitcoin ETF Trading Makes Spectacular Debut Bloomberg ETF expert James Seyffart reported an astonishing $1.2 billion in trading volume for spot Bitcoin ETFs within 30 minutes of trading. Seyffart captured the excitement with his &#8220;Cointucky Derby&#8221; analogy, highlighting the performance of different ETFs. Related Reading: Is Cardano The Next Solana? Institutional Investors Clamor For ADA Exposure Grayscale&#8217;s GBTC Bitcoin Trust took the lead in the &#8220;Cointucky Derby,&#8221; recording an impressive trading volume of $446 million in the initial minutes. It was closely followed by BlackRock&#8217;s Bitcoin Trust, which achieved a trading volume of $388 million within the first half-hour. Fidelity secured the third spot with a trading volume of $230 million, outperforming Hashdex and Wisdom Tree, which recorded $1 million and $1.1 million in trading volume, respectively. While the exact breakdown of the trading volume remains uncertain, Seyffart noted that the evening&#8217;s data might provide more insights.  However, the Bloomberg ETF expert speculated that a significant portion of the trading volume could be attributed to new flows into the ETFs. Additionally, he suggested that a notable portion of GBTC&#8217;s trading volume might be due to outflows. Is Bitcoin On A Clear Path To $50,000? With the Bitcoin ETF race in full throttle, Bitcoin appears to be on a promising trajectory toward the $50,000 milestone, which could serve as a significant catalyst for Bitcoin bulls and the broader crypto industry. Currently, having surpassed the $48,000 mark, Bitcoin&#8217;s price has reached a level where minimal resistance levels are hindering its ascent to $50,000.  The next notable hurdle lies well above $50,700, followed by potential attempts to reach $53,000. Given the expected spot buys in the Bitcoin market following the approval of Bitcoin ETFs, combined with a considerable separation between major resistance lines, these price levels may be easily breached. Once beyond the $50,000 threshold, Bitcoin could potentially progress to $51,000, then $53,000, and subsequently $56,000, before ultimately setting its sights on the highly anticipated $60,000 milestone.  This series of price targets may be readily attainable for the largest cryptocurrency in the market, as it navigates through the anticipated market dynamics. Related Reading: Analyst’s Crystal Ball: Bitcoin Price Targets $600,000 After ETF Approval Ultimately, the SEC&#8217;s approval of the Bitcoin ETFs has brought renewed optimism to the market, with investors and industry experts closely monitoring the impact of these ETFs on the broader cryptocurrency landscape.  The surge in trading volume and Bitcoin&#8217;s impressive price movement signify growing interest from investors seeking regulated and traditional investment avenues in the cryptocurrency market. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-11T15:44:17.000Z",
    "title": "DappRadar Integrates Games & dApps on Oasys to Support Verses, Showing 5 Games Leading UAW Rankings",
    "url": "https://www.crypto-news-flash.com/dappradar-integrates-games-dapps-on-oasys-to-support-verses-showing-5-games-leading-uaw-rankings/?utm_source=rss&utm_medium=rss&utm_campaign=dappradar-integrates-games-dapps-on-oasys-to-support-verses-showing-5-games-leading-uaw-rankings",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Dappradar_2_1704987306UkZkMZkddS.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Dappradar_2_1704987306UkZkMZkddS.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Dappradar_2_1704987306UkZkMZkddS-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Dappradar_2_1704987306UkZkMZkddS-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Dappradar_2_1704987306UkZkMZkddS-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Dappradar_2_1704987306UkZkMZkddS-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Singapore, Singapore, January 11th, 2024, Chainwire Gaming optimized blockchain Oasys is excited to announce a significant milestone in its journey. From today, the diverse range of games and decentralized applications (dApps) built on the network will be listed on DappRadar, the world’s leading dApp store. This collaboration marks an important step in increasing the accessibility [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-11T15:42:53.000Z",
    "title": "Genesis Token Holders Receive Subdomains in SAGA Mobile",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/genesis-token-holders-receive-subdomains-in-saga-mobile/",
    "description": "<p>These personalized subdomains not only add a touch of exclusivity but also serve a practical purpose. This will allow Genesis token holders to now easily identify and transact with their Saga mobile. Let&#8217;s see how it works. Exclusive .thesagadao Subdomains for Genesis Token Holders One distinctive feature of these subdomains is that they are registered [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/genesis-token-holders-receive-subdomains-in-saga-mobile/\">Genesis Token Holders Receive Subdomains in SAGA Mobile</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]