[
  {
    "source": "CoinDesk",
    "date": "2023-12-05T15:00:00.000Z",
    "title": "Pyth Oracle Network Brings Industry Heavyweights Into Governance Post-Airdrop",
    "url": "https://www.coindesk.com/tech/2023/12/05/pyth-oracle-network-brings-industry-heavyweights-into-governance-post-airdrop/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The low-latency oracle network's new \"strategic partners\" include Castle Island Ventures, Multicoin Capital and Wintermute Ventures. They could play a major role in shaping how the platform evolves."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-05T14:41:29.000Z",
    "title": " Bitcoin custodian Nostr Assets pauses deposits after reaching &#039;maximum capacity&#039; ",
    "url": "https://cointelegraph.com/news/bitcoin-custodian-nostr-assets-pauses-deposits-after-reaching-maximum-capacity",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYTMwZjJkYWQtYTYzZS00NmE1LTk0YzItMDMxMGYxYTg5MGUwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>\"Please refrain from deposits at the moment. Inbound at max capacity,\" wrote one community manager. </p>\n                    <p><p >Bitcoin infrastructure developer Nostr Assets has paused deposits following record-high user activity.</p><p >According to a Dec. 5 announcement posted on Telegram, Nostr Assets developers warned, \"Please await further announcements and do not attempt to deposit into NostrAssets for the time being.\" The service, which allows users to transact Satoshis, or or 1/100 millionth of a Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), through the Lightning and Taproot Networks, claims to have <a href=\"https://twitter.com/NostrAssets/status/1731379540121764269\" target=\"_blank\" rel=\"noopener nofollow\">onboarded</a> over 70,000 new users since Oct. </p><figure ><img src=\"https://s3.cointelegraph.com/uploads/2023-12/8f7965c3-422a-4264-a2c5-9c1030e1ff01.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>An explanation of the incident on Nostr Assets' official Telegram</em></figcaption></figure><p >On Dec. 4, Fiatjaf, the creator of the Nostr protocol, which <a href=\"https://twitter.com/fiatjaf/status/1731275381980660075\" target=\"_blank\" rel=\"noopener nofollow\">allows</a> users to interchange their social profiles and their followers on different platforms, alleged that the Nostr Asset team was operating under an affinity scam. </p><p >Nostr Assets developers dismissed the allegations as \"unfounded,\" writing:</p><blockquote >\"NostrAssets utilizes Nostr, Taproot Assets, and Lightning in its construction, making it pertinent to Nostr. However, it's crucial to emphasize that Nostr is a decentralised, open-sourced and censorship-resistant relay network that anyone can build on.\"</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ This thread is aimed at addressing the unfounded claims made by <a href=\"https://twitter.com/fiatjaf?ref_src=twsrc%5Etfw\">@fiatjaf</a>. <a href=\"https://t.co/mcceRECEWL\">https://t.co/mcceRECEWL</a></p>&mdash; Nostr Assets Protocol (@NostrAssets) <a href=\"https://twitter.com/NostrAssets/status/1731379529728282888?ref_src=twsrc%5Etfw\">December 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p >The following day, the total volume of non-fungible token (NFT) sales on the Bitcoin network surpassed $1 billion. </p><p >Bitcoin Ordinals is a numbering system that assigns a unique number to each individual satoshi, enabling their tracking and transfer. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-custodian-nostr-assets-pauses-deposits-after-reaching-maximum-capacity\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-05T15:04:02.000Z",
    "title": "NFTScan Community Welcomes the Launch of Mint Blockchain",
    "url": "https://www.cryptopolitan.com/nftscan-community-launch-mint-blockchain/",
    "description": "NFTScan Labs, in a strategic partnership with the MintCore team, has proudly announced the launch of Mint Blockchain @Mint_Blockchain. This innovative initiative introduces a new Ethereum L2 blockchain that is exclusively dedicated to the burgeoning world of NFTs. The introduction of Mint Blockchain represents a pivotal moment in the NFT sector, signifying a major leap ... <a title=\"NFTScan Community Welcomes the Launch of Mint Blockchain\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nftscan-community-launch-mint-blockchain/\" aria-label=\"More on NFTScan Community Welcomes the Launch of Mint Blockchain\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-05T15:00:22.000Z",
    "title": "Curvance Raises $3.6M in Seed Round from Over 20 DAOs and DeFi Builders including Offchain Labs and Wormhole",
    "url": "https://www.cryptopolitan.com/curvance-raises-3-6m-in-seed-round-from-over-20-daos-and-defi-builders-including-offchain-labs-and-wormhole/",
    "description": "Cayman Islands, Cayman Islands, December 5th, 2023, Chainwire Curvance introduces a new, efficient approach for users to yield farm and maximize yield on their DeFi investments Curvance, a full-service omnichain money market for yield-bearing, LSDfi, tokenized treasuries, and primitive assets, announces the close of a $3.6M seed round supported by Offchain Labs, Wormhole, prominent angel ... <a title=\"Curvance Raises $3.6M in Seed Round from Over 20 DAOs and DeFi Builders including Offchain Labs and Wormhole\" class=\"read-more\" href=\"https://www.cryptopolitan.com/curvance-raises-3-6m-in-seed-round-from-over-20-daos-and-defi-builders-including-offchain-labs-and-wormhole/\" aria-label=\"More on Curvance Raises $3.6M in Seed Round from Over 20 DAOs and DeFi Builders including Offchain Labs and Wormhole\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-05T15:00:37.000Z",
    "title": "Warning Signals Flash As Bitcoin Surges: Expert Spotlights Potential $25,000 Liquidity Sweep",
    "url": "https://www.newsbtc.com/bitcoin-news/warning-signals-flash-as-bitcoin-surges-expert-spotlights-potential-25000-liquidity-sweep/",
    "description": "Bitcoin (BTC), the world&#8217;s leading cryptocurrency, has recently witnessed a surge in price, reaching a new yearly high of $42,100 on Monday. However, this significant price increase has raised concerns among market participants about the possibility of a potential correction and a subsequent liquidation sweep, which could drive the price down to as low as $25,000. Second Capitulation And Liquidity Sweep For Bitcoin? Justin Bennett, a prominent technical analysis expert, acknowledges the remarkable performance of Bitcoin, stating, &#8220;It&#8217;s been a hell of a run from BTC, and it may very well continue without a significant correction in the short term.&#8221;  However, Bennett highlights that the previous two bear markets concluded with a second capitulation, suggesting the possibility of a similar scenario occurring this time. Bennet cautions against ruling out a liquidity sweep that could drive the price down to $25,000. Related Reading: Analyzing The Titans: How Bitcoin Whales Influenced The Surge To $40,000 To provide further context, liquidity sweep refers to a sudden and drastic move in price that aims to clear out excess leverage and trigger liquidations of overleveraged positions.  Such a move could lead to a cascading effect, causing the price to drop further as more positions get forcefully closed. The occurrence of a liquidity sweep at the $25,000 level would not only test the resilience of Bitcoin but also serve as a crucial moment for market sentiment. As seen in the 2-week chart above shared by Bennet, despite the potential correction in BTC, this could be the last difficulty that Bitcoin bulls experience before the continuation of the bull run; this will be further fueled by the potential approval of Bitcoin spot exchange-traded funds (ETFs) applications by the US Securities and Exchange Commission (SEC), which is expected to push prices even higher.  A boost from the halving of Bitcoin will further add to the bullish momentum and sentiment in the market, which could push the price of BTC to new all-time highs (ATH). Additionally, historical trends indicate a promising outlook for Bitcoin. Analyst Ali Martinez points out that in the past, strong BTC performance during October and November has been followed by a bullish December. According to Martinez, market participants can anticipate a bullish December ahead if this pattern holds.  El Salvador&#8217;s BTC Investments Prove Profitable El Salvador&#8217;s President Nayib Bukele recently announced that the nation&#8217;s investments in Bitcoin have yielded significant profits, refuting previous claims of losses made by critics.  President Bukele revealed that if El Salvador were to sell its Bitcoin holdings at the current market price, the country would not only fully recover its initial investment but also make a profit of $3,620,277.13. Addressing the numerous articles and hit pieces that had ridiculed El Salvador&#8217;s Bitcoin investment strategy, President Bukele emphasized that these assessments were based on the cryptocurrency&#8217;s market price at the time of evaluation. With Bitcoin&#8217;s recent surge in value, the country&#8217;s investment has turned profitable. Related Reading: Ethereum Turns Deflationary With Over 106,000 ETH Burned In A Single Month While acknowledging that the price of Bitcoin will continue to fluctuate, President Bukele reaffirmed that El Salvador remains committed to its long-term strategy and has no intention of selling its Bitcoin holdings. President Bukele stated:  Of course, we have no intention of selling; that has never been our objective. We are fully aware that the price will continue to fluctuate in the future, this doesn’t affect our long-term strategy. At the time of writing, BTC is trading at $41,200, reflecting a notable price increase of 3.8% over the past 24 hours and 12% over the past seven days. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-05T14:57:49.000Z",
    "title": "The Graph Unveils Exciting New Roadmap for Web3’s Future",
    "url": "https://www.crypto-news-flash.com/the-graph-unveils-exciting-new-roadmap-for-web3s-future/?utm_source=rss&utm_medium=rss&utm_campaign=the-graph-unveils-exciting-new-roadmap-for-web3s-future",
    "description": "<img width=\"640\" height=\"427\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/terry-p60CjQTbPtw-unsplash.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"The Graph Unveils Exciting New Roadmap for Web3&#039;s Future\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/terry-p60CjQTbPtw-unsplash.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/terry-p60CjQTbPtw-unsplash-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/terry-p60CjQTbPtw-unsplash-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />The Graph roadmap emphasizes a robust infrastructure, with enhancements such as Indexer scaling supported by Kubernetes. Innovations such as new cost frameworks and reduced fees with Arbitrum strengthen the network, driving scalability and efficiency. The Graph, a mainstay in web3 support since 2018, embarks on a new era with an innovative roadmap. This roadmap lays [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-05T15:00:00.000Z",
    "title": "Analyst Predicts These Native Cardano Tokens to See Price Boosts",
    "url": "https://coinedition.com/analyst-predicts-these-native-cardano-tokens-to-see-price-boosts/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/UNBEATABLE-Cardano-ADA.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano Tokens to See Price Boosts\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/UNBEATABLE-Cardano-ADA.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/UNBEATABLE-Cardano-ADA-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/UNBEATABLE-Cardano-ADA-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/UNBEATABLE-Cardano-ADA-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/UNBEATABLE-Cardano-ADA-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/UNBEATABLE-Cardano-ADA-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Amidst the resurgence in crypto investors’ confidence in the market, Deezy, one of the hosts of the crypto YouTube channel Discover Crypto, in a recent video, highlighted the tokens within Cardano that could see significant upward price movements in the near term.  SingularityNET (AGIX) According to the video, AGIX is the largest native token within [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/analyst-predicts-these-native-cardano-tokens-to-see-price-boosts/\">Analyst Predicts These Native Cardano Tokens to See Price Boosts</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]