[
  {
    "source": "Cointelegraph",
    "date": "2023-07-13T05:30:15.000Z",
    "title": "If good UX is like driving auto, Web3 is ‘driving stick’ — UX designers",
    "url": "https://cointelegraph.com/news/web3-crypto-user-experience-paradox-mass-adoption",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/6af5b642-bc8e-473b-9dbe-fdf42cf2a410.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The high stakes of crypto applications mean developers often need to prioritize security — but that comes at the cost of poor user experience.</p>\n                    <p><p>The current state of Web3 user experience is akin to driving a manual transmission car — there’s more control, but most users will find it unnecessarily clunky, according to several UX designers.</p><p>Over the years, discussion around mainstream adoption of Web3 has centered around the need to improve crypto’s user experience and “ease of use.”</p><p>However, in a July 12 Twitter <a href=\"https://twitter.com/0xDesigner/status/1679161023595520002\" target=\"_blank\" rel=\"noopener nofollow\">post</a>, Web3 UI/UX designer “0xDesigner” argued that certain properties of blockchain make it challenging to build easy-to-use Web2-like applications.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Web2 vs Web3 UX<br><br>I was asked by a reporter from a crypto publication about the disparity between web2 and web3 UX. It’s a meaningful line of questioning that isn&#39;t covered enough. So I’m going to share some half-baked thoughts in hopes that it triggers more discourse.<br><br>Why is…</p>&mdash; 0xDesigner (@0xDesigner) <a href=\"https://twitter.com/0xDesigner/status/1679161023595520002?ref_src=twsrc%5Etfw\">July 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to 0XDesigner, the one of the main issues with cryptocurrency applications is that every action is “irreversible” — there’s no “undo button” on the blockchain and mistakes are expensive. They added:</p><blockquote>“Think of it this way: Web2 is like driving an automatic car. It's straightforward; you get in, press the pedal, and off you go. Web3, on the other hand, is more like driving stick. </blockquote><p>“You need to understand the gears, the clutch, and constantly monitor the tachometer otherwise you’ll damage the transmission or stall the car,” they added.</p><p>Speaking to Cointelegraph, 0xDesigner argued most of the “broader population” may not even care about the sovereignty (control and ownership) that blockchain offers. </p><h3>The Web3 UX paradox</h3><p>Thomas Ling, a former UI designer for <a href=\"https://cointelegraph.com/explained/what-is-immutable-explained\">blockchain tech firm Immutable</a> and Web2 gaming studio Riot Games told Cointelegraph that UI is typically more simple in Web2 because with Web3, ownership and control are vested with the user.</p><p>While this makes Web3 unique, it adds more complications on the backend, Ling explained:</p><blockquote>“Where a Web2 app may only need to show 1 step out of 5, a Web3 app needs to show all 5 in order for a User to achieve an action and retain the value proposition of Web3.”</blockquote><p>Because of this, Web3 UI/ UX designers are “limited” in the way that they can make “magic” happen in creating an easy-to-use application, explained Ling.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Got me thinking about UX/UI in crypto, oh and GM  <a href=\"https://t.co/ayEIbWQPDg\">pic.twitter.com/ayEIbWQPDg</a></p>&mdash; irena (@irena_clarke) <a href=\"https://twitter.com/irena_clarke/status/1676199856954589184?ref_src=twsrc%5Etfw\">July 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ling said this is particularly challenging when product teams are faced with making design decisions with tradeoffs:</p><blockquote>“It’s a bit of a paradox — by making Web3 flows simpler, we have to take away some control from the User, which starts to take away from the point of Web3.”</blockquote><p>0xDesigner believes another problem lies in the lack of priority given to user experience in Web3 projects.</p><p>“From what I've seen, most product teams are engineering driven. The designer to developer ratios are lower than in web2. That usually results in more technical solutions.”</p><p>This could be because of the high stakes in Web3, especially regarding financial applications, meaning that more staff will be focused on security and error prevention. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/this-platform-improves-ux-by-providing-cex-users-with-ens-names\"><strong><em>This platform improves UX by providing CEX users with ENS names </em></strong></a></p><p>0xDesigner believes mass adoption of Web3 will come when there’s a truly useful application of it, like gaming and music. </p><p>“The adoption problem is usefulness first, not usability. It needs to be a good game, or good music. I don’t think it will matter that it’s web3.”</p><p>Cryptocurrency applications should also “feel invisible,” they added.</p><blockquote>“I think the next crypto cycle will be driven by consumer apps that are powered by crypto, but users won’t know it’s crypto unless they look closely.”</blockquote><p>In a contrasting view, Messari CEO Ryan Selkis <a href=\"https://twitter.com/MessariCrypto/status/1678843342673813525\" target=\"_blank\" rel=\"noopener nofollow\">downplayed</a> the problem of UX/UI on adoption during a July 11 Twitter Spaces.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Just under 1 hour until our next On the Road to <a href=\"https://twitter.com/hashtag/Mainnet2023?src=hash&amp;ref_src=twsrc%5Etfw\">#Mainnet2023</a> Spaces! Join <a href=\"https://twitter.com/twobitidiot?ref_src=twsrc%5Etfw\">@twobitidiot</a>, <a href=\"https://twitter.com/bloomberg_seth?ref_src=twsrc%5Etfw\">@bloomberg_seth</a> &amp; <a href=\"https://twitter.com/mikeykremer?ref_src=twsrc%5Etfw\">@mikeykremer</a> as they dive into current crypto product solutions and their usefulness.<br><br><a href=\"https://t.co/StNxv2kOoG\">https://t.co/StNxv2kOoG</a> <a href=\"https://t.co/DzS8Vuxasg\">pic.twitter.com/DzS8Vuxasg</a></p>&mdash; Messari (@MessariCrypto) <a href=\"https://twitter.com/MessariCrypto/status/1678843342673813525?ref_src=twsrc%5Etfw\">July 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“The wallets are fine, there’s definitely some things to be desired [...] but it’s really a lot of the off-chain, social and regulatory things that cloud long term adoption.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/web3-gamer-apple-gaming-sec-hates-metaverse-tokens-logan-paul-trolled-on-steam/\"><strong><em>Web3 Gamer: Apple to fix gaming? SEC hates Metaverse, Logan Paul trolled on Steam</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]