[
  {
    "source": "Decrypt",
    "date": "2023-12-14T23:01:55.000Z",
    "title": "Solana Devs Got a BONK Airdrop Worth $300 Last Christmas—It's Now Worth $500,000",
    "url": "https://decrypt.co/209906/solana-devs-bonk-airdrop-worth-300-last-christmas-now-worth-500000",
    "description": "Developers in LamportDAO received a gift of billions of BONK last year. It helped some pay rent—and others get crypto-rich (maybe)."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-14T22:50:28.000Z",
    "title": "Hacker pleads guilty to $12M Solana DeFi hacks in first smart contract fraud conviction",
    "url": "https://cryptoslate.com/hacker-pleads-guilty-to-12m-solana-defi-hacks-in-first-smart-contract-fraud-conviction/",
    "description": "<p>Shakeeb Ahmed, a security engineer who exploited two DeFi apps, has pleaded guilty, according to statements from authorities on Dec. 14. Damian Williams, United States Attorney for the Southern District of New York (SDNY), announced a guilty plea from the perpetrator. He stated: &#8220;Five months ago, my Office announced the first ever arrest involving an [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/hacker-pleads-guilty-to-12m-solana-defi-hacks-in-first-smart-contract-fraud-conviction/\">Hacker pleads guilty to $12M Solana DeFi hacks in first smart contract fraud conviction</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-14T22:57:43.000Z",
    "title": "Galaxy Digital plans to launch Euro stablecoin with DWS and Flow Traders",
    "url": "https://cryptobriefing.com/galaxy-digital-plans-launch-euro-stablecoin-dws-flow-traders/?utm_source=feed&utm_medium=rss",
    "description": "AllUnity is set to accelerate the mass market adoption of digital assets with a fully collateralized EUR-denominated stablecoin."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-14T22:55:38.000Z",
    "title": "FASB issues crypto accounting rules, setting a new standard",
    "url": "https://cryptobriefing.com/fasb-issues-crypto-account-rules-setting-new-standard/?utm_source=feed&utm_medium=rss",
    "description": "FASB's new rules mandate fair value measurement of crypto assets each reporting period, enhancing transparency in financial reporting."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-14T23:00:27.000Z",
    "title": "Treasury Secretary Janet Yellen Discusses US Economy, Recession Risk, Soft Landing",
    "url": "https://news.bitcoin.com/treasury-secretary-janet-yellen-discusses-us-economy-recession-risk-soft-landing/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/yelle-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Treasury Secretary Janet Yellen Discusses US Economy, Recession Risk, Soft Landing\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/yelle-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/yelle-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/yelle-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/yelle-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/yelle-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/yelle-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/yelle.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />U.S. Treasury Secretary Janet Yellen believes that inflation has come down meaningfully but there&#8217;s still further to go for the Federal Reserve to achieve its 2% inflation target. She noted that the central bank has two risks to manage. &#8220;One is that inflation doesn&#8217;t come down back to their target as they envisioned, and the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-14T23:00:47.000Z",
    "title": "Terra Classic Validator Presents ‘Legally Absolved Route’ To Burn 800 Million USTC",
    "url": "https://www.newsbtc.com/ustc/terra-classic-800-million-ustc/",
    "description": "Back in August 2023, the Terra Classic community passed a proposal that would see 800 million USTC incinerated. This move came about as the community worked to help the token recover and be re-pegged back to the US dollar. Naturally, the proposal passed and the community prepared for the massive burn. That is until the plan hit a snag. Terra Classic Validators Worried About Code Changes The 800 million USTC mentioned in the proposal to be burned are the tokens held in the community treasury and managed by Risk Harbor. After the proposal was passed, the community turned toward carrying out the burn, until validators raised an issue with the plan. Related Reading: Avalanche Open Interest Just Smashed A New ATH, Can AVAX Reclaim $100? According to Risk Harbor, they no longer had the keys to the wallet which happens to be a multi-sig wallet. So by default, these USTC coins are no longer accessible. But to burn the token, validators would be required to update the codes on their nodes and the legalities around this move have been questioned. As a result of this, validators have begun to vote no to carrying out the burn, citing these legal issues. This is derailing the massive burn which is expected to reduce the token supply by around 8% in a single go. In response to this, a Terra Classic validator known as Lunanauts has proposed what they say is a “legally absolved route” to completing the burn. Basically, Lunanauts has devised a way in which validators would not have to update the codes on their nodes and thus, avoid any legal issues. Token price still trading well below dollar peg &#124; Source: USTC/USDT on Tradingview.com Legal Way To Burn 800 Million USTC In a proposal made on the Terra Classic community forum titled “Burn of 800m USTC Funds &#8211; legally absolved route,” Lunanauts suggests using a smart contract to actually burn the tokens. The objective of the proposal, Lunanauts explained, is to still carry out the burn but eliminate legal repercussions for validators. The process would involve creating a smart contract carrying a “sole MsgSend to transfer all holdings to Anxu.” Once this is done, the multis contract can then be transferred via governance to the code id create. So there is no need for any code changes by validators. As Lunanauts explains, “The proposed method achieves the same effect as (proposal 11913) without requiring validator installations.” Related Reading: Here’s How Much You Would Have If You Bought Bitcoin When Jim Cramer Said Sell Lunanauts’s ‘solution’ comes hot on the heels of Proposal 11832 which has taken another route to address validators’ legal concerns. The proposal wants to blacklist the multisig wallet holding the 800 million USTC instead, making it impossible to transfer tokens from that wallet. The two proposals are currently going head to head. As always, token holders are able to vote on the proposal they want to support. Once voting ends, whatever proposal passes will determine what happens to the 800 million USTC in the community wallet. Nevertheless, all of this is being done with the endgame of re-pegging USTC to the US dollar. The token is still trading about 96% below its peg with a 9.78 billion total supply. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Coinmarketcap, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-14T23:01:57.000Z",
    "title": "Dogecoin Rival BONK Surpasses Shiba Inu in Trading Volume As Price Leaps Over 40% in 24 Hours: CoinMarketCap",
    "url": "https://dailyhodl.com/2023/12/14/dogecoin-rival-bonk-surpasses-shiba-inu-in-trading-volume-as-price-leaps-over-40-in-24-hours-coinmarketcap/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/11/dogecoin-shiba-competitor.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/11/dogecoin-shiba-competitor.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/11/dogecoin-shiba-competitor.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/11/dogecoin-shiba-competitor.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/11/dogecoin-shiba-competitor.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/11/dogecoin-shiba-competitor.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/11/dogecoin-shiba-competitor.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Solana (SOL)-based dog-themed meme asset Bonk (BONK) has surpassed rival Shiba Inu (SHIB) in daily trading volume as its price jumps over 40% in just 24 hours. New data from crypto data aggregator CoinMarketCap reveals that the Dogecoin (DOGE) competitor has seen a staggering 71.8% increase in daily trading volume, bringing its total to about [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/14/dogecoin-rival-bonk-surpasses-shiba-inu-in-trading-volume-as-price-leaps-over-40-in-24-hours-coinmarketcap/\">Dogecoin Rival BONK Surpasses Shiba Inu in Trading Volume As Price Leaps Over 40% in 24 Hours: CoinMarketCap</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]