[
  {
    "source": "Cointelegraph",
    "date": "2024-02-15T19:46:51.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">The recently approved spot Bitcoin exchange-traded funds (ETFs) are responsible for 75% of new investments in the asset, according to CryptoQuant. These funds are gobbling up Bitcoin at a faster r Meanwhile, YouTuber turned crypto pundit KSI has attracted the attention of crypto investigators ZachXBT and Coffeezilla after posting about a token they claim is a pump-and-dump scam, and spot BTC ETs Spot Bitcoin exchange-traded funds (ETFs) aren’t just scooping up Bitcoin; they’re getting faster at it, according to new data. Meanwhile, a fake app impersonating Curve Finance has appeared on Apple’s App Store, and Bitcoin tore through the $1 trillion market cap ceiling as the price eclipsed $50,000.</p><p>In yet another nod to the overwhelming success of <a href=\"https://cointelegraph.com/news/bitcoin-etfs-about-75-new-investment\">U.S. spot Bitcoin ETFs</a>, CryptoQuant has reported that three-quarters of new investments into BTC has come from the recently approved products.</p><p>“We estimate over 75% of new investment into Bitcoin are coming from these ETFs. Moreover, investment from these ETFs has increased to 2% of the total historical investment in Bitcoin in just one month as measured by the realized market capitalization,” CryptoQuant said in a report.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T19:56:53.000Z",
    "title": "Palworld CEO Praises Realistic Animation in Response to Fan Appreciation",
    "url": "https://www.cryptopolitan.com/palworld-ceo-praises-realistic-animation/",
    "description": "Palworld, the widely acclaimed game developed by Pocketpair, continues to captivate gamers worldwide with its immersive gameplay and attention to detail. Beyond its commercial success, the game&#8217;s developer has fostered a strong bond with its fanbase, exemplified by their responsiveness to fan feedback on social media platforms like Twitter. Since its early access launch, the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-15T20:04:04.000Z",
    "title": "US Banks Rally For Updated Crypto Guidelines As Digital Asset Prices Surge",
    "url": "https://www.newsbtc.com/news/us-banks-rally-for-updated-crypto-guidelines-as-digital-asset-prices-surge/",
    "description": "Amidst a significant surge in cryptocurrency prices, which propelled the total crypto market capitalization to a high of $1.93 trillion on Thursday, influential interest groups are urging the US Securities and Exchange Commission (SEC) to revise accounting guidance that imposes higher costs on US banks for holding digital assets on behalf of their customers. Banking Trade Groups Urge SEC To Revise Crypto Accounting Rules According to a Bloomberg report, a coalition of trade groups, including the Bank Policy Institute, the American Bankers Association, the Securities Industry and Financial Markets Association, and the Financial Services Forum, sent a letter to the SEC on Wednesday outlining their desired changes.  The existing guidance requires public companies, including banks, to treat cryptocurrencies they hold in custody as liabilities on their corporate balance sheets. Consequently, banks must allocate assets of a similar value to comply with capital requirements and protect against potential losses. According to Bloomberg, the trade groups have requested the SEC to consider the following key changes: Exclude certain assets from being classified under the broad crypto umbrella. This includes traditional assets recorded or transferred using blockchain networks, such as tokenized deposits, as well as tokens underlying SEC-approved products like spot Bitcoin exchange-traded funds (ETFs). Grant regulated lenders an exemption from the current balance sheet requirement while maintaining the disclosure of crypto activities in financial statements. The trade groups argued that if regulated banking organizations are unable to provide digital asset-safeguarding services at scale, it would negatively impact investors, customers, and the broader financial system.  However, the SEC has defended its accounting guidance, citing the &#8220;unique risks&#8221; and uncertainties posed by cryptocurrencies compared to other assets held by banks.  Limiting Custody Expansion? The specific guidance in question, known as Staff Accounting Bulletin No. 121, has faced criticism from banks since its publication in 2022.  Lenders argue that the bulletin limits their ability to expand digital asset services for customers due to the associated high costs. Consequently, banks missed out on providing custody services for recently approved Bitcoin exchange-traded funds, with Coinbase emerging as the preferred custodian for the majority of ETF issuers. The trade groups also highlighted additional challenges resulting from the guidance, including a &#8220;chilling effect&#8221; on plans to utilize blockchain technology for traditional assets. While the SEC described SAB 121 as non-binding staff guidance, it acknowledged that following it enhances disclosure to investors regarding firms safeguarding crypto assets for others. Related Reading: These Are The Altcoins Drawing Whale Interest, Santiment Reveals As the SEC faces mounting pressure, there have been efforts by lawmakers to repeal the guidance.  A resolution was introduced in the House Financial Services Committee, spearheaded by Representatives Mike Flood and Wiley Nickel, while Senator Cynthia Lummis sponsored identical legislation in the Senate. These measures aim to remove the SEC&#8217;s authority in making rules that impact bank custody. The outcome remains uncertain, as the legislation&#8217;s success depends on garnering sufficient support, particularly among Democrats and within the White House.  However, the collective efforts of trade groups, lawmakers, and industry stakeholders could potentially lead to regulatory changes that alleviate the burden on banks holding digital assets, facilitating their participation in the evolving cryptocurrency landscape. Furthermore, the recent endeavors undertaken by US institutions exemplify a growing interest and eagerness to adopt and invest in cryptocurrencies, particularly Bitcoin.  This heightened institutional involvement has significantly contributed to the swift success of Bitcoin spot ETFs, which gained regulatory approval merely a month ago. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-15T19:48:11.000Z",
    "title": "Polygon’s zkEVM Update Signals Potential Boost in Network Activity: Can it Push MATIC Price to $1?",
    "url": "https://www.crypto-news-flash.com/polygons-zkevm-update-signals-potential-boost-in-network-activity-can-it-push-matic-price-to-1/?utm_source=rss&utm_medium=rss&utm_campaign=polygons-zkevm-update-signals-potential-boost-in-network-activity-can-it-push-matic-price-to-1",
    "description": "<img width=\"2073\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logos-with-dark-purple-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon-MATIC-logos-with-dark-purple-background\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logos-with-dark-purple-background.jpg 2073w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logos-with-dark-purple-background-300x174.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logos-with-dark-purple-background-1024x593.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logos-with-dark-purple-background-768x445.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logos-with-dark-purple-background-1536x889.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logos-with-dark-purple-background-2048x1186.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logos-with-dark-purple-background-150x87.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logos-with-dark-purple-background-450x260.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logos-with-dark-purple-background-1200x695.jpg 1200w\" sizes=\"(max-width: 2073px) 100vw, 2073px\" />Polygon&#8217;s zkEVM upgrade has been welcomed, with the update expected to boost network activity and drive MATIC prices. This is a welcome development for the community after zkEVM’s daily active addresses dropped sharply last week. Polygon Labs, the team responsible for the development of the Polygon network has announced that a new update went live [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-15T19:45:02.000Z",
    "title": "$290,000,000 Drained From Crypto Gaming Platform PlayDapp by Hackers After Massive Security Breach: Elliptic",
    "url": "https://dailyhodl.com/2024/02/15/290000000-drained-from-crypto-gaming-platform-playdapp-by-hackers-after-massive-security-breach-elliptic/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/blockchain-gaming-sector.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/blockchain-gaming-sector.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/blockchain-gaming-sector.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/blockchain-gaming-sector.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/blockchain-gaming-sector.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/blockchain-gaming-sector.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/blockchain-gaming-sector.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Blockchain analytics firm Elliptic says the crypto gaming platform PlayDapp (PLA) lost $290 million worth of crypto assets as a result of security breaches this month. Elliptic says the first breach, suspected to involve a private key leak, happened on February 9th. An unauthorized wallet minted 200 million PLA tokens worth $36.5 million at the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/15/290000000-drained-from-crypto-gaming-platform-playdapp-by-hackers-after-massive-security-breach-elliptic/\">$290,000,000 Drained From Crypto Gaming Platform PlayDapp by Hackers After Massive Security Breach: Elliptic</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-15T19:41:05.000Z",
    "title": "Altcoin Explodes by Over 50% in Less Than Two Days After Update Promising a ‘Whole New World’ Goes Live",
    "url": "https://dailyhodl.com/2024/02/15/altcoin-explodes-by-over-50-in-less-than-two-days-after-update-promising-a-whole-new-world-goes-live/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/01/massive-vechain-prediction.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/01/massive-vechain-prediction.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/01/massive-vechain-prediction.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/01/massive-vechain-prediction.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/01/massive-vechain-prediction.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/01/massive-vechain-prediction.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/01/massive-vechain-prediction.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A supply and demand-focused altcoin is skyrocketing amid the release of an update that greatly expands its reach. In a new announcement, VeChain (VET) says that its Account Abstraction upgrade is now live, opening up a “whole new world” for the smart contract platform. “Account Abstraction is now live, opening up a whole new world [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/15/altcoin-explodes-by-over-50-in-less-than-two-days-after-update-promising-a-whole-new-world-goes-live/\">Altcoin Explodes by Over 50% in Less Than Two Days After Update Promising a ‘Whole New World’ Goes Live</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]