[
  {
    "source": "CoinDesk",
    "date": "2023-11-06T14:52:30.000Z",
    "title": "First Mover Americas: FTX Wants to Sell Its GBTC ",
    "url": "https://www.coindesk.com/markets/2023/11/06/first-mover-americas-ftx-wants-to-sell-its-gbtc/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin [BTC] and crypto markets in context for Nov. 6, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-06T15:00:52.000Z",
    "title": "What Is XRP? The Cryptocurrency Created by Ripple Founders",
    "url": "https://decrypt.co/resources/ripple",
    "description": "XRP is a type of cryptocurrency designed to help banks move money more quickly, and cheaply than existing methods. It is largely spearheaded by Ripple."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-06T15:02:21.000Z",
    "title": "Crypto Fund Inflows Hit 6-Week Streak, Topping All of 2022: CoinShares",
    "url": "https://cryptobriefing.com/crypto-fund-inflows-hit-6-week-streak-topping-2022/?utm_source=feed&utm_medium=rss",
    "description": "Crypto funds see 6th week of inflows topping $260M, surpassing 2022's total and fueled by Bitcoin's $842M YTD inflows amid spot ETF hopes."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-06T14:42:17.000Z",
    "title": "Kuwait Finance House Leverages Ripple for Cross-Border Transactions",
    "url": "https://www.cryptopolitan.com/kuwait-finance-house-leverages-ripple/",
    "description": "Kuwait Finance House (KFH), the pioneering Islamic bank of Kuwait, has embraced the digital wave with significant strides in virtual banking. Tareq Al-Ajeel, the bank&#8217;s digital transformation executive, highlighted the institution&#8217;s technological advancements at the Breaking Barriers conference in Kuwait. He notably applauded the strategic alliance with Ripple, the San Francisco-based blockchain payment firm, for ... <a title=\"Kuwait Finance House Leverages Ripple for Cross-Border Transactions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kuwait-finance-house-leverages-ripple/\" aria-label=\"More on Kuwait Finance House Leverages Ripple for Cross-Border Transactions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-06T14:41:37.000Z",
    "title": "Digital asset expansion: London Stock Exchange Group seeks new Director",
    "url": "https://www.cryptopolitan.com/london-stock-director-for-digital-expansion/",
    "description": "In a decisive move reflecting its strategic shift towards innovative technologies, the London Stock Exchange Group (LSEG) has made public its search for a new director to spearhead its digital assets division. The pivotal role highlights the Group&#8217;s commitment to integrating digital assets, cryptocurrencies, and distributed ledger technology (DLT) into its operations. Pioneering digital asset ... <a title=\"Digital asset expansion: London Stock Exchange Group seeks new Director\" class=\"read-more\" href=\"https://www.cryptopolitan.com/london-stock-director-for-digital-expansion/\" aria-label=\"More on Digital asset expansion: London Stock Exchange Group seeks new Director\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-06T15:00:59.000Z",
    "title": "XRP Hits Critical Price Juncture As Whales Scoop Up 1.26 Billion Coins",
    "url": "https://www.newsbtc.com/news/xrp-hits-critical-price-juncture-as-whales-scoop-up-1-26-billion-coins/",
    "description": "XRP, the popular cryptocurrency, has been making significant strides in recent trading hours. Investors and traders have witnessed remarkable gains, with the hourly chart indicating a bullish trend despite a sharp rise. As the price of XRP hovers around $0.696533, CoinGecko reports an impressive 8.9% increase in the past 24 hours, marking a seven-day rally of 24.4%. Bulls are flexing their muscles on the daily time frame, underlining the cryptocurrency&#8217;s resilience and potential for further upward movement. An analysis of XRP&#8217;s price action reveals several compelling factors that suggest a bright outlook for this digital asset. Related Reading: Chainlink Bullish Run: Is $15 On The Horizon Amidst Strong Recovery? Sustained Momentum Above Key Moving Averages XRP&#8217;s current price of $0.696533 is not merely a fleeting spike. It is notably trading above the 50-day and 200-day exponential moving averages (EMAs), a strong indicator of bullish sentiment. When a cryptocurrency maintains a position above these key EMAs, it typically signifies a solid foundation for a prolonged uptrend. The potential for a bullish cross between the 50-day and 200-day EMAs adds weight to the argument for sustained growth. This technical configuration implies that XRP may continue to climb, potentially attracting even more investors looking to capitalize on the positive price action. Related Reading: RUNE Solid 100% Rally Hits Barrier: THORChain Price Nears Key Resistance XRP market cap currently at $37.546 billion on the daily chart: TradingView.com RSI Confirms Strong Buyer Sentiment In addition to the moving averages, the Relative Strength Index (RSI) for XRP is comfortably above the 50 mark. The RSI is a momentum oscillator that measures the speed and change of price movements. When it crosses the 50 threshold, it indicates a shift towards bullish sentiment. With the RSI clearly in the bullish territory, it further solidifies the notion that buyers are firmly in control of XRP&#8217;s price trajectory. This heightened level of buyer confidence is a crucial driver for the cryptocurrency&#8217;s ongoing price appreciation. Critical Resistance Point While XRP&#8217;s recent performance is undeniably impressive, traders and investors should exercise caution and closely monitor the daily bar closure, particularly in relation to the resistance level at $0.6541. This price point serves as a critical juncture that could influence the direction of XRP&#8217;s price movement. Breaking through this resistance could propel XRP to even greater heights, possibly establishing new support levels at higher values. Conversely, failing to surpass this obstacle may lead to a temporary setback. Therefore, staying vigilant and responsive to the market&#8217;s dynamics is paramount for those considering XRP investments. Source: Santiment XRP Whale Appetite Increasing Meanwhile, there has recently been a notable increase in the acquisition of XRP by prominent cryptocurrency investors, referred to as &#8220;crypto whales.&#8221; This surge in purchasing activity has contributed to a highly dynamic commencement of the month of November this year. The XRP price surge has been significantly influenced by bullish trading activity observed within a cohort of strategic crypto whales, as indicated by recent on-chain data. Whales, who possess between 100,000 and 1 billion XRP, accumulated an extra 1.26 billion XRP between October 24 and November 6, setting a new record for their total holdings in 2023. The chart above illustrates how the price of XRP began to rise positively around October 24, which is when these wealthy investors started making large purchases of the cryptocurrency. At $0.68 per XRP, the 1.26 billion XRP obtained are worth $850 million. XRP price rose over the important resistance zone at $0.65 after this significant investment in two weeks. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-06T15:02:25.000Z",
    "title": "10 Best Meme Coins to Buy Now | The Next Big Memecoin, Shiba Inu, or Pepe Coin? Hottest New Meme Coins of 2023",
    "url": "https://www.crypto-news-flash.com/10-best-meme-coins-to-buy-now-the-next-big-memecoin-shiba-inu-or-pepe-coin-hottest-new-meme-coins-of-2023/?utm_source=rss&utm_medium=rss&utm_campaign=10-best-meme-coins-to-buy-now-the-next-big-memecoin-shiba-inu-or-pepe-coin-hottest-new-meme-coins-of-2023",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-8.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-8.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-8-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the digital currency realm, meme coins have become synonymous with crypto culture and Web3 community trends. As we sail through 2023, a new cohort of meme coins is taking center stage, attracting attention with some questioning whether these could be the next Shiba Inu or Pepe Coin. This article spotlights the 10 most talked-about [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-06T14:40:54.000Z",
    "title": "Ripple, Hedera, SWIFT, FedNow: The Battle for Dominance in Finance’s Trillion Dollar Future ",
    "url": "https://www.crypto-news-flash.com/ripple-hedera-swift-fednow-the-battle-for-dominance-in-finances-trillion-dollar-future/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-hedera-swift-fednow-the-battle-for-dominance-in-finances-trillion-dollar-future",
    "description": "<img width=\"1038\" height=\"584\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-24x14.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-48x27.png 48w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />The cross-border payment industry is predicted to have a valuation of $250 trillion by 2027 as Ripple and others battle for dominance.  Hedera, Swift, Stellar, and FedNow are racing to have a lion&#8217;s share of the expected valuation.  The cross-border payment industry is on an upward surge with the expectation that it will record $250 [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-06T14:42:00.000Z",
    "title": "FTX Creditors Seek Permission To Sell $744M Worth of Trust Assets",
    "url": "https://coinedition.com/ftx-creditors-seek-permission-to-sell-744m-worth-of-trust-assets/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/FTX-Statement-Shows-1.6B-BTC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX Statement Shows $1.6B BTC\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/FTX-Statement-Shows-1.6B-BTC.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/FTX-Statement-Shows-1.6B-BTC-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/FTX-Statement-Shows-1.6B-BTC-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/FTX-Statement-Shows-1.6B-BTC-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/FTX-Statement-Shows-1.6B-BTC-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/FTX-Statement-Shows-1.6B-BTC-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A court filing from November 3 revealed that bankrupt crypto exchange FTX, along with its creditors, has submitted a request to the U.S. bankruptcy court in Delaware for authorization to sell certain assets held in trusts. These assets include funds from Grayscale and Bitwise, with an approximate total value of $744 million. The filing highlighted [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ftx-creditors-seek-permission-to-sell-744m-worth-of-trust-assets/\">FTX Creditors Seek Permission To Sell $744M Worth of Trust Assets</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]