[
  {
    "source": "Decrypt",
    "date": "2023-08-30T13:13:14.000Z",
    "title": "What is Shibarium, the SHIB-Backed Network that Tripled Wallet Numbers Overnight?",
    "url": "https://decrypt.co/resources/what-is-shibarium-the-shib-backed-network-that-tripled-wallet-numbers-overnight",
    "description": "Shibarium is looking to showcase the potential of the Shiba Inu project beyond its origins as a meme coin."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-30T13:30:00.000Z",
    "title": "How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in",
    "url": "https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/magazine-Protecting-Your-Crypto-in-a-Volatile-Market-scaled.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Crypto OGs Brock Pierce and Tim Draper and other experts provide essential advice on how to protect your hard-earned stack.</p>\n                    <p><p><strong>Crypto is a volatile place. Money can be as easily lost as made through the ups and downs of Bitcoin and the wider market, and there are massive decisions to make. Should you just hodl  invest and do nothing  or actively trade the market? How many coins should your portfolio hold? Self-custody or keep your funds on an exchange with pre-determined stop losses?</strong></p><p><strong>Basically, how do you protect your stack from the million and one things that can go wrong? We asked <a href=\"https://cointelegraph.com/magazine/insiders-guide-real-life-crypto-ogs-part-1/\" target=\"_blank\" rel=\"nofollow\" >Bitcoin OGs</a> and experts in the space for their advice and opinions.</strong></p><h2 class=\"wp-block-heading\" id=\"h-walk-before-you-can-run\">Walk before you can run</h2><p>When faced with the question of how best to protect your crypto, <a href=\"https://cointelegraph.com/magazine/insiders-guide-real-life-crypto-ogs-part-2/\" target=\"_blank\" rel=\"nofollow\" >OG</a> Brock Pierce is circumspect. The former presidential candidate and co-founder of Tether and Block.one points out that not everyone is in the same place.</p><p>Early noobs looking to begin their journey might go to Coinbase and purchase their first $20 or $50 worth of crypto, and its not an investment in crypto, but an investment in yourself. However, the moment you have a material investment  and that is a different amount for everybody  then its important to understand the basics of hodling and investing in crypto,” he says. </p><blockquote class=\"wp-block-quote\"><p>Its always better to walk before you can run, to walk in baby steps and dont let FOMO (fear of missing out) cloud your judgment. This is a marathon, a long game, so take you time and be informed.</p></blockquote><h2 class=\"wp-block-heading\">Self-custody for safety</h2><p>Pierce repeats the mantra, “Not your keys, not your coins.” This is one of the most widespread pieces of wisdom in the world of crypto, where people are encouraged to take responsibility for holding their own crypto rather than outsourcing it to an exchange that can get hacked. </p><p>But there are dangers with this approach, too, and if something goes wrong, there is no centralized bank authority to reset the passwords or refund money lost to scams. Its like holding cash under the mattress  the entire responsibility rests with you  and is referred to as self-custody in crypto.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Itai-Avneri-is-the-Deputy-CEO-and-COO-of-INX.jpeg\" alt=\"Itai Avneri\" class=\"wp-image-23350\" width=\"300\" height=\"300\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Itai-Avneri-is-the-Deputy-CEO-and-COO-of-INX.jpeg 500w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Itai-Avneri-is-the-Deputy-CEO-and-COO-of-INX-300x300.jpeg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Itai-Avneri-is-the-Deputy-CEO-and-COO-of-INX-100x100.jpeg 100w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><figcaption class=\"wp-element-caption\"><em>Itai Avneri, deputy CEO and chief operating officer at INX Limited (Supplied)</em></figcaption></figure><p>Self-custody is the key to safe trading, according to Itai Avneri, deputy CEO and chief operating officer at INX Limited, the first and only fully regulated, end-to-end platform for listing and trading both SEC-registered security tokens and cryptocurrencies.</p><p>Self-custody is the key here. Especially when thinking about digital securities and not just crypto. Trading on a centralized exchange that provides the confidence and protection of regulation and, at the same time, trading in a decentralized manner when the customer holds his / her own assets. Generally speaking, your wallet, your keys, your assets. This is the best way to protect yourself from a sudden hold on withdrawals or other events we witnessed in the past year, Avneri says.</p><p>But <a href=\"https://cointelegraph.com/magazine/winners-are-odd-tim-drapers-rules-for-investing-success/\" target=\"_blank\" rel=\"nofollow\" >Bitcoin billionaire Tim Draper of Draper VC</a> says that while thats true, institutions arent keeping funds on a Ledger in a drawer.</p><p>I no longer believe that my dollars in the bank are very safe. They are subject to political winds and inflation,” he says. </p><p>The safest personal money is BOLBitcoin on Ledger. The safest institutional money is BAC Bitcoin at Coinbase, Draper continues.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Tim-Draper.jpg\" alt=\"Tim Draper\" class=\"wp-image-23348\" width=\"600\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Tim-Draper.jpg 1022w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Tim-Draper-300x88.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Tim-Draper-770x227.jpg 770w\" sizes=\"(max-width: 1022px) 100vw, 1022px\" /><figcaption class=\"wp-element-caption\"><em>Tim Draper, founder of Draper VC, chatting with journalist Jillian Godsil. </em></figcaption></figure><h2 class=\"wp-block-heading\">Diversification: Dont just buy eggs</h2><p>Pierce points out that people advanced in sophistication can look at investigating yield farming or decentralized finance. This allows people to not only protect their crypto but also to look at increasing it through earning yields  but again, this involves risk.</p><p>He emphasizes the importance of investing in your own education and notes the importance of diversification.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Brock-Pierce.jpg\" alt=\"Brock Pierce\" class=\"wp-image-23347\" width=\"300\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Brock-Pierce.jpg 482w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Brock-Pierce-249x300.jpg 249w\" sizes=\"(max-width: 482px) 100vw, 482px\" /><figcaption class=\"wp-element-caption\"><em>Brock Pierce, chairman of the Bitcoin Foundation (Supplied)</em></figcaption></figure><p>If you are participating in those markets, then you by necessity take on the counterparty risk associated with those platforms, and how you mitigate those risks is through diversification, but not having all your eggs in one basket. If any one asset fell, it wont wreck (rekt) your entire portfolio.</p><p>Diversification in crypto is tricky, as Bitcoin and the rest of the market tend to move up and down at the same time. But Pierce warns against putting too much money in more volatile coins, for example, memecoins, in case of a downturn where the pain will be magnified.</p><p>Andrew Latham, a certified financial planner based in Rolesville, North Carolina and the director of content for financial websiteSuperMoney.com, echoes Pierces restraint and suggests looking outside of crypto as well.</p><p>The key to surviving market downturns is diversification and a disciplined approach. Dont put all your eggs in one basket. Spreading your investments across various asset classes can help cushion against volatility. Keep a disciplined approach to crypto investing, focusing on long-term goals over short-term market fluctuations.<br><br>And while crypto investing is often a little bit too interesting for its good, he says successful investing is often the opposite.<br><br>As the old adage goes, ‘Investing should be more like watching paint dry or watching grass grow. If you want excitement, take $800 and go to Las Vegas,’ Latham says.</p><section class=\"adv-banner adbutler-ad adbutler-ad__desktop\"><div class=\"container\"><!-- 1456x180 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><section class=\"adv-banner adbutler-ad adbutler-ad__mobile\"><div class=\"container\"><!-- 600x500 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><h2 class=\"wp-block-heading\">High-conviction bets</h2><p>Sometimes, it makes sense to be overweight in a blue chip, market-leading token though, as Warren Buffetts 50% portfolio allocation to Apple shows. There are plenty of Bitcoin-only hodlers, but Lakov Levin, the co-founder of the new DeFi investment platform Locus Finance, leans heavily on Ethereum.</p><p>Levin suggests: Ethereum is the blockchain, which is used as the fundament for the financial evolution of the 21st century. It is a hub for hundreds of protocols that build value for its users. Holding Ethereum is similar to holding a fraction of the internet and value it provides to users. It is truly a remarkable financial opportunity.”</p><p>Levin notes that Ethereums hodlers can stake their assets and receive 5% APR in ETH itself and points out the “Ethereum blockchain burns fees for each transaction made on the blockchain, which makes Ethereum a deflationary asset.”</p><p>I do not think that ever in human history we saw a deflationary asset that generates consistent yield and has potential for such innovation, concludes Levin.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/pexels-monstera-62890731.jpg\" alt=\"Stop Loss\" class=\"wp-image-23351\" width=\"600\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/pexels-monstera-62890731.jpg 640w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/pexels-monstera-62890731-300x169.jpg 300w\" sizes=\"(max-width: 640px) 100vw, 640px\" /><figcaption class=\"wp-element-caption\"><em>A stop loss can prevent further losses. (Pexels)</em></figcaption></figure><h2 class=\"wp-block-heading\">A tool to stop losses</h2><p>Pierce is sanguine about overall market dumps if you are positioned properly. </p><blockquote class=\"wp-block-quote\"><p>If the market falls by 10%, take the hit using something like a stop loss, and try to recover in the next run.</p></blockquote><p>A stop-loss is a risk management tool that automatically sells a token once it reaches a certain floor  predetermined by the user. It is designed to limit losses but can be a blunt tool in the crypto world, where movements of 10% are common and could see all assets dumped as a result.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Iakov-Levin.jpg\" alt=\"Lakov Levin\" class=\"wp-image-23345\" width=\"300\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Iakov-Levin.jpg 378w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Iakov-Levin-198x300.jpg 198w\" sizes=\"(max-width: 378px) 100vw, 378px\" /><figcaption class=\"wp-element-caption\"><em>Lakov Levin, a co-founder of Locus Finance (Supplied) </em></figcaption></figure><p>Levin is cautiously bullish on stop losses, which basically allow traders to close a trading position at a specific price.</p><p>The effectiveness of any tool lies in the hands of those who use it. The most important thing about ‘stop losses’ is the feeling of control, which protects from the anxiety of being in the market.</p><p>One of the scenarios that stop losses is the management of hypotheses on market behavior. When entering a trade, a trader has a hypothesis of the behavior of the market, which leads to opening a trading position.</p><p>Stop losses allow you to pick the price where your thesis is rejected by the market and limit your loss, which is a must thing to have for long-term trading. But ‘stop losses’ do not save from cognitive biases, which heavily affect trading. In this case, a trader may re-enter trade a few times, breaking his own rules under the influence of greed or fear. It is important to have discipline to follow your own rules.</p><p>One of the rules that I used when trading is when hit by stop loss, I take a break from trading this asset, says Levin.</p><p>Pierce is not an active trader and sees himself more as a long-term participant in the market. He appreciates that market volatility is not a negative thing and that tremendous wealth is made in volatile markets  the more movement, the more opportunity.</p><p>But it’s not for the faint of heart. You know, youre riding a roller coaster ride almost every day, says Pierce.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/crypto-crimes-twitter-hackers-keyser-soze/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Crypto Crimes Rated: From the Twitter Hackers to Not Your Keyser, Not Your Coins</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/inside-south-korea-wild-plan-dominate-metaverse/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Inside South Koreas wild plan to dominate the metaverse</p>                        </a>                    </div></div></div><h2 class=\"wp-block-heading\">Options can protect against extreme volatility</h2><p>All-time highs  and all-time lows. Recent reports in The Wall Street Journal point to SpaceX writing down the value of its Bitcoin holdings by $373 million. It is currently unclear whether SpaceX sold or merely reduced the value of its digital assets in its accounts. This may cause difficulty in the future, as U.S. accounting rules dictate that once written down, the value of Bitcoin on company balance sheets cannot be adjusted upward, even if its price rises.</p><p>The subsequent downward movement took many by surprise  established investors and newbies alike. What other tools are available to users to protect their crypto? Well, a 50-year-old model created by Nobel-prize-winning professors could be an option.</p><p>Options trading gives the trader the right or obligation to buy or sell a specific security on a specific date at a specific price  its a contract thats linked to an underlying asset such as a stock or security. Since 1973, options have been priced using the Black-Scholes model originally authored by two university professors. This mathematical equation estimates the theoretical value of assets based on implied volatility, taking into account the impact of time and other risk values. It is to this day regarded as one of the best ways to price an option contract.</p><figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\"><blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">In 1973 two finance geeks, Black and Scholes, created a financial model used to price risk and volatility.<br><br>It gave birth to the $13tr options market and won the Nobel Prize for Economics.<br><br>50 years later, Bumper brings it up to the age of DeFi, a breakthrough in risk management. <a href=\"https://t.co/ZxNqROwQPV\" target=\"_blank\" rel=\"nofollow\" >pic.twitter.com/ZxNqROwQPV</a></p>— Gareth Ward (@S_Boomerang) <a href=\"https://twitter.com/S_Boomerang/status/1695061310046716077?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >August 25, 2023</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></figure><p>Asked if he might consider using a tool like options, Pierce is cagey. He reckons that leverage is the demise of most peoples wealth. Leverage is the use of borrowed funds to increase ones trading position beyond what would be available from one’s cash balance alone.</p><p>Be very careful playing with leverage. Its a tool for hedging to try and achieve great gains but can be the thing that creates more problems if you are not a skilled trader.</p><p>Pierce has bought into options in the past  a few times where he tried to swing for the fences with leveraged option bets.</p><blockquote class=\"wp-block-quote\"><p>It’s not worked out well, for me, because one of my problems is I’m so close to the market, that the markets are not as rational.</p></blockquote><p>Pierce quotes the recent SEC/Ripple legal action. He didnt trade on this occasion, but if he had, he would have bet on an altcoin bull run.</p><p>It didnt happen. If I had followed my gut, then I would have bought and been wrecked the next day. </p><p>As Pierce said, thats why hes not an active trader.</p><h2 class=\"wp-block-heading\">Stop losses and options?</h2><p>A new protocol called Bumper is launching this month, claiming to provide a safety net for downward volatility. It combines stop losses and options in a way that co-founder Jonathan DeCarteret claims is cheaper and more efficient than both those traditional tools.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Jonathan-DeCarteret.jpg\" alt=\"Jonathan DeCarteret\" class=\"wp-image-23346\" width=\"300\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Jonathan-DeCarteret.jpg 661w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Jonathan-DeCarteret-300x204.jpg 300w\" sizes=\"(max-width: 661px) 100vw, 661px\" /><figcaption class=\"wp-element-caption\"><em>Jonathan DeCarteret, CEO of Bumper (Supplied)</em></figcaption></figure><p>Bumpers backtested economic simulations claim a yield improvement of 46.2% over options pricing during the 2022 bear market. This is demonstrated through a historic simulation report audited by Cryptecon and CADlabs.</p><p>Decentralised Finance (DeFi) typically has low latency and high frequency of liquidity, which poses certain complexities for the model.</p><p>Option desks make great use of pricing risk but have to add their costs on top. Bumper evolves the now half-century-old Black-Scholes equation to leverage all the unique properties of DeFi, such as pooled liquidity, smart contracts and protocol composability. Two years ago, we raised $20 million in funding to create a superior crypto equivalent, says DeCarteret.</p><h2 class=\"wp-block-heading\">Dont fall foul of criminal scams</h2><p>The membership program Crytolock.ai enables users to save up to 90% of compliance and recovery expenses in case of a crypto breach. Not surprisingly, CEO Roger Ying says to focus on prevention, detection and recovery.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Roger_Ying_Photo-1.png\" alt=\"Roger Ying\" class=\"wp-image-23349\" width=\"300\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Roger_Ying_Photo-1.png 482w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Roger_Ying_Photo-1-300x286.png 300w\" sizes=\"(max-width: 482px) 100vw, 482px\" /><figcaption class=\"wp-element-caption\"><em>Roger Ying, CEO of Crytolock.ai (Supplied) </em></figcaption></figure><p>Crypto users need to be educated on ways to prevent, secure and make sure they are not transacting with illicit entities otherwise, they may be implicated in a crypto crime, he says.</p><p>Furthermore, there are a growing number of ways to monitor your crypto on the blockchain and be immediately notified of unintended transactions and stop them before they get confirmed. He adds that if you still end up the victim of a hack or rug pull, understanding the necessary processes to recover crypto is very important both in time and expenditure savings.”</p><h2 class=\"wp-block-heading\">Hodling as a safe course</h2><p>Of course, hodling large-cap cryptocurrencies is probably the safest and easiest way to maintain a position. Pierce recommends using cold storage provided by hardware wallets as a safe way to keep crypto.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/how-to-prepare-for-end-of-bull-run-part-1-timing/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>How to prepare for the end of the bull run, Part 1: Timing</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/north-american-crypto-miners-prepare-to-challenge-chinas-dominance/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>North American crypto miners prepare to challenge Chinas dominance</p>                        </a>                    </div></div></div><p>Back in the day when I started, we used paper wallets. Youd have a new device, and youd print out the keys, laminate the paper, and chuck it into a safe.</p><p>Sorkin is very direct in his hodling actions:</p><blockquote class=\"wp-block-quote\"><p>Buy ETH, stake it in Lido, receive LDO and find ways to stake LDO. Otherwise just buy Bitcoin and forget about it completely until late 2024 when halving of BTC happens. </p></blockquote><p>Latham says the key to hodling is patience and conviction. Invest only in cryptocurrencies that you believe have long-term potential and can withstand market downturns. Regularly review your holdings to ensure they still align with your investment goals. Time in the market does beat timing the market, but that only works when you pick cryptocurrencies that dont flop, so its crucial to vet your investments carefully.</p><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.7\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-30T13:29:08.000Z",
    "title": "Coinbase stock surges after favorable federal ruling for Grayscale",
    "url": "https://cointelegraph.com/news/coinbase-stock-surges-after-favorable-federal-ruling-for-grayscale",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/a27770a6-ae90-40d8-b4cb-f62f01e226b4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In the final moments of the trading session on Tuesday, Aug.29, the value of COIN stood at $85.13 per share, a jump of 15% over the previous day's close.</p>\n                    <p><p>Coinbase's stock experienced a significant surge on Aug. 29 after reports emerged that a federal judge had ruled in favor of Grayscale in their SEC legal dispute.</p><p>In the final moments of the trading session on Tuesday, Aug.29, the value of COIN stood at $85.13 per share, marking an increase of over 15% over the previous day's close. Coinbase, the largest cryptocurrency exchange in the United States, has been publicly listed on the Nasdaq since 2021.</p><p>On Aug. 29, a federal court<a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\"> ruled that the U.S. Securities and Exchange Commission did not provide a consistent justification</a> for rejecting Grayscale's request to transform its Bitcoin Trust into a traditional Bitcoin ETF.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/8df3079a-4da0-4cbc-b7b0-58c1d4a09bab.JPG\"  /><figcaption style=\"text-align: center;\"><em>Screenshot showing Coinbase stock price increase. Source: Coinbase</em></figcaption></figure><p>The verdict, <a href=\"https://cointelegraph.com/news/crypto-community-jubilant-over-grayscale-sec-decision-uncertainty-remains\">perceived as a victory for the cryptocurrency</a> sector by investors, fuelled hopes of the potential arrival of a Bitcoin ETF in the financial landscape. Among the candidates aiming to introduce a Bitcoin ETF, Coinbase has been chosen as the potential custodian and partner for sharing surveillance data.</p><p>Consequently, the company from San Francisco would engage in the sharing of data related to trading, clearing operations and customer identification. This collaborative effort aims to mitigate market manipulation risks and ensure the secure storage of the Bitcoin supporting the fund's shares.</p><p>A <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-approved\">Bitcoin spot ETF remains absent in the U.S.</a> due to the SEC's hesitancy in granting approval. At present, only cryptocurrency ETFs linked to futures contracts, enabling investors to speculate on future digital asset prices, are accessible within the country.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-decisions-on-seven-bitcoin-etfs-in-six-days\"><strong><em>SEC’s first deadlines to approve 7 Bitcoin ETFs coming over the next week</em></strong></a></p><p>Nevertheless, investors are seeking an investment instrument that provides direct exposure to Bitcoin. BlackRock, the world's largest asset manager, <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco\">joined numerous prominent applicants in June</a>, vying for SEC approval. CEO Larry Fink noted strong demand from clients for cryptocurrency exposure.</p><p>As of the time of writing, Bitcoin was priced at $27,982 per coin, marking a more than 7% increase in the past 24 hours, <a href=\"https://coinmarketcap.com/\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Coinmarketcap data. Despite this, the largest cryptocurrency by market capitalization remains significantly lower, nearly 60%, compared to its November 2021 peak of $69,044.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-30T13:22:54.000Z",
    "title": "DOJ calls SBF's fraud allegation defense 'irrelevant,’ requests additional info ",
    "url": "https://cointelegraph.com/news/doj-sbf-fraud-allegation-defense-irrelevant",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/75b6d54d-0da5-4395-9d7c-a61c19f98a05.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The U.S. Department of Justice has issued a new court filing in its case against Sam Bankman-Fried in which it called his planned defense “irrelevant” without additional details.  </p>\n                    <p><p>The lawyers representing the United States Department of Justice (DOJ) filed a new court <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590940/gov.uscourts.nysd.590940.239.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">document</a> late on Aug. 29 arguing that Sam Bankman-Fried should provide additional disclosures to his planned defense. </p><p>The document called the current proposed argument, which claims his lawyers approved of fraud allegations while he was still at FTX, “irrelevant.”  The filing requests that the court order the defendant to procure “additional notice” and “pretrial discovery.\"</p><blockquote>“If the defendant does not provide additional disclosures, the court should preclude irrelevant, confusing, and prejudicial questioning, evidence, and arguments about the involvement of attorneys.”</blockquote><p>Previously, the lawyers representing SBF argued that <a href=\"https://cointelegraph.com/news/sam-bankman-fried-lawyers-argue-previous-ftx-legal-team-act-in-good-faith\">the legal team leading FTX</a> led him to act “in good faith” and that “reliance on counsel is relevant to the question of intent.” </p><p>Attorney Damian Williams, who penned the recent letter to the court argued that Bankman-Fried needs to specify the legal advice he was given or else rethink his defense.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-30T13:17:55.000Z",
    "title": "Why is Dogecoin price up today?",
    "url": "https://cointelegraph.com/news/why-is-dogecoin-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-04/3020589e-2d53-4d13-bc4a-e447b62f26a2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Elon Musk and Grayscale Investments are likely behind the latest Dogecoin price rally.</p>\n                    <p><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) price is up roughly 5% in the last 24 hours, mirroring trends elsewhere in the cryptocurrency market.</p><h2>Grayscale news pumps Dogecoin</h2><p>Despite DOGE price being down 2.4% on Aug. 30, it's still up 5% from yesterday's lows, while the total crypto market capitalization has gained 4.5%. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-up-today\">Why is Bitcoin price up today?</a></em></strong></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/91dfb306-f1b0-4f24-a902-c7730cb18a67.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USD versus crypto market capitalization daily performance chart. Source: TradingView</em></figcaption></figure><p>Dogecoin's price started rallying after the U.S. Securities and Exchange Commission's (SEC) <a href=\"https://cointelegraph.com/news/binance-and-cz-sued-by-the-sec\">crackdown</a> on the crypto sector suffered a major setback.</p><p>On Aug. 29, <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">a federal court ruled</a> that the SEC randomly prevented Grayscale Investments, a crypto investment platform, from converting its Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) trust into an exchange-traded fund (ETF). Grayscale's win raised hopes that a spot Bitcoin ETF in the U.S. will become a reality.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">99.99999% of the world doesn&#39;t know that the SEC has to decide on 7 BTC ETFs within the next 3 days:<br><br>-blackrock<br>-bitwise<br>-vaneck<br>-wisdomtree<br>-invesco<br>-fidelity <br>-valkyrie<br><br>the suits at our doorstep</p>&mdash; odin free  (@odin_free) <a href=\"https://twitter.com/odin_free/status/1696617583443624347?ref_src=twsrc%5Etfw\">August 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>BTC price <a href=\"https://cointelegraph.com/news/btc-price-2-week-highs-grayscale-sec-bitcoin-etf-win\">jumped nearly 8%</a> on the day of the ruling, lifting other crypto assets with it, particularly as Bitcoin and Dogecoin remain in lockstep with a correlation of 0.96.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f14fcb9b-aafe-4f7c-87ee-640b7c722a74.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USD and BTC/USD daily correlation coefficient. Source: TradingView </em></figcaption></figure><h2>Elon Musk acquires crypto license for X</h2><p>Dogecoin's gains in the past 24 hours also coincide with Elon Musk's foray into payment services for X (formerly known as Twitter).</p><p>On Aug. 28, Rhode Island’s regulators <a href=\"https://cointelegraph.com/news/x-twitter-crypto-payments-rhode-island-licence\">granted</a> X a currency transmitter license, enabling the social media giant to offer financial services, including crypto. The news started going viral on Aug. 29.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Just In! X (the artist formerly known as Twitter) has just received a license that will let it offer crypto services to store, swap, and transfer Bitcoin and other crypto.<br><br>Elon Musk about to intro 400 million users into the market. <a href=\"https://t.co/hKLDC7PMdf\">pic.twitter.com/hKLDC7PMdf</a></p>&mdash; Lark Davis (@TheCryptoLark) <a href=\"https://twitter.com/TheCryptoLark/status/1696644422199288297?ref_src=twsrc%5Etfw\">August 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Musk, a self-proclaimed Dogecoin supporter, has previously hinted at adding DOGE payments on X. Since then, <a href=\"https://cointelegraph.com/news/dogecoin-jumps-40-on-elon-musk-twitter-s-crypto-wallet-rumors\">rumors about DOGE payments</a> on the platform have boosted prices on several occasions.</p><h2>DOGE price bear flag</h2><p>From a technical standpoint, Dogecoin has traded inside what appears to be a bear flag pattern since Aug. 17. As a result, DOGE price remains inside a narrow range, which may result in a full-fledged breakdown in the coming weeks.</p><p>A <a href=\"https://cointelegraph.com/news/how-to-trade-bull-and-bear-flag-patterns\">bear flag</a> as typically considered a bearish continuation pattern. It resolves after the price breaks below its lower trendline and falls by as much as the height of the previous downtrend (aka flagpole).</p><p>As a result, the bear flag target for DOGE/USD is around $0.051 by September, down over 20% from current price levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/c652f146-dc36-4a0a-8f2d-7db0299a9506.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USD daily price chart. Source: TradingView</em></figcaption></figure><p>Nonetheless, analyst Crypto Rover <a href=\"https://twitter.com/rovercrc/status/1696813507931464115\" target=\"_blank\" rel=\"noopener nofollow\">argues</a> that Dogecoin's strong fundamentals can instead bolste Dogecoin price in the long term. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/grayscale-wins-court-battle-what-does-this-mean-for-spot-bitcoin-etf\">Grayscale wins the court battle, but what does this mean for a spot Bitcoin ETF?</a></em></strong></p><p>Notably, DOGE price is testing a multi-year descending trendline resistance as support seven weeks after breaking above it to potentially confirm the breakout. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/3acccad8-7a00-4030-9713-95009f9c8dfa.jpeg\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USD weekly price chart. Source: TradingView/Crypto Rover</em></figcaption></figure><p>Nonetheless, this DOGE price chart presents two key technical resistances: the 50-week exponential moving average (50-week EMA; the red wave) near $0.079 and the 200-week EMA (the blue wave) near $0.086.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/697ab5e9-250f-4e26-911e-ce7a16b9ff1a.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USD weekly price chart. Source: TradingView</em></figcaption></figure><p>Breaking above these key levels creates a price target of $0.106, which served as support in February 2022, and resistance in October 2022 and April 2023. </p><p>Therefore, a 60% price rally by 2023's end is on the cards, but breaking the two key resistance levels will be critical for the bulls in the coming weeks and months. </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-30T13:12:23.000Z",
    "title": "LATAM’s Amazon, Mercado Libre To Bring USDC to Chile",
    "url": "https://cryptobriefing.com/latams-amazon-mercado-libre-to-bring-usdc-to-chile/?utm_source=feed&utm_medium=rss",
    "description": "Circle partners with fintech giant Mercado Pago to bring USDC to Chile customers."
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-08-30T13:30:00.000Z",
    "title": "How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in",
    "url": "https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/magazine-Protecting-Your-Crypto-in-a-Volatile-Market-scaled.jpg\"></p><p>Crypto OGs Brock Pierce and Tim Draper and other experts provide essential advice on how to protect your hard-earned stack.</p>\n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-30T13:17:00.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Jumps Above $28,000, as Markets Remain Buoyed by Grayscale Court Win",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-jumps-above-28000-as-markets-remain-buoyed-by-grayscale-court-win/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2059487036-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC Above $28,000, as Markets Remain Buoyed by Grayscale Court Win\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2059487036-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2059487036-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2059487036-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2059487036-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2059487036-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2059487036-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2059487036.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin climbed over the $28,000 level late on Tuesday, as markets reacted to the news that Grayscale had won its battle with the SEC. The ruling over the U.S. Securities and Exchanges Commission boosted crypto prices across the board, with bulls returning to action. Ethereum also surged, moving above $1,700. Bitcoin Bitcoin moved back over [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-30T13:23:52.000Z",
    "title": "Polygon CDK: The Answer to Appchain ‘Walled Garden’ and Interoperability Woes",
    "url": "https://www.crypto-news-flash.com/polygon-cdk-the-answer-to-appchain-walled-garden-and-interoperability-woes/",
    "description": "<img width=\"512\" height=\"249\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/unnamed-27.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/unnamed-27.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/unnamed-27-300x146.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/unnamed-27-24x12.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/unnamed-27-36x18.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/unnamed-27-48x23.jpg 48w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Polygon CDK is reported to offer a solution to the &#8220;Walled Garden&#8221; and Interoperability limitations in the appchain ecosystem. The Polygon CDK is stored with several use cases that are in line with the vision of Polygon 2.0. The existing appchain ecosystem faces challenges of a &#8220;Walled Garden&#8221; and friction despite the ecosystem being interoperable. [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-30T13:22:00.000Z",
    "title": "Crypto Bank SEBA Receives In-Principle Approval From Hong Kong",
    "url": "https://coinedition.com/crypto-bank-seba-receives-in-principle-approval-from-hong-kong/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/BANK-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/BANK-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/BANK-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/BANK-3-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/BANK-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/BANK-3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/BANK-3-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/BANK-3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/BANK-3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/BANK-3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/BANK-3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/BANK-3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/BANK-3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/BANK-3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/BANK-3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/BANK-3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/BANK-3-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>SEBA Bank, a Swiss crypto-centered bank, has received in-principle approval from Hong Kong’s Securities and Futures Commission (SFC) to undertake licensed crypto-related services. SEBA Bank is backed by Julius Baer Group, a private banking corporation based in Switzerland. SEBA Bank offers services for managing, investing in, and storing crypto and NFTs. After full approval, SEBA [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-bank-seba-receives-in-principle-approval-from-hong-kong/\">Crypto Bank SEBA Receives In-Principle Approval From Hong Kong</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]