[
  {
    "source": "Cointelegraph",
    "date": "2024-01-05T18:07:08.000Z",
    "title": " Google taught an AI model how to use other AI models and it got 40% better at coding  ",
    "url": "https://cointelegraph.com/news/google-taught-artificial-intelligence-ai-model-40-better-at-coding",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYjM4NDRmNWUtZTExOS00ZWJmLThhOTQtYzcwNDRhNjA3OGU4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The research could make it possible to teach old AI models new tricks without expensive fine-tuning or retraining sessions.</p>\n                    <p><p>Artificial intelligence (AI) researchers at Google Research and Google DeepMind have developed a method by which a large language model (LLM) can be augmented with other language models. </p><p>This addresses one of the biggest outstanding problems with LLMs by allowing developers to imbue existing models with new abilities without having to start from scratch or engage in costly retraining/fine-tuning sessions. </p><p>According to the Google Research team, <a href=\"https://arxiv.org/pdf/2401.02412.pdf\" target=\"_blank\" rel=\"noopener nofollow\">augmenting</a> an LLM with another language both improves performance at existing tasks and enables new tasks that wouldn’t be achievable by the models by themselves. </p><p><a href=\"https://cointelegraph.com/news/google-taught-artificial-intelligence-ai-model-40-better-at-coding\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-05T17:53:23.000Z",
    "title": " VanEck pledges 5% of spot Bitcoin ETF profits to core devs after SEC approval ",
    "url": "https://cointelegraph.com/news/vaneck-pledges-profits-core-devs-spot-bitcoin-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvN2RjM2IyZTctYjExYy00Yzk5LWI4N2YtN2MwNDJkMWMyNmQwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>As many asset managers are awaiting a decision from the SEC, VanEck said it signed a pledge to donate profits from its spot crypto ETF to Bitcoin core developers through Brink.</p>\n                    <p><p>Asset manager VanEck, which has a pending application for a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund with the United States Securities and Exchange Commission, said it planned to donate some of the profits from the investment vehicle to Bitcoin core developers following approval.</p><p>In a Jan. 5 post on X (formerly Twitter), VanEck <a href=\"https://twitter.com/vaneck_us/status/1743300722928619779\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> a 5% pledge to BTC core developers through nonprofit organization Brink ahead of a potential approval of its spot Bitcoin exchange-traded product application. The asset management said it had already made a $10,000 donation to the developers regardless of whether the SEC gives the green light to the investment vehicle.</p><p>The SEC has not approved a spot BTC exchange-traded fund for listing on any U.S. exchange at the time of publication, but many expect the commission to decide ahead of a Jan. 10 deadline for an application from ARK Invest and 21Shares. On Jan. 4, VanEck <a href=\"https://cointelegraph.com/news/grayscale-vaneck-register-spot-bitcoin-etf\">filed a notice with the SEC</a> to register its Bitcoin ETF shares as securities on the Cboe BZX Exchange.</p><p><a href=\"https://cointelegraph.com/news/vaneck-pledges-profits-core-devs-spot-bitcoin-etf\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-05T17:45:03.000Z",
    "title": "North Korean attackers crypto theft fall 30% to $600M in 2023",
    "url": "https://cryptoslate.com/north-korean-attackers-crypto-theft-fall-30-to-600m-in-2023/",
    "description": "<p>North Korea-affiliated attackers stole around $600 million worth of cryptocurrencies last year, according to blockchain analytical firm TRM Labs. The amount could rise to as much as $700 million if the Dec. 31 hack of Orbit Chain is linked to the country. This represents a 30% decline from the $850 million stolen in 2022 by hackers [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/north-korean-attackers-crypto-theft-fall-30-to-600m-in-2023/\">North Korean attackers crypto theft fall 30% to $600M in 2023</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-05T17:47:35.000Z",
    "title": "Taiwan busts $32.2 million Crypto scam involving major exchange ACE, founder arrested",
    "url": "https://cryptobriefing.com/taiwan-busts-32-2-million-crypto-scam-involving-major-exchange-ace-founder-arrested/?utm_source=feed&utm_medium=rss",
    "description": "ACE Exchange leveraged its image to promote worthless cryptos via social media, defrauding investors for an estimated $32.2 million."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-05T17:51:00.000Z",
    "title": "U.S. Economy Surprises with 216,000 New Jobs in December, Fueling Speculation of Imminent Fed Rate Cut",
    "url": "https://www.cryptoglobe.com/latest/2024/01/u-s-economy-surprises-with-216000-new-jobs-in-december-fueling-speculation-of-imminent-fed-rate-cut/",
    "description": "In a surprising turn the U.S. economy has outperformed expectations by adding 216,000 jobs in December 2023, surpassing economists’ predictions of 170,000 and exceeding the revised figure of 173,000 from November, with the data supporting the market’s anticipation of interest rate cuts. According to data from the Bureau of Labor Statistics, the unemployment rate in […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-05T17:52:16.000Z",
    "title": "As Litecoin (LTC) Faces a 15% Weekly Slump, Can Chainlink (LINK) and Arbitrum (ARB) Navigate the Bitcoin ETF Wave?",
    "url": "https://cryptodaily.co.uk/2024/01/as-litecoin-ltc-faces-a-15-weekly-slump-can-chainlink-link-and-arbitrum-arb-navigate-the-bitcoin-etf-wave",
    "description": "Explore how the introduction of Bitcoin ETFs is transforming the cryptocurrency market, impacting Litecoin (LTC), Chainlink (LINK), and Arbitrum (ARB). Discover the latest trends, price performances, and the potential growth trajectory of these digital assets in the new era of crypto investing."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-05T17:49:00.000Z",
    "title": "North Korean crypto hackers raided $600m in 2023",
    "url": "https://crypto.news/north-korean-crypto-hackers-raided-600m-in-2023/",
    "description": "Bad actors from the Democratic People’s Republic of Korea (DPRK) masterminded a third of all crypto hacks deployed throughout last year, said a Jan. 5 report from TRB Labs. "
  },
  {
    "source": "BTCManager",
    "date": "2024-01-05T17:45:00.000Z",
    "title": "PEPE, BONK fall, investors watching Sponge token",
    "url": "https://crypto.news/pepe-bonk-fall-investors-watching-sponge-token/",
    "description": "Meme coins are down with PEPE and BONK under pressure. Analysts back Sponge V2 to rally in the days ahead"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-05T18:00:00.000Z",
    "title": "Ethereum Price Crash Looming? Celsius To Unstake $465 Million ETH",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-price-crash-looming-celsius/",
    "description": "Celsius Network, the bankrupt cryptocurrency lending company, is gearing up to unstake approximately $465 million worth of Ethereum (ETH) as part of its efforts to compensate creditors. This development follows the company&#8217;s bankruptcy filing in July 2022, leaving creditors in a prolonged 18-month wait for financial recompense. Celsius&#8217;s decision to unstake a substantial amount of ETH is seen as a necessary step to ensure liquidity for creditor compensation. The company&#8217;s official announcement, made via X (formerly Twitter), highlights the strategic nature of this move: “In preparation of any asset distributions, Celsius has started the process of recalling and rebalancing assets to ensure ample liquidity. Celsius will unstake existing ETH holdings, which have provided valuable staking rewards income to the estate, to offset certain costs incurred throughout the restructuring process. The significant unstaking activity in the next few days will unlock ETH to ensure timely distributions to creditors,” the announcement reads. Celsius Responsible For Over 86% Of ETH In Exit Queue? Blockchain analytics firm Nansen states that Celsius possesses approximately one third of the total Ether in the unstaking exit queue, totaling around 206,300 ETH. This figure translates to a market value of around $465 million. To date, Celsius has already withdrawn over 40,249 ETH. Related Reading: Ethereum Price Tops At 100 SMA, Why ETH Could Struggle In Near Term Tom Wan, an on-chain data analyst at 21.co (parent company of 21Shares), elaborated on the situation, “Over 540k staked ETH (16,670 Validators) are currently withdrawing from the Ethereum Beacon chain. To fully exit and withdraw now, it will require 14.5 days.” The researcher added that 352,000 ETH (54.7%) waiting to be withdrawn belongs to Figment and 206,000 ETH (32%) belongs to Celsius. “It is also likely that the withdrawal by Figment belongs to Celsius. Earlier in June, when Celsius redeemed 428.000 stETH from Lido, they have re-staked 197.000 ETH via Figment,” he added. Therefore, Celsius might be responsible for unstaking 86.7% of all ETH in the queue. Ethereum Price Crash Looming? While some investors express concern that the release of such a large volume of tokens from staking could adversely impact Ethereum&#8217;s price, others maintain a more composed outlook, believing that the market is robust enough to absorb this additional volume. Related Reading: Solana Has Flipped Ethereum In Yet Another Metric In Its Bid To Reach $200 Even in the unlikely event that all ETH from the queue is sold, liquidity appears to be strong enough to absorb such a process, which would be gradual rather than sudden. According to Coinmarketcap, the current ETH trading volume stands around $11.35 billion, suggesting that the market could withstand the potential sale of Celsius&#8217; entire ETH holdings without any major ETH price crash. Fear-mongering is therefore superfluous. After receiving approval for its settlement plan, Celsius has allowed eligible users to withdraw 72.5% of their cryptocurrency holdings, with this option available until February 28. A court document filed in the previous September revealed that approximately 58,300 users possess a total of $210 million in assets, which the court has classified as &#8220;custody assets.&#8221; At press time, ETH traded at $2,250. The 1-week chart for ETH/USD indicates that, over the past five weeks, the price of Ethereum has formed a consolidation range. The chart defines this zone with a lower boundary at $2,125, indicated by the red area, and an upper boundary at the 0.382 Fibonacci retracement level, located at $2,441. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-05T17:55:35.000Z",
    "title": "Crypto Investment Products Witness $2,250,000,000 Worth of Inflows in 2023, up 2.7x Year-on-Year: CoinShares",
    "url": "https://dailyhodl.com/2024/01/05/crypto-investment-products-witness-2250000000-worth-of-inflows-in-2023-up-2-7x-year-on-year-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/products-worth-of-inflows.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/products-worth-of-inflows.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/products-worth-of-inflows.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/products-worth-of-inflows.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/products-worth-of-inflows.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/products-worth-of-inflows.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/products-worth-of-inflows.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says crypto investment products saw a significant recovery in 2023 as inflows increased by nearly threefold from the preceding year. In its latest Digital Asset Fund Flows report, Coinshares says inflows reached $2.25 billion in 2023, representing a 2.7 times year-on-year increase. Total assets under management (AuM) also rose by 129%, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/05/crypto-investment-products-witness-2250000000-worth-of-inflows-in-2023-up-2-7x-year-on-year-coinshares/\">Crypto Investment Products Witness $2,250,000,000 Worth of Inflows in 2023, up 2.7x Year-on-Year: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]