[
  {
    "source": "Crypto Briefing",
    "date": "2023-06-29T19:43:36.000Z",
    "title": "SEC’s Gensler Needs to Step Aside: Blockchain Association",
    "url": "https://cryptobriefing.com/secs-gensler-must-step-aside/?utm_source=feed&utm_medium=rss",
    "description": "The Blockchain Association, a leading group in the digital asset industry, has made a bold call for Gary Gensler, the Chair of the United States Securities and Exchange Commission (SEC),..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T20:01:00.000Z",
    "title": "VeChain Price Prediction 2023-2031: What’s the Growth Potential of VET?",
    "url": "https://www.cryptopolitan.com/vechain-price-prediction/",
    "description": "VeChain Price Prediction 2023-2032 Since its launch, Vechain’s focus has been building technologies that solve obstacles impeding the mass adoption of blockchain technology. Two months ago, one of the most important pieces of technology in this mission was officially launched — VORJ. VORJ is a no-code Web3-as-a-Service platform that enables anyone to create, deploy and ... <a title=\"VeChain Price Prediction 2023-2031: What&#8217;s the Growth Potential of VET?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/vechain-price-prediction/\" aria-label=\"More on VeChain Price Prediction 2023-2031: What&#8217;s the Growth Potential of VET?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T20:01:00.000Z",
    "title": "Monero Price Prediction 2023-2032: Should You Buy XMR Now?",
    "url": "https://www.cryptopolitan.com/monero-price-prediction/",
    "description": "Monero Price Prediction 2023-2032 This Monero Price Prediction will cover details about Monero, applications, price history, and factors affecting the native currency. There are plenty of things to consider before moving on to the Monero (XMR) price prediction. How much is Monero worth? Today&#8217;s Monero price is $162.83 USD with a 24-hour trading volume of $63,271,550 ... <a title=\"Monero Price Prediction 2023-2032: Should You Buy XMR Now?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/monero-price-prediction/\" aria-label=\"More on Monero Price Prediction 2023-2032: Should You Buy XMR Now?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T19:56:14.000Z",
    "title": "What Are Four Ways AI Poses Catastrophic Risks to the World? CAIS Reports",
    "url": "https://www.cryptopolitan.com/cais-four-ways-ai-poses-catastrophic-risks/",
    "description": "Concerns about the potential dangers of artificial intelligence (AI) have been voiced by tech experts, Silicon Valley billionaires, and everyday individuals who fear the uncontrolled advancement of AI could lead to catastrophic consequences for humanity. Researchers at the Center for AI Safety (CAIS) have outlined the specific risks AI poses to the world in a ... <a title=\"What Are Four Ways AI Poses Catastrophic Risks to the World? CAIS Reports\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cais-four-ways-ai-poses-catastrophic-risks/\" aria-label=\"More on What Are Four Ways AI Poses Catastrophic Risks to the World? CAIS Reports\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-29T20:00:47.000Z",
    "title": "How Will Tron (TRX) Perform In The Next Bull Run, Alex The Doge (ALEX) On The Verge Of Greatness",
    "url": "https://nulltx.com/how-will-tron-trx-perform-in-the-next-bull-run-alex-the-doge-alex-on-the-verge-of-greatness/",
    "description": "As we approach the fourth quarter of 2023, the cryptocurrency market is poised for yet another potential bull run. Amid this anticipation, attention is directed towards established coins like Tron (TRX) and emerging tokens such as Alex The Doge (ALEX). Both these cryptocurrencies carry a unique set of prospects and challenges, making them ones to [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-29T20:05:33.000Z",
    "title": "Cardano Shows Signs of Recovery: When Will it Reach $0.30?",
    "url": "https://www.newsbtc.com/news/cardano/cardano-shows-signs-of-recovery-when-will-it-reach-0-30/",
    "description": "Cardano (ADA) has shown signs of recovery in recent trading sessions, although its price continues to linger near a significant resistance level. In the past 24 hours, ADA witnessed a modest 2% increase, but weekly gains have been erased, resulting in a 7% depreciation on the weekly chart. Related Reading: Slovakian Lawmakers Pass Amendment Lowering Cryptocurrency Taxation The technical outlook has yet to present bullish signals, with both demand and accumulation remaining relatively low. Bitcoin dominance increased while trading within the $30,000 price range. Major altcoins also experienced minor gains in the past few days. Although Bitcoin displayed a bullish trend, its price fluctuated, and other altcoins followed similar patterns. For the Cardano price to experience upward movement, Bitcoin must exhibit another surge from its current price level. If ADA manages to sustain above the current support line with the support of BTC, the altcoin may soon attempt to break through immediate price resistance. The decrease in ADA&#8217;s market capitalization indicates the continued influence of bearish sentiment in the market. Cardano Price Analysis: One-Day Chart At the time of writing, ADA was observed to be trading at $0.27, a significant resistance point for the altcoin. Previous price action has indicated that the bulls have faced rejection at this level in the past. Additionally, consolidation has been observed around this price mark. If ADA continues its upward movement, it may attempt to trade near or even surpass the $0.30 level. However, in the case of extended consolidation, ADA could experience a dip towards its support line at $0.26. Notably, the $0.26 level has acted as a bullish order block for the coin, indicating a price reversal and subsequent upward movement after reaching this level. This observation suggests the possibility of incoming bullishness for ADA. Technical Analysis Despite an increase in buying strength, the overall demand for ADA has remained low. This is evident from the Relative Strength Index (RSI) failing to move above the half-line, indicating that sellers have maintained a strong presence in the market. However, there is an expectation for a potential resurgence in demand if the price manages to surpass the $0.27 zone. Similarly, the price falling below the 20-Simple Moving Average (SMA) line indicates that sellers have been driving the price momentum in the market. ADA has exhibited buy signals that suggest a potential price reversal in the near future. The Moving Average Convergence Divergence (MACD) has formed green histograms, which are tied to buy signals for the coin. This indicates positive momentum for ADA and suggests a potential upward movement in price. Related Reading: Dogecoin Faces Downward Pressure – Will DOGE Bulls Avert A Further Slide? Additionally, the Bollinger Bands, which provide insights into price volatility and fluctuation, have constricted. This tightening of the bands indicates that the trading range has become tight. Therefore, there is a possibility of a price breakout. Featured image from UnSplash, charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-29T19:41:10.000Z",
    "title": "Ripple: A Game Changer for the Trillion-Dollar CBDC and Payments Market Worldwide, says Euro Banking Association",
    "url": "https://www.crypto-news-flash.com/ripple-a-game-changer-for-the-trillion-dollar-cbdc-and-payments-market-worldwide-says-euro-banking-association/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-a-game-changer-for-the-trillion-dollar-cbdc-and-payments-market-worldwide-says-euro-banking-association",
    "description": "Ripple Labs Inc&#8217;s role as an innovative payment service provider is now being highlighted. The firm&#8217;s technology remains one of the best for cross-border payments. Trusted cloud payment service provider Volante Technologies has recently acknowledged Ripple as a game changer in the payment ecosystem. While speaking at a Euro Banking Association (EBADay) event, Volante Technologies&#8217; [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-29T20:00:09.000Z",
    "title": "Brian Armstrong Says US Is Squandering Its Lead On Crypto As ‘Embarrassed’ Regulators Attempt Crackdown",
    "url": "https://dailyhodl.com/2023/06/29/brian-armstrong-says-us-is-squandering-its-lead-on-crypto-as-embarrassed-regulators-attempt-crackdown/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/brian-armstrong-says-us.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/brian-armstrong-says-us.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/brian-armstrong-says-us.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/brian-armstrong-says-us.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/brian-armstrong-says-us.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/brian-armstrong-says-us.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/brian-armstrong-says-us.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Coinbase chief executive Brian Armstrong thinks lawmakers in the United States are &#8220;squandering&#8221; crypto opportunities for the country because they&#8217;re still shell-shocked from FTX&#8217;s implosion last year. Armstrong notes that the U.S. has fallen in &#8220;economic freedom rankings&#8221; over the years, citing a yearly list published by the Heritage Foundation, a conservative think tank based [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/29/brian-armstrong-says-us-is-squandering-its-lead-on-crypto-as-embarrassed-regulators-attempt-crackdown/\">Brian Armstrong Says US Is Squandering Its Lead On Crypto As ‘Embarrassed’ Regulators Attempt Crackdown</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-29T19:55:51.000Z",
    "title": "Crypto Trader Warns That Top May Be In for Bitcoin (BTC) and Stocks",
    "url": "https://dailyhodl.com/2023/06/29/crypto-trader-warns-that-top-may-be-in-for-bitcoin-btc-and-stocks/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/top-says-btc-add.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/top-says-btc-add.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/top-says-btc-add.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/top-says-btc-add.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/top-says-btc-add.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/top-says-btc-add.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/top-says-btc-add.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is warning traders that Bitcoin (BTC) and other assets like stocks may have reached a peak for now. Financial analyst Justin Bennett tells his 112,400 Twitter that he is convinced that stocks are near their top. &#8220;The more charts I look at, the more convinced I am that the top is in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/29/crypto-trader-warns-that-top-may-be-in-for-bitcoin-btc-and-stocks/\">Crypto Trader Warns That Top May Be In for Bitcoin (BTC) and Stocks</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]