[
  {
    "source": "Cointelegraph",
    "date": "2023-08-09T08:40:52.000Z",
    "title": "South Korea arrests Bitsonic CEO for allegedly stealing $7.5M of users’ money",
    "url": "https://cointelegraph.com/news/south-korea-arrests-bitsonic-ceo-vp-stealing-7-5-million-of-users-money",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/653616aa-d496-4d14-96a8-9658d3e060d9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The vice president of the crypto exchange will also be put on trial without preliminary detention. </p>\n                    <p><p><a href=\"https://biz.chosun.com/topics/topics_social/2023/08/08/W2KPDGP5SZCRRPMOS36DMLS6JM/\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to South Korean news outlet Chosun Biz, on Aug. 7, Jinwook Shin, the CEO of crypto exchange Bitsonic — who is under investigation for stealing investments and deposits from exchange users — was arrested by South Korean police. The vice president of Bitsonic will also be put on trial without preliminary detention.</p><p>According to the prosecution, in a period from January 2019 to May 2021, Shin falsely manipulated the prices and trading volume of cryptocurrency on Bitsonic, stealing the equivalent of $7.5 million (10 billion won) from the exchange’s users. </p><p>Even after liquidity issues began and Bitsonic stopped withdrawals, its CEO continued offering crypto to new clients. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/south-korea-reveals-city-for-pilot-cbdc-project\"><strong><em>South Korea to pilot CBDC in one of these three cities, not Seoul</em></strong></a></p><p>The investigation, which started in 2021, also accuses the company VP, whom media refer to as Mr. A, of running a program to purchase the cryptocurrency held by Shin on the exchange system. In his manipulation, Shin used a paper company he opened in Singapore. </p><p>In August 2021, Bitsonic <a href=\"https://cointelegraph.com/news/south-korean-regulator-to-reportedly-shut-down-11-crypto-exchanges\">halted operations</a>, citing “internal and external issues.” In the same period South Korean police shut down 11 local crypto platforms for fraud. </p><p>South Korea has recently <a href=\"https://cointelegraph.com/news/crypto-south-korea-strengthens-crypto-regulation-with-lei-adoption-and-crime-unit\">established an interagency investigation unit</a> to combat cryptocurrency crimes, aiming to address the rise in illicit activities in the market and the need for investor protection. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk. What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-08-09T09:07:53.000Z",
    "title": "Shiba Inu and DigiToads surge amid Shibarium beta bridge release",
    "url": "https://crypto.news/shiba-inu-and-digitoads-surge-amid-shibarium-beta-bridge-release/",
    "description": "Shiba Inu (SHIB) and DigiToads (TOADS) are firm amid the Shibarium Beta bridge release, and anticipation for The Swamp grows"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-09T08:46:50.000Z",
    "title": "Japanese fintech to launch cross-border CBDC in Asia",
    "url": "https://crypto.news/japanese-fintech-to-launch-cross-border-cbdc-in-asia/",
    "description": "Japanese fintech firm, Soramitsu, is developing a cross-border payment system in Asia, utilizing CBDCs and blockchain. Soramitsu, a Japanese fintech firm, is working on developing a cross-border payment framework for Asian countries, incorporating the central bank digital currency (CBDC) of&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-09T08:55:33.000Z",
    "title": "Ethereum: Historical Playbook Points To $3,800 In Coming Months",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-historical-playbook-points-3800-coming-months/",
    "description": "Renowned analyst Josh Olszewicz has shared some compelling insights on Ethereum&#8217;s price trajectory. Drawing parallels from historical patterns, Olszewicz&#8217;s analysis suggests that Ethereum might be gearing up for a significant rally in the coming months. Historical Pattern: Ethereum Forms Ascending Triangle Olszewicz starts by highlighting Ethereum&#8217;s current price pattern, jokingly stating, &#8220;Ethereum: ascending triangle 450 million years in the making w/fib extensions to $3k.&#8221; This ascending triangle, characterized by a flat top and rising bottom, has been forming since May 2022, and if history is any guide, it could be a bullish sign for Ethereum. Descending volume, another feature of this pattern, further strengthens the bullish bias. However, Olszewicz cautions that the &#8220;bias remains bullish until price breaks below diagonal support.&#8221; He also points out the psychological resistance at $2,000, noting it as an &#8220;extremely obvious signal that it&#8217;s go time, which should help the breakout.&#8221; Related Reading: Valkyrie Unveils Double-Barreled Approach To Launch An Ethereum ETF Alongside A Bitcoin ETF To bolster his analysis, Olszewicz draws parallels from Bitcoin&#8217;s past. He recalls, &#8220;take BTC in 2015/2016 [the price formed an ascending triangle for 210 days with descending volume] and BTC in 2018/2019 [ascending triangle for 130 days with descending volume] as examples.&#8221; In both instances, Bitcoin surged towards the Fibonacci extension levels post the breakout. Ethereum itself isn&#8217;t a stranger to such patterns. Olszewicz cites, &#8220;ETH has also had previous examples in 2017 (bullish continuation) and 2019 (bullish reversal).” Each ascending triangle pattern lasted 180 days. Both times ETH surged towards the 2.618 Fibonacci extension level. Drawing from these historical patterns, Olszewicz suggests that Ethereum is currently holding the potential to overshoot the 1.618 Fibonacci level and possibly reach the 2.618 level, which translates to a price of $3,800. However, he wisely advises, &#8220;but don&#8217;t get out the imaginary profit calculator just yet, let&#8217;s break $2k first.&#8221; ETH vs. BTC: Which One Is The Better Trade? While Ethereum&#8217;s potential rally is intriguing, Olszewicz also delves into its performance relative to Bitcoin. He observes that Ethereum has underperformed Bitcoin year-to-date, attributing this to the ETF narrative and Bitcoin&#8217;s dominance as hard money. He speculates, &#8220;the better trade may continue to be BTC/USD, especially with initial spot ETF inflows favoring BTC.&#8221; Related Reading: Why Is Bitcoin And Crypto Surging Today? However, if the ETH/BTC pair can break and sustain new highs, it might hint at a runaway trade for Ethereum. But Olszewicz remains skeptical, stating it&#8217;s &#8220;unlikely based on ETF flows.&#8221; Olszewicz also doesn&#8217;t shy away from discussing potential bearish scenarios. He&#8217;s closely watching certain bearish ETH/BTC levels, including the current local low at 0.050 and the previous inverse head and shoulders neckline at 0.039. For Bitcoin, he suggests a potential move to $42,000, provided it maintains certain bullish conditions. He notes, &#8220;as long as we can maintain prices above the midline of the PF &#38; stay in the cloud, we have a decent shot at reaching $42k before halving.&#8221; Wrapping up his analysis, Olszewicz envisions a dream trade where Bitcoin breaks bullish first, possibly due to technicals or a spot ETF approval. In this scenario, Ethereum breaks $2,000 but lags behind Bitcoin, leading to ETH/BTC getting “crushed, allowing for an eventual profit taking rotation from Bitcoin to Ethereum”. However, he concludes with a word of caution: &#8220;without inflows, we ain&#8217;t movin.&#8221; At press time, ETH traded at $1,860. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-09T09:00:13.000Z",
    "title": "Chainlink (LINK) vs. InQubeta (QUBE): A Battle For The Future Of AI In Crypto",
    "url": "https://www.crypto-news-flash.com/chainlink-link-vs-inqubeta-qube-a-battle-for-the-future-of-ai-in-crypto/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-link-vs-inqubeta-qube-a-battle-for-the-future-of-ai-in-crypto",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T101223.345.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T101223.345.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T101223.345-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The battle royale brewing between InQubeta (QUBE) and Chainlink (LINK) has caught the crypto community’s attention. The advancement of Artificial Intelligence (AI) has spread across various sectors and industries worldwide. The quest for AI-driven blockchain technology is on as these two initiatives battle for the future of AI in crypto. InQubeta is a cryptocurrency that [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-09T08:46:21.000Z",
    "title": "BlackRock Insiders Expect Bitcoin Spot ETF to be Approved in The Next 6 Months – Report",
    "url": "https://www.crypto-news-flash.com/blackrock-insiders-expect-bitcoin-spot-etf-to-be-approved-in-the-next-6-months-report/?utm_source=rss&utm_medium=rss&utm_campaign=blackrock-insiders-expect-bitcoin-spot-etf-to-be-approved-in-the-next-6-months-report",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Inside contacts at BlackRock and Invesco have indicated to Galaxy Digital&#8217;s CEO Mike Novogratz that the approval of the first spot Bitcoin ETF in the US could occur within the next six months. Once approved, major issuers like BlackRock and Invesco are expected to compete fiercely for market share, with the possibility of simultaneous approvals [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-09T09:04:49.000Z",
    "title": "How Can Amazon Prime Subscribers Have Free Polygon NFTs",
    "url": "https://www.altcoinbuzz.io/nft/how-can-amazon-prime-subscribers-have-free-polygon-nfts/",
    "description": "<p>Amazon Prime is available on 4 continents and 27 countries. This includes most of the biggest media markets in the world. In other words, it reaches millions of people. However, subscriptions are specific to certain countries, so, Amazon will make their clients from Amazon Prime can get some free NFTs. This may be a great [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/nft/how-can-amazon-prime-subscribers-have-free-polygon-nfts/\">How Can Amazon Prime Subscribers Have Free Polygon NFTs</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-09T08:51:38.000Z",
    "title": "The Psychology of FOMO and FUD",
    "url": "https://www.altcoinbuzz.io/product-release/the-psychology-of-fomo-and-fud/",
    "description": "<p>Investing in cryptocurrencies could prove to be a thrilling but unpredictable adventure. The crypto market is highly volatile. So, investors could experience feelings of fear, uncertainty, and doubt (FUD) or fear of missing out (FOMO). Most believe that it is easier to predict the weather than the crypto market. While FOMO might encourage rash purchases [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/product-release/the-psychology-of-fomo-and-fud/\">The Psychology of FOMO and FUD</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]