[
  {
    "source": "Cointelegraph",
    "date": "2024-01-31T23:26:58.000Z",
    "title": " Hamas victims sue Binance over alleged ‘assistance’ to terrorists ",
    "url": "https://cointelegraph.com/news/hamas-terror-victims-allege-binance-provided-assistance-terrorist-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZmZjZjA2MGItOTEzYS00YWMzLWIzOTItZmFlZmFlMDAxYjVjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Two former hostages and families of victims killed in the Oct. 7 attacks are seeking damages from Binance, Iran anunder the United States Anti-Terrorism Act.</p>\n                    <p><p>Crypto exchange Binance, its former CEO Changpeng Zhao, along with the governments of Iran and Syria, have been named as defendants in a lawsuit filed by three families of victims affected by the Oct. 7 Hamas attack on Israel. </p><p>The plaintiffs, who include former hostages, family members of those affected and the estate of a doctor killed while treating casualties, are seeking damages under the United States Anti-Terrorism Act, claiming the defendants provided “substantial assistance” to terrorists. </p><p>The complaint was filed in New York Southern District Court on Jan. 31, stating: </p><p><a href=\"https://cointelegraph.com/news/hamas-terror-victims-allege-binance-provided-assistance-terrorist-lawsuit\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-31T23:18:00.000Z",
    "title": "Alt Season? Crypto Analyst Points to Bullish Golden Cross Pattern on Altcoin Market Cap Chart",
    "url": "https://www.cryptoglobe.com/latest/2024/01/alt-season-crypto-analyst-points-to-bullish-golden-cross-pattern-on-altcoin-market-cap-chart/",
    "description": "A popular cryptocurrency analyst has recently pointed to a golden cross formation on a chart of the total market capitalization of digital assets excluding the flagship cryptocurrency Bitcoin – colloquially known as altcoins – suggesting these cryptocurrencies could soon enter a bull run. In a post shared on the microblogging platform X (formerly known as […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T23:38:35.000Z",
    "title": "Why Spot ETFs are not affecting Bitcoin like they did gold",
    "url": "https://www.cryptopolitan.com/spot-etfs-not-affecting-bitcoin-like-gold/",
    "description": "The buzz around the introduction of U.S. exchange-traded funds (ETFs) tracking Bitcoin has been building like a storm over Wall Street, with expectations high and fingers crossed. The crypto world was abuzz with predictions that these ETFs would revolutionize Bitcoin investment, akin to the seismic shift the SPDR Gold Shares ETF brought to gold back [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T23:32:51.000Z",
    "title": "Inside Federal Reserve’s first interest rate decision of 2024",
    "url": "https://www.cryptopolitan.com/federal-reserves-first-rate-decision-of-2024/",
    "description": "The Federal Reserve, in a move that kept Wall Street on its toes, opted to maintain interest rates at their 23-year peak during their first policy meeting of 2024. The decision, arrived at unanimously, holds the benchmark federal funds target steady between 5.25% and 5.5%. This steadfast approach from the US central bank indicates a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T23:26:06.000Z",
    "title": "Ethereum steals the spotlight as Bitcoin tries to stay strong",
    "url": "https://www.cryptopolitan.com/ethereum-steals-spotlight-as-btc-stay-strong/",
    "description": "Move over, Bitcoin; there&#8217;s a new crypto sheriff in town. Ethereum is strutting its stuff, ready to bask in the limelight after Bitcoin and its newly-launched ETFs hogged the spotlight in January. Both cryptocurrencies are neck-and-neck in the race, with nearly a 2% increase this month, but Ethereum is gearing up to sprint ahead. Ethereum&#8217;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T23:19:21.000Z",
    "title": "Deciphering Vitalik Buterin’s latest magnum opus",
    "url": "https://www.cryptopolitan.com/vitalik-buterin-latest-magnum-opus/",
    "description": "Vitalik Buterin, the renowned figure in the cryptocurrency world, recently penned a reflective and profound essay titled &#8216;The end of my childhood,&#8217; which demands an in-depth examination. His narrative isn&#8217;t just a stroll down memory lane; it&#8217;s a treasure trove of insights and revelations, offering a window into the mind of a visionary grappling with [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T23:11:26.000Z",
    "title": "UK confiscates over £1b in Bitcoin from Chinese fraudsters",
    "url": "https://www.cryptopolitan.com/uk-confiscates-1b-bitcoin-chinese-fraudsters/",
    "description": "In a staggering display of law enforcement agility, the UK has pulled off one of the most significant bitcoin seizures globally. We&#8217;re talking over £1.4 billion worth of Bitcoin, snatched right out of the clutches of Chinese investment fraudsters. This isn&#8217;t just a win for the UK; it&#8217;s a smackdown on international financial crime. The [&#8230;]"
  }
]