[
  {
    "source": "CoinDesk",
    "date": "2023-06-07T07:44:36.000Z",
    "title": "SEC’s Binance.US Probe Started in 2020, Court Filings Show",
    "url": "https://www.coindesk.com/policy/2023/06/07/secs-binanceus-probe-started-in-2020-court-filings-show/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The securities regulator detailed evidence of hundreds of millions of dollars in profiteering by the crypto exchange as they seek to freeze assets of the company."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-07T07:55:00.000Z",
    "title": "Coinbase Withdrawals Skyrocket, Crypto Daily TV 7/6/2023",
    "url": "https://cryptodaily.co.uk/2023/06/coinbase-withdrawals-skyrocket-crypto-daily-tv-7-6-2023",
    "description": "In Todays Headline TV CryptoDaily News:\n<p></p>\n<p>User withdrawals from Coinbase skyrocket</p>\n<p>User withdrawals from Coinbase soared as the SEC sued the crypto exchange one day after filing a lawsuit against rival Binance. Blockchain data shows that Coinbase's net outflows over a 24-hour period totaled $600 million.</p>\n<p>Ripple IPO - highly anticipated&nbsp; with high expectations</p>\n<p>Ripple, the company behind the XRP token and known for its blockchain technology, is generating significant buzz amid rumors surrounding its highly awaited initial public offering. Analysts anticipate a potential 20-fold increase in Ripple&rsquo;s valuation post-IPO, driven by its substantial XRP reserves valued at $21 billion.</p>\n<p>BTC and ETH sag after SEC suit against Coinbase </p>\n<p>The prices of Bitcoin, Ether, and other top cryptocurrencies dropped marginally after the Securities and Exchange Commission sued U.S. crypto exchange Coinbase, just one day after the agency filed another blockbuster lawsuit against Binance.</p>\nBTC/USD skyrocketed 4.9% in the last session.\n<p>The Bitcoin-Dollar pair skyrocketed 4.9% in the last session. The MACD is giving a negative signal. Support is at 24380.6667 and Resistance is at 27808.6667.</p>\n<p>The MACD is currently in negative territory.</p>\n<p></p>\nETH/USD exploded 3.8% in the last session.\n<p>The Ethereum-Dollar pair exploded 3.8% in the last session. The Ultimate Oscillator is giving a positive signal. Support is at 1720.4133 and Resistance is at 1935.9333.</p>\n<p>The Ultimate Oscillator is giving a positive signal.</p>\n<p></p>\nXRP/USD skyrocketed 3.3% in the last session.\n<p>The Ripple-Dollar pair rose 3.3% in the last session after gaining as much as 4.5% during the session. The Ultimate Oscillator is giving a negative signal, going against our overall technical analysis. Support is at 0.4603 and Resistance is at 0.5672.</p>\n<p>The Ultimate Oscillator is giving a negative signal.</p>\n<p></p>\nLTC/USD exploded 3.2% in the last session.\n<p>The Litecoin-Dollar pair skyrocketed 3.2% in the last session. The ROC is giving a positive signal. Support is at 78.2467 and Resistance is at 99.2667.</p>\n<p>The ROC is giving a positive signal.</p>\n<p></p>\nDaily Economic Calendar:\n<p>FR Imports</p>\n<p>Imports of goods and services consist of transactions in goods and services (purchases, barter, gifts, or grants) from non-residents to residents.&nbsp; The French Imports will be released at 06:45 GMT, the French Exports at 06:45 GMT, the US EIA Crude Oil Stocks Change at 14:30 GMT.</p>\n<p>FR Exports</p>\n<p>The Exports measure of the total exports of goods and services by the local economy. A steady demand for exports helps to support growth in the trade surplus.</p>\n<p>US EIA Crude Oil Stocks Change</p>\n<p>The EIA Crude Oil stockpiles report is a weekly measure of the change in the number of barrels in stock of crude oil and its derivates, released by the Energy Information Administration. </p>\n<p>JP Gross Domestic Product</p>\n<p>The Gross Domestic Product measures the total value of all goods and services produced by a country. The GDP is considered a broad measure of economic activity and health. Japan's Gross Domestic Product will be released at 23:50 GMT, the UK's RICS Housing Price Balance at 23:01 GMT, and the US MBA Mortgage Applications at 11:00 GMT.</p>\n<p>UK RICS Housing Price Balance</p>\n<p>The RICS Housing Price Balance survey presents housing costs. It shows the strength of the housing market.</p>\n<p>US MBA Mortgage Applications</p>\n<p>The MBA Mortgage Applications released by the Mortgage Bankers Association presents various mortgage applications. It is considered as a leading indicator of the U.S Housing Market.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T07:59:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T07:55:54.000Z",
    "title": "How Can Chainlink’s Decentralized Oracle Network Effectively Drive Web3 Evolution?",
    "url": "https://www.cryptopolitan.com/chainlinks-decentralized-oracle-drive-web3/",
    "description": "In the evolving world of decentralized applications (dApps) and blockchain technology, Chainlink&#8217;s network protocol has emerged as a critical player, bridging the gap between off-chain data sources and on-chain intelligent contracts. One of the significant updates revolves around its integration with Web3, the next generation of the internet. As a decentralized internet, Web3 empowers users ... <a title=\"How Can Chainlink&#8217;s Decentralized Oracle Network Effectively Drive Web3 Evolution?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlinks-decentralized-oracle-drive-web3/\" aria-label=\"More on How Can Chainlink&#8217;s Decentralized Oracle Network Effectively Drive Web3 Evolution?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-07T08:05:41.000Z",
    "title": "What’s The Future Of Play-To-Earn and Move-to-Earn Tokens In 2023",
    "url": "https://nulltx.com/whats-the-future-of-play-to-earn-and-move-to-earn-tokens-in-2023/",
    "description": "The world of cryptocurrencies has experienced enormous growth and innovation in 2023, particularly in the Play-to-Earn (P2E) and Move-to-Earn (M2E) sectors. Due to the distinctive chances they provide to earn rewards through gaming and physical activity, both P2E and M2E tokens have grown in popularity among investors and enthusiasts alike. Today, we will examine the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-07T07:50:35.000Z",
    "title": "Bitcoin Price Analysis & Prediction (June 7th) – BTC Tumbles Below $26k as Bearish Pressure Continues?",
    "url": "https://nulltx.com/bitcoin-price-analysis-prediction-june-7th-btc-tumbles-below-26k-as-bearish-pressure-continues/",
    "description": "After witnessing some recovery in the past week, Bitcoin topped out at resistance and initiated a heavy drop below the previous low. It lost 6% in the dip and has shown no sign of stopping at the moment. More bloodbath lies ahead. Following a bounce from the 4-hour channel’s lower boundary in mid-May, Bitcoin&#8217;s price [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-07T08:00:00.000Z",
    "title": "As momentum for AI coins grows, investors are considering these four cryptos ",
    "url": "https://crypto.news/as-momentum-for-ai-coins-grows-investors-are-considering-these-four-cryptos/",
    "description": "In this article, we will delve into the potential of InQubeta, VeChain, Chainlink, and Filecoin, shedding light on their respective strengths and why investors are examining them"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T08:02:21.000Z",
    "title": "SEC Moves to Temporarily Freeze Binance.US Customer Assets to Protect Investors Within 5 Days; Withdrawals and Assets From Binance.com Remain Unaffected",
    "url": "https://www.crypto-news-flash.com/sec-moves-to-temporarily-freeze-binance-us-customer-assets-to-protect-investors-within-5-days-withdrawals-and-assets-from-binance-com-remain-unaffected/?utm_source=rss&utm_medium=rss&utm_campaign=sec-moves-to-temporarily-freeze-binance-us-customer-assets-to-protect-investors-within-5-days-withdrawals-and-assets-from-binance-com-remain-unaffected",
    "description": "<p>US Securities and Exchange Commission files for a temporary restraining order to freeze assets of Binance.US. Binance has vowed to defend itself in court.  The US Securities and Exchange Commission (SEC) was recently reported to have filed a lawsuit against Binance and its CEO Changpeng Zhao for offering unregistered crypto securities without the appropriate licenses. [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/sec-moves-to-temporarily-freeze-binance-us-customer-assets-to-protect-investors-within-5-days-withdrawals-and-assets-from-binance-com-remain-unaffected/\">SEC Moves to Temporarily Freeze Binance.US Customer Assets to Protect Investors Within 5 Days; Withdrawals and Assets From Binance.com Remain Unaffected</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T08:00:15.000Z",
    "title": "As Solana (SOL) Struggles to Maintain Momentum, InQubeta (QUBE) and Polygon (MATIC) See Explosive Growth",
    "url": "https://www.crypto-news-flash.com/as-solana-sol-struggles-to-maintain-momentum-inqubeta-qube-and-polygon-matic-see-explosive-growth/?utm_source=rss&utm_medium=rss&utm_campaign=as-solana-sol-struggles-to-maintain-momentum-inqubeta-qube-and-polygon-matic-see-explosive-growth",
    "description": "<p>Staying relevant in the crypto market can be difficult for some coins. This is why DeFi coins are constantly trying to introduce features and updates that solidify their value on the market. Despite that, there are crypto projects that can shine above the rest &#38; this year, that cryptocurrency is InQubeta (QUBE) which will rise [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/as-solana-sol-struggles-to-maintain-momentum-inqubeta-qube-and-polygon-matic-see-explosive-growth/\">As Solana (SOL) Struggles to Maintain Momentum, InQubeta (QUBE) and Polygon (MATIC) See Explosive Growth</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T07:49:21.000Z",
    "title": "Secure and Anonymous: Buy Bitcoin, Ethereum, and Monero with No KYC or Upper Limit, Ensuring Privacy in Cryptocurrency Transactions",
    "url": "https://www.crypto-news-flash.com/secure-and-anonymous-buy-bitcoin-ethereum-and-monero-with-no-kyc-or-upper-limit-ensuring-privacy-in-cryptocurrency-transactions/?utm_source=rss&utm_medium=rss&utm_campaign=secure-and-anonymous-buy-bitcoin-ethereum-and-monero-with-no-kyc-or-upper-limit-ensuring-privacy-in-cryptocurrency-transactions",
    "description": "<p>PLSburn announces on-ramp and off-ramp with no KYC.  According to the team, they would be working to improve the system to be faster.  Crypto exchange PLSburn has announced that customers can now on-ramp and off-ramp from the likes of Bitcoin, Ethereum, Polygon, Monero, and BSC. In addition, users can trade DAI, USDT, and USDC with [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/secure-and-anonymous-buy-bitcoin-ethereum-and-monero-with-no-kyc-or-upper-limit-ensuring-privacy-in-cryptocurrency-transactions/\">Secure and Anonymous: Buy Bitcoin, Ethereum, and Monero with No KYC or Upper Limit, Ensuring Privacy in Cryptocurrency Transactions</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-07T08:03:02.000Z",
    "title": "Beginner’s Guide About Tamadoge – Part 2",
    "url": "https://www.altcoinbuzz.io/reviews/beginners-guide-about-tamadoge-part-2/",
    "description": "<p>In Part 2 of this two-part article series on Tamadoge, we&#8217;ll be discussing its NFTs and some ways to buy its native $TAMA token. Also, we&#8217;ll run through how to sell your $TAMA to USD fiat. Lastly, we&#8217;ll end off with a review of the legitimacy of this meme coin project.  If you need a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/reviews/beginners-guide-about-tamadoge-part-2/\">Beginner’s Guide About Tamadoge – Part 2</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-07T07:59:47.000Z",
    "title": "BitMEX Co-founder Believes BTC’s Price Will Soar Soon",
    "url": "https://coinedition.com/bitmex-co-founder-believes-btcs-price-will-soar-soon/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/BTC-NewsPrice-analysis-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/BTC-NewsPrice-analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/BTC-NewsPrice-analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/BTC-NewsPrice-analysis.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a tweet published earlier today, Arthur Hayes, a co-founder of BitMEX, predicted that the price of Bitcoin (BTC) will soar soon. According to the post, BTC is not in a bullish cycle just yet, but is close to the end of the current bear cycle. This bullish outlook for BTC was accompanied by a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitmex-co-founder-believes-btcs-price-will-soar-soon/\">BitMEX Co-founder Believes BTC’s Price Will Soar Soon</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]