[
  {
    "source": "CryptoSlate",
    "date": "2023-05-29T18:01:04.000Z",
    "title": "NFT wash trading report surfaces amid declining trading volume",
    "url": "https://cryptoslate.com/nft-wash-trading-report-surfaces-amid-declining-trading-volume/",
    "description": "<p>NFT markets have displayed an intriguing set of metrics in 2023 as wash trading and token farming practices emerge amidst declining overall trading volumes. According to a recent DappRadar report, Bored Ape Yacht Club (BAYC) saw a staggering 1,095% growth in 7-day trading volume, reaching $21.9 million. With analysis from CryptoSlate data and Footprint Analytics, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/nft-wash-trading-report-surfaces-amid-declining-trading-volume/\">NFT wash trading report surfaces amid declining trading volume</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T18:07:38.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T17:57:18.000Z",
    "title": "U.S. House Rules committee sets meeting on debt ceiling deal",
    "url": "https://www.cryptopolitan.com/us-house-rules-committee-debt-ceiling-deal/",
    "description": "In an effort to resolve an imminent financial impasse, the U.S. House Rules Committee is gearing up for a crucial meeting slated for Tuesday, May 30. The objective of this meeting revolves around discussing the prospective debt ceiling bill, a key piece of legislation aimed at staving off a potential U.S. default. This move comes ... <a title=\"U.S. House Rules committee sets meeting on debt ceiling deal\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-house-rules-committee-debt-ceiling-deal/\" aria-label=\"More on U.S. House Rules committee sets meeting on debt ceiling deal\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T17:50:11.000Z",
    "title": "Bybit pre-approved as crypto custody provider in Kazakhstan",
    "url": "https://www.cryptopolitan.com/bybit-crypto-custody-provider-in-kazakhstan/",
    "description": "In a significant step towards global expansion, Bybit, a leading player in the cryptocurrency exchange arena, has recently announced that it has secured preliminary approval to operate as a digital asset trading facility and provide custody services in Kazakhstan. This preliminary, or &#8220;in-principle,&#8221; approval from the Astana Financial Services Authority (AFSA) paves the way for ... <a title=\"Bybit pre-approved as crypto custody provider in Kazakhstan\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bybit-crypto-custody-provider-in-kazakhstan/\" aria-label=\"More on Bybit pre-approved as crypto custody provider in Kazakhstan\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T17:42:21.000Z",
    "title": "NFT marketplace Tabi secures $10M in angel funding",
    "url": "https://www.cryptopolitan.com/nft-marketplace-tabi-10m-in-angel-funding/",
    "description": "In an announcement made on May 10th, Tabi, an emergent player in the world of nonfungible token (NFT) marketplaces, formerly known as Treasureland, reported the successful procurement of a significant $10 million in a recent angel funding round. The news marks a substantial milestone in Tabi&#8217;s journey as it continues to navigate the exciting landscape ... <a title=\"NFT marketplace Tabi secures $10M in angel funding\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nft-marketplace-tabi-10m-in-angel-funding/\" aria-label=\"More on NFT marketplace Tabi secures $10M in angel funding\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-29T17:59:33.000Z",
    "title": "Lawmakers say Russia won’t develop state-owned crypto exchange",
    "url": "https://crypto.news/lawmakers-say-russia-wont-develop-state-owned-crypto-exchange/",
    "description": "Russian lawmakers have opted not to continue with plans to develop a state-owned crypto exchange."
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-29T18:00:45.000Z",
    "title": "Bitcoin Rally Hopes Still Alive, If This Metric Is To Go By",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-rally-hopes-still-alive-this-metric-go-by/",
    "description": "If the historical pattern in this on-chain indicator is anything to go by, hopes for the continuation of the Bitcoin rally may still be alive. Bitcoin SOPR Ratio Has Been Going Up In Recent Weeks As an analyst in a CryptoQuant post pointed out, the SOPR ratio has been above 1 recently. The &#8220;Spent Output Profit Ratio&#8221; (SOPR) indicates whether the investors in the Bitcoin market are selling their coins at a profit or a loss right now. When the value of this metric is above 1, it means the average holder in the sector is currently moving their coins at a loss. On the other hand, values below this threshold imply the market is realizing a net profit at the moment. The BTC sector is generally divided into two main holder groups: the &#8220;short-term holders&#8221; (STHs) and the &#8220;long-term holders&#8221; (LTHs). The former cohort includes all investors that acquired their coins within the last 155 days, while the latter group includes those who bought before this cutoff. In the context of the current discussion, the relevant indicator is not the SOPR itself but the &#8220;SOPR ratio.&#8221; This indicator measures the ratio between the SOPR, specifically for the LTHs and the STHs. Related Reading: Will This Political Deal In The US Save Bitcoin and Crypto? Now, here is a chart that shows the trend in the 30-day simple moving average (SMA) Bitcoin SOPR ratio throughout the history of the asset: Looks like the value of the metric has been going up in recent days &#124; Source: CryptoQuant As you can see in the above graph, the quant has marked the pattern that the 30-day SMA Bitcoin SOPR ratio seems to have followed during the past cycles of the cryptocurrency. Whenever the SOPR ratio is below 1, the LTHs realize lower profits relative to the STHs. Historically, this has usually been observed inside bear markets. The bear market bottom formations in the asset price have always occurred when the indicator has plunged deep below this mark and hit a value of about 0.5. Bullish periods followed with a surge in the metric back above the 1 level. Such a breakout implies a shift in the market dynamics, as the LTHs are harvesting a higher profit than the STHs during periods like these. During the rally in the last few months, the 30-day SMA Bitcoin SOPR ratio has again managed to break above the 1 mark, suggesting that the shift towards a bull market may have occurred. Related Reading: Bitcoin Shows Recovery: Did This Historical Line Act As Support Again? The metric is still firmly above this level, despite the recent struggle that the coin has seen. The analyst believes this is a sign that the bulls continue to dominate the market. From the chart, it&#8217;s also visible that the present values of the SOPR ratio are nowhere near as high as what was observed during past rallies, including the April 2019 rally, which may hint that the rally has some potential to go before the top. BTC Price At the time of writing, Bitcoin is trading around $27,900, up 4% in the last week. BTC has gone up during the past day &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-29T18:05:15.000Z",
    "title": "Binance CEO Details Potential New Narratives for Next Crypto Bull Market, Predicts Much More Success for Industry",
    "url": "https://dailyhodl.com/2023/05/29/binance-ceo-details-potential-new-narratives-for-next-crypto-bull-market-predicts-much-more-success-for-industry/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/Binance-CEO-Changpeng-narrative.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/Binance-CEO-Changpeng-narrative.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/Binance-CEO-Changpeng-narrative.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/Binance-CEO-Changpeng-narrative.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/Binance-CEO-Changpeng-narrative.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/Binance-CEO-Changpeng-narrative.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/Binance-CEO-Changpeng-narrative.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The CEO of the world&#8217;s largest crypto exchange by trading volume foresees a series of &#8220;successes&#8221; in the crypto industry in the next bull market. In a new Bankless interview, Binance chief Changpeng Zhao outlines what he thinks the &#8220;next big thing&#8221; for crypto and blockchain technology could be. &#8220;If we talk about the internet, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/29/binance-ceo-details-potential-new-narratives-for-next-crypto-bull-market-predicts-much-more-success-for-industry/\">Binance CEO Details Potential New Narratives for Next Crypto Bull Market, Predicts Much More Success for Industry</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]