[
  {
    "source": "Decrypt",
    "date": "2024-03-22T19:58:17.000Z",
    "title": "Orb Eye-Scanning Code Made Open Source by Worldcoin Foundation",
    "url": "https://decrypt.co/223029/worldcoin-foundation-releases-orb-technologys-core-components-on-github",
    "description": "By publishing its core technology on GitHub, the group hopes to increase transparency around its \"humanness\" authentication scheme."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-22T19:41:39.000Z",
    "title": "Apple’s legal woes mount as vulnerability threatening crypto security comes to light",
    "url": "https://cryptoslate.com/apples-legal-woes-mount-as-vulnerability-threatening-crypto-security-comes-to-light/",
    "description": "<p>Academic researchers have unearthed a significant vulnerability within Apple&#8217;s M-series computing chips, potentially jeopardizing the security of private crypto keys. On the same day, the US Department of Justice (DOJ) filed an antitrust case against the iPhone maker, alleging monopoly practices detrimental to consumers, developers, and competitors. The vulnerability The research team identified the chips&#8217; [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/apples-legal-woes-mount-as-vulnerability-threatening-crypto-security-comes-to-light/\">Apple&#8217;s legal woes mount as vulnerability threatening crypto security comes to light</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-22T20:00:58.000Z",
    "title": "Bernstein Analysts Says Bitcoin Will Reach A New ATH By Year End, Here’s The Target",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-new-ath-by-year-end/",
    "description": "Analysts at financial services firm Bernstein are increasing their price expectations for Bitcoin. This follows a revised report in which they boosted their year-end target for the flagship crypto token’s price.  Bitcoin To Hit $90,000 By The End Of 2024 According to a report by CoinDesk, Bernstein analysts Gautam Chhugani and Mahika Sapra have raised their year-end prediction for Bitcoin’s price from $80,000 to $90,000. Their research report cited the strong Spot Bitcoin ETF inflow and a record mining income as the reasons for this increased bullishness on BTC&#8217;s price. Related Reading: Top 3 Solana Meme Coins To Buy Amid The Bitcoin Crash That Could 10x Since launching, the Spot Bitcoin ETFs have recorded an impressive amount of inflows into their funds and have significantly contributed to an increase in BTC&#8217;s price. As such, it is understandable why these analysts believe they could still positively impact Bitcoin’s price in the long run.  Despite miners’ rewards being cut in half during the Halving event in mid-April, these Bernstein analysts also foresee a record mining income for BTC miners. They believe this would have a positive impact on BTC&#8217;s price. Bitcoinist recently reported that Bitcoin Halving could force some miners out of business, paving the way for the remaining miners to enjoy increased revenue.  Meanwhile, Chhugani and Sapra also recently reaffirmed their prediction that Bitcoin will hit $150,000 by mid-2025. They believe that the Spot Bitcoin ETFs will be one of many factors contributing to this massive price surge.  BTC Could Even Hit $150,000 This Year Standard Chartered is another financial institution that revised its year-end target for Bitcoin’s price. As against their initial prediction of $100,000, they recently stated that Bitcoin could rise to $150,000 by the end of this year. Like Bernstein, Standard Chartered also alluded to the influence of the Bitcoin ETFs as the primary reason for their bullishness on Bitcoin.  Related Reading: Crypto Analyst Says XRP Price Is Headed For $27 As 2017 Pattern Emerges The bank noted in the research report that these investment funds provide a more robust and sustainable positioning for Bitcoin, unlike when the crypto token hit new highs solely based on speculations. Standard Chartered also predicts that BTC could rise to $200,000 by the end of 2025.  Interstingly, they added that an “overshoot to $250,000 is likely at some point in 2025 if ETF inflows continue apace and reserve managers buy BTC.” These predictions, however, look conservative when one considers Samson Mow’s prediction that BTC could hit $1 million this year.  At the time of writing, Bitcoin is trading at around $66,200, down over 1% in the last 24 hours, according to data from CoinMarketCap.  BTC bears reclaim control of price &#124; Source: BTCUSD on Tradingview.com Featured image from Yahoo Finance, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-22T20:00:19.000Z",
    "title": "Layer-2 Builder Espresso Systems Raises $28,000,000 in Andreessen Horowitz-Led Funding Round",
    "url": "https://dailyhodl.com/2024/03/22/layer-2-builder-espresso-systems-raises-28000000-in-andreessen-horowitz-led-funding-round/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/layer-builder-espresso.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/layer-builder-espresso.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/03/layer-builder-espresso.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/layer-builder-espresso.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/layer-builder-espresso.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/layer-builder-espresso.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/03/layer-builder-espresso.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The blockchain infrastructure project Espresso Systems has raised $28 million in a Series B funding round led by investment giant Andreessen Horowitz (a16z). Espresso aims to increase interoperability between Ethereum (ETH) rollups by building a marketplace where rollups can sell the right to build their blocks to bidders. Rollups are solutions that execute transactions outside [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/22/layer-2-builder-espresso-systems-raises-28000000-in-andreessen-horowitz-led-funding-round/\">Layer-2 Builder Espresso Systems Raises $28,000,000 in Andreessen Horowitz-Led Funding Round</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-22T19:55:35.000Z",
    "title": "As Bitcoin’s Consolidation Continues, Crypto Analyst Compares BTC’s Movements to Previous Cycles",
    "url": "https://dailyhodl.com/2024/03/22/as-bitcoins-consolidation-continues-crypto-analyst-compares-btcs-movements-to-previous-cycles/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/Bullish-Contrarian-Signal-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/Bullish-Contrarian-Signal-.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2024/01/Bullish-Contrarian-Signal-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/Bullish-Contrarian-Signal-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/Bullish-Contrarian-Signal-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/Bullish-Contrarian-Signal-.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2024/01/Bullish-Contrarian-Signal-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>With Bitcoin (BTC) falling nearly 7% in the last week, one widely followed crypto analyst believes the correction is all part of the process. Digital assets trader Michaël van de Poppe tells his 705,000 followers on the social media platform X that BTC&#8217;s downward trend may be a result of a pre-halving peak. &#8220;The consolidation on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/22/as-bitcoins-consolidation-continues-crypto-analyst-compares-btcs-movements-to-previous-cycles/\">As Bitcoin’s Consolidation Continues, Crypto Analyst Compares BTC’s Movements to Previous Cycles</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]