[
  {
    "source": "Cointelegraph",
    "date": "2023-11-08T18:00:00.000Z",
    "title": "Visa launches global AI advisory practice focused on generative systems",
    "url": "http://cointelegraph.com/news/visa-launches-global-ai-advisory-practice-focused-artificial-intelligence-generative-systems",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/77486f36-cbeb-44ab-a48d-05754f7ee8ce.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Visa’s new AI advisory practice will leverage more than 1,000 analysts and consultants around the globe. </p>\n                    <p><p>Visa announced the launch of its new global AI advisory practice on Nov. 8. The consultation service will be part of Visa Consulting &amp; Analytics (VCA) and, according to a press release, will <a href=\"https://usa.visa.com/about-visa/newsroom/press-releases.releaseId.20076.html\" target=\"_blank\" rel=\"noopener nofollow\">focus</a> on “providing actionable insights and recommendations to empower clients to unlock the potential of AI and utilize generative AI.”</p><p>Citing its “30-year AI legacy,” Visa announced the new practice alongside a range of new services related to empowering clients to understand the potential role of generative AI at the enterprise level. </p><p>https://twitter.com/VisaNews/status/1722232766316822995</p><p>The service will be tended by VCA's global network of “over 1,000 consultants, data scientists and product experts in 75 offices on six continents,” according to the press release. </p><p>Carl Rutstein, global head of advisory services at Visa said the practice will offer a full suite of client services: </p><p>“AI is not just reshaping industries worldwide – it's revolutionizing them, and the payments sector is at the forefront of this transformation. Visa doesn’t just use AI to help improve payment experiences – our Advisory business is also harnessing it to empower our clients to grow and redefine how they serve their own customers through acquisition, engagement, retention, and risk management.”</p><p>This news comes on the heels of a $100 million AI venture fund launched by the company on Oct. 2. As Cointelegraph reported, the fund is set up to support <a href=\"https://cointelegraph.com/news/visa-to-invest-100-million-generative-ai\">innovation and development in the generative AI space</a>. </p><p>Generative AI is a burgeoning sector of machine learning that involves the use of models designed to produce human-like content such as text, images, audio, or video files within the constraints of a specific training set. The most popular models, including OpenAI’s ChatGPT and Anthropic’s Claude 2, have been widely-adopted for personal and enterprise use. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ibm-launches-500-million-fund-develop-generative-ai-enterprise\"><strong><em>IBM launches $500M fund to develop generative AI for enterprise</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-08T17:49:01.000Z",
    "title": "Is the Momentum Behind Dogecoin and Shiba Inu Foreshadowing a Major Market Shift?",
    "url": "https://cryptodaily.co.uk/2023/11/is-the-momentum-behind-dogecoin-and-shiba-inu-foreshadowing-a-major-market-shift",
    "description": "Dive into the dynamic rally of Dogecoin (DOGE) and Shiba Inu (SHIB) as they spark investor interest in a possibly shifting market. Our in-depth examination tracks their recent upsurge, capturing the essence of investor sentiment and market trends. With DOGE and SHIB at the forefront of this week's gains, we provide a nuanced perspective on what these movements could mean for the wider crypto ecosystem. Stay informed and navigate the complexities of potential market turns with our astute observations in the volatile world of digital currencies."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-08T17:53:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Binance coin and the entire crypto market have seen little gains in the past few days, as prices have been consolidating in tight regions. BNB prices have dropped by 14.11% since touching $248.9 in August 2023. What does the future hold for Binance Coin? How much is BNB worth? The ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-08T18:00:10.000Z",
    "title": "Solana Whale Deposits $11M In SOL To Binance, Bearish Signal?",
    "url": "https://www.newsbtc.com/news/solana/solana-whale-deposits-10m-sol-binance-bearish/",
    "description": "Data shows a Solana whale has deposited SOL worth $11 million to Binance, which could be bearish for the asset&#8217;s price. Solana Has Enjoyed Sharp Bullish Momentum During The Past Month Since the start of Bitcoin&#8217;s rally towards the $35,000 level, the cryptocurrency market as a whole has been having a good time. Among the assets, Solana has particularly stood out, as its returns have been one of the highest. During the last 30 days, SOL has observed an exceptional rally of more than 84%, leading to its price surpassing the $43 mark. The chart below shows how the asset&#8217;s trajectory has looked like during this period. The value of the coin seems to have been rapidly going up in recent weeks &#124; Source: SOLUSD on TradingView From the chart, it&#8217;s visible that Solana had managed to rise as high as $47 at the start of the month, but the coin registered a bit of a pullback soon after. The asset has since recovered 9% from these local lows, although it&#8217;s yet to make a full retrace. However, momentum appears to be building for the coin, as it has grown by 3% during the past day. Related Reading: Chainlink Has Massive Resistance Ahead, Will The Rally End Soon? In this sharp rally during the past month, Solana also improved its standing in the cryptocurrency sector, as it claimed the 7th position on the market cap list. Looks like SOL has a market cap of $24.4 billion at the moment &#124; Source: CoinMarketCap Naturally, as with any rally, profit-taking can be something to look out for, as it can lead towards a local top formation. It would appear that a whale may be attempting to do precisely that. SOL Whale Has Deposited A Large Amount To Binance Today According to data from the cryptocurrency transaction tracker service Whale Alert, a large transaction has been spotted on the Solana blockchain during the past day. This transfer saw 249,999 SOL move across the network, worth approximately $10.8 million when the transaction was executed. Given the large amount involved, it&#8217;s likely that a whale entity was behind it. Generally, transactions can be something to watch, as they can sometimes have noticeable effects on the market, how the price would be affected by the move of a whale naturally depends on what they intended to do with it. Related Reading: Dogecoin In Tight Zone: Why A Rally Will Happen If DOGE Clears $0.076 In the current case, the transfer moved from an unknown wallet (likely the whale&#8217;s address) to a wallet attached to a central platform: the Binance exchange. One of the main reasons an investor might transfer their coins from their self-custodial wallet to one of these central entities is for selling purposes, so it&#8217;s possible that the whale wanted to sell here and harvest the profits they would have amassed in the latest rally. The cryptocurrency price could end up feeling some resistance shortly if selling was indeed the goal in the mind of this whale. Featured image Shutterstock.com, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-08T17:55:54.000Z",
    "title": "SEC Struggling To Recruit Crypto Specialists As Candidates Unwilling To Divest Digital Asset Holdings",
    "url": "https://dailyhodl.com/2023/11/08/sec-struggling-to-recruit-crypto-specialists-as-candidates-unwilling-to-divest-digital-asset-holdings/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/sec-struggling-to-recruit.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/sec-struggling-to-recruit.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/sec-struggling-to-recruit.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/sec-struggling-to-recruit.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/sec-struggling-to-recruit.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/sec-struggling-to-recruit.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/sec-struggling-to-recruit.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Securities and Exchange Commission (SEC) is having a tough time recruiting professionals to help regulate crypto. The SEC&#8217;s Office of Inspector General (OIG), which provides oversight of the regulator&#8217;s operations, notes in a recent report that the commission believes it is crucial to recruit crypto specialists to investigate new and evolving issues in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/08/sec-struggling-to-recruit-crypto-specialists-as-candidates-unwilling-to-divest-digital-asset-holdings/\">SEC Struggling To Recruit Crypto Specialists As Candidates Unwilling To Divest Digital Asset Holdings</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]