[
  {
    "source": "CryptoSlate",
    "date": "2023-11-13T21:00:21.000Z",
    "title": "Cboe Digital to offer margin futures trading for Bitcoin and Ethereum in 2024",
    "url": "https://cryptoslate.com/cboe-digital-to-offer-margin-futures-trading-for-bitcoin-and-ethereum-in-2024/",
    "description": "<p>Cboe Digital said on Nov. 13 that it will launch trading and clearing for margin futures on both Bitcoin (BTC) and Ethereum (ETH) in the coming months. The company noted that this model will allow investors to trade futures without posting complete collateral upfront. According to reports from Reuters in June, the current trading model [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/cboe-digital-to-offer-margin-futures-trading-for-bitcoin-and-ethereum-in-2024/\">Cboe Digital to offer margin futures trading for Bitcoin and Ethereum in 2024</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T21:06:33.000Z",
    "title": "BRICS countries plan alternative internet services",
    "url": "https://www.cryptopolitan.com/brics-countries-alternative-internet-service/",
    "description": "In a bold move that could reshape the global digital landscape, BRICS nations are contemplating the establishment of an independent internet service. This initiative, spearheaded by Dmitry Gusev, the Deputy Chairman of the State Duma Control Committee, aims to create a digital platform exclusive to BRICS countries, potentially diminishing the technological dominance of the United ... <a title=\"BRICS countries plan alternative internet services\" class=\"read-more\" href=\"https://www.cryptopolitan.com/brics-countries-alternative-internet-service/\" aria-label=\"More on BRICS countries plan alternative internet services\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T20:59:45.000Z",
    "title": "Google’s parent company exits stake in trading app Robinhood",
    "url": "https://www.cryptopolitan.com/googles-parent-company-exits-stake-in-trading-app-robinhood/",
    "description": "Alphabet Inc., the parent company of tech giant Google, has recently announced its decision to divest its entire stake in Robinhood Markets Inc. This move marks a significant shift in Alphabet&#8217;s investment strategy, as it had been a key stakeholder in the popular trading app since its early days as an unlisted startup. The trading ... <a title=\"Google&#8217;s parent company exits stake in trading app Robinhood\" class=\"read-more\" href=\"https://www.cryptopolitan.com/googles-parent-company-exits-stake-in-trading-app-robinhood/\" aria-label=\"More on Google&#8217;s parent company exits stake in trading app Robinhood\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-13T20:55:54.000Z",
    "title": "What tomorrow’s CPI report could mean for Bitcoin",
    "url": "https://www.cryptopolitan.com/what-cpi-report-could-mean-for-bitcoin/",
    "description": "As Bitcoin (BTC) hovers around the $37,000 mark, following a significant five-week surge, all eyes are now on the upcoming Consumer Price Index (CPI) report. This crucial economic indicator, expected to show a deceleration in inflation rates, could be the next major catalyst for Bitcoin’s trajectory. With the US Federal Reserve&#8217;s inflation target of 2% ... <a title=\"What tomorrow&#8217;s CPI report could mean for Bitcoin\" class=\"read-more\" href=\"https://www.cryptopolitan.com/what-cpi-report-could-mean-for-bitcoin/\" aria-label=\"More on What tomorrow&#8217;s CPI report could mean for Bitcoin\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-13T21:08:59.000Z",
    "title": "Evaluating performance of crypto traders: key metrics to watch",
    "url": "https://crypto.news/evaluating-performance-of-crypto-traders-key-metrics-to-watch/",
    "description": "This article discusses key metrics when evaluating the performance of a crypto trader"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-13T21:05:26.000Z",
    "title": "NFT market revives as major collections soar in sales and volume",
    "url": "https://crypto.news/nft-market-revives-as-major-collections-soar-in-sales-and-volume/",
    "description": "Major NFT collections see increased demand as sales and trading volume soar across several networks.&#160; As the crypto market rallied after a prolonged crypto winter, the non-fungible tokens (NFT) market also hints at a comeback — the trading volume of&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-13T20:54:32.000Z",
    "title": "Genesis and 3AC reach $33m settlement in billion-dollar claim",
    "url": "https://crypto.news/genesis-and-3ac-reach-33m-settlement-in-billion-dollar-claim/",
    "description": "Genesis agrees to a $33 million settlement with Three Arrows Capital, significantly less than the original $1 billion claim, amid ongoing crypto turmoil. Bankrupt crypto lender Genesis has consented to a settlement with the now-defunct crypto hedge fund Three Arrows&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-13T20:41:57.000Z",
    "title": "Crypto.com launches new derivatives product",
    "url": "https://crypto.news/crypto-com-launches-new-derivatives-product/",
    "description": "Crypto.com has launched Strike Options, a new derivatives trading feature in its app. It lets U.S. users speculate on crypto prices with short-term, binary options. Crypto.com has recently unveiled its new derivatives product, Strike Options, marking a significant addition to&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-13T21:00:52.000Z",
    "title": "Uniswap’s Financial Win: New Fee Model Rakes In Over $1 Million In A Month Amid DeFi Frenzy",
    "url": "https://www.newsbtc.com/news/uniswap/uniswap-financial-win-new-fee-model-rakes-in/",
    "description": "Uniswap Labs, the company behind the decentralized finance (DeFi) protocol, has achieved a milestone in its revenue generation strategy. Just a month after its implementation, the firm&#8217;s newly introduced front-end fees have crossed roughly $1 million, a testament to the platform&#8217;s robust activity and user base. This achievement comes shortly after the mid-October decision to introduce a 0.15% fee on some certain tokens transacted on its front-end interface. This new fee structure applies to various assets, including popular ones like ETH, USDC, WETH, USDT, DAI, WBTC, and others. Related Reading: Uniswap’s New Fee Structure: Are You About To Pay More For These Tokens? Analyzing Uniswap Financial Trajectory As shown in data from Token Terminal, over the past few weeks following the fee&#8217;s launch, Uniswap has amassed about $1.14 million. This figure translates to an average daily revenue of approximately $44,000. Projected annually, this rate could bring in roughly or more than $16 million in revenue for Uniswap Labs. Meanwhile, Blockchain reporter Colin Wu estimated daily fees from Uniswap V3&#8217;s new structure could range between $388,000 and $444,000. Although the figures have been more modest, they still represent a substantial income stream. Wu&#8217;s analysis also reveals that about 35% to 40% of Uniswap&#8217;s total transaction volume is processed through the front end, indicating a significant portion of the platform&#8217;s activity is subject to these new fees. Regardless, the total cumulative amount recorded in the past weeks, nearly a month, marks a significant financial upturn for the company and highlights the potential profitability of increased fee structures in the DeFi space. Notably, unlike the long-established 0.3% fee, dispensed among liquidity providers as an incentive, the new front-end fees solely directed towards Uniswap Labs is not just a revenue-generating move, as it also signified a strategic shift towards diversifying income sources. So far, this step allows Uniswap Labs to have a direct and consistent revenue stream, independent of the protocol fees traditionally distributed among liquidity providers. DeFi Market Flourishes: Capital Inflows and Token Value Surge It is worth noting that the recent boost in Uniswap&#8217;s cumulative front-end fees aligns with an emerging DeFi resurgence, marked by a significant rise in capital inflows. Data from DeFiLlama reveals a notable nearly $10 billion increase in the DeFi market&#8217;s total value locked (TVL) over the past month. This upward trajectory has seen the TVL escalate from $36.62 billion in October to roughly $46.65 billion. Related Reading: Crypto Analyst Presents Uniswap’s UNI As The Next Coin Primed For Breakout Moreover, this bullish trend extends to DeFi tokens, with leading DeFi assets experiencing substantial growth. Top tokens such as Chainlink (LINK), Avalanche (AVAX), and Uniswap (UNI) have recorded increases of 19.39%, 35%, and 8.56% respectively in the last week, reflecting the overall positive momentum in the crypto market. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-13T21:00:45.000Z",
    "title": "Here’s a Potential Bitcoin Price Target for Late 2025, According to Crypto Analyst Benjamin Cowen",
    "url": "https://dailyhodl.com/2023/11/13/heres-a-potential-bitcoin-price-target-for-late-2025-according-to-crypto-analyst-benjamin-cowen/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/Bitcoin-Halving-Could-Be.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/Bitcoin-Halving-Could-Be.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/Bitcoin-Halving-Could-Be.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/Bitcoin-Halving-Could-Be.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/Bitcoin-Halving-Could-Be.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/Bitcoin-Halving-Could-Be.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/Bitcoin-Halving-Could-Be.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Closely followed crypto analyst Benjamin Cowen is laying out a potential price target for Bitcoin (BTC) in late 2025 based on historical market cycle patterns. In a new strategy session, Cowen takes a look at logarithmic regression bands, which aim to plot out potential tops and bottoms of market cycles based on diminishing volatility. Cowen [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/13/heres-a-potential-bitcoin-price-target-for-late-2025-according-to-crypto-analyst-benjamin-cowen/\">Here’s a Potential Bitcoin Price Target for Late 2025, According to Crypto Analyst Benjamin Cowen</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-13T20:55:24.000Z",
    "title": "LINK To Be ‘Universal Gas Token’? Sergey Nazarov Explains Potential for Rapid Chainlink Adoption",
    "url": "https://dailyhodl.com/2023/11/13/link-to-be-universal-gas-token-sergey-nazarov-explains-potential-for-rapid-chainlink-adoption/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/chainlink-swift-link-attracting.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/chainlink-swift-link-attracting.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/chainlink-swift-link-attracting.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/chainlink-swift-link-attracting.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/chainlink-swift-link-attracting.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/chainlink-swift-link-attracting.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/chainlink-swift-link-attracting.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Chainlink creator Sergey Nazarov says LINK could be the future universal gas token for the digital asset ecosystem. In a new interview, Nazarov explores the payment abstraction layer (PAL) of Chainlink&#8217;s tech stack, which aims to minimize the complexity of paying for its services while allowing oracle networks to get paid in LINK. According to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/13/link-to-be-universal-gas-token-sergey-nazarov-explains-potential-for-rapid-chainlink-adoption/\">LINK To Be ‘Universal Gas Token’? Sergey Nazarov Explains Potential for Rapid Chainlink Adoption</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]