[
  {
    "source": "CryptoSlate",
    "date": "2023-07-02T15:06:54.000Z",
    "title": "Op-ed: NFTs fueling copyright confusion",
    "url": "https://cryptoslate.com/op-ed-nfts-fueling-copyright-confusion/",
    "description": "<p>The growing market for non-fungible tokens has wrought confusion about their relationship to copyright law. Some of this is due to inexperience and misunderstandings among people minting NFTs, but much also has to do with the limitations of current copyright law and existing licenses. One possible solution would be the creation of a special license [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/op-ed-nfts-fueling-copyright-confusion/\">Op-ed: NFTs fueling copyright confusion</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-02T15:00:00.000Z",
    "title": "Bitcoin Price Analysis:  Orbiting 30491 Technicals - 3 July 2023",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-price-analysis-orbiting-30491-technicals-3-july-2023",
    "description": "<p>BTC/USD Orbiting 30491 Technicals:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 3 July 2023</p>\n<p>Bitcoin (BTC/USD) sought fresh technical guidance early in the Asian session as the pair continued to orbit the 30491.62 area, representing the 50% retracement of the appreciating range from 29539.57 to 31443.67.&nbsp; &nbsp;The pair&rsquo;s recent depreciation to the 29417.14 area represented a test of the 38.2% retracement of the appreciating range from 26165.98 to 31443.67.&nbsp; The decline occurred after BTC/USD spiked higher to the 30277 area, its strongest print in several trading sessions, and increased the possibility of a test of the 28604.83 area.&nbsp; BTC/USD notched a June gain of approximately 11.9%, and the pair is now up approximately 83.4% year-to-date.&nbsp; The pair&rsquo;s recent print around the 31443.67 area was a twelve-month high and test of an upside price objective associated with buying pressure that strengthened around the 26637.41 area.&nbsp; Additional upside price objectives include the 31737, 32125, and 33569 areas.&nbsp; Stops are cited above additional upside price objectives around the 31674, 32043, 34531, and 34658 areas.</p>\n<p>Following recent selling pressure, areas of potential technical support and buying pressure include the 29863, 29427, 28886, 28804, 28182, 28096, and 27306 areas.&nbsp; &nbsp;Stops were also recently triggered above additional upside price objectives around the 29068, 29159, 29458, 30088, 30200, 30292, and 30477 levels.&nbsp; &nbsp;&nbsp;Technicians are closely watching to see how much technical support develops around the 28095.44 area, representing the 23.6% retracement of the historical depreciating range from 69000 to 15460.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bullishly indicating above the 100-bar MA (4-hourly)&nbsp;and&nbsp;above the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bullishly indicating above the 100-bar MA (hourly) and above the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 30497.77 and the&nbsp;50-bar MA&nbsp;(Hourly) at 30517.17.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bearishly below MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bullishly above MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-02T15:00:13.000Z",
    "title": "It Might Be Too late to invest in Dogecoin (DOGE) but InQubeta (QUBE) presale is still early and could be your chance to build generational wealth",
    "url": "https://www.crypto-news-flash.com/it-might-be-too-late-to-invest-in-dogecoin-doge-but-inqubeta-qube-presale-is-still-early-and-could-be-your-chance-to-build-generational-wealth/?utm_source=rss&utm_medium=rss&utm_campaign=it-might-be-too-late-to-invest-in-dogecoin-doge-but-inqubeta-qube-presale-is-still-early-and-could-be-your-chance-to-build-generational-wealth",
    "description": "Building generational wealth is a dream of many cryptocurrency investors, and early-stage crypto investment is the best way to achieve it. InQubeta (QUBE) offers this opportunity, as its presale phase entices adventurous investors seeking to make colossal gains. InQubeta sits at the cross-section between the giant markets of artificial intelligence, blockchain, and finance, and is [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-02T14:55:30.000Z",
    "title": "Bitcoin’s Quarterly Options Expiry Event Sparks Price Surge to $31K",
    "url": "https://www.crypto-news-flash.com/bitcoins-quarterly-options-expiry-event-sparks-price-surge-to-31k/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoins-quarterly-options-expiry-event-sparks-price-surge-to-31k",
    "description": "Bitcoin&#8217;s price surge and trading volume have been driven by U.S. investors, with institutional activity accelerating. Smaller cryptocurrencies face challenges due to regulatory scrutiny, leading trading platforms to limit offerings of popular tokens. Bitcoin (BTC) has experienced a significant price rally driven by increased institutional activity and growing interest from U.S. investors. The surge has [...]"
  }
]