[
  {
    "source": "CoinDesk",
    "date": "2023-08-16T13:19:12.000Z",
    "title": "First Mover Americas: Coinbase Secures NFA Approval to Offer Crypto Futures ",
    "url": "https://www.coindesk.com/markets/2023/08/16/first-mover-americas-coinbase-secures-nfa-approval-to-offer-crypto-futures/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for August 16, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-16T13:33:18.000Z",
    "title": "'Greenwashing': Gitcoin, Shell Partnership Draws Fire From Crypto Pundits",
    "url": "https://decrypt.co/152662/greenwashing-gitcoin-shell-partnership-draws-fire-crypto-pundits",
    "description": "At the center of the Gitcoin partnership is greenwashing, a slick marketing scheme some say Shell is employing. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-16T13:30:00.000Z",
    "title": "Banning ransomware payments: An attractive but dangerous idea",
    "url": "https://cointelegraph.com/magazine/banning-ransomware-payments-attractive-dangerous-idea/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/magazine-Banning-ransomware-payments-scaled.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The U.S. and Australia are considering banning ransomware payments, but will it solve the problem, or harm people and destroy businesses?</p>\n                    <p><p><strong>A successful cyberattack on critical infrastructure  such as electricity grids, transportation networks or healthcare systems  could cause severe disruption and put lives at risk. </strong></p><p>Our understanding of the threat is far from complete since organizations have historically not been required to report data breaches, but attacks are on the rise <a href=\"https://privacyrights.org/data-breaches\" target=\"_blank\" rel=\"nofollow\" >according</a> to the Privacy Rights Clearinghouse. A <a href=\"https://www.sec.gov/news/press-release/2023-139\" target=\"_blank\" rel=\"nofollow\" >recent rule</a> from the United States Securities and Exchange Commission should help clarify matters further by now requiring that organizations disclose material cybersecurity incidents they experience.</p><p>As the digital world continues to expand and integrate into every facet of society, the looming specter of cyber threats becomes increasingly more critical. Today, these cyber threats have taken the form of sophisticated ransomware attacks and debilitating data breaches, particularly targeting essential infrastructure.</p><p>A major question coming from policymakers, however, is whether businesses faced with crippling ransomware attacks and potentially life threatening consequences should have the option to pay out large amounts of cryptocurrency to make the problem go away. Some believe ransoms be banned for fear of encouraging ever more attacks. </p><p>Following a major ransomware attack in <a href=\"https://cointelegraph.com/news/push-to-ban-ransomware-payments-following-australia-s-biggest-cyber-attack\" target=\"_blank\" rel=\"nofollow\" >Australia</a>, its government has been considering a ban on paying ransoms. The <a href=\"https://www.cybersecuritydive.com/news/white-house-considers-ransom-payment-ban/649673/\" target=\"_blank\" rel=\"nofollow\" >United States</a> has also more recently been exploring a ban. But other <a href=\"https://www.afr.com/politics/federal/don-t-ban-paying-cyber-ransoms-ex-us-spy-chief-warns-australia-20230806-p5du9q\" target=\"_blank\" rel=\"nofollow\" >leading cybersecurity experts</a> argue that a ban does little to solve the root problem.</p><figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\"><blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">The government considers a ban on <a href=\"https://twitter.com/hashtag/ransomware?src=hash&ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >#ransomware</a> payments. Is that a good idea? <a href=\"https://twitter.com/hashtag/cybersecurity?src=hash&ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >#cybersecurity</a> <a href=\"https://t.co/DNC3zqIG58\" target=\"_blank\" rel=\"nofollow\" >https://t.co/DNC3zqIG58</a></p>— Hill Tech Solutions (@HillTechRH) <a href=\"https://twitter.com/HillTechRH/status/1689615108211712000?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >August 10, 2023</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></figure><h2 id=\"h-ransomware-and-the-ethical-dilemma-of-whether-to-pay-the-ransom\">Ransomware and the ethical dilemma of whether to pay the ransom</h2><p>At the most basic level, ransomware is simply a form of malware that encrypts the victims data and demands a ransom for its release. A <a href=\"https://blog.chainalysis.com/reports/crypto-crime-midyear-2023-update-ransomware-scams/\" target=\"_blank\" rel=\"nofollow\" >recent study</a> by Chainalysis shows that crypto cybercrime is down by 65% over the past year, with the exception of ransomware, which saw an increase. </p><p>Ransomware is the one form of cryptocurrency-based crime on the rise so far in 2023. In fact, ransomware attackers are on pace for their second-biggest year ever, having extorted at least $449.1 million through June, said Chainalysis.</p><p>Even though there has been a decline in the number of crypto transactions, malicious actors have been going after larger organizations more aggressively. Chainalysis continued:</p><blockquote class=\"wp-block-quote\"><p>Big game hunting  that is, the targeting of large, deep-pocketed organizations by ransomware attackers  seems to have bounced back after a lull in 2022. At the same time, the number of successful small attacks has also grown. </p></blockquote><p>The crippling effect of ransomware is especially pronounced for businesses that heavily rely on data and system availability.</p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"600\" height=\"370\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Cumulative-yearly-ransomware-revenue-2022-vs-2023.png\" alt=\"Cumulative yearly ransomware revenue 2022 vs 2023\" class=\"wp-image-22933\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Cumulative-yearly-ransomware-revenue-2022-vs-2023.png 600w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Cumulative-yearly-ransomware-revenue-2022-vs-2023-300x185.png 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" /><figcaption class=\"wp-element-caption\">Ransomware revenue is up. (Chainalysis)</figcaption></figure><p>The dilemma of whether to pay the ransom is contentious. On one hand, paying the ransom might be seen as the quickest way to restore operations, especially when lives or livelihoods are at stake. On the other hand, succumbing to the demands of criminals creates a vicious cycle, encouraging and financing future attacks.</p><section class=\"adv-banner adbutler-ad adbutler-ad__desktop\"><div class=\"container\"><!-- 1456x180 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><section class=\"adv-banner adbutler-ad adbutler-ad__mobile\"><div class=\"container\"><!-- 600x500 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><p>Organizations grappling with this decision must weigh several factors, including the potential loss if operations cannot be restored promptly, the likelihood of regaining access after payment, and the broader societal implications of incentivizing cybercrime. For some, the decision is purely pragmatic; for others, its deeply ethical.</p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"600\" height=\"263\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Breaches-by-org.-type-over-time.png\" alt=\"Breaches by org. type over time\" class=\"wp-image-22932\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Breaches-by-org.-type-over-time.png 600w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Breaches-by-org.-type-over-time-300x132.png 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" /><figcaption class=\"wp-element-caption\">Attacks by organization type. (Chainalysis)</figcaption></figure><h2>Should paying ransoms be banned?</h2><p>The increasing incidence of ransomware attacks has ignited a policy debate: Should the payment of ransoms be banned? Following a <a href=\"https://cointelegraph.com/news/push-to-ban-ransomware-payments-following-australia-s-biggest-cyber-attack\" target=\"_blank\" rel=\"nofollow\" >major ransomware attack</a> on Australian consumer lender Latitude Financial, in which millions of customer records and IDs were stolen, some have begun to advocate for a ban on paying the ransom as a way of deterring attacks and depriving cybercriminals of their financial incentives. </p><p>In the United States, the White House has <a href=\"https://www.cybersecuritydive.com/news/white-house-considers-ransom-payment-ban/649673/\" target=\"_blank\" rel=\"nofollow\" >voiced</a> its qualified support for a ban. Fundamentally, money drives ransomware and for an individual entity it may be that they make a decision to pay, but for the larger problem of ransomware that is the wrong decision We have to ask ourselves, would that be helpful more broadly if companies and others didnt make ransom payments? said Anne Neuberger, deputy national security advisor for cyber and emerging technologies in the White House.</p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"600\" height=\"400\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/There-are-good-reasons-not-to-pay-a-ransom-but-good-reasons-to-pay-as-well.jpg\" alt=\"There are good reasons not to pay a ransom, but good reasons to pay as well\" class=\"wp-image-22935\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/There-are-good-reasons-not-to-pay-a-ransom-but-good-reasons-to-pay-as-well.jpg 600w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/There-are-good-reasons-not-to-pay-a-ransom-but-good-reasons-to-pay-as-well-300x200.jpg 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" /><figcaption class=\"wp-element-caption\"><em>There are good reasons not to pay a ransom, but good reasons to pay as well. (Pexels)</em></figcaption></figure><p>While <a href=\"https://hbr.org/2023/08/how-a-federal-ban-on-ransomware-payments-could-help-cisos\" target=\"_blank\" rel=\"nofollow\" >proponents argue</a> that it will deter criminals and reorient priorities for C-suite executives, critics, however, warn that a ban might leave victims in an untenable position, particularly when a data breach could lead to loss of life, as in the case of attacks on healthcare facilities.</p><p>The prevailing advice from the FBI and other law enforcement agencies is to discourage organizations from paying ransoms to attackers, Jacqueline Burns Koven, head of cyber threat intelligence for Chainalysis, tells Magazine.<br><br>This stance is rooted in the understanding that paying ransoms perpetuates the problem, as it incentivizes attackers to continue their malicious activities, knowing that they can effectively hold organizations hostage for financial gain. However, some situations may be exceptionally dire, where organizations and perhaps even individuals face existential threats due to ransomware attacks. In such cases, the decision to pay the ransom may be an agonizing but necessary choice. Testimony from the FBI recognizes this nuance, allowing room for organizations to make their own decisions in these high-stakes scenarios, and voiced opposition to an all out ban on payments. </p><figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\"><blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Our report out today highlights the reversal of last years steep decline in ransom payments. As will surprise no one in the IR field, 2023 is on pace to be one of, if not the highest grossing years ever for ransomware.<br><br>So whats changed? <a href=\"https://t.co/JwkWCwuG24\" target=\"_blank\" rel=\"nofollow\" >pic.twitter.com/JwkWCwuG24</a></p>— J. Burns Koven (@JBurnsKoven) <a href=\"https://twitter.com/JBurnsKoven/status/1679122466390589443?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >July 12, 2023</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></figure><p>Another complicating factor is that an increasing number of ransomware attacks, according to Chainalysis, may not have financial demands but instead focus on blackmail and other espionage purposes. </p><p>In such cases, there may be no feasible way to pay the attackers, as their demands may go beyond monetary compensation In the event that an organization finds itself in a situation where paying the ransom is the only viable option, it is essential to emphasize the importance of reporting the incident to relevant authorities. </p><p>Transparency in reporting ransomware attacks is crucial for tracking and understanding the tactics, techniques and procedures employed by malicious actors. By sharing information about attacks and their aftermath, the broader cybersecurity community can collaborate to improve defenses and countermeasures against future threats, Koven continues.</p><h2>Could we enforce a ban on paying ransomware attackers?</h2><p>Even if a ban were implemented, a key challenge is the difficulty in enforcing it. The clandestine nature of these transactions complicates tracing and regulation. Furthermore, international cooperation is necessary to curb these crimes, and achieving a global consensus on a ransom payment ban might be challenging. </p><figure class=\"wp-block-image alignright size-full\"><img decoding=\"async\" width=\"300\" height=\"369\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Banning-ransomware-payments-risks-criminalizing-victims.jpg\" alt=\"Banning ransomware payments risks criminalizing victims\" class=\"wp-image-22931\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Banning-ransomware-payments-risks-criminalizing-victims.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Banning-ransomware-payments-risks-criminalizing-victims-244x300.jpg 244w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><figcaption class=\"wp-element-caption\"><em>Banning ransomware payments risks criminalizing victims. (Pexels)</em></figcaption></figure><p>While banning ransom payments could encourage some organizations to invest more in robust cybersecurity measures, disaster recovery plans and incident response teams to prevent, detect and mitigate the impact of cyberattacks, it still amounts to penalizing the victim and making the decision for them.</p><p>Unfortunately, bans on extortions have traditionally not been an effective way to reduce crime  it simply criminalizes victims who need to pay or shifts criminals to new tactics, says Davis Hake, co-founder of Resilience Insurance who says claims data over the past year shows that while ransomware is still a growing crisis, some clients are already taking steps toward becoming more cyber-resilient and able to withstand an attack. </p><p>By preparing executive teams to deal with an attack, implementing controls that help companies restore from backups, and investing in technologies like EDR and MFA, weve found that clients are significantly less likely to pay extortion, with a significant number not needing to pay it at all. The insurance market can be a positive force for incentivizing these changes among enterprises and hit cybercriminals where it hurts: their wallets, Hake continues.</p><h2>The growing threat and risk of cyberattacks on critical infrastructure</h2><p>The costs of ransomware attacks on infrastructure are often ultimately borne by taxpayers and municipalities that are stuck with cleaning up the mess.</p><p>To understand the economic effects of cyberattacks on municipalities, I released a <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4473545\" target=\"_blank\" rel=\"nofollow\" >research paper</a> with several faculty colleagues, drawing on all publicly reported data breaches and municipal bond market data. In fact, a 1% increase in the county-level cyberattacks covered by the media leads to an increase in offering yields ranging from 3.7 to 5.9 basis points, depending on the level of attack exposure. Evaluating these estimates at the average annual issuance of $235 million per county implies $13 million in additional annual interest costs per county.</p><p>One reason for the significant adverse effects of data breaches on municipalities and critical infrastructure stems from all the interdependencies in these systems. Vulnerabilities related to Internet of Things (IoT) and industrial control systems (ICS) increased at an even faster rate than overall vulnerabilities, with these two categories experiencing a 16% and 50% year over year increase, respectively, compared to a 0.4% growth rate in the number of vulnerabilities overall, <a href=\"https://www.ibm.com/downloads/cas/ADLMYLAZ\" target=\"_blank\" rel=\"nofollow\" >according</a> to the X-Force Threat Intelligence Index 2022 by IBM.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/thailands-crypto-utopia-sex-drugs-libertarian-smart-village/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Thailands Crypto Utopia  90% of a cult, without all the weird stuff</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/north-korean-crypto-hacking-separating-fact-from-fiction/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>North Korean crypto hacking: Separating fact from fiction</p>                        </a>                    </div></div></div><p>A key factor contributing to this escalating threat is the rapid expansion of the attack surface due to IoT, remote work environments and increased reliance on cloud services. With more endpoints to exploit, threat actors have more opportunities to gain unauthorized access and wreak havoc. </p><p>Local governments face a significant dilemma… On one hand, they are charged with safeguarding a great deal of digital records that contain their citizens private information. On the other hand, their cyber and IT experts must fight to get sufficient financial support needed to properly defend their networks, says Brian de Vallance, former DHS assistant secretary.</p><blockquote class=\"wp-block-quote\"><p>Public entities face a number of challenges in managing their cyber risk  the top most is budget. IT spending accounted for less than 0.1% of overall municipal budgets, <a href=\"http://www.govtech.com/security/Local-Governments-Attractive-Targets-for-Cybercriminals.html\" target=\"_blank\" rel=\"nofollow\" >according</a> to M.K. Hamilton & Associates. This traditional underinvestment in security has made it more and more challenging for these entities to obtain insurance from the traditional market.</p></blockquote><p>Cybersecurity reform should involve rigorous regulatory standards, incentives for improving cybersecurity measures and support for victims of cyberattacks. Public-private partnerships can facilitate sharing of threat intelligence, providing organizations with the information they need to defend against attacks. Furthermore, federal support, in the form of resources or subsidies, can also help smaller organizations  whether small business or municipalities  that are clearly resource constrained so they have funds to invest more in cybersecurity. </p><figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\"><blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Its better for organizations to proactively prepare. <a href=\"https://t.co/zmwpIIuKvu\" target=\"_blank\" rel=\"nofollow\" >https://t.co/zmwpIIuKvu</a></p>— Harvard Business Review (@HarvardBiz) <a href=\"https://twitter.com/HarvardBiz/status/1687502656951001100?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >August 4, 2023</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></figure><h2>Toward solutions</h2><p>So, is the solution a market for cybersecurity insurance? A competitive market to hedge against cyber risk will likely emerge as organizations are increasingly required to report material incidents. A cyber insurance market would still not solve the root of the problem: Organizations need help becoming resilient. Small and mid-sized businesses, according to my <a href=\"https://yjolt.org/defining-reasonable-cybersecurity-lessons-states\" target=\"_blank\" rel=\"nofollow\" >research</a> with professors Annie Boustead and Scott Shackelford, are especially vulnerable.</p><p>Investment in digital transformation is expected to reach $2T in 2023 according to IDC and all of this infrastructure presents an unimaginable target for cybercriminals. While insurance is excellent at transferring financial risk from cybercrime, it does nothing to actually ensure this investment remains available for the business, says Hake, who says there is a huge opportunity for insurance companies to help clients improve cyber hygiene, reduce incident costs, and support financial incentives for investing in security controls. </p><p>Encouragingly, Hake has noticed a trend for more companies to work with clients to provide insights on vulnerabilities and incentivize action on patching critical vulnerabilities.</p><p>One pure-technology mitigation that could help is SnapShield, a ransomware activated fuse, which works through behavioral analysis, says Doug Milburn, founder of 45Drives. This is agentless software that runs on your server and listens to traffic from clients. If it detects any ransomware content, SnapShield pops the connection to your server, just like a fuse. Damage is stopped, and it is business as usual for the rest of your network, while your IT personnel clean out the infected workstation. It also keeps a detailed log of the malicious activity and has a restore function that instantly repairs any damage that may have occurred to your data, he continues.</p><p>Ransomware attacks are also present within the crypto market, and there is a growing recognition that new tools are needed to build on-chain resilience. While preventative measures are important, access controlled data backups are imperative. If a business is using a solution, like Jackal Protocol, to routinely back up its state and files, it could reboot without paying ransoms with minimal losses, said Eric Waisanen, co-founder of Astrovault.</p><p>Ultimately, tackling the growing menace of cyber threats requires a holistic approach that combines policy measures, technological solutions and human vigilance. Whether a ban on ransom payments is implemented, the urgency of investing in robust cybersecurity frameworks cannot be overstated. As we navigate an increasingly digital future, our approach to cybersecurity will play a pivotal role in determining how secure that future will be.</p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"600\" height=\"400\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Mandatory-disclosure-and-the-threat-of-getting-sued-may-force-companies-to-improve-cybersecurity.jpg\" alt=\"Mandatory disclosure and the threat of getting sued may force companies to improve cybersecurity\" class=\"wp-image-22934\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Mandatory-disclosure-and-the-threat-of-getting-sued-may-force-companies-to-improve-cybersecurity.jpg 600w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Mandatory-disclosure-and-the-threat-of-getting-sued-may-force-companies-to-improve-cybersecurity-300x200.jpg 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" /><figcaption class=\"wp-element-caption\"><em>Mandatory disclosure and the threat of getting sued may force companies to improve cybersecurity. (Pexels)</em></figcaption></figure><p>Emory Roane, policy counsel at PRCD, says that mandatory disclosure of cyber breaches and offering identity theft protection services are essential, but it still leaves consumers left to pick up the pieces for, potentially, a business poor security practices.</p><p>But the combination of mandatory disclosure and the threat of getting sued may be the most effective. He highlights the California Consumer Privacy Act.</p><p>It provides a private right of action allowing consumers to sue businesses directly in the event that a business suffers a data breach that exposes a consumers personal information and that breach was caused by the business failure to use reasonable security measures, Roane explains. That dovetails with a <a href=\"https://www.wsj.com/articles/data-is-the-new-currency-big-tech-antitrust-free-services-platform-consumer-welfare-e5c74fb5?mod=opinion_lead_pos8\" target=\"_blank\" rel=\"nofollow\" >growing recognition</a> that data is an important consumer asset that has long been overlooked and transferred to companies without remuneration. </p><p>Greater education around cybersecurity and data sovereignty will not only help consumers stay alert to ongoing threats  e.g., phishing emails  but also empower them to pursue and value more holistic solutions to information security and data sharing so that the incidence of ransomware attacks is lower and less severe when they do happen.</p><p>Bans rarely work, if for no other reason than enforcement is either physically impossible or prohibitively expensive. Giving into ransoms is not ideal, but neither is penalizing the entity that is going through a crisis. What organizations need are better tools and techniques  and that is something that the cybersecurity industry, in collaboration with policymakers, can help with through new technologies and the adoption of best practices.</p><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.4\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-16T13:17:01.000Z",
    "title": "Why is Litecoin’s price down today?",
    "url": "https://cointelegraph.com/news/why-is-litecoin-price-down-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/ce530470-9138-4146-85b1-27e0058f07f8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Litecoin's price is down today, partly due to the \"sell the news\" sentiment following its Aug. 2 halving.</p>\n                    <p><p>Litecoin's (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) price is down today, mirroring downside moves <a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-stuck\">elsewhere in the cryptocurrency market</a>.</p><p>LTC price fell over 1.5% on Aug. 16 to around $78.25, underperforming the rest of the crypto market, which dropped 0.65% in the same period. The downside move came as a part of a broader pullback trend that started in early July.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/6b854693-4c76-44e0-8362-eb4113ed4571.png\"  /><figcaption style=\"text-align: center;\"><em>LTC/USD vs. crypto market's daily performance chart. Source: TradingView</em></figcaption></figure><h2>Litecoin halving becomes \"sell the news\"</h2><p>The crypto market decline coincided with the U.S. dollar index's (DXY) recovery, as Cointelegraph discussed <a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-stuck\">here</a>. </p><p>However, Litecoin's correction started a week earlier than the crypto market's, driven by its overbought relative strength index (RSI) and a drying buying sentiment in the days leading up to its \"<a href=\"https://cointelegraph.com/news/litecoin-halving-where-is-ltc-price-rally\">halving</a>\" on Aug. 2.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f51af742-1c33-4496-ab91-4b77fd1b8a06.png\"  /><figcaption style=\"text-align: center;\"><em>LTC/USD daily price chart. Source: TradingView</em></figcaption></figure><p>LTC price has dropped over 30% since the day its RSI crossed the overbought threshold reading of 70. Meanwhile, when measured from the halving day, the price is down 16.45% — hinting at a \"<a href=\"https://cointelegraph.com/news/buy-the-futures-sell-the-news-reasons-for-price-jump\">sell the news</a>\" scenario extending into Aug. 16's bearish session.</p><h2>LTC 'hodling' sentiment strong through selloff</h2><p>Data tracking addresses that have held Litecoin for more than 155 days — aka \"<a href=\"https://cointelegraph.com/learn/day-trading-vs-long-term-cryptocurrency-hodling-benefits-and-drawbacks\">hodlers</a>\" — show a persistent accumulation sentiment.</p><p>Notably, the monthly <a href=\"https://studio.glassnode.com/metrics?a=LTC&amp;m=indicators.HodlerNetPositionChange&amp;s=1621215434&amp;u=1691971200&amp;zoom=\" target=\"_blank\" rel=\"noopener nofollow\">Hodler Net Position Change</a> metric flipped from negative to positive on July 23 and has remained the same ever since. In other words, Litecoin's most loyal investors have  accumulated LTC tokens ahead and after halving, displaying their bullishness toward its market.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/e1f9834e-9260-47c5-9534-10bf2279fed8.png\"  /><figcaption style=\"text-align: center;\"><em>Litecoin Holder Net Position Change. Source: Glassnode</em></figcaption></figure><p>However, Litecoin's richest investors — or whales — appear to be at the forefront of the ongoing LTC selloff, according to Santiment data. </p><p>For instance, the Litecoin supply held by addresses with a 1 million to 10 million LTC balance has declined by 0.5% since the having. Similarly, the 100,000-1 million LTC supply cohort has dropped 1% in the same period.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f1459d79-bf63-4eba-9417-c96a78eab767.png\"  /><figcaption style=\"text-align: center;\"><em>Litecoin supply distribution among addresses with a balance between 1,000 LTC and 10 million LTC. Source: Santiment</em></figcaption></figure><h2>A typical post-halving selloff?</h2><p>Independent market analysts Rekt Capital <a href=\"https://twitter.com/rektcapital/status/1691734309177086389\" target=\"_blank\" rel=\"noopener nofollow\">highlights</a> the ongoing Litecoin selloff as a typical event that succeeds the coin's halving. But eventually, the price discovers a so-called \"accumulation range\" and follows it up with a sharp rebound to establish a new record high.</p><p>Historically, LTC has retraced between -73% and -83% after its Halving event to form a new Accumulation Range (black),\" argued Rekt Capital, adding: </p><blockquote>\"Thus far, LTC has retraced [by up to] -31% after its most recent Halving.\"</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/91f5a5b2-47ef-4826-a62c-93beca82810f.jpeg\"  /><figcaption style=\"text-align: center;\"><em>LTC/USD monthly price chart. Source: TradingView/Rekt Capital</em></figcaption></figure><p>In other words, if the historic cycle repeats, Litecoin will fall toward $40 in the coming months, down about 50% from the current price levels.</p><h2>Litecoin price prediction in Q3/2023</h2><p>Technicals, however, are slightly more upbeat for LTC price. Currently, Litecoin's price trends lower inside a <a href=\"https://cointelegraph.com/news/falling-wedge-breakout-propels-bitcoin-price-above-key-resistance-at-92k\">falling wedge</a> pattern, raising the prospects of a bullish reversal in the coming days or weeks.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-2024\">SEC delays set deadlines for Bitcoin ETF approval to early 2024</a></em></strong></p><p>Falling wedges form when the price fluctuates inside a range defined by two descending, converging trendlines. They resolve after the price breaks out of the range to the upside and rises toward the level at height equal to the maximum distance between the two trendlines.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/ef580b06-6792-477e-8214-4091baaf77c9.png\"  /><figcaption style=\"text-align: center;\"><em>LTC/USD daily price chart. Source: TradingView</em></figcaption></figure><p>As of Aug. 16, LTC price was eyeing a breakout above the wedge's upper trendline. Depending on the breakout point, LTC/USD can rise to anywhere between $83.25 and $95.75 by October, up 6% and 20%, respectively, from the current price levels.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-08-16T13:30:00.000Z",
    "title": "Banning ransomware payments: An attractive but dangerous idea",
    "url": "https://cointelegraph.com/magazine/banning-ransomware-payments-attractive-dangerous-idea/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/magazine-Banning-ransomware-payments-scaled.jpg\"></p><p>The U.S. and Australia are considering banning ransomware payments, but will it solve the problem, or harm people and destroy businesses?</p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-16T13:30:09.000Z",
    "title": "Linera Blockchain Raises Additional $6M for Innovative Microchain Design  Evolving from Meta’s Novi Research",
    "url": "https://cryptodaily.co.uk/2023/08/linera-blockchain-raises-additional-6m-for-innovative-microchain-design-evolving-from-metas-novi-research",
    "description": "<p>San Francisco, USA, August 16th, 2023, Chainwire</p><p>Linera reaches a total of $12M in seed funding. The new round of funding was led by Borderless Capital with contributions from a16z crypto, Laser Digital Ventures, Matrixport, Flow Traders, GSR Markets, and more</p><p>Linera, the first blockchain network scalable via microchains, has successfully closed an additional $6M round, led by Borderless Capital. Founded by Mathieu Baudet, former Meta researcher on the Novi digital payments wallet and a cryptographic protocols specialist, Linera's pioneering technology aims to bring web2 scalability to web3 applications by introducing an unlimited number of user chains powered by an elastically scalable network.</p><p>Linera has now secured a total of $12M in seed funding, with the most recent $6 million follow-on investment round led by Borderless Capital. Notable participants include Laser Digital Ventures, DFG, Cadenza, Block1, Eterna Capital, MH Ventures, Matrixport, L2IV, ArkStream, Flow Traders, GSR Markets, and Open Web Collective (OWC), alongside continued support from a16z crypto, Tribe Capital, and Cygni Capital, who participated in the initial seed round.</p>&ldquo;Among new web3 architectures emerging like the move away from a single monolithic blockchain, Linera&rsquo;s microchains are a completely new and necessary evolution. Further, Linera&rsquo;s capacity for linear scaling is designed to support millions and conceivably billions of simultaneous transactions. And, while unprecedented, this kind of performance and reliability is essential for web3 to actually scale applications like payments, messaging, trading, AI, and more to billions of users around the world,\" said Alpen Sheth, Senior Partner at Borderless Capital. \"Linera has made significant progress since we led their initial seed round last year, and we're excited to expand our support for the project. Mathieu and the Linera team have designed a truly innovative multi-chain architecture that unlocks a broader design space for developers and their end users. We can't wait to see how the ecosystem takes shape and the utilities it enables as Linera advances into the devnet and testnet phases,\" said Ali Yahya, General Partner at a16z crypto.<p>Linera recently made its initial software development kit (SDK) available for testing, targeting Rust developers. Thanks to the new funding, Linera will be expanding the team, launching a devnet and a testnet for the protocol and fostering a strategic presence in the APAC region while continuing to grow their developer academy.</p>From microchains to mass-scalable applications<p>The competition for blockspace in traditional Layer 1 blockchains, coupled with limited production rates and block sizes, creates a bottleneck during traffic peaks, leaving users outpriced or delayed, rendering the infrastructure effectively unavailable.</p>&ldquo;We&rsquo;ve taken a step back to completely redesign a blockchain infrastructure that scales from the start,&rdquo; said Mathieu Baudet, founder and CEO of Linera. &ldquo;Linera&rsquo;s unique multi-chain architecture ensures predictable performance, responsiveness, and robust security at Internet scale.\"<p>Linera empowers developers to create high-speed web3 applications used by a large number of active users in parallel, revolutionizing decentralized infrastructure for a variety of use cases, including retail payments, gaming micro-payments, messaging, proprietary trading, and blockchain bridges.</p><p>The Linera system scales by adding chains, not by increasing the size or the production rate of blocks. Its groundbreaking microchain model grants each individual user their own lightweight chains, which integrate into browser extensions or mobile devices for streamlined web3 app interactions within their wallets. During times of high demand, Linera's validators expand dynamically like elastic web services.</p><p>Linera's innovative design is rooted in the expertise that Mathieu Baudet acquired at Meta while contributing to the Libra (now Diem) blockchain and co-authoring the academic paper \"FastPay\", which laid the foundations for the Linera protocol. Bernadette Cay, Linera's COO, brings extensive experience in launching products from Google and MoPub, the mobile ad exchange acquired by Twitter.</p><p>About Linera</p><p>Linera is the first low-latency blockchain designed to scale elastically like web2 applications. Founded by Mathieu Baudet, a former Meta Novi engineer and researcher, with a PhD in cryptographic protocols, Linera revolutionizes blockchain scalability by introducing microchains, removing mempools, and minimizing validator interactions. Linera optimizes performance for web3 applications used by a large number of active users in parallel, enabling unprecedented horizontal scalability for use cases such as retail payments, gaming micro-payments, messaging, proprietary trading, and blockchain bridges.</p><p>Join us in creating the next generation of high-performance decentralized applications. Learn more at linera.io</p><p>About Borderless</p><p>Borderless is a leading investment management firm focused on Web3 technology, dedicated to supporting the next generation of innovators who are driving the development of groundbreaking technologies that will enable the creation of value without borders. Borderless comprises a team of builders, partners, and investors who adopt a long-term perspective and strive to unleash the full potential of open, community-driven networks. Since 2018, Borderless has made 200+ investments across infrastructure, business applications, and nascent cryptographic protocols, and has played an integral role in the development of some of the most significant and innovative Web3 communities.</p><p>For more information, please visit their website at borderlesscapital.io</p>ContactPR DirectorKarla VilhelemMarket Waveskarla@marketwaves.co7542154315"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-16T13:30:43.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC, ETH Hit 1-Week Lows Ahead of FOMC Minutes ",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-eth-hit-1-week-lows-ahead-of-fomc-minutes/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1104279386-4-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC, ETH Hit 1-Week Lows Ahead of FOMC Minutes \" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1104279386-4-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1104279386-4-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1104279386-4-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1104279386-4-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1104279386-4-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1104279386-4-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1104279386-4.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin neared a breakout below $29,000 on Wednesday, ahead of the release of anticipated Federal Open Market Committee (FOMC) minutes. The minutes will show the United States Fed&#x2019;s reasoning behind its last rate hike, whilst also giving guidance on its future decisions. Ethereum dropped to a one-week low. Bitcoin Bitcoin (BTC) extended recent declines on [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T13:38:55.000Z",
    "title": "FBI recovers $1.7 million in digital assets amid cryptocurrency fraud crackdown",
    "url": "https://www.cryptopolitan.com/fbi-recovers-1-7-million-in-digital-assets-amid-cryptocurrency-fraud-crackdown/",
    "description": "The Federal Bureau of Investigation (FBI) reported a major digital asset recovery between March and May, totaling around $1.7 million. This includes cryptocurrencies such as Bitcoin, Ethereum, Tether, Dai, and Monero. According to the public filing, the FBI seized the assets due to violations of multiple federal regulations. Moreover, the FBI has issued multiple warnings ... <a title=\"FBI recovers $1.7 million in digital assets amid cryptocurrency fraud crackdown\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fbi-recovers-1-7-million-in-digital-assets-amid-cryptocurrency-fraud-crackdown/\" aria-label=\"More on FBI recovers $1.7 million in digital assets amid cryptocurrency fraud crackdown\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T13:12:28.000Z",
    "title": "Coinbase gets approval to offer crypto futures in US",
    "url": "https://crypto.news/coinbase-gets-approval-to-offer-crypto-futures-in-us/",
    "description": "Crypto exchange Coinbase has received the green light from the National Futures Association (NFA) to offer crypto futures to eligible customers in the US. "
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-16T13:35:42.000Z",
    "title": "THOR’s Price Surge This Week May Be Followed by a Golden Cross",
    "url": "https://coinedition.com/thors-price-surge-this-week-may-be-followed-by-a-golden-cross/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/THOR-Price-Analysis-Where-Will-It-Go-Next-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The on-chain intelligence platform, Messari, highlighted the impressive price performance of THOR over the past week in a tweet yesterday. According to the post, the native token of THORSwap has risen nearly 300% throughout the past seven days. Since the post was published, however, the altcoin’s price has fallen more than 10% according to CoinMarketCap. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/thors-price-surge-this-week-may-be-followed-by-a-golden-cross/\">THOR’s Price Surge This Week May Be Followed by a Golden Cross</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]