[
  {
    "source": "CoinDesk",
    "date": "2023-07-14T18:27:46.000Z",
    "title": "What Ripple’s Partial XRP Win Means for Other Crypto Firms Fighting SEC",
    "url": "https://www.coindesk.com/policy/2023/07/14/what-ripples-partial-xrp-win-means-for-other-crypto-firms-fighting-sec/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Coinbase and Binance have a new precedent to cite in court – if the decision survives potential appeal. That’s no sure thing, lawyers said."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-14T18:13:40.000Z",
    "title": "Ripple’s XRP Ruling a ‘Milestone Win’ for Crypto Industry, Says J.P. Morgan",
    "url": "https://www.coindesk.com/markets/2023/07/14/ripples-xrp-ruling-a-milestone-win-for-crypto-industry-says-jp-morgan/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A summary judgment partially in favor of payments network Ripple represents a milestone win for the crypto industry and provides legal clarity as to what does and doesn’t represent a security, J.P. Morgan wrote in a research note Friday."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-14T18:12:09.000Z",
    "title": "XRP Trading Volume Surges 1,351% as Major Crypto Exchanges Embrace the Token",
    "url": "https://www.coindesk.com/markets/2023/07/14/xrp-trading-volume-surges-1351-as-major-crypto-exchanges-embrace-the-token/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The spike in trading activity came after a partial win in a lawsuit against the SEC."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-14T18:22:05.000Z",
    "title": "Dr. Disrespect's Shooter 'Deadrop' Gets Bigger and Better",
    "url": "https://decrypt.co/148604/dr-disrespect-shooter-deadrop-expands-snapshot-vi-release",
    "description": "PREVIEW: Movement still feels sluggish, but Deadrop's new Snapshot VI build shows progress elsewhere while expanding the experience."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-14T18:21:00.000Z",
    "title": "Dr. Disrespect's 'Deadrop': Early Access Gameplay From Snapshot VI",
    "url": "https://decrypt.co/videos/interviews/8l21EHoa/dr-disrespects-deadrop-early-access-gameplay-from-snapshot-vi",
    "description": "Decrypt's Kate Irwin playtests Dr. Disrespect and Midnight Society's first-person shooter Deadrop and shares the latest game updates, as well as her opinions on the game in development. Currently, Deadrop offers Polygon Founders Pass NFTs with no other crypto plans revealed just yet."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T18:10:07.000Z",
    "title": "Crypto lender Geist Finance shuts down permanently over Multichain hack",
    "url": "https://cointelegraph.com/news/fantom-based-lender-geist-finance-shuts-down-permanently-over-multichain-hack",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/9be0ad02-e866-4b62-b73a-d092314320ad.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The $29 million TVL lending platform is shutting down because its oracles are misreporting Multichain token values after the exploit.</p>\n                    <p><p>Lending protocol Geist Finance is shutting down permanently due to losses from the Multichain exploit, according to a July 14 social media post from the app’s development team. Geist contracts were been paused on July 6, then resumed in “withdraw and repay only” mode on July 9. The latest post confirms the team does not plan to reopen lending and borrowing on Geist.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/2 After confirmation from Multichain that the funds will not be recovered, we are announcing that Geist will not reopen. Because Chainlink oracles are tracking the value of real USDC, USDT, WBTC or ETH, they are not aware of the real value of Multichain assets.</p>&mdash; Geist Finance (@GeistFinance) <a href=\"https://twitter.com/GeistFinance/status/1679827762444378114?ref_src=twsrc%5Etfw\">July 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Geist is a lending protocol running on the Fantom network. It had over $29 million worth of crypto assets locked in its contracts before the Multichain hack. Before the hack, Geist allowed users to borrow, lend, or use bridged tokens from the Multichain platform as collateral, including bridged versions of US Dollar Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>), Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>), Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). It used Chainlink oracles to track the prices of these assets to determine their collateral and loan values.</p><p>According to the post, these oracles have stopped producing reliable information. They are now listing the values of the non-bridged or “real” versions of each coin, which are more than four times the value of their Multichain derivatives, as the team explained:</p><blockquote>“Because Chainlink oracles are tracking the value of real USDC, USDT, WBTC or ETH, they are not aware of the real value of Multichain assets. Those assets are currently trading at around 22% of their real value.”</blockquote><p>This makes it “impossible” to re-enable lending, as doing so would result in bad debt for holders of non-multichain coins such as Magic Internet Money (MIM) or Fantom (FTM), the team stated. As a result, Geist will not be able to reopen.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/circle-tether-freezes-over-65m-in-assets-transferred-from-multichain\"><strong>Circle, Tether freezes over $65M in assets transferred from Multichain</strong></a></em></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/1771e17c-3b47-4546-8a69-cbc7a49d91dc.png\"  /><figcaption style=\"text-align: center;\"><em>Geist Finance interface in “withdraw and repay only” mode. Source: Geist Finance</em></figcaption></figure><p>The team clarified they are not blaming Chainlink oracles for Geist's closure, as these oracles “worked as they should.” Instead, “Nobody is to blame except @MultichainOrg here.”</p><p>Blockchain analytics experts first reported the <a href=\"https://cointelegraph.com/news/multichain-mpc-bridge-sees-millions-in-outflows-exploit-feared\">Multichain hack</a> on July 7. Over $100 million had been withdrawn from the Ethereum side of Multichain bridges, including those for Dogechain, Fantom, and Moonriver. The Multichain team called the transactions “abnormal” and warned users to stop using the protocol. However, they stopped short of calling it a hack or exploit.</p><p>On July 11, on-chain sleuth and Twitter user Spreek reported that an unknown individual was <a href=\"https://cointelegraph.com/news/multichain-executor-has-been-draining-anyswap-tokens-report\">draining funds from the protocol</a> and sending them to fresh wallet addresses using a fee-based exploit. </p><p>On July 14, the Multichain team confirmed that the withdrawals from July 7 <a href=\"https://cointelegraph.com/news/multichain-stops-operations-over-lack-of-funds\">had been the result of a hack</a>. The network had been storing all shards of its private keys in a “cloud server account” under the sole control of the team’s CEO, who was arrested by Chinese authorities. This cloud server account was later accessed by someone and used to drain funds from the protocol. The team previously <a href=\"https://docs.multichain.org/getting-started/introduction\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> in the protocol’s documents that no single server had access to all of the shards of a key.</p><p>According to the July 14 post, the July 11 fee-based attack was a counter-exploit initiated by the CEO’s sister at the behest of the Multichain team in an attempt to recover funds. The sister was later arrested, and the status of the assets she recovered is “uncertain.”</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T18:34:49.000Z",
    "title": "How An Australian Entrepreneur’s ChatMap Significantly Dominates ChatGPT Plugin Store and AI Navigation",
    "url": "https://www.cryptopolitan.com/australian-entrepreneur-ai-chatbot-for-maps/",
    "description": "Silicon Valley-based AI startup MixerBox, led by Taiwanese-Australian entrepreneur John Lai, has taken the lead in the ChatGPT Plugin Store by introducing a groundbreaking plugin called MixerBox ChatMap. This innovative plugin integrates the Google Maps API to revolutionize navigation in the age of AI, making it the world&#8217;s first AI chatbot for maps. With this ... <a title=\"How An Australian Entrepreneur&#8217;s ChatMap Significantly Dominates ChatGPT Plugin Store and AI Navigation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/australian-entrepreneur-ai-chatbot-for-maps/\" aria-label=\"More on How An Australian Entrepreneur&#8217;s ChatMap Significantly Dominates ChatGPT Plugin Store and AI Navigation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T18:32:46.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T18:21:47.000Z",
    "title": "SEC acknowledges BlackRock and Fidelity Bitcoin ETF applications ",
    "url": "https://www.cryptopolitan.com/sec-acknowledges-blackrock-and-fidelity-bitcoin-etf-applications/",
    "description": "The US Securities and Exchange Commission (SEC) has acknowledged the Spot Bitcoin ETF applications submitted by asset management giants BlackRock and Fidelity, along with several other firms, according to a report by Bloomberg reporter James Seyffart.  While this acknowledgment does not indicate impending approval or rejection, it marks a significant milestone in the application process, ... <a title=\"SEC acknowledges BlackRock and Fidelity Bitcoin ETF applications \" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-acknowledges-blackrock-and-fidelity-bitcoin-etf-applications/\" aria-label=\"More on SEC acknowledges BlackRock and Fidelity Bitcoin ETF applications \">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T18:17:36.000Z",
    "title": "Everything to know about Australia’s first-ever Bitcoin ETF",
    "url": "https://www.cryptopolitan.com/all-about-australia-first-ever-bitcoin-etf/",
    "description": "The possibility of Australia&#8217;s first fully accredited Bitcoin Exchange-Traded Fund (ETF) looms closer as an updated application for such a venture is lodged with the Australian Securities Exchange (ASX). The innovative Bitcoin-focused investment management firm, Monochrome, in collaboration with Vasco Trustees, aims to break new ground, providing regulated exposure to Bitcoin for retail investors through ... <a title=\"Everything to know about Australia&#8217;s first-ever Bitcoin ETF\" class=\"read-more\" href=\"https://www.cryptopolitan.com/all-about-australia-first-ever-bitcoin-etf/\" aria-label=\"More on Everything to know about Australia&#8217;s first-ever Bitcoin ETF\">Read more</a>"
  }
]