[
  {
    "source": "Crypto Daily",
    "date": "2024-03-30T17:15:13.000Z",
    "title": "Willy Woo Believes Bottom Is in on Bitcoin’s Latest Pullback: Milei Moneda Ready for an Explosive Run",
    "url": "https://cryptodaily.co.uk/2024/03/willy-woo-believes-bottom-is-in-on-bitcoins-latest-pullback-milei-moneda-ready-for-an-explosive-run",
    "description": "Willy Woo's analysis indicates that the bottom is in for Bitcoin's (BTC) recent pullback, which has boosted optimism in the crypto market. One project looking to benefit is Milei Moneda ($MEDA)."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-30T17:24:11.000Z",
    "title": "MetaWin Launches New Base and Arbitrum Layer 2-Powered Swap System, Boasting 2-Second Payment Speeds and Half a Cent Gas Fees",
    "url": "https://cryptodaily.co.uk/2024/03/metawin-launches-new-base-and-arbitrum-layer-2-powered-swap-system-boasting-2-second-payment-speeds-and-half-a-cent-gas-fees",
    "description": "MetaWin Launches New Base and Arbitrum Layer 2-Powered Swap System, Boasting 2-Second Payment Speeds and Half a Cent Gas Fees"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-30T17:33:43.000Z",
    "title": "Federal Reserve optimism clashes with investor concerns as Bitcoin holds firm",
    "url": "https://www.cryptopolitan.com/federal-reserve-optimism-clash-with-investor/",
    "description": "Bitcoin has held ground during US economic uncertainty, and its price is flat despite mixed signals in the financial markets and among policymakers. Federal Reserve Chairman Jerome Powell has been pretty positive, in contradistinction with concerns from investors ranging from potential economic turbulence and signal divergence in sentiment at various levels of the financial community. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-30T17:29:08.000Z",
    "title": "AI-Powered Application in Development to Detect Tuberculosis in Kenya",
    "url": "https://www.cryptopolitan.com/development-to-detect-tuberculosis-in-kenya/",
    "description": "In a radical move, scientists at the Kenya Medical Research Institution (KEMRI) are leading the proactive invention of a computerized application where AI can diagnose tuberculosis (TB) and other respiratory disorders. The project will be headed by Dr. Videlis Nduba and his fellow healthcare professionals who are pushing for a revolution in healthcare technology. This [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-30T17:24:56.000Z",
    "title": "Breakout Crypto – BlockDAG Attracts Investors for Potential 5000x ROI Despite Catcoin and Cardano Bull Run",
    "url": "https://nulltx.com/breakout-crypto-blockdag-attracts-investors-for-potential-5000x-roi-despite-catcoin-and-cardano-bull-run/",
    "description": "Investors are closely watching Cardano for signs of a potential bull run, with metrics like Mean Dollar Invested Age (MDIA) to gauge market sentiment. Meanwhile, Catcoin crypto is emerging as a strong contender among meme coins, with analysts predicting it will outperform its competitors in 2024. With its focus on [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-30T17:22:43.000Z",
    "title": "Sam Bankman-Fried inspired meme coin crashed 90% after reaching 1 cent",
    "url": "https://crypto.news/sam-bankman-fried-inspired-meme-coin-1-cent-crashes/",
    "description": "When Sam Bankman-Fried was sentenced to 25 years in prison, one developer cashed in on the buzz with Sam Baseman Fraud."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-30T17:11:28.000Z",
    "title": "Fezoo aims to surpass OKX; Litecoin, Ethereum, holders join presale ",
    "url": "https://crypto.news/fezoo-aims-to-surpass-okx-litecoin-ethereum-holders-join-presale/",
    "description": "Fezoo (FEZ) is attracting huge interest from ETH and LTC holders as it aims to surpass OKX and others.#partnercontent"
  }
]