[
  {
    "source": "Cointelegraph",
    "date": "2023-06-17T09:16:16.000Z",
    "title": "5 AI tools for learning and research",
    "url": "https://cointelegraph.com/news/5-ai-tools-for-learning-and-research",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/dd8685d5-6f6b-4d73-bab7-44dc14627f3c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Supercharge your learning and research capabilities with AI tools, enabling you to gain a competitive edge and reach new levels of understanding.</p>\n                    <p><p>AI tools are revolutionizing learning and research in today’s digital age by providing sophisticated capabilities and effective solutions. These tools make use of artificial intelligence to <a href=\"https://cointelegraph.com/news/5-ai-tools-for-summarizing-a-research-paper\">speed up various tasks</a>, increase output and offer insightful data. </p><p>Consensus, QuillBot, Gradescope, Elicit and Semantic Scholar are five well-known AI tools that are frequently used in the learning and research fields. </p><h2>Consensus</h2><p>The goal of the <a href=\"https://consensus.app/\" target=\"_blank\" rel=\"noopener nofollow\">Consensus AI</a> search engine is to democratize expert knowledge by making study findings on a range of subjects easily accessible. This cutting-edge engine, which runs on GPT-4, uses machine learning and <a href=\"https://cointelegraph.com/news/5-natural-language-processing-libraries-to-use\">natural language processing (NLP)</a> to analyze and evaluate web content. </p><p>When you pose the “right questions,” an additional AI model examines publications and gathers pertinent data to respond to your inquiry. The phrase “right questions” refers to inquiries that lead to findings that are well-supported, as shown by a confidence level based on the quantity and caliber of sources used to support the hypothesis.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/d9f71a05-25b5-4bb8-aae1-4b00bc638f2f.jpg\"  /></figure><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/ac2756c5-3f95-4bdf-bb49-6bf731106bb8.jpg\"  /></figure><h2>QuillBot</h2><p><a href=\"https://quillbot.com/\" target=\"_blank\" rel=\"noopener nofollow\">QuillBot</a> is an <a href=\"https://cointelegraph.com/news/a-brief-history-of-artificial-intelligence\">artificial intelligence (AI)</a> writing assistant that helps people create high-quality content. It uses NLP algorithms to improve grammar and style, rewrite and paraphrase sentences, and increase the coherence of the work as a whole. </p><p>QuillBot’s capacity to paraphrase and restate text is one of its main strengths. This might be especially useful if you wish to keep your research work original and free of plagiarism while using data from previous sources. </p><p>QuillBot can also summarize a research paper and offer alternate wording and phrase constructions to assist you in putting your thoughts into your own words. QuillBot can help you add variety to your writing by recommending different sentence constructions. This feature can improve your research papers readability and flow, which will engage readers more.</p><p>Additionally, ChatGPT and QuillBot can be used together. To utilize both ChatGPT and QuillBot simultaneously, start with the output from ChatGPT and then transfer it to QuillBot for further refinement.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/ff1a0f05-041d-488c-8f9c-218fa639b3b0.png\"  /></figure><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/100477ab-8dea-4280-9adc-4782ddd2a911.png\"  /></figure><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/a5efc2cd-fc2d-45f2-9217-fb5fbca6c190.png\"  /></figure><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/bd2d1ebb-5071-4983-93d3-a4e3a97db22b.png\"  /></figure><h2>Gradescope</h2><p>Widely used in educational institutions, <a href=\"https://www.gradescope.com/\" target=\"_blank\" rel=\"noopener nofollow\">Gradescope</a> is an AI-powered grading and feedback tool. The time and effort needed for instructors to grade assignments, exams and coding projects are greatly reduced by automating the process. Its machine-learning algorithms can decipher code, recognize handwriting and provide students with in-depth feedback.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/how-to-use-chatgpt-to-learn-a-language\"><strong><em>How to use ChatGPT to learn a language</em></strong></a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/10e7b203-928d-4511-a3d5-f5d8372df58d.jpg\"  /></figure><h2>Elicit</h2><p><a href=\"https://elicit.org/\" target=\"_blank\" rel=\"noopener nofollow\">Elicit</a> is an AI-driven research platform that makes it simpler to gather and analyze data. It uses <a href=\"https://cointelegraph.com/news/5-real-world-applications-of-natural-language-processing-nlp\">NLP approaches</a> to glean insightful information from unstructured data, including polls, interviews and social media posts. Researchers can quickly analyze huge amounts of text with Elicit to find trends, patterns and sentiment.</p><p>Using the user-friendly Elicit interface, researchers can simply design personalized surveys and distribute them to specific participants. To ensure correct and pertinent data collection, the tool includes sophisticated features, including branching, answer validation and skip logic. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/c31ca1bd-4984-4b9b-9c01-1e49bf2cd68d.jpg\"  /></figure><p>In order to help academics properly analyze and interpret data, Elicit also offers real-time analytics and visualizations. Elicit streamlines the research process, saves time and improves data collection for researchers in a variety of subjects thanks to its user-friendly design and powerful capabilities.</p><h2>Semantic Scholar</h2><p><a href=\"https://www.semanticscholar.org/\" target=\"_blank\" rel=\"noopener nofollow\">Semantic Scholar</a> is an AI-powered academic search engine that prioritizes scientific content. It analyzes research papers, extracts crucial information, and generates recommendations that are pertinent to the context using <a href=\"https://cointelegraph.com/news/5-key-features-of-machine-learning\">machine learning</a> and NLP techniques.</p><p>Researchers can use Semantic Scholar to research related works, spot new research trends and keep up with the most recent advancements in their fields.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/5-free-artificial-intelligence-courses-and-certifications\"><strong><em>5 free artificial intelligence courses and certifications</em></strong></a></p><h2>Striking a balance: Harnessing AI in research responsibly</h2><p>It’s crucial to keep moral standards in mind and prevent plagiarism when employing AI research tools. The use of another person’s words, ideas or works without giving due credit or permission is known as plagiarism. While using AI research tools, one may follow the guidelines below to prevent plagiarism and uphold ethical standards:</p><ul><li>Understand the purpose of the AI research tool.</li><li>Attribute sources properly.</li><li>Paraphrase and synthesize information.</li><li>Cross-verify information from multiple sources.</li><li>Check for copyright restrictions.</li><li>Review and edit AI-generated content.</li><li>Seek ethical AI tools.</li></ul><p>Though AI research tools might be beneficial for improving your research and writing processes, it is important to uphold academic integrity and observe ethical standards. Always make an effort to give fair credit to others and make sure that your work accurately reflects your own thoughts and understanding.</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-17T09:11:08.000Z",
    "title": "Why Blackrock Bitcoin spot ETF is a real worry",
    "url": "https://cryptodaily.co.uk/2023/06/why-blackrock-bitcoin-spot-etf-is-a-real-worry",
    "description": "<p>With Blackrock&rsquo;s recent spot ETF application many Bitcoincoiners are elated. However, should they be worried about this particular move by the $10 trillion asset manager?</p>\n\n<p>&ldquo;I have not heard from any one client looking to buy a cryptocurrency at this time. Right now I can tell you that Worldwide, I have not heard from one client that said I need to be in this.</p>\n\n<p>Larry Fink.</p>\n<p>The Blackrock CEO did go on to say back in 2018 that his company would look back into crypto when it became more &ldquo;legitimised&rdquo;. Nearly 5 years later Blackrock is doing exactly that - but with crypto being singled out for extremely rough treatment from the SEC it could hardly be said that crypto has reached the legitimacy stage.</p>\n<p>When such a massive and powerful institutional entity as Blackrock files an application for a Bitcoin ETF, when so many have failed, it might be guessed that there will have been some quiet conversations behind the scenes, and that some plan could be in place to exert control over the premier crypto asset.</p>\nThe Blackrock ESG commitment\n<p>Larry Fink has said that he and his company are committed to pushing its ESG agenda.&nbsp;</p>\n\n<p>&ldquo;You have to force behaviours, and at Blackrock we are forcing behaviours&rdquo;</p>\n\n<p>With Fink serving as a Trustee on the board of Klaus Schwab&rsquo;s World Economic Forum, you can be sure that this application for a Bitcoin Spot ETF will somehow play along with the ESG narrative.&nbsp;</p>\nHow Blackrock could potentially take control\n<p>An extremely thought-provoking tweet by @anilsaidso posits how Blackrock could in one fail swoop take control of Bitcoin.&nbsp;</p>\n\n<p dir=\"ltr\" lang=\"en\">A hidden gem in the BlackRock ETF filing.#GetForked https://t.co/tER6xxZPui pic.twitter.com/Qdt8BZ2OEZ</p>\n&mdash; Anil ⚡ (@anilsaidso) June 15, 2023\n<p>\n\n</p>\n<p>Hidden within the filing is what Blackrock would be able to do in the event of a Bitcoin hard fork. This is explosive beyond belief. Bitcoin has already been through hard forks in its history, and thus far the decentralised nature of Bitcoin has always won through, and forks of the original network have not been successful.</p>\n<p>What Blackrock is contemplating in the event of a hard fork is that it would get to choose which fork to go with, thereby deciding the future of Bitcoin. And given its love for the ESG narrative, what if Blackrock itself or one of its &lsquo;associates&rsquo; proposed a PoS fork, and then all the institutions with backing of regulators and governments went with this fork and left the original PoW fork in its wake?</p>\nGold and silver were controlled \n<p>Government and institutions were able to use subterfuge to squash the price of gold and silver over many decades so that they would not detract from the power of the dollar. Big banks used massive short selling whenever the prices took off, and were able to build huge positions in the metals, especially J P Morgan.</p>\n<p>Bitcoin is very similar to gold and silver in that it is sound money, meaning that it can&rsquo;t be debased by governments in order to backstop banks or pay for wars. Look for the Blackrock Bitcoin Spot ETF to be approved by an anti-Bitcoin SEC, and then watch what happens very closely.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-17T09:23:37.000Z",
    "title": "PEPE Jumps Nearly 10% In 24 Hours, Sparking Speculation Of A New Rally",
    "url": "https://www.newsbtc.com/news/pepe-jumps-nearly-10-in-24-hours-sparking-speculation-of-a-new-rally/",
    "description": "Pepe (PEPE) may seize the opportunity to rally in the face of an ongoing volatility and price swings in the crypto market. With Bitcoin (BTC) recently dipping below $25,000 before swiftly rebounding to $26,000, the market has been in a state of flux. Such fluctuations often create an environment ripe for alternative cryptocurrencies to make their mark, and PEPE could be poised to do just that. PEPE’s rally comes at a time when investors are seeking alternative options beyond the dominant cryptocurrencies. While Bitcoin continues to dominate the market, its price movements can have a cascading effect on other digital assets.  That being said, can PEPE capitalize on Bitcoin&#8217;s volatility and secure its own rally to attract investors seeking new opportunities in the crypto space? PEPE Price Recovery Potential In recent market developments, PEPE has witnessed a notable rally, as reflected in its current price of $0.0000009779 on CoinMarketCap. This surge represents an impressive 8.5% increase within a 24-hour period. However, it&#8217;s important to note that this upward momentum follows a preceding seven-day slump of 7.96%, underscoring the inherent volatility that characterizes the cryptocurrency market. PEPE showing bullish signs. Source: CoinMarketCap The price of PEPE has undergone substantial fluctuations since early May, resulting in a significant decline of over 50% in its overall value. This decline has caused a shift in the market structure, signaling a bearish trend as sellers capitalized on shorting opportunities when the support levels at $0.00000162 and $0.00000115 were breached. PEPE price in the green. Source: CoinMarketCap Despite the bearish downtrend, recent price activity has hinted at the potential for a new bull run. Notably, the crucial support level at $0.00000094 demonstrated resilience in halting the downward movement.  Related Reading: Polygon (MATIC) Sees Surge In Whale Buying Despite US Regulatory Pressure The ability of the $0.00000094 support level to withstand selling pressure signifies buying interest at this level, indicating a potential for a renewed bullish sentiment in the market. Bitcoin retakes the $26K territory on the weekend chart: TradingView.com What PEPE Needs To Sustain Its Rally As PEPE aims to maintain its rally and build on the recent positive momentum, several crucial milestones need to be achieved. According to a recent PEPE price report, a bullish surge in value would require breaking and closing above the trendline located around the $0.00000100 price zone. Related Reading: Cardano (ADA) Price Sheds 19% As Bearish Sentiment Looms Large This trendline acts as a significant resistance level that needs to be surpassed for the cryptocurrency to continue its upward trajectory. Meanwhile, the meme token may be due for a recovery bounce given that PEPE has been aggressively sold off recently. This possibility is made more likely by the fact that PEPE&#8217;s 24-hour trading volume has increased from just over $50 million earlier this week to more than $100 million at the time of writing. Featured image from ArtStation"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-17T09:30:35.000Z",
    "title": "Exploring New Worlds with TMS Network (TMSN), Polygon (MATIC) and Solana (SOL) In Dark Ages",
    "url": "https://www.crypto-news-flash.com/exploring-new-worlds-with-tms-network-tmsn-polygon-matic-and-solana-sol-in-dark-ages/?utm_source=rss&utm_medium=rss&utm_campaign=exploring-new-worlds-with-tms-network-tmsn-polygon-matic-and-solana-sol-in-dark-ages",
    "description": "Where the exploration of new worlds was once confined to the realms of science fiction, TMS Network (TMSN), a DeFi token in phase 4 of its presale, is at the forefront of exploration and new beginnings. All this while the likes of Polygon (MATIC) and Solana (SOL) appear to be heading back to the Dark [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-17T09:36:00.000Z",
    "title": "Solana NFT Transactions Surpass That Of Ethereum And Polygon",
    "url": "https://coinedition.com/solana-nft-transactions-surpass-that-of-ethereum-and-polygon/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/SOLANA-5-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Solana NFT Transactions Surpass That Of Ethereum And Polygon\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/SOLANA-5-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-5-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/SOLANA-5.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The crypto research and analytics platform Messari shared a post on Twitter earlier today sharing that Solana (SOL) has experienced a notable increase in its daily NFT transactions. According to the post,&#160; Solana’s NFT transactions have doubled over the past 30 days alone. Messari added in the post that Solana’s NFT success can be attributed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/solana-nft-transactions-surpass-that-of-ethereum-and-polygon/\">Solana NFT Transactions Surpass That Of Ethereum And Polygon</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-17T09:15:05.000Z",
    "title": "Top Crypto Analyst Warns Bitcoin (BTC) ‘Very Very Likely’ To Plummet – Here Are His Targets",
    "url": "https://dailyhodl.com/2023/06/17/top-crypto-analyst-warns-bitcoin-btc-very-very-likely-to-plummet-here-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Very-Very-Likely-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Very-Very-Likely-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Very-Very-Likely-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Very-Very-Likely-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Very-Very-Likely-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Very-Very-Likely-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Very-Very-Likely-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst and trader is expressing bearish sentiment on Bitcoin (BTC) as the crypto king continues to consolidate. The pseudonymous analyst known as Pentoshi tells his 693,000 Twitter followers that Bitcoin could drop by as much as 38% from the current price if BTC loses its immediate support. &#8220;BTC this area [has] [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/17/top-crypto-analyst-warns-bitcoin-btc-very-very-likely-to-plummet-here-are-his-targets/\">Top Crypto Analyst Warns Bitcoin (BTC) ‘Very Very Likely’ To Plummet – Here Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]