[
  {
    "source": "CryptoSlate",
    "date": "2023-08-23T04:00:20.000Z",
    "title": "Historic post-Jackson Hole S&P surges prompt heightened expectations for market responses",
    "url": "https://cryptoslate.com/insights/historic-post-jackson-hole-sp-surges-prompt-heightened-expectations-for-market-responses/",
    "description": "<p>Quick Take A historical analysis of the S&#38;P index reveals significant market activity after the annual Jackson Hole meeting, which could have implications for the cryptocurrency and blockchain sectors. This comes to light via a comprehensive chart constructed by Bloomberg Intelligence and put together by Markets &#38; Mayhem, indicating a consistent pattern of stock price [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/historic-post-jackson-hole-sp-surges-prompt-heightened-expectations-for-market-responses/\">Historic post-Jackson Hole S&#038;P surges prompt heightened expectations for market responses</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T04:06:47.000Z",
    "title": "Ethereum Price Grinds Lower As Bears Target Fresh Low Below $1,550",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-grinds-lower-1550/",
    "description": "Ethereum price is facing many hurdles below the $1,700 resistance against the US Dollar. ETH could extend its decline below the $1,580 and $1,550 levels. Ethereum is still struggling to recover above the $1,700 and $1,720 levels. The price is trading below $1,680 and the 100-hourly Simple Moving Average. There is a major bearish trend line forming with resistance near $1,665 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start another decline if it breaks the $1,580 support in the near term. Ethereum Price Faces Uphill Task Ethereum’s price failed to climb above the $1,700 resistance zone. ETH started a fresh decline below the $1,650 and $1,620 levels, similar to Bitcoin. The price even spiked below the $1,600 support and tested $1,580. A low was formed near $1,580 and the price is now attempting a fresh recovery. There was a move above the $1,600 level. The price is now testing the 50% Fib retracement level of the downward move from the $1,693 swing high to the $1,580 low. Ether is also trading below $1,680 and the 100-hourly Simple Moving Average. Besides, there is a major bearish trend line forming with resistance near $1,665 on the hourly chart of ETH/USD. On the upside, the price might face resistance near the $1,650 level. It is close to the 61.8% Fib retracement level of the downward move from the $1,693 swing high to the $1,580 low. The next resistance is near $1,665 or the 100-hourly Simple Moving Average or the trend line. Source: ETHUSD on TradingView.com The main barrier is still near the $1,700 zone. A close above the $1,700 level could start a decent increase in the near term. The next major resistance is near the $1,750 level. Any more gains might send the price toward the $1,820 resistance. Another Drop in ETH? If Ethereum fails to clear the $1,665 resistance, it could start another decline. Initial support on the downside is near the $1,600 level. The first major support is near the $1,580 zone. If there is a downside break below $1,580, there could be more losses. The next major support is near the $1,550 support level. Any more losses might send the price toward the $1,520 level or even to a new low below $1,500. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,580 Major Resistance Level – $1,665"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T04:00:06.000Z",
    "title": "XRP Bears Reverse All SEC Ruling Gains, What’s Next?",
    "url": "https://www.newsbtc.com/ripple-2/xrp-bears-reverse-all-sec-ruling-gains-whats-next/",
    "description": "Trading at around $0.51, XRP bears have fully reversed all gains posted on July 13, looking at price action in the daily chart. Although bulls are optimistic, it hasn&#8217;t been smooth sailing for these traders, and bears have been active, shaving gains and putting buyers on the backpedal. Related Reading: Optimism (OP) Continues Market Recovery As Network Whales Triple Holdings As it is, the path of least resistance, looking at the price action from 2023 peaks to date, is southwards.  XRP Bears Are Unyielding Presently, XRP is down 45% from July 2023 highs. Though prices are higher relative to last week&#8217;s lows, the coin remains under immense selling pressure. Looking at price charts, XRP prices are trending inside the August 17 trade range, a bear candlestick, suggesting that sellers have the upper hand unless there is a significant spike above $0.60 with rising volumes. This could ignite demand, lift sentiment, and allow buyers to resume the uptrend. The ruling by Judge Analisa Torres on July 13 went against the United States Securities and Exchange Commission&#8217;s (SEC) claims that XRP is a security. In late 2020, the SEC alleged that Ripple, the blockchain company that uses XRP in one of their payment solutions, raised billions by selling the token, violating securities laws. Ripple&#8217;s executives, including Brad Garlinghouse, were also sued. Last month&#8217;s landmark ruling, in favor of Ripple and its executives, reignited demand, but the momentum appears to be fizzling since bears have completely peeled back gains. What&#8217;s Next For XRP? According to coin trackers, XRP has a market cap of $27 billion and is technically the fourth largest cryptocurrency excluding Tether (USDT), when writing on August 22. The coin is more liquid than Cardano, Solana, and Dogecoin at this valuation.  It is only trailing Ethereum, Bitcoin, and BNB. Its gap with BNB is narrowing to around $5 billion. The woes around Binance, the world&#8217;s largest crypto exchange, with regulators and banks, especially in the United States, could heap more pressure on BNB. In that way, the coin may drop in valuation, allowing XRP to be the third-largest network in the world. Related Reading: Optimism (OP) Continues Market Recovery As Network Whales Triple Holdings While price action in the daily chart predominantly points to bears, the recent bounce from lower prices after the dump on August 17 may signal strength. Whether buyers will build on this development and resume the uptrend in the direction of the July 13 bar remains uncertain. What&#8217;s also clear is that trading volumes are relatively low compared to the wide-ranging bar of mid-July that still shapes the current preview. Feature image from Canva, chart from TradingView"
  }
]