[
  {
    "source": "Cointelegraph",
    "date": "2024-01-08T19:56:16.000Z",
    "title": " AI trends in 2024: Consumers hate machine-generated art, love automated shopping experiences ",
    "url": "https://cointelegraph.com/news/ai-trends-2024-consumers-hate-machine-generated-art-artificial-intelligence-love-automated-shopping-experiences",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMTQwNDI4MzMtYzA3NS00NmJkLWJlMjYtNGM4ODY3ZWEyOTBkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Magic gathers a chorus of boos after backtracking a denial over the use of AI-generated art while an IBM survey finds widespread discontent amongst shoppers.</p>\n                    <p><p>Wizards of the Coast, publishers of the popular Dungeons &amp; Dragons roleplaying game and Magic: The Gathering collectible card game, can’t seem to get out of its own way when it comes to experimenting with artificial intelligence (AI) generated art.</p><p>Meanwhile, IBM’s taking a different approach to soliciting user feedback: a good old fashioned survey. In its latest, Big Blue discovers “widespread discontent in retail experiences” and significant consumer interest in AI solutions for retail.</p><p>After fans recently accused the company of passing off AI-generated art as human work in a recent advertisement for its Magic: The Gathering game the company denied doing so.</p><p><a href=\"https://cointelegraph.com/news/ai-trends-2024-consumers-hate-machine-generated-art-artificial-intelligence-love-automated-shopping-experiences\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-08T19:55:57.000Z",
    "title": " Bitcoin price rallies past $47K as spot BTC ETF deadline approaches ",
    "url": "https://cointelegraph.com/news/bitcoin-price-rallies-past-47k-as-spot-btc-etf-deadline-approaches",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNDFlYzdlNDUtM2RlOS00Y2Q0LTg5MDUtN2MzOTU2MDc4OWQ1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin price hits a new multi-year high above $47,000 as market participants show their excitement over institutional investors’ deepening involvement with BTC. </p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price has broken through $47,000 for the first time since April 2022 as the deadline for the United States Securities and Exchange Commission (SEC) <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-issuers-file-s1-filings-as-expected\">approval of spot Bitcoin ETFs</a> draws near.</p><p>Bitcoin climbed rapidly from a price of $44,000 on Jan. 8, surging more than 6.5% in the last 24 hours and 177% over the last twelve months, to hit a year-to-date high at $47,284 according to data from CoinMarketCap. </p><p>Bitcoin's price performance comes as the market <a href=\"https://cointelegraph.com/news/countdown-us-spot-etf-5-things-to-know-bitcoin-this-week\">readies</a> for the <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-issuers-file-s1-filings-as-expected\">SEC’s potential approval</a> of one or several of the 14 outstanding applications for a spot Bitcoin ETF product,with Bloomberg analysts predicting a decision as early as Jan. 10. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-rallies-past-47k-as-spot-btc-etf-deadline-approaches\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-08T20:05:05.000Z",
    "title": "Bonk’s 70% drop highlights the unpredictability of memecoin investments",
    "url": "https://www.cryptopolitan.com/bonks-70-drop-highlights-the-unpredictabe/",
    "description": "The Solana-based memecoin, Bonk (BONK), has drastically declined in price, plunging over 70% from its all-time high achieved in December 2023.&#160; This abrupt drop follows a remarkable run throughout 2023 when Bonk recorded more than 11,000% gains and secured listings on major cryptocurrency exchanges. Memecoin market takes a hit as top Solana memecoins suffer losses [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-08T20:00:22.000Z",
    "title": "Aptos Price Prediction for 2024 – 2033: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2024-2033 As we venture into 2024 to 2033, the decade promises to be a critical period for Aptos as it strives to establish itself as a significant blockchain platform. The rapidly changing market dynamics, technological advancements, and evolving adoption trends will undoubtedly shape Aptos’s path. Against this backdrop, investors and stakeholders are [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-08T19:54:15.000Z",
    "title": "Bitcoin-based funds lead inflows as Spot Bitcoin ETF approval looms",
    "url": "https://www.cryptopolitan.com/bitcoin-based-funds-lead-inflows-as-spot/",
    "description": "Crypto investment products have started the year 2024 on a strong note, with a total of $151 million in inflows recorded during the first week, according to a report.&#160; Most of these inflows were dominated by Bitcoin-based funds, which added a substantial $113 million to their assets under management. Bitcoin funds take the lead The [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-08T19:46:34.000Z",
    "title": "ApeCoin Price Prediction 2024-2033: Will APE Break $2 Resistance?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2024-2033 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-08T19:45:56.000Z",
    "title": "DMAIL enhances communication with Internet Computer (ICP)",
    "url": "https://www.cryptopolitan.com/dmail-welcomes-internet-computer-icp/",
    "description": "Revolutionizing the digital landscape, Dmail has recently integrated with Internet Computer Protocol (ICP), a dynamic innovation by DFINITY Foundation. This integration, far from being a casual tech update, represents a seismic shift in how we perceive and interact with blockchain technology. Dmail&#8217;s decision to meld with ICP isn&#8217;t just tech gossip; it&#8217;s a bold stride [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-08T19:41:04.000Z",
    "title": "Cathie Wood’s ARK investment trims Coinbase holdings to maintain portfolio balance",
    "url": "https://www.cryptopolitan.com/cathie-woods-ark-investment-trims-coinbase/",
    "description": "ARK Invest, the renowned investment firm led by Cathie Wood, has made another strategic move in its ongoing effort to rebalance its exchange-traded funds (ETFs). The firm recently sold approximately $20.6 million worth of Coinbase (COIN) shares across three ETFs.&#160; This move aligns with ARK Invest&#8217;s target of ensuring that no individual stock surpasses a [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-08T20:00:41.000Z",
    "title": "Was Solana A Q4 2023 “Bubble” That Has Popped?",
    "url": "https://www.newsbtc.com/news/solana/was-solana-a-q4-2023-bubble-that-has-popped/",
    "description": "The crypto market has recently been a roller coaster, especially in H2 2023. Solana, a high-throughput blockchain, emerged as one of the best performers in the top 10 coins by market cap. In Q4 2023, Solana soared, reaching highs of around $125 before cooling off to spot rates. However, some think the uptrend is over, with SOL edging lower under increasing liquidation pressure. The Solana Bubble Has Popped, Is This True? Lido.eth, while taking to X on January 7, said Solana is a &#8220;Q4 2023 bubble&#8221; that has &#8220;already popped.&#8221; The analyst added that this formation doesn&#8217;t mean SOL is &#8220;worthless or won&#8217;t be used anymore.&#8221; However, based on Lido.eth&#8217;s assessment, the Solana &#8220;growth story has ended,&#8221; calling serious questions into the project&#8217;s immediate potential.  Related Reading: Polygon NFTs Explode: 6-Month High Volume Ignites Market – Details In H2 2023, Solana grew on renewed interest in the high-performance blockchain. Propelled by rising activity in decentralized finance (DeFi) and non-fungible token (NFT) scenes, SOL reversed losses recorded in November 2022. Moreover, as the crypto community tracked the Securities and Exchange Commission (SEC) and whether they would approve the first spot Bitcoin ETF, altcoins, including SOL, became major beneficiaries. Arthur Hayes, the founder of the cryptocurrency exchange BitMEX, also believes that the Solana rally is over. In December 2023, Hayes tweeted that he had rotated funds from Solana to Ethereum, citing &#8220;divine inspiration.&#8221; The BitMEX co-founder also said ETH may rally to reach $5,000 but without giving a specific timeline as to when this lofty target will be reached. SOL Remains In An Uptrend, Back To $125? Despite these bearish sentiments, some Solana supporters believe the platform has a &#8220;bright future.&#8221; They point to the upcoming launch of the Firedancer client.  This validator client will make the network more robust and increase efficiency. It will aim to decentralize Solana further, making it more reliant by eliminating weak points resulting from client concentration. From a price action perspective, continuing the overall crypto uptrend could also buoy SOL prices in 2024. Related Reading: Analyst Predicts $570 Billion Inflow Amid Bitcoin Spot ETF Approval Looking at the Solana price chart, the uptrend remains, but sellers dominate, at least in the short term. To quantify, SOL is down 30% from the December 2023 peak when it topped at around $125.  With prices trending inside the bear bar of January 3, sellers have the upper hand from an effort-versus-result perspective. For the uptrend to resume, there must be a clear, high-volume close above $100. If not, steep losses below $85 might trigger a sell-off that could price toward $60 or worse. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-08T19:58:29.000Z",
    "title": "Bitcoin Price Breaks Through $47,000, Bullish Sentiment Builds With Anticipation Of ETF Approval",
    "url": "https://www.newsbtc.com/breaking-news-ticker/bitcoin-price-breaks-through-47000-bullish-sentiment-builds-with-anticipation-of-etf-approval/",
    "description": "With the Bitcoin price soaring to new highs, the cryptocurrency community is excitedly buzzing as all signs point towards an imminent approval of the highly anticipated Bitcoin Exchange-Traded Fund (ETF) applications.  This positive sentiment has propelled the Bitcoin price past the $47,100 mark, reaching levels not seen since April 2022 and inching closer to the coveted $50,000 milestone and its all-time high (ATH) of $69,000. SEC Fast-Tracks Bitcoin ETF Review Earlier this morning, several prominent players in the financial industry submitted their final registration of securities amendments for a Spot Bitcoin ETF.  The list of applicants includes VanEck, Bitwise, Fidelity, Valkyrie, Franklin, Ark Invest, Grayscale, BlackRock, WisdomTree, and Invesco Galaxy. This development has further fueled the bullish Bitcoin price action. Related Reading: Shiba Inu Breakout To $0.001? Rumored 9.25 Trillion SHIB Token Burn Could Be The Catalyst In recent updates regarding the Bitcoin ETF applications, James Seyffart, an ETF expert at Bloomberg, revealed that the 19b-4 filings were pouring onto the SEC website.  Although the process typically takes a few days to a couple of weeks, this influx of filings indicates that the SEC is expediting its review for this week.  It is worth noting that the timeframe of January 8th to 10th has been closely watched by industry observers, and the accelerated pace of the SEC&#8217;s actions during this period adds to the anticipation surrounding the Bitcoin ETF approval. Standard Chartered Expects $200,000 Bitcoin Price As the Bitcoin price continues its upward trajectory, accompanied by widespread anticipation of imminent ETF approval, British multinational bank Standard Chartered has made a significant statement.  The bank believes that ETF approval will serve as a pivotal catalyst for Bitcoin&#8217;s price surge, heralding a transformative moment for institutional participation in the cryptocurrency.  Standard Chartered expects this approval to drive substantial inflows and contribute to significant price gains for Bitcoin. Standard Chartered views the approval of Bitcoin ETFs as a watershed moment in normalizing institutional investment in Bitcoin. With regulatory clearance for ETFs, institutional money is expected to pour into the cryptocurrency market, further validating Bitcoin as an asset class. Related Reading: A Bullish Beginning? $151 Million Poured Into Crypto Funds In 2024’s First Week Standard Chartered predicts that the price gains resulting from the approval of spot Bitcoin ETFs in the United States will be of a similar magnitude as witnessed previously.  However, the bank anticipates these gains to materialize over a shorter period of one to two years, considering the accelerated development of the Bitcoin ETF market.  In line with their end-2024 projection of Bitcoin reaching $10,000, Standard Chartered expects the approval of ETFs to drive inflows that could potentially elevate the price to around $20,000 by the end of 2025. Bitcoin has reached the $47,100 mark, up a staggering 6.5% in the last 24 hours alone, coupled with an 8.7% increase in the last seven days. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-08T19:51:16.000Z",
    "title": "Hedera Hashgraph Powers Tokenization Revolution in Money Market Funds",
    "url": "https://www.crypto-news-flash.com/hedera-hashgraph-powers-tokenization-revolution-in-money-market-funds/?utm_source=rss&utm_medium=rss&utm_campaign=hedera-hashgraph-powers-tokenization-revolution-in-money-market-funds",
    "description": "<img width=\"2294\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Hedera-HBAR-digital-blue-style-logo.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Hedera-HBAR-digital-blue-style-logo\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Hedera-HBAR-digital-blue-style-logo.jpg 2294w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Hedera-HBAR-digital-blue-style-logo-300x157.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Hedera-HBAR-digital-blue-style-logo-1024x536.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Hedera-HBAR-digital-blue-style-logo-768x402.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Hedera-HBAR-digital-blue-style-logo-1536x803.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Hedera-HBAR-digital-blue-style-logo-2048x1071.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Hedera-HBAR-digital-blue-style-logo-150x78.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Hedera-HBAR-digital-blue-style-logo-450x235.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Hedera-HBAR-digital-blue-style-logo-1200x628.jpg 1200w\" sizes=\"(max-width: 2294px) 100vw, 2294px\" />Blockchain and tokenization revolutionize money funds, offering instant payments and revenue automation for investors. Archax is leading adoption, enabling tokenized investments in abrdn money market funds, marking a groundbreaking milestone. Blockchain technology is transforming money market funds, a low-risk type of investment that offers investors a return that increases with interest rates. Duncan Moir, Senior [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-08T19:41:42.000Z",
    "title": "Solana Meme Coins Plunge Over 70% After December Frenzy",
    "url": "https://www.crypto-news-flash.com/solana-meme-coins-plunge-over-70-after-december-frenzy/?utm_source=rss&utm_medium=rss&utm_campaign=solana-meme-coins-plunge-over-70-after-december-frenzy",
    "description": "<img width=\"2133\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-written-in-led-with-digital-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Solana-SOL-logo-written-in-led-with-digital-background\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-written-in-led-with-digital-background.jpg 2133w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-written-in-led-with-digital-background-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-written-in-led-with-digital-background-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-written-in-led-with-digital-background-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-written-in-led-with-digital-background-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-written-in-led-with-digital-background-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-written-in-led-with-digital-background-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-written-in-led-with-digital-background-450x253.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Solana-SOL-logo-written-in-led-with-digital-background-1200x675.jpg 1200w\" sizes=\"(max-width: 2133px) 100vw, 2133px\" />Solana meme coins have seen their hype fade off as reality checks stare investors in the face. Solana’s influence that helped top meme coins like BONK gain fame is being watched. The fervor surrounding meme coins on the Solana network appears to have settled with recent favorite Bonk (BONK) experiencing a steep decline of more [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-08T19:45:56.000Z",
    "title": "BlackRock Expecting SEC To Approve Bitcoin ETF on January 10th: Report",
    "url": "https://dailyhodl.com/2024/01/08/blackrock-expecting-sec-to-approve-bitcoin-etf-on-january-10th-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-ETF-Will-Democratize-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-ETF-Will-Democratize-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-ETF-Will-Democratize-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-ETF-Will-Democratize-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-ETF-Will-Democratize-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-ETF-Will-Democratize-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-ETF-Will-Democratize-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>BlackRock, the largest asset manager in the world, is reportedly anticipating that regulators approve its application for a spot Bitcoin (BTC) exchange-traded fund (ETF) this week. Fox Business reports that BlackRock is expecting the U.S. Securities and Exchange Commission (SEC) to green light its BTC ETF application this Wednesday, January 10th. If approved, the ETF [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/08/blackrock-expecting-sec-to-approve-bitcoin-etf-on-january-10th-report/\">BlackRock Expecting SEC To Approve Bitcoin ETF on January 10th: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-08T19:41:43.000Z",
    "title": "Gary Gensler Issues Warning on Crypto Investments Days Before Expected Bitcoin ETF Approval",
    "url": "https://dailyhodl.com/2024/01/08/gary-gensler-issues-warning-on-crypto-investments-days-before-expected-bitcoin-etf-approval/",
    "description": "<img width=\"1024\" height=\"585\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/About-Regulators-Swarming-binance.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/About-Regulators-Swarming-binance.jpg 1568w, https://dailyhodl.com/wp-content/uploads/2023/02/About-Regulators-Swarming-binance.jpg?resize=300,171 300w, https://dailyhodl.com/wp-content/uploads/2023/02/About-Regulators-Swarming-binance.jpg?resize=768,439 768w, https://dailyhodl.com/wp-content/uploads/2023/02/About-Regulators-Swarming-binance.jpg?resize=1024,585 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/About-Regulators-Swarming-binance.jpg?resize=1536,878 1536w, https://dailyhodl.com/wp-content/uploads/2023/02/About-Regulators-Swarming-binance.jpg?resize=750,429 750w, https://dailyhodl.com/wp-content/uploads/2023/02/About-Regulators-Swarming-binance.jpg?resize=1140,651 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Gary Gensler, the 33rd Chair of the U.S. Securities and Exchange Commission (SEC) is issuing a warning to crypto investors. In a three-part thread on the social media platform X, Gensler offers Americans his thoughts on the crypto space. In his statement, Gensler raises three points, telling investors that crypto institutions may not be in compliance [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/08/gary-gensler-issues-warning-on-crypto-investments-days-before-expected-bitcoin-etf-approval/\">Gary Gensler Issues Warning on Crypto Investments Days Before Expected Bitcoin ETF Approval</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]