[
  {
    "source": "CryptoSlate",
    "date": "2023-06-27T08:28:51.000Z",
    "title": "Asia is a ‘huge area of focus’ for Circle, especially Hong Kong: CEO Jeremy Allaire",
    "url": "https://cryptoslate.com/asia-is-a-huge-area-of-focus-for-circle-especially-hong-kong-ceo-jeremy-allaire/",
    "description": "<p>Circle, the issuer of USD Coin (USDC,) is carefully monitoring emerging crypto markets across Asia. There&#8217;s &#8220;enormous demand&#8221; for U.S. dollar-backed stablecoins in emerging markets, and &#8220;Asia is really central to that,&#8221; CEO Jeremy Allaire told Bloomberg. Therefore, &#8220;Asia is a huge area of focus for us,&#8221; he said. Specifically, Circle is keeping an eye [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/asia-is-a-huge-area-of-focus-for-circle-especially-hong-kong-ceo-jeremy-allaire/\">Asia is a ‘huge area of focus’ for Circle, especially Hong Kong: CEO Jeremy Allaire</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-27T08:31:03.000Z",
    "title": "Bloomberg Economics Sounds Alarm: UK Recession Looms Amid Inflation Struggle",
    "url": "https://www.cryptoglobe.com/latest/2023/06/bloomberg-economics-sounds-alarm-uk-recession-looms-amid-inflation-struggle/",
    "description": "According to an article by Bloomberg published on June 27, Bloomberg Economics has warned that the Bank of England’s (BoE) aggressive measures to control the UK’s soaring inflation rate, the highest among the Group of Seven economies, could plunge the country into a recession by year-end. In their analysis published on Tuesday, economists Dan Hanson […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-27T08:17:18.000Z",
    "title": "ETH: Ether’s Market Performance Hampered by US Regulatory Ambiguity",
    "url": "https://www.cryptoglobe.com/latest/2023/06/eth-ethers-market-performance-hampered-by-us-regulatory-ambiguity/",
    "description": "According to a Bloomberg article published on June 26, Ether (ETH), the world’s second-largest cryptocurrency, is experiencing a downturn in its market performance due to regulatory uncertainty in the United States. The ambiguity stems from the question of whether the US Securities and Exchange Commission (SEC) will categorize Ether as an unregistered security, a designation […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T08:13:52.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T08:38:34.000Z",
    "title": "BLUR token emerges as top gainer as holders rise",
    "url": "https://crypto.news/blur-token-emerges-as-top-gainer-as-holders-rise/",
    "description": "The native utility token of the top non-fungible token (NFT) marketplace Blur (BLUR) secured the top spot among the top 100 cryptocurrencies with a sudden hike in the past 24 hours. BLUR gained 22.5% over the last day, which immediately&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T08:33:47.000Z",
    "title": "Riot Platforms expands operations with 33,000 new miners",
    "url": "https://crypto.news/riot-platforms-expands-operations-with-33000-new-miners/",
    "description": "Riot Platforms, a major bitcoin mining company, has invested $162.9 million to acquire 33,280 advanced Bitcoin miners for its Texas data center in anticipation of the 2024 halving event. To prepare for the upcoming halving cycle projected for mid-2024, Riot&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T08:17:43.000Z",
    "title": "Tron Reaches Major Milestone with 10.2 Million Transactions, but TRX Price Lags Behind",
    "url": "https://www.crypto-news-flash.com/tron-reaches-major-milestone-with-10-2-million-transactions-but-trx-price-lags-behind-2/?utm_source=rss&utm_medium=rss&utm_campaign=tron-reaches-major-milestone-with-10-2-million-transactions-but-trx-price-lags-behind-2",
    "description": "Tron&#8217;s network achieves a significant milestone with daily transactions consistently surpassing 10.2 million, indicating high network adoption and activity. Despite the milestone, the price of TRX cryptocurrency struggles to gain momentum, with low demand and limited price movements. Tron (TRX), a distributed software platform, has reached a significant milestone as its network maintains daily transactions [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-27T08:32:36.000Z",
    "title": "Goblintown NFT Collection Review",
    "url": "https://www.altcoinbuzz.io/nft/goblintown-nft-collection-review/",
    "description": "<p>At first glance, the Globintown NFT collection stands out as an odd and peculiar NFT collection. With art reminiscent of the book and British TV series Fungus the Bogeyman it is a collection that feels unsightly and repulsive. Yet it has gained a following that sums up the ethos of the NFT scene. Let&#8217;s dive [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/nft/goblintown-nft-collection-review/\">Goblintown NFT Collection Review</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]