[
  {
    "source": "Decrypt",
    "date": "2023-06-20T00:28:07.000Z",
    "title": "Elon Musk Loses Key Litigator Amid Lawsuit Over Dogecoin Insider Trading Claims",
    "url": "https://decrypt.co/145368/elon-musk-loses-key-litigator-amid-lawsuit-over-dogecoin-insider-trading-claims",
    "description": "The withdrawal of Adam Gabor comes after a letter last week regarding his newest in-house attorney, Allison Huebert. "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-20T00:30:15.000Z",
    "title": "Report: Zimbabwe’s Central Bank Set to Launch P2P Platform for Facilitating Gold-Backed Digital Currency Transactions",
    "url": "https://news.bitcoin.com/report-zimbabwes-central-bank-set-to-launch-p2p-platform-for-facilitating-gold-backed-digital-currency-transactions/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2207939163-2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Report: Zimbabwe&#039;s Central Bank Set to Launch P2P Platform for Facilitating Gold-Backed Digital Currency Transactions\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2207939163-2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2207939163-2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2207939163-2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2207939163-2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2207939163-2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2207939163-2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2207939163-2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Reserve Bank of Zimbabwe has said it is getting close to launching a peer-to-peer platform which will facilitate digital gold token transactions. The central bank said the launch of the platform is expected to help reduce local demand for the greenback. Governor John Mangudya said the tokens have a value which is &#8220;linked to [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-20T00:30:48.000Z",
    "title": "Binance Faces Regulatory Headwinds: UK Registration Canceled, Exits Netherlands, Cyprus",
    "url": "https://www.newsbtc.com/binance/binance-faces-regulatory-headwinds-uk-registration-canceled-exits-netherlands-cyprus/",
    "description": "In the latest development surrounding Binance, the world&#8217;s largest cryptocurrency exchange, the company has officially canceled its registration in the United Kingdom. The UK Financial Conduct Authority (FCA) approved Binance&#8217;s request to deregister Binance Markets Limited (BML) (BML) on May 30, 2023, effectively ending its authorization to provide regulated services in the country. While the termination of Binance&#8217;s registration with the FCA may seem significant, it will not impact the exchange&#8217;s operations as BML never conducted any business or had users in the UK. Ilir Laro, Binance&#8217;s sub-regional manager for growth in the UK and Europe, clarified that BML had remained dormant since its acquisition by Binance Group in 2020 and had not engaged in any regulated activities. Related Reading: Report: Do Kwon Refutes Passport Forgery Claims, Shifts Blame To ‘Chinese’ Agency In March, Binance halted the process of allowing UK customers to withdraw or deposit funds in British Pounds following the termination of its operational agreements with local partner Paysafe. According to data from Kaiko, the exchange previously held a dominant position in terms of cryptocurrency trading volume denominated in Sterling until it lost its banking partner. Laro stated, &#8220;BML was successfully acquired back in 2020 by Binance Group, intended to launch a regulated business in the UK. This attempt was not successful, however, and has since then remained dormant since its acquisition.&#8221; Cryptocurrency Exchange Binance Faces Regulatory Hurdles Binance&#8217;s decision to exit the UK comes amid a series of regulatory challenges faced by the cryptocurrency exchange. The US Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC) have both filed lawsuits against Binance, alleging various violations, including misleading practices and manipulative trading. The company&#8217;s move to withdraw from the Netherlands was prompted by its failure to meet the registration requirements, while in Cyprus, Binance is preparing for the implementation of the Markets in Crypto-assets (MiCA) framework. BNB price struggles as exchange battles regulatory headwinds &#124; Source: BNBUSD on TradingView.com With the upcoming enforcement of MiCA in 2024, Binance aims to focus on obtaining permits to operate in key European Union (EU) countries. Binance&#8217;s sub-regional development manager in the UK and Europe, Ilir Laro, mentioned that the exchange still holds regulated organizations in Poland, Sweden, France, Italy, and Spain. Laro emphasized, &#8220;Because MiCA, the European law on the regulation of cryptocurrencies, will come into force in 2024, the company will focus on obtaining permits to operate in EU countries.&#8221; Binance&#8217;s exit from multiple markets and ongoing regulatory challenges highlight the intensifying scrutiny faced by the cryptocurrency exchange. However, Binance&#8217;s strategy director, Patrick Hillmann, expressed the company&#8217;s commitment to regulation in the UK despite the difficulties it is encountering in the United States. Related Reading: Stablecoins Supply Finally Shows Rise, Here’s Why This Is Bullish For Bitcoin Hillmann stated, &#8220;We are committed to working constructively with regulators in the UK to develop and promote responsible crypto adoption and innovation.&#8221; As Binance navigates through these challenges, it remains to be seen how the exchange will adapt to regulatory frameworks and maintain its position as a leading player in the cryptocurrency industry. Featured image from Reuters, chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-20T00:30:46.000Z",
    "title": "PEPE Down 78% From May Peaks But Holder Count Rising",
    "url": "https://www.newsbtc.com/news/pepe-down-78-from-may-peaks-but-holder-count-rising/",
    "description": "While PEPE is down 78% from its May 2023 peaks, token holders continue to rise. As of June 19, there are now 119,229 unique addresses holding the token, an increase from early June, Etherscan data shows.   The meme token is based on Pepe the Frog meme, created by Matt Furie in 2005.  Falling Prices, Rising Token Holder Count The token gained substantial recognition as a meme coin and enjoyed exponential price growth a month after launching in late April 2023.  With surging prices and the meme coin culture providing tailwinds, the token soon rose higher in the market cap ranking, securing a position in the top 100.  Related Reading: Stablecoins Supply Finally Shows Rise, Here’s Why This Is Bullish For Bitcoin As of June 19, PEPE is perched at 89th position with a market cap of $364,936,703, according to CoinMarketCap. PEPE is down 78% from May 2023 peaks, and prices remain fragile.  Despite falling prices, PEPE holders continue to maintain an upward trend. With over 119,000 holders, users appear keen on accumulating. In crypto circles, token holder count can be used to measure interest and adoption. Projects with a higher token holder count can be used to indicate strong community support, which can translate to success. It can also indicate the level of utility and adoption. Tokens like USDT, a stablecoin, have high token holder counts considering their role in decentralized finance (DeFi), remittance, and more.  In the case of PEPE, token holders are mostly speculating because the coin has no utility but is deflationary. An extract from their homepage reads:  PEPE is a meme coin with no intrinsic value or expectation of financial return. There is no formal team or roadmap. The coin is completely useless and for entertainment purposes only. PEPE is an ERC-20 token on Ethereum and can be bought on platforms like Binance, KuCoin, Uniswap, a decentralized exchange, and others. At the same time, the token’s derivatives have been listed on several cryptocurrency exchanges, including Binance, which began supporting the token on its Innovation Zone while listing PEPE’s perpetual futures in early May 2023. Binance To Delist PEPE From Flexible Loan Program Following increasing regulatory scrutiny, Binance announced plans to delist PEPE as a borrowable asset from their Flexible Loan program. The delisting would take effect on June 21 and also coincide with the cancellation of any open PEPE loan holdings. Related Reading: Report: Do Kwon Refutes Passport Forgery Claims, Shifts Blame To ‘Chinese’ Agency Binance strongly encourages its users to settle any outstanding debts related to PEPE. Accounts that face liquidation will incur a 2% charge, where applicable. The exchange has assured borrowers that it will accept repayment in the same currency.  Feature Image From Canva, Chart From TradingView"
  }
]