[
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T07:25:00.000Z",
    "title": "Bitcoin miners need BTC price over $98K by the halving — Analysis ",
    "url": "https://cointelegraph.com/news/bitcoin-miners-btc-price-98k-halving",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/277c56cb-0a65-4396-a906-cea5125f3175.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>To avoid being in the red, publicly-listed Bitcoin mining companies will need BTC price to be at least $98,000 by the halving next year.</p>\n                    <p><p>Predictions that Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) will see a six-figure price by the end of next year continue to surface despite BTC price <a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-down-today\">losing the $30,000 level</a> in recent days. </p><p>But for publicly-listed Bitcoin miners, in particular, a price north of $100,000 may be more of a necessity than a forecast if their business models are to remain profitable.</p><h2>Bitcoin halving: Bad news for public miners?</h2><p>Bitcoin mining stocks have been on a tear this year, <a href=\"https://cointelegraph.com/news/bitcoin-mining-stocks-outperform-btc-in-2023-but-on-chain-data-points-to-a-potential-stall\">outperforming BTC in recent months</a> by a wide margin. While BTC has seen reduced volatility and a period of consolidation, Bitcoin mining companies' stocks have risen by nearly 100% in a matter of months.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/ed2ab853-cb1a-4176-b600-e36df13f3a7a.png\"  /><figcaption style=\"text-align: center;\"><em>Recent performance of popular BTC mining stocks. Source: Made Easy – Finance on Seeking Alpha</em></figcaption></figure><p>A recent report by “Made Easy – Finance” on <a href=\"https://seekingalpha.com/article/4619872-riot-platforms-ambitious-expansion-to-be-overshadowed-by-2024-bitcoin-halving\" target=\"_blank\" rel=\"noopener nofollow\">Seeking Alpha</a> goes into detail on the subject by examining one popular miner in particular: Riot Platforms, Inc. (RIOT).</p><p>It notes that despite RIOT being <a href=\"https://cointelegraph.com/news/riot-platforms-add-bitcoin-miners-ahead-of-2024-halving\">expected to triple</a> its mining capacity in 2024, the company and Bitcoin miners in general could face serious headwinds from <a href=\"https://cointelegraph.com/news/the-economics-of-bitcoin-halving-understanding-the-effects-on-price-and-market-sentiment\">the halving</a>. A 50% decrease in BTC block rewards, of course, cuts miners’ main source of revenue in half.</p><p>Miners like RIOT can also issue new equity shares to fund their operations. This dilutes existing shares, meaning that even if the company’s underlying fundamentals are sustained, the share price may not keep up. </p><p><strong><em><u>Related: <a href=\"https://cointelegraph.com/news/160k-halving-btc-price-prediction-model-count-down-new-bitcoin-all-time-high\">$160K at next halving? Model counts down to new Bitcoin all-time high</a></u></em></strong></p><p>Combine this with the fact that many miners could already be overbought at current valuations, and things don’t look too rosy for public Bitcoin mining stocks. Although public mining stocks have outperformed Bitcoin in 2023, an increase in <a href=\"https://cointelegraph.com/news/bitcoin-mining-stocks-outperform-btc-in-2023-but-on-chain-data-points-to-a-potential-stall\">BTC being sent to exchanges</a> could be pointing toward a decline in momentum. </p><p>A big increase in Bitcoin's price will therefore be required for miners to remain profitable at today's <a href=\"https://cointelegraph.com/explained/what-is-bitcoin-hash-rate-and-why-does-it-matter\">hash rate</a> levels.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Bitcoin miners have had a banger of a year.<br><br>RIOT is up 457%<br>MARA is up 421%<br>BITF is up 337%<br>CLSK is up 246%<br><br>Both Bitcoin and Nvidia rose by less than public miners this year — 80% and 222% respectively.<br><br>The best way to get leveraged/high-beta exposure to BTC.<br><br>h/t <a href=\"https://twitter.com/zackvoell?ref_src=twsrc%5Etfw\">@zackvoell</a> <a href=\"https://t.co/xTsJqikh0L\">pic.twitter.com/xTsJqikh0L</a></p>&mdash; Joe Consorti ⚡ (@JoeConsorti) <a href=\"https://twitter.com/JoeConsorti/status/1681311576845070336?ref_src=twsrc%5Etfw\">July 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Miners might need six-figure Bitcoin to stay afloat</h2><p>How high does BTC price need to go for miners to maintain their current valuations? The above-mentioned report concludes that nearly $100,000 could be needed for miners to carry on as usual:</p><blockquote>“Unless Bitcoin outperforms our Bitcoin thesis, we don't see any way where the Bitcoin sector can come out unscathed. Even with RIOT's ambitious 35 EH/s, our model suggests that Bitcoin needs to trade above $98,000 to justify RIOT's current valuation (post-halving).”</blockquote><p>Based on this, the report warns that \"<a href=\"https://cointelegraph.com/explained/how-to-be-a-better-hodler-explained\">hodling</a>\" BTC mining stocks is \"extremely risky,” as underlying fundamentals may not keep pace with current valuations that may not be pricing in next year’s Bitcoin halving yet.</p><h2>BTC price to 125k in 2024?</h2><p>Meanwhile, a recent <a href=\"https://www.matrixport.com/institutions/research/matrix-on-target/531?utm_content=255761706&amp;utm_medium=social&amp;utm_source=linkedin&amp;hss_channel=lcp-14716238\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from Matrixport entitled “Prepare for the Soaring 2024 Year-End Bitcoin Target of $125,000” describes how BTC could reach $45,000 by year-end and $125,000 by the end of 2024. </p><p>The significance of Bitcoin price reaching a <a href=\"https://cointelegraph.com/news/bitcoin-volatility-break-31k-btc-price-yearly-highs\">one-year high</a> for the first time in a year is emphasized by the authors.</p><p> This signal has marked the beginning of a new bull market every time in the past:</p><blockquote>“On June 22, 2023, Bitcoin made a new one-year high, marking the first time in a year. This signal has historically indicated the end of bear markets and the start of new crypto bull markets. Previous occurrences took place in August 2012, December 2015, May 2019, and August 2020, with the actual bull markets materialising in 2013, 2017, and 2021.”</blockquote><p>It continues:</p><blockquote>“This signal has been triggered four times and in all four cases, the bull market fully unfolded within 12-18 months. If history is any guide, then, there is now a 100% probability that by the end of 2024, Bitcoin will experience another massive bull market with a price target of $125,000 (+310%) - based on the previous three signals.”</blockquote><p>This six-figure Bitcoin price predictions echoes numerous <a href=\"https://cointelegraph.com/news/latest-bitcoin-price-data-suggests-double-top-above-200k-in-2025\">others</a>. Standard Chartered, for example, <a href=\"https://cointelegraph.com/news/bitcoin-supply-shock-btc-price-120k-standard-chartered\">forecasts a $120,000</a> Bitcoin price by the end of 2024. Interestingly, this is largely based on BTC miners <em>not </em>selling Bitcoin before the halving.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Bitcoin may reach $120,000 by the end of 2024, Standard Chartered forecasts, as an expected improvement in crypto miners&#39; fortunes allows them to hold on to more of the tokens <a href=\"https://t.co/Z9z0BbKCqS\">https://t.co/Z9z0BbKCqS</a></p>&mdash; Bloomberg Crypto (@crypto) <a href=\"https://twitter.com/crypto/status/1678891942418034690?ref_src=twsrc%5Etfw\">July 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-04T07:30:35.000Z",
    "title": "Defi Education Fund Submits FOIA Request for SEC’s Docs",
    "url": "https://news.bitcoin.com/defi-education-fund-submits-foia-request-for-secs-docs/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2311307175-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Defi Education Fund Submits FOIA Request for SEC&#039;s Docs\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2311307175-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2311307175-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2311307175-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2311307175-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2311307175-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2311307175-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2311307175.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Defi Education Fund, an organization dedicated to expanding the decentralized finance environment, has submitted a Freedom of Information Act (FOIA) request to the U.S. Securities and Exchange Commission (SEC). The documents requested are linked to the SEC&#8217;s non-answer to whether syndicated term loan notes constitute securities. Defi Education Fund Issues FOIA Request for SEC [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T07:26:56.000Z",
    "title": "Coinbase to Challenge SEC Lawsuit, Asserts No Securities Sold",
    "url": "https://www.cryptopolitan.com/coinbase-to-challenge-sec-lawsuit/",
    "description": "In a bold move against the Securities and Exchange Commission (SEC), Coinbase, a leading cryptocurrency exchange, has announced its plans to file an order seeking dismissal of the lawsuit filed against it by the SEC. The company&#8217;s Chief Legal Officer, Paul Grewal, has expressed confidence in the exchange&#8217;s legal standing, asserting that the platform never ... <a title=\"Coinbase to Challenge SEC Lawsuit, Asserts No Securities Sold\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-to-challenge-sec-lawsuit/\" aria-label=\"More on Coinbase to Challenge SEC Lawsuit, Asserts No Securities Sold\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T07:18:17.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain‘s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T07:13:37.000Z",
    "title": "Asia’s Response to Generative AI Integration and Its Impact on Jobs",
    "url": "https://www.cryptopolitan.com/asias-generative-ai-impact-on-jobs/",
    "description": "The rise of generative artificial intelligence (AI) has sparked both excitement and concern in Asia. Entrepreneurs like Suumit Shah in India have praised the technology for its efficiency and cost-saving benefits, while others worry about its potential to displace human workers. The advent of OpenAI&#8217;s ChatGPT chatbot and similar AI-based tools has triggered a global ... <a title=\"Asia&#8217;s Response to Generative AI Integration and Its Impact on Jobs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/asias-generative-ai-impact-on-jobs/\" aria-label=\"More on Asia&#8217;s Response to Generative AI Integration and Its Impact on Jobs\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-04T07:20:45.000Z",
    "title": "Bitcoin Breakout Or Breakdown? Ark Invest’s David Puell Shares His Prediction",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-breakout-or-breakdown-ark-invest-prediction/",
    "description": "David Puell, an on-chain researcher at Ark Invest, today shared his insights in a detailed report, offering a nuanced perspective on Bitcoin&#8217;s current standing and future prospects. The report, titled &#8220;The Bitcoin Monthly: July 2023,&#8221; addresses several key topics that are central to understanding the current state of Bitcoin. These topics include a comprehensive market summary, an analysis of Bitcoin&#8217;s low volatility and whether it indicates a potential breakdown or breakout, as well as a discussion on the impact of the Federal Reserve&#8217;s tightening policy as a leading indicator of price deflation. Ark Invest’s Near-Term Bitcoin Price Prediction Puell&#8217;s analysis reveals a mixed, but mainly bullish outlook for Bitcoin, with the cryptocurrency ending July at $29,230, above its 200-week moving average and its short-term-holder (STH) cost basis of $28,328. This suggests a strong support level for Bitcoin, indicating a potential upward trend, notes Puell. However, Bitcoin&#8217;s 90-day volatility, which dropped to 36% in July, a level not seen since January 2017, presents a neutral outlook. Puell explains, &#8220;Based on its low level of volatility, we believe the Bitcoin price could be setting up to move dramatically in one direction or the other during the next few months.&#8221; This could mean a significant price movement, but the direction &#8211; up or down &#8211; is uncertain. Related Reading: MicroStrategy’s Michael Saylor Says Spot ETF Approvals Have No Bearing On Bitcoin Strategy Puell also points to signs of miner capitulation as a bullish indicator. &#8220;During July, the 30-day moving average of Bitcoin’s hash rate dropped below its 60-day moving average, suggesting that miner activity had capitulated,&#8221; he states. Miner capitulation is typically associated with oversold conditions in BTC price, hinting at a potential bullish reversal. The &#8220;liveliness&#8221; metric, which measures potential selling pressure relative to current holding behavior, also suggests a bullish trend. The analyst notes, &#8220;In July, liveliness dropped below 60%, suggesting the strongest long-term holding behavior since the last quarter of 2020.&#8221; This indicates that more holders are keeping their coins rather than selling them, which could drive the price up. ARK&#8217;s own short-term-holder profit/loss ratio, which ended July at ~1, is also seen as a bullish sign. Puell explains, &#8220;This breakeven level correlates both with local bottoms during primary bull markets and with local tops during bear market environments.&#8221; However, the future of Binance&#8217;s BNB token, which is facing increased regulatory pressure, looks bearish according to Puell. He warns, &#8220;As regulatory pressure increases on crypto exchange Binance, its native token, BNB, could be on the threshold of significant turbulence.&#8221; If BNB breaks down, it could potentially impact the overall stability of the crypto market, including BTC. Macro Outlook On the macroeconomic front, Puell discusses the potential impact of the Fed&#8217;s 22-fold increase in interest rates, which he views as bearish for Bitcoin and the broader economy. He states, &#8220;According to renowned economist Milton Friedman, monetary policy works with &#8216;long and variable lags&#8217; that last 12-18 months, suggesting that the full impact of the Fed’s 22-fold increase in interest rates has yet to hit.&#8221; Related Reading: DOJ Action Against Binance: A Hidden Blessing For Bitcoin And Crypto Markets? The Zillow Rent Index, which leads the Owners&#8217; Equivalent Rent (OER) by roughly nine months, suggests that Consumer Price Index (CPI) inflation could decelerate significantly below 2% by year-end. Puell views this as a bullish sign for Bitcoin, as it could potentially increase the attractiveness of non-inflationary assets like Bitcoin. Lastly, Ark Invest takes a neutral stance on the falling US import prices from China, despite the yuan&#8217;s depreciation by ~12% since February 2022. He notes, &#8220;All else equal, China exporters should have increased prices to offset the depreciation of the yuan. Instead, they have cut prices, harming their profitability.&#8221; In conclusion, Puell&#8217;s report presents a complex picture for Bitcoin. While there are a lot of signs for a potential bullish trend, there are also significant risks and uncertainties that could lead to bearish outcomes. At press time, the BTC price was at $29.152. The most crucial resistance at the moment lies at $29.450. If BTC can overcome this resistance, a breakout from the multi-week downtrend might be possible. Featured image from Kanchanara / Unsplash, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-04T07:23:14.000Z",
    "title": "Coinbase to Launch ‘Base’ Layer 2 Blockchain, Enabling ETH Bridging and Main Network Rollout Next Week",
    "url": "https://www.crypto-news-flash.com/coinbase-to-launch-base-layer-2-blockchain-enabling-eth-bridging-and-main-network-rollout-next-week/?utm_source=rss&utm_medium=rss&utm_campaign=coinbase-to-launch-base-layer-2-blockchain-enabling-eth-bridging-and-main-network-rollout-next-week",
    "description": "<img width=\"640\" height=\"427\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/coinbase-image.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"coinbase\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/02/coinbase-image.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/coinbase-image-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/02/coinbase-image-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />Coinbase announces the launch of &#8216;Base&#8217;, a Layer 2 blockchain, scheduled for public access on Aug. 9, enabling ETH bridging. Partnerships with big names like Coca-Cola, Atari, and OpenSea, and over $68 million worth of ether already bridged, demonstrate strong support for the project. Coinbase, the largest publicly traded U.S. crypto exchange, has unveiled its [...]"
  }
]