[
  {
    "source": "CoinDesk",
    "date": "2023-11-29T21:30:00.000Z",
    "title": "Grayscale Gears Up for Spot Bitcoin ETF, Updating Trust Agreement for Sake of ‘Operational Efficiencies’",
    "url": "https://www.coindesk.com/business/2023/11/29/grayscale-gears-up-for-etf-updating-trust-agreement-for-sake-of-operational-efficiencies/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The changes involve the fee structure, and how assets can be custodies for smoother share creation and redemptions"
  },
  {
    "source": "Decrypt",
    "date": "2023-11-29T21:23:25.000Z",
    "title": "Bored People on the Internet Are Using AI to Animate Memes",
    "url": "https://decrypt.co/207987/bored-people-on-the-internet-are-using-ai-to-animate-memes",
    "description": "Generative AI is bringing old memes to life, making them as funny (and creepy) as they can be."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-29T21:15:00.000Z",
    "title": "CME Bitcoin futures show investors betting on $40K BTC price",
    "url": "http://cointelegraph.com/news/cme-bitcoin-futures-show-investors-betting-on-40k-btc-price",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/2511ce1f-cf5e-41f7-9817-02792532da74.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Bitcoin futures annualized premium jumped to 34% on Nov. 28, leading analysts to speculate about an imminent spot BTC ETF approval.</p>\n                    <p><p>The demand for institutional investors for Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) became evident on Nov. 10 as the Chicago Mercantile Exchange (CME) Bitcoin futures <a href=\"https://cointelegraph.com/news/cme-overtakes-binance-bitcoin-futures-open-interest\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cme-overtakes-binance-bitcoin-futures-open-interest/amp\">flipped Binance's BTC futures markets</a> in terms of size. According to BTC derivatives metrics, those investors are showing strong confidence in Bitcoin's potential to break above the $40,000 mark in the short term.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/735e3318-8c01-4492-9b28-5b67d529e600.png\"><figcaption style=\"text-align: center;\"><em>CME Bitcoin futures open interest, USD. Source: Coinglass</em></figcaption></figure><p>CME's current Bitcoin futures open interest stands at $4.35 billion, the highest since November 2021 when Bitcoin hit its all-time high of $69,000–a clear indication of heightened interest, but is it enough to justify further price gains?</p><h2>CME's remarkable growth and the spot Bitcoin ETF speculation</h2><p>The impressive 125% surge in CME's BTC futures open interest from $1.93 billion in mid-October is undoubtedly tied to the anticipation of the <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-january-approvals-possible-analysts\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/spot-bitcoin-etf-january-approvals-possible-analysts/amp\">approval of a spot Bitcoin ETF</a>. However, it's important to note that there's no direct correlation between this movement and the actions of market makers or issuers. Cryptocurrency analyst JJcycles raised this hypothesis in a Nov. 26 social media post.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">What if CME (US institutions) opened longs to hedge for the spot <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&ref_src=twsrc%5Etfw\">#Bitcoin</a> ETF approval which might be imminent? <br><br>Open interest surely surged on CME in the last couple of weeks. <br><br>✍️ <a href=\"https://t.co/poFpuOidL0\">pic.twitter.com/poFpuOidL0</a></p>— JJcycles (@JJcycles) <a href=\"https://twitter.com/JJcycles/status/1728880226191691821?ref_src=twsrc%5Etfw\">November 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>To avoid the high costs associated with futures contracts, institutional investors have various options. For instance, they could opt for CME Bitcoin options, which require less capital and offer similar leveraged long exposure. Additionally, regulated ETF and exchange-traded notes (ETN) trading in regions like Canada, Brazil, and Europe provide alternatives.</p><p>It seems somewhat naive to believe that the world’s largest asset managers would take risky gambles using derivatives contracts on a decision that depends on the U.S. Securities and Exchange Commision (SEC) and is not expected until mid-January. Yet, the undeniable growth in CME Bitcoin futures open interest is hard evidence that institutional investors are setting their sight in the cryptocurrency.</p><p>It might seem naive to think that the world's largest asset managers would take significant risks with derivatives contracts on a decision dependent on the SEC, expected only in mid-January. However, the undeniable growth in CME Bitcoin futures open interest underscores the increasing interest of institutional investors in the cryptocurrency market.</p><h2>CME's Bitcoin futures signaled extreme optimism on Nov. 28</h2><p>While CME's Bitcoin futures activity has been steadily rising, the most noteworthy development has been the spike in the contracts' annualized premium (basis rate). In neutral markets, monthly futures contracts typically trade with a 5% to 10% basis rate to account for longer settlement times. This situation, known as contango, is not unique to cryptocurrency derivatives.</p><p>On Nov. 28, the annualized premium for CME Bitcoin futures surged from 15% to 34%, eventually stabilizing at 23% by day's end. A basis rate exceeding 20% indicates substantial optimism, suggesting that buyers were willing to pay a substantial premium to establish leveraged long positions. Currently, the metric stands at 14%, indicating that whatever caused the unusual movement is no longer a factor.</p><p>It's worth noting that during that 8-hour period on Nov. 28, Bitcoin's price rose from $37,100 to $38,200. However, it's challenging to determine whether this surge was driven by the spot market or futures contracts, as arbitrage between the two occurs in milliseconds. Instead of fixating on intraday price movements, traders should look to BTC option markets data for confirmation of heightened interest from institutional investors.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/why-is-the-crypto-market-down-today\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/why-is-the-crypto-market-down-today/amp\">Why is the crypto market down today?</a></em></strong></p><p>If traders anticipate a decline in Bitcoin's price, a delta skew metric above 7% is expected, whereas periods of excitement typically result in a -7% skew.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/02eae9c1-2efa-4607-806a-240df67abf1f.png\"><figcaption style=\"text-align: center;\"><em>Deribit 30-day BTC options skew. Source: Laevitas.ch</em></figcaption></figure><p>Over the past month, the 30-day BTC options 25% delta skew has consistently remained below the -7% threshold, standing near -10% on Nov. 28. This data supports the bullish sentiment among institutional investors using CME Bitcoin futures, casting doubts on the theory of whales accumulating assets ahead of a potential spot ETF approval. In essence, derivatives metrics do not indicate excessive short-term optimism.</p><p>If whales and market makers were genuinely 90% certain of SEC approval, in line with the expectations of Bloomberg’s ETF analysts, the BTC options delta skew would likely be much lower. </p><p>Nonetheless, with Bitcoin's price trading near $38,000, it appears that bulls will continue to challenge resistance levels as long as the hope for a spot ETF approval remains a driving force.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-29T21:10:34.000Z",
    "title": "U.S. reclaims dominance in Bitcoin market despite supply shift",
    "url": "https://cryptoslate.com/u-s-reclaims-dominance-in-bitcoin-market-despite-supply-shift/",
    "description": "<p>Most crypto trading volume has historically come from outside the U.S., with Asia being the largest cryptocurrency market. However, there has been a notable shift in this dynamic in the past several months, with the U.S. returning to its position as the dominant force in the Bitcoin market. This shift is evident when analyzing Bitcoin&#8217;s [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/u-s-reclaims-dominance-in-bitcoin-market-despite-supply-shift/\">U.S. reclaims dominance in Bitcoin market despite supply shift</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-29T21:30:10.000Z",
    "title": "Galaxy Digital CEO Mike Novogratz Discusses US Economy, Crypto Landscape, and 2024 Election Outlook",
    "url": "https://www.cryptoglobe.com/latest/2023/11/galaxy-digital-ceo-mike-novogratz-discusses-us-economy-crypto-landscape-and-2024-election-outlook/",
    "description": "Economic Outlook and Market Trends Mike Novogratz, the founder and CEO of Galaxy Digital, shared his perspectives on the current economic climate and market trends during an interview with Sonali Basak on Bloomberg Television. Novogratz anticipates a significant economic slowdown in the first quarter of 2024, leading to the Federal Reserve cutting rates towards the […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T21:35:36.000Z",
    "title": "CZ hires top Federal Prosecutor Mathew Diggs",
    "url": "https://www.cryptopolitan.com/cz-hires-top-federal-prosecutor-mathew-diggs/",
    "description": "Changpeng ‘CZ’ Zhao, the former CEO of Binance, has enlisted the legal expertise of Matthew Diggs, a renowned former federal prosecutor, to bolster his defense in a high-stakes legal battle. This development comes as CZ, currently on a $175 million personal recognizance bond, faces significant legal challenges, including a potential prison sentence of up to ... <a title=\"CZ hires top Federal Prosecutor Mathew Diggs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cz-hires-top-federal-prosecutor-mathew-diggs/\" aria-label=\"More on CZ hires top Federal Prosecutor Mathew Diggs\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T21:31:45.000Z",
    "title": "Paxos expands global reach with key Abu Dhabi approvals",
    "url": "https://www.cryptopolitan.com/paxos-expands-global-reach-in-abu-dhabi/",
    "description": "Paxos, a renowned player in the cryptocurrency space, has recently achieved significant milestones in its global expansion strategy, marking a new era in the digital assets market. With two in-principle approvals from the Financial Services Regulatory Authority (FSRA) in the Abu Dhabi Global Market (ADGM),  Paxos is poised to enhance its service offerings in the ... <a title=\"Paxos expands global reach with key Abu Dhabi approvals\" class=\"read-more\" href=\"https://www.cryptopolitan.com/paxos-expands-global-reach-in-abu-dhabi/\" aria-label=\"More on Paxos expands global reach with key Abu Dhabi approvals\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-29T21:19:54.000Z",
    "title": "K33 Research: Crypto markets remain steady despite Binance-DOJ settlement",
    "url": "https://crypto.news/k33-research-crypto-markets-remain-steady-despite-binance-doj-settlement/",
    "description": "The crypto market, led by Bitcoin and Ether, has shown resilience following the U.S. Department of Justice's $4.3 billion settlement with Binance, amidst varied reactions across different crypto assets and exchanges."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-29T21:16:20.000Z",
    "title": "Sei v2 to include EVM compatibility",
    "url": "https://crypto.news/sei-v2-to-include-evm-compatibility/",
    "description": "Sei Labs introduced version 2 upgrades for its Sei L1 network which includes support for Ethereum Virtual Machine (EVM) by adding Geth, a popular Ethereum programming language."
  }
]