[
  {
    "source": "CoinDesk",
    "date": "2023-06-13T11:30:06.000Z",
    "title": "ChatGPT-Style Crypto App Sets AI Loose on Fed Rate-Bitcoin Price Relationship",
    "url": "https://www.coindesk.com/markets/2023/06/13/chatgpt-style-crypto-app-sets-ai-loose-on-fed-rate-bitcoin-price-relationship/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The team behind Hong Kong-based Chain of Demand has built investment analytics engines for financial institutions and data providers like Bloomberg."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-13T11:22:00.000Z",
    "title": "Crypto Earn Platform Haru Invest Freezes Withdrawals, Citing Service Partner Issue",
    "url": "https://decrypt.co/144354/crypto-earn-platform-haru-invest-freezes-withdrawals-citing-service-partner-issue",
    "description": "The South Korea-based crypto earn platform Haru has halted withdrawals for a reported 80,000 users across 140 countries."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-13T11:26:53.000Z",
    "title": "DeFi protocol Sturdy Finance offers $100K bounty to hacker if funds are returned",
    "url": "https://cointelegraph.com/news/defi-protocol-sturdy-finance-offers-100k-bounty-to-hacker-if-funds-are-returned",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/bc2d991e-77b2-4f08-8c36-4591bace74b2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sturdy Finance founder Sam Forman said the company will not pursue the issue any further if the hacker accepts the offer and returns the remaining funds. </p>\n                    <p><p><a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">Decentralized finance (DeFi)</a> platform Sturdy Finance has offered a $100,000 bounty to the hacker that exploited the protocol. The lending platform said that its team won't pursue the issue further if the attacker accepts the offer. </p><p>On June 12, the DeFi platform <a href=\"https://cointelegraph.com/news/attacker-drains-800k-from-defi-protocol-sturdy-finance\">suffered a loss of almost $800,000</a> in digital assets when an attacker exploited vulnerabilities within the platform. Security firms pinpointed that the cause of the exploit was a faulty price oracle and the hack was carried out through a reentrancy attack. In response, the platform paused all markets and assured the community that other funds are not at risk. </p><p>Just a day after the hack, Sturdy Finance founder Sam Forman tweeted that they are offering $100,000 to the perpetrators if they agree to return the remaining funds to a wallet they specified. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We&#39;ve sent the following message to the Sturdy hacker on-chain:<br><br>&quot;To the exploiter: as we have seen with recent hacks, exploits are not as easy to escape from as they used to be. That said, we are willing to offer you $100k as a bounty, and will not pursue you further if you send…</p>&mdash; Sam Forman (@pgpsam) <a href=\"https://twitter.com/pgpsam/status/1668366929164406786?ref_src=twsrc%5Etfw\">June 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to Forman, recent hacks showed that it’s not as easy to evade exploits as it used to be. The executive said that if the hacker accepts the offer, they are willing to drop the issue. Forman also said Sturdy Finance is open to discussing with the attacker. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/hack-negotiations-why-do-platforms-with-ineffective-bounty-programs-pay-a-higher-price\"><strong><em>Hack negotiations: Why platforms with ineffective bounty programs pay a higher price</em></strong></a></p><p>Recent exploits show that offering bounties to attackers may allow platforms to recover a portion of the hacked funds. On April 4, the Euler Finance team was able to <a href=\"https://cointelegraph.com/news/euler-labs-hacker-returns-all-of-the-recoverable-funds-timeline\">recover 90% of the stolen funds</a> in one of the biggest DeFi hacks this year by negotiating and offering a bounty to their attacker. Similarly, lending protocol Sentiment <a href=\"https://cointelegraph.com/news/sentiment-recovers-870k-after-negotiations-with-the-hacker\">recovered $870,000 after an exploit</a> by offering a bounty to the hacker. </p><p>Despite some showing success in negotiations with hackers, not all projects share the same luck. On June 1, the Jimbos Protocol team <a href=\"https://cointelegraph.com/news/jimbos-protocol-offers-open-bounty-after-hacker-ignores-deal\">offered an $800,000 bounty to the public</a> after the attacker who performed an exploit on their platform ignored their bounty offer. According to the platform, anyone who can provide information that leads to the hacker’s arrest or the recovery of the funds will be eligible for the reward.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethics-101-crypto-projects-negotiate-hackers/\"><strong><em>Should crypto projects ever negotiate with hackers? Probably</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-13T11:11:57.000Z",
    "title": "Board member Yat Siu answers community concerns on ApeCoin DAO salary payouts ",
    "url": "https://cointelegraph.com/news/board-member-yat-siu-answers-community-concerns-on-apecoin-dao-salary-payouts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/86968809-0a97-43b2-be8b-a0fb130329dc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>One community member described the salaries as \"insanely out of touch,\" while another Twitter user accused those who established the rates of being \"disconnected from reality.\"</p>\n                    <p><p>The leaders of the <a href=\"https://cointelegraph.com/learn/what-is-a-dao\">decentralized autonomous organization (DAO)</a> governing the ApeCoin ecosystem have been criticized by community members for what they described as “insane” salaries after the sums were published in an organizational chart. </p><p>On June 10, the ApeCoin DAO secretary who goes by “Vulkan” <a href=\"https://twitter.com/red_vulkan/status/1667533323864793090\" target=\"_blank\" rel=\"noopener nofollow\">published</a> an organizational chart on Twitter, detailing the salaries of the DAO’s leadership. This showed salaries ranging from $7,000 per month to $75,000 per month, sums that shocked some community members and prompted a slew of inquiries from several. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">creating an org chart: $7k / month<br><br>managing a forum: $24k / month<br><br>supervising stuff: $27k / month<br><br>being “special”: 104k / month<br><br>watching our bags go down 90%+: priceless<br><br>there’s some things <a href=\"https://twitter.com/search?q=%24APE&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$APE</a> can’t buy. for everything else, there’s ApeCoin DAO. <a href=\"https://t.co/Qla0Gspe2d\">pic.twitter.com/Qla0Gspe2d</a></p>&mdash; Michael (@MiKeMeUpP) <a href=\"https://twitter.com/MiKeMeUpP/status/1667929299033407488?ref_src=twsrc%5Etfw\">June 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>A Twitter user <a href=\"https://twitter.com/DanielitoG25/status/1667704767106121729\" target=\"_blank\" rel=\"noopener nofollow\">described</a> the salaries as “insane” and said that the DAO may be “burning cash on nothing.” According to the community member, they had no idea what the “special council” is doing to deserve $20,000 per month. </p><p>In the org chart, it said that the so-called “special council” is in charge of administering DAO proposals. Because of this, the Twitter user also asked the community if anyone can remember whether any proposals were passed in 2023. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ooki-dao-to-shut-down-after-precedent-setting-court-battle-with-cftc\"><strong><em>Ooki DAO to shut down after ‘precedent setting’ court battle with CFTC</em></strong></a></p><p>Meanwhile, a community member who goes by Michael <a href=\"https://twitter.com/MiKeMeUpP/status/1667962885153394689\" target=\"_blank\" rel=\"noopener nofollow\">tweeted</a> that the council jobs, if done properly, could justify the amounts for the right people. However, the community member added that “100k to mod a forum and another to supervise though is lols.”</p><p>One community member described the salaries as being “insanely out of touch,” while another Twitter user accused those who made this decision of being “disconnected from reality.” </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/00bf4581-0ca1-4889-a607-46d7505b2034.png\"  /><figcaption style=\"text-align: center;\"><em>Community member pointed out average monthly salary in the United States. Source: Twitter</em></figcaption></figure><p>Responding to the concerns raised by the community, ApeCoin DAO board member Yat Siu <a href=\"https://twitter.com/ysiu/status/1667757014691504128\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> in a Twitter thread that the compensation being paid corresponds to the “responsibility and liability of the role.” According to Siu, different industries pay more due to factors such as risk and liability, and pointed out that the crypto and Web3 industries have plenty of these. </p><p>The board member said that while it’s not exactly the same, the roles of the special council have some similarities to executives in mid-cap companies who receive similar rates. “The importance and the duty of care that comes with serving a multi-billion dollar DAO and related risks and liability for each member is real &amp; serious,” Siu <a href=\"https://twitter.com/ysiu/status/1667757014691504128\" target=\"_blank\" rel=\"noopener nofollow\">tweeted</a>.</p><p>Within the thread, a community member <a href=\"https://twitter.com/A_Sovereign_Man/status/1667760114764488704\" target=\"_blank\" rel=\"noopener nofollow\">asked</a> whether the people being paid $20,000 per month have equivalent resumes to a public company director. Siu replied that not all of them are typical public board director candidates but said that this is what makes DAOs exciting. According to Siu, this proves that people who don't have typical backgrounds can perform well if given the opportunity. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\"><strong><em>Tornado Cash 2.0 — The race to build safe and legal coin mixers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-13T11:30:22.000Z",
    "title": "Majority of Americans Hesitant to Embrace Central Bank Digital Currency, Survey Finds",
    "url": "https://news.bitcoin.com/majority-of-americans-hesitant-to-embrace-central-bank-digital-currency-survey-finds/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbdcss-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Majority of Americans Hesitant to Embrace Central Bank Digital Currency, Survey Finds\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbdcss-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbdcss-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbdcss-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbdcss-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbdcss-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbdcss-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbdcss.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A recent poll conducted by the Cato Institute and public opinion firm Yougov reveals that the majority of Americans are hesitant to adopt a central bank digital currency (CBDC). The findings indicate that support for a CBDC remains relatively low among survey respondents. U.S. CBDC Support Remains Low: Survey Highlights American Hesitation In late May [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-13T11:12:11.000Z",
    "title": "Circle CEO urges Congress to lead stablecoin regulation",
    "url": "https://crypto.news/circle-ceo-urges-congress-to-lead-stablecoin-regulation/",
    "description": "Circle CEO Jeremy Allaire is set to testify before the US House Financial Services Committee today, urging lawmakers to prioritize the primacy of the US dollar and pass essential stablecoin legislation. In a June 12 blog post, Allaire unveiled his&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-13T11:10:42.000Z",
    "title": "Solana Price Plunges Below March Low – Could It Drop Further?",
    "url": "https://www.newsbtc.com/news/solana-plunges-below-march-low/",
    "description": "Solana (SOL) made headlines recently after being labeled as a &#8220;security&#8221; by the US Securities and Exchange Commission (SEC). As a result, SOL is facing challenges in its price movement.  In light of this regulatory setback, investors closely monitor SOL&#8217;s performance. According to CoinMarketCap, SOL is currently priced at $15.45, sustaining a seven-day slump of 23.13%.  Related Reading: XRP Could Be Set For A Breakout As Investment Inflows Continue Source: CoinMarketCap As the market remains uncertain, one wonders: Will Solana be able to recover from its recent downturn and regain its upward momentum? SOL Faces Steep Decline As Support Levels Are Breached The past week has been challenging for Solana (SOL) as it experienced a significant decline, causing it to breach the crucial support zone ranging from $16.7 to $18.8. This downward spiral was initiated by a weekend slump that coincided with Bitcoin&#8217;s (BTC) retest of $25,000. As SOL dropped below both the trendline resistance and March&#8217;s low of $16, it shifted into a bearish bias. Solana price in a downward trajectory. Source: CoinMarketCap For SOL to regain bullish momentum, it heavily relies on Bitcoin surpassing $26,600 and successfully crossing the $27,000 threshold. However, without this upward movement, the bulls could face challenges in clearing the confluence area situated near $17, which combines bullish order book support and trendline resistance.  Related Reading: Coinbase Receives Hong Kong Legislator’s Support Amid Regulatory Storm A potential rejection at this critical juncture may trigger a further decline in SOL&#8217;s price, potentially leading it toward the support levels at $14.9 or even $12.8. Solana Foundation Disagrees With SEC Label Of SOL As Security In separate lawsuits filed on June 5 and 6 against popular cryptocurrency exchanges Binance and Coinbase, the SEC designated the SOL token as a security. The SEC&#8217;s classification was based on various factors, including the expectation of profits derived from the efforts of others, as well as the manner in which the tokens are utilized and promoted. The Solana Foundation disagrees with the characterization of SOL as a security. We welcome the continued engagement of policymakers as constructive partners on regulation to achieve legal clarity on these issues for the thousands of entrepreneurs across the U.S. building in the… — Solana Foundation (@SolanaFndn) June 10, 2023 Addressing the SEC&#8217;s classification of SOL as a security, the Solana Foundation took to Twitter to express its disagreement. In a statement, the foundation asserted, &#8220;The Solana Foundation disagrees with the characterization of SOL as a security.&#8221; According to the SEC, the term &#8220;security&#8221; encompasses not only traditional investment instruments like stocks, bonds, and transferable shares but also extends to &#8220;investment contracts.&#8221; SOL market cap currently at $6.16 billion. Chart: TradingView.com By labeling SOL as a security, the SEC signals its intention to subject the token to regulations governing securities, which could have significant implications for Solana and its ecosystem. The classification will likely prompt further scrutiny and discussions regarding the nature and regulatory status of cryptocurrencies in the evolving legal landscape. Featured image from APKPure"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T11:30:38.000Z",
    "title": "Is Ethereum Classic still relevant after Ethereum Merge? AI Analytics provide insights",
    "url": "https://www.crypto-news-flash.com/is-ethereum-classic-still-relevant-after-ethereum-merge-ai-analytics-provide-insights/?utm_source=rss&utm_medium=rss&utm_campaign=is-ethereum-classic-still-relevant-after-ethereum-merge-ai-analytics-provide-insights",
    "description": "As the Ethereum blockchain transitions from a proof-of-work protocol to a proof-of-stake system, the cryptocurrency market watches in anticipation. With the Ethereum Merge bringing about significant changes, the future of ETC remains uncertain, prompting questions whether it is still relevant after the Ethereum Merge. Fortunately, Avorak comes in handy with its advanced algorithms. Ethereum Classic [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T11:27:19.000Z",
    "title": "Tether Mints $1B on Ethereum for Chain Swaps – Could It Propel ETH Price to New Heights? Report",
    "url": "https://www.crypto-news-flash.com/tether-mints-1b-on-ethereum-for-chain-swaps-could-it-propel-eth-price-to-new-heights-report/?utm_source=rss&utm_medium=rss&utm_campaign=tether-mints-1b-on-ethereum-for-chain-swaps-could-it-propel-eth-price-to-new-heights-report",
    "description": "Tether minted $1 billion worth of its USDT on the Ethereum blockchain on June 12, 2023. This is the second mint that tether justified it to be for chain swaps. Tether has minted a fresh batch of its stablecoin USDT worth $1 billion nearly two months after its first mint of similar worth. The first [...]"
  }
]