[
  {
    "source": "Bitcoin.com",
    "date": "2024-02-17T01:00:21.000Z",
    "title": "Justin Sun Unveils Tron-Based Bitcoin Layer Two Roadmap",
    "url": "https://news.bitcoin.com/justin-sun-unveils-tron-based-bitcoin-layer-two-roadmap/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/tron_bitcoin_layer_two-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Justin Sun&#039;s Outlines Vision to Merge Tron and Bitcoin Networks\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/tron_bitcoin_layer_two-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/tron_bitcoin_layer_two-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/tron_bitcoin_layer_two-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/tron_bitcoin_layer_two-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/tron_bitcoin_layer_two-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/tron_bitcoin_layer_two-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/tron_bitcoin_layer_two.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Tron is embarking on an ambitious journey to transform the Bitcoin ecosystem, as announced by its founder, Justin Sun. Through the integration of Bitcoin Layer two solutions, Tron seeks to decentralize and interconnect a variety of token types, including major stablecoins, with the Bitcoin network. Justin Sun&#x2019;s Outlines Vision to Merge Tron and Bitcoin Networks [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-17T01:07:49.000Z",
    "title": "MicroStrategy’s Bitcoin holdings traced to Fidelity",
    "url": "https://www.cryptopolitan.com/microstrategy-bitcoin-traced-to-fidelity/",
    "description": "Blockchain analytics powerhouse Arkham Intelligence has blown the lid off one of the most closely guarded secrets in the digital currency space. The firm claims to have tracked down a whopping 98% of MicroStrategy&#8217;s Bitcoin stash, pinpointing the whereabouts of approximately 186,000 out of 190,000 BTC. This revelation sheds light on the broader implications of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-17T01:00:00.000Z",
    "title": "Best Alternative to Solana (SOL) to 5x Your Money in Q1 of 2024",
    "url": "https://www.cryptopolitan.com/best-alternative-to-solana-sol-to-5x-your-money-in-q1-of-2024/",
    "description": "The crypto market is focused on the parabolic rise of Solana (SOL) as investors clamor to get in on the action before the next price surge. Solana (SOL) gained nearly 20% over the past week, reaching $114. This impressive rally comes on the heels of the altcoin shrugging off a minor network outage, proving the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-17T01:00:28.000Z",
    "title": "Crypto Scam Alert: Phishing Attack Swipes $5.1M Worth of BEAM, Token Price Drops",
    "url": "https://www.newsbtc.com/crypto/crypto-scam-alert-phishing-attack-swipes-5-1m-worth-of-beam-token-price-drops/",
    "description": "According to the blockchain analytics platform Lookonchain, a crypto trader suffered a phishing attack that swooped over 180 million BEAM tokens on Wednesday and affected the token’s price. Related Reading: Coinbase Suspends PlayDapp Trading After Hack, PLA Price Reacts 180 Million BEAM Tokens Stolen In an X (former Twitter) post, Lookonchain exposed a new crypto scam that had occurred on February 15. As the analytics platform detailed, the address 0x83664B8a83b9845Ac7b177DF86d0F5BF3b7739AD, under the name ‘Kirilm.eth’, suffered a phishing attack that led to the theft of millions of BEAM tokens. kirilm.eth was phishing attacked and lost 180.25M $BEAM($5.14M) 13 hours ago. The scammer quickly sold the 180.25M $BEAM for 1,629 $ETH($4.6M), which caused the price of $BEAM to drop by ~7%.https://t.co/x8epiNx4Qa pic.twitter.com/ytcfYib2Kg &#8212; Lookonchain (@lookonchain) February 16, 2024 Users seemingly identified the victim as a crypto trader named Kirill Marinov. According to the information provided, the victim lost 180.25 million BEAM tokens, worth approximately $5.14 million, to an account labeled as ‘Fake_Phishing291038.’ Shortly after the theft, the scammer’s address liquidated the total amount of stolen BEAM tokens, exchanging them for 1,629 ETH worth approximately $4.6 million. According to Web3 anti-scam platform Scam Sniffer, the victim signed an ‘increase allowance’ transaction that gave the scammer access to the tokens. Additionally, the. X post detailed that the token spender is a Safe Wallet address. However, this writing has not revealed further details about the victim, the exact tactics used by the scammer, and their identity. Phishing scams are among the most popular tactics for crypto-related crimes. Scammers exploit inexperienced investors’ naivety and oversights from more experienced traders to gain access to the funds. The scamming tactics involve a variety of ways to trick the victims into revealing their private keys or login information to grant access to the victim’s wallets. Due to this, experts urge all crypto investors to stay alert and take the necessary measures to keep their assets safe. BEAM Price Reacts To The Crypto Heist The BEAM token serves as the native crypto asset for the Beam network. After the heist and subsequent exchange to ETH, the token’s price dropped, falling from the $0.030 price level to the $0.028 range. Beam Network is a gaming network powered by the Merit Circle DAO. The ecosystem brings developers and gamers together to develop the gaming industry further. According to the Beam team, “At its core, Beam aspires to create harmony between gamers and developers. It&#8217;s not just about gaming; it&#8217;s about ownership, empowerment, and a global community. Every feature and tool is a step towards this visionary future.” At writing time, the token trades at $0.027, representing a 2.4% drop in the last hour and a 9.3% decrease from its trading price in the previous 24 hours. According to CoinMarketCap data, the token&#8217;s daily trading volume saw a 25.7% decrease in the last 24 hours, sitting at the #104 spot on this metric with $61.4 million. Despite the negative price reaction following the scam, the BEAM price still registered a 32.9% increase in the last 7 days. Similarly, BEAM’s trust score in the spot markets remains untouched, per CoinGecko Data. Related Reading: Monero Plummets Following Major Crypto Exchange Delisting, Are More Losses Imminent? BEAM price is trading at $0.0276 in the hourly chart. Source: BEAMUSDT on Tradingview.com Featured Image from Unsplash.com, Chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-17T01:00:02.000Z",
    "title": "Cloud-Focused Web3 Altcoin Tops All Other Crypto Projects in Terms of Recent Development Activity: Santiment",
    "url": "https://dailyhodl.com/2024/02/16/cloud-focused-web3-altcoin-tops-all-other-crypto-projects-in-terms-of-recent-development-activity-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/Two-Extraordinary-Storm-Clouds.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/Two-Extraordinary-Storm-Clouds.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/Two-Extraordinary-Storm-Clouds.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/Two-Extraordinary-Storm-Clouds.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/Two-Extraordinary-Storm-Clouds.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/Two-Extraordinary-Storm-Clouds.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/Two-Extraordinary-Storm-Clouds.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A cloud-focused Web3 altcoin has surged ahead of all other crypto projects in terms of recent development activity, according to the analytics firm Santiment. Santiment says the public decentralized network Internet Computer (ICP) registered 466.9 GitHub commits in the past 30 days, leading all other crypto projects. The analytics firm notes that it does not [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/16/cloud-focused-web3-altcoin-tops-all-other-crypto-projects-in-terms-of-recent-development-activity-santiment/\">Cloud-Focused Web3 Altcoin Tops All Other Crypto Projects in Terms of Recent Development Activity: Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]