[
  {
    "source": "Cointelegraph",
    "date": "2024-02-05T08:18:19.000Z",
    "title": " S.Korea regulator to discuss spot Bitcoin ETF with SEC chief Gary Gensler  ",
    "url": "https://cointelegraph.com/news/s-korea-regulator-spot-bitcoin-etf-sec-chief-gary-gensler",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMmJhNjljYWYtMzNjYy00NTI5LWE0OTctMGU4NzA1YmU3NjI3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>When the SEC approved its spot Bitcoin ETF, South Korea's securities regulator warned local firms against brokering spot Bitcoin ETFs from the U.S. </p>\n                    <p><p data-ct-non-breakable=\"true\">South Korea’s Financial Supervisory Service (FSS), the chief financial oversight regulator in the country, is planning to tap the United States Securities and Exchange Commission (SEC) for insights into spot Bitcoin exchange-traded funds (ETFs).</p><p>The FSS is South Korea’s integrated financial regulator that examines and supervises financial institutions under the broad oversight of the Financial Services Commission. </p><p>FSS chief Lee Bok-Hyun presented a business plan for 2024 at the Financial Supervisory Service in Seoul on Feb. 5. The business plan includes visits to major advanced financial markets, such as New York, in the second quarter to discuss various aspects of the South Korean financial markets, including discussions on spot Bitcoin ETF, according to a <a href=\"https://www.hankyung.com/article/202402054338B\" target=\"_blank\" rel=\"noopener nofollow\">report</a>.</p><p><a href=\"https://cointelegraph.com/news/s-korea-regulator-spot-bitcoin-etf-sec-chief-gary-gensler\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-05T08:15:31.000Z",
    "title": "Hacker sells ‘subpoena’ access to Binance, Coinbase, and Chainlink",
    "url": "https://cryptobriefing.com/hacker-sells-subpoena-access-binance-coinbase-chainlink/?utm_source=feed&utm_medium=rss",
    "description": "The hacker allegedly offers $5,000 (total) or $300 per emergency data request (EDR) from KodexGlobal to access and request private user data."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-05T08:38:22.000Z",
    "title": "Merlin Chain Secures Funding to Empower \"Bitcoin-native\" Innovations",
    "url": "https://cryptodaily.co.uk/2024/02/merlin-chain-secures-funding-to-empower-bitcoin-native-innovations",
    "description": "Merlin Chain Secures Funding to Empower \"Bitcoin-native\" Innovations"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T08:23:46.000Z",
    "title": "Solana Price Prediction 2024-2033: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2024-2033 How much is SOL worth? The live&#160;Solana price today&#160;is $96.26 USD with a 24-hour trading volume of $1,429,767,001 USD.&#160;We update our SOL to USD price in real-time.&#160;Solana is down 0.20% in the last 24 hours.&#160;The current CoinMarketCap ranking is #5, with a live market cap of $41,977,739,045 USD.&#160;It has a circulating [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-05T08:25:35.000Z",
    "title": "Why Is Bitcoin Price Not Going Up Despite The ETFs? Expert Explains",
    "url": "https://www.newsbtc.com/news/bitcoin/why-is-bitcoin-price-not-going-up-despite-etfs/",
    "description": "In a recent analysis, Fred Krueger, the former founder and chairman of Traffic Marketplace, offered a nuanced explanation for the seemingly paradoxical situation where the Bitcoin price has fallen despite the influx of over $5 billion in new assets through Exchange-Traded Funds (ETFs) by BlackRock and Fidelity. Since January 11, the first trading day of the ten spot ETFs, the Bitcoin price has currently plunged by 13% (over 21% at times). Why Is Bitcoin Price Not Going Up? Krueger&#8217;s insights, shared via X (formerly Twitter), delve into the complex dynamics of the market and its recent interactions with emerging financial instruments. Krueger&#8217;s analysis begins by highlighting a key strategy adopted by arbitrage traders in late June 2023, in anticipation of the ETF launch. He stated, &#8220;In late June 2023, in anticipation of an ETF, arbitrageurs put on Long GBTC, short BTC Futures trades.&#8221; This maneuver, according to Krueger, initially had a negative impact on Bitcoin&#8217;s price. However, its effects were masked by the overall market rally at the time. Related Reading: Bitcoin Holders Moving Big: Number Of Whale Wallets Reaches Highest Count In 15 Months Crucially, this strategy began to close the discount on Grayscale Bitcoin Trust (GBTC) and simultaneously increased the open interest on the Chicago Mercantile Exchange (CME). With the approval of the ETFs, these arbitrage traders shifted their strategies. Krueger explains, &#8220;Once the ETFs were approved, the arbs unwinded the trade. This time they sold GBTC for BTC, and bought Futures.&#8221; He describes this action as market-neutral. The selling of GBTC necessitated an actual sale of Bitcoin, which balanced against the futures purchase. This dynamic led to a decrease in the open interest on CME, a trend that was observed and reported. There Was More At Play Krueger also sheds light on the composition of the new ETF demand, noting that &#8220;about 1.5 billion of the 5 billion in new ETF demand was in fact recycled from GBTC in tax-neutral accounts, looking for lower fees.&#8221; This recycling of funds, while significant, did not represent fresh capital entering the Bitcoin market but rather a reallocation of existing investments. Related Reading: Bitcoin Set For Positive Performance In Q2 2024: Coinbase Analysts The analysis further identifies external market pressures, notably the selling of $1 billion worth of GBTC by Sam Bankman-Fried (SBF), founder of FTX. Krueger comments, &#8220;This selling, and the headline selling of GBTC spoofed the market, and so people concluded the ETF was a failure.&#8221; However, Krueger argues that this perspective overlooks the reality that the ETFs actually created net new buying pressure of over $3.5 billion. Despite the substantial buying activity spurred by the new ETFs, the broader market reaction was influenced by a combination of factors, including the FTX selling and the unwinding of arbitrage positions. Krueger concludes his analysis by stating, &#8220;The relentless buying of the new ETFs was far bigger than anybody predicted, modulo the FTX selling and the arb unwinds.&#8221; Overall, Krueger is super bullish: Over the next 30 to 60 days, there are 20 to 40 trading sessions. I would bet this results in between 4 and 6 Billion new USD in inflows. At a market cap of 850 Billion, it&#8217;s pretty easy to see this *could* move the market 50% or to 64K. Basically at all time high. At press time, BTC traded at $43,054. Featured image created with DALLE, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-05T08:37:06.000Z",
    "title": "Jupiter Exchange Allocates 75% of Fees to Fund DAO Operations",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/jupiter-exchange-allocates-75-of-fees-to-fund-dao-operations/",
    "description": "<p>The initiative focuses on directing 75% of $USDC launchpool fees to support the DAO&#8217;s operations. This marks a significant pivot towards sustainability and growth for the Jupiter Exchange ecosystem. Funding DAO Operations with $USDC Fees Jupiter Exchange has always been at the forefront of DeFi innovation. This move highlights the platform&#8217;s dedication to users and [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/jupiter-exchange-allocates-75-of-fees-to-fund-dao-operations/\">Jupiter Exchange Allocates 75% of Fees to Fund DAO Operations</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-05T08:34:48.000Z",
    "title": "Bollinger Bands Squeeze Signals Impending Spike in DOGE Price",
    "url": "https://coinedition.com/bollinger-bands-squeeze-signals-impending-spike-in-doge-price/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Dogecoin_DOGEUSD_is_forming_the_Here_we_go_round_the_Mulberry_Bush.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Dogecoin_DOGEUSD_is_forming_the_Here_we_go_round_the_Mulberry_Bush\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Dogecoin_DOGEUSD_is_forming_the_Here_we_go_round_the_Mulberry_Bush.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Dogecoin_DOGEUSD_is_forming_the_Here_we_go_round_the_Mulberry_Bush-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Dogecoin_DOGEUSD_is_forming_the_Here_we_go_round_the_Mulberry_Bush-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Dogecoin_DOGEUSD_is_forming_the_Here_we_go_round_the_Mulberry_Bush-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Dogecoin_DOGEUSD_is_forming_the_Here_we_go_round_the_Mulberry_Bush-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Dogecoin_DOGEUSD_is_forming_the_Here_we_go_round_the_Mulberry_Bush-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to “ali_charts” on X, a renowned technical and on-chain crypto analyst, Dogecoin is set for a spike in volatility. In a recent post on X, Ali highlighted a significant signal in the Bollinger bands indicator on DOGE’s four-hour chart. He showed that the indicator is experiencing its tightest squeeze since October 2023. Ali attached [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bollinger-bands-squeeze-signals-impending-spike-in-doge-price/\">Bollinger Bands Squeeze Signals Impending Spike in DOGE Price</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]