[
  {
    "source": "Cointelegraph",
    "date": "2023-10-25T04:21:28.000Z",
    "title": "No, ARK 21 Shares spot Bitcoin ETF is not listed on DTCC website",
    "url": "https://cointelegraph.com/news/ark-21shares-spot-bitcoin-etf-not-dtcc-listed",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/9fd08e99-d2ad-4d37-810a-211911dcb37d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Unfortunately for those watching closely for new spot Bitcoin ETF filings, ARK Invest and 21 Shares’ joint spot Bitcoin ETF has not been listed.</p>\n                    <p><p>Despite swirling rumors on social media, ARK Invest’s spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) does not appear to be listed on the Depository Trust and Clearing Corporation’s (DTCC) website.</p><p>On Oct. 25, numerous high-profile crypto accounts on X (Twitter) including Mike Alfred, Bitcoin News, Simply Bitcoin, Crypto News Alerts and others posted tweets and screenshots claiming ARK Invest and 21 Shares’ joint spot Bitcoin ETF had been listed on the DTCC’s site.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BREAKING:<br>CATHIE WOODS’ ARK SPOT BITCOIN ETF IS NOW LISTED ON THE DTCC WEBSITE WITH TICKER AND CUSIP</p>&mdash; Mike Alfred (@mikealfred) <a href=\"https://twitter.com/mikealfred/status/1716969002122318042?ref_src=twsrc%5Etfw\">October 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, none of the screenshots showed the correct ticker for the spot Bitcoin ETF, instead showing tickers related to futures products.</p><p>The most recent amended <a href=\"https://www.sec.gov/Archives/edgar/data/1869699/000119312523254102/d549524ds1a.htm\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> for Ark’s spot Bitcoin ETF from Oct. 11 shows that the fund will trade using the ticker “ARKB.”</p><p>As of Oct. 25, the section of the DTCC website showing all current ETF listings shows no listing under the ticker of ARKB. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/81e2eb9b-d86d-4ce0-af89-6359af55dc80.png\"  /><figcaption style=\"text-align: center;\"><em>The current list of ARK ETF products on the DTCC ETF list. Source: DTCC</em></figcaption></figure><p>The ticker “ARKA” refers to the ARK 21Shares Active Bitcoin Futures ETF, which according to the most recent <a href=\"https://www.sec.gov/Archives/edgar/data/1592900/000182912623005338/easeries_485apos.htm\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> on Aug. 11, is a yet-to-be-approved fund that will offer investors exposure to Bitcoin futures contracts. </p><p>The tickers ARKY and ARKZ respectively refer to the ARK 21Shares Active Ethereum Futures ETF and the ARK 21Shares Active Bitcoin Ethereum Strategy ETF — both are still proposed products pending approval with the Securities and Exchange Commission.</p><p>It’s beginning to look like the iShares listing news was overhyped too. </p><p>While the crypto market soared on the news that BlackRock’s iShares <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-nasdaq-clearing-firm\">spot Bitcoin ETF (IBTC) had been listed on the DTCC</a>’s site, a DTCC spokesperson recently revealed that IBTC had been listed on the website since August. </p><p>The spokesperson said it’s standard practice for the DTCC to add securities to the NSCC security eligibility file “in preparation for the launch of a new ETF to the market.\"</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-ibtc-relisted-dtcc\"><strong><em>BlackRock's iShares Bitcoin ETF mysteriously disappears — then reappears — on DTCC site</em></strong></a></p><p>“Appearing on the list is not indicative of an outcome for any outstanding regulatory or other approval processes,” the spokesperson added.</p><p>Traders noticing BlackRock’s spot ETF listing on the DTCC website coincided with a 14% single-day rally for Bitcoin, which <a href=\"https://cointelegraph.com/news/bitcoin-btc-price-breaks-34000-etf-excitement-grows\">briefly broke $35,000 for the first time</a> in nearly two years. </p><p>Around the same time as the rumors of an ARK listing first began to surface, Bloomberg senior ETF analyst Eric Balchunas wrote that ARK Invest had filed a fourth amendment to its spot Bitcoin ETF application, which seemed to be largely cosmetic changes to the filling. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">ARK just filed amendment #4 to their 19b-4, looks like it is to incorporate changes made to their S-1 (which again were to address SEC qs). I guess just want to make both docs be in tune (first issuer to do so). I don&#39;t see anything else to read into here but cc <a href=\"https://twitter.com/SGJohnsson?ref_src=twsrc%5Etfw\">@SGJohnsson</a> <a href=\"https://t.co/NE4Gy3spgN\">pic.twitter.com/NE4Gy3spgN</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1716923416899682769?ref_src=twsrc%5Etfw\">October 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-25T04:38:28.000Z",
    "title": "AI-Driven Limbic chatbot Enhances Mental Health Accessibility",
    "url": "https://www.cryptopolitan.com/ai-driven-limbic-chatbot-mental-health/",
    "description": "In a groundbreaking move, Bradford District and Craven Talking Therapies have integrated Artificial Intelligence (AI) into their mental health support system. The Limbic chatbot, powered by AI technology, takes center stage on their website, promising a more efficient and accessible approach to aiding those grappling with mental health issues. This innovative tool automates the initial ... <a title=\"AI-Driven Limbic chatbot Enhances Mental Health Accessibility\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-driven-limbic-chatbot-mental-health/\" aria-label=\"More on AI-Driven Limbic chatbot Enhances Mental Health Accessibility\">Read more</a>"
  }
]