[
  {
    "source": "CoinDesk",
    "date": "2023-11-15T07:30:00.000Z",
    "title": "Crypto Giant OKX Goes Live With Off-Exchange Derivatives Trading",
    "url": "https://www.coindesk.com/business/2023/11/15/crypto-giant-okx-goes-live-with-off-exchange-derivatives-trading/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Asset manager CoinShares along with crypto custody joint venture Komainu are aiming for TradFi standards in derivatives settlement with much reduced counterparty risk."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-15T07:20:38.000Z",
    "title": "Tron price declines, investors evaluating Galaxy Fox",
    "url": "https://crypto.news/tron-price-declines-investors-evaluating-galaxy-fox/",
    "description": "Galaxy Fox (GFOX) is increasingly being examined, particularly in light of the recent price dip in Tron (TRX)"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-15T07:26:52.000Z",
    "title": "JPM Coin Poised For $10 Billion Daily Transaction Boom, JPMorgan Reports",
    "url": "https://www.newsbtc.com/news/jpm-coin-poised-for-10-billion-daily-transaction-boom-jpmorgan-reports/",
    "description": "JPMorgan Chase &#38; Co. anticipates that its digital currency, JPM Coin, will facilitate daily transactions amounting to $10 billion in the coming year. Umar Farooq, the Global Head of Financial Institution Payments at the bank, revealed this projection during an interview with Bloomberg held at the Singapore FinTech Festival. Farooq&#8217;s insights shed light on the ambitious expectations the financial institution has for the widespread adoption and utilization of JPM Coin as a means of conducting transactions in the digital financial landscape. Related Reading: Celestia Strikes: How This Lesser-Known Coin Went Berserk With 126% Price Explosion Takis Georgakopoulos, the Global Head of Payments at JPMorgan Chase &#38; Co., recently disclosed that JPM Coin is actively managing a staggering $1 billion in daily transactions. In a recent interview on Bloomberg Television, Georgakopoulos highlighted the predominant use of JPM Coin in daily transactions denominated in US dollars and underscored the bank&#8217;s dedicated efforts to broaden its utilization, signaling a robust commitment to the ongoing evolution of digital financial instruments. JPM Coin: Ambitious Growth Goals Farooq expressed his aspiration for a substantial increase in transaction volume, aiming for a growth rate ranging from five to 10 times over the specified period. “We really think it’s going to start taking off,” he said during an interview with Haslinda Amin of Bloomberg TV Wednesday, on the sidelines of the Singapore FinTech Festival. Although the billion-dollar daily transaction volume achieved by JPM Coin is notable, it represents only a small fraction of the colossal $10 trillion in daily US dollar transactions managed by JPMorgan. JPM Coin presents a secure and efficient avenue for wholesale clients to participate in dollar and euro-denominated payments within the confines of a private blockchain network. Total crypto market cap reaches $1.34 on the 24-hour chart: TradingView.com Testing The Waters: Evaluating Digital Ledgers On A Grand Scale Advocates for blockchain technology contend that it has the potential to facilitate instant payments at a reduced cost compared to prevailing technologies. However, it&#8217;s crucial to note that digital ledgers, despite their touted advantages, have not undergone trials on the same expansive scale as established payment networks. The claims surrounding the efficiency and cost-effectiveness of blockchains are still in the process of being substantiated through broader and more comprehensive real-world applications. Related Reading: Solana (SOL) Shines 40% Toward $60 As Whales Make Big Moves Programmable Payments For Institutional Clients Meanwhile, JPMorgan has just implemented a programmable payment functionality specifically designed for institutional customers of their private blockchain network. The programmable payments functionality has been made available to all institutional clients, enabling the execution of real-time, programmable treasury operations and the development of novel digital business models. The first institutional client to utilize the programmable payments capability is Siemens AG, a German tech company that demonstrated its use as recently as November 6. Before the conclusion of 2023, FedEx and Cargill are anticipated to utilize the solution as well. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from AdWeek"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-15T07:29:11.000Z",
    "title": "OKX and Polygon Labs Join Forces to Revolutionize Web3.0 with X1",
    "url": "https://www.crypto-news-flash.com/okx-and-polygon-labs-join-forces-to-revolutionize-web3-0-with-x1/?utm_source=rss&utm_medium=rss&utm_campaign=okx-and-polygon-labs-join-forces-to-revolutionize-web3-0-with-x1",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-06T153434.547.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Grab wallet\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-06T153434.547.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-06T153434.547-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />OKX is launching X1, a ZK-powered Layer 2 network using Polygon CDK, bridging its 50 million+ users with the Ethereum ecosystem. X1 offers a high-performance platform for dApp development, with unique features like gas fees in OKB and enhanced liquidity access for Ethereum developers. Bridging Communities for Enhanced Blockchain Interoperability In a significant move for [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-15T07:29:41.000Z",
    "title": "Ethereum Whales Awaken: Analyzing Bullish and Bearish Signals",
    "url": "https://coinedition.com/ethereum-whales-awaken-analyzing-bullish-and-bearish-signals/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/🐳😲_An_Ethereum_whale_wallet_that_had_not_been_active_for_6_years.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/🐳😲_An_Ethereum_whale_wallet_that_had_not_been_active_for_6_years.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/🐳😲_An_Ethereum_whale_wallet_that_had_not_been_active_for_6_years-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/🐳😲_An_Ethereum_whale_wallet_that_had_not_been_active_for_6_years-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/🐳😲_An_Ethereum_whale_wallet_that_had_not_been_active_for_6_years-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/🐳😲_An_Ethereum_whale_wallet_that_had_not_been_active_for_6_years-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent thread on X, Lookonchain, a well-known crypto market on-chain resource, delved into the sentiment surrounding Ethereum (ETH) as it broke above the $2,000 mark and sustained its position for several days. Specifically, the market tracker sought to unveil whether crypto whales and influential investors expressed bullish or bearish sentiments towards ETH through [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ethereum-whales-awaken-analyzing-bullish-and-bearish-signals/\">Ethereum Whales Awaken: Analyzing Bullish and Bearish Signals</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]