[
  {
    "source": "Cointelegraph",
    "date": "2024-03-27T08:00:22.000Z",
    "title": " Near Introduces multichain transactions from a single account ",
    "url": "https://cointelegraph.com/news/near-multichain-transactions-single-account",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZDFjNzg0NGYtYzUzNS00MDQ5LWI1YTYtOTEwOGIzNTQ3NTI5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The feature incorporates a “Multichain Gas Relayer,” eliminating the necessity for the native gas token of another chain for transactions.</p>\n                    <p><p data-ct-non-breakable=\"true\">The Near Foundation — the nonprofit organization backing the layer-1 Near Protocol — has revealed that the protocol now enables chain signatures. This advancement allows users to access multiple chains using their Near account.</p><p><a href=\"https://pages.near.org/blog/chain-signatures-launch-to-enable-transactions-on-any-blockchain-from-a-near-account/\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a press release, Eigenlayer, a restaking project developed on Ethereum, is now a launch partner with Near, contributing to the security of the chain signatures network. </p><p>The Chain Signatures feature is powered by a decentralized multi-party computation (MPC) network and secured by Near network validators.</p><p><a href=\"https://cointelegraph.com/news/near-multichain-transactions-single-account\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-27T08:02:25.000Z",
    "title": "Crypto Exchange KuCoin and Its Two Founders Are Charged With Violating U.S. Anti-Money Laundering Laws",
    "url": "https://www.cryptoglobe.com/latest/2024/03/crypto-exchange-kucoin-and-its-two-founders-are-charged-with-violating-u-s-anti-money-laundering-laws/",
    "description": "The U.S. Attorney’s Office for the Southern District of New York, in conjunction with Homeland Security Investigations (HSI), has announced the unsealing of an indictment against global cryptocurrency exchange KuCoin and two of its founders, Chun Gan (also known as “Michael”) and Ke Tang (also known as “Eric”), for serious violations of U.S. financial regulations. […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-27T08:00:49.000Z",
    "title": "KuCoin Charged With Bank Secrecy Act, Money Laundering Violations",
    "url": "https://cryptodaily.co.uk/2024/03/kucoin-charged-with-bank-secrecy-act-money-laundering-violations",
    "description": "KuCoin, one of the world’s largest cryptocurrency exchanges, and its founders, Chun Gan, and Ke Tang, have been accused of operating without adhering to proper anti-money laundering protocols."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-27T08:00:35.000Z",
    "title": "Russia to Clarify Cryptocurrency Mining Gray Areas, Including Payments",
    "url": "https://news.bitcoin.com/russia-to-clarify-cryptocurrency-mining-gray-areas-including-payments/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/77b6c709-4e55-416e-9d30-ebeb3566c3e3-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Russia to Clarify Cryptocurrency Mining Gray Areas, Including Payments\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/77b6c709-4e55-416e-9d30-ebeb3566c3e3-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/77b6c709-4e55-416e-9d30-ebeb3566c3e3-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/77b6c709-4e55-416e-9d30-ebeb3566c3e3-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/77b6c709-4e55-416e-9d30-ebeb3566c3e3-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/77b6c709-4e55-416e-9d30-ebeb3566c3e3-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/77b6c709-4e55-416e-9d30-ebeb3566c3e3-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/77b6c709-4e55-416e-9d30-ebeb3566c3e3.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Anton Siluanov, the finance minister of Russia, is prepared to discuss the gray areas surrounding cryptocurrency mining and the use of its proceeding for payments. In a recent lecture, Siluanov stated that the government needed to agree &#8220;on what can be done with cryptocurrency,&#8221; and &#8220;what cannot be done,&#8221; recognizing that the issue had been [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-27T07:41:30.000Z",
    "title": "Arbitrum Price Prediction 2024 – 2033: ARB breaks key barrier",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2024 – 2033 Scaling solutions operate on top of a blockchain’s base layer, such as Ethereum, to enhance performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their transactions more efficiently. Arbitrum adds to Ethereum’s numerous advantages, boosts the network’s sluggish performance, and [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-27T07:51:11.000Z",
    "title": "Rebel Satoshi’s RECQ ‘moons’ as Solana outshines Ethereum ",
    "url": "https://crypto.news/rebel-satoshis-recq-moons-as-solana-outshines-ethereum/",
    "description": "Rebel Satoshi’s RECQ presale has been attracting investor attention, analysts predict massive surge soon #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-27T07:48:40.000Z",
    "title": "Cat-themed meme coins see surging interest across the market",
    "url": "https://crypto.news/cat-themed-meme-coins-see-surging-interest-across-the-market/",
    "description": "Several cat-themed meme coins are trending on CoinGecko, with some recording three-digit gains over the past week.  While the overall crypto market is seeing a brief liquidation, as traders are taking profits from leading assets like Bitcoin and Ethereum –&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-27T07:40:17.000Z",
    "title": "Litecoin ETF Rumors Fuel 10% Surge As Institutions Hint At Interest",
    "url": "https://www.newsbtc.com/news/litecoin/litecoin-etf-rumors-fuel-10-surge/",
    "description": "Rumors regarding a potential spot Litecoin (LTC) Exchange-Traded Fund (ETF) have sparked a significant price surge, with the digital asset gaining 10% amid speculation of institutional interest. Fox Business journalist Eleanor Terrett, through a post on X (formerly Twitter), unveiled insights suggesting growing institutional intrigue towards a Litecoin ETF. Terrett shared, “SCOOP: Hearing rumblings on the institutional level about possible interest in a Litecoin ETF. The logic is that because of LTC functional similarities to BTC, the SEC may be more inclined to approve it, possibly even more so than ETH.” Why A Spot Litecoin ETF Could Be Possible This statement comes at a pivotal time as the crypto market continues to navigate through regulatory uncertainties and growing interest from traditional financial institutions. Adding to the buzz, Terrett highlighted recent actions by the Coinbase Derivatives to launch futures contracts for Dogecoin, Litecoin, and Bitcoin Cash, all set to begin on April 1st, 2024. Related Reading: Litecoin Beats Out Dogecoin, Bitcoin To Emerge As Top Crypto For Payments These futures contracts, as detailed, are part of Coinbase’s strategic move to diversify its offerings, leveraging the self-certification approach under CFTC Regulation 40.2(a). This approach permits entities to launch new products without the explicit approval of the CFTC, provided they comply with the Commodity Exchange Act and accompanying regulations. Moreover, the recent classification of Ethereum (ETH) and Litecoin (LTC) as commodities by the Commodity Futures Trading Commission (CFTC) in its lawsuit against KuCoin has added another layer of legitimacy to the discourse surrounding Litecoin’s regulatory standing. The CFTC’s action emphasizes its view of certain cryptocurrencies as commodities. Amidst these regulatory clarifications and developments, discussions about the potential approval of a spot Litecoin ETF have intensified. Luke Martin, a renowned crypto analyst, echoed the sentiment, suggesting that the approval of an Ethereum ETF could pave the way for other &#8220;old altcoins,&#8221; like Litecoin, which may have a stronger case for not being classified as securities. Related Reading: Litecoin Whale Deposits Big To Binance, LTC’s 3% Drop To Extend? He stated, “When the ETH ETF launches and passes, the question then becomes especially with the SEC&#8217;s track record versus tokens [&#8230;] there&#8217;s other dinosaur old altcoins which you can make almost a stronger case [that] they&#8217;re not a security, one that sounds ridiculous but if you think deeply about it, it&#8217;s true &#8211; Dogecoin you could probably prove easier is not a security than ETH. Why wouldn&#8217;t they launch Litecoin, Dogecoin?” CFTC FILING: COINBASE FILES TO LIST FUTURES FOR $DOGE $LTC $BCH Is this a hint for which alts are getting ETFs next?! Spoke with @zhusu a few weeks ago about this exact scenario, and the unique trading opportunities that come with a $DOGE ETF. pic.twitter.com/tlyFgDvUhR &#8212; Luke Martin (@VentureCoinist) March 21, 2024 Adding to the momentum, Alan Austin, Managing Director at the Litecoin Foundation, expressed enthusiasm about the prospects of a spot Litecoin ETF, stating, &#8220;I’ll say it again, love or hate ETFs, the first company to launch a Litecoin ETF is going to crush it!&#8221; LTC Price Is Lagging Behind Despite the current buzz, Litecoin’s price analysis indicates that it is still down by 77% from it&#8217;s all-time high in May 2021, signaling a bearish trend in comparison to other cryptocurrencies that have already surpassed their 2021 peaks. Nevertheless, a recent break above the 200-week EMA has ignited a glimmer of bullish momentum. Overcoming the red resistance zone between $102 and $106 could be critical for Litecoin to reach new heights, with the $128 mark (0.236 Fibonacci retracement level) as a potential near-term target. Featured image created with DALL·E, chart from TradingView.com"
  }
]