[
  {
    "source": "CoinDesk",
    "date": "2024-01-17T16:39:57.000Z",
    "title": "MetaMask's Secret Project Could Shake Up How Ethereum Works",
    "url": "https://www.coindesk.com/tech/2024/01/17/metamasks-secret-intents-project-could-radically-change-how-users-interact-with-blockchains/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "MetaMask is quietly testing new tech that uses third parties to route user transactions. It will eventually be made available outside of MetaMask and will be closely scrutinized for how it manages to avoid centralization concerns."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-17T17:01:02.000Z",
    "title": "Crypto Developers Dropped 24% in 2023 as Builders Look Beyond Bitcoin, Ethereum",
    "url": "https://decrypt.co/213007/crypto-developers-dropped-24-builders-look-beyond-bitcoin-ethereum",
    "description": "A new report from Electric Capital shows the depth and breadth of building across multiple blockchains is simultaneously improving."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-17T16:45:00.000Z",
    "title": "'Look Touch Own': OONA Discusses Her Performance Art Exhibition",
    "url": "https://decrypt.co/videos/live-events/79jpGlCe/look-touch-own-oona-discusses-her-performance-art-exhibition",
    "description": "Conceptual artist OONA joins moderator Raina Marie to discuss \"Look Touch Own,\" her performance art exhibition featuring her own former breast implants, which have been tokenized. This conversation was recorded at Rug Radio's R Haus event at Art Basel Miami in December 2023."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-17T16:40:00.000Z",
    "title": "Genius Marketing by Genius Marketers: How Crypto Builders Can Reach the Masses",
    "url": "https://decrypt.co/videos/live-events/YiQgzWJW/genius-marketing-by-genius-marketers-how-crypto-builders-can-reach-the-masses",
    "description": "Rug Radio founder Farokh Sarmad moderates a conversation between 9dcc founder and CEO Gmoney and Serotonin founder and CEO Amanda Cassatt about the challenges and opportunities in Web3 marketing and how they're navigating the ever-evolving space. Recorded at Rug Radio's R Haus event at Art Basel Miami in December 2023."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-17T17:00:37.000Z",
    "title": "The Man Who Bought $50M Worth of Ethereum Minutes Before Larry Fink Interview Is Bagging This Defi Token",
    "url": "https://cryptodaily.co.uk/2024/01/the-man-who-bought-50m-worth-of-ethereum-minutes-before-larry-fink-interview-is-bagging-this-defi-token",
    "description": "The cryptocurrency world is abuzz with the news of a mysterious investor who snapped up a whopping $50 million worth of Ethereum just minutes before Larry Fink's interview on CNBC,"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-17T16:52:38.000Z",
    "title": "Bitcoin (BTC) Price Analysis:  Clouded Technical Bias – 18 January 2024",
    "url": "https://cryptodaily.co.uk/2024/01/bitcoin-btc-price-analysis-clouded-technical-bias-18-january-2024",
    "description": "Bitcoin (BTC/USD) awaited new technical guidance early in the Asian session as the pair continued to trade above the 41661.16 area, a recent upside price objective related to buying pressure around the 25983 and 29328 levels."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-17T16:54:56.000Z",
    "title": "As Ethereum Tests $2,6K, Investors Keep Their Eyes on These Cryptos",
    "url": "https://cryptodaily.co.uk/2024/01/as-ethereum-tests-26k-investors-keep-their-eyes-on-these-cryptos",
    "description": "Discover the latest crypto market trends as Ethereum (ETH) tests a significant $2.6K mark. See why savvy investors are also expanding their focus to promising tokens like Sei (SEI), Aptos (APT) and NEAR Protocol (NEAR), each presenting unique growth prospects. Dive into our detailed analysis of these emerging cryptos and learn how they are navigating through market dynamics, token unlocks, and potential rallies in a landscape dominated by ETH's impressive strides."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-17T16:56:01.000Z",
    "title": "Top Altcoins You Need to Keep an Eye On",
    "url": "https://cryptodaily.co.uk/2024/01/top-altcoins-you-need-to-keep-an-eye-on",
    "description": "Explore the dynamic cryptocurrency market of 2024 with insights on Bitcoin ETFs and key altcoins Solana, Chainlink, and Avalanche. Dive into the latest trends, market analyses, and strategic developments shaping the future of digital assets."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-17T16:45:58.000Z",
    "title": "Forget About Polygon (MATIC): This Crypto Is Going to Outperform It in 2024",
    "url": "https://cryptodaily.co.uk/2024/01/forget-about-polygon-matic-this-crypto-is-going-to-outperform-it-in-2024",
    "description": "Discover the latest controversy shaking up the crypto world: Polygon (MATIC) faces allegations of mismanagement and market manipulation, casting doubt on its future performance. Amidst these challenges, a new and promising cryptocurrency is emerging, set to potentially outshine Polygon in 2024 with its innovative technology and transparent practices. Stay informed about this rising star in the crypto market, which is poised to offer investors exciting opportunities and potentially superior returns compared to MATIC."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-17T16:47:50.000Z",
    "title": "Court Rules Do Kwon Trial To Be Postponed Till March",
    "url": "https://cryptodaily.co.uk/2024/01/court-rules-do-kwon-trial-to-be-postponed-till-march",
    "description": "The US Securities and Exchange Commission (SEC) has concurred with a court ruling postponing the trial of former Terraform CEO Do Kwon until March to ensure that both Do Kwon and Terraform Labs are tried together."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T17:00:38.000Z",
    "title": "BRICS’ missing piece: Saudi Arabia’s peculiar delay in joining",
    "url": "https://www.cryptopolitan.com/saudi-arabias-peculiar-delay-joining-brics/",
    "description": "Saudi Arabia&#8217;s hesitation to join the BRICS alliance, despite an open invitation and established trade relations with member countries, continues to raise eyebrows in the international community. This reluctance was highlighted by Saudi Arabia&#8217;s Minister of Commerce, Majid Al-Kasabi, during a panel at the World Economic Forum in Davos. While the kingdom&#8217;s media previously reported [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T16:58:55.000Z",
    "title": "Tezos Price Prediction 2024-2033: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2024-2033 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T16:45:56.000Z",
    "title": "The Graph Price Prediction 2024-2033: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2024-2033 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-17T16:40:46.000Z",
    "title": "KLAYTN PRICE ANALYSIS & PREDICTION (January 17) – Klay Signals A Fresh Buying Amid Latest Price Recovery, Gains 17% Today",
    "url": "https://nulltx.com/klaytn-price-analysis-prediction-january-17-klay-signals-a-fresh-buying-amid-latest-price-recovery-gains-17-today/",
    "description": "Following a recent bounce off a key level, Klay increased by 17% today and slightly reclaimed its previous high. It has similarly joined in the latest recovery amongst the low-cap altcoins. Klay halted buying at $0.278 last month and went through a broad correction two weeks ago. It ended that [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-17T17:00:35.000Z",
    "title": "HODLing Rewards: Average Bitcoin Long-Term Holder Now Carries 55% Profit",
    "url": "https://www.newsbtc.com/bitcoin-news/hodling-rewards-bitcoin-long-term-holder-55-profit/",
    "description": "On-chain data shows the Bitcoin long-term holders (the so-called HODLers) are now carrying an unrealized profit of 55% on average. Bitcoin Long-Term Holder NUPL Has Hit A Value Of 0.55 According to the latest weekly report from Glassnode, the profit that the BTC long-term holders are holding has gone up recently. The indicator of interest here is the &#8220;Net Unrealized Profit/Loss&#8221; (NUPL), which keeps track of the difference between the unrealized profit and loss that Bitcoin investors are carrying currently. Related Reading: Bitcoin Has Large Resistance Wall Ahead: Here’s The Level To Watch By &#8220;unrealized,&#8221; what&#8217;s meant here is that the profit or loss is yet to be harvested, as the investor carrying it hasn&#8217;t transferred their BTC on the blockchain yet. Once the holder would eventually move the coins, the profit/loss they were holding would then become &#8220;realized.&#8221; In the context of the current discussion, the NUPL of only a specific segment of the market is of relevance: the long-term holders (LTHs). The LTHs are the Bitcoin holders who have been keeping their coins dormant on the network since at least 155 days ago. These are the diamond hands of the market who are known to hold through periods of uptrends and downtrends alike, only selling when major market events take place. &#8220;This includes periods when the market sets new ATHs, around cycle tops and bottoms, and during large shifts in market structure (e.g. Mt Gox, Halvings, and now the launch of spot ETFs),&#8221; explains the analytics firm. Now, here is a chart that shows the trend in the Bitcoin LTH NUPL over the history of the asset: The value of the metric seems to have been going up in recent weeks &#124; Source: Glassnode's The Week Onchain - Week 3, 2024 As displayed in the above graph, the Bitcoin LTH NUPL has registered a rise in the last couple of months as the cryptocurrency&#8217;s spot price has gone through a notable surge. &#8220;This metric reached 0.55 this week, which is meaningfully positive, and puts the average long-term investor at a 55% unrealized profit,&#8221; notes the report. Interestingly, BTC has registered some resistance around this level during the past. As Glassnode has highlighted in the chart, the bulls encountered trouble here during August 2012, June 2016, July 2019, and August 2020. In all of these cases, the resulting top was only a local one, except for July 2019, where the recovery rally of the cycle hit a top that BTC wouldn&#8217;t surpass for a significant period of time. Generally, investors in profit are more likely to sell their coins. The higher the gains that they hold, the stronger can be the allure of profit-taking. Thus, it&#8217;s not surprising to see that the LTHs holding significant profits has lead to selling pressure in the market during previous cycles. The LTHs have indeed participated in some selling recently as well, as the data for their supply suggests. Looks like the value of the metric has seen some decline recently &#124; Source: Glassnode's The Week Onchain - Week 3, 2024 The Bitcoin LTH supply has now come down 75,000 BTC since the all-time high registered in November, while the opposite cohort, the short-term holders (STHs), have naturally gained some share. Related Reading: XRP Investors Become Fearful: Time To Buy? &#8220;Whilst 75k BTC is a meaningful sum, it should also be viewed within the context of total LTH supply accounting for a whopping 76.3% of the circulating coin supply,&#8221; says the report. BTC Price Bitcoin has continued its recent sideways trend during the past day as its price currently floats around the $42,600 level. The price of the coin hasn't shown much volatility recently &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Glassnode.com"
  }
]