[
  {
    "source": "CoinDesk",
    "date": "2023-06-01T18:51:03.000Z",
    "title": "MakerDAO Paves Way for Additional $1.28B U.S. Treasury Purchase",
    "url": "https://www.coindesk.com/markets/2023/06/01/makerdao-paves-way-for-additional-128b-us-treasury-purchase/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The protocol’s community voted for onboarding a new real-world asset vault that would invest up to the additional amount in U.S. Treasury bonds."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T18:59:05.000Z",
    "title": "Mysten Labs’ Sui Network partners with F1 Red Bull racing team",
    "url": "https://cointelegraph.com/news/mysten-labs-sui-network-partners-with-f1-red-bull-racing-team",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/67b58e3b-aba7-4139-aba8-16fad6024cdf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Red Bull team signed a $150-million sponsorship deal with crypto exchange Bybit in 2022 ahead of the market crash and major bankruptcies in the space. </p>\n                    <p><p>The Sui Network, backed by Mysten Labs, has announced a multi-year partnership with the Red Bull Formula One Racing Team less than a month after the blockchain’s mainnet went live.</p><p>In a June 1 announcement, Sui Network <a href=\"https://twitter.com/SuiNetwork/status/1664263054778060804\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it would be the official blockchain partner of the racing team, scheduled to compete in Spain on June 4. Greg Siourounis, Managing Director of the Sui Foundation, said the partnership was aimed at “demonstrat[ing] how web3 enables human connections,” while the announcement suggested “immersive digital experiences” for fans in the coming months.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Huge news: We’re officially teaming up with <a href=\"https://twitter.com/redbullracing?ref_src=twsrc%5Etfw\">@redbullracing</a>!<br><br>As the team’s Official Blockchain Partner, this multi-year partnership means that fans will have even more exciting ways to connect with Oracle Red Bull Racing. ️ <a href=\"https://t.co/7Gw8mbT3XH\">pic.twitter.com/7Gw8mbT3XH</a></p>&mdash; Sui (@SuiNetwork) <a href=\"https://twitter.com/SuiNetwork/status/1664263049623277576?ref_src=twsrc%5Etfw\">June 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Mysten Labs stepped up work on the Sui network following Meta shutting down its Diem project in 2022. The network, based on Rust-based programming language Move, went live on May 3, prompting major crypto exchange Binance to start offering trading pairs for the SUI token. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sui-mainnet-goes-live-as-token-sees-immediate-action-on-binance-okx-others\"><strong><em>SUI mainnet goes live as token sees immediate action on Binance, OKX, others</em></strong></a></p><p>In 2022, the Red Bull Formula One Racing Team <a href=\"https://cointelegraph.com/news/red-bull-racing-scores-150m-sponsorship-with-bybit\">signed a $150-million sponsorship deal</a> with crypto exchange Bybit. However, the racing division of luxury car manufacturer Ferrari, announced in January its Formula One team had <a href=\"https://cointelegraph.com/news/ferrari-cuts-ties-with-crypto-sponsor-ahead-of-2023-formula-one-season\">cut ties with Velas Blockchain</a> and chip manufacturing firm Snapdragon.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/hundreds-millions-spent-marketing-crypto-sports-fans-wasted/\"><strong><em>Billions are spent marketing crypto to sports fans — Is it worth it?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T18:54:03.000Z",
    "title": "Bitcoin price slips under $27K, but data shows BTC whales counter trading DXY strength",
    "url": "https://cointelegraph.com/news/bitcoin-price-slips-under-27k-but-data-shows-btc-whales-counter-trading-dxy-strength",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/48895f08-a58d-475c-9dd2-749ccd734562.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The US dollar index is encroaching on new year-to-date highs, but Bitcoin whale activity suggests this may be a dead cat bounce.</p>\n                    <p><p>As the summer season arrives, an unexpected heatwave is gripping financial markets</p><p>This heat is coming in the form of the US Dollar (DXY) which has been on a remarkable uptrend since late April, reaching levels unseen since early March’s banking crisis when the dollar wrecking ball wreaked havoc on asset prices.</p><p>This surge in the dollar has raised concerns among market participants due to its high inverse relationship with Bitcoin (BTC), a topic many macro and crypto analysts have <a href=\"https://cointelegraph.com/news/bitcoin-safer-than-usd-says-new-report-watch-the-market-report\">discussed repeatedly in 2023</a>. </p><p>The implications of this inverse correlation means that when the dollar rises, BTC falls and vice versa. The chart below showing the year-to-date performances of DXY (blue line) and BTC (orange line) underscores this relationship a step further. </p><p>Notice how, Bitcoin’s 2023’s performance has been propelled by a downward dollar. Not coincidentally, DXY reached its year-to-date low near 100.80 on April 13, nearly the exact date BTC reached its year-to-date high of just over $31,000. Since then, however, both have been trending in opposite directions.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/9625aa54-d43b-4544-9dde-1d04addb14ce.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>BTC and DXY year-to-date returns. Source: TradingView</em></figcaption></figure><p>Feelings of unease over what sort of summer could be in store for markets should the dollar’s uptrend continue are certainly justified at present. After all, the last time DXY broke above these levels BTC was trading below the $20,000 mark.</p><p>On the surface, this would imply that BTC still has quite a deep correction ahead before any hopes of new year-to-date highs emerge. </p><p>Taking a look deeper however, it's clear that some divergent signals beginning to emerge which suggest this dollar rally could be nearing an end. </p><p>Let’s take a look at them to see what’s been driving DXY’s recent strength, and zoom in on a notable segment of the market who has remained un-phased by Uncle Sam’s recent resurgence.</p><h2>The relationship between BTC and DXY is terminal</h2><p>Back in March, similar to now, plummeting federal funds futures were the primary driver of DXY’s strength. </p><p>For readers who might not be macroeconomic nerds, the federal funds futures represent the terminal rate, or the market’s expectation of when the Federal Reserve's hiking cycle will come to an end.</p><p>When federal funds futures fall, the terminal rate rises and consequently the dollar rises as well. The opposite is also true, which is nother inverse correlation.</p><p>To track this leading indicator, traders follow the federal funds futures ticker (ZQN2023 on TradingView). The chart can be a bit intricate, with 100 representing zero interest rate expectations, and each 0.10 increment below indicating a 10 basis point (0.10%) rate hike.</p><p>Currently, the chart reads 94.83, implying a terminal rate of 5.27%. This suggests that the market still anticipates the Fed to hike rates by at least 27 basis points beyond its current rate of 5%. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/43e083e8-34d7-4df8-8ef6-50ee7a020b94.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>July 2023 Federal Funds Futures Contracts. Source: TradingView</em></figcaption></figure><p>This is the lowest level federal funds futures had reached since early March, just before the banking crisis unfolded. </p><p>Looking at the chart again below with BTC (orange line) laid overtop shows that the mid-March reversal in terminal rate expectations were a huge driver of DXY’s drop and consequently <a href=\"https://cointelegraph.com/news/bitcoin-holds-200-week-average-as-trader-says-inflection-point-is-here\">Bitcoin’s rally above $30,000</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/eee0a12e-ec04-4c44-9fe4-83f6f65f0e2a.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>BTC and July 2023 Federal Funds Futures Contracts. Source: TradingView</em></figcaption></figure><p>If the federal funds futures were again to fall back below the 94.50 level, as they did in March, it would become very likely that the market would fall back under heavy sell pressure due to this correlation.</p><p>Notably, these federal funds futures made a strong surge on the afternoon of Wednesday May 31 when they rose over 10 basis points from the lows. </p><p>Should this trend continue and the ZQN2023 contract rise back above 95, it would signal the market's belief that the Fed's hiking cycle has concluded, potentially paving the way for rate cuts. Such easing of monetary policy would more than likely be quite bullish for BTC, and bearish for DXY. </p><p>This is especially true if the dollar index falls back down to new 2023 lows from here, and breaks below its long held support level near 100. Such price action would open up the gates for BTC to make a refreshed run above $30,000.</p><p>And with that thought in mind, there is one notable cohort of crypto market participants who appear to be front running such a reversal, Bitcoin whales.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/last-btc-price-dip-before-a-30k-breakout-bitcoin-wipes-weekend-gains\">Last BTC price dip before a $30K breakout? Bitcoin wipes weekend gains</a></em></strong></p><h2>Bitcoin whale songs</h2><p>Bitcoin whales are classified by wallet addresses that hold more than 10,000 BTC.</p><p>A species of smart money that the on-chain data scientists study intensely.</p><p>As shown on the chart below, Bitcoin whales (represented by the red dots) have been steadily increasing their holdings on net every day since April 17, a trend which coincided with Bitcoin reaching its year-to-date high above $31,000.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/bc3a0b01-53fe-4c11-a594-af8a99e3ea08.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Divergence Chart. Source: Tara-NFT</em></figcaption></figure><p>This behavior diverges from previous trends, where whale wallets accumulated Bitcoin at market bottoms, or on the way to higher highs, rather than tops. This anomaly prompts a thought-provoking question: have these whale wallets bought the top for the first time, or was April 17 not the peak?</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/79fcaa8a-17f1-476f-ad8e-7ada855f090c.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Divergence Chart. Source: Tara-NFT</em></figcaption></figure><p>This behavior from the Bitcoin market’s largest players calls into question the legitimacy of May’s <a href=\"https://jarvislabs.substack.com/p/the-king-is-dead-long-live-the-king\" target=\"_blank\" rel=\"noopener nofollow\">DXY pump</a> and adds uncertainty to bearish outlooks, especially when combined with the notable rise in federal funds futures.</p><p>As always, the market is doing its best to keep participants a step behind the next trend. </p><p>What remains to be seen is how much the rise of terminal rates and DXY in May can be attributed to escalating fears over the US’s debt ceiling stand-off. With that issue now in the rearview (pending final votes) one wonders whether or not this will lead to the dollar reverting back to its downtrend, and Bitcoin heading back above the $30,000 mark.</p><p>For the remainder of Q3 it will be crucial to closely monitor the movements of terminal rate expectations, DXY, and Bitcoin whale activity as these data points are likely to provide actionable clues prior to the next big move happening. </p><p>The coming weeks will undoubtedly shed light on these intriguing dynamics, shaping the path for both the US Dollar and the cryptocurrency market at large into the summer months and beyond.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-01T19:05:21.000Z",
    "title": "Crypto.com Secures Major Payment Institution License from MAS",
    "url": "https://cryptodaily.co.uk/2023/06/cryptocom-secures-major-payment-institution-license-from-mas",
    "description": "<p>Crypto exchange Crypto.com announced it had been granted a Major Payment Institution license (MPI) for Digital Payment Token (DPT) services from Singapore&rsquo;s MAS. </p>\n<p>On Thursday, Singapore-based cryptocurrency exchange Crypto.com announced that it received its Major Payment Institution (MPI) license from the Monetary Authority of Singapore (MAS).</p>\n\n<p dir=\"ltr\" lang=\"en\">We're excited to share our latest regulatory achievement in one of the world's leading crypto hubs, #Singapore 🇸🇬https://t.co/vCNztATSCO has been granted the Major Payment Institution Licence by The Monetary Authority of Singapore @MAS_sg Learn more:https://t.co/4PwkuGgsnr pic.twitter.com/AklwjP2Z4C</p>\n&mdash; Crypto.com (@cryptocom) June 1, 2023\n<p>\n\n</p>\n<p>In a press release, company CEO Kris Marszalek said:</p>\n\n<p>The Monetary Authority of&nbsp;Singapore&nbsp;is recognized globally as a regulator that ensures responsible innovation of the digital assets sector. We are proud to receive the licence from a regulator that prioritizes consumer protection, safety, and security.</p>\n<p>We look forward to continuing to collaborate with MAS and leading at the forefront of&nbsp;crypto&nbsp;in our home market of&nbsp;Singapore.</p>\n\n<p>The announcement comes a year after the exchange received in-principle approval from MAS in June 2022. Securing this license means Crypto.com can continue offering its DPT service to Singaporean customers.</p>\nCrypto.com Bags Another Regulatory Greenlight\n<p>The regulatory approval from Singapore&rsquo;s MAS adds to the exchanges list of regulatory permission. Crypto.com received a Payment Institution License from Brazil&rsquo;s central bank in December. In its announcement, the exchange also detailed its global regulatory status:</p>\n\n<p>In recent months, Crypto.com has received in-principle approval of its Major Payment Institution (MPI) license from the Monetary Authority of Singapore (MAS), regulatory approval as a Digital Asset Service Provider by the Autorit&eacute; des march&eacute;s financiers (AMF) in France, registration approval as a cryptoasset business from the UK Financial Conduct Authority (FCA), provisional approval of its Virtual Asset License from the Dubai Virtual Assets Regulatory Authority (VARA), Electronic Financial Transaction Act and Virtual Asset Service Provider registration in South Korea, a pre-registration undertaking with the Ontario Securities Administration in Canada, among others.</p>\n\nCrypto.com Forced to Cut Staff Following FTX Collapse\n<p>The collapse of the crypto exchange FTX caused widespread industry turmoil, and Crypto.com was not immune.</p>\n<p>In January, the exchange announced that it would cut its staff by 20% due to the &ldquo;significant damage&rdquo; caused by FTX. The company further cited economic difficulties spurred by the overall market downturn as the reason for its decision.</p>\n<p>Kris Marszalek said at the time:</p>\n\n<p>We grew ambitiously at the start of 2022, building on our incredible momentum and aligning with the trajectory of the broader industry. That trajectory changed rapidly with a confluence of negative economic developments.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-01T18:45:16.000Z",
    "title": "OVER Announces Plans Of Integrating Apple’s Latest Products",
    "url": "https://news.bitcoin.com/over-announces-plans-of-integrating-apples-latest-products/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/2023-06-01-20-14-17-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/2023-06-01-20-14-17-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/2023-06-01-20-14-17-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/2023-06-01-20-14-17-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/2023-06-01-20-14-17-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/2023-06-01-20-14-17-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/2023-06-01-20-14-17-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/2023-06-01-20-14-17.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Two new products which could change the way society interacts with the digital world may be released soon. Apple Reality Pro and Apple Glasses are the products in question, and they could be announced by Apple as early as June. If the release does happen, Over the Reality (OVER) has plans of integrating [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T18:40:15.000Z",
    "title": "How Google’s Bard Signifies a Monumental Leap Forward in AI-Language Models",
    "url": "https://www.cryptopolitan.com/googles-bard-ai-language-model/",
    "description": "Artificial Intelligence has become the cornerstone of modern technological advancement, particularly in the realm of natural language processing. This significant shift has been evident in the latest offerings from tech giants like Google, with their most recent development, an AI chatbot known as Bard, taking center stage. Bard signifies a leap forward in AI-language models, ... <a title=\"How Google&#8217;s Bard Signifies a Monumental Leap Forward in AI-Language Models\" class=\"read-more\" href=\"https://www.cryptopolitan.com/googles-bard-ai-language-model/\" aria-label=\"More on How Google&#8217;s Bard Signifies a Monumental Leap Forward in AI-Language Models\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-01T19:00:54.000Z",
    "title": "SuiNetwork becomes official blockchain partner for RedBull",
    "url": "https://crypto.news/suinetwork-becomes-official-blockchain-partner-for-redbull/",
    "description": "Oracle Red Bull Racing, a prominent team, has revealed its alliance with the recently launched Sui blockchain."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-01T18:44:14.000Z",
    "title": "Litecoin emerges as top gainer with 7.23% increase ahead of halving",
    "url": "https://crypto.news/litecoin-emerges-as-top-gainer-with-7-23-increase-ahead-of-halving/",
    "description": "According to CoinMarketCap data, litecoin is the top gainer in the last 24 hours with a 7.04% increase to $95.12."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T18:41:50.000Z",
    "title": "VeChain’s Phygital Extravaganza at Internazionali BNL d’Italia: Unleashing Blockchain Magic for Unforgettable Moments",
    "url": "https://www.crypto-news-flash.com/vechains-phygital-extravaganza-at-internazionali-bnl-ditalia-unleashing-blockchain-magic-for-unforgettable-moments/?utm_source=rss&utm_medium=rss&utm_campaign=vechains-phygital-extravaganza-at-internazionali-bnl-ditalia-unleashing-blockchain-magic-for-unforgettable-moments",
    "description": "<p>VeChain shares key moments of the just-ended ATP and WTP events.  History was made with the presentation of phygital trophy.  It was recently reported that VeChain (VET) has collaborated with Internazionali BNL d&#8217;Italia to award its first NFT integrated trophy called the &#8220;Phygital trophy&#8221; to the winner of the Association of Tennis Professionals (ATP) tour [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/vechains-phygital-extravaganza-at-internazionali-bnl-ditalia-unleashing-blockchain-magic-for-unforgettable-moments/\">VeChain&#8217;s Phygital Extravaganza at Internazionali BNL d&#8217;Italia: Unleashing Blockchain Magic for Unforgettable Moments</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T18:40:53.000Z",
    "title": "Forget The Sandbox, This Upcoming Token is Your Ticket to Get Rich in 2023",
    "url": "https://www.crypto-news-flash.com/forget-the-sandbox-this-upcoming-token-is-your-ticket-to-get-rich-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=forget-the-sandbox-this-upcoming-token-is-your-ticket-to-get-rich-in-2023",
    "description": "<p>Smart investors are always wary of buying overpriced projects, i.e., coins that have had a long bullish run. The reason for this is that chances are you’re buying the top. This way, you’ll provide liquidity for major investors that are exiting their buy positions.  Sandbox, which was launched in 2011, is one of the earliest [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/forget-the-sandbox-this-upcoming-token-is-your-ticket-to-get-rich-in-2023/\">Forget The Sandbox, This Upcoming Token is Your Ticket to Get Rich in 2023</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-01T18:45:51.000Z",
    "title": "Robert F. Kennedy Says Bitcoin (BTC) Is ‘The Perfect Currency,’ Slams SEC’s Crypto Policy: Report",
    "url": "https://dailyhodl.com/2023/06/01/robert-f-kennedy-says-bitcoin-btc-is-the-perfect-currency-slams-secs-crypto-policy-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Kennedy-Says-Bitcoin-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Kennedy-Says-Bitcoin-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Kennedy-Says-Bitcoin-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Kennedy-Says-Bitcoin-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Kennedy-Says-Bitcoin-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Kennedy-Says-Bitcoin-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Kennedy-Says-Bitcoin-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Democrat US presidential candidate Robert F. Kennedy Jr. thinks Bitcoin (BTC) is the &#8220;perfect base currency.&#8221; In a recent interview with TheStreet Crypto, Kennedy, who announced last month that he is running in the 2024 presidential campaign as a Democrat, says there needs to be &#8220;exit ramps&#8221; like crypto assets that allow Americans to avoid central [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/01/robert-f-kennedy-says-bitcoin-btc-is-the-perfect-currency-slams-secs-crypto-policy-report/\">Robert F. Kennedy Says Bitcoin (BTC) Is ‘The Perfect Currency,’ Slams SEC’s Crypto Policy: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-01T18:41:38.000Z",
    "title": "Whales Move Over $650,000,000 in Bitcoin, Ethereum, XRP and Dogecoin – Here’s Where the Crypto’s Headed",
    "url": "https://dailyhodl.com/2023/06/01/whales-move-over-650000000-in-bitcoin-ethereum-xrp-and-dogecoin-heres-where-the-cryptos-headed/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Crypto-Whale-Driving-Up.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Crypto-Whale-Driving-Up.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Crypto-Whale-Driving-Up.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Crypto-Whale-Driving-Up.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Crypto-Whale-Driving-Up.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Crypto-Whale-Driving-Up.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Crypto-Whale-Driving-Up.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Deep-pocketed crypto traders are moving around hundreds of millions of dollars worth of Bitcoin (BTC), Ethereum (ETH), Dogecoin (DOGE), and XRP. New data from whale-surveying platform Whale Alert reveals that crypto whales have shifted about $650 million worth of funds during the last few days, with the majority of the transfers involving Bitcoin. Whale Alert [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/01/whales-move-over-650000000-in-bitcoin-ethereum-xrp-and-dogecoin-heres-where-the-cryptos-headed/\">Whales Move Over $650,000,000 in Bitcoin, Ethereum, XRP and Dogecoin – Here’s Where the Crypto’s Headed</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]