[
  {
    "source": "Decrypt",
    "date": "2023-08-30T22:50:20.000Z",
    "title": "Can AI Make 'Call of Duty' Matches Less Toxic? We're About to Find Out",
    "url": "https://decrypt.co/154375/ai-make-call-duty-matches-less-toxic-about-find-out",
    "description": "Activision has introduced AI chat moderation in Call of Duty games in an effort to curtail toxic behavior in real time."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-30T23:00:13.000Z",
    "title": "Several exchanges show alarming fall in Bitcoin holdings",
    "url": "https://cryptoslate.com/insights/multiple-exchanges-show-alarming-fall-in-bitcoin-holdings/",
    "description": "<p>Quick Take Recent data analysis reveals a precipitous decline in Bitcoin reserves housed by several prominent exchanges, which potentially signals their risk of being depleted. Glassnode estimates that there are approximately 2.257 million Bitcoins across all exchanges. Specifically, exchanges with 20,000 or less Bitcoins are at a heightened risk. For instance, Huobi currently holds about [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/multiple-exchanges-show-alarming-fall-in-bitcoin-holdings/\">Several exchanges show alarming fall in Bitcoin holdings</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-30T23:00:37.000Z",
    "title": "Grayscale Victory Sends Bitcoin Open Interest Surging After Hitting One-Year Lows",
    "url": "https://www.newsbtc.com/news/bitcoin/grayscale-bitcoin-open-interest/",
    "description": "Over the last couple of weeks, the Bitcoin open interest had been on a downtrend that sent it toward one-year lows. However, with the Grayscale victory against the SEC coming on Tuesday, August 29, and sending a positive wave across the entire region, open interest in the digital asset has begun to surge once more. Bitcoin Open Interest Pulls A Quick Reversal On-chain data tracking platform Kaiko reported on Tuesday, August 29, that the Bitcoin open interest had been on the decline for a while. In the chart shared by the tracker, it is obvious that this BTC metric had previously fallen significantly since 2022. Related Reading: Is Vitalik Buterin Selling His ETH Stash? Let’s Take A Look At His Transactions 🤔📈#BTC open interest continued declining last week after the Aug 17 sell-off, hitting its lowest level since the collapse of Terra in May 2022.🗓️ pic.twitter.com/M5L07ReabY — Kaiko (@KaikoData) August 29, 2023 As August drew to a close, the open interest in the digital asset eventually declined to levels not seen since the Terra network collapse back in May 2022. This suggested that it could be a good chance to get into Bitcoin and it would be proven true not too long after. On the same day, news broke that Grayscale had triumphed over the United States Securities and Exchange Commission (SEC) in court over its bid for its Spot Bitcoin ETF filing to be reconsidered. This triggered a rapid uptrend in the price of the digital asset and the open interest followed suit. According to data from Coinglass, the Bitcoin open interest is seeing double-digit growth on some exchanges already. The open interest on the dYdX exchange is up over 35%, and the cumulative open interest across all exchanges is now in the green, rising 9.55% in the last 24 hours. Open interest recovers following Grayscale win &#124; Source: Coinglass Does This Mean BTC Will Continue The Uptrend? For now, the price of Bitcoin is still purely driven by the hype from the Grayscale victory. This means that there is no telling how long the uptrend will last and when it will start correcting downward. However, as long as investors remain optimistic about the victory, BTC will continue to enjoy green days. Related Reading: XRP Price Faces Immense Sell Pressure That Could Trigger 20% Decline As for open interest, a recovery isn’t always a good thing as it opens up an avenue for shorters to enter the market. For example, a look at Keiko’s chart shows open interest was high leading up to the FTX collapse in 2022. Then in early 2023 when the price of Bitcoin was rallying, open interest fell before picking up steam once more. For now, BTC is still enjoying the spike in attention. The price of the cryptocurrency is up 5.35% in the last 24 hours to trade at $27,349. BTC retraces after touching $28,000 &#124; Source: BTCUSD on Tradingview.com Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from Unsplash, chart from TradingView.com"
  }
]