[
  {
    "source": "Bitcoin.com",
    "date": "2023-12-16T17:00:17.000Z",
    "title": "NFT Sales Soar to Over $500M; Bitcoin Leads With Unprecedented Growth",
    "url": "https://news.bitcoin.com/nft-sales-soar-to-over-500m-bitcoin-leads-with-unprecedented-growth/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/nftbtc-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"NFT Sales Soar to Over $500M; Bitcoin Leads With Unprecedented Growth\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/nftbtc-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nftbtc-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nftbtc-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nftbtc-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nftbtc-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nftbtc-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/nftbtc.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Sales of non-fungible tokens (NFTs) have surged by 52.81% over the past week, reaching a total of $503.35 million. Bitcoin has emerged as the frontrunner in this week&#8217;s NFT market, generating $276.79 million in sales, surpassing Ethereum&#8217;s $99.67 million, which previously held the top spot. Bitcoin Once Again Outperforms Ethereum in Thriving NFT Market The [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-16T17:08:06.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-16T17:05:13.000Z",
    "title": "Memecoin Price Prediction 2023 – 2040: Is MEME A Wise Investment?",
    "url": "https://www.cryptopolitan.com/memecoin-price-prediction-2023-2040-is-meme-a-wise-investment/",
    "description": "Meme coins have sparked a lot of buzz in the cryptocurrency world, and one particular token that has gained considerable attention is Memecoin (MEME). As the native ecosystem token of Memeland, which is the web3 venture studio by 9GAG, MEME holds a special place in the meme community. With any new cryptocurrency comes the question [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-16T16:58:40.000Z",
    "title": "Pokemon Scarlet and Violet: Indigo Disk Trade Codes for Exclusive Pokemon",
    "url": "https://www.cryptopolitan.com/pokemon-scarlet-and-violet-indigo-disk-trade/",
    "description": "In the world of Pokémon Scarlet and Violet&#8217;s Indigo Disk DLC, completing the Blueberry Pokédex is no easy task. Players must obtain version-exclusive Pokémon to achieve this goal, but what if you don&#8217;t own both versions of the game? Fear not, because there&#8217;s a solution: Indigo Disk Trade Codes. These codes, curated by Pokemon enthusiast [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-16T17:00:51.000Z",
    "title": "Ripple Executive Gives 3 Bold Predictions On Crypto Regulations In 2024",
    "url": "https://www.newsbtc.com/ripple-2/ripple-executive-gives-3-bold-predictions-on-crypto-regulations-in-2024/",
    "description": "As the crypto market gears up for 2024, the chief legal officer of blockchain payment company Ripple, Stu Alderoty, has released three projections on crypto regulations that could impact investors&#8217; confidence ahead of a year expected to start the new bull cycle by many analysts.  Related Reading: XRP Bull Run Confirmed: Largest Bull Flag In Crypto History Just Formed Ripple And SEC To End Legal Tussle In 2024, Alderoty Says In an X post on Friday, December 15,  Ripple shared the predictions of Alderoty on policy and US regulations in 2024. The post included three bold forecasts by the company’s chief legal officer, which generally present a dual outlook on the crypto space. Firstly, Alderoty expects the ongoing court case between Ripple and the US Securities and Exchange Commission (SEC) to come to its conclusion in the new year.  The blockchain payment firm already scored a “massive” partial victory over the US regulators when Judge Analisa Torress ruled that programmatic sales of XRP do not qualify as a security offering. While many still expect the SEC to still challenge this decision in the Court of Appeals following a final judgment, Alderoty projects the 3-year legal tussle, which he described as a “misguided lawsuit” by the SEC, will finally come to an end.  However, he predicts the commission will continue with its current enforcement action on key players in the crypto space. In addition to Ripple, the SEC has also launched against multiple crypto establishments, including Binance, Coinbase, Gemini, etc.  In his second prediction on US crypto regulations, Alderoty anticipates that the judiciary will continue to curtail the SEC’s excesses in terms of regulation of the crypto space. As a result, the Ripple executive believes the commission will continue to record more losses in court, as seen in similar cases against Ripple and Grayscale. However, while this may be interpreted as a positive forecast for crypto enthusiasts, it would eventually lead to an intervention by the US Supreme Court which could result in a plethora of possibilities.  Related Reading: XRP Bull Run Confirmed: Largest Bull Flag In Crypto History Just Formed Ripple CLO Foresees No Regulatory Framework Yet Alderoty’s final prediction on US crypto regulations centered on legislative action by the US Congress. While the Ripple Executive expects the US lawmakers will eventually unanimously agree on the need to create a crypto regulatory framework, He believes there will be difficulty in taking action stemming from disagreements on the specific measures and regulations to be implemented.  In other news, the crypto market is now valued at $1.6 trillion, having experienced 0.5% devaluation in the last 24 hours. XRP, which currently ranks as the fifth-largest cryptocurrency, is trading at $0.6203 with a 0.12% decline over the last hour.  XRP trading at $0.6197 on the daily chart &#124; Source: XRPUSDT chart on Tradingview.com Featured image from The Student Room, chart from Tradingview"
  }
]