[
  {
    "source": "Decrypt",
    "date": "2023-10-25T00:58:06.000Z",
    "title": "Habitat is Meta's Vision for the Future of Human-Robot Cohabitation",
    "url": "https://decrypt.co/203160/meta-human-robot-habitat-embodied-ai",
    "description": "From following you around to helping you tidy up your room, Meta's latest AI advancements promise a future where robots are more than just tools."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-25T00:46:36.000Z",
    "title": "Grayscale ETF ruling comes into effect; Bitcoin experiences 7.6% daily gains",
    "url": "https://cryptoslate.com/grayscale-etf-ruling-comes-into-effect-bitcoin-experiences-7-6-daily-gains/",
    "description": "<p>Courts issued a new mandate concerning Grayscale&#8217;s spot Bitcoin ETF proposal on Oct. 23, followed by gains across multiple markets. Grayscale aims to convert its GBTC fund to a spot Bitcoin exchange-traded fund (ETF). Courts issued a judgment compelling the U.S. Securities and Exchange Commission (SEC) to review the relevant proposal on Aug. 29. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/grayscale-etf-ruling-comes-into-effect-bitcoin-experiences-7-6-daily-gains/\">Grayscale ETF ruling comes into effect; Bitcoin experiences 7.6% daily gains</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-25T01:00:46.000Z",
    "title": "66% Of Top Smart Contracts On Base Have One Big Problem",
    "url": "https://www.newsbtc.com/news/66-of-top-smart-contracts-on-base-have-one-big-problem/",
    "description": "14/21, or 66%, of the top gas-consuming smart contracts on Base, a layer-2 platform for building and deploying smart contracts, are unverified. According to Token Terminal data on October 24, the same contracts are some of the most actively used, reading from gas fee trends over the last month.  Friend.tech Leads The Gas Race On Base Base is a layer-2 scaling solution and one of OP Mainnet and Arbitrum&#8217;s competitors. The platform relies on the Optimistic Rollup technique, allowing transactions to be batched off-chain before being confirmed on the mainnet. This is the same approach competitors, including Arbitrum and OP Mainnet, adopted.  As of October 24, the most gas-consuming protocol already labeled and known to be deployed from a given developer is Friend.tech. Still, the developer remains anonymous. The decentralized social media protocol allows users to buy and sell keys to each other&#8217;s X accounts. In this way, trading parties can access exclusive in-app chatrooms and content by a given user.  By deploying on Base, Friend.tech users enjoy lower trading fees than they would have launched on the mainnet. Beyond fees, the protocol can also scale since the layer-2 solution can handle higher throughput than the mainnet. Related Reading: Economist Peter Schiff Raises Concerns About Spot Bitcoin ETFs In the last month, Friend.tech generated over $253,000 in gas fees. The execution fee, often known as layer-2 fee, on Base, which uses Optimism, is set by the network and is flat. The fee prevents users from spamming the network and rewards nodes that prove all transactions submitted on the platform. The other fee is the approximate for confirming the same transaction batch on the mainnet. This fee is generally higher than the execution fee. The Case Of Popular But Unverified Smart Contracts While gas fees generated by Friend.tech is over $253,000, it is down over 47% in the last month. This could suggest that trading activity fell since the fee generated by a network is directly proportional to how frequently it is used.  Friend.tech fees, when writing, remain suppressed, underperforming the activity of unverified smart contracts, looking at fees generated over the last month. Over the previous 30 days, one unverified contract has seen a 104% increase in trading fees, reaching $42,000. Another contract has increased by 1,690%, exceeding $11,000 in the same period. Related Reading: Ethereum End Of Month Challenge: Can ETH Reach $2,000 Amid $21 Billion DeFi TVL? As the name suggests, these unverified codes have yet to be confirmed by a third party. This can mean there is no guarantee that the same developer built and deployed code on Base. At the same time, the code might contain malicious code that could steal from addresses it interacts with. Feature image on Canva, chart from TradingView"
  }
]