[
  {
    "source": "CoinDesk",
    "date": "2024-04-08T13:43:47.000Z",
    "title": "Detained Binance Exec Pleads Not Guilty to Money Laundering Charges in Nigeria: Reports  ",
    "url": "https://www.coindesk.com/policy/2024/04/08/detained-binance-exec-pleads-not-guilty-to-money-laundering-charges-in-nigeria-reports/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Tigran Gambaryan was remanded pending trial, reports say."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-04-08T14:00:11.000Z",
    "title": "Runes Liquid Fund launches with $3 million investment as halving nears",
    "url": "https://cryptoslate.com/runes-liquid-fund-launches-with-3-million-investment-as-halving-nears/",
    "description": "<p>Sora Ventures, a venture capital firm focused on the Bitcoin ecosystem, has announced the successful raise of $3 million to launch a Runes Liquid Fund, a new investment vehicle dedicated to investing in liquid assets on the Runes Protocol. Investors include Bankless Ventures, SpaceshipDAO, entities from BTC Inc. Bitcoin Magazine, and Serafund. Runes refers to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/runes-liquid-fund-launches-with-3-million-investment-as-halving-nears/\">Runes Liquid Fund launches with $3 million investment as halving nears</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-08T14:08:46.000Z",
    "title": "Bitcoin Loses Hold of $70K, Ethereum Dips, and $MEDA Presale Continues to Rake in Funds",
    "url": "https://cryptodaily.co.uk/2024/04/bitcoin-loses-hold-of-70k-ethereum-dips-and-meda-presale-continues-to-rake-in-funds",
    "description": "Bitcoin (BTC) stumbles as the US government releases over $100 million of BTC into the market. Ethereum (ETH) loses value as financial advisor calls for spot ETF approval delay. Meanwhile, investors continue investing in Milei Moneda’s ($MEDA) presale."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-08T14:03:27.000Z",
    "title": "Pepecoin (PEPE): Cryptocurrency Millionaire Adds More PEPE & Shiba Budz (BUDZ) To Holdings Here's Why",
    "url": "https://cryptodaily.co.uk/2024/04/pepecoin-pepe-cryptocurrency-millionaire-adds-more-pepe-shiba-budz-budz-to-holdings-heres-why",
    "description": "Recently, a cryptocurrency millionaire has caught the attention of the market by increasing their holdings in Pepecoin (PEPE) and Shiba Budz (BUDZ)."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-08T13:58:31.000Z",
    "title": "Top 3 Cryptocurrencies to Break The Chart: Shiba Inu, Dogecoin and A.i Driven Token O2T",
    "url": "https://cryptodaily.co.uk/2024/04/top-3-cryptocurrencies-to-break-the-chart-shiba-inu-dogecoin-and-ai-driven-token-o2t",
    "description": "In the bustling world of cryptocurrency, a few names have risen above the noise, capturing the imagination of investors and enthusiasts alike"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-08T13:49:52.000Z",
    "title": "Swaap Labs Launches Its Earn Platform To Enhance Yields Across The DeFi Ecosystem",
    "url": "https://cryptodaily.co.uk/2024/04/swaap-labs-launches-its-earn-platform-to-enhance-yields-across-the-defi-ecosystem",
    "description": "DeFi protocol Swaap Labs launches new yield-earning protocol, Swaap Earn."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-08T13:49:15.000Z",
    "title": "Pepecoin (PEPE) Vs O2T – Why This Pepecoin (PEPE) Nemesis Has Showed 500% Better Results for Holders?",
    "url": "https://www.cryptopolitan.com/pepecoin-pepe-vs-o2t-why-this-pepecoin-pepe-nemesis-has-showed-500-better-results-for-holders-2/",
    "description": "The emergence of Option2Trade (O2T) as a formidable contender to the meme coin Pepecoin (PEPE) has sparked intense interest and debate among investors and enthusiasts alike. Achieving an astounding 500% better performance for its holders, Option2Trade (O2T) has not only challenged the status quo but also redefined the metrics of success in the digital currency [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-08T13:47:44.000Z",
    "title": "Ethena Backers Join New ENA Rival Positioned To Profit More Than Ethena",
    "url": "https://www.cryptopolitan.com/ethena-backers-join-new-ena-rival-positioned-to-profit-more-than-ethena/",
    "description": "The cryptocurrency ecosystem thrives on innovation and the constant influx of new projects that challenge the status quo, offering investors fresh opportunities to diversify their portfolios and potentially reap substantial rewards. One such emerging narrative is the strategic shift of Ethena (ENA) backers towards a promising new rival in the crypto sphere, Shiba Budz (BUDZ). [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-08T13:44:16.000Z",
    "title": "Dogwifhat Rallies, $SLOTH Presale Hits $10M – Meme Coin Market Pumps Ahead of Doge Day",
    "url": "https://www.cryptopolitan.com/dogwifhat-rallies-sloth-presale-hits-10m-meme-coin-market-pumps-ahead-of-doge-day/",
    "description": "The crypto market is bouncing back after a dip. Solana sensations Dogwifhat and Slothana rule the meme coin domain.&#160; Dogwifhat pumped 14% on the daily chart. Slothana’s viral office sloth, on the other hand, broke past the $10M milestone. $SLOTH’s grand reception hints at an explosive launch in the next few days. DOGE20, on the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-08T13:44:14.000Z",
    "title": "Bitcoin & Ethereum Prices Surge as Coinbase Wins Court Case",
    "url": "https://www.cryptopolitan.com/bitcoin-ethereum-prices-surge-as-coinbase-wins-court-case/",
    "description": "Bitcoin and Ethereum are on a tear thanks to a huge Coinbase court victory over the weekend. Adding to the bullish sentiment, Bitcoin Minetrix (BTCMTX), a new cloud mining project, continues to generate hype – with its presale closing in on the $13 million milestone. Crypto Market Booms as BTC &#38; ETH Take Off Crypto [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-08T13:44:11.000Z",
    "title": "Dogwifhat and Pepe See Gains This Monday as Dogecoin20 Could Pump Next",
    "url": "https://www.cryptopolitan.com/dogwifhat-and-pepe-see-gains-this-monday-as-dogecoin20-could-pump-next/",
    "description": "Meme coins have had another strong start to the week with the total market cap rising 4.3% to $64.6 billion at the time of press. Leading the way are two of the hottest meme coins of 2024 &#8211; Dogwifhat and Pepe with gains of 12.27 and 7.5% respectively.&#160; Finding considerable support at $3.20, Dogwifhat has [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-08T14:00:47.000Z",
    "title": "Bitcoin Price Eclipses $72,000: 5 Major Factors",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-eclipses-72000-5-major-factors/",
    "description": "In the early US hours of Monday, Bitcoin witnessed a significant surge, with its price climbing above the $72,000 mark. The ascent, marked by a more than 4.5% increase within a mere five-hour window from below $69,500 to an intra-day high of $72,579, can be attributed to a confluence of factors that have stirred the crypto market. #1 Strong Bitcoin Spot Demand The rally appears to be fueled by robust demand in the Bitcoin spot market, hinting at the potential sustainability of the move. Crypto analyst Daan Crypto Trades (@DaanCrypto) noted the healthy market dynamics, stating on X, &#8220;Funding rates still looking solid. Healthy reset, price slowly grinding up. That&#8217;s what we want and how we want to keep it. If longs start aping again while spot bid stops, then that will end up in another flush at some point. For now, all good.&#8221; Related Reading: 12 Days Until Bitcoin Halving: Why $100,000 Isn’t Much Further Away In tandem with the rising spot prices, data from Coinglass reveals that $40.7 million in BTC shorts were liquidated today, further propelling the price upwards. #2 BTC Halving The imminence of the next Bitcoin halving, slated to occur roughly 12 days from now on April 20, has also probably played a pivotal role. Historically, Bitcoin has experienced a pre-halving price retraction followed by a significant rally leading into the event. The halving will reduce the Bitcoin reward from approximately 900 coins per day to 450 coins. Skybridge Capital&#8217;s Anthony Scaramucci shared his insights with CNBC recently, highlighting the unpriced nature of the upcoming halving and its potential to further drive Bitcoin&#8217;s price. “They’re now saying that the halving is priced in. I don’t believe that. I think Bitcoin has a lot more to go here,” he stated. At current prices, roughly $65 million in Bitcoin ETF inflows per day are needed to buy up the daily mined supply. In 2.5 weeks, that&#8217;s only $32.5 million. #3 BTC Follows Gold The correlation between Bitcoin and gold, both considered safe-haven assets, is another factor contributing to Bitcoin&#8217;s price movement. Gold&#8217;s strong opening this week, reaching a new all-time high of $2.253, has been mirrored by Bitcoin&#8217;s price trajectory. Gold enthusiast Peter Schiff and crypto analyst Michaël van de Poppe have both remarked on the positive correlation between the two assets, suggesting a shared momentum amid economic uncertainties. Gold bug Peter Schiff commented via X: “It&#8217;s been a volatile Sunday night for gold. After an early $27 sell off, it rallied over $45, hitting a new record high above $2,348. This is an early stage of a major repricing of gold to reflect much higher future inflation. It&#8217;s a warning that monetary policy is too loose.” Related Reading: $115-Million Bitcoin Whale Wakes Up From 10-Year Slumber – What’s Next? Crypto analyst Michaël van de Poppe remarked: &#8220;There we go. Gold opening up with a big new upwards candle and Bitcoin is back to $71,000. Given the strength on commodities and the current price action of Bitcoin, I suspect we&#8217;ll see a test of the all-time high coming up.” #4 Strong Weekly Close The significance of Bitcoin&#8217;s weekly candle close was highlighted by CRG, a renowned analyst, who pointed to it as a contributor to the rally. The ability of Bitcoin&#8217;s price to close sustainably above its 2021 high for the second consecutive week signals a strong bullish sentiment in the market. Great weekly close Fresh all time highs this week Source: my plums pic.twitter.com/wyxwomdDjZ &#8212; CRG (@MacroCRG) April 8, 2024 #5 Hong Kong Readies For Spot ETF Launch Finally, the anticipation of the launch of spot Bitcoin ETFs in Hong Kong may have injected optimism into the market. Reports indicate that major Chinese asset managers, such as Harvest Fund and Southern Fund, managing assets worth over $230 billion and $280 billion, respectively, are positioning themselves through Hong Kong subsidiaries to enter the Bitcoin ETF market, awaiting regulatory approval. #6 Extra: The &#8220;Ethena-Effect&#8221; Ethena Labs has started purchasing BTC as part of a cash-and-carry trade in order to create a “safer” USDe synthetic dollar product for users. The move is being critically observed by the crypto community. Ethena now holds more than half a billion in BTC hedged across Binance, OKX and Deribit Ready for the halvening ₿ pic.twitter.com/auquK59DfY &#8212; Seraphim (@MacroMate8) April 8, 2024 At press time, BTC traded at $72,103. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-04-08T13:44:22.000Z",
    "title": "Bitget Lists SAGA: Empowering the Next Wave of Blockchain Innovation",
    "url": "https://www.crypto-news-flash.com/bitget-lists-saga-empowering-the-next-wave-of-blockchain-innovation/?utm_source=rss&utm_medium=rss&utm_campaign=bitget-lists-saga-empowering-the-next-wave-of-blockchain-innovation",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/SAGA_171258280687YtDFAEou.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/SAGA_171258280687YtDFAEou.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/SAGA_171258280687YtDFAEou-300x180.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/SAGA_171258280687YtDFAEou-768x461.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/SAGA_171258280687YtDFAEou-150x90.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/SAGA_171258280687YtDFAEou-450x270.png 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Victoria, Seychelles, April 8th, 2024, Chainwire Bitget, the world&#8217;s leading cryptocurrency exchange and Web3 company, has announced the listing of Saga(SAGA). This new addition to the cryptocurrency landscape is set to redefine the way developers engage with blockchain technology, particularly within the rapidly expanding metaverse and related sectors. Saga works as a game-changer for blockchain [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-04-08T14:02:59.000Z",
    "title": "FTX Sells $1.6B in Locked $SOL to Top Crypto VCs",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/ftx-sells-1-6b-in-locked-sol-to-top-crypto-vcs/",
    "description": "<p>The sale occurred at $64 per $SOL token, involving major crypto VCs, Pantera Capital and Galaxy Digital. This was a strategic move. Under the agreement, the bought $SOL tokens will be locked for four years, barring any sale or trade until then. Four-Year Lock-Up for Purchased $SOL Tokens This transaction marks a notable moment for [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/ftx-sells-1-6b-in-locked-sol-to-top-crypto-vcs/\">FTX Sells $1.6B in Locked $SOL to Top Crypto VCs</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-04-08T13:55:00.000Z",
    "title": "APT and CYBER to Dominate This Week’s Capital Injection Into the Crypto Market",
    "url": "https://coinedition.com/apt-and-cyber-to-dominate-this-weeks-capital-injection-into-the-crypto-market/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Altcoin-Market-Approaching-Buying-Opportunity-Says-Crypto-Trader.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"APT and CYBER to Dominate This Week’s Capital Injection Into the Crypto Market\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Altcoin-Market-Approaching-Buying-Opportunity-Says-Crypto-Trader.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Altcoin-Market-Approaching-Buying-Opportunity-Says-Crypto-Trader-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Altcoin-Market-Approaching-Buying-Opportunity-Says-Crypto-Trader-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Altcoin-Market-Approaching-Buying-Opportunity-Says-Crypto-Trader-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Altcoin-Market-Approaching-Buying-Opportunity-Says-Crypto-Trader-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Altcoin-Market-Approaching-Buying-Opportunity-Says-Crypto-Trader-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to Token Unlocks, the cryptocurrency tracking platform, various crypto projects will inject $364.45 million into the crypto market between April 8 and 14. In a recent post on X, the tracker cited Aptos (APT), CybeConect (CYBER), Moonbeam (GLMR), Euler (EUL), and 1inch Network (1INCH) as the crypto projects scheduled to unlock new tokens this [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/apt-and-cyber-to-dominate-this-weeks-capital-injection-into-the-crypto-market/\">APT and CYBER to Dominate This Week’s Capital Injection Into the Crypto Market</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2024-04-08T13:47:44.000Z",
    "title": "Series: “Bóc tách” mùa Halving – Phần 5: Đổi mới trên Bitcoin và Cấu trúc Phí",
    "url": "https://blog.bitfinex.com/education/series-boc-tach-mua-halving-phan-5-doi-moi-tren-bitcoin-va-cau-truc-phi/",
    "description": "<p>“Satoshi Nakamoto, cha đẻ Bitcoin, đã thiết kế mạng lưới này có giới hạn phát hành là 21 triệu đồng. Phần thưởng cho việc xử lý giao dịch (phát hành Bitcoin mới) sẽ bị cắt giảm một nửa sau mỗi 4 năm. Khi nguồn cung...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/education/series-boc-tach-mua-halving-phan-5-doi-moi-tren-bitcoin-va-cau-truc-phi/\">&lt;strong&gt;Series: &#8220;Bóc tách&#8221; mùa Halving &#8211; Phần 5: Đổi mới trên Bitcoin và Cấu trúc Phí&lt;/strong&gt;</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]