[
  {
    "source": "Decrypt",
    "date": "2023-06-26T23:48:40.000Z",
    "title": "Bitcoin Mining Firm Riot Secures 33,000 New Rigs for $162 Million",
    "url": "https://decrypt.co/146308/bitcoin-mining-firm-riot-secures-33000-new-rigs-for-162-million",
    "description": "The firm also claimed an option to potentially purchase another 66,000 machines."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-26T23:40:07.000Z",
    "title": "Yes, the Secret Service has an NFT collection, and no, it's not for sale",
    "url": "https://cointelegraph.com/news/secret-service-reveals-more-about-its-nft-collection",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/dc10d12f-584d-489c-9c07-2675f0730f56.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Agents from the U.S. Secret Service San Francisco Field Office have answered a burning question about its NFT collection. What does it do?</p>\n                    <p><p>The United States Secret Service has finally shed more light on its bizarre nonfungible token (NFT) collection sitting on OpenSea. </p><p>The NFT collection was first <a href=\"https://cointelegraph.com/news/secret-service-praise-blockchain-reddit-ama\">revealed during a Reddit AMA</a> on May 16, where agents answered questions from members of the r/cryptocurrency subreddit about their involvement in crypto and blockchain tech. Until this time, not much of an explanation was provided about the NFT collection or why it exists.</p><p>Speaking to Cointelegraph, agents from the Secret Service’s San-Francisco field office, known as the “Digital Asset Technology Alliance” (DATA) Squad, said they wanted to better understand how NFTs worked.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/89279351-6673-4afb-a841-3198b8490056.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>The U.S. Secret Service San Francisco Field Office NFT Collection. Source: OpenSea</em></figcaption></figure><p>Forensic financial analyst Andrew Frey, the agent who spearheaded the Reddit AMA, said it also serves as a forward-facing example of the agency’s interest in the broader crypto ecosystem. </p><p>The DATA squad is a subunit of the Secret Service San Francisco Field Office, which deals specifically with crypto-related crimes. </p><p>Special Agent Alfonso Speed said that everyone from the DATA squad had their own unique NFT, each one being specifically personalized to each field agent. </p><p>“Everyone who owns an NFT had the opportunity to submit where they wanted themselves to be represented across Northern California, specifically the San Francisco bay area.”</p><p>The team shared a laugh as Special Agent in Charge Shawn Bradstreet pointed out that Speed was depicted standing on top of the notorious prison Alcatraz. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/cfe452c6-8c57-48ce-8659-8cc0d5ed65ac.png\"  /><figcaption style=\"text-align: center;\"><em>Alcatraz edition of the Secret Service NFT Collection. Source: OpenSea.</em></figcaption></figure><p>“You really do see people's personalities or things that they enjoy doing,” Speed said. </p><p>While some of the NFTs have received multiple offers, ranging from 0.0028 ETH ($5) to around the 0.02 ETH ($37), none of which have been accepted. </p><p>The agents said NFTs were never created to be offered for sale. Overall, the agents on the DATA taskforce take a positive approach to crypto, with many of them owning crypto and NFTs in a personal capacity. </p><p>Frey shares that while the NFT collection was a fun and creative outlet for the team, it also stands as a serious symbol of their involvement in and dedication to the broader crypto landscape. </p><p>“Overwhelmingly, there is a ‘not wrong’ belief that law enforcement doesn't know what they're doing in the crypto space,” said Frey. “I think that our NFTs are a neat way to show that we do have a seat at the table and that we're really invested in crypto and the investigation of digital assets.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/former-us-secret-service-asst-director-keep-personal-info-of-ftx-users-private\"><strong><em>Former US Secret Service asst. director: Keep personal info of FTX users private</em></strong></a></p><p>Frey reiterated that the NFT collection was also made to highlight the agency’s accessibility and to make them more approachable by the public, and particularly, crypto enthusiasts.</p><p>“The spirit behind them is public education,” said supervisory Special Agent Ryan Cole.</p><p>Being able to interact directly with members of the crypto community by way of social media platforms such as Reddit has proven essential to solving crimes and returning funds to victims in the past, Frey added. </p><p>“It was through those interactions that we learned that there was this whole community that was kind of griping and warning about all these different types of scams,” Frey said. “The cases that we see most of are specifically victim-based crimes and one of the main goals of our investigative work is to make these victims whole again.” </p><p>The Secret Service is tasked with two main directives: protecting key political leaders and safeguarding the financial and critical infrastructure of the U.S.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\"><strong><em>Tornado Cash 2.0 — The race to build safe and legal coin mixers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T23:59:51.000Z",
    "title": "The Sandbox Price Prediction 2023-2032: Should You Hodl or Dump SAND?",
    "url": "https://www.cryptopolitan.com/the-sandbox-price-predictions/",
    "description": "The Sandbox Price Prediction 2023-2032 If you&#8217;re into crypto games, SAND will be familiar to you, and The Sandbox Price Prediction will prove helpful. The new virtual universe inspired by Metaverse gaming firm The Sandbox has opened toward NFT auctions, where several pieces have been sold, including the mega yacht. According to announcements from the ... <a title=\"The Sandbox Price Prediction 2023-2032: Should You Hodl or Dump SAND?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-sandbox-price-predictions/\" aria-label=\"More on The Sandbox Price Prediction 2023-2032: Should You Hodl or Dump SAND?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-27T00:00:26.000Z",
    "title": "Crypto Investment Inflows Reach One-Year High, Reveals CoinShares",
    "url": "https://www.newsbtc.com/news/crypto-investment-inflows-reach-one-year-high-reveals-coinshares/",
    "description": "Crypto investment products are once again proving their market allure, with inflows hitting their highest level since July 2022. European asset management firm, CoinShares, noted an influx of $199 million just last week, signaling revived interest from investors in the crypto space. The surge is seen as a correction, compensating for almost half of the outflows observed in the preceding 9 weeks. CoinShares attributed the surge to recent filings for physically backed ETFs from high-profile issuers. Particularly, the crypto market is evidently witnessing a rebirth of enthusiasm as global asset management giants, such as BlackRock, file for spot Bitcoin ETFs. Bitcoin Takes The Lion&#8217;s Share In this wave of increased inflows, Bitcoin emerged as the undisputed front-runner. Bitcoin-centric investment products saw inflows of $188 million last week, according to CoinShares. On the other hand, short-bitcoin continued its trend of nine consecutive weeks of outflows, reaching $4.9 million. These contrasting trends are a testament to Bitcoin&#8217;s persistent allure amid market fluctuations. Ethereum also registered inflows, albeit at a comparatively lesser scale of $7.8 million. CoinShares’ data implies a currently subdued investor appetite for Ethereum as compared to Bitcoin. Notably, despite the Bitcoin and Ethereum domination, there&#8217;s a visible, albeit &#8220;very minor&#8221;, flow towards alternative cryptocurrencies, such as XRP and Solana. This points to a diverse market interest, even if it doesn&#8217;t match the scale of the major cryptos. The improved market sentiment is also persuading investors towards multi-asset investment ETPs. These ETPs saw an inflow of $8 million last week, which further emphasizes the ongoing diversification of investor interests in the crypto asset class. Record High For Crypto Assets Under Management With the increased inflows, the total assets under management (AUM) across fund managers have now also reached $37 billion. This is the highest level noted since before the collapse of Three Arrows Capital. It underscores not just the resilience of the crypto market, but also the continued faith that investors place in it. It is worth noting that alongside the surge in crypto investment inflows, the crypto market particularly large crypto assets such as Bitcoin and Ethereum has seen a rebound from its losses amid the United States Securities and Exchange Commission (SEC) lawsuit against Binance and Coinbase. In the past day, Bitcoin experienced a slight dip of 0.6%, but its trading price continues to hover above the recently regained $30,000 benchmark. The past week has seen an addition of over $70 billion to Bitcoin&#8217;s market cap, boosting it from a low of $514 billion the previous Monday to exceed $580 billion today. Meanwhile, Ethereum has been on the fence in the last 24 hours with no significant movement. The second-largest asset by market cap currently has a daily trading volume above $8 billion and a market cap of $226 billion. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-27T00:00:35.000Z",
    "title": "Here’s What’s Next for Litecoin, XRP and Pepe As Markets Rebound, According to Crypto Analyst",
    "url": "https://dailyhodl.com/2023/06/26/heres-whats-next-for-litecoin-xrp-and-pepe-as-markets-rebound-according-to-crypto-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/cryptocompare-top-altcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/cryptocompare-top-altcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/cryptocompare-top-altcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/cryptocompare-top-altcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/cryptocompare-top-altcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/cryptocompare-top-altcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/cryptocompare-top-altcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto strategist is outlining what he thinks is in store for Litecoin (LTC), XRP and Pepe (PEPE) as the digital asset markets flash signs of life. Analyst Michaël van de Poppe tells his 659,100 Twitter followers that the peer-to-peer payments network Litecoin is primed to surge close to its 2023 high at [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/26/heres-whats-next-for-litecoin-xrp-and-pepe-as-markets-rebound-according-to-crypto-analyst/\">Here’s What’s Next for Litecoin, XRP and Pepe As Markets Rebound, According to Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]