[
  {
    "source": "Cointelegraph",
    "date": "2023-11-04T10:02:45.000Z",
    "title": "Coinbase user agreement dispute reaches US Supreme Court",
    "url": "http://cointelegraph.com/news/coinbase-user-agreement-dispute-reaches-us-supreme-court",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/eb59eab0-161a-44dd-8fa8-2e0d8ee95baf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Supreme Court’s choice to take up this case represents a pivotal development for firms utilizing arbitration clauses.</p>\n                    <p><p>The United States Supreme Court has taken up a legal dispute concerning Coinbase and its users, specifically addressing a significant procedural matter on whether a judge or an arbitrator should decide which contract governs disputes.</p><p><a href=\"https://news.bloombergtax.com/daily-tax-report/coinbase-gets-supreme-court-hearing-on-dogecoin-sweepstakes-suit\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a report from Bloomberg, this issue stems from conflicting agreements between the parties, with one contract advocating arbitration and another supporting courtroom litigation.</p><p>Coinbase had initially applied arbitration clauses to its clients, but a complication arose with a sweepstakes agreement that directed dispute resolution to California courts. Following allegations of deceptive advertising, customers pursued legal action through a class-action lawsuit, contesting Coinbase’s usual arbitration process.</p><p>Coinbase’s efforts to promote arbitration faced opposition in lower courts. A federal judge in California, backed by the U.S. Court of Appeals for the Ninth Circuit, affirmed that the sweepstakes agreement, which favored courtroom resolution, should prevail. As a result, the company’s request to move the dispute to arbitration was not granted.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinbase-results-q3-loss-revenue-crypto-trading-volumes\"><strong><em>Coinbase narrows loss, while crypto trading volumes fall in Q3</em></strong></a></p><p>This judicial reluctance comes despite a recent Supreme Court decision, <a href=\"https://cointelegraph.com/news/us-supreme-court-halts-coinbase-cases-first-crypto-ruling#:~:text=The%20United%20States%20Supreme%20Court%20decided%20in%20favor%20of%20cryptocurrency,company%20in%20two%20California%20cases.\">which leaned 5–4 in favor of Coinbase</a> in a related matter. The court then ruled to support the company’s efforts to pause customer lawsuits while it sought to move disputes into arbitration.</p><p>During this legal dispute, Coinbase has remained proactive. The company has broadened its services, <a href=\"https://cointelegraph.com/news/coinbase-launches-regulated-crypto-futures-us-retail-traders#:~:text=Nov%2001%2C%202023-,Coinbase%20launches%20regulated%20crypto%20futures%20services%20for%20US%20retail%20traders,1%2F10th%20of%20an%20Ether.\">introducing new trading options for its users</a>. Eligible retail customers can now engage in crypto futures trading, with contracts sized more accessibly, representing a fraction of the value of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). </p><p>The Supreme Court’s choice to take up this case represents a pivotal development for firms utilizing arbitration clauses. It also highlights the court’s continued involvement in defining the distinctions between arbitration and legal proceedings. The verdict will likely impact the formulation and enforcement of user agreements, particularly in the ever-evolving domain of digital currency trading.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/samsungs-bitcoin-etf-700m-bust-coinbase-exits-japan-asia-express/\"><strong><em>Samsung’s Bitcoin ETF, $700M bust, Coinbase exits Japan: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-04T09:40:31.000Z",
    "title": "Pepe(PEPE) Price Analysis: PEPE Dominates Memecoin Market, Registers Massive Surge",
    "url": "https://cryptodaily.co.uk/2023/11/pepepepe-price-analysis-pepe-dominates-memecoin-market-registers-massive-surge",
    "description": "The memecoin PEPE has registered a significant surge of 50%, attracting interest from a whale who spent a huge chunk of ETH to acquire the meme coin. The recent surge witnessed by PEPE coin comes after a recent token burn process, which occurred when a few rogue developers began stealing PEPE tokens."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-04T10:00:30.000Z",
    "title": "Bitcoin And Ethereum:  Crypto Pundit Says Expect A Repeat Of Massive 2019 Rally",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-and-ethereum-crypto-rally/",
    "description": "Partner at the Venture Capital firm Placeholder Capital and prominent figure in the crypto community, Chris Burniske, has given an instance where assets like Bitcoin and Ethereum could see a repeat of what happened in mid-2019. New Highs Before A “Final Wipeout” In a post shared on his X (formerly Twitter) platform, Burniske mentioned that a repeat of mid-2019 could happen if the top two cryptocurrencies, Bitcoin and Ethereum, were to “rip” from their current levels. If that happens, the crypto founder believes that the broader crypto market could follow suit. Related Reading: XRP And Shiba Inu Rally Is Not Over According To This Indicator As to how these crypto tokens could go, he noted that they could rise enough to make people believe that they could hit new all-time highs soon, but that may not be the case as these investors could endure a “final wipeout” soon after (possibly in the first quarter of next year) with these tokens steady declining to higher lows.  To drive home his point, Burniske suggested that Bitcoin and Ethereum’s current price action shared similarities to the period between December 2019 and January 2019 before the “painful descent into March 2020 lows.” According to him, although that period was the COVID era, “everything is also the same about the actors on the stage.” Burniske seemed to be certain about his assertions. In a subsequent post, he warned investors that the rollercoaster “could get extreme” in relation to what he had said earlier and urged them to have their seatbelts on.  ETH price sitting at $1,844 &#124; Source: ETHUSD on Tradingview.com Market Cycle And Macro Factors Affecting Bitcoin And Ethereum Many didn’t seem to react well to Burniske’s projections, considering that it could mean that the crypto market and everyone in it could be in more pain, even if a massive rally (as the crypto founder predicts) is likely to happen before that.  A particular X user, however, seemed to agree with his position as he stated that Burniske’s prediction makes so much sense as that is how the “cycle psychology” works, just that this time, it happens to line up “perfectly” with some highly likely macro scenarios. Burniske responded to the post as he agreed that those were the points he was trying to drive home.  Related Reading: ProShares Goes Short On Ethereum With New ETF Launch One of these macro scenarios, which was alluded to, could be the rising inflation and how the Federal Reserve and other authorities globally are increasing interest rates to battle the economic downturn. Bloomberg analyst Mike McGlone had once mentioned how Bitcoin could crash to $10,000, with inflation being one of the factors that could lead to the decline.  Another crypto analyst, Nicholas Merten, had also noted that Bitcoin could decline further if the Feds do not do enough to curb the rising inflation.  Featured image from The Street, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-04T09:51:00.000Z",
    "title": "XAI 175% Surge: Elon Musk Reaffirms ‘My Co Will Never Create Crypto’",
    "url": "https://coinedition.com/xai-175-surge-elon-musk-reaffirms-my-co-will-never-create-crypto/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Elon_Musk_Publicizes_Plan_to_Create_Efficient_Financial_System.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Elon Musk Publicizes Plan to Create “Efficient” Financial System\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Elon_Musk_Publicizes_Plan_to_Create_Efficient_Financial_System.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Elon_Musk_Publicizes_Plan_to_Create_Efficient_Financial_System-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Elon_Musk_Publicizes_Plan_to_Create_Efficient_Financial_System-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Elon_Musk_Publicizes_Plan_to_Create_Efficient_Financial_System-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Elon_Musk_Publicizes_Plan_to_Create_Efficient_Financial_System-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Elon_Musk_Publicizes_Plan_to_Create_Efficient_Financial_System-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Elon Musk, the billionaire owner of the X platform (formerly Twitter), has reiterated that none of his companies would ever issue a crypto token. Musk made this proclamation in a recent statement on X following the launch of a meme-themed token, XAI.  Notably, the bad actors behind the XAI token swung into action to create [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/xai-175-surge-elon-musk-reaffirms-my-co-will-never-create-crypto/\">XAI 175% Surge: Elon Musk Reaffirms ‘My Co Will Never Create Crypto’</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]