[
  {
    "source": "CryptoGlobe",
    "date": "2023-06-21T14:00:05.000Z",
    "title": "Binance Makes Inroads into Kazakhstan: Crypto Meets ‘Borat’ Country",
    "url": "https://www.cryptoglobe.com/latest/2023/06/binance-makes-inroads-into-kazakhstan-crypto-meets-borat-country/",
    "description": "On 21 June 2023, Binance announced the launch of a regulated digital asset platform in Kazakhstan, marking a key development in the country’s burgeoning crypto sector. This launch follows Binance obtaining a license from the AIFC Financial Services Authority (AFSA) in October 2022, enabling the company to manage a digital asset platform and provide custodial […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T13:49:00.000Z",
    "title": "CSA Warns Against Fake Crypto Regulatory Stamps",
    "url": "https://cryptodaily.co.uk/2023/06/csa-warns-against-fake-crypto-regulatory-stamps",
    "description": "<p>The Canadian regulator has warned investors that some crypto websites use fake regulatory stamps and dispute resolution organizations to appear legitimate.&nbsp;</p>\nCanadian Regulator Issues Investor Alert\n<p>In a recent development, the Canadian Securities Administrators (CSA) have issued an investor alert warning individuals about certain cryptocurrency websites that employ deceptive tactics to boost their credibility, deceive potential investors, and get them to deposit funds on fraudulent platforms.&nbsp;&nbsp;</p>\n<p>The investor alert released by the CSA stated,&nbsp;</p>\n\n<p>&ldquo;In an effort to appear legitimate, the purported trading service providers claim they are certified by a fictitious authority or that they are members of a dispute resolution organization. One of them says its fictitious certification makes it &ldquo;a reliable and trustable online trading platform.&rdquo; Some of the purported trading services&rsquo; websites include links to these fake regulatory or dispute resolution organizations, which have their own websites.&rdquo;</p>\n\nCanada Faces Fake Regulator Scam&nbsp;\n<p>The investor alert revealed that the fake regulatory certificates utilized by these platforms are designed to resemble those issued by genuine regulatory authorities. They also create fictitious dispute resolution organizations, which purportedly serve as independent entities for conflict resolution between investors and the platforms, further complicating the identification of scams. These organizations, however, do not exist in reality, leaving investors without legitimate avenues for complaint and redress.</p>\nCSA Warns Against Crypto &ldquo;Red Flags&rdquo;\n<p>Therefore, although an initial glance at the fraudulent platforms might not pick up anything problematic, a deeper analysis unveils the more common &ldquo;red flags&rdquo; like awkward language, spelling and grammatical errors, unpolished syntax, promises of high returns with minimal risk, and so on.&nbsp;</p>\n<p>The CSA warned investors to verify the authenticity of regulatory certificates by cross-referencing them with official regulatory databases and conducting independent research. The organization also advised investors to consult with registered financial advisors or even follow the list of crypto platforms registered by the CSA before depositing their hard-earned money on any platform.</p>\nToo Tough On Crypto?&nbsp;\n<p>The organization has also listed some fictitious regulatory bodies and organizations being named by these fraudulent platforms to fake legitimacy. The country&rsquo;s strict regulatory environment has been challenging for many crypto firms, like Kraken, that had to jump through hoops to finally get the green signal from the country&rsquo;s regulatory watchdog. Other companies like Binance, ByBit, and dYdX have felt compelled to leave the company after being exposed to the highly unfavorable regulatory environment.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T13:45:00.000Z",
    "title": "Bitcoin Price Analysis:  Bulls Eye 29458 Target - 22 June 2023",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-price-analysis-bulls-eye-29458-target-22-june-2023",
    "description": "<p>BTC/USD Bulls Eye 29458 Hurdle:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 22 June 2023</p>\n<p>Bitcoin (BTC/USD) advanced its recent appreciation early in the Asian session as the pair traded back above the 29000 figure for the first time since early May, reaching the 29226.26 area.&nbsp; Stops were elected above a series of upside price objectives related to buying pressure that first intensified around the 24750 area, including the 27419, 28119, 28243, 29068, and 29159 areas.&nbsp; Stops were also elected above price objectives associated with buying pressure that emerged around the 25143.24 area, including the 27718, 27810, 28325, 28634, and 29077 areas.&nbsp; Additional upside price objectives include the 29458, 30088, 30200, 30292, 30477, 31488, 31737, 32125, and 33569 areas.&nbsp; Stops are cited above additional upside price objectives around the 31674, 32043, 34531, and 34658 areas.Following recent upside price activity, areas of technical support and potential buying pressure include the 28169, 27516, 26988, 26459, 25806, and 25707 areas.&nbsp; Upside retracement levels linked to selling pressure that intensified around the 31050 area include the 29563.20 and 29701.80 areas.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bullishly indicating above the 100-bar MA (hourly) and above the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;200-bar MA&nbsp;(4-hourly) at 26693.17 and the&nbsp;50-bar MA&nbsp;(Hourly) at 27466.97.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T14:07:12.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T14:00:23.000Z",
    "title": "Bill Gates-Backed KoBold Metals Raises $1 Billion for AI Mining of Rare Earth Metals",
    "url": "https://www.cryptopolitan.com/kobold-metals-raises-1-billion-for-ai-mining/",
    "description": "KoBold Metals, a Berkeley-based mining company, has recently concluded a funding round that has propelled its valuation to over $1 billion, earning the coveted status of an AI-mining unicorn. The company employs cutting-edge artificial intelligence (AI) technology to extract rare earth elements crucial for the production of electric vehicle (EV) batteries. Backed by prominent investors ... <a title=\"Bill Gates-Backed KoBold Metals Raises $1 Billion for AI Mining of Rare Earth Metals\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kobold-metals-raises-1-billion-for-ai-mining/\" aria-label=\"More on Bill Gates-Backed KoBold Metals Raises $1 Billion for AI Mining of Rare Earth Metals\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T13:45:51.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years, and there is no stopping it anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. Various APE price highlights unfold in this ApeCoin Price Prediction. How much is ApeCoin ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-21T14:00:01.000Z",
    "title": "InQubeta To Take Over Bored Ape Yacht Club Position as top NFT as ApeCoin (APE) Dumps over 35% In a month",
    "url": "https://nulltx.com/inqubeta-to-take-over-bored-ape-yacht-club-position-as-top-nft-as-apecoin-ape-dumps-over-35-in-a-month/",
    "description": "The world of finance and cryptocurrency is constantly evolving, and recent developments have led to significant shifts in the market. InQubeta (QUBE), a promising new crypto, is now poised to take over the position once held by the Bored Ape Yacht Club. At the same time, ApeCoin (APE), the native cryptocurrency of the Bored Ape [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-21T14:00:00.000Z",
    "title": "Learn How Avorak AI Transforms Lives and Brings Generational Wealth to Terra Luna Classic Holders",
    "url": "https://nulltx.com/learn-how-avorak-ai-transforms-lives-and-brings-generational-wealth-to-terra-luna-classic-holders/",
    "description": "The Terra Classic Network was bubbling with a fierce streak, but since then, it has gone under the market’s radar. It is failing to gain momentum while being characterized by a declining user base and value. Industry experts are leaning towards introducing AI as a saving grace for LUNC to help it get back on [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-21T13:41:04.000Z",
    "title": "French real estate company expands crypto payments offering ",
    "url": "https://crypto.news/french-real-estate-company-expands-crypto-payments-offering/",
    "description": "Apsys, a France-based real estate company, has signed a partnership deal with local fintech Lyzi to enable customers to pay for purchases nationwide across all its shopping malls with crypto. Apsys, a company that owns, develops, and manages many real&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-21T14:00:32.000Z",
    "title": "Bitcoin Investors Become Greedy For First Time Since May",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-investors-become-greedy-for-first-time-since-may/",
    "description": "Data shows the Bitcoin investor sentiment has turned to greed for the first time since May as the asset&#8217;s price has shot up towards the $29,000 level. Bitcoin Fear &#38; Greed Index Is Pointing At &#8220;Greed&#8221; Now The &#8220;Fear &#38; Greed Index&#8221; is an indicator that tells us about the general sentiment among the investors in the Bitcoin and wider cryptocurrency market. The metric uses a numeric scale that runs from 0-100 for representing this sentiment. All values of the index above the 54 mark imply that the investors are greedy right now, while those below 46 suggest the presence of fear in the market. The in-between region (values 47-53) signifies a neutral mentality. Besides these core sentiments, there are also two special ones, called &#8220;extreme fear&#8221; and the &#8220;extreme greed.&#8221; The former occurs at values of the indicator below 25, while the latter takes place at values above 75. Historically, these two extreme sentiments have been quite significant for the market as bottoms and tops have tended to take place during periods of extreme fear and extreme greed, respectively. Now, here is what the Bitcoin Fear &#38; Greed Index looks like right now, according to data from Alternative: The market seems to be greedy at the moment &#124; Source: Alternative As you can see above, the Bitcoin Fear &#38; Greed Index has a value of 59 currently. This suggests that the majority of the investors hold a sentiment of greed right now. Related Reading: Bitcoin Whales Continue To Accumulate As BTC Makes Recovery Push This is a fresh change, however, as the indicator had lesser values during the last few weeks. The below chart shows how the metric&#8217;s value has changed over the past year. Looks like the indicator has observed a spike in recent days &#124; Source: Alternative From the graph, it&#8217;s visible that the Bitcoin fear and greed index had seen a plunge during early May and had fallen down to neutral territory. In the weeks that followed, the metric had only managed to break into the greed territory just once (16 May) and had instead gone down into the fear zone on a couple of occasions. This worsening of the market sentiment had naturally come alongside the price of the asset registering a decline, as investors weren&#8217;t quite sure if bullish winds would return to the sector. Related Reading: Bitcoin Miners Deposit To Exchanges, What Does This Mean? In the past day, however, the investor mentality has notably improved, as only yesterday the index had a value of 49, implying that the investors had been neutral. This strong uplift in the sentiment towards greed has occurred as Bitcoin has observed a strong surge, which has taken the price near the $29,000 level. The improvement in the mentality can be a positive sign for the rally, as it implies that the general investor is supportive of the current price increase. If the indicator continues to rise in the coming days and enters into the extreme greed territory, however, it might fire back for the asset. As mentioned before, high levels of greed have generally led to top formations for the asset. BTC Price At the time of writing, Bitcoin is trading around $28,900, up 11% in the last week. BTC has seen a strong surge in the past day &#124; Source: BTCUSD on TradingView Featured image from André François McKenzie on Unsplash.com, charts from TradingView.com, Alternative.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T14:00:34.000Z",
    "title": "Meme Coin Showdown: Will Dogecoin Hold Its Ground Against This Strong Competitor with 100x ROI Potential?",
    "url": "https://www.crypto-news-flash.com/meme-coin-showdown-will-dogecoin-hold-its-ground-against-this-strong-competitor-with-100x-roi-potential/?utm_source=rss&utm_medium=rss&utm_campaign=meme-coin-showdown-will-dogecoin-hold-its-ground-against-this-strong-competitor-with-100x-roi-potential",
    "description": "The battle for the top meme coin is heating up in the crypto market. Once a star, Dogecoin&#8217;s growth is slowing down, leading investors to question its future. As holders search for better returns, they are turning to alternative options. And that&#8217;s where $ANA comes into play. With strong backing from crypto experts, ANA has [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T13:50:04.000Z",
    "title": "Unlocking Value and Liquidity: Chainlink’s Collaboration with Swift and Leading Financial Institutions Paves the Way for NFTFi Innovation",
    "url": "https://www.crypto-news-flash.com/unlocking-value-and-liquidity-chainlinks-collaboration-with-swift-and-leading-financial-institutions-paves-the-way-for-nftfi-innovation/?utm_source=rss&utm_medium=rss&utm_campaign=unlocking-value-and-liquidity-chainlinks-collaboration-with-swift-and-leading-financial-institutions-paves-the-way-for-nftfi-innovation",
    "description": "SWIFT has partnered with prominent banks and Chainlink.  This partnership also paves the way for innovative developments in the emerging field of NFTFi. SWIFT, the worldwide financial messaging service, has partnered with prominent banks and Chainlink, a provider of web3 infrastructure. The objective is to conduct a trial that examines the incorporation of both public [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-21T13:55:00.000Z",
    "title": "Tether Expands Reach by Launching USD₮ Stablecoin on Kava Blockchain",
    "url": "https://coinedition.com/tether-expands-reach-by-launching-usd%e2%82%ae-stablecoin-on-kava-blockchain/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/USDT-8.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/USDT-8.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/USDT-8-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/USDT-8-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/USDT-8-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/USDT-8-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/USDT-8-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/USDT-8-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/USDT-8-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/USDT-8-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/USDT-8-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/USDT-8-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/USDT-8-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/USDT-8-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/USDT-8-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/USDT-8-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/USDT-8-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a significant move that could reshape the future of decentralized finance, Tether Operations Limited (Tether) has announced the launch of U.S. dollar-pegged Tether tokens (&#8220;USD₮&#8221;) on the Kava blockchain. Tether, the company behind the first and most widely used stablecoin, aims to leverage Kava’s unique co-chain design and robust security to offer its users [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/tether-expands-reach-by-launching-usd%e2%82%ae-stablecoin-on-kava-blockchain/\">Tether Expands Reach by Launching USD₮ Stablecoin on Kava Blockchain</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-21T13:47:12.000Z",
    "title": "Axie Infinity Price Prediction 2022-2030: Will AXS Price Hit $15 Soon?",
    "url": "https://coinedition.com/axie-infinity-axs-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Axie-Infinity-AXS-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Axie Infinity (AXS) Price Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Axie-Infinity-AXS-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Axie-Infinity-AXS-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Axie-Infinity-AXS-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Axie-Infinity-AXS-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Axie-Infinity-AXS-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bullish AXS price prediction ranges from $4.6 to $14.8. Analysis suggests that AXS price might reach $12.5 soon. The AXS bearish market price prediction for 2023 is $3.70. Aside from Bitcoin (BTC) and Ethereum (ETH), there are other digital currencies worth considering for people looking to diversify their portfolios and get experience with new cryptocurrencies. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/axie-infinity-axs-price-prediction/\">Axie Infinity Price Prediction 2022-2030: Will AXS Price Hit $15 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]