[
  {
    "source": "Cointelegraph",
    "date": "2024-03-15T20:57:47.000Z",
    "title": " Mozaic Finance hacked for $2.4M via private key compromise ",
    "url": "https://cointelegraph.com/news/mozaic-finance-hacked-2-4-million-private-key-compromise",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOWRhYzFhYmEtNGVkMi00YjU3LWE3YTctYWY4MjczMTJiODk3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The yield farming app was exploited through a possible private key compromise, according to a CertiK report.</p>\n                    <p><p>Yield farming protocol Mozaic Finance was exploited on March 15 on the Abitrum network, according to a statement from the protocol’s development team. The team claims that the attacker has deposited all the stolen funds to centralized crypto exchange MEXC and is “confident” the funds will be returned.</p><p>Mozaic Finance is a decentralized finance and yield-optimization protocol that runs on several different blockchain networks. It claims to employ artificial intelligence (AI) programs to maximize returns to investors.</p><p>Blockchain security firm CertiK <a href=\"https://twitter.com/CertiKAlert/status/1768597420080848922\" target=\"_blank\" rel=\"noopener nofollow\">posted</a> an alert on X, stating that the exploit had occurred. In an accompanying report received by Cointelegraph, CertiK claimed that the attacker drained funds by calling the “bridgeViaLifi” contract, which is only callable by a developer wallet. Thus “the root cause of this incident appears to be a private key compromise,” CertiK concluded.</p><p><a href=\"https://cointelegraph.com/news/mozaic-finance-hacked-2-4-million-private-key-compromise\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-15T20:41:30.000Z",
    "title": " Dubai’s DIFC passes comprehensive digital asset law, new security law ",
    "url": "https://cointelegraph.com/news/dubai-difc-passes-comprehensive-digital-asset-law-new-security-law",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMDA1OWIxZTAtNTAxNy00M2QyLTlkZDMtNzZiNjBlNDQ3YjJmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The center claims it has created the world’s first comprehensive set of legal characteristics of digital assets as property in a new, short law.</p>\n                    <p><p>The Dubai International Financial Centre (DIFC), a special economic zone with over 5,000 residents, has announced the passage of a new digital assets law and security law and amendments to existing law. The center has its own legal system based on English law.</p><p>The legislative developments seek to “keep pace with the rapid developments in international trade and financial markets […] and to provide legal certainty for investors in, and users of, Digital Assets,” according to a statement. DIFC Authority chief legal officer Jacques Visser <a href=\"https://www.difc.ae/whats-on/news/difc-announces-enactment-of-new-digital-assets-law---new-law-of-security-and-related-amendments\" target=\"_blank\" rel=\"noopener nofollow\">said</a>:</p><p>The Digital Assets Law <a href=\"https://edge.sitecorecloud.io/dubaiintern0078-difcexperie96c5-production-3253/media/project/difcexperiences/difc/difcwebsite/documents/laws--regulations/digital_assets_law_2_of_2024.pdf\" target=\"_blank\" rel=\"noopener nofollow\">contains</a> seven pages of text plus appendices. A law amending at least six previous laws to update them for digital assets has been passed but is not available online at the time of writing. The DIFC noted in its statement that the changes to the Law of Obligations made electronic records functionally equivalent to paper records.</p><p><a href=\"https://cointelegraph.com/news/dubai-difc-passes-comprehensive-digital-asset-law-new-security-law\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-15T21:00:04.000Z",
    "title": "Binance Labs spun-off into independent entity outside the Binance group umbrella",
    "url": "https://cryptoslate.com/binance-labs-spun-off-into-independent-entity-outside-the-binance-group-umbrella/",
    "description": "<p>Binance spun off its $10 billion venture capital arm, Binance Labs, into an independent entity that will no longer be under the group&#8217;s purview months ago. Bloomberg drew attention to the silent change in a March 15 report, which revealed that Binance Labs had added a disclaimer about the change on its website earlier in [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/binance-labs-spun-off-into-independent-entity-outside-the-binance-group-umbrella/\">Binance Labs spun-off into independent entity outside the Binance group umbrella</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-15T21:05:15.000Z",
    "title": "Bullish Pushd (PUSHD) Presale Sees Shiba Inu (SHIB) Billionaire Buy Early Positions Sparking Bitcoin (BTC) Traders To Get Early Positions",
    "url": "https://cryptodaily.co.uk/2024/03/bullish-pushd-pushd-presale-sees-shiba-inu-shib-billionaire-buy-early-positions-sparking-bitcoin-btc-traders-to-get-early-positions",
    "description": "The crypto market has been bullish for the past few months, with Bitcoin (BTC) soaring to all-time highs and multiple altcoins, including memecoins like Shiba Inu (SHIB)"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-15T21:01:14.000Z",
    "title": "Avalanche (AVAX) & Binance Coin (BNB) Investors Dive Into Kelexo (KLXO) Presale Amid Bitcoin (BTC) $72,000 All-Time High",
    "url": "https://cryptodaily.co.uk/2024/03/avalanche-avax-binance-coin-bnb-investors-dive-into-kelexo-klxo-presale-amid-bitcoin-btc-72000-all-time-high",
    "description": "The cryptocurrency market keeps seeing exciting developments, with coins like Avalanche (AVAX) and Binance Coin (BNB) experiencing steady growth."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-15T20:55:54.000Z",
    "title": "Speculation over Ripple (XRP) Future Whilst DeeStream (DST) New Platform Attracts Major Ethereum (ETH) Investment as 50X Predicted",
    "url": "https://cryptodaily.co.uk/2024/03/speculation-over-ripple-xrp-future-whilst-deestream-dst-new-platform-attracts-major-ethereum-eth-investment-as-50x-predicted",
    "description": "While the crypto market is booming, the future of Ripple (XRP) remains uncertain due to speculations on its ongoing case with the SEC. Meanwhile, the ongoing DeeStream (DST) presale has attracted major Ethereum (ETH) holders because of its unique revenue sharing streaming platform."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-15T20:49:44.000Z",
    "title": "Rush Continues As Litecoin (LTC) and Shiba Inu (SHIB) Holders Propel Pushd (PUSHD) E-Commerce to New Heights: Join the Limited Presale",
    "url": "https://cryptodaily.co.uk/2024/03/rush-continues-as-litecoin-ltc-and-shiba-inu-shib-holders-propel-pushd-pushd-e-commerce-to-new-heights-join-the-limited-presale",
    "description": "The crypto game has come a long way and one of the projects that came into existence during the early days of the crypto economy is Litecoin (LTC). Litecoin (LTC)"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-15T20:41:48.000Z",
    "title": "Avalanche (AVAX) & Binance Coin (BNB) Bulls Strategically Position in Kelexo (KLXO) Presale Amid Bitcoin (BTC) $73K New All-Time High",
    "url": "https://cryptodaily.co.uk/2024/03/avalanche-avax-binance-coin-bnb-bulls-strategically-position-in-kelexo-klxo-presale-amid-bitcoin-btc-73k-new-all-time-high",
    "description": "Since its emergence, Kelexo (KLXO) has been drawing the attention of investors, including that of Avalanche (AVAX) and the native cryptocurrency of the largest cryptocurrency exchange in the world, Binance Coin (BNB)"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-15T21:05:59.000Z",
    "title": "Algorand Price Prediction 2024-2033: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2024-2033 Algorand is one of the best choices to consider when investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2024 to 2033. Algorand is a very consistent blockchain and, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-15T20:45:31.000Z",
    "title": "Shiba Inu Coin Price Prediction 2024-2033: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2024-2033 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of [&#8230;]"
  }
]