[
  {
    "source": "Cointelegraph",
    "date": "2023-10-28T15:15:00.000Z",
    "title": "Crypto Biz: BlockFi emerges from bankruptcy, Worldcoin halts USDC payments and more ",
    "url": "http://cointelegraph.com/news/crypto-biz-blockfi-emerges-bankruptcy-worldcoin-halts-usdc-payments",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/3b340d0f-f6d2-4501-8e62-d56415aed7f3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This week’s Crypto Biz looks at BlockFi’s emergence from bankruptcy, BlackRock’s spot Bitcoin ETF developments, Worldcoin’s operator payment scheme upgrades and more. </p>\n                    <p><p>Crypto lender BlockFi announced its emergence from insolvency this week, just a few days after FTX announced that it <a href=\"https://cointelegraph.com/news/ftx-recovered-7b-assets-has-almost-2b-to-go-to-cover-misappropriations\">successfully reclaimed approximately $7 billion in assets</a>. FTX debtors, comprising FTX and affiliates, estimate that $8.7 billion has been misappropriated from customers. BlockFi has lent FTX more than $650 million, making it one of the exchange’s largest creditors, which means its customers’ repayment success is tied to FTX’s ability to recover its assets.</p><p>FTX’s new management <a href=\"https://cointelegraph.com/news/ftx-post-bankruptcy-options-sale-or-revival\">is also carefully considering its future options</a>, including selling the entire exchange — which includes its extensive customer base of over nine million — or partnering with another entity to revive the exchange. The possibility of an independent comeback is also on the table. </p><p>BlockFi, on the other hand, has no option but to wind down operations, according to its court filings.</p><p>This week’s Crypto Biz looks at BlockFi’s emergence from bankruptcy, BlackRock’s spot Bitcoin exchange-traded fund (ETF) developments, and changes in Worldcoin’s payment scheme.</p><p>There’s finally a light at the end of the tunnel for creditors of some of the bankrupted companies from 2022’s crypto bear market. Roughly a year after filing for bankruptcy, companies such as FTX and BlockFi have started to return their customers’ funds.</p><h3>BlackRock’s spot Bitcoin ETF now listed on Nasdaq trade clearing firm — Bloomberg analyst</h3><p>The iShares spot Bitcoin ETF proposed by investment firm BlackRock has been <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-nasdaq-clearing-firm\">listed on the Depository Trust &amp; Clearing Corporation (DTCC)</a>, suggesting potential approval by the United States Securities and Exchange Commission. In an Oct. 23 X (formerly Twitter) thread, Bloomberg ETF analyst Eric Balchunas said the DTCC listing was “all part of the process” of bringing a crypto ETF to market. “This is [the] first spot ETF listed on DTCC, none of the others on there (yet),” said Balchunas. Balchunas speculated that BlackRock may have already received the green light for listing the ETF from the SEC or was “prepping everything assuming so.” Based on the date of BlackRock’s application, the SEC has until Jan. 10, 2024, to reach a final decision on approval or denial of the ETF.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The iShares Bitcoin Trust has been listed on the DTCC (Depository Trust &amp; Clearing Corporation, which clears NASDAQ trades). And the ticker will be <a href=\"https://twitter.com/search?q=%24IBTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$IBTC</a>. Again all part of the process of bringing ETF to market.. h/t <a href=\"https://twitter.com/martypartymusic?ref_src=twsrc%5Etfw\">@martypartymusic</a> <a href=\"https://t.co/8PQP3h2yW0\">pic.twitter.com/8PQP3h2yW0</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1716529570759704832?ref_src=twsrc%5Etfw\">October 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>BlockFi emerges from bankruptcy and opens wallet withdrawals</h3><p>Crypto lending platform BlockFi <a href=\"https://cointelegraph.com/news/blockfi-emerges-bankruptcy-opens-wallet-withdrawals\">has emerged from bankruptcy and is ready to pay back</a> some of its creditors, according to a blog post on Oct. 24. Withdrawals “are currently available to nearly all Wallet customers,” the post stated, adding that BlockFi Interest Account and Loan customers will be able to withdraw some assets in early 2024. BlockFi’s emergence from bankruptcy means it can now attempt to recover assets from other firms it believes owe it money. This includes bankrupt crypto platforms such as Three Arrows Capital and FTX. The total amount of distributed funds will depend on BlockFi’s success in FTX bankruptcy litigation, among other factors.</p><h3>Ledger hardware wallet rolls out cloud-based private key recovery tool</h3><p>Hardware wallet firm <a href=\"https://cointelegraph.com/news/ledger-cloud-private-key-recovery\">Ledger is rolling out</a> its cloud-based private key recovery solution despite facing significant criticism from the crypto community. Provided by blockchain protection platform Coincover, the solution is a paid subscription service allowing users to back up their secret recovery phrase. The rollout comes months after Ledger paused the recovery service in May 2023 in response to community backlash. Ledger CEO Pascal Gauthier subsequently said that the firm would launch the product only after its open-source code was released. The code for the Ledger Recover is now available on GitHub.</p><h3>Worldcoin to cease paying Orb operators in USDC as early as November</h3><p>Worldcoin <a href=\"https://cointelegraph.com/news/worldcoin-cease-usdc-payments-native-token-wld\">is set to begin paying its Orb Operators</a> — those rewarded for scanning people’s eyes — with its native Worldcoin (WLD) token, phasing out USD Coin (USDC) as early as next month. The change will affect most jurisdictions. Worldcoin said the move to pay orb operators entirely in WLD was part of a “transitional phase” following the official launch of the project on July 24. Data from Worldcoin’s official Dune Analytics dashboard shows that the supply of the WLD token has grown from approximately 100 million at the time of launch to around 134 million as of this week.</p><p><em>Crypto Biz is your weekly pulse on the business behind blockchain and crypto, delivered directly to your inbox every Thursday.</em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]