[
  {
    "source": "Cointelegraph",
    "date": "2024-02-12T15:28:23.000Z",
    "title": " Ethereum NFTs rally with EtherRock and BAYC leading sales ",
    "url": "https://cointelegraph.com/news/ethereum-nft-market-revival-etherrock-bayc-lead-sales",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYmNkMmUzNmItMWVhYy00OGVmLWFjNTMtNTVlOTYxYmJlNjg5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ethereum weekly NFT sales volume rose over 99%, driven by a surge of interest in Pudgy Penguins and the Nobody NFTs.</p>\n                    <p><p>Ethereum-native nonfungible tokens (NFTs) are starting to make a comeback, following growing NFT sales figures this week.</p><p>Wrapped Ether Rock #46 sold for $496,658 on Monday, four days after Bored Ape Yacht Club (BAYC) #1726 was sold for $668,297, according to NFT data aggregator <a href=\"https://www.cryptoslam.io/\" target=\"_blank\" rel=\"noopener nofollow\">CryptoSlam</a>. These represent the second and third-largest sales of the month, following the $1.53 million sales of CryptoPunk #<a href=\"https://www.cryptoslam.io/cryptopunks/mint/5363\" target=\"_blank\" rel=\"noopener nofollow\">5363</a> on Jan. 31.</p><p>According to Anndy Lian, intergovernmental blockchain expert and author of the book “NFT: From Zero to Hero,” wrapped Ether Rock and BAYC NFTs aren’t just NFTs but represent a status symbol that grants the holder prestige in the NFT community:</p><p><a href=\"https://cointelegraph.com/news/ethereum-nft-market-revival-etherrock-bayc-lead-sales\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-12T15:14:24.000Z",
    "title": " Bitcoin trader &#039;sees $50K shortly&#039; as BTC price erases 20% ETF dip ",
    "url": "https://cointelegraph.com/news/bitcoin-50k-shortly-btc-price-erases-etf-dip",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYmRjYWQzZTEtMzlkMC00NzE2LTlhOWYtZGNmY2VlNDU2ZjMxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>BTC price wastes no time in accelerating toward the $50,000 mark as Wall Street trading gets underway — but some Bitcoin analysts remain cautious.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) sought new two-year highs at the Feb. 12 Wall Street open amid fresh optimism over institutional buying.</p><p>Data from <a href=\"https://subscription.cointelegraph.com/\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed BTC price action passing $49,000.</p><p>The prior daily close saw the <a href=\"https://cointelegraph.com/news/spot-bitcoin-etfs-record-notable-volume-on-day-1-btc-price-nearly-hits-49k\">highest levels in a month</a> as bulls initially held their own, managing $48,800 before a retracement took the market $1,000 lower in the coming hours.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-50k-shortly-btc-price-erases-etf-dip\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-12T15:30:40.000Z",
    "title": "Crypto AUM reaches two-year peak of $59 billion driven by US Bitcoin ETF inflows",
    "url": "https://cryptoslate.com/crypto-aum-reaches-two-year-peak-of-59-billion-driven-by-us-bitcoin-etf-inflows/",
    "description": "<p>Large inflows into the newly launched spot Bitcoin Exchange-Traded Funds (ETFs) in the United States have propelled the assets under management (AUM) for crypto-related investment products to a two-year high of $59 billion, according to CoinShares&#8217; latest weekly report. US dominate flows During the past week, digital asset investment products witnessed significant inflows totaling $1.1 [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/crypto-aum-reaches-two-year-peak-of-59-billion-driven-by-us-bitcoin-etf-inflows/\">Crypto AUM reaches two-year peak of $59 billion driven by US Bitcoin ETF inflows</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-12T15:16:02.000Z",
    "title": "Trennert Warns: Premature Fed Rate Cuts Could Jeopardize Market Stability",
    "url": "https://www.cryptoglobe.com/latest/2024/02/trennert-warns-premature-fed-rate-cuts-could-jeopardize-market-stability/",
    "description": "On February 12, 2024, Jason Trennert, Chairman and CEO of Strategas Research Partners, shared his expert analysis on CNBC’s “Squawk Box,” offering a deep dive into current market trends, the Federal Reserve’s ongoing battle with inflation, and the broader state of the economy. His insights provide a nuanced understanding of the financial landscape, revealing the […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-12T15:34:46.000Z",
    "title": "OpenAI’s Development of Agent Software Marks a Potential Revolution in Computing",
    "url": "https://www.cryptopolitan.com/openais-development-of-agent-software-marks/",
    "description": "OpenAI, under the leadership of Sam Altman, is pioneering the development of agent software, a revolutionary concept that could reshape how individuals interact with their computers. According to reports from The Information, this software, akin to a &#8220;supersmart personal assistant,&#8221; will take over complex tasks on behalf of users, navigating between multiple applications seamlessly. The [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-12T15:25:16.000Z",
    "title": "AI Takes Center Stage at the Super Bowl",
    "url": "https://www.cryptopolitan.com/ai-takes-center-stage-at-the-super-bowl/",
    "description": "In an unprecedented showcase of technological innovation, this year&#8217;s Super Bowl commercials prominently featured artificial intelligence (AI), signaling its growing influence in mainstream culture and marketing strategies. Companies such as Microsoft, Google, Etsy, and even entertainment entities like the Minions franchise, leveraged AI to either create or promote their ads, spending upwards of $7 million [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-12T15:23:56.000Z",
    "title": "Biden’s laser eyes spark crypto community buzz amid Super Bowl celebrations",
    "url": "https://www.cryptopolitan.com/bidens-laser-eyes-super-bowl-celebrations/",
    "description": "A surprising move caught the attention of both political and cryptocurrency enthusiasts: United States President Joe Biden posted a laser-eye emblazoned picture on his social media accounts. This gesture, widely recognized within the crypto space as a show of support for Bitcoin, came in the wake of the Kansas City Chiefs&#8217; victory over the San [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-12T15:10:29.000Z",
    "title": "Solana Mobile’s Leap Forward: Securing a Stronghold in the Crypto-Smartphone Market",
    "url": "https://www.cryptopolitan.com/solana-mobiles-crypto-smartphone-market/",
    "description": "Solana Mobile has announced the overwhelming success of its second smartphone, surpassing 100,000 preorders and securing $45 million in development funds. The achievement marks a pivotal moment for the company, showcasing a robust demand for crypto-enabled smartphones and solidifying Solana Mobile&#8217;s position in a competitive market dominated by tech giants. A new chapter in mobile [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-12T15:25:39.000Z",
    "title": "Unlocking Axelar (AXL) coin’s potential: key insights and price prediction",
    "url": "https://crypto.news/axelar-axl-price-prediction/",
    "description": "Axelar (AXL) coin has seen a remarkable surge, rising over 160% since Nov. 2023. What is happening in its ecosystem, and how far will it go? Since Nov. 2023, Axelar (AXL) coin has witnessed a remarkable surge in its value,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-12T15:30:06.000Z",
    "title": "ERC-404 Euphoria Push Ethereum Gas Fees To 8 Month High",
    "url": "https://www.newsbtc.com/news/ethereum/erc-404-euphoria-push-ethereum-gas-fees-to-8-month-high/",
    "description": "The new ERC-404 tokens have swiftly taken the spotlight, dominating the cryptocurrency market and consistently attracting interest from investors and traders. This surge in euphoria has led to a substantial increase in Ethereum gas fees, pushing costs to their highest levels in the past eight months.  Related Reading: Ethereum Price Signals Uptrend Exhaustion But Dips Could Be Attractive Ethereum Gas Fees Skyrocket Ethereum gas fees have surged to record highs, reaching unseen levels since March 2023, when the average gas price peaked at 101.26 Gwei. The sudden spike in Ethereum gas prices has been attributed to the recent hype surrounding ERC-404 tokens, an experimental token standard that enables native fractionalization of Non-fungible Tokens (NFTs).  Presently, reports from Etherscan, an Ethereum block explorer and analytics platform, reveal that on Friday, February 9, 2024, Ethereum gas fees reached an average gas price of 71.4 Gwei, with a maximum and minimum gas price of 59,956 Gwei and 34.4 Gwei respectively. This price is the highest Ethereum gas fees have reached since its explosive peak in May 2023, when the average gas price surged to 155.8 Gwei. The popularity of the ERC-404 can be attributed to the Pandora team heralding the unofficial token and taking advantage of its high liquidity. Additionally, various cryptocurrency traders have shown immense interest in the new token, aiming to capitalize on its potential and maximize its liquidity. One trader recently made $59,000 from the popular ERC-404 token. He revealed that his &#8220;secret to making money&#8221; was buying and selling the ERC 404 token, MINER, using the high gas fees as an advantage.  The co-founder of Gaslite GG, identified as ‘Pop Punk’ on X (formerly Twitter), has also predicted that introducing ERC-404 tokens will lead to a continuous daily rise in the average Ethereum gas price.  About The ERC-404 Token Standard Earlier Thursday, the market capitalization of ERC-404 tokens soared to $296 million, announcing their arrival in the crypto market. The token standard was launched on February 5 and has gained immense traction in crypto.  Although ERC-404 tokens remain unofficial due to the absence of a complete audit and endorsement by Ethereum developers, they have witnessed a significant surge in the days following their launch. One of the prominent ERC-404 tokens, Pandora, recently saw a rise of over 400%. Related Reading: Crypto Drama Unfolds: Ethereum Co-Founder’s 22,000 ETH Transfer Sparks Price Speculation The experimental tokens have gained widespread popularity due to their unique approach of bridging the gap between fungible and non-fungible tokens for better liquidity and fractionalization.  Chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-12T15:14:39.000Z",
    "title": "Bitcoin ETFs Hit $10,000,000,000 Mark: Explosive Growth Just One Month Post-Approval",
    "url": "https://www.crypto-news-flash.com/bitcoin-etfs-hit-10000000000-mark-explosive-growth-just-one-month-post-approval/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-etfs-hit-10000000000-mark-explosive-growth-just-one-month-post-approval",
    "description": "<img width=\"1200\" height=\"700\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/pexels-karolina-grabowska-5980866.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"bitcoin-btc-telefono-inteligente-chart-trading\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/pexels-karolina-grabowska-5980866.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/pexels-karolina-grabowska-5980866-300x175.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/pexels-karolina-grabowska-5980866-768x448.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/pexels-karolina-grabowska-5980866-150x88.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/pexels-karolina-grabowska-5980866-450x263.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />The several spot Bitcoin ETF issuers in the United States excluding Grayscale’s GBTC now hold more than 216,309 BTCs worth over $10 billion, thus outshining MicroStrategy which recently announced a holding of about 190k coins. The heightened Bitcoin demand from institutional investors in the recent past has helped the flagship coin rally around 15 percent [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-12T15:30:39.000Z",
    "title": "CryptoQuant CEO Sees Bitcoin Rallying Above $100,000 on the Back of ETF Inflows – Here’s His Timeline",
    "url": "https://dailyhodl.com/2024/02/12/cryptoquant-ceo-sees-bitcoin-rallying-above-100000-on-the-back-of-etf-inflows-heres-his-timeline/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Amid-an-Apocalyptic.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Amid-an-Apocalyptic.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Amid-an-Apocalyptic.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Amid-an-Apocalyptic.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Amid-an-Apocalyptic.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Amid-an-Apocalyptic.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Amid-an-Apocalyptic.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The co-founder and CEO of market intelligence firm CryptoQuant thinks that Bitcoin exchange-traded funds (ETF) inflows could propel BTC to a new all-time high in the coming months. Ki Young Ju tells his 332,900 followers on the social media platform X that in a bullish scenario, he sees Bitcoin surging above $100,000 by the end [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/12/cryptoquant-ceo-sees-bitcoin-rallying-above-100000-on-the-back-of-etf-inflows-heres-his-timeline/\">CryptoQuant CEO Sees Bitcoin Rallying Above $100,000 on the Back of ETF Inflows – Here’s His Timeline</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]