[
  {
    "source": "CoinDesk",
    "date": "2023-08-02T15:46:18.000Z",
    "title": "Why You Should Care About Litecoin: It's the Backbone of Dogecoin",
    "url": "https://www.coindesk.com/tech/2023/08/02/why-you-should-care-about-litecoin-its-the-backbone-of-dogecoin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Litecoin, a blockchain cloned from Bitcoin in 2011 that underwent a key milestone on Wednesday known as a “halving,” provides network security to Dogecoin via a process called “merged mining.”"
  },
  {
    "source": "Decrypt",
    "date": "2023-08-02T15:44:44.000Z",
    "title": "Litecoin Just Had Its Third Halving—Here's What That Means for LTC",
    "url": "https://decrypt.co/151005/litecoin-third-halving-what-it-means-for-ltc",
    "description": "So far, it isn’t looking too good for the Bitcoin fork which recently experienced resurgence. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T15:47:31.000Z",
    "title": "Decentralized Web3 data service taps ZK-proofs for tamper-proof SQL queries ",
    "url": "https://cointelegraph.com/news/decentralized-web3-data-service-onboards-zkproofs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/1bbd99c8-6bcf-4563-aa54-19aa3458f9a0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Space and Time launches zero-knowledge proof tool for its decentralized database platform. </p>\n                    <p><p>Decentralized <a href=\"https://cointelegraph.com/tags/web3\">Web3</a> data service Space and Time has tapped into zero-knowledge proof (<a href=\"https://cointelegraph.com/explained/zero-knowledge-proofs-explained\">ZK-proof</a>) technology to cryptographically verify information queries within its ecosystem.</p><p>The company’s proprietary Proof of SQL allows the platform to generate a <a href=\"https://cointelegraph.com/explained/zk-starks-vs-zk-snarks-explained\">SNARK</a> cryptographic proof of a query within its decentralized data network, allowing users to trust that a data query is accurate and has not been manipulated.</p><p>Space and Time intends for the service to provide tamper-proof on-chain and off-chain data to blockchain services, advanced computing, artificial-intelligence and large language models. Space and Time co-founder Jay White told Cointelegraph that the innovation could prove useful across a range of blockchain-based solutions including financial services, retail, healthcare and gaming:</p><blockquote>“We believe that data will enhance the interoperability between the on-chain and off-chain ecosystems, fostering greater collaboration between decentralized and traditional systems.”</blockquote><p>Proof of SQL will enable decentralized applications (DApps) to run a query to Space and Time’s data warehouse and create a roll-up of the result to a smart contract. The Proof of SQL ensures trustless, but verified, proofs of data that are efficient and privacy-preserving.</p><p>The firm notes that the service could provide significant value to industries where monetary value is directly linked to data, with financial services a prime example. </p><p><a href=\"https://cointelegraph.com/news/are-zk-proofs-the-answer-to-bitcoin-ordinal-and-brc-20-problem\"><strong><em>Related: Are ZK-proofs the answer to Bitcoin’s Ordinal and BRC-20 problem?</em></strong></a></p><p>The company also sees potential in the technology to verify that large language models were trained on accurate, tamper-proof data. This could become an important aspect as tools like OpenAI’s ChatGPT become integrated in business processes.</p><p>Space and Time’s service includes a blockchain data indexing service that features pre-built Web3 APIs that allow DApps to access real-time data from Ethereum, Polygon, BNB Chain, Sui and Avalanche’s blockchains. The platform also integrates with Chainlink oracles and decentralized storage platforms.</p><p>Space and Time’s Proof of SQL is currently being used by credit-scoring blockchain protocol Lendvest. The service calculates an on-chain credit score based on a user’s on-chain and off-chain financial data.</p><p>According to Lendvest founder Joshua Gottlieb, Proof of SQL is being used to prove that credit scores are verified, calculated correctly and associated with a correct wallet address. </p><p>The system is intended to allow Decentralized Finance (DeFi) lending platforms to algorithmically establish the risk profile of a user, which is aimed at improving returns for both users and DeFi protocols.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/decentralized-web3-data-service-onboards-zkproofs&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><em><strong>Magazine:<a href=\"https://cointelegraph.com/magazine/tokenizing-music-royalties-nfts-taylor-swift-3lau-nas-the-weeknd/\"> Tokenizing music royalties as NFTs could help the next Taylor Swift</a></strong></em></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-02T16:00:52.000Z",
    "title": "Bitcoin whales in deep distribution mode as 15k BTC return to exchanges",
    "url": "https://cryptoslate.com/insights/bitcoin-whales-in-deep-distribution-mode-as-15000-btc-return-to-exchanges/",
    "description": "<p>Quick Take Over the past six days, a substantial sell-off in the Bitcoin market has been observed, attributed predominantly to Bitcoin whales. The red color on the below chart denotes transactions over $10M, indicating that these major holders are progressively liquidating their positions. The influx of nearly 15,000 BTC back onto exchanges supports this observation. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-whales-in-deep-distribution-mode-as-15000-btc-return-to-exchanges/\">Bitcoin whales in deep distribution mode as 15k BTC return to exchanges</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-02T15:45:07.000Z",
    "title": "Worldcoin WLD token jumps nearly 5% despite Kenyan government suspension",
    "url": "https://cryptoslate.com/worldcoin-wld-token-jump-nearly-5-despite-kenyan-governments-suspension/",
    "description": "<p>The Kenyan Government has suspended the activity of Worldcoin, the recently launched digital identity crypto project, according to an Aug. 2 statement shared by Kenya&#8217;s Ministry of the Interior on its official Facebook page. Kenya&#8217;s Capital Markets Authority further warned that Worldcoin&#8217;s products, including its WLD tokens and their derivatives, were not investment products recognized [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/worldcoin-wld-token-jump-nearly-5-despite-kenyan-governments-suspension/\">Worldcoin WLD token jumps nearly 5% despite Kenyan government suspension</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-02T15:53:44.000Z",
    "title": "Litecoin Successfully Halves: New Reward Set at 6.25 LTC",
    "url": "https://cryptobriefing.com/litecoin-successfully-halves-new-reward/?utm_source=feed&utm_medium=rss",
    "description": "Litecoin, a popular cryptocurrency,has executed its block reward halving, a scheduled event that occurs roughly every four years, reducing the reward for miners from 12.5 LTC to 6.25 LTC. The..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-02T15:58:29.000Z",
    "title": "IRS Declares Crypto Staking Rewards Are Subject to Income Tax",
    "url": "https://cryptodaily.co.uk/2023/08/irs-declares-crypto-staking-rewards-are-subject-to-income-tax",
    "description": "<p>The IRS decreed US crypto investors deriving income from staking services must include the fair market value of those rewards in the gross income the moment they gain control of those assets. </p>\n<p>The US Internal Revenue Service (IRS) has declared US cryptocurrency investors must include staking rewards as part of their gross income. According to the IRS&rsquo;s directive, taxpayers must include the fair market value of staking rewards as soon as they gain control of those assets.</p>\nStaking Rewards Become Taxable\n<p>The IRS&rsquo;s directive states that staking rewards in crypto become subject to income tax within the US the moment they are in the taxpayer&rsquo;s possession. It declares the instant an owner is awarded units of digital assets as incentives for validation, their fair market value must be included in the taxpayer&rsquo;s income in the tax year in which the staking rewards were obtained. The IRS specifies:</p>\n\n<p>&ldquo;The fair market value is determined as of the date and time the taxpayer gains dominion and control over the validation rewards.&rdquo;</p>\n\n<p>According to the IRS, general tax principles apply to property transactions and crypto transactions. Thus, any reward obtained through staking must be included within an individual&rsquo;s gross income as it applies to rent, royalties, and compensation for goods and services.</p>\n<p>Further, the IRS states taxpayers compensated for goods and services through cryptocurrencies, including crypto miners, must also include the market value of the assets as part of their taxable income. The agency explains:</p>\n\n<p>&ldquo;If a cash-method taxpayer stakes cryptocurrency native to a proof-of-stake blockchain and receives additional units of cryptocurrency as rewards when validation occurs, the fair market value of the validation rewards received is included in the taxpayer&rsquo;s gross income in the taxable year in which the taxpayer gains dominion and control over the validation rewards.&rdquo;</p>\n\nThe Future of Staking in the US Remains Unclear\n<p>Staking services have been the topic of controversy in the US over the past six months. Uncertainty over staking services started when the SEC sued crypto exchange Kraken over its staking business, and Kraken agreed to suspend the service and pay a $30 million fine.</p>\n<p>Coinbase has pressed the SES for regulatory clarity surrounding the industry, specifically concerning staking. The exchange petitioned the securities agency to exclude staking from its definition of securities. Still, the SEC maintain staking services through intermediaries, such as in the case of Kraken, which meets the requirements of the Howey Test and qualifies as securities.</p>\n<p>Despite ongoing requests to the SEC to clarify staking, the agency has not yet offered any guidance or regulation. In light of the regulatory uncertainty in the US, Coinbase announced it suspended its staking services in California, New Jersey, South Carolina, and Wisconsin following preliminary order by local state regulators.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-02T15:53:39.000Z",
    "title": "ATPBot Unveils Intelligent Brain for AI-Powered Crypto Trading",
    "url": "https://cryptodaily.co.uk/2023/08/atpbot-unveils-intelligent-brain-for-ai-powered-crypto-trading",
    "description": "<p>Singapore, Singapore, August 2nd, 2023, Chainwire</p><p>ATPBot, an AI-powered trading bot for crypto markets, has launched its latest product. The bot offers unique trading strategies and services that outshine other trading methods. A crypto investment platform focused on quantitative and machine learning-driven strategies, ATPBot has gained popularity among investors due to a number of key features.</p><p>ATPBot relies on high-performance professional-grade servers to provide detailed backtesting data. All strategies have been validated through 1-3 years of backtesting and the best parameter configurations have been selected from billions of data points. In backtesting, the annualized return of many trading bots is above 1000%, with a maximum drawdown of lower than 40%. Traders can also use this data to assess the potential risks of each strategy and protect their investment capital by selecting strategies that match their risk tolerance.</p><p>Image Source: ATPBot, 3 years backtest profit 3676%, max drawdown 40%, Annualized rate of return 1225%</p><p>ATPBot employs a data-driven approach and applies artificial intelligence technology to quantitative trading, enabling more accurate and reliable trading decisions. Through extensive data processing and model training, it ensures continuous learning and adaptation to market conditions, allowing it to quickly capture signals, detect trends, and achieve higher levels of potential profitability and risk control.</p><p>Image Source: ATPBot, shows open interest and volume position and time for each day</p><p>ATPBot's interface design simplifies complex automation tasks. All strategies deliver the best results selected by artificial intelligence, so users do not need to set parameters themselves. This means that ATPBot can help users achieve potentially profitable trades quickly and easily, regardless of whether they have professional trading experience.&nbsp;</p><p></p><p>Image Source: ATPBot, easy to use and quick to get started</p><p>&nbsp;ATPBot monitors real-time market data to capture trading signals. It can respond in milliseconds, enabling quick operations to seize market opportunities. It adheres to strict trading rules, eliminating emotions or subjective judgments, avoiding incorrect trading decisions and consistently generating profits.</p><p>Investors can view the transaction records of each strategy and have control over their funds at all times. Funds are stored only on the exchange, and ATPBot cannot access them. Moreover, ATPBot allows for running multiple trading pairs simultaneously and offers a variety of trading strategies to prevent missing out on market opportunities.</p><p></p><p>Image Source: ATPBot, review the time and position of entry and exit for each order</p><p>ATPBot always strives to provide investors with the highest quality trading strategies and services. Users can join the official Discord community to view more strategies and discover the automatic trading bot&rsquo;s full capabilities.</p><p>About ATPBot</p><p>ATPBot is a digital currency intelligent AI-quantitative trading bot platform, founded in 2021. ATPBot&rsquo;s mission is to become a leader in the field of digital currency trading and provide efficient, intelligent, and reliable quantitative trading solutions. ATPBot&rsquo;s team consists of AI algorithm and strategy modeling experts who provide collective intelligence and advanced machine learning models to drive growth and success for businesses. ATPBot seeks significant capital appreciation through a combination of quantitative methods and artificial intelligence (AI) strategies and has developed an advanced AI algorithm model that has repeatedly outperformed the market.</p><p>Socials: Twitter | Discord</p><p>Disclaimer: This release is intended to be informative and does not constitute financial advice. Trading cryptocurrencies carries a high level of risk and may not be suitable for all investors. Before engaging in such activities, investors should carefully consider their level of experience and risk tolerance.</p>ContactJoan Trinabusiness@atpbotcom"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T15:58:07.000Z",
    "title": "Ordinals team launches nonprofit to advance inscriptions on Bitcoin",
    "url": "https://www.cryptopolitan.com/ordinals-launches-nonprofit-to-advance/",
    "description": "Ordinals, a platform renowned for its pioneering protocol enabling the association of NFT-like assets with the Bitcoin blockchain, has taken a significant step forward by establishing a nonprofit organization. This move comes as the total number of inscriptions using the protocol surpasses 21 million, indicating growing interest and engagement. Ordinals inscriptions surpass 21 million Introduced ... <a title=\"Ordinals team launches nonprofit to advance inscriptions on Bitcoin\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ordinals-launches-nonprofit-to-advance/\" aria-label=\"More on Ordinals team launches nonprofit to advance inscriptions on Bitcoin\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T15:57:42.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T15:53:28.000Z",
    "title": "ATPBot Unveils Intelligent Brain for AI-Powered Crypto Trading",
    "url": "https://www.cryptopolitan.com/atpbot-unveils-intelligent-brain-for-ai-powered-crypto-trading/",
    "description": "Singapore, Singapore, August 2nd, 2023, Chainwire ATPBot, an AI-powered trading bot for crypto markets, has launched its latest product. The bot offers unique trading strategies and services that outshine other trading methods. A crypto investment platform focused on quantitative and machine learning-driven strategies, ATPBot has gained popularity among investors due to a number of key ... <a title=\"ATPBot Unveils Intelligent Brain for AI-Powered Crypto Trading\" class=\"read-more\" href=\"https://www.cryptopolitan.com/atpbot-unveils-intelligent-brain-for-ai-powered-crypto-trading/\" aria-label=\"More on ATPBot Unveils Intelligent Brain for AI-Powered Crypto Trading\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T15:43:41.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-02T15:52:29.000Z",
    "title": "Tradecurve supported, Apecoin and Dogecoin holder count falling",
    "url": "https://crypto.news/tradecurve-supported-apecoin-and-dogecoin-holder-count-falling/",
    "description": "The ongoing Tradecurve presale will likely end earlier than planned. Meanwhile, Apecoin (APE) and Dogecoin (DOGE) are struggling to attract investors"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-02T15:52:07.000Z",
    "title": "Kraken’s co-founder skeptical of FTX 2.0’s revival plan",
    "url": "https://crypto.news/krakens-co-founder-skeptical-of-ftx-2-0s-revival-plan/",
    "description": "Kraken co-founder Jesse Powell doubts FTX 2.0's potential to bounce back from bankruptcy"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-02T16:00:08.000Z",
    "title": "Bitcoin Funding Rates Most Positive Since Feb, Long Squeeze Soon?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-funding-rates-positive-feb-long-squeeze-soon/",
    "description": "Data shows that Bitcoin funding rates have risen to the greenest levels since February 2023, something that could increase the risk of a long squeeze. Bitcoin Funding Rates Are At Highest Levels Since February As pointed out by an analyst in a CryptoQuant post, longs have accumulated in the market recently. The &#8220;funding rates&#8221; is an indicator that keeps track of the periodic fee that traders on the futures market are exchanging between each other right now. Related Reading: Bitcoin Addresses In Loss Soar To One-Month High Amid Mixed Market Indicators When the value of this metric is positive, it means that the long contract holders are currently paying a premium to the short holders so that they can hold onto their positions. This kind of trend implies that the majority of the market shares a bullish sentiment. On the other hand, the indicator being below the zero mark suggests the payments are flowing the opposite way: shorts are paying the longs. Naturally, here the bearish mentality is the dominant force. Now, here is a chart that shows the trend in the Bitcoin funding rates since the start of the year: The value of the metric seems to have been quite high in recent days &#124; Source: CryptoQuant As displayed in the above graph, the Bitcoin funding rates have surged during the past day as the cryptocurrency&#8217;s price has recovered back above the $29,000 level. The rise implies that new long positions have appeared on the market, and the gap between the shorts and longs has widened. Following this increase, the funding rates have hit highly positive levels not witnessed since back in February of this year. When the metric hit its high values back then, the cryptocurrency&#8217;s price had formed a local top and had started on a steep decline. The reason that the market reversed its trend even though the futures market traders were bullish was perhaps due to a long squeeze. A &#8220;squeeze&#8221; is an event where a sharp swing in the price sets off a high volume of liquidations at once. Such liquidations only end up providing further fuel for the price move, thus prolonging it and causing even more liquidations. As such, liquidations can be imagined to cascade during a squeeze. Whenever the futures market becomes overheated, the chances of this mass liquidation event taking place can go up. Generally, a squeeze is more probable to effect the side that has the larger amount of contracts. Naturally, this side would be reflected in the funding rates. Related Reading: Sell The News? Litecoin Traders Capitulate Ahead Of Today’s Halving As the indicator&#8217;s value is highly positive right now, a long squeeze could have reasonable chance of happening. If one does take place in the near future, then the Bitcoin market could go down in a similar way as it did back in February. BTC Price At the time of writing, Bitcoin is trading around $29,500, up 1% in the last week. BTC had recovered to $30,000 earlier today, but has since retraced to lower levels &#124; Source: BTCUSD on TradingView Featured image from Bastian Riccardi on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T16:00:17.000Z",
    "title": "Big Litecoin (LTC) Whales Flock to The Hottest New Meme Coin in Presale Frenzy",
    "url": "https://www.crypto-news-flash.com/big-litecoin-ltc-whales-flock-to-the-hottest-new-meme-coin-in-presale-frenzy/?utm_source=rss&utm_medium=rss&utm_campaign=big-litecoin-ltc-whales-flock-to-the-hottest-new-meme-coin-in-presale-frenzy",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T105439.617.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T105439.617.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T105439.617-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T105439.617-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The meme coin market has been witnessing a peculiar turn of events these days where Litecoin whales are flocking to a new meme token that has taken the world by surprise with its cutting-edge features. DigiToads (TOADS) is an Ethereum-based cryptocurrency that is built on a hybrid DeFi model where users can explore a plethora [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T16:00:09.000Z",
    "title": "QuantStamp settles with the SEC for $3.5 Million Amid Surging Demand for InQubeta",
    "url": "https://www.crypto-news-flash.com/quantstamp-settles-with-the-sec-for-3-5-million-amid-surging-demand-for-inqubeta/?utm_source=rss&utm_medium=rss&utm_campaign=quantstamp-settles-with-the-sec-for-3-5-million-amid-surging-demand-for-inqubeta",
    "description": "<img width=\"512\" height=\"384\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T110636.692.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T110636.692.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T110636.692-300x225.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Investors and experts are closely watching the recent developments surrounding Quantstamp (QSP), a prominent blockchain security company. The company has reached a momentous settlement of $3.5 million with the U.S. Securities and Exchange Commission (SEC). Amid this resolution, InQubeta (QUBE) is surging in demand, attracting industry insiders&#8217; and newcomers&#8217; attention and admiration. The spotlight QUBE [...]"
  }
]