[
  {
    "source": "Cointelegraph",
    "date": "2023-12-03T16:00:00.000Z",
    "title": " Crypto Biz: UAE’s regulatory structure draws crypto firms, Canaan’s revenue slumps, and more ",
    "url": "https://cointelegraph.com/news/crypto-biz-uae-regulatory-structure-draws-crypto-firms-canaan-revenue-slumps",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZTg0YjY2N2QtOWEwZC00YWNiLTg2MGMtMjU0YjhmYWEwMzFjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The United Arab Emirates increasingly attracts Web3 companies to its jurisdictions, becoming the center of global crypto innovation.</p>\n                    <p><p ></p><p >Behind the wave of companies moving or deploying initiatives in the UAE is regulation. The country <a href=\"https://cointelegraph.com/news/abu-dhabi-pioneers-dlt-regulation-daos-web3-innovations\">has introduced regulatory frameworks</a> for decentralized autonomous organizations (DAOs), virtual asset providers, metaverses and other Web3-related entities. </p><p >By offering regulatory clarity and a clear path to compliance — amid a crackdown in the United States — the UAE is moving closer to fulfilling what it wants to be: an international financial hub for digital assets. </p><p >While predictions about how it will affect the future of the UAE or the crypto space itself vary, history shows how countries have used regulatory gaps to build new industries or curb existing ones.</p><p >This week’s Crypto Biz also explores Canaan’s revenue challenges, Wormhole’s massive fundraising and Banco Santander’s crypto moves.</p><h3 >Iota launches $100 million Abu Dhabi foundation for Middle East expansion</h3><p >Open-source blockchain developer Iota <a href=\"https://cointelegraph.com/news/iota-launches-100-million-abu-dhabi-foundation-for-middle-east-expansion\">announced the launch</a> of the Iota Ecosystem DLT Foundation in Abu Dhabi, which is dedicated to expanding its distributed ledger technology (DLT) in the Middle East. </p><p><a href=\"https://cointelegraph.com/news/crypto-biz-uae-regulatory-structure-draws-crypto-firms-canaan-revenue-slumps\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-03T15:56:17.000Z",
    "title": "Students globally are eager to embrace AI but seek additional training",
    "url": "https://www.cryptopolitan.com/students-globally-are-eager-to-embrace-ai/",
    "description": "A recent survey conducted across 15 countries has unveiled a surge in optimism among students worldwide, juxtaposed with concerning rates of mental health challenges. The 2023 Global Student Survey, conducted by Chegg.org, a non-profit focused on student advocacy, delves into the evolving landscape of higher education, shedding light on students&#8217; embrace of Generative AI (GenAI) ... <a title=\"Students globally are eager to embrace AI but seek additional training\" class=\"read-more\" href=\"https://www.cryptopolitan.com/students-globally-are-eager-to-embrace-ai/\" aria-label=\"More on Students globally are eager to embrace AI but seek additional training\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-03T15:47:38.000Z",
    "title": "Hong Kong Employs AI to Combat Rising Superbug Infections",
    "url": "https://www.cryptopolitan.com/hong-kong-employs-ai-to-combat-superbug/",
    "description": "In response to an alarming increase in superbug infections, the Hong Kong Hospital Authority is turning to artificial intelligence (AI) as a key tool in tracking antibiotic resistance and developing new treatment strategies. This initiative comes as multidrug-resistant organisms (MDROs) like vancomycin-resistant enterococci and Candida auris pose a growing public health threat. Addressing the challenge ... <a title=\"Hong Kong Employs AI to Combat Rising Superbug Infections\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hong-kong-employs-ai-to-combat-superbug/\" aria-label=\"More on Hong Kong Employs AI to Combat Rising Superbug Infections\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-12-03T15:56:29.000Z",
    "title": "ORDINAL PROTOCOL PRICE ANALYSIS & PREDICTION (December 2) – ORDI Breaks Higher,  Explodes 50% In A Day",
    "url": "https://nulltx.com/ordinal-protocol-price-analysis-prediction-december-2-ordi-breaks-higher-explodes-50-in-a-day/",
    "description": "Ordinal Protocol’s native token – ORDI resumed bullish and saw roughly 60% gains in the last three days. This led to a breakout as it now targets a new high level.  It currently follows Bitcoin’s pattern on a daily. After launching into the market at $10 in May, ORDI fell [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-03T16:00:40.000Z",
    "title": "When Is The Next Crypto Bull Run?",
    "url": "https://www.newsbtc.com/crypto/when-is-the-next-crypto-bull-run/",
    "description": "The next crypto bull run, a highly anticipated event in the financial world, promises significant gains for investors according to many analysts and experts. This guide explores the dynamics of such crypto bull runs, their historical impact, and the potential triggers that could ignite the next bullrun. With a focus on Bitcoin&#8217;s influential role and expert insights into the possibilities for 2023 and 2024, we aim to provide a comprehensive understanding of what the future holds for crypto investors. Crypto Bullrun Phenomenon Explained The term &#8216;crypto bull run&#8217; is more than just a buzzword in the world of digital finance; it&#8217;s a phase of significant importance. A crypto bull run occurs when the market experiences a prolonged period of rising cryptocurrency prices, often characterized by high investor confidence and increased buying activity. This phenomenon is not just about the upward trend in prices; it represents a broader shift in market sentiment, often fueled by various economic, technological, and socio-political factors. Understanding the crypto bull run requires a look at its core elements: Market Sentiment: The collective optimism of investors plays a pivotal role. Positive news, technological advancements, or favorable regulations can boost confidence, leading to increased investments and higher prices. Increased Adoption: Wider acceptance and use of cryptocurrencies, both by individuals and institutions, often correlate with bullruns. As more people and businesses embrace crypto, demand rises, pushing prices up. Technological Innovations: Breakthroughs in blockchain technology or the launch of new and promising projects can trigger a bullrun. Innovations that solve existing problems or offer new possibilities can attract investors. Global Economic Factors: Economic conditions, such as inflation rates, currency devaluation, and changes in monetary policy, can influence the crypto market. For example, investors might turn to crypto as a hedge against inflation, sparking a bullrun. Network Effects: The increasing utility and network growth of a particular cryptocurrency can lead to a crypto bull run. As more people use and hold a cryptocurrency, its value often increases, creating a positive feedback loop. In essence, a crypto bull run is a complex interplay of these factors, leading to a sustained increase in prices. While the exact timing and duration of a crypto bull run are unpredictable, understanding these elements helps investors make informed decisions in the rapidly evolving crypto landscape. Understanding The Term “Bullrun” The term &#8220;bullrun&#8221; in the financial world, particularly in cryptocurrency, refers to a market condition where prices are rising or are expected to rise. The origin of the term ties back to how a bull attacks its opponents, thrusting its horns upward – symbolizing the upward movement of the market. In contrast, a bear market is characterized by declining prices, reduced investor confidence, and generally negative sentiment. These terms &#8211; bullish vs. bearish &#8211; reflect the prevailing mood in the market: bullish for upward trends and bearish for downward trends. Historical Overview Of Crypto Bull Runs The cryptocurrency market has seen several notable bull runs since its inception, each marked by significant price surges and investor enthusiasm. Here&#8217;s a brief overview: The Early Days (2009-2012): After Bitcoin&#8217;s creation in 2009, the first notable bull run occurred in 2011, when Bitcoin&#8217;s value reached $1 for the first time and subsequently peaked around $32, showcasing the potential of decentralized digital currencies. The 2013 Surge: Two major bullruns characterized 2013. Initially, Bitcoin&#8217;s price soared to $266 in April, driven by increased media attention and investor interest. Later in the year, it spiked again, reaching over $1,000, fueled by factors like the popularization of Bitcoin in China and improved market infrastructure. The 2017 Boom: Marked as one of the most dramatic, the 2017 bull run saw Bitcoin&#8217;s price reaching nearly $20,000. This period was characterized by the ICO (Initial Coin Offering) craze, mainstream media coverage, and a significant influx of retail investors. The 2020-2021 Rally: Triggered by a combination of institutional investment, extreme levels of liquidity in the entire financial markets due to central banks printing excessive amounts of money (due to COVID-19), and increased interest in decentralized finance (DeFi), Bitcoin again reached new heights, surpassing $60,000 in 2021. Significant corrections or bear markets followed each of these bull runs, demonstrating the cryptocurrency market&#8217;s cyclical nature. These periods have been crucial in shaping the landscape of the Bitcoin and crypto market. Bitcoin&#8217;s Role In The Crypto Bull Market: The 4-Year Cycle Theory Bitcoin&#8217;s influence on the crypto bull market closely ties to its 4-Year Cycle Theory, driven predominantly by the cryptocurrency&#8217;s halving events. Occurring about every four years or every 210,000 blocks, these events cut the Bitcoin mining reward in half, thus reducing the rate of new bitcoin generation. This halving mechanism is integral to Bitcoin&#8217;s design, intended to create scarcity and control inflation, mirroring the extraction of a natural resource becoming more challenging over time. The theory posits that this reduced supply, in the face of steady or increasing demand, drives up the price of Bitcoin, often leading to a Bitcoin and crypto bull market phase. Historical data supports this theory. For instance, the first halving in 2012 saw Bitcoin&#8217;s price increase from about $12 to over $1,100 in the following year. Similarly, the 2016 halving preceded a significant bullrun, culminating in Bitcoin&#8217;s late-2017 peak near $20,000. The most recent halving in 2020 also led to substantial price gains, with Bitcoin reaching new all-time highs in November 2021. This pattern of post-halving bull runs not only boosts Bitcoin&#8217;s value but often triggers a market-wide crypto bull run. Bitcoin&#8217;s market dominance and its role as a digital gold standard mean that its price movements significantly influence the entire cryptocurrency market. However, these bullish phases are not permanent. Post-halving surges are often followed by corrections, leading to bear markets. This cyclical nature emphasizes the speculative aspects of Bitcoin and the broader crypto market, underscoring the importance of market timing and risk management for investors. Key Triggers For The Next Crypto Bull Run Several concrete events and developments as of November 2023 could potentially trigger the next crypto bull run. These include specific milestones and regulatory shifts that could significantly impact investor sentiment and market dynamics. Bitcoin Halving In April 2024: The Bitcoin halving, which is expected to occur in April 2024, is a significant event for the Bitcoin and the broader cryptocurrency market. If history repeats itself, it could mark the beginning of the next crypto bull market. Approval Of The First US Spot Bitcoin ETF (Expected January 2024): Currently, the US SEC is actively collaborating with financial heavyweights such as BlackRock, Fidelity, VanEck, Invesco, Galaxy, Ark Invest, and Grayscale, fine-tuning the final details of ETF applications for potential approval. Analysts estimate a 90% chance of at least one spot Bitcoin ETF receiving approval by January 10, 2024. First US Spot Ethereum ETF (Expected Sometime In 2024): The world&#8217;s largest asset manager, BlackRock, filed an application for a spot Ether ETF with the SEC. Moreover, Bitwise, Grayscale and Galaxy, among others, have also filed applications. Market analysts believe that spot Ethereum ETFs have good chances, given the fact that there are already Ethereum Futures ETFs in the US. Ripple vs. SEC Case: The cryptocurrency industry is closely watching the legal dispute between Ripple and the SEC, which is inching closer to a final judgment. This case&#8217;s outcome will significantly influence the regulation of altcoins in the United States. Coinbase vs. SEC Case: The legal showdown between Coinbase and the SEC could have notable implications for crypto regulation and the status of various tokens under SEC purview​​. Thus, a victory by Coinbase could also be a major catalyst for a crypto bull run. When Is The Next Crypto Bull Run? The question on every cryptocurrency investor&#8217;s mind is: When is the next crypto bull run? Predicting the precise timing of a bull run in the highly volatile and unpredictable crypto market is challenging. However, by analyzing current trends, upcoming events, and market sentiment, we can attempt to estimate when the next surge in cryptocurrency prices might occur. Bull Run Crypto: Has It Already Started? Despite the fact that the Bitcoin price is still -45% away from its all-time high, Ethereum even -58%, XRP -82%, Solana -77% and Cardano -87%, there is currently a bullish sentiment across the entire crypto market. There is no definitive definition of when a bull market begins, which is why opinions may differ. However, the fact is that Bitcoin and crypto have made massive gains year-to-date (as of November 30, 2023): Bitcoin has risen by 127%, Ethereum by 70%, XRP by 75%, Solana by as much as 508%. Thus, one can argue that we are at the beginning of the next crypto bull run. Furthermore, it can be argued that the Fear &#38; Greed Index can be used as an indication of a Bitcoin and crypto bull run. Typically, the indicator is very high for a very long time (with a few dips) during a bull market. A look at the development over the last year shows that sentiment has clearly turned from fear to greed. In this respect, the indicator can serve as a sign that we are in an earlier phase of the crypto bull run. Expert Analysis: Crypto Bull Run 2023/2024 In a recent post on X, renowned crypto analyst Miles Deutscher remarked that altcoins could gain strength ahead of the Bitcoin halving in mid-April next year, if history repeats: Is Bitcoin dominance following the same pattern from last cycle? In 2019, dominance topped out in September &#8211; before alts gained steam into the halving. In 2023, dominance looks to be exhibiting a similar pattern &#8211; which would indicate a reversal into the halving. Meanwhile, crypto analyst highlighted a bullish trend for the entire crypto market cap (Bitcoin + altcoins): The total market capitalization for crypto is still seeking for continuation here. Higher lows, higher highs, which means that dips are there to be bought. Next target remains $1.8 trillion. Bitcoin Bull: Projecting The BTC Price For 2023/2024 Nevertheless, Bitcoin has always been the leading indicator for the entire crypto market in the past. Thus, it&#8217;s interesting to project how the Bitcoin price could evolve in the coming months, pre- and past-halving. Crypto analyst Rekt Capital has provided a detailed analysis of the phases surrounding Bitcoin&#8217;s Halving, projecting potential market trends for 2023/2024: Pre-Halving Period: According to the analyst, we are currently in this phase, with about 5 months left until the Bitcoin Halving in April 2024. Historically, this period offers high return on investment opportunities, especially after any deeper market retraces. Pre-Halving Rally: Expected to start around 60 days before the Halving. This phase typically sees investors buying in anticipation of the event, aiming to sell at its peak. Pre-Halving Retrace: Occurring around the Halving event, this phase has historically seen significant retraces (e.g., -38% in 2016 and -20% in 2020). It often leads investors to question the Halving&#8217;s bullish impact. Re-Accumulation: Post-Halving, this stage involves multi-month re-accumulation, where many investors may exit due to impatience or disillusionment with Bitcoin&#8217;s performance. Parabolic Uptrend: Following the breakout from re-accumulation, Bitcoin is expected to enter a phase of accelerated growth, potentially reaching new all-time highs. Rekt Capital&#8217;s analysis offers a roadmap, outlining potential expectations for the coming months by drawing on historical patterns linked to Bitcoin halvings. Renowned financial expert Charles Edwards, founder of Capriole Investments, also has a theory. According to him, Bitcoin is currently in an early bull market phase that began at around $31,000 per BTC and will end at around $60,000. The mid Bitcoin bull phase goes up to $90,000. The late Bitcoin bull phase ends at $180,000, according to him. Factors Affecting The Crypto Bull Market Several factors can significantly influence the trajectory of a crypto bull market. These include macroeconomic conditions, regulatory changes, technological advancements, market sentiment, and institutional involvement. Understanding these factors is crucial in assessing the potential and duration of a bull run in the cryptocurrency market: Bitcoin Halving Cycle: It is important to recognize that each cycle has had its dramatic end. When investors take profit on their (massive gains), the Bitcoin and crypto bull run can suddenly end (while most influencers tout that BTC and crypto will &#8220;go to the moon&#8221;) Macroeconomic Conditions: Global economic trends, like inflation rates, monetary policies, and especially market liquidity, play a significant role in shaping investor confidence and behavior in the crypto market. Following the macro environment can be crucial. Regulatory Landscape: Regulatory decisions and policies regarding cryptocurrencies can dramatically affect market sentiment and investor participation. Positive regulatory like a victory by Coinbase or Ripple Labs against the US SEC can initiate or further bolster a crypto bull run. However, regulatory crackdowns can also bring a bullrun to an abrupt end. Technological Advancements: Innovations in blockchain technology, scaling solutions, and new applications (such as DeFi and NFTs) can attract new investors and boost market growth. Market Sentiment: Public perception (Fear &#38; Greed Index), media coverage, and overall investor sentiment can drive market trends. Positive news and investor optimism often fuel bull markets. Institutional Involvement: The entry of institutional investors into the crypto space can bring significant capital, legitimacy, and stability to the market, potentially driving a bullrun. If more companies like MicroStrategy add Bitcoin (or altcoins) to their balance sheet on a larger scale, or more countries like El Salvador use it as a national reserve, this will strengthen the market and likely drive prices higher. Next Crypto Bull Run Predictions: Price Targets As we approach the anticipated Bitcoin halving in April 2024 and with growing excitement around Bitcoin ETFs, various experts and financial institutions have offered their predictions for Bitcoin&#8217;s price in 2024: Pantera Capital predicts a rise to approximately $150,000 post-halving, based on the stock-to-flow model. Standard Chartered Bank forecasts Bitcoin could soar to $120,000 by the end of 2024. JPMorgan estimates a more conservative target of $45,000 for Bitcoin. Matrixport suggests Bitcoin could reach $125,000 by the end of 2024. Tim Draper maintains a bullish prediction of $250,000, possibly by 2024 or 2025. Berenberg predicts a value of around $56,630 by the time of the Bitcoin halving in April 2024. Blockware Solutions presents an ambitious forecast of $400,000 during the next halving epoch. Cathie Wood&#8217;s (ARK Invest) offers an ambitious projection of Bitcoin reaching $1 million Mike Novogratz (Galaxy Digital) predicts a potential surge to $500,000. Tom Lee (Fundstrat Global) sees Bitcoin possibly climbing to $180,000. Robert Kiyosaki (Rich Dad Company) anticipates a rise to $100,000. Adam Back (BlockStream CEO) also predicts a $100,000 valuation for Bitcoin. These diverse predictions highlight the varied expectations from different sectors of the finance and crypto industry, reflecting the speculative and dynamic nature of crypto bull market. FAQ Next Crypto Bull Run When Is The Next Crypto Bull Run Predicted? The next crypto bull run is difficult to predict precisely. However, experts point towards late 2023 to 2024, aligning with events like the Bitcoin halving in April 2024 and potential regulatory developments. When Is The Next Bull Market In Crypto? Predictions for the next bull market in crypto vary, with many analysts eyeing 2024 post the Bitcoin halving, assuming favorable regulatory and market conditions. When Is The Next Crypto Bull Run Expected? Expectations for the next crypto bull run are particularly high around 2024, driven by the Bitcoin halving and potential ETF approvals. When Will The Next Crypto Bull Run Be? While exact timing is uncertain, the next crypto bull run could potentially start building up in late 2023 and gain momentum through 2024. When Is the Next Bull Market? The next general bull market, including crypto, might coincide with improved macroeconomic conditions and institutional adoption, possibly around 2024. When Is the Next Bull Run? Many anticipate the next bull run for cryptocurrencies will begin leading up to the 2024 Bitcoin halving, provided market and regulatory conditions are supportive. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-03T16:00:05.000Z",
    "title": "Next Crypto Sensation: After Solana’s Rise, This Mystery Coin Is Turning Heads!",
    "url": "https://www.crypto-news-flash.com/next-crypto-sensation-after-solanas-rise-this-mystery-coin-is-turning-heads/?utm_source=rss&utm_medium=rss&utm_campaign=next-crypto-sensation-after-solanas-rise-this-mystery-coin-is-turning-heads",
    "description": "<img width=\"512\" height=\"321\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-23.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-23.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-23-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-23-343x215.jpg 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-23-326x205.jpg 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-23-163x102.jpg 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Solana (SOL) could rise to $60 due to its ongoing bullishness. RebelSatoshi is building an ecosystem with high rewards for joining the fight against centralization. $RBLZ token will give a 150% increase to first-time buyers. Solana’s (SOL) continued increase in November could signal a coming bull rally. Analysts say recent partnerships in the DeFi industry [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-03T15:47:00.000Z",
    "title": "Spanish Police Arrest Alleged Crypto Conspirator Linked to North Korea",
    "url": "https://coinedition.com/spanish-police-arrest-alleged-crypto-conspirator-linked-to-north-korea/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Spanish Police Arrest Crypto Conspirator\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/Taiwanese-Prosecutors-Arrest-JPEX-Taiwan-Office-Head-For-Fraud-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Spanish authorities announced the arrest of Alejandro Cao de Benos, a Spanish national sought by the United States in connection with an alleged crypto conspiracy involving North Korea. The development was captured in a recent report by Reuters, noting the arrest occurred on Thursday at Atocha train station in Madrid. For context, the U.S. Department [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/spanish-police-arrest-alleged-crypto-conspirator-linked-to-north-korea/\">Spanish Police Arrest Alleged Crypto Conspirator Linked to North Korea</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]