[
  {
    "source": "Cointelegraph",
    "date": "2024-03-30T19:43:06.000Z",
    "title": " Paradigm’s funding takes Farcaster’s dev to unicorn status ",
    "url": "https://cointelegraph.com/news/paradigm-funding-farcaster-unicorn-status",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZTM1ZTk4NmItZmZhOC00MGZjLThmZTItODIxMjAzY2QzZmNlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Farcaster’s parent company is reportedly closing a new funding round led by Paradigm. The deal would take its valuation to above $1 billion. </p>\n                    <p><p>A new funding round is set to lift the valuation of Merkle Manufactory — the company behind the social network Farcaster — to the $1 billion mark, <a href=\"https://www.bloomberg.com/news/articles/2024-03-30/crypto-social-media-firm-merkle-sees-1-billion-valuation-in-paradigm-deal?embedded-checkout=true\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to a Bloomberg report citing sources familiar with the matter. </p><p>Leading the round is crypto investment firm Paradigm, whose portfolio includes major crypto firms, such as Coinbase, Blur, dYdX, Compound and Citadel Securities. </p><p>Merkle was co-founded in 2020 by former Coinbase executives Dan Romero and Varun Srinivasan. The company’s flagship is the social media application Warpcast, built on top of the decentralized network for social media apps Farcaster.</p><p><a href=\"https://cointelegraph.com/news/paradigm-funding-farcaster-unicorn-status\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2024-03-30T19:43:26.000Z",
    "title": "Dogwifhat reaches a new all-time high as whales reluctant to sell",
    "url": "https://crypto.news/dogwifhat-wif-new-all-time-high-whales-reluctant-sell/",
    "description": "Solana-based meme coin Dogwifhat continued its rally today, surging 17% and reaching a new peak of $4.61."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-30T20:00:10.000Z",
    "title": "Litecoin Soars Past $105 – Is LTC Set For Epic Rally This April?",
    "url": "https://www.newsbtc.com/news/litecoin-soars-past-105-is-ltc-set-for-epic-rally-this-april/",
    "description": "Litecoin (LTC), the &#8220;silver&#8221; to Bitcoin&#8217;s &#8220;gold,&#8221; has surged in recent weeks, buoyed by a combination of technical factors, strong investor interest, and strategic accumulation by miners. The LTC price jumped 12% in the past 24 hours, reaching $106.40. This uptick follows a 40% year-to-date gain, with most of the growth concentrated in the last week. Daily trading volume has also skyrocketed by 175%, indicating a significant influx of investors into the Litecoin market. Will April Be A Good Month For Litecoin? Analysts are particularly excited by a potential breakout from a multi-year downtrend. If LTC can maintain its position above $94, some believe it could usher in a new era of sustained growth. A decisive break and hold above the $122 resistance level could trigger further gains, with some analysts predicting a surge towards $150 or even higher. This price pattern mirrors a successful breakout observed in 2020/2021, adding fuel to the bullish fire. Related Reading: From $90 To $400 Litecoin: Analysts Bullish On LTC Soaring Trajectory Popular crypto analyst Rekt Capital has also chimed in, noting the historical significance of similar price breakouts for LTC. He believes a successful retest of the downtrend and subsequent establishment of support could be indicative of a promising uptrend for the cryptocurrency. Miners Fueling The Rally One of the key drivers behind the recent surge is the behavior of Litecoin miners. Data from IntoTheBlock reveals that miners have been accumulating LTC at a healthy pace throughout March. They&#8217;ve added a whopping 150,000 LTC to their reserves, bringing their total holdings to 2.2 million. This accumulation strategy reduces the selling pressure of newly minted coins and signals the miners&#8217; confidence in the future price trajectory of LTC. Total crypto market cap is currently at $2.573 trillion. Chart: TradingView Open Interest On The Rise The prevailing bullish sentiment finds reinforcement in the remarkable surge in open interest on Litecoin (LTC) futures contracts. Latest data shows a staggering 45% increase in open interest, signaling a growing optimism among traders regarding the coin&#8217;s future trajectory. This surge in open interest not only reflects heightened confidence in LTC&#8217;s potential but also underscores traders&#8217; readiness to explore new positions or bolster existing ones. Such a robust increase in open interest amplifies the potential for sustained growth, as market participants eagerly position themselves to capitalize on anticipated bullish movements in LTC&#8217;s value. Related Reading: Bullish Winds Blow: Bitcoin Bull Flag Points To New $77,000 ATH: Analyst The Road Ahead Litecoin could be headed to a strong April performance, with strong technical indicators and bullish sentiment driving the current rally. However, responsible investors should always conduct their own research and exercise caution when navigating the ever-turbulent world of cryptocurrency. Featured image from Pixabay, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-30T20:00:07.000Z",
    "title": "Online Pirated Streaming Content Witnesses Surge in Crypto Payments Between 2019 and 2023: Chainalysis",
    "url": "https://dailyhodl.com/2024/03/30/online-pirated-streaming-content-witnesses-surge-in-crypto-payments-between-2019-and-2023-chainalysis/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/online-pirated-streaming-content.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/online-pirated-streaming-content.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/03/online-pirated-streaming-content.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/online-pirated-streaming-content.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/online-pirated-streaming-content.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/online-pirated-streaming-content.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/03/online-pirated-streaming-content.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto assets are increasingly being used to pay for pirated online streaming content, according to the blockchain analysis firm Chainalysis. Nordic Content Protection (NCP), a television anti-piracy non-profit, partnered with Chainalysis to track crypto addresses connected to illicit streaming. Total inflows to these addresses totaled approximately $24 million between 2019 and 2023, with a dramatic [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/30/online-pirated-streaming-content-witnesses-surge-in-crypto-payments-between-2019-and-2023-chainalysis/\">Online Pirated Streaming Content Witnesses Surge in Crypto Payments Between 2019 and 2023: Chainalysis</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]