[
  {
    "source": "CoinDesk",
    "date": "2023-06-08T15:23:17.000Z",
    "title": "ConsenSys Faces Shareholder Vote Over Controversial Transfer of Company Assets",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/08/consensys-faces-shareholder-vote-over-controversial-transfer-of-company-assets/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Ethereum developer is accused of squeezing former employees out of shares held in a previous incarnation of the company. The case, which could have wide-ranging consequences for ConsenSys, reaches its next stage today."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-08T15:19:43.000Z",
    "title": "When AI and Blockchain Merge, Expect the Mundane at First",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/08/when-ai-and-blockchain-merge-expect-the-mundane-at-first/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "dek tk"
  },
  {
    "source": "Decrypt",
    "date": "2023-06-08T15:15:00.000Z",
    "title": "Is Gala Safe? Gala Games Head of Blockchain on GALA, Crypto, and SEC Regulatory Turmoil",
    "url": "https://decrypt.co/videos/interviews/5bcrE8nL/is-gala-safe-gala-games-head-of-blockchain-on-gala-crypto-and-sec-regulatory-turmoil",
    "description": "Gala Games President of Blockchain shares his thoughts on the GALA token upgrade and the latest SEC turmoil with Decrypt's Kate Irwin."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T15:30:28.000Z",
    "title": "US Bitcoin supply fell over 10% in the past year — Glassnode",
    "url": "https://cointelegraph.com/news/us-bitcoin-supply-fell-over-10-in-the-past-year-glassnode",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/3d3bbe52-7d24-4eff-a01d-0b9e209b6a3d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin is increasingly active in Asia as U.S. supply share dwindles over the past two years.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) abandoned the United States during the 2022 bear market, new research suggests.</p><p>In a <a href=\"https://twitter.com/glassnode/status/1666784344868806657/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">tweet</a> on June 8, on-chain analytics firm Glassnode revealed some surprising conclusions about who is now using Bitcoin.</p><h2>BTC supply moves to Asia</h2><p>The past year has seen some seismic shifts in where Bitcoin is held and traded. </p><p>In its latest analysis of the BTC supply, Glassnode measured its migration around the world — notably, away from the U.S. and toward Asia.</p><p>Since mid-2022, the amount of the supply held and traded by U.S. entities has decreased by more than 10%.</p><p>At the same time, Europe’s share has stayed roughly equal, translating to a redistribution from west to east.</p><p>“A clear divergence is visible in the year-over-year BTC supply change based on geographical regions. The extreme dominance of US entities in 2020-21 has clearly reversed, with US supply dominance falling by 11% since mid-2022,” Glassnode researchers commented.</p><blockquote>“European markets have been fairly neutral over the last year, whilst a significant increase in supply dominance is visible across Asian trading hours.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e62b83b2-9fb0-4773-91cf-071e79cd652f.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Regional Year-over-Year Supply Change annotated chart. Source: Glassnode/Twitter</em></figcaption></figure><p>The metric used to measure the phenomenon, <a href=\"https://studio.glassnode.com/metrics?a=BTC&amp;category=&amp;m=supply.Amer1YSupplyChange\" target=\"_blank\" rel=\"noopener nofollow\">Year-over-Year Supply Change</a>, is a probabilistic tool that makes assumptions over BTC supply ownership based on the time at which it moves.</p><p>“Geolocation of Bitcoin supply is performed probabilistically at the entity level. The timestamps of all transactions created by an entity are correlated with the working hours of different geographical regions to determine the probabilities for each entity being located in the US, Europe, or Asia,” Glassnode explains in its guidance notes.</p><p>Year-over-Year Supply Change shows the U.S. share beginning to decline in March 2021, but accelerating beginning in May this year.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/2d481a03-7ff4-4cfb-890d-03b221919126.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin U.S. Year-over-Year Supply Change chart. Source: Glassnode</em></figcaption></figure><h2>Coinbase CEO says U.S. must \"seize\" crypto opportunities</h2><p>The findings come as the geopolitical landscape around crypto sees major upheaval of its own.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/sec-is-killing-innovation-in-united-states-1inch-co-founder\">SEC is killing innovation in the United States — 1inch co-founder</a></em></strong></p><p>Hong Kong began <a href=\"https://cointelegraph.com/news/hong-kong-s-regulatory-lead-sets-it-up-to-be-major-crypto-hub\">allowing exchanges to offer trading</a> this month, while in the West, U.S. <a href=\"https://cointelegraph.com/news/bitcoin-price-bounces-past-26k-coinbase-news-fails-shake-bulls\">legal proceedings</a> against major exchanges marked something of a watershed moment for the industry.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The SEC suing an exchange is the new China bans <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>.</p>&mdash; Samson Mow (@Excellion) <a href=\"https://twitter.com/Excellion/status/1665772722046267392?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In an <a href=\"https://www.marketwatch.com/story/coinbase-ceo-americas-future-as-a-global-technology-leader-is-up-for-grabs-c3a9c6ae\" target=\"_blank\" rel=\"noopener nofollow\">opinion piece</a> for MarketWatch, Brian Armstrong, CEO of Coinbase, one of the targets of the legal action, warned that poor regulation would disadvantage the U.S.</p><p>“Smart—and bespoke—regulation in the 1990s and early 2000s enabled the U.S. to define the Internet Age,” he wrote. </p><blockquote>“Just like then, now is the time for Congress to seize the historic opportunity presented by crypto, and pass comprehensive legislation that safeguards consumers and fosters innovation.”</blockquote><p>On the topic of Hong Kong, Armstrong added that China pushing the crypto narrative was “no surprise.”</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\">Bitcoin is on a collision course with ‘Net Zero’ promises</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-08T15:30:00.000Z",
    "title": "Uwerx (WERX) Continues To Pump Amidst Mask Network (MASK) and ApeCoin (APE) Decline",
    "url": "https://cryptodaily.co.uk/2023/06/uwerx-werx-continues-to-pump-amidst-mask-network-mask-and-apecoin-ape-decline",
    "description": "<p class=\"s6\">The cryptocurrency market continues to experience significant volatility, with two of the top 100 cryptos, &nbsp;Mask Network (MASK) and ApeCoin (APE), declining. These tokens&rsquo; price fluctuations persist in a negative direction, leaving investors hoping for a potential rebound soon.</p>\n<p class=\"s6\">In contrast, the Uwerx presale generates increasing excitement as it maintains an upward trend. This cryptocurrency project aims to make a remarkable contribution to the freelance economy, attracting bullish sentiment from investors. Here&rsquo;s what&rsquo;s happening in these crypto projects recently.</p>\nApeCoin (APE) Is Fueling the Next Metaverse Evolution\n<p class=\"s6\">Launched by Yuga Labs in March 2022, ApeCoin (APE) is the backbone for incentivizing and powering activities within the ApeCoin network. Notably, ApeCoin (APE) has emerged as the leading metaverse token in terms of market capitalization.</p>\n<p class=\"s6\">A key milestone for ApeCoin (APE) has been the introduction of staking, enabling users to lock a portion of their ApeCoin (APE) holdings and participate in transaction validation.</p>\n<p class=\"s6\">With its attractive features, ApeCoin (APE) has garnered significant popularity. Users benefit from low transaction fees, ensuring cost-effective transactions. The network also offers instant transaction processing, enhancing the overall user experience. Moreover, ApeCoin (APE) seamlessly integrates with popular gaming platforms, further driving its appeal in the metaverse space.</p>\n<p class=\"s6\">As the metaverse continues to evolve and gain traction, ApeCoin (APE) stands out as a prominent player, fueling the virtual ecosystem and offering a range of benefits to its users. However, ApeCoin (APE) has steadily declined over the last 30 days. As of writing, ApeCoin(APE) is up by 1.5%. However, it is down by 14% in the last 30 days, with its 24-hour trading volume decreasing by 16.86%.</p>\nMASK Network (MASK): Powering The Revolution of Social Apps\n<p class=\"s6\">MASK Network (MASK) is an encrypted social messaging platform enabling secure crypto transactions and file-sharing. Its native token, $MASK, facilitates crypto transfers, grants access to platform features, and allows participation in community voting. </p>\n<p class=\"s6\">Recently, MASK Network (MASK) has been in the news. MASK Network (MASK) recently revealed its 3rd Web3 Social Grant round, collaborating with Gitcoin and offering a $50k matching pool. They have also sponsored Decentralized Social Afternoons to foster a vibrant community. </p>\n<p class=\"s6\">In addition, MASK Network (MASK) invested in Telegram's TON, aiming to provide innovative solutions to a broad user base. Furthermore, they received 257,540 ARB tokens from Arbitrum, distributing them to incentivize active community members and support the Mask DAO treasury.</p>\n<p class=\"s6\">However, MASK Network&rsquo;s (MASK) price has recently declined. The token is down by 2% as of writing. Its 24-hour trading volume has also slumped by 14.83%.</p>\nUwerx (WERX) Presale Continues to Surge\n<p class=\"s6\">Uwerx, an innovative cryptocurrency platform for freelancers and clients, is gaining traction with its exciting services and 1% flat fee. </p>\n<p class=\"s6\">Having already secured audit approval from SolidProof and InterFi, Uwerx is currently in its stage 5 presale, moving past stage 1 to 4 within a few weeks while selling millions of WERX tokens. As a result of the rapid success of Uwerx's presale, the Uwerx team adjusted its token allocation, with the presale getting a boosted 57% (427.5 million WERX tokens) of the 700 million total token supply. The team has also announced that the stage 5 presale is set to go live soon. </p>\n<p class=\"s6\">Furthermore, the native token, WERX, is currently priced at $0.041, experiencing significant growth from its starting price of $0.005. Industry experts are highly optimistic about the future of the Uwerx token, predicting it to surpass $3 by Q1 2024. </p>\n<p class=\"s6\">However, Uwerx is achieving more success in other areas of the project. Excitingly, the anticipated Alpha Version of the platform has been launched, featuring the landing page and sign-in/sign-up pages. Additional features such as login, user dashboard, job posting, job search, and more will continue to be rolled out weekly/bi-weekly. Transition to the Beta version will follow soon, allowing users to test the new platform. Users can provide valuable feedback by emailing feedback@uwerx.network.</p>\n<p class=\"s6\">Uwerx has also introduced a new feature called the Uwerx Vault, enabling users to stake their tokens for a preferred duration and earn rewards. As of writing, Uwerx has obtained 5,546 sign-ups and 1,627 and 1,456 followers on Twitter and Telegram, respectively.</p>\n<p class=\"s6\">Initially planned to be locked for 25 years after the presale, the developer's liquidity tokens will be locked sooner after 82.8% of the Uwerx community votes in its favor. Details regarding the lock date will be announced shortly. Additionally, 92.8% of the Uwerx community has approved a test airdrop to validate user wallet addresses.</p>\n<p class=\"s6\">The Uwerx team also plans to renounce ownership of smart contracts upon listing on centralized exchanges, highlighting their commitment to decentralization. With the recent price increase, Uwerx is nearing its proposed $0.095 to $0.115 launch price as the presale is set to close on July 31, 2023. So seize the moment to invest in the crypto market&rsquo;s next big thing today and get a 15% bonus on all purchases.</p>\n<p class=\"s6\">Buy Presale: https://invest.uwerx.network</p>\n<p class=\"s6\">Telegram: https://t.me/uwerx_network</p>\n<p class=\"s6\">Twitter: https://twitter.com/uwerx_network</p>\n<p class=\"s6\">Website: https://www.uwerx.network</p>\n<p class=\"s6\">&nbsp;</p>\n<p class=\"s6\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-08T15:15:00.000Z",
    "title": "Bitcoin Price Analysis:  Given to 26121 - 9 June 2023",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-price-analysis-given-to-26121-9-june-2023",
    "description": "<p>BTC/USD Weakens Again After Climb:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 9 June 2023</p>\n<p>Bitcoin (BTC/USD) remained bearishly on the defensive early in the Asian session as the pair weakened to the 26121.06 area after peaking around the 27402.79 area, representing a test of the 61.8% retracement of the depreciating range from 28473.93 to 25351.92.&nbsp; The pair remains unable to sustain traction above the 27000 figure after being lifted to the 27402.79 area, an appreciation that represented a test of the 27466.83 area.&nbsp; Stops were recently elected below the 25474.18 area by bears as BTC/USD was pushed lower to the 25351.92 area, its weakest print since mid-March.&nbsp; This move lower also represents a test of the 25309.26 area, a level that represents the 50% retracement of the appreciating range from 19568.52 to 30825.30.&nbsp; Stops are cited below major retracement levels linked to the 19568.52 and 15460 levels, including the 25309, 25094, 23954, 23255, 22278, 22025, 21415, 19139, and 18796 areas.</p>\n<p>Additional downside price objectives include the 24705, 24440, 23208, and 22769 levels.&nbsp; Following recent price activity, areas of technical resistance and potential selling pressure include the 26088, 26544, 29813, 26696, 26912, 27281, 27528, 27737, 27805, 28200, 28473, and 28873 levels.&nbsp; Upside retracement levels in recent depreciating ranges include the 28700, 28741, 28868, 29243, 29299, and 29284 levels.&nbsp; Above the market, upside price objectives include the 30420.74, 31237.11, 31477.37, 32501.23, 32556.73, 32989.19, 34583.96, 34658.69, 35222.66, 37765.28, and 38403.97 levels.&nbsp; &nbsp;Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 200-bar MA (hourly) and above the 100-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 26806.43 and the&nbsp;100-bar MA&nbsp;(Hourly) at 26530.87.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bullishly above MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-08T15:11:59.000Z",
    "title": "Biggest Movers: ADA, SOL Plunge to 3-Month Lows on Thursday",
    "url": "https://news.bitcoin.com/biggest-movers-ada-sol-plunge-to-3-month-lows-on-thursday/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2075222296-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: ADA, SOL Plunge to 3-Month Lows on Thursday\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2075222296-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2075222296-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2075222296-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2075222296-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2075222296-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2075222296-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2075222296.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Cardano dropped to a three-month low on Thursday, as sentiment in cryptocurrency markets remained largely bearish. The move comes as traders continue to worry about what the recent Binance and Coinbase lawsuits could mean for the wider market. Solana also slipped to a multi-month low. Cardano (ADA) Cardano (ADA) plunged to a three-month low on [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T15:29:29.000Z",
    "title": "Controversy arises as Microsoft, Google test AI search ads",
    "url": "https://www.cryptopolitan.com/controversy-microsoft-google-ai-search-ads/",
    "description": "A storm brews in the digital realm as Microsoft and Alphabet&#8217;s Google experiment with inserting advertisements into their Artificial Intelligence (AI) operations. This new tactic, bereft of an opt-out feature, has ruffled feathers across brands and sparked potential backlash from the ad buying industry. The Race of the Tech Titans Microsoft and Google are in ... <a title=\"Controversy arises as Microsoft, Google test AI search ads\" class=\"read-more\" href=\"https://www.cryptopolitan.com/controversy-microsoft-google-ai-search-ads/\" aria-label=\"More on Controversy arises as Microsoft, Google test AI search ads\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T15:21:39.000Z",
    "title": "Crypto exchanges on high alert after SEC-Binance and Coinbase",
    "url": "https://www.cryptopolitan.com/crypto-exchanges-high-alert-binance-coinbase/",
    "description": "The stage is set for heightened tensions in the realm of cryptocurrencies as the United States Securities and Exchange Commission (SEC) takes two of the world&#8217;s largest crypto exchanges, Coinbase and Binance, to court. Allegedly, they&#8217;ve been playing fast and loose with SEC rules, prompting other crypto exchanges to reassess their strategies and brace for ... <a title=\"Crypto exchanges on high alert after SEC-Binance and Coinbase\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-exchanges-high-alert-binance-coinbase/\" aria-label=\"More on Crypto exchanges on high alert after SEC-Binance and Coinbase\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T15:14:27.000Z",
    "title": "U.S. secretly boosts military strategy near China’s border",
    "url": "https://www.cryptopolitan.com/us-boosts-military-strategy-near-china/",
    "description": "The serene atmosphere of the Mimosa Plus Golf Course in Clark, just 92km north of Manila, witnessed a transformation in April. For the first time since the conclusion of the Cold War, more than a hundred American soldiers returned to an area that once served as the world&#8217;s largest air base outside the U.S. boundaries. ... <a title=\"U.S. secretly boosts military strategy near China&#8217;s border\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-boosts-military-strategy-near-china/\" aria-label=\"More on U.S. secretly boosts military strategy near China&#8217;s border\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-08T15:29:58.000Z",
    "title": "Cardano’s founder has dark prediction on AI frauds",
    "url": "https://crypto.news/cardanos-founder-has-dark-prediction-on-ai-frauds/",
    "description": "Discover the warning from Cardano’s founder on the increasing threat of AI-generated scams, how these technological predators work, and the tools we can wield to secure the crypto frontier."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-08T15:10:45.000Z",
    "title": "Circle’s appoints former CFTC chairman as new chief legal officer",
    "url": "https://crypto.news/circles-appoints-former-cftc-chairman-as-new-chief-legal-officer/",
    "description": "Circle Internet Financial, the issuer of the second-largest stablecoin by market capitalization, has employed the services of a former CFTC chief to head the company&#8217;s legal team.&#160; Circle has appointed Heath Tarbert as the company&#8217;s new Chief Legal Officer and&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-08T15:31:49.000Z",
    "title": "Avorak AI’s Trading Algorithm Sets New Standard for Professional Ethereum Traders",
    "url": "https://www.crypto-news-flash.com/avorak-ais-trading-algorithm-sets-new-standard-for-professional-ethereum-traders/?utm_source=rss&utm_medium=rss&utm_campaign=avorak-ais-trading-algorithm-sets-new-standard-for-professional-ethereum-traders",
    "description": "<p>The crypto market’s volatility demands advanced tools and strategies to make informed decisions and secure profitable trades. The fast-paced and ever-evolving cryptocurrency trading is a constant challenge to conquer for professional traders. Avorak AI has emerged as a trailblazer with its groundbreaking trading algorithm solutions setting a new standard for professional Ethereum traders.  What Is [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/avorak-ais-trading-algorithm-sets-new-standard-for-professional-ethereum-traders/\">Avorak AI&#8217;s Trading Algorithm Sets New Standard for Professional Ethereum Traders</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-08T15:20:00.000Z",
    "title": "Former Binance Executives Called the Exchange a Sinking Ship: SEC Evidence",
    "url": "https://coinedition.com/former-binance-executives-called-the-exchange-a-sinking-ship-sec-evidence/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Cumberland_withdrew_8250_ETH_15M_from_Binance_and_4500_ETH-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Cumberland_withdrew_8250_ETH_15M_from_Binance_and_4500_ETH-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Cumberland_withdrew_8250_ETH_15M_from_Binance_and_4500_ETH-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Cumberland_withdrew_8250_ETH_15M_from_Binance_and_4500_ETH.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>As the SEC vs. Binance case churns out revelations every day, evidence from several testimonies has surfaced. Earlier today, crypto analyst and Partner at Cinneamhain Ventures Adam Cochran posted the SEC’s evidence against Binance which included internal chat logs between Samuel Lim, a former compliance lead at Binance and Alvin, the previous head of Binance’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/former-binance-executives-called-the-exchange-a-sinking-ship-sec-evidence/\">Former Binance Executives Called the Exchange a Sinking Ship: SEC Evidence</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]