[
  {
    "source": "Cointelegraph",
    "date": "2024-02-02T05:24:51.000Z",
    "title": " Meta’s Reality Labs sets quarterly revenue record but also lost over $4B ",
    "url": "https://cointelegraph.com/news/meta-metaverse-divison-records-1b-revenue-4b-loss-earnings",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMWY2ZjdiODUtZjllNS00NWQ2LTk2YzMtNzE1ZGQ1YzIxMGQ4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>During a recent earnings call, Meta chief financial officer Susan Li said they expect Reality Labs’ losses to “increase meaningfully year-over-year.”</p>\n                    <p><p>Meta’s mixed-reality division, Reality Labs, notched an operating loss of over $4.6 billion last quarter despite posting one of its strongest quarterly revenue results of all time.</p><p>Meta’s fourth quarter <a href=\"https://investor.fb.com/investor-news/press-release-details/2024/Meta-Reports-Fourth-Quarter-and-Full-Year-2023-Results-Initiates-Quarterly-Dividend/default.aspx\" target=\"_blank\" rel=\"noopener nofollow\">results</a> released on Feb. 1 show Reality Labs — its virtual and augmented reality (VR/AR) <a href=\"https://cointelegraph.com/news/meta-coughing-up-big-money-to-developers-building-their-metaverse\">research arm</a> — lost $4.65 billion in Q4, while revenue came in at nearly $1.1 billion. </p><p>It’s the largest quarterly operating loss for the division since the fourth quarter of 2020 — when Meta first added Reality Labs’ financials to its reporting. </p><p><a href=\"https://cointelegraph.com/news/meta-metaverse-divison-records-1b-revenue-4b-loss-earnings\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T05:37:59.000Z",
    "title": "Avalanche’s Durango Upgrade: A Leap Forward in Cross-Chain Communication",
    "url": "https://www.cryptopolitan.com/avalanche-durango-upgrade-cross-chain/",
    "description": "In a significant advancement for blockchain technology, Avalanche has announced the forthcoming launch of its Durango upgrade on the Fuji testnet. Scheduled to go live on February 14th, the upgrade represents a pivotal moment for the Avalanche ecosystem. The Durango upgrade is not just a routine update; it&#8217;s a transformative enhancement that introduces Avalanche Warp [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T05:36:15.000Z",
    "title": "Conflux Unveils Jay Chou’s ‘Fantasy Music Metaverse’",
    "url": "https://www.cryptopolitan.com/conflux-jay-chous-fantasy-music-metaverse/",
    "description": "Conflux has launched Jay Chou&#8217;s &#8216;Fantasy Music Metaverse,&#8217; a platform merging music, technology, and virtual reality to transform fan interaction. This venture seamlessly integrates with Web2 platforms, offering a smooth transition between the traditional internet and Conflux&#8217;s decentralized features, immersing users in a world where digital and physical realities coalesce. At the heart of this [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T05:33:39.000Z",
    "title": "OPNX Announces Imminent Shutdown: Critical Dates for Users",
    "url": "https://www.cryptopolitan.com/opnx-announces-shutdown-critical-dates-users/",
    "description": "In a significant development within the cryptocurrency sector, Open Exchange (OPNX), formerly recognized as Coinflex, has declared its forthcoming cessation of operations scheduled for this February. The closure marks the end of a platform that was once a bustling center for crypto derivatives and claims trading. As part of its closure procedure, OPNX has communicated [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T05:20:28.000Z",
    "title": "Deep fake video of Australian billionaire promoting crypto scam sparks concern",
    "url": "https://www.cryptopolitan.com/deep-fake-video-of-australian-billionaire/",
    "description": "Cybersecurity firm Cybertrace has issued a warning regarding a highly convincing, deep fake video featuring Australian mining magnate and businessman Andrew &#8220;Twiggy&#8221; Forrest promoting a fake cryptocurrency trading platform on social media.  The video, circulating on Facebook, attempts to lure users into signing up for the fraudulent platform, claiming that it can make &#8220;ordinary people&#8221; [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-02T05:18:48.000Z",
    "title": "SOL Price Faces Big Move – Can Bulls Send Solana To $120?",
    "url": "https://www.newsbtc.com/analysis/sol-price-faces-big-move-120/",
    "description": "Solana is attempting a fresh increase from the $92 zone. SOL price could gain bullish momentum if it manages to clear the $100 and $104 resistance levels. SOL price started a fresh decline from the $106 resistance against the US Dollar. The price is now trading above $92 and the 100 simple moving average (4 hours). There was a break below a key bullish trend line with support at $100 on the 4-hour chart of the SOL/USD pair (data source from Kraken). The pair could start another increase if it surpasses the $100 and $104 levels. Solana Price Faces Key Test Solana price started a fresh decline after it struggled to clear the $106 level like Bitcoin at $43,800. There was a clear move below the $102 and $100 support levels. Besides, there was a break below a key bullish trend line with support at $100 on the 4-hour chart of the SOL/USD pair. However, the bulls were active near the $92 level and the 100 simple moving average (4 hours). The price is now attempting a fresh increase above the $95 level. The price retested the $100 zone and the 50% Fib retracement level of the downward move from the $106.41 swing high to the $92.95 low. SOL is now trading above $95 and the 100 simple moving average (4 hours). Source: SOLUSD on TradingView.com Immediate resistance is near the $100 level. The next major resistance is near the $104 level or the 76.4% Fib retracement level of the downward move from the $106.41 swing high to the $92.95 low. A successful close above the $104 resistance could set the pace for another major increase. The next key resistance is near $112. Any more gains might send the price toward the $120 level. Another Decline in SOL? If SOL fails to rally above the $100 resistance, it could start another decline. Initial support on the downside is near the $92 level and the 100 simple moving average (4 hours). The first major support is near the $90 level, below which the price could test $85. If there is a close below the $85 support, the price could decline toward the $78 support in the near term. Technical Indicators 4-Hours MACD – The MACD for SOL/USD is gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $92, and $92. Major Resistance Levels – $100, $104, and $112."
  }
]