[
  {
    "source": "NewsBTC",
    "date": "2023-11-28T04:47:45.000Z",
    "title": "XRP Price Prediction – Downside Thrust Possible Before Fresh Surge To $0.72",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-prediction-downside-thrust-0-55/",
    "description": "XRP price is moving lower from the $0.732 resistance. The price is now at risk of more losses toward the $0.550 support before the bulls take a stand. XRP started a downside correction below $0.638 and $0.612. The price is now trading below $0.625 and the 100 simple moving average (4 hours). There is a key declining channel forming with resistance near $0.622 on the 4-hour chart of the XRP/USD pair (data source from Kraken). The pair dive toward the $0.550 support before the bulls take a stand. XRP Price Turns Red In the past few days, XRP saw a steady decline from the $0.740 zone. There was a move below the $0.685 and $0.638 support levels. The price even dived below the $0.612 support, underperforming Bitcoin and Ethereum. There was a recovery wave from $0.572, but the bears were active near $0.638. A high was formed near $0.6385 and the price is now moving lower. There was a break below the 50% Fib retracement level of the upward move from the $0.5723 swing low to the $0.6385 high. XRP is now trading below $0.625 and the 100 simple moving average (4 hours). There is also a key declining channel forming with resistance near $0.622 on the 4-hour chart. On the upside, immediate resistance is near the $0.615 level. The first major resistance is near the $0.622 zone or the 100 simple moving average (4 hours) or the channel upper zone. A close above the $0.622 resistance zone could spark a steady increase. Source: XRPUSD on TradingView.com The next key resistance is near $0.638. If the bulls remain in action above the $0.638 resistance level, there could be a rally toward the $0.700 resistance. Any more gains might send XRP toward the $0.720 resistance. More Downsides? If XRP fails to clear the $0.622 resistance zone, it could start a fresh decline. Initial support on the downside is near the $0.588 zone. The next major support is at $0.572. If there is a downside break and a close below the $0.572 level, XRP price might accelerate lower. In the stated case, the price could retest the $0.540 support zone. Technical Indicators 4-Hours MACD – The MACD for XRP/USD is now gaining pace in the bearish zone. 4-Hours RSI (Relative Strength Index) – The RSI for XRP/USD is now below the 50 level. Major Support Levels – $0.588, $0.572, and $0.540. Major Resistance Levels – $0.622, $0.638, and $0.700."
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-28T04:40:34.000Z",
    "title": "The IMF Is Going Into Panic Mode As Public Chooses Crypto Over CBDCs",
    "url": "https://dailyhodl.com/2023/11/27/the-imf-is-going-into-panic-mode-as-public-chooses-crypto-over-cbdcs/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/02/imf-favors-central-bank.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/02/imf-favors-central-bank.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/02/imf-favors-central-bank.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/02/imf-favors-central-bank.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/02/imf-favors-central-bank.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/02/imf-favors-central-bank.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/02/imf-favors-central-bank.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>South Koreans will next year have the opportunity to use deposit tokens based on a CBDC (central bank digital currency) through a pilot program operated by the BOK (Bank of Korea) and financial authorities. 100,000 individuals will purchase goods with deposit tokens issued by commercial banks in the form of CBDCs, similar to using a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/27/the-imf-is-going-into-panic-mode-as-public-chooses-crypto-over-cbdcs/\">The IMF Is Going Into Panic Mode As Public Chooses Crypto Over CBDCs</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]