[
  {
    "source": "Crypto Daily",
    "date": "2023-06-29T09:57:29.000Z",
    "title": "FTX Looks To Revive Crypto Exchange",
    "url": "https://cryptodaily.co.uk/2023/06/ftx-looks-to-revive-crypto-exchange",
    "description": "<p>FTX is reportedly looking to revive its crypto exchange, according to Wall Street Journal report. </p>\n<p>The once-leading crypto exchange FTX which suffered a spectacular collapse and filed for Chapter 11 bankruptcy in November 2022, is reportedly exploring the possibility of reviving the FTX.com exchange.</p>\n<p>The Wall Street Journal reports that FTX&rsquo;s newly appointed CEO, John Ray, said the company has begun &ldquo;the process of soliciting interested parties to the reboot of the FTX.com exchange.&rdquo;</p>\n<p>FTX experienced a severe liquidity crisis in November, prompting customers to withdraw an estimated $6 billion over fear that their assets were unsafe on the exchange. The Sam Bankman-Fried (SBF) led crypto empire collapsed after news broke that FTX and its sister trading firm Alameda Research had been sharing assets to boost the company&rsquo;s balance sheet.</p>\n<p>FTX&rsquo;s improper trading of customer funds via Alameda saw SBF step down as CEO of the exchange. The disgraced CEO was charged with various federal crimes, including money laundering, fraud, and conspiracy to commit wire fraud.</p>\nSBF&rsquo;s Request To Dismiss Charges Is Rejected\n<p>On Tuesday, &nbsp;New York federal Judge Lewis Kaplan denied the FTX founder&rsquo;s request to dismiss most of the criminal charges against him over the collapse of the exchange.</p>\n<p>The disgraced founder has pleaded not guilty to all charges and is now accused of misleading investors and lenders.</p>\n<p>Bankman-Fried will stand trial in October.</p>\nFTX Halts Sale of Its Stake in Anthropic\n<p>Bloomberg reported earlier in the week that FTX was set to sell its shares in the AI platform Anthropic but has decided to put the brakes on the sale.</p>\n<p>FTX currently holds over $500 million worth of shares in Anthropic, and the exchange has provided no specific reason for the halt of the sale.</p>\nFTX Management Recover $7B in Liquid Assets\n<p>FTX&rsquo;s newly appointed management team announced this week that it made &ldquo;substantial progress&rdquo; in asset recovery. It revealed that it has thus far recovered $7 billion of liquid assets.</p>\n<p>The company&rsquo;s new management published an investigative report with John Ray explaining the reality of what is going on at the exchange.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T09:54:59.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-29T10:00:35.000Z",
    "title": "North Carolina House Approves Bitcoin Study, What Will It Reveal?",
    "url": "https://www.newsbtc.com/bitcoin-news/north-carolina-house-approves-bitcoin-study-what-will-it-reveal/",
    "description": "In consideration of recent developments, a bill has been introduced to evaluate the feasibility of establishing a state-administered depository for cryptocurrencies, positioning North Carolina as the custodian of its Bitcoin and virtual asset holdings. However, the proposed study will thoroughly assess the costs and benefits associated with alternatives such as a privately managed depository or utilizing the depository of another state. A Comprehensive Study For North Carolina&#8217;s Financial Holdings On June 28, the House approved a bill that authorizes a comprehensive study with a budget of $50,000. The primary objective of this study is to evaluate the feasibility of incorporating gold bullion and virtual currencies like BTC into North Carolina&#8217;s financial holdings. The study aims to examine various aspects, including the secure acquisition, storage, insurance, and liquidation of these assets. One of the main areas of investigation is the potential impact that gold and cryptocurrency holdings could have on North Carolina&#8217;s funds. Specifically, the study intends to assess whether such holdings could serve as a hedge against inflation and mitigate systemic credit risks. Furthermore, it seeks to determine if integrating gold and crypto assets into the portfolio could effectively reduce volatility and enhance overall returns. Related Reading: Report Reveals Surge In Institutional Bitcoin Adoption, How Far Will It Go? By undertaking this study, the House plans to gather crucial insights and evidence that will inform the decision-making process regarding North Carolina&#8217;s investment strategy. The bill emphasizes a neutral and data-driven approach to understanding the potential benefits and risks associated with diversifying the state&#8217;s financial holdings with gold and virtual currencies. The bill was successfully passed in the House with a majority vote of 73 in favor, 40 against, and seven members absent. For it to become law or be subject to a potential veto by Governor Roy Cooper, it must now proceed to the Senate for further consideration. Bitcoin Study: Analysis Of North Carolina&#8217;s Virtual Asset Holdings In a separate legislative initiative, on May 3, North Carolina&#8217;s House unanimously approved a bill that would prohibit payments to the state using a central bank digital currency (CBDC). Additionally, the bill specified that North Carolina would not permit the Federal Reserve to conduct any future pilot CBDC testing within its jurisdiction. BTC market cap on a 1D chart &#124; Source: TradingView Prior to this, on May 2, the Board of Commissioners for Buncombe County in North Carolina passed a one-year moratorium on cryptocurrency mining. This decision temporarily restricts crypto mining activities within the county. Related Reading: Bitcoin Price Needs To Clear $31K For Hopes of a Fresh Rally These recent developments reflect the ongoing examination of various aspects surrounding cryptocurrencies and digital assets in North Carolina. The state continues to navigate the complexities and implications associated with these emerging technologies through comprehensive legislation and careful evaluation. Featured image from iStock, charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-29T10:00:48.000Z",
    "title": "RocketPool is crashing, down 21% in 30 days, InQubeta set for explosion after 25% growth",
    "url": "https://www.crypto-news-flash.com/rocketpool-is-crashing-down-21-in-30-days-inqubeta-set-for-explosion-after-25-growth/?utm_source=rss&utm_medium=rss&utm_campaign=rocketpool-is-crashing-down-21-in-30-days-inqubeta-set-for-explosion-after-25-growth",
    "description": "The crypto market has experienced a roller coaster ride in recent times, with various tokens facing significant price fluctuations. Rocket Pool, a decentralized Ethereum staking pool recently encountered a substantial fallout after a notable price surge followed by a subsequent decline. As the market remains uncertain, investors are closely monitoring the trajectory of Rocket Pool&#8217;s [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-29T09:43:17.000Z",
    "title": "The Latest Review About Francium Protocol",
    "url": "https://www.altcoinbuzz.io/reviews/the-latest-review-about-francium-protocol/",
    "description": "<p>The Francium Protocol has recently generated significant attention as a promising DeFi protocol on Solana&#8217;s blockchain. Its focus on enhanced security and efficiency sets Francium apart from other protocols on the DeFi landscape. Let&#8217;s dive deeper into the unique characteristics and potential of the Francium Protocol. What Is Francium Protocol? The Francium Protocol is a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/reviews/the-latest-review-about-francium-protocol/\">The Latest Review About Francium Protocol</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-29T09:49:00.000Z",
    "title": "Twitter User Predicts That LTC’s Market Cap Will Soar by 2025",
    "url": "https://coinedition.com/twitter-user-predicts-that-ltcs-market-cap-will-soar-by-2025/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/LITECOIN-4-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The crypto Twitter user Shan Belew predicted in a tweet published earlier today that the market cap for Litecoin (LTC) may climb more than 10X between now and 2025. In the post, he forecasted that the crypto’s market cap could reach the 100s of billions in 2025.  This would be a substantial increase in LTC’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/twitter-user-predicts-that-ltcs-market-cap-will-soar-by-2025/\">Twitter User Predicts That LTC’s Market Cap Will Soar by 2025</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]