[
  {
    "source": "CoinDesk",
    "date": "2023-11-28T15:00:00.000Z",
    "title": "A16z Backs Web3 Consumer App Setter in $5M Seed Round",
    "url": "https://www.coindesk.com/business/2023/11/28/a16z-backs-web3-consumer-app-setter-in-5m-seed-round/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Setter aims to address \"the complexity and unfriendliness of current wallet technologies,\" making entry into Web3 a seamless experience for more users."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-28T15:01:02.000Z",
    "title": "How to AI: Best AI Tools for Students",
    "url": "https://decrypt.co/207695/how-to-ai-best-ai-tools-for-students",
    "description": "Not all students are letting AI do their homework. Others are seizing upon the technology to genuinely augment their education."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-28T14:51:07.000Z",
    "title": "Cardano Founder Charles Hoskinson: Bitcoin Gets ‘Complete Pass’ From SEC",
    "url": "https://decrypt.co/207702/cardano-founder-charles-hoskinson-bitcoin-gets-complete-pass-from-sec",
    "description": "The Cardano founder argued that Bitcoin is not decentralized, and that other cryptocurrencies are unfairly considered securities."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-28T14:59:52.000Z",
    "title": "Price fluctuations in stablecoins spotlight diverging market sentiments",
    "url": "https://cryptoslate.com/insights/price-fluctuations-in-stablecoins-spotlight-diverging-market-sentiments/",
    "description": "<p>Quick Take While the core purpose of stablecoins like USDT, USDC, and TUSD is to equate to $1, an intriguing pattern of fluctuating price movements emerges upon close scrutiny. By employing a 14-day moving average to smooth out the price variations, we discern noticeable disparities in their respective trajectories. USDT, after trading at a discount [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/price-fluctuations-in-stablecoins-spotlight-diverging-market-sentiments/\">Price fluctuations in stablecoins spotlight diverging market sentiments</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-28T14:42:54.000Z",
    "title": "Spain mandates disclosure of foreign-held crypto assets over €50,000 for tax purposes",
    "url": "https://cryptoslate.com/spain-mandates-disclosure-of-foreign-held-crypto-assets-over-e50000-for-tax-purposes/",
    "description": "<p>Spanish citizens must disclose crypto holdings exceeding 50,000 euros (about $55,000) held on foreign platforms for tax purposes starting January next year, according to an update from Spain&#8217;s Tax Administration Agency, Agencia Tributaria. The tax agency introduced Form 721, a declaration form specifically designed for virtual assets held abroad. The form would require legal residents [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/spain-mandates-disclosure-of-foreign-held-crypto-assets-over-e50000-for-tax-purposes/\">Spain mandates disclosure of foreign-held crypto assets over €50,000 for tax purposes</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-28T15:03:49.000Z",
    "title": "Less than 10% Up in November, Bitcoin (BTC) Hints at Super Bullish Christmas",
    "url": "https://cryptodaily.co.uk/2023/11/less-than-10-up-in-november-bitcoin-btc-hints-at-super-bullish-christmas",
    "description": "Explore the journey of Bitcoin (BTC) as it experiences modest growth in November, hinting at a potential bullish trend for the festive period. Our in-depth analysis sheds light on the critical indicators suggesting a possible surge as the year draws to a close. Dive into the nuances of the original cryptocurrency's market behavior, where even slight upticks may signal a significant rally. Keep abreast of the dynamic world of cryptocurrencies with our expert insights, providing a detailed view of the BTC prospective movements as we edge towards the end of the year."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-28T14:58:58.000Z",
    "title": "Bitcoin (BTC) consolidation boosts Aave (AAVE) and Meme Moguls (MGLS) price",
    "url": "https://cryptodaily.co.uk/2023/11/bitcoin-btc-consolidation-boosts-aave-aave-and-meme-moguls-mgls-price",
    "description": "With Fidelity and BlackRock both recently filing for spot Bitcoin and Ethereum ETFs, more institutional options could soon emerge for crypto exposure."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-28T14:49:17.000Z",
    "title": "ChatGPT’s Best Crypto Picks in Q4: Ripple (XRP), Ethereum (ETH) and Meme Moguls (MGLS)",
    "url": "https://cryptodaily.co.uk/2023/11/chatgpts-best-crypto-picks-in-q4-ripple-xrp-ethereum-eth-and-meme-moguls-mgls",
    "description": "As the crypto market enters the final quarter of 2023, everyone's trying to figure out exactly which cryptocurrencies have the most growth potential during the year. Only some coins can be profitable, and due to this, many have turned to ChatGPT for the answer."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-28T14:51:01.000Z",
    "title": "Rivo.xyz DeFi Gateway: Bridging Web2 and Web3 Via Smart Wallets and Hand-Picked Investment Strategies",
    "url": "https://cryptodaily.co.uk/2023/11/rivoxyz-defi-gateway-bridging-web2-and-web3-via-smart-wallets-and-hand-picked-investment-strategies",
    "description": "Rivo.xyz provides an accessible platform with a friendly interface, a smart contract wallet with easy access to DeFi strategies, and a comprehensive DeFi marketplace."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-28T15:08:52.000Z",
    "title": "New Binance CEO Richard Teng: Here’s what you need to know",
    "url": "https://crypto.news/new-binance-ceo-richard-teng-heres-what-you-need-to-know/",
    "description": "Teng's focus on regulatory compliance could chart a new course for the exchange amid recent legal upheavals."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-28T14:52:34.000Z",
    "title": "1ex Trading Board: enhancing crypto traders’ potential using AI",
    "url": "https://crypto.news/1ex-trading-board-enhancing-crypto-traders-potential-using-ai/",
    "description": "1ex Trading Board aims to be the co-pilot for traders and uses intelligent AI-powered analysis to provide market insights"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-28T14:46:40.000Z",
    "title": "Bitfarms to purchase Bitmain’s BTC miners for $95.5m",
    "url": "https://crypto.news/bitfarms-to-purchase-bitmains-btc-miners-for-95-5m/",
    "description": "Mining company Bitfarms has placed an order for 35,888 Antminer T21 Bitcoin mining devices from Bitmain at a price of $2,660 per unit."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-28T15:00:31.000Z",
    "title": "Bitcoin Bull Run Is Only Just Starting, According To This Metric",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bull-run-is-only-just-starting-according-to-this-metric/",
    "description": "On-chain data shows the Bitcoin SOPR hasn&#8217;t yet reached high levels that have been associated with heated bull market phases in the past. Bitcoin SOPR Has Only Seen Mildly Positive Values Recently In a CryptoQuant Quicktake post, an analyst has explained how market psychology has driven the BTC price during the past few years. The on-chain indicator that best represents the Bitcoin trader psychology according to the quant is the &#8220;Spent Output Profit Ratio&#8221; (SOPR). The SOPR basically tells us about whether the BTC investors are selling their coins (or more precisely, transferring them on the blockchain) at a net amount of profit or loss. Related Reading: Santiment Reveals Trigger Behind Bitcoin Rally: Will This Signal Reignite? When the indicator has a value greater than 1, it means that the average holder in the sector is selling their coins at some profit right now. On the other hand, a value under this threshold implies that loss-selling is dominant among the participants. Naturally, when the SOPR has a value exactly equal to 1, the overall market can be assumed to be just breaking even on their selling, as the number of profits being realized is exactly canceling out the losses. Now, here is a chart that shows the trend in the Bitcoin SOPR over the past few years: Looks like the value of the metric has been slightly positive in recent weeks &#124; Source: CryptoQuant In the above graph, the analyst has marked the pattern that the Bitcoin SOPR has followed in recent years. During the 2018 bear market, the BTC SOPR dropped to pretty low values below 1 following the November 2018 crash. Coinciding with these lows in the metric, the price also found its bottom. In the 2022 bear market, the BTC investors were keeping still in the red as they participated in only a relatively low amount of loss selling until the FTX crash occurred and the holders finally capitulated to a significant degree. So far, it would appear that the low after the FTX collapse was indeed the bottom for the current cycle, as BTC has only gone and doubled in value since then. The pattern of this bottom has also been consistent with the one of the 2018 bear market. In between these two major bottoms, there was also a large-scale capitulation event back in 2020, but this crash was mostly an anomaly caused by the unexpected emergence of the COVID-19 pandemic. From the chart, it&#8217;s visible that the trend during rallies has generally been just the opposite: investors start selling at large profits and once the profit-taking attains extreme levels, the top is hit. Related Reading: Analyst Sets $47,000 Target For Bitcoin If This Happens Earlier this year, the BTC SOPR spiked to high levels around when BTC hit its local top in April. Since then, though, the indicator has remained relatively calm, with some mild profit-taking coming after the latest leg in the rally. &#8220;There will be many corrections and declines in the current market until it reaches the peak of the bull market, but from a psychological perspective, there still seems to be enough time left until the latter half of the bull market,&#8221; thinks the quant. BTC Price Bitcoin had registered a decline below the $37,000 level during the past day, but the asset has pulled itself back up since then as it&#8217;s just floating above the mark now. The price of the asset appears to have seen some drawdown recently &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-28T15:07:06.000Z",
    "title": "Cosmos Founder Sparks Excitement with New ATOM Fork Amid Governance Shake-Up",
    "url": "https://www.crypto-news-flash.com/cosmos-founder-sparks-excitement-with-new-atom-fork-amid-governance-shake-up/?utm_source=rss&utm_medium=rss&utm_campaign=cosmos-founder-sparks-excitement-with-new-atom-fork-amid-governance-shake-up",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/upgrade-1672367_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/upgrade-1672367_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/upgrade-1672367_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/upgrade-1672367_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/upgrade-1672367_1920-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Despite his objection, Cosmos (ATOM) founder Jae Kwon is moving forward with plans to fork after a successive governance proposal. Although there is excitement in the community in anticipation of positive changes in the near future, Cosmos&#8217; ATOM has lost around 6 percent in the last 24 hours. The Cosmos (ATOM) network is ushering in [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-28T15:05:00.000Z",
    "title": "The FSB Recommends More Supervision for the Crypto Industry",
    "url": "https://coinedition.com/the-fsb-recommends-more-supervision-for-the-crypto-industry/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Crypto-regulation-18.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"The FSB Recommends More Supervision for the Crypto Industry\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Crypto-regulation-18.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Crypto-regulation-18-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Crypto-regulation-18-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Crypto-regulation-18-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Crypto-regulation-18-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Crypto-regulation-18-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to the FSB, there is a need for increased regulation in the crypto industry. Multifunction crypto firms are those that combine trading and other activities, said the FSB. The FSB noted that collapses in multifunction crypto firms could destabilize traditional finance. The Financial Stability Board (FSB), a global organization that regulates and makes recommendations [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/the-fsb-recommends-more-supervision-for-the-crypto-industry/\">The FSB Recommends More Supervision for the Crypto Industry</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-28T14:41:00.000Z",
    "title": "Cryptocurrencies to ‘Eventually Leave the Scene,’ Says MAS Director",
    "url": "https://coinedition.com/cryptocurrencies-to-eventually-leave-the-scene-says-mas-director/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/CBDC-11.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/CBDC-11.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/CBDC-11-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/CBDC-11-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/CBDC-11-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/CBDC-11-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/CBDC-11-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/CBDC-11-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/CBDC-11-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/CBDC-11-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/CBDC-11-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/CBDC-11-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/CBDC-11-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/CBDC-11-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/CBDC-11-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/CBDC-11-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/CBDC-11-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>“Cryptocurrencies have miserably failed the test of money because they can’t keep value,” said Ravi Menon, managing director of the Monetary Authority of Singapore. At a panel discussion on the Future of Monetary System as part of the Hong Kong Monetary Authority-Bank for International Settlements event, Menon stated that private cryptocurrencies will eventually exit the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/cryptocurrencies-to-eventually-leave-the-scene-says-mas-director/\">Cryptocurrencies to &#8216;Eventually Leave the Scene,&#8217; Says MAS Director</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]