[
  {
    "source": "Cointelegraph",
    "date": "2024-02-02T19:01:32.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">The market for Bitcoin Ordinals cooled in January, as sales fell sharply from the previous month. Meanwhile, Binance helped out Ripple co-founder Chris Larson by freezing $4.2 million worth of the stolen XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) from the hacker, and three people have been linked to the $400 million hack of crypto exchange FTX in 2022, with suggestions it was part of a sim-swap attack. </p><p>Ordinals inscriptions on the Bitcoin network lost momentum in January, with <a href=\"https://cointelegraph.com/news/bitcoin-ordinals-sales-decline-january-halving-hope\">sales declining by 61%</a> to $335 million, according to NFT aggregator CryptoSlam.</p><p><a href=\"https://cointelegraph.com/news/okx-nft-bitcoin-ordinals-not-spam-atomicals-runes-doginals-stamps\">Ordinals burst onto the scene</a> last year, with sales hitting $868 million in December — the highest in the collection’s history. </p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-02T18:56:59.000Z",
    "title": " Dogecoin network activity goes parabolic — Will DOGE price follow? ",
    "url": "https://cointelegraph.com/news/dogecoin-network-activity-goes-parabolic-will-doge-price-follow",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZTFlOGY5YTYtNjQwNC00MzkxLTgyMmYtZTQ2NjViMmQxNWZlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Dogecoin network activity surged in the past week, but DOGE price hasn’t moved yet. </p>\n                    <p><p>Popular memecoin Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) has been trading sideways, above the 200-day exponential moving average (EMA) since Jan. 7. DOGE price is down 0.4% over the last week and 14% over the last month and even though the technical setup hints at further losses for DOGE, the recent spike in network activity is interesting.</p><p>Dogecoin is experiencing a significant increase in its network activity. Data from market intelligence firm IntoTheBlock shows over 890,000 new Dogecoin addresses have been created over the past week. </p><p>This increase in new addresses coincides with an 86% adoption rate as the new users execute their first transactions on the blockchain. </p><p><a href=\"https://cointelegraph.com/news/dogecoin-network-activity-goes-parabolic-will-doge-price-follow\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-02T18:40:03.000Z",
    "title": "BlackRock’s Bitcoin ETF eclipses Grayscale’s in daily trading volume for the first time",
    "url": "https://cryptobriefing.com/blackrocks-bitcoin-etf-eclipses-grayscale-daily-trading-volume-first-time/?utm_source=feed&utm_medium=rss",
    "description": "BlackRock's IBIT sets the pace in Bitcoin ETFs, topping Grayscale's daily trading volume and taking the lead."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-02T19:00:19.000Z",
    "title": "Bitcoin’s Big Breakout: This Bullish Pattern Signals An Imminent Price Surge",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-big-breakout-this-bullish-pattern-signals-an-imminent-price-surge/",
    "description": "Market analysts have recently observed a notable pattern in Bitcoin price chart, potentially signaling a shift in the market trend. Jake Wujastyk, a prominent market analyst, has particularly pointed out the emergence of an inverse head and shoulders pattern on Bitcoin&#8217;s daily candle chart. This pattern, coupled with Bitcoin&#8217;s closing price above a significant &#8220;volume shelf&#8221; signals an imminent upward trajectory for Bitcoin. Related Reading: Bitcoin Halving Prep: Analyst Outlines Key Points Ahead Of Event Bitcoin Surge On The Horizon In technical analysis, an inverse head and shoulders pattern is traditionally interpreted as a bullish signal. It is characterized by two lower peaks (shoulders) on either side of a far-down valley (head). The completion of this pattern occurs when the price breaks above the resistance level, known as the &#8220;neckline.&#8221; In Bitcoin’s case, this neckline also aligns with a &#8216;volume shelf,&#8217; as Wujastyk indicates, a price level where many contracts have previously been traded, indicating strong support or resistance. #Bitcoin Inverse head &#38; shoulders on the daily candle chart as price closed above the volume shelf today. $BTCUSD #Crypto pic.twitter.com/zE1lDJGnAM — Jake Wujastyk (@Jake__Wujastyk) February 2, 2024 As Bitcoin’s price currently sits above the critical level of $43,000 up by 4.7% in the past week, it suggests a growing momentum among buyers, hinting at a potential uptrend. At the time of writing, Bitcoin has seen a 2.1% increase in its price over the past 24 hours, reaching $43,144. This price movement occurs against a backdrop of fluctuating daily trading volumes, which have decreased from over $25 billion to below $20 billion in a day. Notably, this pattern&#8217;s emergence is particularly noteworthy as Bitcoin options are set to expire, with 22,000 BTC options nearing their expiry date. These options have a Put Call Ratio of 0.66, a Maxpain point of $42,000, and a notional value of $960 million, as per data from Greekslive. For context, the Put Call Ratio is a key indicator in options trading, representing the number of put options relative to call options. A lower ratio suggests a bullish sentiment, as it indicates more call options (bets on the price rising) are being traded compared to put options (bets on the price falling). Market Trends And BTC Halving Anticipation The broader crypto market, including Ethereum (ETH) options, is also approaching expiration. 230,000 ETH options are set to expire, with a Put Call Ratio of 0.33, a Maxpain point of $2,300, and a notional value of $530 million. These figures suggest a more bullish outlook for Ethereum compared to Bitcoin. Furthermore, according to GreekLive, the market has seen subdued activity recently, with both realized volatility (RV) and implied volatility (IV) trending lower for major cryptocurrencies. Feb. 2 Options Data 22,000 BTC options are about to expire with a Put Call Ratio of 0.66, a Maxpain point of $42,000 and a notional value of $960 million. 230,000 ETH options are about to expire with a Put Call Ratio of 0.33, a Maxpain point of $2,300 and a notional value of… pic.twitter.com/tEQWxRXxtB — Greeks.live (@GreeksLive) February 2, 2024 However, introducing Bitcoin spot exchange-traded funds (ETFs) is beginning to attract incremental capital to the crypto market, compensating for the slowdown in grayscale sell-off. Meanwhile, the anticipation around Bitcoin&#8217;s halving event, scheduled for April 2024, is creating a buzz in the market. A recent survey by Bitget indicates a bullish sentiment among investors regarding the upcoming Bitcoin halving. 84% of respondents globally believe that Bitcoin will exceed its all-time high of $69,000 in the next bull run. Related Reading: Market Survey Signals Bull Run: Investors Predict Bitcoin To Surpass $69,000 Post Halving Predictions for Bitcoin’s price during the halving are varied, with over half expecting it to be between $30,000 and $60,000, while about 30% foresee it is surpassing $60,000. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-02T19:00:50.000Z",
    "title": "Rebel Satoshi vs. MANTA: Analyzing the Next Big Investment Opportunity",
    "url": "https://www.crypto-news-flash.com/rebel-satoshi-vs-manta-analyzing-the-next-big-investment-opportunity/?utm_source=rss&utm_medium=rss&utm_campaign=rebel-satoshi-vs-manta-analyzing-the-next-big-investment-opportunity",
    "description": "<img width=\"1200\" height=\"750\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-02T175113.094.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-02T175113.094.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-02T175113.094-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-02T175113.094-768x480.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-02T175113.094-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-02T175113.094-450x281.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Manta network launches its native coin MANTA, which looks to become one of the top altcoins to invest in. Rebel Satoshi ($RBLZ) poses a threat to other altcoins as it emerges as the best crypto to buy, per top ICO experts.  Rebel Satoshi has broken records in its ongoing presale, emerging as the top altcoin [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-02T19:05:32.000Z",
    "title": "This Catalyst Could Trigger Chainlink To Jump Further, According to Blockchain Analytics Firm Santiment",
    "url": "https://dailyhodl.com/2024/02/02/this-catalyst-could-trigger-chainlink-to-jump-further-according-to-blockchain-analytics-firm-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/09/sleeping-on-chainlink-2.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/09/sleeping-on-chainlink-2.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/09/sleeping-on-chainlink-2.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/09/sleeping-on-chainlink-2.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/09/sleeping-on-chainlink-2.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/09/sleeping-on-chainlink-2.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/09/sleeping-on-chainlink-2.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analytics firm Santiment says one metric is suggesting that decentralized oracle network Chainlink (LINK) could have more upside potential. In a new thread on the social media platform X, the market intelligence platform says that Chainlink&#8217;s rally may continue even as LINK wallets see a sudden decline. According to Santiment, an abrupt wallet decline [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/02/this-catalyst-could-trigger-chainlink-to-jump-further-according-to-blockchain-analytics-firm-santiment/\">This Catalyst Could Trigger Chainlink To Jump Further, According to Blockchain Analytics Firm Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]