[
  {
    "source": "CoinDesk",
    "date": "2024-01-03T00:03:31.000Z",
    "title": "Michael Saylor Commences Plan to Sell $216M Worth of MicroStrategy Stock Options",
    "url": "https://www.coindesk.com/business/2024/01/03/michael-saylor-commences-plan-to-sell-216m-worth-of-microstrategy-stock-options/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Saylor said in an earlier earnings call that he will use the proceedings to meet personal obligations and buy additional bitcoin to his personal account."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-03T00:05:56.000Z",
    "title": "Is A Bitcoin Spot ETF Approval A Sell The News Event? Experts Respond",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-spot-etf-sell-the-news/",
    "description": "All attention of crypto investors has turned toward January 10 when the first Spot Bitcoin ETF is expected to be approved. As usual, the excitement triggered by this has seen prices recover across the space, with no doubt about the bull sentiment leading up to the event. However, arguments have arisen about whether this bullish sentiment would continue if a Spot ETF is eventually approved or if it will end up being a “sell the news” event. What Is A Sell The News Event? The phrase “sell the news” is popular in investing circles and is usually associated with a major event that ends up moving prices. BlackRock and 12 other asset managers filing for Spot Bitcoin ETFs with the US Securities and Exchange Commission (SEC) is an example of such a major event. Related Reading: XRP Price Surge: Crypto Analyst Predicts Various Bullish Scenarios In The Coming Days When the event is positive, it has a good impact on assets in the industry, and in the case of crypto, the prices of Bitcoin and other cryptocurrencies begin to rise. This is usually from the anticipation surrounding the event and investors taking up positions in order not to miss a major move. Mostly, this is because investors expect that the main event, such as the approval of a Spot Bitcoin ETF, would trigger further price increases. However, this is not always the case for the market. There have been instances where the main event actually sees prices fall across the board. Such a case is referred to as a “sell the news” event as prices are expected to decline as the euphoria reaches its climax. The potential approval of a Spot Bitcoin ETF has been argued to be a &#8216;sell the news&#8217; event by many in the space, given that prices have already gone up so much. However, not everyone believes this is the case as crypto experts begin to chime in. BTC price declines to $45,000  Source: BTCUSD on Tradingview.com Spot Bitcoin ETF Not A Sell The News Event One of the first crypto experts to share their thoughts around this is Andrew Kang. Kang took to X (formerly Twitter) to explain that the Bitcoin price is actually still mispriced even after rising more than 100% in one year to cross $45,000. Kang explains that a Spot Bitcoin ETF approval would see all of these asset managers trying to grab between $10 and $20 billion in fees. They will also be pushing for marketing which Kang believes every dollar spent on marketing in 2024 becomes even more important in 2025. “When you think about the size of the opportunity, it shouldn&#8217;t surprise us to see marketing/ad spend on the scale of 2021 bull madness,” Kang said. “When you consider the importance of timing for issuers, maybe we even take it a level further. It&#8217;s going to be a bonanza.” Related Reading: Crypto Analyst Says History Shows What Might Be Next For Bitcoin, But Is It Good Or Bad? Also responding to and buttressing Kang’s point is @ChainLinkGod who gave their own insight into how bullish an approval is. They explain that all of the asset managers who have filed for Spot ETFs are inherently long on Bitcoin. “Yes, they don’t technically have any directional exposure, but all else equal, a 10x in the price of bitcoin is a 10x in yearly management fees,” ChainLinkGod explains. They further add that each applicant will be looking to become the dominant player as this means they will be able to harvest billions of dollars in fees passively for years. “All of which involves massive ad spend, shilling $BTC at every public appearance, and advising all their clientele *this year* to get exposure to $BTC via their ETF,” they explain. Given this, a potential approval is more bullish than bearish for Bitcoin as the players struggle for dominance. Featured image from Investopedia, chart from Tradingview.com"
  }
]