[
  {
    "source": "Cointelegraph",
    "date": "2024-02-08T01:57:07.000Z",
    "title": " Disney’s $1.5B stake in Epic smells a lot like another metaverse play ",
    "url": "https://cointelegraph.com/news/disney-invests-fortnite-maker-epic-games-possible-metaverse-play",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZmQxZjY2OGUtYzRiNS00ZThiLThiNGUtZmVjNTEyYjc0YWFlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Disney cut its metaverse division less than a year ago but is now looking like it’s teaming up with Epic Games to build one after all.</p>\n                    <p><p>Walt Disney Co. is acquiring a $1.5 billion equity stake in Epic Games to build what it’s calling a “persistent universe” — less than a year after shuttering its metaverse division.</p><p>In a Feb. 7 <a href=\"https://thewaltdisneycompany.com/disney-and-epic-games-fortnite/\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, Disney said the multiyear project — subject to regulatory approval — would be a game experience that interoperates with Epic’s <a href=\"https://cointelegraph.com/news/fortnite-gta6-functional-metaverse-before-crypto-nerds\">flagship game Fortnite</a>. The project will be a “games and entertainment universe,” allowing users to “play, watch, shop and engage with content, characters and stories” from Disney’s assets.</p><p><a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/epic-games\">Epic Games</a> founder and CEO Tim Sweeney said the two will “build a persistent, open and interoperable ecosystem,” while Disney CEO Bob Iger said it “marks Disney’s biggest entry ever into the world of games.”</p><p><a href=\"https://cointelegraph.com/news/disney-invests-fortnite-maker-epic-games-possible-metaverse-play\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-08T02:00:58.000Z",
    "title": "Kaspa (KAS) To Hit $3 In Explosive Bull Run, Expert Predicts 2650% Surge",
    "url": "https://www.newsbtc.com/news/kaspa-kas-to-hit-3-in-explosive-bull-run-expert-predicts-2650-surge/",
    "description": "In the dynamic landscape of the cryptocurrency market, Kaspa (KAS) has emerged as a strong contender in the altcoin race, demonstrating notable growth and breaking through the $0.1109 barrier in the past 24 hours, representing a 10.5% increase in this time frame. Interestingly, the bullish momentum for KAS might be far from over as potential catalysts loom on the horizon. These catalysts could propel the token to new all-time highs, surpassing its previous peak of $0.1527. KAS Targets $2-$3 In Next Bull Run In a recent post on X (formerly Twitter), crypto analyst Daan de Rover expressed optimism for Kaspa&#8217;s future, offering compelling reasons for the coin&#8217;s potential growth.  One key factor is Kaspa&#8217;s fair launch, meaning no KAS tokens were reserved for exchange listings. This bullish characteristic becomes apparent as Kaspa is not listed on major exchanges such as Binance, Coinbase, and OKX.  If these exchanges decide to list Kaspa, de Rover states that they would need to acquire KAS tokens from the open market, thereby increasing demand and liquidity.  Given Kaspa&#8217;s reputation and the hype surrounding the project, de Rover believes that realistic price targets of $2 to $3 are achievable in the next bull run, representing a 2650% increase from current price levels. Related Reading: Cardano Price Stagnant At $0.48, But Charts Point To Potential Upswing To understand de Rover&#8217;s thesis, in November 2023, NewsBTC reported the listing of KAS on Coinone, one of the largest cryptocurrency exchanges in South Korea.  Following this listing, KAS experienced a remarkable surge, catapulting it into the top 33 cryptocurrencies by market capitalization (currently 38). In a matter of days, KAS skyrocketed from $0.05139 to its current all-time high of $0.1545 on November 19.  This surge represented a price increase of over 200%, underscoring the significant boost that exchange listings can provide to the Kaspa ecosystem and its price action. Should Kaspa secure listings on major exchanges such as Binance and Coinbase, similar or greater growth and market exposure can be expected, even greater than the Coinone listing. Such a development would attract a wider range of investors and contribute to the overall success of the coin, in line with De Rover&#8217;s pricing analysis.  A Closer Look At Kaspa Kaspa has gained attention for utilizing the proof-of-work (PoW) consensus mechanism and implementing a blockDAG (Block Directed Acyclic Graph) architecture.  This design allows for the coexistence of multiple blocks in parallel, effectively addressing the challenge of high orphan rates commonly associated with traditional blockchains. Inspired by the foundational work of Satoshi Nakamoto, Kaspa aims to preserve key aspects of the Bitcoin (BTC) consensus. These include the PoW mining method, a deflationary economic model, and decentralized decision-making processes.  By incorporating these fundamental principles, Kaspa seeks to provide a robust and secure foundation for its blockchain ecosystem. Related Reading: Ex-Ripple Director Heralds ‘Big News’ For XRP, Can Price Respond? At the core of Kaspa&#8217;s functionality is the GHOSTDAG protocol, which enables parallel blocks to exist and be ordered through consensus. This approach, known as a blockDAG, ensures secure operation while maintaining high block rates.  Currently operating at one block per second, Kaspa aims to achieve even higher rates, ranging from 10 to 100 blocks per second.  Interestingly, this scalability potential has set Kaspa apart from many other blockchain networks, potentially catching the eye of investors, and may be one of the reasons for its current price growth, which has seen KAS grow continuously for over a year with a 1471% spike. Overall, by addressing challenges associated with orphan rates and offering a decentralized and community-focused approach, the network aims to provide a solid foundation for a wide range of applications that require secure blockchain solutions. Featured image from Shutterstock, chart from TradingView.com "
  }
]