[
  {
    "source": "CryptoGlobe",
    "date": "2023-05-29T08:00:10.000Z",
    "title": "ETH Price Prediction: VanEck Forecasts Ethereum to Reach $11.8K by 2030",
    "url": "https://www.cryptoglobe.com/latest/2023/05/eth-price-prediction-vaneck-forecasts-ethereum-to-reach-11-8k-by-2030/",
    "description": "In a recent blog post by Matthew Sigel, Head of Digital Assets Research, and Patrick Bush, Senior Investment Analyst for Digital Assets at VanEck, a leading global asset manager, a bold prediction has been made: Ethereum’s price could potentially skyrocket to $11.8K by 2030. This audacious forecast is grounded in a meticulously crafted valuation model […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-29T07:55:00.000Z",
    "title": "Arbitrum-Based Jimbos Loses $7M As DeFi Exploits Continue",
    "url": "https://cryptodaily.co.uk/2023/05/arbitrum-based-jimbos-loses-7m-as-defi-exploits-continue",
    "description": "<p>Arbitrum-based Jimbos Protocol has become the latest decentralized finance (DeFi) project to fall victim to a hack, resulting in the hacker stealing a significant amount of funds.&nbsp;</p>\n<p>The hack, targeting Version 2 of the Jimbos Protocol, resulted in a loss of $7.3 million.&nbsp;</p>\nThe Latest Hack to Rock DeFi&nbsp;\n<p>The decentralized finance (DeFi) ecosystem continues to be a prime target for hackers, with the hack of the Jimbos Protocol the latest to occur. The protocol was hacked on the 28th of May, 2023, resulting in the loss of around 4000 ETH, worth around $7.3 million, according to data sourced from PeckShield. PeckShield posted an update regarding the hack on their Twitter handle, stating,&nbsp;</p>\n\n<p>&ldquo;It appears today&rsquo;s @jimbosprotocol hack leads to the 4090 ETH loss (w/ ~$7.5M). This hack is due to the lack of slippage control of liquidity-shifting operation -- such that the protocol-owned liquidity is invested into a skewed/imbalanced price range, which is exploited in a reverse swap for profit.&rdquo;</p>\n\n<p>Security analysts blamed the hack on a lack of slippage controls in the primary contract. This allowed the hacker to take out a flash loan, manipulate the price of the protocol&rsquo;s native token and steal the treasury funds. The protocol intended to issue a semi-stable token backed by a basket of crypto tokens. However, it seems like the protocol&rsquo;s mechanisms were not adequately developed, leading to a vulnerability that hackers exploited. As a result of the attack, the value of the protocol&rsquo;s native JIMBO token has dropped by 40%.&nbsp;</p>\n<p>Flash loans have become a popular mode for hackers to steal funds on DeFi systems. These loans enable traders to borrow unsecured funds from lenders. However, they do not require any collateral because the smart contract considers the transaction complete only once the borrower repays the lender. Any borrower defaulting on the flash loan would cancel the transaction and return the funds to the lender.</p>\nJimbos Protocol Trying To Recover Funds&nbsp;\n<p>Developers working with the protocol are exploring the best way forward and are working with the same security researchers that helped Euler Finance recover $200 million following their exploit. Furthermore, the team also added that they would contact the authorities by Monday if the attacker failed to return the stolen funds. The protocol shared an update on Twitter, stating,&nbsp;</p>\n\n<p>&ldquo;Quick update: We are already working with multiple security researchers and on-chain analysts who helped with both the Euler Finance and Sentiment exploits. We will start working with law enforcement agencies tomorrow by 4 PM UTC if this isn&rsquo;t sorted out by then.&rdquo;</p>\n\nDeFi&rsquo;s Hacker Problem&nbsp;\n<p>The DeFi ecosystem has been plagued by hacking incidents, and while there has been a notable decline, the ecosystem continues to deal with the challenge of safeguarding vulnerabilities and restricting unauthorized access. This is despite constant efforts to enhance security measures governing the ecosystem. One recent flash loan attack targeted the 0VIX protocol, leading to the loss of nearly $2 million. Tornado Cash, a prominent privacy-focused protocol, also fell victim to a hack when unknown attackers compromised the protocol and accessed a significant number of TORN tokens. This led to considerable losses for the protocol.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-29T08:00:50.000Z",
    "title": "Economist Peter Schiff Blasts Debt Ceiling Deal, States National Debt Might Increase by $4 Trillion in the Next Two Years",
    "url": "https://news.bitcoin.com/economist-peter-schiff-blasts-debt-ceiling-deal-states-national-debt-might-increase-by-4-trillion-in-the-next-two-years/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2051799791-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"peter schiff debt deal\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2051799791-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2051799791-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2051799791-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2051799791-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2051799791-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2051799791-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2051799791.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Peter Schiff, the chief economist of Europac and best-selling author, has blasted the recent bipartisan deal regarding the United States debt ceiling. According to Schiff, the proposal fails to address the already inflated budget, allowing rises in several budget areas without supervision, which could increase the U.S. national debt by at least $4 trillion in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T07:52:24.000Z",
    "title": "Michael Saylor says Bitcoin can be the ultimate cybersecurity shield",
    "url": "https://www.cryptopolitan.com/michael-saylor-btc-as-cybersecurity-shield/",
    "description": "According to MicroStrategy CEO Michael Saylor, the potential of Bitcoin in battling cybersecurity risks is brought on by artificial intelligence (AI). He suggested creating a public-private key system stored on the Bitcoin layer to establish integrity in cyberspace and stop the spread of phony online identities.&#160; Additionally, Saylor highlights how Bitcoin&#8217;s decentralized blockchain offers cryptographic ... <a title=\"Michael Saylor says Bitcoin can be the ultimate cybersecurity shield\" class=\"read-more\" href=\"https://www.cryptopolitan.com/michael-saylor-btc-as-cybersecurity-shield/\" aria-label=\"More on Michael Saylor says Bitcoin can be the ultimate cybersecurity shield\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-29T07:45:27.000Z",
    "title": "Bitcoin Bulls Push BTC Back Up To $28K Level Amid Surging Address Activity",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bulls-push-btc-back-to-28k/",
    "description": "Bitcoin (BTC), the pioneer of cryptocurrencies, continues to captivate the financial world with its ever-evolving landscape. In recent developments, Bitcoin&#8217;s active addresses have witnessed a significant surge, soaring to a three-week high.  This surge in activity has not only breathed new life into the Bitcoin network but has also reverberated in the form of a substantial increase in the crypto&#8217;s price. The increased demand resulting from heightened network activity has propelled the alpha coin&#8217;s price to new heights, igniting a sense of excitement and potential within the cryptocurrency market.  Related Reading: Bitcoin Core 25.0 Hits The Market: A Sneak Peek Into The Future Surge in Bitcoin&#8217;s Active Addresses Signals Growing Utility Bitcoin&#8217;s utility is on the rise as the number of active addresses for the cryptocurrency has surged to a remarkable three-week high, according to crypto intelligence portal Santiment in a Twitter update. 📈 May&#8217;s concerningly low #Bitcoin address activity is finally starting to rebound again. Increasing utility is necessary for #crypto assets to enjoy sustained rallies. Keep an eye on whether $BTC can head into June with 1M or more daily active addresses. https://t.co/LSa2slHWgt pic.twitter.com/zqTH9KGIqc — Santiment (@santimentfeed) May 27, 2023 After a lull in activity, the latest data reveals that the number of active addresses for BTC has reached an impressive 960,000, marking the first time since May 3 that such levels have been attained. Source: Santiment In sync with the surge in active addresses, Bitcoin&#8217;s price on CoinGecko has climbed $28,032, giving it a 3.0% increase within the last 24 hours. This surge in price also translated to an increase of 4.7% over the course of seven days. Source: Coingecko The surge in active addresses showcases the growing utility and adoption of Bitcoin, which is vital for its sustained growth in the cryptocurrency ecosystem. As we approach the month of June, all eyes are on Bitcoin to see if it can surpass the significant milestone of 1 million daily active addresses. Bitcoin Whales Resume Aggressive Accumulation  Despite a temporary slowdown in accumulation, Bitcoin whales &#8211; those holding 10,000 or more BTC &#8211; have once again intensified their acquisition of the leading cryptocurrency, with a particular surge observed over the weekend. This aggressive accumulation by whales suggests a renewed confidence in Bitcoin&#8217;s long-term potential and may serve as an indicator for future market trends. BTCUSD reclaims the key $28K territory today. Chart: TradingView.com Related Reading: Shiba Inu All Green Today – What’s The Energy Behind The Glow? In the wake of these developments, the crypto market has witnessed a significant increase in liquidations, surpassing a staggering $118 million within the past 24 hours alone. According to The Kobeissi Letter, an authoritative source on market insights, the recent breakthrough of Bitcoin above the $28,000 mark coincided with the news of a debt ceiling deal &#8220;reached in principle&#8221; on the previous night.  In the debt ceiling deal, the debt ceiling is rumored to not be raised by a specific amount. Instead, the debt ceiling will run uncapped until January 1st, 2025. Many are underestimating how significant this is. This means that the debt ceiling is basically unlimited for the… — The Kobeissi Letter (@KobeissiLetter) May 28, 2023 Elaborating further, The Kobeissi Letter reveals that the debt ceiling is rumored to remain uncapped until January 1, 2025, without a specific raise in the limit. This development introduces a level of uncertainty and potential implications for the financial landscape, driving market participants to seek alternative investments such as Bitcoin. -Featured image from VectorStock"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-05-29T07:54:08.000Z",
    "title": "Beginner’s Guide About Tamadoge – Part 1",
    "url": "https://www.altcoinbuzz.io/reviews/beginners-guide-about-tamadoge-part-1/",
    "description": "<p>Today, we&#8217;re going to focus on one coin that isn&#8217;t just a run-of-the-mill meme coin. It&#8217;s a project that&#8217;s building a Play-to-Earn (P2E) game, NFTs, and even a metaverse!  So which coin are we talking about? Why it&#8217;s none other than Tamadoge! In this two-part article series, we&#8217;ll be giving you a beginner’s guide about [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/reviews/beginners-guide-about-tamadoge-part-1/\">Beginner’s Guide About Tamadoge &#8211; Part 1</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-29T07:47:29.000Z",
    "title": "Crypto Market Experiences Memorial Day Weekend Revival",
    "url": "https://coinedition.com/crypto-market-experiences-memorial-day-weekend-revival/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/📈_In_the_midst_of_MemorialDayWeekend_for_the_US_crypto_has_enjoyed-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/📈_In_the_midst_of_MemorialDayWeekend_for_the_US_crypto_has_enjoyed-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/📈_In_the_midst_of_MemorialDayWeekend_for_the_US_crypto_has_enjoyed-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/📈_In_the_midst_of_MemorialDayWeekend_for_the_US_crypto_has_enjoyed-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/📈_In_the_midst_of_MemorialDayWeekend_for_the_US_crypto_has_enjoyed-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/📈_In_the_midst_of_MemorialDayWeekend_for_the_US_crypto_has_enjoyed-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/📈_In_the_midst_of_MemorialDayWeekend_for_the_US_crypto_has_enjoyed.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The market intelligence firm, Santiment, shared in a tweet this morning that during the ongoing Memorial Day Weekend in the United States, the cryptocurrency market experienced a notable revival. The post also pointed out that Bitcoin (BTC) successfully regained its position at the $28.2k price level, while Ethereum (ETH) rebounded to $1,915. However, the most [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-market-experiences-memorial-day-weekend-revival/\">Crypto Market Experiences Memorial Day Weekend Revival</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]