[
  {
    "source": "CoinDesk",
    "date": "2023-11-02T16:45:51.000Z",
    "title": "Market Sees 59% Odds Sam Bankman-Fried Is Found Guilty on All Charges – But There's a Catch",
    "url": "https://www.coindesk.com/markets/2023/11/02/market-sees-59-odds-sam-bankman-fried-is-found-guilty-on-all-charges-but-theres-a-catch/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Traders on crypto-powered Polymarket have bet a grand total of $4,512 on the question, underscoring the current limitations of prediction markets."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-02T16:57:10.000Z",
    "title": "Post Malone Is Taking Over 'Apex Legends'",
    "url": "https://decrypt.co/204159/post-malone-taking-over-apex-legends",
    "description": "EA's free-to-play battle royale shooter Apex Legends is teaming up with musician Post Malone for a new game mode, cosmetic items, and more."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-02T16:49:01.000Z",
    "title": "After Bitcoin Tops $35K, Uniswap and Aave Lead DeFi Token Surge",
    "url": "https://decrypt.co/204120/bitcoin-tops-35k-uniswap-aave-lead-defi-surge",
    "description": "Bitcoin was fast closing in on $36,000 per coin last night. But DeFi tokens are among the biggest gainers right now. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-02T16:40:39.000Z",
    "title": "FCA releases guidance for compliance with new UK crypto asset promotion rules",
    "url": "http://cointelegraph.com/news/fca-releases-guidance-compliance-new-uk-crypto-asset-promotion-rules",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/712a8229-5cf9-453e-b856-b52a11607f33.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The regulator has made a few efforts to help crypto firms comply with the rules that came into force on Oct. 8.</p>\n                    <p><p>Rules for crypto asset promotion that came into force in the United Kingdom on Oct. 8 have led to some confusion, judging from the low level of compliance. The Financial Conduct Authority (FCA) responded with additional guidance for crypto firms to help them fall into line.</p><p>The FCA <a href=\"https://www.fca.org.uk/publication/finalised-guidance/fg23-3.pdf\" target=\"_blank\" rel=\"noopener nofollow\">released</a> “finalized non-handbook guidance” to compliance with the rules for crypto firms on Nov. 2. It also provided the regulatory agency’s response to industry feedback. FCA director of consumer investments Lucy Castledine <a href=\"https://www.fca.org.uk/news/news-stories/guidance-crypto-firms-help-them-comply-marketing-rules\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a statement: </p><blockquote>“While the new rules for firms marketing crypto to UK consumers are aligned with the existing rules for other high-risk investments, we’ve engaged extensively with industry and designed this Guidance to specifically support crypto firms complying.”</blockquote><p>The FCA’s supportive attitude toward the crypto industry has been <a href=\"https://cointelegraph.com/news/uk-fca-unregistered-crypto-firms-final-warning-ads-regime-compliance\">seen in the repeated warnings</a> and <a href=\"https://cointelegraph.com/news/uk-financial-watchdog-reminds-crypto-firms-october-deadline-marketing-compliance\">reminders it has released</a> since the <a href=\"https://cointelegraph.com/news/crypto-ads-face-stricter-rules-including-a-referral-bonus-ban-by-fca\">new rules were published on June 8</a>. It has even <a href=\"https://cointelegraph.com/news/uk-financial-watchdog-crypto-firms-january-2024-marketing-compliance\">extended some technical deadlines</a> through Jan. 8, 2024. In spite of those measures, several market players <a href=\"https://cointelegraph.com/news/defi-solana-marinade-uk-regulations\">announced their departure</a> from the U.K. in response to the rules, and <a href=\"https://cointelegraph.com/news/uk-fca-crypto-promotion-rules-breached-221-times\">compliance has been abysmal</a> since their introduction. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Find out the 3 common issues we&#39;ve identified with <a href=\"https://twitter.com/hashtag/cryptoasset?src=hash&amp;ref_src=twsrc%5Etfw\">#cryptoasset</a> financial promotions.<br><br>Consumers should check the FCA Warning List before making any investment in <a href=\"https://twitter.com/hashtag/crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#crypto</a><a href=\"https://t.co/CKn4cFxb11\">https://t.co/CKn4cFxb11</a></p>&mdash; Financial Conduct Authority (@TheFCA) <a href=\"https://twitter.com/TheFCA/status/1717149090784436369?ref_src=twsrc%5Etfw\">October 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The new 32-page guidance does not create new obligations for crypto firms, but the authors noted that it reflected a new “secondary international competitiveness objective” in addition to addressing its expectations for firms’ domestic behavior.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/house-of-lords-crypto-bill-uk\">UK House of Lords passes bill to seize stolen crypto</a></em></strong></p><p>The guidance section of the text emphasized key segments of the rules and other pertinent legal documents. The second section gives detailed answers to questions submitted during the consultation phase. </p><p>The U.K. <a href=\"https://cointelegraph.com/news/uk-crypto-travel-rule-comes-into-effect\">implemented the Financial Action Task Force’s</a> Travel Rule on Sept. 1. Legislation regulating stablecoins <a href=\"https://cointelegraph.com/news/uk-plans-stablecoins-regulation\">is expected to be introduced</a> into Parliament next year. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/dont-stop-currency-transform-world-with-blockchain-dr-jane-thomason/\">You can transform the world with blockchain: Dr. Jane Thomason</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-02T16:54:09.000Z",
    "title": "Liquity Price Prediction 2023-2032: Is LQTY a Good Investment?",
    "url": "https://www.cryptopolitan.com/liquity-price-prediction/",
    "description": "Liquity Price Prediction 2023 &#8211; 2032 Looking to invest in the future of decentralized finance? Then, you won’t want to miss out on the excitement surrounding Liquity cryptocurrency and its potential for price growth. With its innovative approach to lending and borrowing, Liquity has quickly gained a loyal following among cryptocurrency enthusiasts and investors alike. ... <a title=\"Liquity Price Prediction 2023-2032: Is LQTY a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/liquity-price-prediction/\" aria-label=\"More on Liquity Price Prediction 2023-2032: Is LQTY a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-02T16:40:08.000Z",
    "title": "Russia’s next generation military technology",
    "url": "https://www.cryptopolitan.com/russias-next-generation-military-technology/",
    "description": "In a recent development, Russia has initiated efforts to incorporate artificial intelligence (AI) into its drones, enhancing their autonomy and combat capabilities. These advancements have been disclosed by Oleksandr Kovalenko, a military-political commentator from the &#8220;Information Resistance&#8221; group, during an interview with FREEDOM TV. The move marks a significant step in Russia&#8217;s pursuit of advanced ... <a title=\"Russia&#8217;s next generation military technology\" class=\"read-more\" href=\"https://www.cryptopolitan.com/russias-next-generation-military-technology/\" aria-label=\"More on Russia&#8217;s next generation military technology\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-02T17:05:50.000Z",
    "title": "Solana up 38% in a week, but it could soon crash",
    "url": "https://crypto.news/solana-up-38-in-a-week-but-it-could-soon-crash/",
    "description": "The price of Solana's token has surged over the past week, rising nearly 35% to hit a price of $42.41."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-02T17:00:42.000Z",
    "title": "Shiba Inu Whales Are Moving SHIB Again, Bearish Or Bullish?",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-whales-moving-shib/",
    "description": "Shiba Inu whales have been seen moving a large amount of SHIB on-chain once again. These movements come at a time when the price of the meme coin is on the rise, raising concerns about whether these large holders have decided to start selling their large stacks of coins. Shiba Inu Whales Start Moving Coins Over the last few days, whale tracker Whale Alert has reported two large Shiba Inu transactions carrying a massive amount of coins. The first was reported on October 31 where a single transaction was spotted carrying over 4.47 trillion SHIB worth $35.35 million at the time. Related Reading: XRP Price Prediction: Crypto Analyst Says Price Will Jump To $0.9 The next transaction came a day later on Wednesday, November 1, where another transaction carrying a large amount of SHIB was recorded. This transaction was similar to the first in that it was carrying 4.46 Trillin tokens. The dollar figure was however a little lower at $33.9 million at the time of the transaction. These two transactions were some of the largest transactions so far for the coin in the last few months, and naturally, drew the concern of investors due to their destination. The origin and destination of these transactions can often tell if they’re eventually bullish or bearish for the SHIB price. More Bullish Than Bearish For SHIB Looking at the origin and destination of each transaction shows a higher tendency for it to be bullish than bearish for the coin. The first transaction was actually moved from an unknown wallet to another unknown wallet. This could suggest that the owner is moving the coins to other wallets for safekeeping. However, there is also the possibility that this was an over-the-counter (OTC) sale. Even so, such sales are carried out in a bid to not affect the market price of a coin by not dumping the coins on the open market, which minimizes the impact. The second transaction is even more bullish given that it is a withdrawal from a centralized exchange. As Whale Alert shows, the transaction was actually the movement of coins from the Bitvavo crypto exchange to a private wallet, which suggests accumulation. Related Reading: Galaxy Digital and Invesco Bitcoin Spot ETF Join BlackRock On The DTCC Given that both of these transactions are not showing any indications of selling, it is likely that these whales are still keeping the faith and holding on to their coins. In such a case, it is more bullish than bearish for Shiba Inu. Shiba Inu is still trading at a fairly high price of $0.0000079 after jumping 3.93% in the last 24 hours. However, it is performing much worse on the weekly chart with 1.53% losses. SHIB price begins recovery &#124; Source: SHIBUSD on Tradingview.com Featured image from Shutterstock, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-02T16:55:57.000Z",
    "title": "Do Kwon and Terraform Labs Seek Summary Judgement in SEC Lawsuit, Citing ‘Severe Deficiencies’ in the Case",
    "url": "https://dailyhodl.com/2023/11/02/do-kwon-and-terraform-labs-seek-summary-judgement-in-sec-lawsuit-citing-severe-deficiencies-in-the-case/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/do-labs-file-dismiss.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/do-labs-file-dismiss.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/do-labs-file-dismiss.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/do-labs-file-dismiss.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/do-labs-file-dismiss.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/do-labs-file-dismiss.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/do-labs-file-dismiss.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Terraform Labs and its co-founder Do Kwon are asking the Southern District of New York court to strike out parts of the complaint filed by the U.S. Securities and Exchange Commission (SEC). The SEC accuses the collapsed stablecoin issuer and its disgraced former CEO of offering and selling crypto assets that qualify as securities. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/02/do-kwon-and-terraform-labs-seek-summary-judgement-in-sec-lawsuit-citing-severe-deficiencies-in-the-case/\">Do Kwon and Terraform Labs Seek Summary Judgement in SEC Lawsuit, Citing ‘Severe Deficiencies’ in the Case</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]