[
  {
    "source": "Cointelegraph",
    "date": "2024-04-01T02:40:55.000Z",
    "title": " Don’t be too quick to ‘poo poo’ memecoins: Arthur Hayes ",
    "url": "https://cointelegraph.com/news/bitmex-arthur-hayes-memecoins-provide-value-blockchains",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvOTAwMjQwMzAtMDE0MC00ODczLTgwOTItNDllYjY1YTE4NjFhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>BitMEX co-founder Arthur Hayes believes the crypto industry should think twice before writing off all memecoins as “stupid and valueless.” </p>\n                    <p><p>BitMEX co-founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/arthur-hayes\">Arthur Hayes</a> says one should be careful before labeling all memecoins as “stupid,” arguing they can be a net positive for the blockchain networks they’re launched on.</p><p>In a March 30 interview with Real Vision CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2021/raoul-pal\">Raoul Pal</a>, Hayes argued that memecoins bring value to the crypto sector by way of drumming up attention and then accruing new users and engineers to blockchains. </p><p>“The chains that can support this culture are going to be the chains that have value,” Hayes said — adding that Solana and Ethereum stood as the most well-positioned networks to capture the flow of attention from memes. </p><p><a href=\"https://cointelegraph.com/news/bitmex-arthur-hayes-memecoins-provide-value-blockchains\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T03:06:40.000Z",
    "title": "South Korea Launches Defense AI Center to Spearhead Military Technological Advancement",
    "url": "https://www.cryptopolitan.com/south-korea-launches-defense-ai-center/",
    "description": "On Monday, South Korea celebrated a major turning point in the development of its defense technologies, strengthening its military might. The Defense AI Center, the country&#8217;s first research facility, was founded with the express purpose of negotiating the complex world of defense artificial intelligence (AI). With this launch, South Korea is demonstrating its resolve to [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-01T03:01:23.000Z",
    "title": "Bitcoin Price Consolidates Above $70K, Can Bulls Pump BTC To $75K?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-consolidates-70k-2/",
    "description": "Bitcoin price is consolidating above the $70,000 resistance zone. BTC might remain in a range for some time before the bulls attempt a move toward $75,000. Bitcoin price is struggling to gain pace above the $71,500 resistance zone. The price is trading above $70,500 and the 100 hourly Simple moving average. There is a short-term rising channel forming with support at $70,750 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could soon start a fresh rally if it clears the $71,500 resistance zone. Bitcoin Price Remains In Range Bitcoin price formed a base above the $69,000 resistance zone. BTC climbed higher the $70,000 resistance zone to move again into a positive zone. The price broke the $71,000 level but the bears were active below the $71,500 resistance. The recent high was formed near $71,306 and the price is now consolidating gains. It is trading near the 23.6% Fib retracement level of the upward move from the $69,128 swing low to the $71,306 high. Bitcoin is now trading above $70,500 and the 100 hourly Simple moving average. There is also a short-term rising channel forming with support at $70,750 on the hourly chart of the BTC/USD pair. Source: BTCUSD on TradingView.com Immediate resistance is near the $71,300 level. The first major resistance could be $71,500. If there is a clear move above the $71,500 resistance zone, the price could start a strong increase. In the stated case, the price could even clear the $72,500 resistance zone in the near term. The next major resistance is near the $73,500 zone. Another Drop In BTC? If Bitcoin fails to rise above the $71,200 resistance zone, it could start another decline. Immediate support on the downside is near the $70,750 level and the channel trend line. The first major support is $70,200 and the 50% Fib retracement level of the upward move from the $69,128 swing low to the $71,306 high. The next support sits at $70,000. If there is a close below $70,000, the price could start a drop toward the $69,120 level. Any more losses might send the price toward the $68,500 support zone in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $70,750, followed by $70,200. Major Resistance Levels – $71,200, $71,500, and $73,500."
  }
]