[
  {
    "source": "Decrypt",
    "date": "2023-12-27T15:49:35.000Z",
    "title": "Got a Solana Saga Before They Sold Out? Here Are All the Airdrops You Can Claim",
    "url": "https://decrypt.co/210634/solana-saga-airdrops-tokens-nfts-you-can-claim",
    "description": "UPDATED: Our list has been updated with even more airdrops, NFTs, and other perks for Solana Saga owners. Check out the latest."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-27T15:45:55.000Z",
    "title": "MicroStrategy controls almost 1% of the total Bitcoin supply",
    "url": "https://cryptoslate.com/insights/microstrategy-controls-almost-1-of-the-total-bitcoin-supply/",
    "description": "<p>Quick Take MicroStrategy&#8217;s recent Bitcoin purchase for $615 million marks a significant stride in the company&#8217;s Bitcoin accumulation. This recent acquisition, which outstrips its previous buy in November, valued at $593 million, ranks as MicroStrategy&#8217;s third-largest Bitcoin purchase to date. With this procurement, the company added an impressive 14,620 Bitcoin to its holdings. However, this [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/microstrategy-controls-almost-1-of-the-total-bitcoin-supply/\">MicroStrategy controls almost 1% of the total Bitcoin supply</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-27T16:07:27.000Z",
    "title": "Top 7 Crypto Picks for Savvy Investors in 2024",
    "url": "https://cryptodaily.co.uk/2023/12/top-7-crypto-picks-for-savvy-investors-in-2024",
    "description": "Explore 2024's Top 7 Crypto Picks for Savvy Investors. Uncover key insights and expert analyses to make informed decisions in the dynamic world of cryptocurrency. Stay ahead with top picks for potential growth and stability"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T15:50:26.000Z",
    "title": "Nordic Tech in 2023: Climate Tech Takes the Lead Amidst Funding Challenges",
    "url": "https://www.cryptopolitan.com/nordic-tech-climate-tech-takes-the-lead/",
    "description": "The Nordic technology sector in 2023 witnessed a shift in investment trends, diverging from the AI-led growth observed in other European countries. Despite the challenging environment for raising capital, climate technology emerged as the key driver sustaining the Nordic tech industry. This year, Nordic venture capitalists (VCs) markedly preferred climate tech, alongside a growing interest [&#8230;]"
  }
]