[
  {
    "source": "Cointelegraph",
    "date": "2023-12-23T01:53:41.000Z",
    "title": " OpenAI eyes potential funding round exceeding $100B: Report  ",
    "url": "https://cointelegraph.com/news/open-ai-investor-discussions-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvN2I3NzRlYzItYjdiYS00MDVlLTg1Y2UtNmU3NWQxZTlmOTJhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The news follows OpenAI's Sam Altman declaring to his 2.5 million followers that 2023 is the \"crazy year\" when AI started being taken seriously.</p>\n                    <p><p>The artificial intelligence (AI) developer OpenAI has reportedly entered discussions with investors who are considering investing more than $100 billion into the company, as per individuals with knowledge of the situation.</p><p>According to a recent <a href=\"https://www.bloomberg.com/news/articles/2023-12-22/openai-in-talks-to-raise-new-funding-at-100-billion-valuation\" target=\"_blank\" rel=\"noopener nofollow\">report</a> by Bloomberg, sources familiar with the matter claim that investors who may invest funds into the AI developer have participated in preliminary discussions, amid a surge of funding within the AI industry.</p><p>On December 11, Cointelegraph reported that French AI startup Mistral AI closed a funding round worth approximately $415 million, to continue its efforts in <a href=\"https://cointelegraph.com/news/french-startup-mistral-ai-closes-415m-funding-round\">developing generative AI tools</a>, chatbot development and customizable features.</p><p><a href=\"https://cointelegraph.com/news/open-ai-investor-discussions-report\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-23T02:00:30.000Z",
    "title": "Crypto Alarm: XRP’s Trade Volume Hits Six-Year Low, A Cause For Concern?",
    "url": "https://www.newsbtc.com/analysis/xrp/crypto-alarm-xrps-trade-volume-hits-six-year-low-a-cause-for-concern/",
    "description": "A significant dip in XRP daily trading volume has caught the attention of investors and analysts alike. On Thursday, XRP’s trading volume plummeted to levels not seen in the past six years, a development that has raised eyebrows among crypto enthusiasts. On this day, December 21st, #XRP : pic.twitter.com/ptHRTpkEeE — WrathofKahneman (@WKahneman) December 22, 2023 Just XRP Or Industry-Wide Slump In Trade Volumes? Reputed lawyer and XRP advocate, Bill Morgan, took to X (formerly Twitter) to shed light on this concerning trend highlighted by WrathKahneman. According to WrathKahneman, the trading volume of XRP on December 21 stood at approximately 1.9 billion, a stark contrast to the $2.4 billion witnessed in 2022 and drastically lower than $19.3 billion recorded in 2020. What is most interesting or concerning about those figures is the daily XRP volume is lower on this day for this year and not this day in any of the previous 6 years. https://t.co/oQpr7avC54 — bill morgan (@Belisarius2020) December 22, 2023 This decline has sparked a debate over the implications for the token&#8217;s market dynamics and investor sentiment. While the decline in XRP&#8217;s trade volume has become a focal point for discussions, it is important to note that this trend isn&#8217;t isolated to XRP alone. Related Reading: XRP And XLM In Lockstep? Expert Sheds Light On Their Surprising Price Synchronization Mr. Huber, a recognized figure in the crypto world, pointed out that leading cryptocurrencies such as Bitcoin and Ethereum are also experiencing similar plunge in trade volumes. This broader market trend suggests a possible shift in the trading activities across the crypto landscape. Media reports corroborates Mr. Huber’s assertion, indicating that Bitcoin’s trade volume as of August 28, 2023, had reached its lowest in four years. This pattern, reflected across multiple major cryptocurrencies, hints at a more complex market dynamic that extends beyond XRP. XRP&#8217;s Current Market Performance Despite the concerns over trading volume, XRP has exhibited resilience in its market price. Over the past 24 hours, the digital asset has seen a near 1% increase, with its trading price hovering around $0.61. Although it experienced a 4.6% decline over the past two weeks, XRP&#8217;s performance over the past month shows a 3.8% increase. Currently, its trading volume has continued to decline further standing at about $1.3 billion, maintaining a relatively steady state compared to last Friday&#8217;s $1.2 billion. Furthermore, Mr. Huber&#8217;s observation that the downturn in trading volume isn&#8217;t unique to XRP was echoed by another user, MoonLambo on X. This user, responding to Bill Morgan&#8217;s post highlighting what could be either interesting or concerning, supported Mr. Huber&#8217;s view by adding, &#8220;I disagree.&#8221; MoonLambo disclosed that there is nothing concerning and that the plunging trading volume is not unusual or worrying. They point out that considering the vast number of days (around 2,200) over the past six years, focusing on just six specific days&#8217; data is too narrow to draw meaningful conclusions. According to their analysis of the all-time XRP/USD price chart, they note a consistent pattern where both XRP&#8217;s price and trade volume increase as market activity heats up. This pattern has been observed consistently over a decade, not only for XRP but also for other major cryptocurrencies like BTC and ETH. Related Reading: XRP Price Could Be Soon The Next One To Rally – Here’s Why MoonLambo further assert that the current state of XRP’s volume is typical and expect a significant increase in trade volume when XRP experiences its next market rally. I disagree. This is not the least bit concerning. Nearly 2,200 days have passed in the last 6 years. Each day is a data point, and you&#8217;re only looking at 6 data points while ignoring the rest. You can&#8217;t draw a useful conclusion from such limited data here. Look at the chart… pic.twitter.com/lvEnRfKs8t — Moon Lambo (@MoonLamboio) December 22, 2023 Featured image from Unsplash, Chart from TradingView"
  }
]