[
  {
    "source": "Decrypt",
    "date": "2023-12-01T22:57:33.000Z",
    "title": "Sports And Web3 Collides During Sporting Crypto Social NYC Edition",
    "url": "https://decrypt.co/208063/sports-and-web3-collides-during-sporting-crypto-social-nyc-edition",
    "description": "The event by Sporting Crypto, supported by award-winning agency L+R, brought together the worlds of sports, gaming, tech, and web3."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-01T23:00:49.000Z",
    "title": "Jack Dorsey Backed Bitcoin Mining Pool Ocean Acknowledges Filtering Ordinal Inscriptions",
    "url": "https://news.bitcoin.com/jack-dorsey-backed-bitcoin-mining-pool-ocean-acknowledges-filtering-ordinal-inscriptions/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/aac7afbc-b6dd-4c7f-85e0-bf250f5008eb-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Jack Dorsey&#039;s Backed Ocean Bitcoin Mining Pool Acknowledges Filtering Ordinals Inscriptions\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/aac7afbc-b6dd-4c7f-85e0-bf250f5008eb-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/aac7afbc-b6dd-4c7f-85e0-bf250f5008eb-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/aac7afbc-b6dd-4c7f-85e0-bf250f5008eb-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/aac7afbc-b6dd-4c7f-85e0-bf250f5008eb-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/aac7afbc-b6dd-4c7f-85e0-bf250f5008eb-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/aac7afbc-b6dd-4c7f-85e0-bf250f5008eb-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/aac7afbc-b6dd-4c7f-85e0-bf250f5008eb.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Ocean, a Bitcoin mining pool that recently raised $6.2 million in a seed funding round led by former Twitter (now known as X) CEO Jack Dorsey, is currently filtering ordinal inscription transactions. Giacomo Zucco, a bitcoiner, confirmed that Ocean was using Knots as a node, a software developed by Luke Dashjr known to filter Ordinal [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-01T23:00:44.000Z",
    "title": "AVAX Uprising: Crypto Analyst Predicts Bullish Wave To Push Price To $30",
    "url": "https://www.newsbtc.com/analysis/avax/avax-crypto-price-to-30/",
    "description": "The Avalanche (AVAX) price has performed reasonably well this year, going from a low of around $9 to as high as $24 before correcting back downward. Since the correction, the altcoin has been trading in a tight range around $20 and $21. However, this might not continue for much longer following one crypto analyst’s prediction. An AVAX Bullish Wave Is Rising Crypto analyst Babenski has unveiled their bullish prediction for the AVAX price going forward. According to the analyst, the digital asset could be poised for an incredible run that could break multiple bearish resistances to bring its price to $30. Related Reading: 3 Bitcoin-Like Proof Of Work Altcoins That Could Make You A Millionaire In 2024 Babenski’s analysis hinges on the EMA100 (Exponential Moving Average) which they identify as providing dynamic support for the altcoin. This began during the October rally where prices started rising and AVAX did not lose the EMA100 despite multiple corrections. Source: TradingView.com Even on the 4-hour chart that the analyst presents, the altcoin’s price also touched down toward the EMA100. But once again, this dynamic support held as the price bounced off and continued on its merry way. This suggests a lot of support for the asset at this level. Additionally, the crypto analyst reveals that the AVAX price has also broken out of a bullish pennant. This is shown in the chart as the price resumed its uptrend above $21. This breakout “Looks bullish in short term,” according to the analyst, and could send the price to $30. However, the bullish trend is not the only one that is spinning for the AVAX price. While bulls remain firmly in control, there is still the possibility of the altcoin losing its dynamic support. If this happens and the price drops lower, then Babenski reveals that the next significant support is located just around the $17 price level. Token price reclaims $22 &#124; Source: AVAXUSD on Tradingview.com Avalanche Ordinals Take Center Stage The Avalanche network has also seen a surge in its network usage that could contribute to the price surge predicted for the AVAX price. Following the Polygon network, Ordinals have also made their way to the Avalanche network and their adoption caused a spike in transaction numbers Related Reading: Top 2 Under The Radar Altcoins That Could Do A 70000% Run Like Kaspa (KAS) Last week, Ordinals minting accounted for around 96% of the total transaction numbers, and as the fees on the network increased, so did the demand for AVAX. Additionally, Avalanche has debuted its new explorer after cutting ties with Etherscan. The network has now moved to a new multichain explorer for considerably cheaper than what they used to get with Etherscan. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Medium, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-01T23:01:20.000Z",
    "title": "International Soccer Star Cristiano Ronaldo Hit With $1,000,000,000 NFT Class-Action Lawsuit: Report",
    "url": "https://dailyhodl.com/2023/12/01/international-soccer-star-cristiano-ronaldo-hit-with-1000000000-nft-class-action-lawsuit-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/meta-expansion-nft.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/meta-expansion-nft.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/meta-expansion-nft.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/meta-expansion-nft.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/meta-expansion-nft.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/meta-expansion-nft.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/meta-expansion-nft.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>One of the biggest stars of the most popular sport in the world is being sued in a class action lawsuit over his involvement with Binance non-fungible tokens (NFTs). According to a new Associated Press report, Portuguese soccer star Cristiano Ronaldo (CR7) is on the receiving end of a $1 billion class-action lawsuit for promoting NFTs [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/01/international-soccer-star-cristiano-ronaldo-hit-with-1000000000-nft-class-action-lawsuit-report/\">International Soccer Star Cristiano Ronaldo Hit With $1,000,000,000 NFT Class-Action Lawsuit: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]