[
  {
    "source": "Cointelegraph",
    "date": "2024-03-28T01:08:00.000Z",
    "title": " BlackRock CEO ’very bullish’ on Bitcoin as its ETF crosses $17B ",
    "url": "https://cointelegraph.com/news/blackrock-bitcoin-etf-fastest-growing-etf-larry-fink",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYzI2M2JmNDctNThjYi00MjA5LWE2M2ItZjg4MDdkZGE3MDQxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>BlackRock’s CEO Larry Fink says he’s been “pleasantly surprised” at the level of retail demand for his firm’s spot Bitcoin ETF.</p>\n                    <p><p>BlackRock CEO Larry Fink has been “pleasantly surprised” by the performance of his firm’s spot Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> exchange-traded fund (ETF) and has reiterated he's “very bullish” on the long-term viability of Bitcoin. </p><p>“IBIT is the fastest growing ETF in the history of ETFs. Nothing has gained assets as fast as IBIT in the history of ETFs,” Larry Fink <a href=\"https://www.foxbusiness.com/video/6349827399112\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a March 27 interview with Fox Business.</p><p>Fink said the iShares Bitcoin Trust’s (IBIT) performance has even “surprised” him at how well it has performed over the first 11 trading weeks.</p><p><a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-fastest-growing-etf-larry-fink\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-28T01:05:06.000Z",
    "title": "Amazon Invests $4 Billion in Anthropic Focusing on Claude 3",
    "url": "https://www.cryptopolitan.com/amazon-completes-investment-in-anthropic/",
    "description": "Learn more about the recent Amazon investment of $4 billion in Anthropic and their strategic collaboration. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-28T01:00:09.000Z",
    "title": "$9.5 Billion In Bitcoin Options Poised To Expire This Friday: Market Turbulence Ahead?",
    "url": "https://www.newsbtc.com/bitcoin-news/9-5-billion-in-bitcoin-options-poised-to-expire/",
    "description": "This Friday, the spotlight is turned to Deribit, the leading crypto derivatives exchange, as it gears up for a notable event in its trading history. Particularly, the exchange is poised to witness the expiration of over $9.5 billion in Bitcoin options open interest. For context, Open interest refers to the total number of outstanding derivative contracts, such as futures or options, that have not been settled or closed. It represents the number of contracts market participants hold at the end of each trading day.  This surge in open interest recorded by Deribit reflects increased market participation and signals heightened liquidity, marking a notable milestone in the crypto derivatives landscape. Related Reading: Bitcoin’s ‘Next Leg Higher Has Started,’ Says Analyst: Reveals $100,000 Target On The Horizon Record-Breaking Open Interest Notably, this event is significant in two ways: It underscores the growing interest in Bitcoin as an asset class and highlights the increasing “sophistication” of the cryptocurrency market. This is because Open interest can also serve as a critical indicator of market health and trader sentiment.  As such, the record levels of open interest set to expire on Deribit suggest a “vibrant” trading environment, with more investors engaging in complex financial instruments like options. According to Deribit data, the exchange is set to host one of its largest option expiries ever, with $9.5 billion worth of Bitcoin options poised for expiry at the end of the month. This figure represents a substantial portion, approximately 40%, of the exchange&#8217;s total options open interest, which stands at $26.3 billion.  The magnitude of this expiry event eclipses previous months, with January and February end-of-month expiries totaling $3.74 billion and $3.72 billion, respectively. This trend indicates a large increase in market activity and investor engagement on the platform. Implications Of The Bitcoin Expiry The upcoming expiry has notable implications for the market, especially considering the current pricing dynamics of Bitcoin. With Bitcoin&#8217;s spot price hovering below $70,000, an estimated $3.9 billion of the open interest is expected to expire &#8220;in the money,&#8221; according to Deribit analysts, presenting profitable opportunities for holders of these options contracts.  The &#8220;max pain&#8221; price, which represents the strike price at which the highest number of options would expire worthless, thereby causing the maximum financial loss to option holders, is identified at $50,000. According to the analysts, this scenario suggests that a significant number of traders are positioned to benefit from the current market conditions, potentially leading to “increased buying activity” as these options are exercised. Additionally, Deribit analysts speculate that the high level of &#8220;in-the-money expiries&#8221; could exert upward pressure on Bitcoin&#8217;s price or amplify market volatility. They added that as traders &#8220;hedge their positions&#8221; or &#8220;speculate on future price movements,&#8221; the market may witness a flurry of activity, impacting Bitcoin&#8217;s price trajectory in the short term. Related Reading: Beyond Bitcoin ETFs: ‘There Are Other Players Controlling This Market’ – Says Analyst This comes at a time when Bitcoin has experienced a slight retracement from its recent all-time high above $73,000, with the price adjusting to approximately $68,946, at the time of writing Featured image from Unsplash, Chart from TradingView"
  }
]