[
  {
    "source": "Cointelegraph",
    "date": "2023-06-04T02:37:00.000Z",
    "title": "Elliptic integrates ChatGPT to bolster crypto risk detection ",
    "url": "https://cointelegraph.com/news/elliptic-chat-gpt-crypto-risk-detection",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/edf98d05-d7f6-498d-b3b9-a2f3cab3b089.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Crypto risk management firm Elliptic believes the integration of ChatGPT into its operations will give customers a view on risk \"they can't get anywhere else.\"</p>\n                    <p><p>Crypto risk management firm Elliptic is integrating artificial intelligence chatbot, ChatGPT, to ramp up accuracy and scalability in detecting crypto threats, amid other crypto firms reporting mixed results in its implementation.</p><p>Elliptic provides blockchain analytics for crypto asset compliance and assesses risks associated with crypto wallets, virtual asset service providers and crypto transactions.</p><p>According to a June 1 <a href=\"https://www.elliptic.co/media-center/elliptic-brings-chatgpt-to-crypto-to-power-deeper-faster-risk-detection?utm_campaign=Organic%20Social%20-%20General&amp;utm_content=251273804&amp;utm_medium=social&amp;utm_source=twitter&amp;hss_channel=tw-1344645140\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, Elliptic will be utilizing ChatGPT in its off-chain intelligence and research operations to explore new risk factors in an “entirely new way.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We’re very pleased to announce the integration of ChatGPT into our off-chain intelligence and research gathering efforts. <br>Read the full press release here<a href=\"https://t.co/YV5BYPCjW2\">https://t.co/YV5BYPCjW2</a><a href=\"https://twitter.com/hashtag/knowexactly?src=hash&amp;ref_src=twsrc%5Etfw\">#knowexactly</a> <a href=\"https://twitter.com/hashtag/ChatGPT?src=hash&amp;ref_src=twsrc%5Etfw\">#ChatGPT</a> <a href=\"https://twitter.com/hashtag/blockchain?src=hash&amp;ref_src=twsrc%5Etfw\">#blockchain</a></p>&mdash; Elliptic (@elliptic) <a href=\"https://twitter.com/elliptic/status/1664561717739659264?ref_src=twsrc%5Etfw\">June 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Accuracy and scalability are the primary reasons that Elliptic is integrating ChapGPT, stating that its researchers and investigators will be able to tackle these new risk factors “in higher volumes and at a quicker speed than ever before.”</p><p>Jackson Hull, the CTO of Elliptic, noted that its implementation will assist in exposing unseen risks:</p><blockquote>“Our customers come to us to know exactly their risk exposure. Integrating ChatGPT allows us to scale up our intelligence, giving our customers a view on risk they can’t get anywhere else.”</blockquote><p>Several crypto firms have implemented ChatGPT into its operations in recent times, yielding mixed results.</p><p>Cryptocurrency exchange Crypto.com launched a ChatGPT-based AI <a href=\"https://cointelegraph.com/news/crypto-com-chatgpt-based-ai-user-assistant-amy\">user assistant Amy</a> on May 3, in an effort to help inform users about the industry, including real-time token prices, projects, and historical events.</p><p>While a Crypto.com spokesperson told Cointelegraph that AI has the potential for “massive potential implications” in the crypto industry, they expect a lot of feedback from this AI pilot, which will be “integrated into future upgrades.”</p><p>However, cryptocurrency derivatives exchange Bitget has already found “cracks” after implementing ChatGPT.</p><p>Gracy Chen, managing director of crypto derivatives exchange Bitget, previously reported to Cointelegraph on June 1 that while Bitget <a href=\"https://cointelegraph.com/news/artificial-intelligence-crypto-your-own-risk?utm_source=dlvr.it&amp;utm_medium=twitter\">was initially impressed</a> by ChatGPT to handle routine customer inquiries, errors were spotted when given “more complex queries.”</p><p>“Despite being trained on extensive data, ChatGPT sometimes offers misleading, biased or incomplete information, as a recent internal test reminded us” Chen noted.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/openai-commits-1m-to-support-ai-driven-cybersecurity-initiatives\"><strong><em>OpenAI commits $1M to support AI-driven cybersecurity initiatives</em></strong></a></p><p>Meanwhile, Solana Labs announced on April 26 that Solana (<a href=\"https://cointelegraph.com/price-indexes\">SOL</a>) users will soon be able<a href=\"https://cointelegraph.com/news/solana-labs-chatgpt-plugin-allows-ai-to-fetch-blockchain-data\"> to interact with</a> the Solana network directly from ChatGPT – enabling them to check wallet balances, transfer tokens and purchase NFTs – through an open-source plugin created for ChatGPT.</p><p> Cointelegraph has reached out to Elliptic for comment.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/musks-alleged-price-manipulation-the-satoshi-ai-chatbot-and-more-hodlers-digest-may-28-june-3/\"><strong><em>Musk’s alleged price manipulation, the Satoshi AI chatbot and more: Hodler’s Digest, May 28 – June 3</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]