[
  {
    "source": "Cointelegraph",
    "date": "2023-09-04T08:22:18.000Z",
    "title": "99% of Nigerians are crypto aware - Consensys report",
    "url": "https://cointelegraph.com/news/99-of-nigerians-are-crypto-aware-consensys-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/18d09249-3f53-4635-8d7a-b4fe8c17018f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A survey featuring respondents from all seven continents of the world suggests that Nigeria has the most crypto-aware populace globally. </p>\n                    <p><p>A global survey featuring respondents from 15 countries indicates that Africa’s largest economy <a href=\"https://cointelegraph.com/tags/nigeria\">Nigeria </a>has the most cryptocurrency-aware populace in the world.</p><p>Consensys and YouGov <a href=\"https://consensys.io/blog/whats-the-most-crypto-savvy-country-in-the-world-hint-its-not-the-usa\" target=\"_blank\" rel=\"noopener nofollow\">released</a> the findings from the global Web3 perception survey, which sought to provide both macro and regional insights into the perception that different countries have towards cryptocurrencies and the wider Web3 ecosystem.</p><p>A key takeaway from the data obtained from the qualitative survey was that two <a href=\"https://cointelegraph.com/tags/africa\">African </a>nations rank highest for awareness of cryptocurrencies. This suggests that Nigerians (99%) and South Africans (98%) are more knowledgeable about Web3 than major economies like Great Britain, United States, Japan and Germany.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/051859cc-d6f7-44da-b7df-0a745817086d.png\"  /><figcaption style=\"text-align: center;\">Source: Consensys/YouGov Global Web3 Participation Survey.</figcaption></figure><p>The survey included some 15,158 individuals living in 15 different countries between 18 and 65. Nigeria had 99% of respondents who indicated that they were aware of cryptocurrencies while 70% said they understood the fundamental concepts of blockchain technology. </p><p>Nigeria’s knowledge of the cryptocurrency sector is mirrored by its investedness. Of the 1,001 respondents from Nigeria, 76% either owned or previously held cryptocurrencies. Bitcoin and Ethereum were the most commonly owned while Binance Coin (BNB) and Dogecoin ranked higher than the use of the world’s largest stablecoin Tether.</p><p><a href=\"https://cointelegraph.com/news/nigeria-to-tax-crypto-digital-assets-10-on-capital-gains-experts-react\"><strong><em>Related: Nigeria to tax crypto, digital assets 10% on capital gains — Experts react</em></strong></a></p><p>90% of the Nigerian respondents expressed interest in investing in cryptocurrencies in the next year, while 65% noted that cryptocurrency offered a means to hedge against hyperinflation monetary devaluation.</p><p>Considering that the Nigerian Central Bank cut off ties between cryptocurrency exchanges and firms and local banks in <a href=\"https://cointelegraph.com/news/more-harm-than-good-nigerian-crypto-users-in-disbelief-over-cbn-ban\">Feb. 2021</a>, 50% of respondents indicated that regulators should create laws that encourage participation while protecting investors. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/854c00ea-9239-4aee-8619-2b8cdcc5e21f.jpg\"  /><figcaption style=\"text-align: center;\">Source: Consensys/YouGov Global Web3 Participation Survey.</figcaption></figure><p>Consensys has <a href=\"https://consensys.io/insight-report/web3-and-crypto-global-survey-2023\" target=\"_blank\" rel=\"noopener nofollow\">published</a> data and insights relating to all 15 countries that were surveyed. 95% of United States respondents were aware of crypto, while 42% had heard of the sector but lacked a clear understanding. Only half of the American respondents indicated that they own or owned cryptocurrencies.</p><p><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\">How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</a></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-04T08:19:07.000Z",
    "title": "Solana co-founder backs Ethereum amid MakerDAO fork consideration",
    "url": "https://cryptoslate.com/solana-co-founder-backs-ethereum-amid-makerdao-fork-consideration/",
    "description": "<p>Solana&#8217;s (SOL) co-founder, Anatoly Yakovenko, has cautioned the blockchain community against harboring resentment towards Ethereum (ETH) following recent praise from MakerDAO&#8217;s (MKR) CEO, Rune Christensen. MakerDAO is considering Solana In a recent blog post, Christensen unveiled the MakerDAO Endgame plan&#8217;s final phase, revealing a comprehensive reimagining of the DeFi protocol on a novel forked version of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/solana-co-founder-backs-ethereum-amid-makerdao-fork-consideration/\">Solana co-founder backs Ethereum amid MakerDAO fork consideration</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-04T08:25:34.000Z",
    "title": "VC Firm Paradigm Urges Tailored Legislation for Stablecoins’ Unique Role in Payments",
    "url": "https://www.cryptoglobe.com/latest/2023/09/vc-firm-paradigm-urges-tailored-legislation-for-stablecoins-unique-role-in-payments/",
    "description": "San Francisco-based crypto investment firm Paradigm recently published a paper discussing the future of stablecoins in the payment system. Authored by Policy Manager Brendan Malone, the paper argues against applying traditional banking and securities frameworks to stablecoins, emphasizing their unique characteristics and use cases. The paper begins by acknowledging that while recent U.S. Congressional proposals […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-04T08:18:23.000Z",
    "title": "Pepe Coin September Challenge: Can It Reach $0.000001 Again?",
    "url": "https://www.newsbtc.com/news/pepe-coin-september-challenge-can-it-reach-0-000001-again/",
    "description": "Pepe Coin, the meme-inspired cryptocurrency, has faced a recent setback as it failed to sustain support at $0.00000078, casting doubts on its short-term rally prospects. The sellers&#8217; inability to follow through on their downward pressure hints at some wavering in their conviction. The crucial question now is whether the uncertainty will pave the way for buyers to reclaim higher ground this month. As of the latest data from CoinGecko, PEPE currently trades at $0.000000807186, reflecting a 2.8% increase in the past 24 hours. However, over the past seven days, the coin has experienced a 7.6% decline in value. Price analysts suggest that if the daily candle manages to close above the critical level of 0.00000078, the recent breakdown could be deemed a &#8220;bear trap,&#8221; that might offer a glimmer of hope for PEPE enthusiasts. A bear trap is a situation in trading where the price of an asset appears to be entering a bearish (downward) trend but then reverses and moves upwards instead. It &#8220;traps&#8221; or tricks traders who were expecting further price declines into selling their positions, only to see the price rise. Related Reading: Shiba Inu Price Faces Potential Loss As Bearish Pattern Emerges Challenges Ahead For PEPE While the bullish momentum appears promising, PEPE&#8217;s recovery remains constrained within a falling channel pattern that has persisted for the past two months. To gain more confidence in the revival, buyers must breach the upper trendline of this channel. Such a breakout has the potential to catapult the meme coin past the coveted $0.000001 threshold. Total crypto market cap at $1.02 trillion on the daily chart: TradingView.com In a separate report, worrying statistics emerge regarding the health of the PEPE network. Santiment&#8217;s latest data reveals an 83% drop in active addresses associated with Pepe (PEPE) over the past quarter. Additionally, both transaction volume and transaction count have experienced a significant downturn. Despite the recent price rally and bullish sentiment, PEPE faces challenges ahead, primarily due to the persistent downward trend within the falling channel pattern. The failure to break free from this pattern could see the meme coin continue its downward trajectory. PEPE seven-day price action. Source: Coingecko User Exodus Spells Trouble For Pepe Coin Date from Santiment cited in the report paints a bleak picture for PEPE as the network grapples with a sharp decline in active users. This alarming 83% decrease in active addresses highlights the waning interest in the cryptocurrency, possibly undermining its long-term viability. Moreover, the decrease in transaction volume and transaction count further compounds the network&#8217;s woes. Related Reading: Polygon (MATIC) Drops Below Crucial Level – Will Sellers Exit? PEPE&#8217;s recent struggle to maintain support at $0.00000078 raises questions about its near-term prospects. While there is hope for a recovery, the coin remains trapped within a falling channel pattern. The critical breakout point lies ahead, and the crypto community watches eagerly to see if buyers can reclaim higher ground.  Simultaneously, the exodus of active users and declining transaction metrics pose additional challenges for the future of PEPE, emphasizing the need for a sustained and robust recovery strategy. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-04T08:13:36.000Z",
    "title": "A New Twist? China Declares Digital Assets Legal",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/a-new-twist-china-declares-digital-assets-legal/",
    "description": "<p>The Chinese government banned crypto in 2021. However, the Chinese population has been finding ways to keep involved in crypto. Now a Chinese court declared digital assets a legal property protected by law. So, what&#8217;s going on in China with digital assets? A Local Chinese Court Declares Virtual Assets as Legal Properties Protected by Law This [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/a-new-twist-china-declares-digital-assets-legal/\">A New Twist? China Declares Digital Assets Legal</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-04T08:28:00.000Z",
    "title": "Cardano Continues to Post Record High On-chain Transaction Volumes",
    "url": "https://coinedition.com/cardano-continues-to-post-record-high-on-chain-transaction-volumes/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite.png 730w, https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/09/Cardano_is_still_seeing_rising_onchain_transaction_volume_despite-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Despite lower lows, Cardano’s on-chain transaction volumes have continued to surge to new higher levels. In a recent tweet, on-chain data analytics platform Santiment shared that Cardano (ADA) is experiencing significant on-chain transaction volumes. According to the tweet, the recent uptick in on-chain activity comes on the heels of ADA’s suppressed market price compared to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/cardano-continues-to-post-record-high-on-chain-transaction-volumes/\">Cardano Continues to Post Record High On-chain Transaction Volumes</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]