[
  {
    "source": "Decrypt",
    "date": "2023-11-14T21:42:02.000Z",
    "title": "GROK Meme Coin Craters, Holders Blame Crypto Sleuth Who Blew the Whistle",
    "url": "https://decrypt.co/206047/grok-meme-coin-craters-holders-blame-crypto-sleuth",
    "description": "Traders who bought a GROK meme coin trying to capitalize on Elon Musk's AI chatbot are angry a crypto sleuth flagged it as a likely scam."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-14T21:50:24.000Z",
    "title": "Court greenlights settlement talks between BlockFi and FTX",
    "url": "https://cryptoslate.com/court-greenlights-start-of-blockfi-ftx-settlement-discussions/",
    "description": "<p>On Nov. 14, U.S. Federal Judge Michael Kaplan gave a green light to cryptocurrency firms FTX and BlockFi to begin settlement discussions over a $1 billion dispute. The permission comes in the aftermath of BlockFi&#8217;s bankruptcy filing in November 2022, as it seeks to recover funds owed by FTX and its sister hedge fund, Alameda [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/court-greenlights-start-of-blockfi-ftx-settlement-discussions/\">Court greenlights settlement talks between BlockFi and FTX</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-14T21:45:02.000Z",
    "title": "Vitalik Says Plasma is ‘Underrated’ and Deserves Another Look",
    "url": "https://cryptobriefing.com/vitalik-plasma-underrated-deserves-another-look/?utm_source=feed&utm_medium=rss",
    "description": "Vitalik Buterin argues recent advances in ZK tech address past limitations &#038; make Plasma a viable layer 2 scaling solution."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-14T21:53:18.000Z",
    "title": "BlackRock spotlights stablecoin risks in Bitcoin ETF filing",
    "url": "https://crypto.news/blackrock-spotlights-stablecoin-risks-in-bitcoin-etf-filing/",
    "description": "In a recent filing for a spot Bitcoin ETF, BlackRock, the world's largest asset manager, has highlighted the indirect risks posed by stablecoins, emphasizing the nuanced complexities of the crypto market."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-14T21:50:44.000Z",
    "title": "Uniswap Labs launches Android mobile wallet",
    "url": "https://crypto.news/uniswap-labs-launches-android-mobile-wallet/",
    "description": "Uniswap Labs has released its new Android mobile wallet app, offering users direct swap capabilities and enhanced accessibility in the decentralized finance space."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-14T21:43:33.000Z",
    "title": "SFC releases updated AML/CFT checklist for virtual asset service providers",
    "url": "https://crypto.news/sfc-releases-updated-aml-cft-checklist-for-virtual-asset-service-providers/",
    "description": "The Securities and Futures Commission (SFC) has introduced an updated Anti-Money Laundering/Counter-Financing of Terrorism Self-Assessment Checklist, aimed at enhancing compliance in the evolving virtual asset sector."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-14T22:00:18.000Z",
    "title": "Bearish Divergence? Bitcoin Price Rises, But Network Growth Sends Warning Signals",
    "url": "https://www.newsbtc.com/bitcoin-news/bearish-divergence-bitcoin-price-rises-but-network-growth-sends-warning-signals/",
    "description": "The recent Bitcoin (BTC) price surge has ignited renewed interest and confidence among investors, leading many to believe that the BTC bull run is accelerating.  According to trader and crypto analyst Adrian Zduńczyk, Bitcoin has reached a new 52-week closing high and has maintained a close above the previous high of $32,000 for three consecutive weeks.  This sustained upward momentum indicates a strong bullish trend sentiment and signals the beginning of the third wave of the Bitcoin bull run. Analyst Highlights Key Trends Zduńczyk points out several dominant trends that contribute to the positive outlook for Bitcoin. The rising 200-week and 50-week moving averages (MAs) highlight the long-term uptrend strength, with key support levels at $28,800 and $26,600.  Additionally, there is a growing correlation with the S&#38;P 500, as evidenced by the 7-week correlation coefficient of 0.34. This alignment with traditional markets suggests that Bitcoin increasingly trades similarly to the Nasdaq. Fundamental drivers also play a significant role in Bitcoin&#8217;s upward trajectory. Traders eagerly anticipate the approval of spot Bitcoin exchange-traded funds (ETFs) and the upcoming fourth halving event.  Related Reading: AVAX Price Boost Could Be From This Department, But Its TVL Sings A Different Tune Furthermore, according to Zduńczyk, the historical pattern of previous halvings indicates that Bitcoin has rallied significantly after each halving and has never retraced to pre-halving prices.  Examining the daily trend, Zduńczyk highlights the technical strength demonstrated by Bitcoin&#8217;s reliable breakout above $32,000. Breakouts often lead to new trend formations that persist over time.  Despite occasional volatility, the 50-day average true range (ATR) trend and the 50-day relative strength index (RSI) momentum trend are rising, indicating ongoing positive momentum. Bitcoin&#8217;s future appears promising, supported by positive market trends, fundamental drivers, and technical indicators. However, warning signs cast doubt on Bitcoin&#8217;s favorable outlook, as renowned crypto analyst Ali Martinez pointed out.  Bitcoin Bullish Momentum At Risk? Martinez draws attention to the bearish divergence between Bitcoin&#8217;s price and network growth, indicating a potential lack of sustained momentum in the ongoing uptrend. The chart above shows a notable disparity between the exponential rise in Bitcoin&#8217;s price and the dramatic decline in new addresses over recent days.  This bearish divergence raises concerns about the overall strength of the current uptrend. While Bitcoin&#8217;s value has experienced significant gains, the number of new addresses created has decreased significantly. Related Reading: BlackRock’s XRP ETF Filing, Everything You Need To Know According to Martinez, this bearish divergence between Bitcoin&#8217;s price and network growth serves as an on-chain sell signal that traders should be aware of. The slowdown in network growth despite the price surge suggests that the current upward momentum may not have enough strength to sustain. At the time of writing, BTC is trading at $36,200, down 1.6% over the past 24 hours. However, it is still up a substantial 4.6% over the past 7 days.  It remains to be seen if a surge in new addresses will be able to support BTC&#8217;s bullish momentum and break the current consolidation phase. Alternatively, the cryptocurrency could retest support levels in the coming days. Featured image from Shutterstock, chart from TradingView.com"
  }
]