[
  {
    "source": "Cryptopolitan",
    "date": "2023-10-22T10:38:26.000Z",
    "title": "AI Drives Sustainable Change in Waste Coal Usage, Transforming it into Clean Energy",
    "url": "https://www.cryptopolitan.com/ai-sustainable-change-waste-coal-usage/",
    "description": "In a groundbreaking move towards sustainable energy solutions, researchers are leveraging artificial intelligence to revolutionize the treatment of coal waste. This shift not only addresses environmental hazards but also taps into the latent energy potential of waste coal, presenting a transformative solution for a longstanding issue. With 2,907 million tons of coal waste generated in ... <a title=\"AI Drives Sustainable Change in Waste Coal Usage, Transforming it into Clean Energy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-sustainable-change-waste-coal-usage/\" aria-label=\"More on AI Drives Sustainable Change in Waste Coal Usage, Transforming it into Clean Energy\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-22T10:32:15.000Z",
    "title": "CBI takes swift action against multi-million crypto fraud in India",
    "url": "https://www.cryptopolitan.com/cbi-action-multi-million-crypto-fraud-india/",
    "description": "In a major development in India&#8217;s cryptocurrency sector, the Central Bureau of Investigation (CBI) has cracked down on a substantial crypto fraud operation. The rising tide of digital asset scams has set alarm bells ringing, raising eyebrows among crypto enthusiasts and putting a question mark on the security measures in the ever-growing digital asset industry. ... <a title=\"CBI takes swift action against multi-million crypto fraud in India\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cbi-action-multi-million-crypto-fraud-india/\" aria-label=\"More on CBI takes swift action against multi-million crypto fraud in India\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-22T10:21:52.000Z",
    "title": "Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?",
    "url": "https://www.cryptopolitan.com/rollbit-price-prediction/",
    "description": "Rollbit coin price prediction 2023-2032 Rollbit has quickly become one of the most popular crypto casinos and trading platforms. Launched in 2019, Rollbit offers a wide range of gaming, sports betting, futures trading, and NFT options for users. With no KYC requirements and support for numerous cryptocurrencies, Rollbit provides an easy entry into the world ... <a title=\"Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rollbit-price-prediction/\" aria-label=\"More on Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-22T10:21:02.000Z",
    "title": "Blockstream Users Beware: Rising Tide of Phishing Scams Strikes Again",
    "url": "https://www.cryptopolitan.com/blockstream-user-phishing-scam-strikes-again/",
    "description": "In the ever-evolving world of cryptocurrencies and blockchain technology, the potential for gains has drawn millions of enthusiasts worldwide. But where there&#8217;s money, there&#8217;s also deceit. Recently, users of Blockstream, a leading Bitcoin infrastructure firm, fell victim to a sophisticated phishing scheme. This article delves into the details of this incident and highlights the urgent ... <a title=\"Blockstream Users Beware: Rising Tide of Phishing Scams Strikes Again\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockstream-user-phishing-scam-strikes-again/\" aria-label=\"More on Blockstream Users Beware: Rising Tide of Phishing Scams Strikes Again\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-22T10:38:40.000Z",
    "title": "Chainlink (LINK) Price Hits New Highs With 22% Surge In A Single Day",
    "url": "https://www.newsbtc.com/chainlink-news/chainlink-link-price-hits-new-highs-with-22-surge-in-a-single-day/",
    "description": "Following a week dominated by Bitcoin and its positive performance, Chainlink (LINK) has emerged as one of the best performers in the crypto market this weekend. This comes after a long period of relative silence and sideways movement for the token’s price. The abrupt and significant surge in Chainlink price may have surprised many investors, but it only further highlights the volatile nature of the crypto market. Chainlink Price Soars 22% In One Day &#8211; What&#8217;s Next? According to data from CoinGecko, the price of Chainlink is up by more than 22% in the last 24 hours. Over the past day, LINK’s double-digit price explosion has seen the altcoin surpass the $9 mark, resulting in a multi-month high. LINK’s performance appears to be even more notable on the weekly chart, with a nearly 30% increase in the last seven days.  Although Chainlink maintains a substantial percentage of its gain, the token’s price seems to be facing significant resistance at the $9.5 zone. This reflects the uncertain sentiment of investors who seem unsure whether the current rally is a fluke or a bullish hint. Nevertheless, a crypto analyst expects LINK to build on this positive momentum. Related Reading: Ethereum ICO Participant Wakes Up After 8 Years, Moves $3 Million In ETH In a post on X (formerly Twitter), crypto trader Mags noted that the Chainlink price has just broken out of a consolidation wedge spanning more than a year. The analyst postulates that a close above $8.2 on the weekly timeframe will see the LINK price rise to $12.54. This represents a significant 30% projection from the current price point. As of this writing, the Chainlink token is valued at $9.36. According to CoinGecko data, LINK is enjoying a 468% surge in its trading volume over the past 24 hours. What Is Behind The Multi-Month High? A dive into the Chainlink network activity can help understand the driving force behind the latest resurgence in LINK’s price. Interestingly, a recent report from the on-chain analytics platform Santiment offers insight into the activity levels of the network. Santiment’s data report posted on X highlighted that Chainlink has been experiencing increased activity over the past few days. Specifically, the network witnessed significant growth &#8211; reaching three-month highs &#8211; in terms of whale transactions, active addresses, and trading volume this weekend. Chainlink network activity surges to three-month highs &#124; Source: Santiment on X Related Reading: XRP Price Set To Surge Amid Heightened Whale Accumulation As the highlighted chart shows, LINK saw more than 220 whale transactions above the $100,000 mark on Saturday, October 22, while nearly 5,000 unique addresses interacted with the altcoin on the same day. Furthermore, Chainlink recorded more than 800 million in LINK trading volume on Saturday. While these data points don’t exactly indicate whether buying transactions are the prevailing activity on Chainlink, the ensuing LINK price rally suggests a possible accumulation trend. Chainlink price on an upward trajectory on the daily timeframe &#124; Source: LINKUSDT chart on TradingView Featured image from Shutterstock, chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-22T10:36:00.000Z",
    "title": "BTC Could Reach $32K Before a Strong Dump, Says Analyst",
    "url": "https://coinedition.com/btc-could-reach-32k-before-a-strong-dump-says-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Bitcoin_Faces_First_Monthly_Drop_of_2023_as_Crypto_Revival_Cools.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BTC Strong Dump\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Bitcoin_Faces_First_Monthly_Drop_of_2023_as_Crypto_Revival_Cools.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Bitcoin_Faces_First_Monthly_Drop_of_2023_as_Crypto_Revival_Cools-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Bitcoin_Faces_First_Monthly_Drop_of_2023_as_Crypto_Revival_Cools-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Bitcoin_Faces_First_Monthly_Drop_of_2023_as_Crypto_Revival_Cools-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Bitcoin_Faces_First_Monthly_Drop_of_2023_as_Crypto_Revival_Cools-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Bitcoin_Faces_First_Monthly_Drop_of_2023_as_Crypto_Revival_Cools-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency trader and analyst Lemon predicted in an X (formerly Twitter) post yesterday that Bitcoin (BTC) may undergo a strong dump towards the end of the year. In the post, the analyst anticipated that the market leader may close the $32K gap for some exchange-traded fund (ETF) news. Shortly thereafter, he believes BTC will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/btc-could-reach-32k-before-a-strong-dump-says-analyst/\">BTC Could Reach $32K Before a Strong Dump, Says Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]