[
  {
    "source": "CoinDesk",
    "date": "2023-07-04T16:58:47.000Z",
    "title": "UK Lords Pass Bill to Help Seize and Freeze Crypto Used for Crime",
    "url": "https://www.coindesk.com/policy/2023/07/04/uk-lords-pass-bill-to-help-seize-and-freeze-crypto-used-for-crime/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The bill, introduced in September, now enters its final stages in Parliament."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-04T17:04:30.000Z",
    "title": "Researchers demonstrate ‘unconditionally secure’ quantum digital payments",
    "url": "https://cointelegraph.com/news/researchers-demonstrate-unconditionally-secure-quantum-digital-payments",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/72bfcfa7-1ada-40c1-96c8-cbb9fd8cb023.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The research represents a possible breakthrough in quantum communications and, potentially, the onset of the era of quantum fintech.</p>\n                    <p><p>The dream of a completely secure, unhackable, absolutely private digital payment system could soon be realized thanks to new research out of the University of Vienna. </p><p>In a paper <a href=\"https://www.nature.com/articles/s41467-023-39519-w#Abs1\" target=\"_blank\" rel=\"noopener nofollow\">published</a> on July 4 titled “Demonstration of quantum-digital payments,” a team of researchers at the Vienna Center for Quantum Science and Technology showed off what may be the first “unconditionally secure” digital transaction system based on quantum mechanics. </p><p>To accomplish this, the researchers encrypted a payment transaction using a pair of quantum entangled photons. Through this entanglement, wherein any change in state featured by one photon is reflected exactly in the other photon, even when separated by distance, the researchers were able to ensure that any attempts to modify the transaction are thwarted by the nature of quantum mechanics itself. </p><p>Per the researchers’ paper:</p><blockquote>“We show how quantum light can secure daily digital payments by generating inherently unforgeable quantum cryptograms.”</blockquote><p>One of the most useful features of quantum entanglement is the fact that we can’t know what state an entangled object is in until we measure it.</p><p>A simple way to understand quantum mechanics and measurements is to imagine flipping a coin and then catching it and covering it with your hand before you or anyone else can see what side it landed on. Until you remove your hand, it can be heads or tails with equal probability. Once measured, the uncertainty collapses and you have a measurement. </p><p>Scientists can exploit this by using entangled objects, such as photons, to ensure parity and send information that can’t be modified or intercepted. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/history-of-computing-from-abacus-to-quantum-computers\">History of computing: From Abacus to quantum computers</a></em></strong></p><p>Thus, the researchers generated entangled photons using a laser process and encoded them with transaction information. The photons were then sent through over 400 meters of fiber optic cables to successfully complete a digital payment transaction between parties in different buildings. </p><p>Were a bad actor to attempt an adversarial attack on such a transaction, the quantum state of the photons would collapse due to measurement and the system would generate a new pair of entangled photons with a novel, unforgeable cryptogram. </p><p>While it’s possible this could represent a breakthrough in quantum communications for digital payments, there is one small caveat: as of current, the researchers say it takes “tens of minutes” for a simple digital payment to complete using the method.</p><p>However, this limitation may only be temporary, as the researchers are adamant that this isn’t a hard stop due to the laws of physics but just a minor technological limitation — one that might be resolved through higher-intensity photons. </p><p>“Indeed, brighter sources of entangled photon pairs have already been demonstrated, which could decrease the quantum token transmission time to under a second,” wrote the authors. </p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-04T17:00:45.000Z",
    "title": "Alex The Doge (ALEX) Presale Reports 14 Million Tokens Sold",
    "url": "https://cryptodaily.co.uk/2023/07/alex-the-doge-alex-presale-reports-14-million-tokens-sold",
    "description": "<p>Frankfurt, Germany, July 4th, 2023, Chainwire</p><p>Alex The Doge (ALEX), a memecoin designed to transform the GameFi ecosystem, has reported strong demand for its presale. The presale, which is currently ongoing, gives the crypto community their first opportunity to purchase ALEX tokens. Following completion of the token sale, ALEX will launch on decentralized exchanges.</p><p>ALEX aims to combine the fun of memecoins with the utility of decentralized finance (DeFi) and play-to-earn gaming. The project has garnered significant attention from crypto enthusiasts, with more than 13.5 million ALEX tokens sold during the presale so far.</p><p>ALEX is built on Polygon, a blockchain network known for its scalability, speed, and security. By leveraging the capabilities of Polygon, ALEX is creating a digital gaming world called the Miracle Verse. This innovative ecosystem will empower users with play-to-earn gaming opportunities, social trading, and DeFi activities. With its gamified approach and extensive suite of products under development, ALEX aims to differentiate itself from other memecoins and gain a foothold in the market.</p><p>The project operates at the intersection of GameFi and SocialFi, the latter term describing the creation of strong communities that are united by shared interests and common goals. An extensive roadmap gives interested parties an idea of what to expect from the ALEX ecosystem as it takes shape, with the launch of the Miracle Verse sure to be an eagerly anticipated event.</p><p>Through combining the fun factor synonymous with memecoins and the utility built into decentralized finance applications, the team behind Alex The Doge believes it has found a winning formula. The completion of the ALEX presale will set the stage for everything that comes next, starting with the token&rsquo;s DEX debut as Alex The Doge goes live.</p><p>Join the Alex The Doge (ALEX) presale using the links below:</p><ul><li>Website: https://alexthedoge.live/</li><li>Telegram: https://t.me/alexthedoge</li><li>Twitter: https://twitter.com/AlexTheDoge_p2e</li></ul>ContactCommunity LeadZack AndersonAlex The Dogesupport@alexthedoge.live"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-04T16:44:59.000Z",
    "title": "LBank Labs Launches $10 Million MEME Special Fund, Aiming to Nurture High-Quality Early-Stage Innovation Projects",
    "url": "https://cryptodaily.co.uk/2023/07/lbank-labs-launches-10-million-meme-special-fund-aiming-to-nurture-high-quality-early-stage-innovation-projects",
    "description": "<p>Road Town, BVI, July 4th, 2023, Chainwire</p><p>LBank Labs, the venture capital arm of the global exchange LBank, has today announced the establishment of a $10 Million MEME Special Fund. The move is intended to encourage high-quality early-stage innovative MEME projects, foster industry growth, and give back to the wider community.</p><p>LBank Labs will seek innovative and quality-driven MEME projects globally, emphasizing LBank's influence and commitment to the worldwide MEME project landscape. The creation of this fund is expected to further stimulate industry innovation and growth.</p><p>Funding allocation will be based on the quality and influence of the projects, and the fund will be directly donated to eligible project teams. A leaderboard will be established to periodically announce the list of recipients, highlighting the accomplishments and contributions of the projects. It is anticipated that fund distribution will be completed within the next year, with the first list of donations to be released in early July.</p><p>The application process is straightforward and clear. Details on how to apply and further information will be published on the LBank Labs official website in early July. LBank Labs extends an invitation to all globally outstanding MEME innovative projects to apply for this fund and join hands in driving industry growth.</p><p>LBank Labs remains committed to promoting the development and innovation of the blockchain industry. LBank Labs believes that the establishment and operation of the MEME Special Fund will further stimulate MEME innovation on a global scale, bringing more vitality and development opportunities to the industry.</p><p>About LBank Labs</p><p>LBank Labs is the venture capital arm of the global exchange LBank, dedicated to fostering technological innovation and application development in the blockchain industry. Currently, LBank Labs manages $100 million in assets to support startups and Web3 funds. As of the second quarter of 2023, LBank Labs has invested in 12 Web3 funds and plans to continue expanding its investments in startups and funds to strengthen the cooperation and network effects among its investment portfolio. LBank Labs firmly believes that through the power of technology, a more open, transparent, and fair world can be built.</p><p>Start Trading Now:&nbsp;lbank.com</p><p>Community &amp; Social Media:&nbsp;l&nbsp;Telegram&nbsp;l&nbsp;&nbsp;Twitter&nbsp;l&nbsp;&nbsp;Facebook&nbsp;l&nbsp;&nbsp;LinkedIn&nbsp;l&nbsp;&nbsp;Instagram&nbsp;l&nbsp;&nbsp;YouTube</p><p></p>ContactLBank Exchangepress@lbank.info"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T17:00:21.000Z",
    "title": "Alex The Doge (ALEX) Presale Reports 14 Million Tokens Sold",
    "url": "https://www.cryptopolitan.com/alex-the-doge-alex-presale-reports-14-million-tokens-sold/",
    "description": "Frankfurt, Germany, July 4th, 2023, Chainwire Alex The Doge (ALEX), a memecoin designed to transform the GameFi ecosystem, has reported strong demand for its presale. The presale, which is currently ongoing, gives the crypto community their first opportunity to purchase ALEX tokens. Following completion of the token sale, ALEX will launch on decentralized exchanges. ALEX ... <a title=\"Alex The Doge (ALEX) Presale Reports 14 Million Tokens Sold\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alex-the-doge-alex-presale-reports-14-million-tokens-sold/\" aria-label=\"More on Alex The Doge (ALEX) Presale Reports 14 Million Tokens Sold\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T16:56:47.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T16:51:49.000Z",
    "title": "The Graph ($GRT) Surges 17% Amid Growing Demand for AI Coins, What’s with AI and Crypto?",
    "url": "https://www.cryptopolitan.com/the-graph-grt-surges-17-ai-and-ai-coins/",
    "description": "The cryptocurrency market has maintained its bullish sentiment, with Bitcoin demonstrating stability above the $31,000 mark recently. Notably, institutional interest in Bitcoin remains strong, as evidenced by major asset managers such as BlackRock filing spot Bitcoin ETF applications. As Bitcoin&#8217;s strength permeates the market, several altcoins, particularly those related to artificial intelligence (AI), or AI ... <a title=\"The Graph ($GRT) Surges 17% Amid Growing Demand for AI Coins, What&#8217;s with AI and Crypto?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-grt-surges-17-ai-and-ai-coins/\" aria-label=\"More on The Graph ($GRT) Surges 17% Amid Growing Demand for AI Coins, What&#8217;s with AI and Crypto?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T16:40:53.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-04T17:00:41.000Z",
    "title": "75% Of Bitcoin Supply Now In Profit, Will A Drop Happen Here?",
    "url": "https://www.newsbtc.com/bitcoin-news/75-of-bitcoin-supply-now-in-profit-will-drop-happen/",
    "description": "On-chain data shows 75% of the entire Bitcoin circulating supply is now in profit, something that could lead to a drop for the asset. Bitcoin Supply In Profit Has Registered An Uptick Recently As pointed out by an analyst in a CryptoQuant post, there may be a risk that the investors would participate in profit-taking here. The &#8220;supply in profit&#8221; is an indicator that, as its name already implies, measures the total amount of the circulating Bitcoin supply that&#8217;s currently holding an unrealized gain. The metric works by going through the on-chain history of each coin in circulation to see what price it was last moved/transferred at. If this previous price for any coin was less than the current spot price of the asset, then that particular coin is said to be holding a profit right now, and the indicator adds it up to its value. The &#8220;supply in loss&#8221; is the counterpart indicator of the supply in profit, and it naturally keeps track of the coins of the opposite type (that is, the coins with a higher acquisition price than the latest spot price). When the supply in profit goes up in value, it means that more investors are coming into profit. Generally, the more an investor gets in profit, the more likely they become to sell. So, a large amount of the supply carrying some gains can lead to a widespread selloff becoming more probable in the sector. Related Reading: Historical Litecoin Bearish Signal Goes Off, Correction Incoming? Now, here is a chart that shows the trend in the 7-day simple moving average (SMA) Bitcoin supply in profit over the history of the cryptocurrency: Looks like the 7-day SMA value of the metric has been going up in recent days &#124; Source: CryptoQuant As displayed in the above graph, the 7-day SMA Bitcoin supply in profit has observed a sharp surge recently. This spike in the metric has taken place as the rally in the cryptocurrency&#8217;s price towards the $31,000 level has occurred and has put a large number of investors into gains. At the current values of the indicator, coins equivalent to about 75% of the total circulating supply of the cryptocurrency are carrying some amount of unrealized profit. Naturally, this would mean that a lot of investors may be thinking about harvesting some of the gains that they have accumulated. If the holders do end up selling here, then the price of the asset could observe a drawdown, at least in the short term. Related Reading: Bitcoin Sharks &#38; Whales Show Strong Buying, Rally To Continue In July? From the chart, it&#8217;s visible that the current level of the indicator is around where the asset hit a local top back in April of this year, and it&#8217;s also the same value where the cryptocurrency faced resistance in early 2022. It now remains to be seen if the market can pull through this psychological barrier and allow the Bitcoin rally to continue further. BTC Price At the time of writing, Bitcoin is trading around $31,000, up 1% in the last week. BTC has observed some rise during the past day &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T17:00:51.000Z",
    "title": "PancakeSwap (CAKE) Price Prediction: Uwerx (WERX) Might Become A Blue-Chip Crypto",
    "url": "https://www.crypto-news-flash.com/pancakeswap-cake-price-prediction-uwerx-werx-might-become-a-blue-chip-crypto/?utm_source=rss&utm_medium=rss&utm_campaign=pancakeswap-cake-price-prediction-uwerx-werx-might-become-a-blue-chip-crypto",
    "description": "Following a prolonged period of significant losses, crypto investors now show renewed interest in reinvesting funds into digital tokens. Uwerx (WERX) stands out with its real-life utility and solid foundations. This is why analysts predict it could hit $2.5 by Q4 2023. In this article, we&#8217;ll compare PancakeSwap (CAKE) and Mask Network (MASK) and highlight [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T16:45:03.000Z",
    "title": "LBank Labs Launches $10 Million MEME Special Fund, Aiming to Nurture High-Quality Early-Stage Innovation Projects",
    "url": "https://www.crypto-news-flash.com/lbank-labs-launches-10-million-meme-special-fund-aiming-to-nurture-high-quality-early-stage-innovation-projects/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-labs-launches-10-million-meme-special-fund-aiming-to-nurture-high-quality-early-stage-innovation-projects",
    "description": "Road Town, BVI, July 4th, 2023, Chainwire LBank Labs, the venture capital arm of the global exchange LBank, has today announced the establishment of a $10 Million MEME Special Fund. The move is intended to encourage high-quality early-stage innovative MEME projects, foster industry growth, and give back to the wider community. LBank Labs will seek [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-04T16:55:25.000Z",
    "title": "Hacker With $42,000,000,000 in Wallet Exploits Interoperability Platform Poly Network",
    "url": "https://dailyhodl.com/2023/07/04/hacker-with-42000000000-in-wallet-exploits-interoperability-platform-poly-network/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/hacker-with-wallet-poly.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/hacker-with-wallet-poly.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/hacker-with-wallet-poly.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/hacker-with-wallet-poly.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/hacker-with-wallet-poly.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/hacker-with-wallet-poly.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/hacker-with-wallet-poly.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The decentralized finance (DeFi) cross-chain protocol Poly Network has suffered another major hack involving dozens of crypto assets. Poly Network acknowledged the exploit on Saturday and suspended its services, noting that 57 different crypto assets on 10 different blockchains had been impacted. Blockchain security firm Beosin notes that the hacker used forged proofs to launch [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/04/hacker-with-42000000000-in-wallet-exploits-interoperability-platform-poly-network/\">Hacker With $42,000,000,000 in Wallet Exploits Interoperability Platform Poly Network</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]