[
  {
    "source": "Decrypt",
    "date": "2023-08-18T22:02:48.000Z",
    "title": "Roblox Enables 'Illicit Gambling' for Kids, Lawsuit Alleges",
    "url": "https://decrypt.co/152990/roblox-enables-illicit-gambling-kids-lawsuit-alleges",
    "description": "Roblox is being blamed for third-party online casinos that use its currency, Robux, and facilitate underage gambling. Will the case stick?"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-18T21:50:00.000Z",
    "title": "Crypto Biz: Binance Connect goes dark, Prime Trust is bust and PayPal unveils Crypto Hub",
    "url": "https://cointelegraph.com/news/crypto-biz-binance-connect-goes-dark-prime-trust-is-bust-and-paypal-unveils-crypto-hub",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/836a51aa-e347-4386-b255-d6ba04bdd171.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This week's Crypto Biz explores Binance Connect shutdown, BitGo's funding round, PayPal Crypto Hub, and other news. </p>\n                    <p><p>It’s been another week of mixed developments in the crypto industry, with established players winding down operations while newcomers introduce new crypto features and services. </p><p>Binance’s buy-and-sell crypto arm was shut down on Aug.16, with the crypto exchange remaining under widespread regulatory scrutiny, affecting key partnerships for its operations worldwide. Crypto custodian Prime Trust filed for bankruptcy protection following months of uncertainty regarding the state of its finances.</p><p>Meanwhile, in better news, BitGo raised millions of dollars in a fundraising round backed by a new group of investors. Some fresh capital also flocked to ZetaChain, with the chain-agnostic protocol <a href=\"https://cointelegraph.com/news/zetachain-raises-27million-to-enable-chain-agnostic-interoperability\">securing $27 million</a> in an equity round backed by over ten investors. </p><p>Lastly, PayPal made another bold move in the space, announcing a hub for selected crypto users despite the still uncertain environment within the United States. On Aug. 16, the company <a href=\"https://cointelegraph.com/news/ledger-announces-u-s-paypal-integration-lets-users-buy-crypto-from-within-app\">announced a partnership</a> with crypto hardware wallet manufacturer Ledger, allowing U.S. residents to buy Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Ether <a href=\"https://cointelegraph.com/ethereum-price\">(ETH)</a>, Bitcoin Cash (<a href=\"https://cointelegraph.com/bitcoin-cash-price-index\">BCH</a>) and Litecoin <a href=\"https://cointelegraph.com/ltc-price-index\">(LTC)</a> with fewer steps.</p><p>Read more about these stories and get a glimpse into the constantly evolving crypto industry on this week’s Crypto Biz. </p><h2>Binance Connect winds down operations</h2><p>Binance Connect, the regulated buy-and-sell crypto arm of Binance exchange, <a href=\"https://cointelegraph.com/news/binance-connect-shutting-down-august-16\">was shut down on Aug. 16</a> after losing its card payments services provider. The platform launched in March 2022 as Bifinity to act as a fiat-to-crypto payments provider connecting crypto firms with the traditional finance system. At its launch, the platform supported 50 cryptocurrencies and fiat payment methods, including Visa and Mastercard. In the past months, Binance and its subsidiaries worldwide have fought to keep crypto on-ramps and off-ramps open amid growing regulatory scrutiny. The exchange is currently engaged in litigation with both the U.S. Securities and Exchange Commission and Commodity Futures Trading Commission on allegations of operating an unlicensed exchange in the United States.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Dear Biswappers,<br><br>The Biswap team keeps abreast of the latest DeFi news and aims to inform you right away.<br><br>After a thorough consideration, <a href=\"https://twitter.com/binance?ref_src=twsrc%5Etfw\">@binance</a> has made a difficult decision to disable <a href=\"https://twitter.com/Binance_Connect?ref_src=twsrc%5Etfw\">@Binance_Connect</a> on 15 August due to its provider closing the supporting card payments… <a href=\"https://t.co/HcooyLn4sg\">pic.twitter.com/HcooyLn4sg</a></p>&mdash; Biswap (@Biswap_Dex) <a href=\"https://twitter.com/Biswap_Dex/status/1691358029914996736?ref_src=twsrc%5Etfw\">August 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Crypto custodian Prime Trust files for Chapter 11 bankruptcy</h2><p>Crypto custodian Prime Trust <a href=\"https://cointelegraph.com/news/prime-trust-files-for-bankruptcy-delaware\">has filed for Chapter 11 bankruptcy</a> protection in Delaware after facing a shortfall in customer funds. According to its filing, the company has between 25,000 to 50,000 creditors and estimated liabilities between $100 million to $500 million compared to $50 million to $100 million worth of assets. Prime Core Technologies, Prime Trust, Prime IRA and Prime Digital were listed as the entities filing for Chapter 11 relief. Prime Trust’s bankruptcy follows Nevada’s business regulator issuing the firm <a href=\"https://cointelegraph.com/news/prime-trust-financial-condition-deteriorated-nevada-regulator\">a cease and desist order</a> in June, saying its financial condition was “critically deficient” and could not honor customer withdrawals.</p><h2>BitGo raises $100 million after losing lawsuit against Galaxy</h2><p>Cryptocurrency custody platform BitGo <a href=\"https://cointelegraph.com/news/bitgo-raises-100-million-after-losing-lawsuit-against-galaxy\">has raised fresh capital</a> after facing a series of terminated deals involving firms such as Galaxy Digital. The crypto firm secured $100 million in a Series C financing round bringing its valuation to $1.75 billion. BitGo’s Series C funding reportedly featured entirely new investors based in the United States and Asia, with some backers coming from outside the cryptocurrency industry. According to BitGo, the newly raised funds will be deployed to make strategic acquisitions and expand its custody services, wallet and infrastructure solutions globally.</p><h2>PayPal to roll out Cryptocurrencies Hub for select users</h2><p>Payments giant PayPal <a href=\"https://cointelegraph.com/news/paypal-cryptocurrencies-hub-launch\">updated its terms and conditions to introduce</a> Cryptocurrencies Hub — a feature that allows users to hold and interact with Bitcoin and other cryptocurrencies in their PayPal account. According to the company, the Cryptocurrencies Hub service will allow for the sale and purchase of crypto. In addition, it will facilitate the payment for purchases via PayPal using the money stored after the sale of cryptocurrencies. The new hub was announced just a few days after the fintech giant unveiled its dollar-pegged stablecoin PayPal USD (PYUSD). According to PayPal, the Cryptocurrencies Hub will be crucial to convert between PYUSD and other crypto assets. The new feature will be available for selected users. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/dff6d12d-2dac-42cc-b494-986c3317fb74.png\"  /><figcaption style=\"text-align: center;\"><em>PayPal Cryptocurrencies Hub as explained in terms and conditions. Source: PayPal</em></figcaption></figure><h2>Before you go: Spot Bitcoin ETF approved, but not in the US</h2><p>In the latest episode of Cointelegraph’s <em>The Market Report</em>,<em> </em>analyst Marcel Pechman <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-approved\">discusses the first spot Bitcoin exchange-traded fund (ETF)</a> approved in the European Union, which went live on the Euronext Amsterdam exchange on Aug. 15, while the lack of regulatory clarity in the U.S. cryptocurrency market underscores the SEC’s reluctance to endorse a spot crypto ETF.</p><p><em>Crypto Biz is your weekly pulse of the business behind blockchain and crypto, delivered directly to your inbox every Thursday.</em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-18T22:01:04.000Z",
    "title": "Dogecoin (DOGE) Founder Billy Markus Reveals His Number One Rule for Crypto Plus His Favorite Tokens",
    "url": "https://dailyhodl.com/2023/08/18/dogecoin-doge-founder-billy-markus-reveals-his-number-one-rule-for-crypto-plus-his-favorite-tokens/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/Looks-Good-for-doge.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/Looks-Good-for-doge.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/Looks-Good-for-doge.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/Looks-Good-for-doge.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/Looks-Good-for-doge.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/Looks-Good-for-doge.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/Looks-Good-for-doge.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The founder of popular meme asset Dogecoin (DOGE) is revealing his number one rule when it comes to investing in digital assets, as well as his favorite tokens. In a new thread, DOGE co-creator Billy Markus, also known as Shibetoshi Nakamoto, says that traders should not put more money into crypto assets than they’d be [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/18/dogecoin-doge-founder-billy-markus-reveals-his-number-one-rule-for-crypto-plus-his-favorite-tokens/\">Dogecoin (DOGE) Founder Billy Markus Reveals His Number One Rule for Crypto Plus His Favorite Tokens</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]