[
  {
    "source": "Cointelegraph",
    "date": "2023-05-26T19:33:56.000Z",
    "title": "Neuralink gets FDA approval for ‘in-human’ trials of its brain-computer interface",
    "url": "https://cointelegraph.com/news/neuralink-gets-fda-approval-for-in-human-trials-of-its-brain-computer-interface",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/d9e64548-f434-4d50-8bd0-1e454da260ff.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Neuralink device is designed to be surgically implanted and, according to CEO Elon Musk, will eventually be marked to the general public.</p>\n                    <p><p>Elon Musk’s brain-computer interface startup, Neuralink, reportedly received approval from the United States Food and Drug Administration (FDA) to conduct some form of “in-human” trials for its surgically-implanted brain device. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Congratulations Neuralink team! <a href=\"https://t.co/AWZGf33UDr\">https://t.co/AWZGf33UDr</a></p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1661897511337082880?ref_src=twsrc%5Etfw\">May 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>It’s unclear at this time what kind of trials the Neuralink tweet is referring to — the only other information mentioned was that the company isn’t accepting applicants yet. </p><p>Neuralink was <a href=\"https://arstechnica.com/science/2023/03/musks-bid-to-start-neuralink-human-trials-denied-by-fda-in-2022-report-says/#:~:text=The%20Food%20and%20Drug%20Administration%20denied%20a%20human-trials,to%20address%2C%20according%20to%20a%20report%20by%20Reuters.\" target=\"_blank\" rel=\"noopener nofollow\">denied</a> the FDA’s approval for human trials in early 2022 over several concerns related to safety, which, at the time, the company was reportedly working to resolve. </p><p>The FDA’s apparent U-turn would indicate that such concerns have been worked out, and the company should then be free to conduct limited testing of its surgically-implanted brain-computer interface (BCI) device. </p><p>In describing the function of the BCI, Elon Musk has <a href=\"https://predictiontechnology.ucla.edu/elon-musk-pigs-and-brain-implants-neuralink-classified-as-a-breakthrough-device-by-the-fda/\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> it would help with certain medical and mobility issues. BCIs are developed for the treatment of numerous conditions, such as epilepsy. They also provide quality-of-life services for disabled persons, such as the ability to direct a mouse cursor via eye movement or thought. </p><p>Musk has also said the device would be developed for use by the general public as a general-purpose BCI, which allows humans to interface with machines via thought and protect us from being replaced by machines. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/laWVyG6Y0mw\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Until now, Neuralink has only been allowed to conduct testing on laboratory animals such as monkeys and pigs. The company recently <a href=\"https://www.theverge.com/2022/12/6/23496043/neuralink-animal-welfare-federal-probe-department-of-agriculture\" target=\"_blank\" rel=\"noopener nofollow\">faced</a> a federal probe over alleged animal mistreatment; however, Neuralink denied any wrongdoing, and the investigation appears to have ended quietly. A separate investigation over the <a href=\"https://arstechnica.com/science/2023/02/feds-probing-neuralink-for-allegedly-transporting-pathogens-on-brain-hardware/#:~:text=The%20US%20Department%20of%20Transportation%20is%20investigating%20allegations,monkeys%20infected%20with%20multiple%20types%20of%20dangerous%20pathogens.\" target=\"_blank\" rel=\"noopener nofollow\">alleged</a> transportation of contaminated devices remains ongoing. </p><p>With human testing on the table, Musk’s vision for human-AI hybrids comes one step closer. It therefore might be time for developers and entrepreneurs to start considering the applications and use cases of a recreational, surgically-implanted BCI. </p><p>Musk has also <a href=\"https://www.reuters.com/technology/what-does-elon-musks-brain-chip-company-neuralink-do-2022-12-05/#:~:text=The%20company%20hopes%20that%20a%20person%20would%20potentially,someone%20using%20thumbs%2C%22%20Musk%20said%20in%20April%202021.\" target=\"_blank\" rel=\"noopener nofollow\">proposed</a> that BCIs would allow people to operate smartphones faster with their minds than they could with their thumbs. Recent research from the University of Texas has demonstrated that AI systems similar to ChatGPT can already be trained to interpret brain waves to a limited degree. </p><p><strong><em>Related: </em><a href=\"https://cointelegraph.com/news/scientists-in-texas-developed-a-gpt-like-ai-system-that-reads-minds\"><em>Scientists in Texas developed a GPT-like AI system that reads minds</em></a></strong></p><p>But perhaps the most interesting potential use case for the cryptocurrency and blockchain communities comes from Microsoft. Several patents filed in 2018 and 2019 describe a system by which a wearable “sensor” could be engineered to provide “proof of work” for cryptocurrency rewards and blockchain mining and validation. </p><p>According to one of the patent <a href=\"https://patents.google.com/patent/WO2020060606A1/en\" target=\"_blank\" rel=\"noopener nofollow\">filings</a>:</p><blockquote>“For example, a brain wave or body heat emitted from the user when the user performs the task provided by an information or service provider, such as viewing advertisement or using certain internet services, can be used in the mining process.”</blockquote><p>With a BCI like the one Neuralink <a href=\"https://pubmed.ncbi.nlm.nih.gov/31642810/\" target=\"_blank\" rel=\"noopener nofollow\">describes</a> in its original research paper and a paradigm like the one described in the Microsoft patent, it should be possible to validate brain waves natively, thus making it possible to verify “proof of work” via thought alone. </p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-26T19:30:00.000Z",
    "title": "Why have Bitcoin and crypto lost 60% of their market cap since their all-time highs?",
    "url": "https://cointelegraph.com/news/why-have-bitcoin-and-crypto-lost-60-of-their-market-cap-since-their-all-time-highs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/a4f075f5-41bf-445f-8e3e-2a9d0ab3a991.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cointelegraph analyst and writer Marcel Pechman explains why the cryptocurrency market has lost 60% of its market cap, with the S&P 500 only about 15% from its all-time high.</p>\n                    <p><p><em>Macro Markets, hosted by crypto analyst Marcel Pechman, airs every Friday on the Cointelegraph Markets &amp; Research YouTube channel and explains complex concepts in layperson’s terms, focusing on the cause and effect of traditional financial events on day-to-day crypto activity.</em></p><p>The latest Macro Markets show begins by exploring why the crypto market capitalization is some 60% below its all-time high, while the S&amp;P 500 is less than 15% away from its peak. For Pechman, the sector is suffering from a huge problem, as it doesn’t fit a commodity nor does it fit a foreign exchange currency. Moreover, not every mutual fund can hold crypto.</p><p>The lesson? If Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) are mostly understood as alternative risk assets, that’s how they’ll trade. Consequently, one should not waste time looking for theories explaining why crypto has been unable to break new highs.</p><p>On to the next topic, according to Pechman, NVidia’s $2.3-billion short seller losses don’t provide the real picture. That’s because a short seller can endure pain if they don’t close the borrowing — so, as long as they have enough collateral deposits, those losses are still open. </p><p>That’s similar to what a buyer who paid a much higher price for their crypto is experiencing. Until this person makes the sale, the losses are not concrete. The difference is that the short seller needs to find someone willing to lend those shares to keep the trade open.</p><p>A Bloomberg article mentioned that Nvidia is the fourth-most shorted stock in the United States, behind Apple, Tesla and Microsoft. According to Pechman, the four most shorted stocks also happen to be top 10 S&amp;P 500 components, which leads to an issue: Those short sellers may have been market neutral the whole time, buying index futures and selling individual stocks.</p><p>Lastly, the show debates China’s 5% growth, disappointing investors, and its consequences for the markets. For Pechman, the most important news is China’s reluctance to issue new stimulus packages, which could be a strategy to further weaken the remaining global economies.</p><p>The Bloomberg article shows how China is a key player in global commodities. If commodity prices and the global trade balance continue to weaken, that means less tax revenue for those other governments. Pechman highlights that Germany has just entered a technical recession, and the U.S. is right behind.</p><p>Pechman believes the outcome for crypto is initially negative, as it drains liquidity from markets, and investors will further reach for short-term government bonds and cash. But if the U.S. dollar loses strength, that’s positive for crypto in the medium term.</p><p>If you are looking for exclusive and valuable content provided by leading crypto analysts and experts, make sure to subscribe to the <a href=\"https://www.youtube.com/@cointelegraphmarketresearch\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets &amp; Research YouTube channel</a>. Join us at Macro Markets every Friday.</p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T19:23:16.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T19:33:13.000Z",
    "title": "Shiba Inu’s Shibarium Set to Launch in July, According to Shytoshi Kusama – Will it Propel SHIB Price to $0.0001? Report ",
    "url": "https://www.crypto-news-flash.com/shiba-inus-shibarium-set-to-launch-in-july-according-to-shytoshi-kusama-will-it-propel-shib-price-to-0-0001-report/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-shibarium-set-to-launch-in-july-according-to-shytoshi-kusama-will-it-propel-shib-price-to-0-0001-report",
    "description": "<p>Lucie predicts July as the month for the Shibarium mainnet launch. This was after Shibarium1 had predicted an August launch.  The specific date for the official launch of Shibarium on the mainnet has been a topic of discussion as the community awaits another groundbreaking upgrade. Just this week, LUCIE, a Shiba Inu (SHIB) community influencer [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/shiba-inus-shibarium-set-to-launch-in-july-according-to-shytoshi-kusama-will-it-propel-shib-price-to-0-0001-report/\">Shiba Inu&#8217;s Shibarium Set to Launch in July, According to Shytoshi Kusama &#8211; Will it Propel SHIB Price to $0.0001? Report </a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T19:32:08.000Z",
    "title": "Polygon, Arbitrum, and Big Eyes Coin Putting Pressure on the Competition as They Prepare to Go to the Moon",
    "url": "https://www.crypto-news-flash.com/polygon-arbitrum-and-big-eyes-coin-putting-pressure-on-the-competition-as-they-prepare-to-go-to-the-moon/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-arbitrum-and-big-eyes-coin-putting-pressure-on-the-competition-as-they-prepare-to-go-to-the-moon",
    "description": "<p>As prices continue to rise in the crypto market many analysts are suggesting that we could be on our way to another period of altcoin dominance, and three currencies are showing a lot of promise to head up this rise. Polygon (MATIC), Arbitrum (ARB), and Big Eyes Coin (BIG) have been showing impressive growth recently, [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/polygon-arbitrum-and-big-eyes-coin-putting-pressure-on-the-competition-as-they-prepare-to-go-to-the-moon/\">Polygon, Arbitrum, and Big Eyes Coin Putting Pressure on the Competition as They Prepare to Go to the Moon</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T19:14:17.000Z",
    "title": "DogeMiyagi, Avalanche, and Dogecoin: Fostering Unity in the Crypto Community",
    "url": "https://www.crypto-news-flash.com/dogemiyagi-avalanche-and-dogecoin-fostering-unity-in-the-crypto-community/?utm_source=rss&utm_medium=rss&utm_campaign=dogemiyagi-avalanche-and-dogecoin-fostering-unity-in-the-crypto-community",
    "description": "<p>&#160; Community-building is critical for creating trust, promoting engagement, and driving adoption in the perpetually shifting cryptocurrency ecosystem. This comparative research looks at how DogeMiyagi ($MIYAGI), Avalanche (AVAX), and Dogecoin (DOGE) help to bring the crypto community together. By comparing these three entities, we may obtain insight into their distinct methods and comprehend their influence [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/dogemiyagi-avalanche-and-dogecoin-fostering-unity-in-the-crypto-community/\">DogeMiyagi, Avalanche, and Dogecoin: Fostering Unity in the Crypto Community</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-26T19:11:26.000Z",
    "title": "Huobi Set To Launch Trading Service in Hong Kong",
    "url": "https://dailyhodl.com/2023/05/26/huobi-set-to-launch-trading-service-in-hong-kong/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/Huobi-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/Huobi-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/02/Huobi-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/02/Huobi-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/02/Huobi-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/02/Huobi-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>May 26, 2023 – Singapore, Singapore Huobi announced the launch of Huobi HK and stated that they will provide cryptocurrency trading services to users in Hong Kong. Huobi HK will play a significant role in driving Hong Kong toward becoming the global hub for Web 3.0. In the future, users will be able to buy, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/26/huobi-set-to-launch-trading-service-in-hong-kong/\">Huobi Set To Launch Trading Service in Hong Kong</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]