[
  {
    "source": "Decrypt",
    "date": "2023-07-08T14:01:07.000Z",
    "title": "‘AI Is My Muse’: Jenni Pasanen's Journey as a Digital Artist",
    "url": "https://decrypt.co/147748/ai-is-muse-jenni-pasanen-journey-digital-artist",
    "description": "Jenni Pasanen, a rising star in the digital art scene, turns to AI as a tool to augment her dreamy creations."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-08T14:05:10.000Z",
    "title": "Britanniacoin's Official Pre-release: introducing a unique vision for the future",
    "url": "https://cryptodaily.co.uk/2023/07/britanniacoins-official-pre-release-introducing-a-unique-vision-for-the-future",
    "description": "<p>London, United Kingdom, July 8th, 2023, Chainwire</p><p>Aptius Ltd, a British financial enterprise, has developed a new cryptocurrency called BritanniaCoin which will be available for pre-sale from June 18th onwards, ahead of its launch later this year. BritanniaCoin is a British-built blockchain that introduces real-world applications while honouring British cultural heritage.</p><p>The pre-release contains 316,000 coins for sale, fixed at 6 USD per coin, in honour of the official unification of England and Scotland in 1707, 316 years ago. The pre-release presents an opportunity to purchase BritanniaCoin before its launch on exchanges at 8 USD per coin. BritanniaCoin is also launching a software wallet for the public, downloadable on the Apple App Store and Google Play. As part of BritanniaCoin's commitment to charitable causes, 10% of the proceeds from the pre-sale will be donated to charity, as listed on the BritanniaCoin website.</p><p>During its pre-sale this summer, BritanniaCoin intends to give away 125,000 coins. BritanniaCoin is 100% self-funded and developed with no silent partners, as detailed in the white paper. These initiatives aim to foster an ecosystem that represents British values, integrates historic cultural legacy with technological innovation, and supports charitable organizations such as Hearts of Gold to improve the lives of vulnerable people.</p><p>BritanniaCoin introduces a proprietary blockchain with zero fees and a 20% faster block confirmation time than Bitcoin.</p><p>After the 1st round pre-release for commercial customers started in September 2022, BritanniaCoin launched its own bespoke hardware infrastructure. This hardware wallet platform&nbsp;intends to facilitate customer&nbsp;security, anonymity, and technological innovation. This exclusive hardware wallet is currently available to private investors and commercial clients who get in touch via their website. Moreover, the prospect of providing customers of the planned NFT project with access to hardware wallets in the future is something that is currently being considered. Following the completion of its 2nd stage ICO, BritanniaCoin intends to center its blockchain ecosystem, brand identity, and community on this hardware technology basis.</p><p>BritanniaCoin pursues multiple long-term goals, including expanding its community and improving the user experience. In addition, BritanniaCoin has its own British-themed NFT&nbsp;project that provides holders unique advantages, offering access to airdrops, special discounts, voting rights, an active role in selecting which charity institutions to support and signature events, such as their recent pre-release party held at the East India Club.</p><p class=\"ql-align-justify\"></p><p>In the aftermath of the ICO,&nbsp;BritanniaCoin intends to launch BritanniaPay, consisting of their software wallet compatible with iOS and Android and connected with the company's current hardware wallet network. BritanniaPay is an innovative new initiative that prioritizes British brands and businesses by integrating blockchain technology into its own payment system. Users can pay for their purchases at various UK and international retailers with BritanniaCoin alongside Bitcoin, Ethereum and other established cryptocurrencies.</p><p>BritanniaCoin unites a diverse team, as the Co-founder and CEO Daniel M. Ashworth brings over five years of experience in the cryptocurrency sector and co-founded Aptius in 2018, a Crypto and Forex trading company. Co-founder and CTO Jonathan Peters has 10 years of programming experience, including blockchain architecture, network infrastructures, and algorithmic trading software. COO Demetri Georgiev has over 10 years of experience in logistics operations and supports the project's day-to-day operations. Events Manager Mark Turley has acquired over 18 years of experience arranging entertainment events and manages the project's unique range of events in magnificent venues, such as the East India club. Charities Co-ordinator Mary Johnston has over 30 years of experience in sales and marketing and is actively involved in Hearts of Gold, the nominated charitable foundation supported by BritanninaCoin.</p><p>For more details about BritanniaCoin, access the project&rsquo;s website.</p><p>About BritanniaCoin</p><p class=\"ql-align-justify\">BritanniaCoin is a cryptocurrency that deploys real-world utilities developed by Aptius Ltd, a British financial organization. Available for pre-sale from June 18th, BritanniaCoin intends to celebrate British cultural heritage.</p>ContactDaniel M. AshworthBritanniacoin Ltdinfo@britanniacoin.org"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-08T13:50:00.000Z",
    "title": "Gemini Sues DCG After Dispute Over Earn Program",
    "url": "https://cryptodaily.co.uk/2023/07/gemini-sues-dcg-after-dispute-over-earn-program",
    "description": "<p>Cryptocurrency exchange Gemini is suing DCG, the parent company of bankrupt crypto broker Genesis, after a dispute over the Gemini Earn Program.&nbsp;</p>\n<p>The exchange decided to sue Digital Currency Group (DCG) and its CEO after the company missed the deadline to agree to a restructuring deal put forward by the Winklevoss twins.</p>\nThe Restructuring Proposal&nbsp;\n<p>Winklevoss twins-founded Gemini exchange had set Thursday afternoon as the deadline for Digital Currency Group and Genesis to agree to a restructuring deal. Gemini stated that if the deal was not agreed to within the specified deadline, it would pursue litigation. Crypto lending firm Genesis had filed for bankruptcy in January following the collapse of key counterparties of the firm, such as FTX, causing it to freeze all redemptions.&nbsp;</p>\n<p>While Genesis&rsquo; lending unit had outlined a plan to exit bankruptcy, it has so far been unable to reach an agreement on a restructuring plan for creditors, to whom it owes over $3 billion. The largest creditor, Winklevoss twins-founded Gemini, is looking to recover around $1.1 billion. In a letter to DCG CEO Barry Silbert, Cameron Winklevoss shared what he called his &ldquo;best and final offer&rdquo; and stated that the deadline for DCG to agree to the proposal was 4 p.m. EDT (2000 GMT) on July 6, adding that he wanted a simple yes or no answer and no further delays or extensions.</p>\n<p>The restructuring proposal put forward by Winklevoss included a forbearance payment of $275 million, a debt tranche of $355 million due in two years, and another debt tranche of $835 million due in five years. DCG would also be able to retain the proceeds from the sale of Genesis&rsquo; lending unit.&nbsp;</p>\nDCG Misses Deadline, Gemini Sues&nbsp;\n<p>However, DCG missed the deadline set by Gemini to agree to the restructuring deal, leading to the latter suing DCG. According to the lawsuit, DCG and its CEO, Barry Silbert, misrepresented the accounting treatment of liabilities that the company had assumed from Genesis. These liabilities stemmed from losses that Genesis suffered after the Singapore-based crypto hedge fund Three Arrows Capital (3AC) collapsed. In a long thread on Twitter, Cameron Winklevoss stated that the exchange had filed a lawsuit against DCG and Silbert for personally masterminding a fraud scheme against creditors.&nbsp;</p>\n\n<p>&ldquo;Today, @Gemini filed a lawsuit against @DCGco and @BarrySilbert personally in New York court. Barry was not only the architect and mastermind of the DCG and Genesis fraud against creditors; he was directly and personally involved in perpetrating it.&rdquo;</p>\n\n<p>Winklevoss alleged that after Gemini discontinued the Earn program, Silbert reached out to the firm, urging them to continue the program even after knowing that Genesis was &ldquo;massively insolvent.&rdquo;&nbsp;</p>\n\n<p>&ldquo;When Gemini notified Genesis it would be terminating the Earn program in October 2022, Barry reached out to set up a meeting to induce Gemini to continue Earn. He did this knowing Genesis was massively insolvent. Barry claimed that Genesis faced only a timing issue &ndash; a lie that hid the gaping hole on Genesis&rsquo;s balance sheet.&rdquo;</p>\n\n<p>Winklevoss further alleged that even after the collapse of Three Arrows Capital, Silbert, and other Genesis executives claimed everything was fine because DCG was stepping in to absorb the losses.&nbsp;</p>\n\n<p>&ldquo;When Three Arrows Capital (3AC) collapsed in June 2022, it blew a $1.2 billion hole in Genesis&rsquo;s balance sheet. Instead of coming clean, Genesis claimed that everything was business as usual because DCG had stepped in to absorb the losses. It&rsquo;s now clear this was a carefully crafted lie.&rdquo;</p>\n\n<p>The Gemini co-founder went on to allege that DCG, Silbert, and other Genesis executives conspired to create false financial reports to mislead creditors.&nbsp;</p>\n\n<p>&ldquo;Barry, DCG, and Genesis all conspired to create false financial reports to hide the truth from Gemini and creditors. One report pretended that this phony 10-YEAR promissory note was a &lsquo;Current Asset.&rsquo; A total lie and complete misrepresentation. A falsified balance sheet pretended that the note was a &lsquo;receivable&rsquo; with a value of $1.1 billion. Another lie.&rdquo;</p>\n\n<p>However, in a statement, A DCG spokesperson reiterated that DCG expects to close the Genesis bankruptcy case soon enough.</p>\n\n<p>&ldquo;Any suggestion of wrongdoing by DCG or any of its employees is baseless, defamatory, and completely false. From day one, DCG has remained committed to reaching an amicable solution for all parties to the Genesis bankruptcy.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-08T14:01:50.000Z",
    "title": "Britanniacoin’s Official Pre-release: introducing a unique vision for the future",
    "url": "https://www.cryptopolitan.com/britanniacoins-official-pre-release-introducing-a-unique-vision-for-the-future/",
    "description": "London, United Kingdom, July 8th, 2023, Chainwire Aptius Ltd, a British financial enterprise, has developed a new cryptocurrency called BritanniaCoin which will be available for pre-sale from June 18th onwards, ahead of its launch later this year. BritanniaCoin is a British-built blockchain that introduces real-world applications while honouring British cultural heritage. The pre-release contains 316,000 ... <a title=\"Britanniacoin&#8217;s Official Pre-release: introducing a unique vision for the future\" class=\"read-more\" href=\"https://www.cryptopolitan.com/britanniacoins-official-pre-release-introducing-a-unique-vision-for-the-future/\" aria-label=\"More on Britanniacoin&#8217;s Official Pre-release: introducing a unique vision for the future\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-08T13:49:37.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-08T14:06:58.000Z",
    "title": "Britanniacoin’s Official Pre-release: introducing a unique vision for the future",
    "url": "https://www.crypto-news-flash.com/britanniacoins-official-pre-release-introducing-a-unique-vision-for-the-future/?utm_source=rss&utm_medium=rss&utm_campaign=britanniacoins-official-pre-release-introducing-a-unique-vision-for-the-future",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/main_2_1683669032Sm2XnMEnqv.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/main_2_1683669032Sm2XnMEnqv.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/main_2_1683669032Sm2XnMEnqv-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/main_2_1683669032Sm2XnMEnqv-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/main_2_1683669032Sm2XnMEnqv-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />London, United Kingdom, July 8th, 2023, Chainwire Aptius Ltd, a British financial enterprise, has developed a new cryptocurrency called BritanniaCoin which will be available for pre-sale from June 18th onwards, ahead of its launch later this year. BritanniaCoin is a British-built blockchain that introduces real-world applications while honouring British cultural heritage. The pre-release contains 316,000 [...]"
  }
]