[
  {
    "source": "Cointelegraph",
    "date": "2023-08-27T02:14:41.000Z",
    "title": "Tether CTO stays silent on Bitcoin mining locations ",
    "url": "https://cointelegraph.com/news/tether-cto-paolo-ardoino-bitcoin-mining-locations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/85207373-a1de-46a3-ad0c-6db2438b271c.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Tether’s chief technology officer, Paolo Ardoino dropped a hint that the operations are based in Latin America, but hesitated to reveal any more details beyond that. </p>\n                    <p><p>Paolo Ardoino, chief technology officer of stablecoin issuer Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>), recently found himself addressing rumors about edited images of large industrial containers online. These speculations led him to rejecting questions about where Tether is mining Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). </p><p>In a post on X (formerly known as Twitter) <a href=\"https://twitter.com/paoloardoino/status/1695354621537972471?s=20\" target=\"_blank\" rel=\"noopener nofollow\">published</a> on Aug. 26, Ardoino shed light on the curiosity sparked by the photo he shared on Aug. 24. The image displayed a container with a photoshopped Tether Energy logo, leaving many people pondering over what it's all about. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">One of <a href=\"https://twitter.com/hashtag/Tether?src=hash&amp;ref_src=twsrc%5Etfw\">#Tether</a> energy production and <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>  mining  sites coming along well. <a href=\"https://t.co/6Z8o6A5OaE\">pic.twitter.com/6Z8o6A5OaE</a></p>&mdash; Paolo Ardoino  (@paoloardoino) <a href=\"https://twitter.com/paoloardoino/status/1694652639579980142?ref_src=twsrc%5Etfw\">August 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>He clarified that the photo shows a control room at a Bitcoin <a href=\"https://cointelegraph.com/news/future-btc-mining-and-the-bitcoin-halving\">mining site</a> that Tether is currently completing and will soon <a href=\"https://cointelegraph.com/news/chinese-official-sentenced-life-prison-bitcoin-mining-corruption\">begin operations</a> at.</p><p>However, Ardoino firmly stated he will not disclose the location, responding to numerous users who have inquired about it. </p><p>While he did mention that the site is in Latin America, he added no further details due to security reasons</p><p>“Where? In LATAM. We tend to not share exact locations to avoid personnel harassment, a valid concern given the amount of detractors obsessed with Tether,” he declared, admitting that it has led to many Tether skeptics questioning its legitimacy:</p><blockquote>“You can almost hear some of them screaming: \"NOOOOOOOO if you don't tell us the address, zip code, surname of the cow that is eating the grass nearby, then it's not real!!!!!\"</blockquote><p>He addressed doubters who were curious about the photoshopped logo appearing on the containers, explaining that it was a deliberate media decision.</p><p>“We thought that the photo would have been shared on newspapers so the team wanted to brand it,” he noted, returning back to security reasons once more:</p><p>“Moreover, putting gigantic Tether logos would not be great from physical privacy of the site point of view.”</p><p>He anticipates operations to commence sometime in September.</p><p>“The site is progressing well, everyone in the team is super excited and working around the clock to start operations in the next few weeks,” he declared. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/mining-1-btc-lebanon-783x-cheaper-italy-coin-gecko\"><strong><em>Mining 1 BTC in Lebanon is 783x cheaper than Italy: CoinGecko report</em></strong></a></p><p>In an interview with Cointelegraph on Aug. 17, Ardoino explained Tether is working on a mining software called <em>Moria</em>, that provides more comprehensive data analytics on energy production at a Bitcoin mining site.</p><p> Ardoino highlighted the need for better <a href=\"https://cointelegraph.com/news/tether-cto-paolo-ardoino-says-bitcoin-mining-needs-better-analytical-tools\">analytics and performance review</a> in Bitcoin mining. He believes this will assist with evaluating the site’s performance and surrounding environment:</p><blockquote>“If energy used by the mining site is wind or solar, there are optimization parameters, like predicted speed of wind for a specific day or a specific hour of the day, that could be used to overclock some of the miners and boost the production.”</blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-miner-gets-life-in-prison-china-offers-bounties-for-crypto-firms-asia-express/\"><strong><em>Bitcoin miner gets life in prison, China offers bounties for crypto firms: Asia Express</em></strong></a></p></p>\n                \n            "
  }
]