[
  {
    "source": "CryptoSlate",
    "date": "2024-01-03T22:00:41.000Z",
    "title": "Jihan Wu stands by Matrixport’s contentious Bitcoin ETF analysis amid market shakeup",
    "url": "https://cryptoslate.com/jihan-wu-stands-by-matrixports-contentious-bitcoin-etf-analysis-amid-market-shakeup/",
    "description": "<p>Matrixport co-founder Jihan Wu took to social media to address industry concerns regarding the company&#8217;s recent report predicting the rejection of spot Bitcoin ETF applications by the SEC. In his statement, Wu emphasized the independence of Matrixport&#8217;s analysts, stating that they operate without any influence or interference from management. He added that the analysts are [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/jihan-wu-stands-by-matrixports-contentious-bitcoin-etf-analysis-amid-market-shakeup/\">Jihan Wu stands by Matrixport&#8217;s contentious Bitcoin ETF analysis amid market shakeup</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T21:54:00.000Z",
    "title": "Orbit Chain cyberattack tied to global hacking syndicate",
    "url": "https://www.cryptopolitan.com/orbit-chain-cyberattack-hacking-syndicate/",
    "description": "Blockchain analysts from Match Systems uncovered connections between the recent $81.5 million heist from Orbit Chain and other high-profile crypto cyberattacks in 2023. This revelation ties the Orbit Chain incident to attacks on platforms such as Coinspaid, Coinex, and Atomic Wallet, suggesting the involvement of an organized cybercrime group. The report from Match Systems points [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-03T22:00:53.000Z",
    "title": "Solana Users Face Mounting Threat As Drainer Attacks Surge, SOL Price Plummets 13%",
    "url": "https://www.newsbtc.com/news/solana/solana-users-face-mounting-threat-as-drainer-attacks-surge-sol-price-plummets-13/",
    "description": "As the price of Solana (SOL) has skyrocketed by an astounding 722% year-to-date, the network&#8217;s rapid growth has attracted both attention and challenges.  Not only has the native token gained significant value, but the use of Solana-based meme coins such as Bonk Inu (BONK), which has grown over 854% year-to-date, and decentralized applications (dApps) have skyrocketed. Unfortunately, this increased popularity has led to increased attacks against the so-called &#8220;Ethereum Killer.&#8221; Malicious Solana dApps Exploited Web3 security firm Blockaid has recently observed a concerning trend of users falling victim to attacks by Solana-based drainers.  One notable example is the website lessfeesndgas[.]org, which succeeded in stealing tokens from the Solana Program Library (SPL), which is designed to support the creation and management of tokens on Solana and SOL worth hundreds of thousands of dollars. Related Reading: Cardano In 2024: Dollar Dream Or Downward Spiral For ADA? Interestingly, according to the company&#8217;s post on X (formerly Twitter), Blockaid&#8217;s secure wallets remained immune to these attacks from the moment the site went live, preventing any connections from being made. The sophistication of these drainers is noteworthy, according to the firm, as they can fool the simulations used by Solana wallets, causing users to sign malicious transactions unknowingly. Web3 security firm Blockaid further stated: As Solana continues to gain popularity, drainer groups are increasingly moving towards it, as indicated by the growing number of malicious Solana dApps detected by Blockaid. Solana&#8217;s rapid ascent as a high-performance blockchain platform has drawn admiration and scrutiny. Its ability to process transactions quickly and at a lower cost than Ethereum has positioned it as a strong competitor.  However, the network&#8217;s success has also made it an attractive target for malicious actors seeking to exploit vulnerabilities and capitalize on its growing user base. Still, this is not the only bad news for Solana in the past few hours, as its native token has been experiencing a continuous sharp drop in price, leading to the belief that its uptrend and bull run may be over despite the possibility of a rebound in the overall crypto market. Stablecoin Surge And NFT Sales Fail To Prevent SOL&#8217;s Price Drop In just five hours, the price of SOL experienced a significant 13% drop, hitting a low of $85 on Wednesday. This decline occurred despite notable growth in stablecoin transfers, which saw a rise of over 45% this week.  Additionally, on Tuesday, SOL surpassed Ethereum in monthly trading volume for non-fungible token (NFT) sales, marking a milestone for the network. SOL is the fifth-largest cryptocurrency, boasting a market capitalization of $42.6 billion. It holds a $12 billion lead over XRP and trails just behind Binance Coin (BNB) by a mere $6 billion. Related Reading: Bitcoin Breaks Through Securities Barrier: Registered Funds Want Exposure To BTC The trajectory of SOL&#8217;s price remains uncertain as investors await signs of a potential bullish momentum resurgence. Building a more secure framework for decentralized applications (dApps) could be pivotal in restoring investor confidence and attracting additional capital to the ecosystem, potentially propelling SOL to reclaim its one-year high of $126, previously achieved on December 25. Featured image from Shutterstock, chart from TradingView.com "
  }
]