[
  {
    "source": "Cointelegraph",
    "date": "2023-11-16T05:54:45.000Z",
    "title": "Binance to launch Thai exchange in joint venture with local energy giant",
    "url": "http://cointelegraph.com/news/binance-launch-thai-exchange-joint-venture-with-local-energy-giant",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/6a73b5ff-23a1-4415-8c34-aa396e28b3bb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Crypto services from Binance and Gulf Energy’s joint venture, Gulf Binance, will initially be available to Thai residents on an invitation-only basis.</p>\n                    <p><p>Binance will publicly roll out a Thailand-based crypto exchange in early 2024 via a joint venture with local energy giant Gulf Energy Development.</p><p>A Nov. 15 Stock Exchange of Thailand <a href=\"https://weblink.set.or.th/dat/news/202311/1391NWS151120231838120570E.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> by Gulf Energy said the venture, called Gulf Binance, will initially be available on an invitation-only basis with a public rollout by early 2024, with the firm receiving Securities and Exchange Commission approval on Nov. 10.</p><p>A Binance spokesperson confirmed to Cointelegraph that the platform has initially launched as an invitation-only exchange and would give more details as information becomes available.</p><p>On May 26, Gulf Binance <a href=\"https://cointelegraph.com/news/binance-thailand-crypto-exchange-with-gulf-innova-to-launch\">received digital asset operator licenses from Thailand</a>’s Ministry of Finance, which enabled it to operate a crypto exchange regulated by the country’s SEC. At the time, Binance had planned to launch its Thai arm by Q4 2023. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/cc5fb133-7acc-43d8-b641-8c3b5d0049dc.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Gulf Energy announces the commencement of Gulf Binance services. Source: SE</em></figcaption></figure><p>On the same day, Binance’s regional head of Asia, Europe and MENA, Richard Teng, <a href=\"https://www.binance.com/en-IN/feed/post/564889\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the exchange would harness \"Gulf’s established local presence and network,” and Gulf Binance aims to show the potential of blockchain technology to local users.</p><p>Gulf Energy is one of Thailand's largest natural gas distribution companies, founded and run by Thai billionaire Sarath Ratanavadi. The company actively invests across different business verticals, including renewable power generation, infrastructure development projects and digital infrastructure businesses, among others.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/india-tops-chainalysis-2023-global-crypto-adoption-index\"><strong><em>India, Nigeria, Thailand top Chainalysis’ 2023 Global Crypto Adoption Index</em></strong></a></p><p>Gulf Energy invested in Binance’s United States-based arm, Binance.US. In April 2022, <a href=\"https://cointelegraph.com/news/gulf-energy-pursues-joint-venture-with-binance-invests-in-bnb\">the firm disclosed that it invested</a> in “Series Seed Preferred Stock issued by BAM Trading Services,” the operator of Binance.US.</p><p>Last month, Binance assisted the Royal Thai Police to seize $277 million from scammers. Following the revelation, over 3,200 victims contacted the authorities to file for compensation.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Binance?src=hash&amp;ref_src=twsrc%5Etfw\">#Binance</a> Aids Royal Thai Police in Crackdown on Criminal Networks | <a href=\"https://twitter.com/binance?ref_src=twsrc%5Etfw\">@Binance</a> Blog <a href=\"https://t.co/GzMGjTlzmI\">https://t.co/GzMGjTlzmI</a></p>&mdash; CZ  Binance (@cz_binance) <a href=\"https://twitter.com/cz_binance/status/1709103598003429589?ref_src=twsrc%5Etfw\">October 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>At the time, Binance’s head of financial crime compliance, Tigran Gambaryan, highlighted the company’s intent to partner with various authorities worldwide to help with “restoring the trust in the digital-asset ecosystem.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/breaking-into-liberland-dodging-guards-decoys-and-diplomats/\"><strong><em>Breaking into Liberland: Dodging guards with inner-tubes, decoys and diplomats</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-16T05:53:19.000Z",
    "title": "As Bitcoin Nears $38,000, This Analyst Says ‘The Good Times Are Here’",
    "url": "https://www.newsbtc.com/news/bitcoin-nears-38k-the-good-times-are-here/",
    "description": "Bitcoin proponents have reason to be merry as the alpha coin has gracefully ascended to a promising valuation of nearly $38,000 as of late Wednesday, reclaiming its throne with the highest value seen in the last 12 months. Bitcoin bounced back strongly from its battering the day before, reaching within striking distance of a new 18-month high just shy of the vaunted price target. A drop in federal interest rates, the expectation that Sam Bankman-Fried&#8217;s apology for his actions at FTX is a fresh start for the distressed sector, and the SEC&#8217;s approval of a bitcoin exchange-traded fund (ETF) are some of the things that caused prices to rise. Related Reading: Celestia Strikes: How This Lesser-Known Coin Went Berserk With 126% Price Explosion ETFs are a type of investment product that tracks an index or a commodity. Bitcoin ETFs would allow investors to profit from bitcoin&#8217;s rising value without actually owning any bitcoin. ByteTree pointed out that Bitcoin was doing much better than standard assets like gold and U.S. stock indexes, which have also been going up. Reports say that a decision could bring in an extra $600 billion in demand. An approval for an ETF, according to CryptoQuant experts, will cause Bitcoin&#8217;s market capitalization to swell by $1 trillion. Bitcoin Up 117% This Year As this developed, Bitcoin has had a significant increase of over 117% in value over the course of this year. The anticipation of the halving event in 2024 has also contributed to the increase in market optimism. The price of Bitcoin (BTC) is going up as people try to make up for all the ground they lost in the recent crash, which erased up to $90 million in open interest. At $34,572, the 25-day Exponential Moving Average (EMA) comes into view. BTC is trying to get back above the important support level at $36,788. BTCUSD trading at $37,379 on the daily chart: TradingView.com Despite an array of economic challenges, BTC continues to surge upward, registering a 126% year-to-date gain and options market data point to speculators angling toward the $40,000 level. With the recent price increase, the Crypto Fear and Greed index has moved squarely into the &#8220;Greed&#8221; category, indicating that market mood has improved. Source: Alternative.me In an environment characterized by an optimistic and positive outlook, Bitcoin&#8217;s momentum could be amplified and gun for the psychological turning point of $40,000. This would be a big 10% rise from where it is now. It&#8217;s getting stronger because the Relative Strength Index (RSI) is tilting northward, which shows a surge in momentum. Related Reading: If Your Bitcoin Wallet Is A Product Of The 2016 Technology, You Could Be In Trouble – Here’s Why Is The Bear Market Behind Us? According to Zach Pandl, managing chief of research at crypto fund provider Grayscale Investments LLC: “The recovery in crypto valuations can continue if real interest rates peak and we continue to see progress toward spot ETF approvals in the US market.” &#8220;Bitcoin is now going mainstream, and the bear is behind us,&#8221; Charlie Morris, founder of investment advisory company ByteTree, said in a Wednesday market report. &#8220;The good times are here,&#8221; he said. Source: CoinShares Meanwhile, institutional investors have already begun deploying capital to Bitcoin and cryptocurrencies, while retail investors may be waiting for additional liquidity from approved ETFs. Over the past year, institutional investors have poured over $1 billion into cryptocurrency, CoinShares data show (chart above). (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from cottonbro studio/Pexels"
  }
]