[
  {
    "source": "Cointelegraph",
    "date": "2023-12-15T04:38:11.000Z",
    "title": " Gensler hints Grayscale ruling forced SEC to take ‘new look’ at Bitcoin ETFs ",
    "url": "https://cointelegraph.com/news/gensler-hints-grayscale-ruling-forced-sec-new-approach-bitcoin-etfs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvODAyNzgzYmYtNjg0My00YTRkLTk4ODUtMTkzOTFhYjBiOTA4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The SEC chair could be softening his stance on Bitcoin ETFs following the Grayscale court victory, but if so, he hasn’t admitted it outright.</p>\n                    <p><p>U.S. Securities and Exchange Commission chair Gary Gensler has hinted that the regulator has been rethinking its approach to spot Bitcoin exchange-traded products following a recent Grayscale court decision.</p><p>Speaking to CNBC on Dec. 14, Gary Gensler was questioned about the long list of pending spot Bitcoin ETF applications. He <a href=\"https://www.cnbc.com/video/2023/12/14/sec-chair-gary-gensler-ai-is-the-most-transformative-technology-of-our-time.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the SEC has “between eight and a dozen filings” going through the process at the moment.</p><p>“We had in the past denied a number of these applications,” he said before adding that the courts have weighed in on that. What followed was a statement suggesting that the agency could be changing its tack on Bitcoin:</p><p><a href=\"https://cointelegraph.com/news/gensler-hints-grayscale-ruling-forced-sec-new-approach-bitcoin-etfs\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-15T04:34:37.000Z",
    "title": "Intel Unveils Gaudi3 AI Chip to Compete with Nvidia and AMD",
    "url": "https://www.cryptopolitan.com/intel-unveils-gaudi3-ai-chip/",
    "description": "Intel Corporation has announced the launch of its latest AI-focused computer chip, the Gaudi3, signaling a strategic move to compete directly with industry leaders Nvidia and AMD. The release prompted a 1% increase in Intel&#8217;s shares, underlining the significance of this advancement in the ever-evolving landscape of artificial intelligence processing. Key competitors and market dynamics [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-15T04:15:52.000Z",
    "title": "Predictions for 2024 to Reshape Tech, Media, and Social Dynamics",
    "url": "https://www.cryptopolitan.com/predictions-for-2024-tech-media-and-social/",
    "description": "In the realm of technological anticipation, 2024 is poised to emerge as a canvas of unprecedented predictions and transformative expectations. As we stand on the cusp of a new year, a wave of projections sweeps through the tech and media landscapes, painting a picture of what lies ahead. From the anticipated ascendancy of Threads, Meta&#8217;s [&#8230;]"
  }
]