[
  {
    "source": "Decrypt",
    "date": "2023-07-21T16:45:16.000Z",
    "title": "Human Artists Lose Ground in Legal Battle Against AI",
    "url": "https://decrypt.co/149533/human-artists-lose-ground-in-legal-battle-against-ai",
    "description": "U.S. District Judge William Orrick said artists should \"provide more facts\" to back up claims about alleged copyright infringement by AI companies"
  },
  {
    "source": "Decrypt",
    "date": "2023-07-21T16:44:49.000Z",
    "title": "FTX Lawsuit Alleges SBF Brother Planned to Turn Island Nation Into Doomsday Bunker",
    "url": "https://decrypt.co/149537/ftx-lawsuit-alleges-sbf-brother-planned-to-turn-island-nation-into-doomsday-bunker",
    "description": "Gabriel Bankman-Fried allegedly planned to use Nauru as a shelter for effective altruists in the event of a global catastrophe."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-21T17:00:00.000Z",
    "title": "Indonesia’s Crypto Exchange and Clearing House Finally Go Live",
    "url": "https://cryptodaily.co.uk/2023/07/indonesias-crypto-exchange-and-clearing-house-finally-go-live",
    "description": "<p>After months of anticipation, the Indonesian government has finally launched its crypto bourse and clearing house in an effort to regulate digital assets in the country.</p>\n<p>In its official statement from Thursday, the Indonesian Commodity Futures Trading Regulatory Agency (also known as Bappebti) reported that its new national crypto exchange has been operational since July 17. Along with the bourse, Indonesia has also established a futures clearing house to ensure secure transactions.&nbsp;</p>\n<p>The state-backed crypto market has been in development since December 2021 and was initially planned to be released by December 2022. However, Bappebti had delayed the launch of the exchange several times until finally announcing it was ready to go live earlier this month.</p>\nThe Only Space to Legally Exchange Crypto in Indonesia\n<p>Indonesia has previously banned the use of cryptocurrencies as a means of payment but has allowed investment in digital assets. Following the investment boom during the pandemic, the recent data shows that over 17 million citizens of Indonesia had invested in crypto.</p>\n<p>The opening of the national crypto exchange comes as an effort to strengthen crypto regulation in the country. Bappebti has made it clear that the newly established platform will be the only space in the country where the legal exchange of cryptocurrencies is allowed.&nbsp;</p>\n\n<p>\"The establishment of exchanges, clearing houses and managers of crypto asset storage is proof that the government is present in an effort to create a fair and fair crypto asset trading ecosystem to guarantee legal certainty and prioritize protection for the public as customers,\" head of Bappebti Didid Noordiatmoko said in the statement of July 20.</p>\n\nWhat Will Be Featured on the Indonesian Exchange?\n<p>The national crypto bourse is expected to list licensed crypto companies, such as Binance's Tokocrypto and Indodax, and others as traders. At least five hundred digital assets have already been approved to be traded on the exchange.</p>\n<p>Earlier reports stated that Bappebti intended to limit cryptocurrency sales to local transactions while aligning them with global market trends. Licensed traders will be granted a one-month window to join the new exchange.</p>\n<p>According to the statement by Didid Noordiantmoko, PT Bursa Komoditi Nusantara will oversee the crypto bourse, while PT Kliring Berjangka Indonesia will handle transaction clearing. Additionally, PT Tennet Depository Indonesia has been designated as the manager responsible for crypto asset storage.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-21T16:45:00.000Z",
    "title": "Bitcoin’s declining exchange volumes can become an opportunity for emerging tokens like Borroe Finance ($ROE)",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoins-declining-exchange-volumes-can-become-an-opportunity-for-emerging-tokens-like-borroe-finance-roe",
    "description": "<p class=\"s5\">The cryptocurrency market is in a state of constant evolution, with shifting dynamics and emerging trends. One such trend is the declining exchange volumes of Bitcoin, the world's largest cryptocurrency. While this may raise concerns for some investors, it also presents an opportunity for emerging tokens like Borroe Finance to capture attention and gain traction. As the market diversifies and investors seek the best crypto to invest in now, alternative tokens have the potential to shine and offer lucrative investment prospects.</p>\n<p>&gt;&gt;BUY $ROE TOKENS NOW&lt;&lt;</p>\nBitcoin's Declining Exchange Volumes\n<p class=\"s5\">Bitcoin has long been the dominant force in the cryptocurrency market, serving as the benchmark for other digital assets. However, recent months have seen a decline in Bitcoin's exchange volumes. This trend is driven by various factors, including market cycles, regulatory uncertainties, and increasing competition from alternative cryptocurrencies. While some may interpret this decline as a sign of Bitcoin's waning influence, it also opens up space for emerging tokens to step into the spotlight.</p>\nOpportunity for Emerging Tokens\n<p class=\"s5\">As Bitcoin's exchange volumes decline, emerging tokens have the opportunity to showcase their potential and attract investors. One such token making waves is Borroe Finance. BorroeFinance is an AI-powered funding marketplace that leverages Web3 principles to offer innovative solutions for content creators and businesses. This emerging token presents a compelling investment opportunity, especially in the context of Bitcoin's shifting landscape.</p>\n<p>&gt;&gt;BUY $ROE TOKENS NOW&lt;&lt;</p>\nWhy Borroe Finance Stands Out:\n<p class=\"s5\">1. Innovative Approach: Borroe Finance disrupts traditional financing systems by providing a platform where content creators and Web3 participants can generate instant cash flow. By selling future earnings through discounted NFTs, Borroe Finance aligns with the principles of Web3, emphasizing equitable value sharing among creators and users.</p>\n<p class=\"s5\">2. AI Risk Assessment and Blockchain Technology: Borroe Finance incorporates AI risk assessment and blockchain technology, ensuring a secure and efficient fundraising process. This integration enhances transparency, mitigates risks, and fosters trust among users.</p>\n<p class=\"s5\">3. Streamlined Funding Process: Borroe offers a streamlined funding process, allowing businesses to raise capital by minting NFTs representing future or outstanding invoices. The platform's user-friendly interface and efficient payment solutions make it an attractive choice for content creators and businesses seeking immediate funding.</p>\n<p class=\"s5\">4. Deflationary Token Model: Borroe Finance implements a deflationary token model, creating a potential for long-term value appreciation. The scarcity of tokens and the growing demand for the platform's services contribute to the token's value preservation and growth potential.</p>\n<p class=\"s5\">5. Market Potential: As the crypto market diversifies and investors seek opportunities beyond Bitcoin, tokens like Borroe Finance gain visibility. The platform's unique value proposition and alignment with Web3 principles position it as a strong contender for investors looking for promising alternative tokens.</p>\n<p>&gt;&gt;BUY $ROE TOKENS NOW&lt;&lt;</p>\nDon&rsquo;t Miss Out On Borroe Finance \n<p class=\"s5\">Borroe Finance has launched its presale which allows anyone to purchase $ROE tokens at the cheapest available price. The presale is a great opportunity to invest into this emerging ecosystem and the entire process is designed to give investors the best experience. There are multiple payment methods available including BTC,ETH,BNB,USDT and traditional fiat credit card payments.</p>\nFinal Thoughts\n<p class=\"s5\">Bitcoin's declining exchange volumes open up opportunities for emerging tokens like Borroeto capture attention and gain traction in the cryptocurrency market. As investors diversify their portfolios and seek alternative investment options, tokens with innovative features, such as Borroe's AI-powered funding marketplace, become increasingly appealing.</p>\n<p class=\"s9\">Explore the Borroe ($ROE) Presale:</p>\n<p class=\"s9\">Website: https://borroe.finance/</p>\n<p class=\"s9\">Telegram: https://t.me/borroe_finance</p>\n<p class=\"s9\">Twitter: https://twitter.com/Borroe_Finance</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T17:01:47.000Z",
    "title": "Major US tech firms make AI promises to the White House",
    "url": "https://www.cryptopolitan.com/us-tech-firms-ai-promises-to-the-white-house/",
    "description": "In a critical juncture for the future of artificial intelligence (AI), leading US tech giants, including Google and OpenAI, are set to publicize their commitment to enhance safety and transparency in the burgeoning field of AI. This assurance comes directly from the epicenter of American power, the White House, as a part of a broader ... <a title=\"Major US tech firms make AI promises to the White House\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-tech-firms-ai-promises-to-the-white-house/\" aria-label=\"More on Major US tech firms make AI promises to the White House\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T17:01:25.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for decoupling on-chain and off-chain trading activity. There was evidence that, unlike traditional financial markets, cryptocurrency volatility is not associated with market downturns. Observers also noted that, after gaining widespread attention and with ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T16:55:49.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the series of delisting fuelled by the ongoing United States SEC crackdown on major crypto platforms. Basically, it&#8217;s crypto winter in the summer as it stands. How do Cardano Price Prediction analysts steer in this turbulent crypto weather? ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T16:54:37.000Z",
    "title": "Key takeaways from Binance’s Half-Year crypto report of 2023",
    "url": "https://www.cryptopolitan.com/takeaways-binance-half-year-crypto-report/",
    "description": "2023 has been a roller-coaster ride for the cryptocurrency sector, with dramatic highs and lows spanning the first half of the year. As the market capitalization of cryptocurrencies concludes the period on an upbeat note, a detailed review of Binance&#8217;s half-year report offers crucial insights into this dynamic landscape. Unstoppable rise of Bitcoin Bitcoin, the ... <a title=\"Key takeaways from Binance&#8217;s Half-Year crypto report of 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/takeaways-binance-half-year-crypto-report/\" aria-label=\"More on Key takeaways from Binance&#8217;s Half-Year crypto report of 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T16:46:56.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T17:00:06.000Z",
    "title": "More Crypto Whales Are Binning PEPE For Utility Tokens Like QUBE",
    "url": "https://www.crypto-news-flash.com/more-crypto-whales-are-binning-pepe-for-utility-tokens-like-qube-2/?utm_source=rss&utm_medium=rss&utm_campaign=more-crypto-whales-are-binning-pepe-for-utility-tokens-like-qube-2",
    "description": "<img width=\"512\" height=\"512\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T113054.088-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T113054.088-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T113054.088-1-300x300.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T113054.088-1-150x150.jpg 150w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the ever-evolving crypto landscape, the preferences of influential investors &#8211; or &#8220;whales&#8221; &#8211; play a crucial role in determining the trends that steer the market. One such shift that has recently gained significant attention is the increasing preference for utility tokens, like QUBE from InQubeta, over meme coins such as PEPE. This trend shows [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T16:48:32.000Z",
    "title": "TRON Dominates Ethereum with 5 Million Daily Transactions as TRX Stays Resilient and Prepares for Massive Upward Move",
    "url": "https://www.crypto-news-flash.com/tron-dominates-ethereum-with-5-million-daily-transactions-as-trx-stays-resilient-and-prepares-for-massive-upward-move/?utm_source=rss&utm_medium=rss&utm_campaign=tron-dominates-ethereum-with-5-million-daily-transactions-as-trx-stays-resilient-and-prepares-for-massive-upward-move",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Stanslavs-TRON-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Stanslavs-TRON-3.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Stanslavs-TRON-3-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Stanslavs-TRON-3-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Stanslavs-TRON-3-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />TRON has beaten Ethereum in daily transactions, with more than 4 million recorded transactions.  The total amount of TRX staked has increased in the past few days as several indicators record a bullish sentiment.  Tron [TRX] has been recording growth in the last few days as its accounts and adoption rate increase. TRX’s recorded a [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-21T16:55:44.000Z",
    "title": "U.S. Federal Reserve Officially Launches New Instant Payment Service FedNow",
    "url": "https://dailyhodl.com/2023/07/21/u-s-federal-reserve-officially-launches-new-instant-payment-service-fednow/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/federal-officially-launches-new.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/federal-officially-launches-new.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/federal-officially-launches-new.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/federal-officially-launches-new.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/federal-officially-launches-new.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/federal-officially-launches-new.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/federal-officially-launches-new.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The new instant payment infrastructure of the U.S. Federal Reserve, called FedNow, has officially been launched. Banks and credit unions can now sign up with the payments system to enable instant money transfers for their customers at any hour of the day, according to a recent press release. The Fed says on Twitter that the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/21/u-s-federal-reserve-officially-launches-new-instant-payment-service-fednow/\">U.S. Federal Reserve Officially Launches New Instant Payment Service FedNow</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]