[
  {
    "source": "Decrypt",
    "date": "2023-08-24T13:51:02.000Z",
    "title": "1Inch Network Joins DeFi Heavweights Launching on Ethereum Layer-2 Base",
    "url": "https://decrypt.co/153603/1inch-networks-joins-defi-heavweights-launching-on-ethereum-layer-2-base",
    "description": "The decentralized exchange aggregator 1inch joins Uniswap and Sushiswap on Coinbase-incubated Base blockchain."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T14:07:00.000Z",
    "title": "5 ChatGPT prompts for web developers",
    "url": "https://cointelegraph.com/news/5-chatgpt-prompts-for-web-developers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/40b3d75b-8b0c-411e-8990-fee93657e720.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Uncover the synergy between ChatGPT and web development with five intriguing prompts that spark creativity and problem-solving. </p>\n                    <p><p>In the fast-paced world of web development, innovation often arises from exploring new tools that push boundaries and revolutionize workflows. Enter ChatGPT, the <a href=\"https://cointelegraph.com/learn/googles-bard-vs-open-ais-chatgpt\">AI-powered language model</a> that’s rapidly becoming a dynamic addition to developers’ arsenals. </p><p>But what happens when the realms of web development and the complexities of the crypto universe collide? This article will delve into five captivating ChatGPT prompts tailored for web developers navigating the crypto landscape. Get ready to unlock a new realm of possibilities that seamlessly blend technology and finance.</p><h2>Building a cryptocurrency price tracker</h2><p>Imagine you’re a web developer aiming to create a sleek cryptocurrency price tracker. ChatGPT can play a pivotal role in conceptualizing the design and functionality.</p><p>Provide a prompt like “Design a real-time cryptocurrency price tracker with interactive graphs and hourly price updates,” and ChatGPT may offer ideas on using APIs to fetch data, implementing interactive charts with libraries, such as Chart.js or D3.js, and utilizing real-time updates with WebSocket connections. The result? A user-friendly price tracker that keeps crypto enthusiasts informed about market trends.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/1abac653-4f90-4db2-be43-82bb72047ac6.jpg\"  /></figure><h2>Crafting a secure crypto payment gateway</h2><p>Web developers often grapple with the intricacies of creating secure payment gateways for crypto transactions. </p><p>Engage ChatGPT with a prompt like “Develop a crypto payment gateway that supports Bitcoin and Ethereum, ensuring robust security measures” and watch as it suggests incorporating secure wallet integrations, utilizing two-factor authentication and implementing decentralized smart contracts to streamline transactions. The outcome? An impenetrable gateway that instills confidence in users looking to transact with digital currencies.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/17b1cd68-d21a-40cf-aabc-89ecd69c4db2.jpg\"  /></figure><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/11-chatgpt-prompts\">11 ChatGPT prompts for maximum productivity</a></em></strong></p><h2>Creating a crypto portfolio tracker</h2><p>Portfolio trackers play a pivotal role in the world of cryptocurrencies by providing individuals with a comprehensive and real-time overview of their crypto investments. </p><p>Users can prompt ChatGPT, inputing “Create a portfolio tracker where users can input their Bitcoin holdings and view their total portfolio value, along with Bitcoin’s price chart,” and in return, ChatGPT may suggest “Construct a user-friendly interface that allows individuals to input their Bitcoin holdings and displays their total portfolio value, offering a graphical representation of Bitcoin’s price fluctuations over time.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/bb70df34-06b0-4d8b-a9d0-d576875d59b5.jpg\"  /></figure><h2>Developing a crypto analytics dashboard</h2><p>For developers seeking to harness the power of data visualization in the crypto domain, ChatGPT can be a guiding light. </p><p>Initiate a prompt like “Develop a comprehensive analytics dashboard that tracks crypto market trends and user portfolios” and watch as ChatGPT recommends integrating APIs from crypto exchanges, utilizing libraries, such as Plotly or Tableau, for data visualization and implementing user authentication to ensure data privacy. The outcome? A powerful analytics dashboard that empowers users to make informed decisions in the volatile crypto landscape.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/3bc9cc31-0e49-496e-8e06-879f22f43001.jpg\"  /></figure><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/chatgpt-for-project-management\">How to use ChatGPT for project management</a></em></strong></p><h2>Implementing a blockchain explorer interface</h2><p>Diving into blockchain development? ChatGPT can aid in creating a user-friendly interface for exploring blockchain transactions. </p><p>Provide a prompt like “Design an intuitive blockchain explorer interface with search capabilities and transaction history,” and ChatGPT might suggest utilizing blockchain APIs to fetch data, implementing a search bar with auto-suggestions and visualizing transaction flows with interactive diagrams. The result? An interface that demystifies the complex world of blockchain for users.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/6c358f42-622b-49d3-92e9-68ab5a14b76f.jpg\"  /></figure><h2>Uphold industry best practices to yield success </h2><p>As the worlds of web development and cryptocurrencies intertwine, the possibilities for innovation are boundless. Engaging with ChatGPT to explore these crypto-centric prompts opens doors to fresh ideas and efficient solutions. However, it’s important to remember that while ChatGPT offers creative insights, validating its recommendations against industry best practices remains essential to ensure the success of your crypto-related projects. </p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T13:59:02.000Z",
    "title": "Binance's zero-fee Bitcoin update could echo March downturn ",
    "url": "https://cointelegraph.com/news/binance-s-zero-fee-bitcoin-update-could-echo-march-downturn",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/2f0c99fb-6b05-480c-8741-972408fdb093.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In an official statement, cryptocurrency exchange Binance unveiled its plans to implement updates to the zero-fee Bitcoin trading starting from September 7.</p>\n                    <p><p>Binance cryptocurrency exchange announced its intention to modify its zero-fee Bitcoin trading program on Aug. 24. This action has the potential to initiate a significant market downturn, reminiscent of the 90% trading volume decline observed following Binance's discontinuation of zero-fee trading in March.</p><p>In an official <a href=\"https://www.binance.com/en/support/announcement/updates-on-zero-fee-bitcoin-trading-2023-09-07-9f438c4249ff45deb34cb9f727f99f83\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, cryptocurrency exchange Binance unveiled its plans to implement updates to the zero-fee Bitcoin trading starting from Sept. 7. Binance intends to modify the zero-fee Bitcoin trading for the Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>)/ True USD (TUSD) spot and margin trading pair.</p><p>Previously, traders experienced zero maker and taker fees while engaging in BTC trading with TUSD pairs. However, a regular taker fee will now be implemented based on the user's VIP level. Nonetheless, users will still encounter no maker fees when conducting Bitcoin trades on the BTC/TUSD spot and margin trading pair.</p><blockquote>“The corresponding trading volume on the BTC/TUSD spot and margin trading pair will count toward VIP tier calculation and all Liquidity Provider programs. In addition, BNB discounts, referral rebates and any other fee adjustments will resume for BTC/TUSD spot and margin trading volumes.”</blockquote><p>Seemingly, Binance is discontinuing its zero-fee Bitcoin trading initiative for TUSD, indicating a decreased backing for the TUSD stablecoin <a href=\"https://cointelegraph.com/news/tusd-stops-minting-via-prime-trust-loses-dollar-peg\">due to various concerns</a>. Importantly, users will still retain the privilege of zero maker and taker fees while engaging in Bitcoin trading within the FDUSD spot and margin trading pair.</p><p>Binance's adjustment of its zero-fee Bitcoin trading scheme for the BTC/TUSD spot and margin trading pair could be inadvertently inciting another round of selloffs in the market.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-dubs-barred-russian-banks-on-its-platform-as-yellow-and-green-cards\"><strong><em>Binance dubs barred Russian banks on its platform as ‘Yellow’ and ‘Green’ cards</em></strong></a></p><p><a href=\"http://v\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to CoinMarketCap, the BTC/TUSD and BTC/USDT pairs are the most frequently traded for Bitcoin, constituting 11% and 7% respectively. The trading volume in Tether (USDT) pairs experienced a significant drop after Binance stopped supporting BUSD and designated TUSD as the sole trading pair for zero-fee Bitcoin trading.</p><p>Yet again, the exchange is redirecting attention away from the widely traded TUSD <a href=\"https://cointelegraph.com/news/binance-starts-btc-fdusd-and-eth-fdusd-trading-pairs-with-zero-fees\">to the lesser-known FDUSD stablecoin</a>. Notably, FDUSD doesn't rank within the top 10 Bitcoin pairs by trading volume, with The market capitalization of FDUSD standing at $324 million.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-24T14:00:34.000Z",
    "title": "Bitcoin profitable on 86% of days, yet just 61% of holders are in profit",
    "url": "https://cryptoslate.com/there-is-an-86-chance-your-bitcoin-is-in-profit-but-only-61-are/",
    "description": "<p>Since August 2010, there have been only 677 days in which you could have bought Bitcoin and currently be at a loss, with 86% of days where &#8216;holding Bitcoin has been profitable relative to today&#8217;s price,&#8217; as per Coinglass data. Data from Coinglass shows that entities who purchased Bitcoin on any one of the other [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/there-is-an-86-chance-your-bitcoin-is-in-profit-but-only-61-are/\">Bitcoin profitable on 86% of days, yet just 61% of holders are in profit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-24T13:47:33.000Z",
    "title": "\n                        LBank to List Five New Tokens This Week\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/lbank-to-list-five-new-tokens-this-week",
    "description": "\n                        Road Town, BVI, August 24th, 2023, Chainwire\n<p>&nbsp;</p>\n<p>LBank exchange continues to focus on providing its users with access to quality tokenized projects. For the week starting August 21, a total of five new tokens will be made available for trading on LBank including a number of memecoins.</p>\n<p>On August 21, LBank listed ROA, the token for metaverse and NFT project Roaland. The token is connected to facilitating NFT transactions and NFT-based service experiences. Roland also operates services based on the Art-Tech platform. On August 22, LBank listed JjangGu (JJGU), a meme-based cryptocurrency that is designed to serve as digital currency for charity, donations, good deeds, and similar altruistic causes.</p>\n<p>On the same day, LBank listed DT, a BEP20 token issued by DT Foundation, a company focused on blockchain technology and DeFi. It&rsquo;s building a trading system that breaks away from centralization, providing users with greater freedom and efficiency. DT Foundation operates products such as MonkeySwap through a partnership with WoWMax.</p>\n<p>On August 25, LBank will list DongCoin (DONG), which has been described as Korea's first shitcoin. Two days later, it will list FILEDOGE, a decentralized memecoin and DEX on Filecoin. The project was launched in February 2023 as a community-driven initiative embodying the spirit of DOGE's meme culture while adhering to FIL's smart contracts. The token features a fair Genesis release and an inclusive, teamless structure.&nbsp;</p>\n<p></p>\n<p>For the week running from August 14-20, LBank listed a total of 10 tokens. These included LadyPepe (LPEPE), a memecoin that rose by an impressive 312,900%. There was also BAKE (up 88% in a week), CRYN, TRU, SEI, LF, SIX, CYBER, AXE, and XRPH, all of which posted significant growth after listing.</p>\nAbout LBank\n<p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform has over 9 million users from more than 210 regions across the world. LBank is a cutting-edge platform that ensures the integrity of user funds and aims to contribute to the global adoption of cryptocurrencies.</p>\n<p>Community &amp; Social Media:&nbsp;</p>\n<p>Telegram l Twitter l Facebook l LinkedIn l Instagram l YouTube</p>\n<p>&nbsp;</p>\nContact\n<p>LBK Blockchain Co. Limitedmarketing@lbank.info</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T14:01:32.000Z",
    "title": "How Blockchain Security Companies Help Foster Confidence for Africa’s Sustainable Growth",
    "url": "https://www.cryptopolitan.com/how-blockchain-security-companies-africa/",
    "description": "In recent years, Africa has rapidly emerged as a dynamic hub for technological innovation and digital transformation. Among the various groundbreaking technologies that have gained traction on the continent, blockchain stands out as a particularly promising solution with the potential to revolutionize industries and reshape traditional paradigms. As blockchain&#8217;s influence continues to expand, so does ... <a title=\"How Blockchain Security Companies Help Foster Confidence for Africa&#8217;s Sustainable Growth\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-blockchain-security-companies-africa/\" aria-label=\"More on How Blockchain Security Companies Help Foster Confidence for Africa&#8217;s Sustainable Growth\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T13:59:40.000Z",
    "title": "ChatGPT to Become a New Frontier in Stock Market Investing",
    "url": "https://www.cryptopolitan.com/chatgpt-a-new-frontier-in-stock-market/",
    "description": "In the fast-paced world of stock market investing, time is money. Retail investors are always looking for tools that can give them an edge. Enter ChatGPT, a chatbot powered by advanced machine learning algorithms, which is revolutionizing how investors approach the stock market. From explaining financial jargon to conducting portfolio analysis, ChatGPT is becoming an ... <a title=\"ChatGPT to Become a New Frontier in Stock Market Investing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chatgpt-a-new-frontier-in-stock-market/\" aria-label=\"More on ChatGPT to Become a New Frontier in Stock Market Investing\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T13:59:20.000Z",
    "title": "UK economists predict that interest rates will reach a peak of 5.5% in September",
    "url": "https://www.cryptopolitan.com/uk-economists-predict-interest-rates/",
    "description": "Economists forecast that the UK economy will witness a rise in interest rates to a peak of 5.5% in the upcoming month. The Bank of England policymakers anticipate the move to mitigate the potential adverse effects of increased borrowing expenses on the UK economy.&#160; The experts also indicate that, in their endeavor to avert a ... <a title=\"UK economists predict that interest rates will reach a peak of 5.5% in September\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-economists-predict-interest-rates/\" aria-label=\"More on UK economists predict that interest rates will reach a peak of 5.5% in September\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T13:56:50.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T13:53:26.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now: how will this affect our Cosmos Price Prediction? How ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T13:41:04.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-24T14:05:33.000Z",
    "title": "Terra Luna Classic Price Near-Term Advance – Will LUNC Climb 25%?",
    "url": "https://www.newsbtc.com/news/terra-luna-classic-near-term-advance/",
    "description": "Terra Luna Classic (LUNC) has embarked on a six-month journey marked by a consistent downtrend, largely influenced by the gravitational pull of a so-called descending channel pattern. This pattern, characterized by successive lower highs and lows, mirrors an active market sentiment favoring sales during attempts at bullish rebounds. Mid-August proved to be a pivotal juncture for LUNC as aggressive selling surged, triggering a precipitous plunge from $0.0000658 to $0.0000523. This swift and significant 34% drop led to a critical retest of the support trendline intrinsic to the falling channel pattern.  Interestingly, the coin&#8217;s value exhibited resilience through multiple instances of dynamic rebounds, translating to intermittent bullish bounces in its ongoing recovery phase. Terra Luna Classic Chart Hints Signs Of Resurgence Delving into the price analysis, the daily chart unfolded a compelling narrative with a long-tailed rejection manifesting at the lower boundary of the channel pattern, commencing on August 17. This occurrence effectively signaled an undercurrent of demand pressure. Capitalizing on this support, the price rebounded vigorously, propelling it upwards by 22%, currently resting at $0.0000638. Source: TradingView Should LUNC&#8217;s price sustain its position above $0.6 in the coming days, a beacon of hope emerges for buyers to potentially spearhead a rally of up to 25%, culminating in a rendezvous with the overhead trendline of the channel. Yet, the market&#8217;s true affirmation of a trend reversal hinges upon a more decisive signal: a bullish breakout from the resistance trendline. Related Reading: Solana In Turbulence: Analyzing The Death Cross And What Lies Ahead Nova&#8217;s Strategic Intervention Amidst Community Dynamics In a parallel development, Terra Luna Classic&#8217;s validator, Nova, has unveiled a strategic initiative in response to a proposal that floundered amidst some challenges. The proposal, aimed at funding the Quant USTC repeg team, faced rejection within the Terra Luna Classic community. As a result of the refusal of #LUNC validators to pay the $USTC Team for work that they delivered successfully, we will now be funding the USTC Team directly with our commissions in response to this breach of contract by validators. If you want to fix the chain, please delegate. — Nova (@NovaValidator) August 23, 2023 Despite a promising trajectory for Proposal 11716, which sought to financially support the Quant team for the month, some validators&#8217; eleventh-hour &#8220;No&#8221; votes led to its downfall. Consequently, Nova has stepped forward to finance the USTC repeg team, fostering a collaborative spirit. With an appeal for the community to align their interests and redelegate with Nova, a concerted effort seeks to bolster the USTC repeg mission and breathe renewed life into the Terra Luna Classic ecosystem. Cryptocurrencies market cap barely unchanged at $1.04 trillion today: TradingView.com Related Reading: Optimism Reverses From Range Low With 10% Gain – How Far Can Bulls Go? The LUNC price on CoinGecko currently stands at $0.00006448, reflecting a 0.5% increase in the past 24 hours. Additionally, over the course of the past seven days, the LUNC price has experienced a decline of 4.8%. LUNC price action today. Source: Coingecko As the Terra Luna Classic journey unfolds, the interplay of technical trends and community dynamics sets the stage for another chapter in the cryptocurrency narrative. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from The Blade"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-24T14:00:42.000Z",
    "title": "Is It Too Late to Buy Bitcoin (BTC)? Experts Recommend New Altcoin with Explosive ROI Potential",
    "url": "https://www.crypto-news-flash.com/is-it-too-late-to-buy-bitcoin-btc-experts-recommend-new-altcoin-with-explosive-roi-potential/?utm_source=rss&utm_medium=rss&utm_campaign=is-it-too-late-to-buy-bitcoin-btc-experts-recommend-new-altcoin-with-explosive-roi-potential",
    "description": "Bitcoin (BTC) is the most popular and the most prominent cryptocurrency in the world. Its popularity and value over the years now make investors ask themselves if they were late to the party. They want to know if it is not too late to buy BTC. No, it is not too late to buy BTC. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-24T13:41:03.000Z",
    "title": "Ripple is Much More Than Just Banking: A Deep Dive into XRP’s Significant Role in World Trade and Payment Networks",
    "url": "https://www.crypto-news-flash.com/ripple-is-much-more-than-just-banking-a-deep-dive-into-xrps-significant-role-in-world-trade-and-payment-networks/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-is-much-more-than-just-banking-a-deep-dive-into-xrps-significant-role-in-world-trade-and-payment-networks",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041_1920-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041_1920-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041_1920-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041_1920-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041_1920-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/ripple-6237041_1920-48x32.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Crypto influencer BitBoy raises XRP investors&#8217; hopes and asks them to look beyond just price movements and greater XRP utility. He talks about XRP&#8217;s applications beyond the banking domain which includes governance, accounts, tokenization, decentralized finance (DeFi), and NFTs. During the recent crypto market correction last week, the XRP price came crashing down under $0.50 [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-24T13:58:40.000Z",
    "title": "ETH, LDO, UNI, and AAVE Worth Millions Purchased by Whale",
    "url": "https://coinedition.com/eth-ldo-uni-and-aave-worth-millions-purchased-by-whale/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/PRICE-A-9-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A whale spent about $5 million to buy various cryptocurrency tokens, according to a Twitter post shared by the on-chain analytics platform Lookonchain. The whale’s largest purchase was 413,727 Uniswap (UNI), worth about $2 million, which he bought at a price of $4.83 The whale took the discounted cryptocurrency prices as a sign to stock [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/eth-ldo-uni-and-aave-worth-millions-purchased-by-whale/\">ETH, LDO, UNI, and AAVE Worth Millions Purchased by Whale</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]