[
  {
    "source": "CoinDesk",
    "date": "2023-08-11T01:48:49.000Z",
    "title": "First Mover Asia: Bitcoin is CPI Resistant ",
    "url": "https://www.coindesk.com/markets/2023/08/11/first-mover-asia-bitcoin-is-cpi-resistant/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Modest Consumer Price Index (CPI) numbers mean that the chance of another rate hike is dwindling."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-11T02:00:37.000Z",
    "title": "Binance Labs invests $5M in Curve DAO Token following $60M July hack",
    "url": "https://cryptoslate.com/binance-labs-invests-5m-in-curve-dao-token-following-60m-july-hack/",
    "description": "<p>Binance Labs said on Aug. 10 that it has invested $5 million in Curve DAO Token (CRV) in an attempt to bolster the DeFi platform following an attack. Yi He, Co-Founder of Binance and Head of Binance Labs, said: &#8220;Given the recent events that have impacted the protocol, Binance Labs has offered our full support [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-labs-invests-5m-in-curve-dao-token-following-60m-july-hack/\">Binance Labs invests $5M in Curve DAO Token following $60M July hack</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-11T02:00:15.000Z",
    "title": "SEC Could Approve Spot Bitcoin ETF Within 6 Months, Says Mike Novogratz",
    "url": "https://news.bitcoin.com/sec-could-approve-spot-bitcoin-etf-within-6-months-says-mike-novogratz/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/novogratz-bitcoin-etf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC Could Approve Spot Bitcoin ETF Within 6 Months, Says Mike Novogratz\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/novogratz-bitcoin-etf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/novogratz-bitcoin-etf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/novogratz-bitcoin-etf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/novogratz-bitcoin-etf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/novogratz-bitcoin-etf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/novogratz-bitcoin-etf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/novogratz-bitcoin-etf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Galaxy Digital CEO Mike Novogratz is optimistic that the U.S. Securities and Exchange Commission (SEC) could approve a spot bitcoin exchange-traded fund (ETF) within four to six months. The executive cited his contacts at Blackrock, the world&#x2019;s largest asset manager, and investment management firm Invesco. Both companies have filed to launch a bitcoin ETF with [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-11T02:00:33.000Z",
    "title": "Curve DAO Scores $5 Million Boost From Binance, Eyes BNB Chain Expansion",
    "url": "https://www.newsbtc.com/binance/curve-dao-scores-5-million-boost-from-binance-eyes-bnb-chain-expansion/",
    "description": "In a strategic move to bolster the decentralized finance (DeFi) sector, Binance Labs, the venture capital and incubation arm of Binance, has committed a substantial $5 million investment in Curve DAO Token (CRV).  The Ethereum-based CRV token is the backbone of the Curve ecosystem, which has established itself as the largest stable swap and second-largest decentralized exchange (DEX). Related Reading: Rising Star Hedera (HBAR) And Its 11% Climb – A Closer Look Curve and Binance&#8217;s BNB Chain Forge Strategic Alliance As part of the partnership, Curve will explore the deployment of its protocol on the BNB Chain, the thriving ecosystem powered by its native token, BNB. This strategic alignment aims to leverage the strengths of both platforms, further fueling the growth of DeFi on the BNB Chain. Yi He, Co-Founder of Binance and Head of Binance Labs, expressed enthusiasm about the collaboration, stating:  Curve is the largest stableswap, and as a key protocol in DeFi, it has contributed to the steady growth of the space in 2023. Given the recent events that have impacted the protocol, Binance Labs has offered our full support to Curve through our investment and strategic collaboration. We view this cooperation as a starting point and look forward to working together to further propel the growth of the DeFi ecosystem. Curve Founder, Michael Egorov, acknowledged the significance of the collaboration, stating: BNB Chain has earned a significant presence in DeFi and is well-positioned to deploy Curve&#8217;s current and future products on its chain. We look forward to collaboratively fostering innovation and growth across the DeFi ecosystem. According to Binance Labs’ announcement, Curve&#8217;s Automated Market Maker (AMM) platform has revolutionized liquidity provision in DeFi, offering hundreds of incentivized liquidity pools with low slippage and transaction fees.  With the support and strategic investment of Binance Labs, the protocol seems poised to accelerate its mission to transform DeFi by increasing liquidity, reducing transaction friction, and expanding its ecosystem.  Is Cross-Chain Interoperability The Key To Curve&#8217;s Success On BNB Chain? Deploying Curve to BNB Chain brings numerous advantages to both Curve and the BNB Chain ecosystem. One key benefit is enhanced scalability, as BNB Chain offers high throughput and low latency, providing a robust infrastructure for DeFi protocols like Curve. By deploying on BNB Chain, Curve can leverage the network&#8217;s capabilities to handle more transactions and accommodate the growing user demand. Another advantage is the lower transaction fees offered by BNB Chain. This cost-efficiency appeals to users seeking to minimize expenses when interacting with Curve. By deploying on BNB Chain, Curve users can enjoy reduced transaction fees, enhancing the overall affordability of using the Curve protocol. The cross-chain interoperability of BNB Chain also enables seamless integration of assets and protocols from different blockchains, creating opportunities for Curve to collaborate with other projects and protocols within the BNB Chain ecosystem.  Related Reading: Aptos (APT) Volume Remains Extremely High, More Gains Ahead? Deploying Curve to BNB Chain can expose the protocol to the extensive Binance ecosystem. Binance, one of the world&#8217;s largest cryptocurrency exchanges, operates its ecosystem on BNB Chain.  This exposure opens doors to potential partnerships, collaborations, and increased visibility among Binance users, further strengthening Curve&#8217;s position in the market. Overall, deploying the platform to BNB Chain aligns with its goal of expanding its presence across multiple chains and reaching a broader user base.  By leveraging the advantages of BNB Chain, such as enhanced scalability, lower transaction fees, access to a large user base, cross-chain interoperability, and exposure to the Binance ecosystem, the protocol can contribute to the growth and development of the DeFi ecosystem. Featured image from iStock, chart from TradingView.com "
  }
]