[
  {
    "source": "Cointelegraph",
    "date": "2023-06-15T08:55:37.000Z",
    "title": "Here's what Nigeria's naira float means for its crypto market ",
    "url": "https://cointelegraph.com/news/here-s-what-nigeria-s-naira-float-means-for-its-crypto-market",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/beba1099-6099-4295-827b-6ae12edb5d36.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This reduces the likelihood of artificial price differences between the naira and cryptocurrencies in different markets.</p>\n                    <p><p>Nigeria, known for its growing adoption of cryptocurrencies, particularly Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), on June 14, <a href=\"https://www.cbn.gov.ng/Out/2023/CCD/Operational%20Changes%20to%20FX%20Market.pdf\" target=\"_blank\" rel=\"noopener nofollow\">floated </a>the nation’s naira currency to allow banks and other forex market actors to trade the currency freely. This new policy can have several implications for crypto traders. </p><p>Foreign currency buyers and sellers can trade at rates they feel comfortable with based on market conditions, instead of what the <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/central-bank-of-nigeria\">Central Bank of Nigeria (CBN)</a> forces them to sell. This move follows the President's decision to <a href=\"https://cointelegraph.com/news/nigeria-to-tax-crypto-digital-assets-10-on-capital-gains-experts-react\">implement a 10% crypto tax</a> on capital gains and could easily be the biggest game-changer for Nigeria's crypto industry, positively or negatively. </p><p>Cointelegraph spoke with a local crypto expert, David Osawaru, who said that fluctuations in the value of the naira against other currencies, including cryptocurrencies, may impact the profitability of crypto trades. A rapid drop in the value of the naira would have a negative impact on crypto traders. On the other hand, it would mean high profitability if the value of the naira spikes.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Press Release: Operational Changes to the Foreign Exchange Market ...<a href=\"https://t.co/80AqEHqJub\">https://t.co/80AqEHqJub</a> <a href=\"https://t.co/ClbVJducnN\">pic.twitter.com/ClbVJducnN</a></p>&mdash; Central Bank of Nigeria (@cenbank) <a href=\"https://twitter.com/cenbank/status/1669069798410715136?ref_src=twsrc%5Etfw\">June 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to Osawaru, in the case of rapid naira devaluation, there’s the possibility of crypto traders experiencing higher transaction costs due to potential changes in exchange rates. Increased volatility could result in wider bid-ask spreads, making it more expensive to buy or sell cryptocurrencies using the naira. </p><p>Cryptocurrencies are typically traded on exchanges and these exchanges rely on the liquidity of different fiat currencies, including the naira, to facilitate smooth trading. If the liquidity of the naira decreases, it becomes more challenging to match buyers and sellers at desired prices, leading to potential slippage and increased trading costs.</p><p>Liquidity refers to the ease with which an asset can be bought or sold without significantly impacting its price. When the liquidity of a currency decreases, it means that there is a reduction in the availability of buyers and sellers in the market, which can result in wider bid-ask spreads and increased price volatility. </p><p>Osawaru said that the free float of the naira could also reduce arbitrage opportunities for cryptocurrencies by minimizing the discrepancies in their prices across different markets. If the naira's exchange rate is allowed to freely adjust, it becomes less likely for significant price disparities to exist between the naira and cryptocurrencies across different trading platforms or exchanges.</p><p><strong><em>Related:</em></strong><a href=\"https://cointelegraph.com/news/nigeria-regulator-halts-binance-operations-report\"><strong><em>Nigeria regulator halts Binance operations: Report</em></strong></a></p><p>To mitigate any possible negative effects of this new policy on the crypto market and the economy at large, the Nigerian government could introduce cryptocurrency policies to foster a more liquid and efficient trading environment, encourage market-making activities and ensure transparency. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/binance-humilated-on-china-tv-hong-kong-100k-crypto-workers-chinese-ai-unicorn-asia-express/\"><strong><em>HK needs 100K crypto workers, China’s AI unicorn</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-15T08:44:05.000Z",
    "title": "Short-term Bitcoin holders continue to capitulate",
    "url": "https://cryptoslate.com/insights/short-term-bitcoin-holders-continue-to-capitulate/",
    "description": "<p>Quick Take Short-term holders are anyone who has held Bitcoin for less than 155 days. Yesterday, June 14, short-term holders sent 17,000 Bitcoin to exchanges at a loss, one of the highest amounts this year. On a 7-day moving average, we are in a highly elevated level of capitulation. Looking at short-term holder supply, there [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/short-term-bitcoin-holders-continue-to-capitulate/\">Short-term Bitcoin holders continue to capitulate</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-15T08:59:00.000Z",
    "title": "Coinbase Pushes Back Against SEC’s Proposed Definition Change",
    "url": "https://cryptodaily.co.uk/2023/06/coinbase-pushes-back-against-secs-proposed-definition-change",
    "description": "<p>Coinbase has become the latest entity to push back against the United States Securities and Exchange Commission&rsquo;s proposed definition change.&nbsp;</p>\n<p>The SEC had moved to expand its definition of an exchange in 2022.&nbsp;</p>\nWhat&rsquo;s The SEC&rsquo;s Problem With Crypto?\n<p>The Securities and Exchange Commission has been relentless in its dogged pursuit of everything crypto. In its latest salvo, the regulatory body sued Coinbase in a New York federal court. In its lawsuit, the agency alleged that Coinbase acted as an unregistered broker and exchange and demanded that it be &ldquo;permanently restrained and enjoined&rdquo; from doing so. The lawsuit came just a day after the SEC had sued Binance, the world&rsquo;s largest cryptocurrency exchange, and its CEO, Changpeng Zhao. The SEC in its press release, stated,&nbsp;</p>\n\n<p>&ldquo;Since 2019, Coinbase has been engaging in an unregistered securities offering through its staking-as-a-service program, which allows customers to earn profits from the &ldquo;proof of stake&rdquo; mechanisms of certain blockchains and Coinbase&rsquo;s efforts.&rdquo;</p>\n\n<p>The crypto markets have been fairly nervous since the Securities and Exchange Commission filed a lawsuit against Binance and its CEO, Changpeng Zhao, just a day before its action against Coinbase. According to the SEC, Binance mishandled funds and lied to investors and regulators about operations, a claim Binance refutes.&nbsp;</p>\nCoinbase Demands Clarity&nbsp;\n<p>Coinbase has pushed back against the Securities and Exchange Commission, urging it to provide better clarity for the crypto industry. The SEC has responded to Coinbase&rsquo;s call for clarity, stating that it requires four months or 120 days to respond. The response comes after a barrage of court filings by both, Coinbase and the SEC. Coinbase had filed a writ of Mandamus against the regulatory body after it stated that it was &ldquo;in no hurry&rdquo; to respond to the exchange&rsquo;s demand for regulatory clarity. Coinbase had accused the agency of wilfully ignoring its request for immediate clarity. Prior to this, the SEC had responded to a previous petition stating that it would not give in to the exchange&rsquo;s demands.&nbsp;</p>\nSEC&rsquo;s Proposed Definition Change&nbsp;\n<p>In 2022, the Securities and Exchange Commission moved to expand its definition of an exchange. In April 2023, the agency reopened its comment period of the proposal, adding that this was needed as it planned to &ldquo;fold in DeFi and crypto.&rdquo; SEC Chair Gary Gensler stated that this would help address comments on proposals from market participants, particularly those associated with the crypto markets.&nbsp;</p>\n<p>Coinbase has been pushing back against the SEC, especially since the agency sued the exchange, alleging it was offering its users unregistered securities. In a letter to the SEC, Coinbase stated that it has no authority to ban an entire industry.&nbsp;</p>\n\n<p>&ldquo;As the Supreme Court has repeatedly held, an agency&rsquo;s authority to regulate a particular industry does not include the authority to ban that industry, absent clear Congressional authorization.&rdquo;</p>\n\n<p>Coinbase also criticized the SEC&rsquo;s decision to include crypto and DeFi under its planned exchanges definition. The updated definition also applies to more traditional market makers. The exchange stated that it was especially concerned with the proposal&rsquo;s potential impact on decentralized exchanges (DEX). In its letter to the SEC, the exchange stated,&nbsp;</p>\n\n<p>&ldquo;The proposed rule, as applied to DEXs, would be just such an impossible requirement. When creating a DEX, a software developer typically writes the code that creates the DEX and then publishes the code onto a public, permissionless blockchain, along with a mechanism for widely distributing the governance tokens that enable holders to alter select elements of the DEX going forward.</p>\n\nCriticism From All Quarters&nbsp;\n<p>The SEC&rsquo;s proposed exchange definition has come under heavy criticism from all quarters. Critics include the Blockchain Association, Paradigm, DeFi Education Fund (DEF), and Republicans from the House Financial Services Committee, some of whom have urged the SEC to withdraw the proposal. Paradigm stated that a DEX, particularly one using an automated market maker mechanism, does not involve any intermediary between buyers and sellers, adding that it used algorithms to balance crypto pools. It urged the agency to withdraw the proposal, stating,&nbsp;</p>\n\n<p>&ldquo;We write to request that the Commission withdraw its proposed redefinition of &lsquo;exchange&rsquo; and begin its consideration of how to adapt its regulations in the DeFi context anew &mdash; after rigorous economic analysis, genuine, broad engagement with the industry, and a close look at the limits of its statutory jurisdiction.&rdquo;</p>\n\n<p>Paradigm, the Blockchain Association, and Coinbase have also argued that the SEC has violated the Administrative Procedures Act (APA). The APA governs and guides how agencies devise and implement regulations.&nbsp;</p>\n\n<p>&ldquo;The rule change is vague and ambiguous, and the range of activities that may be captured within its scope are not yet fully fleshed out.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T09:07:57.000Z",
    "title": "Voyager App to Resume Customer Withdrawals, Initiating Recovery Process",
    "url": "https://www.cryptopolitan.com/voyager-app-withdrawals-recovery-process/",
    "description": "After a lengthy period of uncertainty, cryptocurrency brokerage Voyager Digital is set to reopen its app, granting customers the long-awaited ability to withdraw their funds. Almost a year after filing for Chapter 11 bankruptcy, the company has made significant strides toward financial recovery. With the Voyager app&#8217;s imminent update, customers will finally have visibility into ... <a title=\"Voyager App to Resume Customer Withdrawals, Initiating Recovery Process\" class=\"read-more\" href=\"https://www.cryptopolitan.com/voyager-app-withdrawals-recovery-process/\" aria-label=\"More on Voyager App to Resume Customer Withdrawals, Initiating Recovery Process\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-15T08:45:09.000Z",
    "title": "Shiba Inu Collapses: How Long Can The Meme Coin Climb Back Up?",
    "url": "https://www.newsbtc.com/news/shiba-inu-plunges-deeper/",
    "description": "Shiba Inu (SHIB) enthusiasts and investors find themselves at a crucial juncture as they seek to protect the coin from sinking below the lows witnessed in 2021 and the overall range lows.  The cryptocurrency experienced a significant drop earlier this week, plunging to $0.00000543, even breaching the 2021 lows of $0.00000510. This decline triggered worries and sparked debates among market participants, questioning whether SHIB has the potential to recover from its recent losses. However, all eyes are not solely fixated on SHIB&#8217;s price movements. Many are looking toward the US Federal Reserve for potential signals that could impact the future of this meme coin. The Fed&#8217;s actions and monetary policy decisions have far-reaching effects on the broader financial landscape, and cryptocurrencies are not immune to their influence. Shiba Inu Price Watch Amid Fed Deliberations Currently, there is a sense of optimism among central bank market observers, as they anticipate a likely dovish stance and a pause on rate hikes from the Fed. If this expectation materializes, it could potentially alleviate the negative sentiment surrounding the coin and provide a favorable environment for a reversal of recent losses.  Investors and supporters of the meme coin are hopeful that a more accommodative monetary policy from the central bank would contribute to renewed interest and confidence in SHIB, ultimately driving its price upwards. Shiba Inu is currently priced at $0.00000655 according to CoinMarketCap, experiencing a 3.73% slump in the last 24 hours and a significant decline of 17.5% over the past seven days. Source: CoinMarketCap Related Reading: Bitcoin Price Hammered Below $25,000 Amid Fed’s Hawkish Tone, SEC Lawsuits Shiba Inu statistics made available by IntoTheBlock shows that 93% of SHIB investors are currently experiencing a loss on their investments. Additionally, the data illustrates the grim truth of one of the most well-liked meme coins available. The data reveals that only 7% of Shiba Inu investors are, instead, turning a profit. 2% of users achieve financial break-even. Percentage of investors losing money on SHIB. Source: IntoTheBlock Meanwhile, if the Federal Reserve adopts a hawkish stance, it could pose further challenges for SHIB. A hawkish monetary policy, characterized by increasing interest rates and tightening of financial conditions, could potentially devalue the meme coin even more.  This scenario would present an uphill battle for SHIB bulls, making it increasingly difficult for them to defend the coin&#8217;s current price levels and instilling uncertainty regarding its future prospects. SHIB market cap slightly below $4 billion. Chart: TradingView.com Meme Coin Faces Selling Pressure  Over the past weekend, Shiba Inu witnessed a surge in selling pressure, as evidenced by a notable rise in supply on exchanges and trading volume. This uptick in activity suggests that more SHIB holders moved their tokens to exchanges with the intention of offloading them. SHIB seeing an increase in selling pressure. Source: Santiment Related Reading: Polkadot Ventures Into Bearish Zone: What’s The Next Move For DOT? However, as of the latest Shiba Inu update, the selling pressure has subsided, while the supply of SHIB outside of exchanges has seen a significant increase. This indicates a decrease in immediate selling activity and a rise in short-term accumulation, suggesting that some investors are taking advantage of the dip in SHIB&#8217;s price and choosing to buy. Despite this potential shift in sentiment among certain investors, the futures market has yet to display a clear bullish bias. The ratio between long positions (betting on price increases) and short positions (betting on price declines) has shown a minimal spread, implying that the price of SHIB could move in either direction in the near term. Featured image from The Motley Fool"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T08:47:33.000Z",
    "title": "Terra Luna Classic (LUNC) Skyrockets as v2.1.1 Parity Upgrade Sparks Investor Frenzy, Price Surges by 15%",
    "url": "https://www.crypto-news-flash.com/terra-luna-classic-lunc-skyrockets-as-v2-1-1-parity-upgrade-sparks-investor-frenzy-price-surges-by-15/?utm_source=rss&utm_medium=rss&utm_campaign=terra-luna-classic-lunc-skyrockets-as-v2-1-1-parity-upgrade-sparks-investor-frenzy-price-surges-by-15",
    "description": "The Joint L1 Task Force, which includes Terra Classic core developers, is ready for the v2.1.1 parity upgrade on the Terra Classic blockchain.  According to the StakeBin countdown timer, the upgrade will occur at block height 13215800. The Joint L1 Task Force (L1TF), comprising Terra Classic core developers, has recently declared its readiness for the [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-15T08:53:30.000Z",
    "title": "Tokens Considered Securities by the SEC (2019-2023)",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/tokens-considered-securities-by-the-sec-2019-2023/",
    "description": "<p>Recently, the SEC filed lawsuits against 18 cryptocurrencies. This included some well-known names. For example, Cardano (ADA), Polygon (MATIC), Solana (SOL), or The Cosmos Hub (ATOM). That&#8217;s on top of another 40+ lawsuits they already filed. So, let&#8217;s take a look at what tokens the SEC considers to be a security. Below is a picture [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/tokens-considered-securities-by-the-sec-2019-2023/\">Tokens Considered Securities by the SEC (2019-2023)</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-15T08:45:00.000Z",
    "title": "Arbitrum Bears Fight to Keep the Token Under $1- Here’s How",
    "url": "https://coinedition.com/arbitrum-bears-fight-to-keep-the-token-under-1-heres-how/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/arbitrum2-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/arbitrum2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/arbitrum2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/arbitrum2.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The native governance token of the Arbitrum (ARB) network had dropped below the $1 threshold. In a move that saw the price decrease by 6.78% in the last 24 hours, ARB exchanged hands at $0.92 at press time. Launched into the market on March 16, 2023, the Ethereum (ETH) L2 scaling solution distributed rewards in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/arbitrum-bears-fight-to-keep-the-token-under-1-heres-how/\">Arbitrum Bears Fight to Keep the Token Under $1- Here’s How</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]