[
  {
    "source": "CoinDesk",
    "date": "2023-07-21T11:49:57.000Z",
    "title": "SOL, XRP Lead Slide in Crypto Majors as Bitcoin Slips Below $30K",
    "url": "https://www.coindesk.com/markets/2023/07/21/sol-xrp-lead-slide-in-crypto-majors-as-bitcoin-slips-below-30k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Some selling pressure may have arisen from a revised U.S. bill that excludes a host of traditional securities from the \"digital asset\" category, which some say bodes ill for DeFi."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-21T12:01:07.000Z",
    "title": "‘Smart Wallet’ Provider Argent Launches NFT Marketplace Unframed on Starknet",
    "url": "https://decrypt.co/149493/smart-wallet-provider-argent-launches-nft-marketplace-unframed-starknet",
    "description": "The latest launch \"will push the boundaries of what NFT marketplaces can do,” said Argent co-founder Julien Niset."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-21T11:51:12.000Z",
    "title": "Cross-Chain Interoperability Got Easier on Cosmos With Wormhole Gateway",
    "url": "https://cryptobriefing.com/cross-chain-interoperability-wormhole-gateway/?utm_source=feed&utm_medium=rss",
    "description": "In a recent move to enhance blockchain interoperability, the Wormhole Foundation unveiled Wormhole Gateway, a Cosmos SDK-powered blockchain. The new launch intends to increase liquidity and broaden access within the..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-21T11:44:00.000Z",
    "title": "Caroline Ellison’s Diaries Expose Behind-The-Scenes At FTX",
    "url": "https://cryptodaily.co.uk/2023/07/caroline-ellison-diaries-expose-behind-the-scenes-at-ftx",
    "description": "<p>The recently uncovered personal diaries of Alameda Research CEO Caroline Ellison could be used as key evidence in the upcoming trial of FTX founder Sam Bankman-Fried.&nbsp;</p>\nEllison&rsquo;s Diaries Could Be Used In Court\n<p>The diaries, both handwritten and private Google documents, contain the rantings and ramblings of the 27-year-old CEO and will provide an insight into the events leading up to the FTX calamity. Bankman-Fried is facing charges of misusing billions of dollars from customer accounts, with eight counts of fraud and election law violations against him.</p>\n<p>As the CEO of FTX's sister concern Alameda Research, Caroline Ellison was a significant member of the SBF business empire. The New York Times has recently uncovered and reviewed her private Google docs, which have shed light on her mental state during the final months at FTX. The documents, previously unreported, reveal that she was going through a breakup with Sam Bankman-Fried and was plagued with self-doubt about her ability to lead Alameda Research effectively.</p>\nA Star Witness Against SBF\n<p>After the collapse of the FTX exchange, Ellison pleaded guilty to fraud charges and agreed to cooperate with authorities in building a case against Bankman-Fried. She is being considered a &ldquo;star witness&rdquo; primarily because of her close insight into the FTX ecosystem.&nbsp;</p>\n<p>Legal experts believe that Ellison's testimony could be the ace up the prosecution's sleeve in Bankman-Fried's trial. The power differential between Ellison and Bankman-Fried makes her a compelling voice, and her candid admissions could hold significant weight in the case against him.</p>\n<p>Other FTX executives, like Nishad Singh and Gary Wang, have also pleaded guilty and agreed to cooperate.</p>\nDoubting Her Abilities As CEO\n<p>The entries in Ellison's diaries revolve around her turbulent relationship with Bankman-Fried, the stress, anxiety, and how it affected her perception of Alameda and its work. She expressed feeling hurt and rejected during their toxic breakups, leading to a decreased excitement about Alameda, as it felt closely associated with him in a painful way. Moreover, she confessed to doubting her own abilities to justify her position at the company, feeling disadvantaged and unsure of her suitability for the role.</p>\nSBF Lost Confidence In Alameda\n<p>In April 2022, she wrote that a previous breakup with Bankman-Fried had significantly diminished her enthusiasm about Alameda. Court records show that during this time, Bankman-Fried invested over $400 million in Modulo Capital, a trading company led by someone he had previously dated, indicating his waning faith in Alameda Research. Ellison's writings revealed jealousy and resentment toward Modulo, as she felt sidelined.</p>\n<p>Sam Bankman-Fried's trial is scheduled to begin in October in Manhattan. As the proceedings approach, all eyes are on Caroline Ellison and the potential impact of her testimony in bringing the accused founder to justice.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T12:03:26.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T12:00:44.000Z",
    "title": "Tether & Bitcoin Holders Overwhelmingly Buying TOADS Despite USDT Depegging Over Fake Rumors",
    "url": "https://www.crypto-news-flash.com/tether-bitcoin-holders-overwhelmingly-buying-toads-despite-usdt-depegging-over-fake-rumors/?utm_source=rss&utm_medium=rss&utm_campaign=tether-bitcoin-holders-overwhelmingly-buying-toads-despite-usdt-depegging-over-fake-rumors",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T105357.243.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T105357.243.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T105357.243-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T105357.243-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Amidst market uncertainties and rumors involving Tether (USDT), there has been a notable rise in the yield of the new DigiToads (TOADS). An inflow of Bitcoin (BTC) and Tether holders are increasingly participating in the live DigiToads presale, overwhelmingly purchasing the TOADS coin. These investors are attracted to the promising prospects offered by DigiToads, which [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-21T11:57:59.000Z",
    "title": "IQ Protocol NFT Rentals A Big Success",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/iq-protocol-nft-rentals-a-big-success/",
    "description": "<p>The IQ Protocol is a web3 platform that let users can rent NFTs in an organic way. Also, P2E game studios and creators can increase profits &#38; incentivize players. Also, it attracts new audiences by leveraging their NFTs. Their first experiment with NFT rentals is a huge success with over 8000 NFTs rented in only [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/iq-protocol-nft-rentals-a-big-success/\">IQ Protocol NFT Rentals A Big Success</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-21T11:45:38.000Z",
    "title": "Billionaire Mike Novogratz Says He’s Now More Bullish on Bitcoin Than He Was Six Months Ago – Here’s Why",
    "url": "https://dailyhodl.com/2023/07/21/billionaire-mike-novogratz-says-hes-now-more-bullish-on-bitcoin-than-he-was-six-months-ago-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Than-He-Was.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Than-He-Was.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Than-He-Was.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Than-He-Was.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Than-He-Was.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Than-He-Was.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Than-He-Was.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Galaxy Digital CEO Mike Novogratz says that his bullish outlook on Bitcoin (BTC) has only strengthened in the last six months. In a new CNBC interview, Novogratz says that steady retail trading so far in 2023 and the possibility of spot Bitcoin exchange-traded funds (ETFs) makes him even more confident in his bullish position on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/21/billionaire-mike-novogratz-says-hes-now-more-bullish-on-bitcoin-than-he-was-six-months-ago-heres-why/\">Billionaire Mike Novogratz Says He’s Now More Bullish on Bitcoin Than He Was Six Months Ago – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]