[
  {
    "source": "CoinDesk",
    "date": "2023-09-05T19:41:21.000Z",
    "title": "‘Ethereum Supreme Court’ Mooted by Blockchain Executive as Alternative to ‘Code Is Law’",
    "url": "https://www.coindesk.com/tech/2023/09/05/ethereum-supreme-court-mooted-by-blockchain-executive-as-alternative-to-code-is-law/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A proposal from Matter Labs co-founder Alex Gluchowski would see a “hierarchical system of on-chain courts” arbitrate on-chain disputes."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T19:47:03.000Z",
    "title": "Regulated Liability Network identifies proof-of-concept case with digital pound ",
    "url": "https://cointelegraph.com/news/regulated-liability-network-identifies-proof-of-concept-digital-pound",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/42eebbc3-199b-4d17-8d03-ac5f537a531e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The RLN, which places tokenized assets and liabilities on the same ledger, was tested with simulated cross-border CBDC transactions in a previous project. </p>\n                    <p><p>The Regulated Liability Network (RLN) has completed its United Kingdom discovery phase and is prepared to proceed to a use case with retail central bank digital currency (CBDC), according to its latest report. The RLN project seeks to accommodate central bank, commercial bank and regulated non-bank transactions operating within “partitions” on a single network.</p><p>The RLN is a regulated financial marketplace infrastructure in the U.K. with contributors from financial institutions worldwide. It is supported by the advocacy group UK Finance.</p><p>The RLN discovery phase examined three potential use cases for the network — consumer domestic payment, wholesale cross-border payment and securities settlement — and settled on the first case to pursue a proof of concept. The report <a href=\"https://www.ukfinance.org.uk/system/files/2023-09/Regulated%20Liability%20Network%20-%20UK%20Discovery%20Phase%20.pdf\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> many domestic payment uses that could be tested and <a href=\"https://cointelegraph.com/news/uk-cbdc-closer-after-project-rosalind-tests\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/uk-cbdc-closer-after-project-rosalind-tests/amp\">cited the list presented</a> in the results of Project Rosalind as examples. The report said: </p><blockquote>“This use case would help explore how ‘upgraded’ commercial bank money could sit alongside a retail CBDC, how RLN could accommodate both forms of money on a single infrastructure, and how the functional equivalence of all retail digital money could be ensured.”</blockquote><p>The report found that the RLN provided several benefits for domestic payment. It helped provide consistency between CBDC and commercial bank money, thus helping preserve the singularity of the currency. It could also help reduce authorized push payment fraud, that is, payments authorized to fraudulent merchants, and give consumers more control in case of undelivered goods. Finally, it would also improve settlement time.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/5e79cc67-72ea-4602-81ca-e338261496be.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Flow chart for a consumer domestic settlement on RLN. Source: UK Finance</em></figcaption></figure><p>The RLN would use a native settlement token and thus contain tokenized regulated money and digital assets on the same ledger. Tokenized liabilities (money) would remain claims on the issuer, rather than on the RLN.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/swift-says-it-has-reached-a-breakthrough-in-recent-cbdc-experiments\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/swift-says-it-has-reached-a-breakthrough-in-recent-cbdc-experiments/amp\">SWIFT says it has reached a ‘breakthrough’ in recent CBDC experiments</a></em></strong></p><p>The project <a href=\"https://cointelegraph.com/news/ny-fed-banks-wrap-up-regulated-liabilities-network-proof-of-concept-using-wcbdc\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ny-fed-banks-wrap-up-regulated-liabilities-network-proof-of-concept-using-wcbdc/amp\">completed a pilot program</a> for wholesale cross-border payments in conjunction with the New York Federal Reserve Bank and several large financial institutions earlier this year. Now, however, it says this particular use case “may be the least feasible for a PoC [proof of concept] due to the complexity of dealing with multiple jurisdictions, participants (including central banks) and regulatory requirements.” </p><p>Securities settlement was judged to have a medium degree of feasibility due to the multiple non-bank parties involved and regulatory complexity. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The UK Regulated Liability Network, a blockchain network for interbank payments and other digital assets, plans to experiment with a retail digital pound backed by commercial bank money or tokenized deposits  <a href=\"https://t.co/HiGqfQz67I\">https://t.co/HiGqfQz67I</a><br>...<a href=\"https://twitter.com/hashtag/UK?src=hash&ref_src=twsrc%5Etfw\">#UK</a> <a href=\"https://twitter.com/hashtag/DigitalPound?src=hash&ref_src=twsrc%5Etfw\">#DigitalPound</a> <a href=\"https://twitter.com/hashtag/Tokenization?src=hash&ref_src=twsrc%5Etfw\">#Tokenization</a> <a href=\"https://twitter.com/hashtag/Fintech?src=hash&ref_src=twsrc%5Etfw\">#Fintech</a> <a href=\"https://t.co/BUyoMtyfA6\">pic.twitter.com/BUyoMtyfA6</a></p>— Digital Pound Foundation (@digitalpoundfdn) <a href=\"https://twitter.com/digitalpoundfdn/status/1698999722390806652?ref_src=twsrc%5Etfw\">September 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The RLN does not crucially depend on blockchain technology. The report identifies five infrastructure architectures that it could operate on. The RLN closely resembles <a href=\"https://cointelegraph.com/news/bis-releases-unified-ledger-proposal-cross-border-tokenized-asset-transactions\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bis-releases-unified-ledger-proposal-cross-border-tokenized-asset-transactions/amp\">the “unified ledger” solution proposed</a> by the Bank of International Settlements and the International Monetary Fund’s “trusted single ledger,” <a href=\"https://cointelegraph.com/news/imf-new-class-cross-border-payment-platform-single-ledger\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/imf-new-class-cross-border-payment-platform-single-ledger/amp\">also introduced in June</a>. The report’s authors also <a href=\"https://cointelegraph.com/news/swiss-central-bank-announces-plans-wholesale-cbdc-pilot-with-real-money-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/swiss-central-bank-announces-plans-wholesale-cbdc-pilot-with-real-money-report/amp\">noted the project’s resemblance</a> to a pilot conducted by the Swiss National Bank and the SIX digital exchange, and Bank of England governor Andrew Bailey’s <a href=\"https://cointelegraph.com/news/boe-governor-trashes-crypto-stablecoins-in-favor-of-enhanced-digital-money\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/boe-governor-trashes-crypto-stablecoins-in-favor-of-enhanced-digital-money/amp\">proposed “enhanced digital money.”</a></p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-home-loan-bitcoin-mortgage-risky/\">Home loans using crypto as collateral: Do the risks outweigh the reward?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T19:46:50.000Z",
    "title": "MetaMask unleashes game-changing Ether cash-out feature",
    "url": "https://www.cryptopolitan.com/metamask-unleashes-ether-cash-out-feature/",
    "description": "MetaMask, a popular cryptocurrency wallet, made a significant announcement on September 5th, revealing the launch of a new feature that enables users to easily sell their Ether (ETH) holdings for fiat currency. This move represents a notable development in the cryptocurrency space, as it simplifies the process of converting digital assets into traditional money. The ... <a title=\"MetaMask unleashes game-changing Ether cash-out feature\" class=\"read-more\" href=\"https://www.cryptopolitan.com/metamask-unleashes-ether-cash-out-feature/\" aria-label=\"More on MetaMask unleashes game-changing Ether cash-out feature\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T19:42:25.000Z",
    "title": "Investors Eye Promising AI Stocks Under $50 as Adoption Accelerates",
    "url": "https://www.cryptopolitan.com/investors-eye-promising-ai-stocks-under-50/",
    "description": "In a world driven by technological advancements, artificial intelligence (AI) has emerged as a key player across various industries. As the demand for AI-powered solutions continues to rise, investors are eyeing opportunities to capitalize on the growth of AI companies. In this article, we delve into the realm of AI investments, presenting the top 10 ... <a title=\"Investors Eye Promising AI Stocks Under $50 as Adoption Accelerates\" class=\"read-more\" href=\"https://www.cryptopolitan.com/investors-eye-promising-ai-stocks-under-50/\" aria-label=\"More on Investors Eye Promising AI Stocks Under $50 as Adoption Accelerates\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-05T20:02:50.000Z",
    "title": "Visa tests USDC settlement payments on Solana blockchain",
    "url": "https://crypto.news/visa-tests-usdc-settlement-payments-on-solana-blockchain/",
    "description": "Visa recently announced its initiative to experiment with USDC settlement payments via the Solana blockchain. In a press release, Visa claimed it would allow USDC settlement payments through the Solana blockchain on Sept. 5. The company will facilitate these USDC-denominated&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-05T19:53:32.000Z",
    "title": "What is SafePal and why its token SFP surged by 36% in one month",
    "url": "https://crypto.news/what-is-safepal-and-why-its-token-sfp-surged-by-36-in-one-month/",
    "description": "SafePal&#8217;s native token SFP is up nearly 40% in one month, driven by strategic partnerships and soaring trading volume. SFP, the native token of the crypto wallet platform SafePal, is experiencing a remarkable uptick in value. At the time of&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-05T20:00:21.000Z",
    "title": "44.2% Of Ethereum Holders Now In Loss, Is This The Bottom?",
    "url": "https://www.newsbtc.com/news/ethereum/44-2-ethereum-holders-now-loss-the-bottom/",
    "description": "On-chain data shows that 44.2% of all Ethereum investors are now carrying their coins at a loss, a sign that the bottom may be close for the asset. Ethereum Percentage Of Holders In Loss Has Surged Recently According to data from the market intelligence platform IntoTheBlock, the percentage of ETH investors in loss has grown sharply since early July. The relevant indicator here is the firm&#8217;s &#8220;Historical In/Out of the Money,&#8221; which tells us about the percentage of Ethereum investors in profits and losses and those that are just breaking even. The metric determines whether an investor is in profit or loss by looking at their address history to check for the average price at which they acquired their coins. Naturally, if the asset&#8217;s current spot price is less than a holder&#8217;s cost basis, then that particular holder is carrying their coins at a net profit. Similarly, the cost basis being equal to and less than the spot price would imply that the investor is breaking even on their investment and holding at a loss, respectively. Related Reading: Bitcoin Exchanges See Three Straight Months Of Withdrawals For First Time Ever Now, here is a chart that shows the trend in the Historical In/Out of the Money indicator for Ethereum over the past few years: The value of the metric seems to have been going up in recent weeks &#124; Source: IntoTheBlock on X IntoTheBlock has only listed the data for the Ethereum investors in losses, as this is the number of interest in the current discussion. The combined percentage of the investors breaking even and carrying profits can also be deduced from this value, as the total percentage must add up to 100%. In early July, Ethereum holders underwater were at about 27%. It&#8217;s visible in the graph, however, that the indicator has observed a notable uplift since then, as the price of the cryptocurrency has registered a drawdown. Today, the indicator&#8217;s value is at 44.2%, meaning that almost half of the Ethereum user base is holding their coins at losses. Generally, the more the investors get into profits, the more likely they become to sell to harvest those gains. Due to this reason, corrections in the asset become more probable to form whenever an extreme majority of the market is enjoying profits. A large percentage of the holders being in losses instead, however, can have the opposite effect on the price since they can lead towards bottoms as profit sellers become exhausted. Related Reading: This Could Be The Metric To Watch For A Bitcoin Bounce: Santiment Since the start of the bear market last year, the highest the metric&#8217;s value has gone is 50%, implying that exactly half of the investors had been in losses back then. This value isn&#8217;t too far off from the current one, suggesting that Ethereum may be close to forming a bottom. If a similar loss percentage is hit with the bottom this time, ETH would first suffer from some more downtrend so that enough investors drop underwater. ETH Price Ethereum has continued to move flat recently; as of this writing, it trades at about $1,600. Looks like ETH is still struggling to find any volatility &#124; Source: ETHUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, IntoTheBlock.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-05T20:00:50.000Z",
    "title": "Analyst Who Nailed 2018 Bitcoin Bottom Predicts BTC Rally Above $32,000 – But There’s a Catch",
    "url": "https://dailyhodl.com/2023/09/05/analyst-who-nailed-2018-bitcoin-bottom-predicts-btc-to-rally-above-32000-but-theres-a-catch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/btc-rallies-about-catch.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/btc-rallies-about-catch.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/btc-rallies-about-catch.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/btc-rallies-about-catch.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/btc-rallies-about-catch.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/btc-rallies-about-catch.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/btc-rallies-about-catch.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A trader who nailed the lowest price of Bitcoin&#8217;s (BTC) 2018 bear market says the crypto king is preparing to take out this year&#8217;s highs. In a new video, pseudonymous analyst Bluntz tells his 224,500 followers on the social media platform X that BTC is likely to witness more corrective moves before regaining its bullish [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/05/analyst-who-nailed-2018-bitcoin-bottom-predicts-btc-to-rally-above-32000-but-theres-a-catch/\">Analyst Who Nailed 2018 Bitcoin Bottom Predicts BTC Rally Above $32,000 – But There’s a Catch</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-05T19:55:37.000Z",
    "title": "Investors Turn Hesitant on Crypto After Grayscale Victory Optimism Fades Away: Analytics Firm Glassnode",
    "url": "https://dailyhodl.com/2023/09/05/investors-turn-hesitant-on-crypto-after-grayscale-victory-optimism-fades-away-analytics-firm-glassnode/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Nearly-200-in-Ethereum.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Nearly-200-in-Ethereum.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Nearly-200-in-Ethereum.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Nearly-200-in-Ethereum.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Nearly-200-in-Ethereum.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Nearly-200-in-Ethereum.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Nearly-200-in-Ethereum.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Analytics firm Glassnode says signals are suggesting that the initial optimism surrounding digital asset manager Grayscale&#8217;s victory over the U.S. Securities and Exchange Commission (SEC) has waned, taming investors&#8217; risk appetite. Last week, a federal judge ruled that the SEC has to reconsider Grayscale’s application to launch exchange-traded fund based on Bitcoin Trust. While crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/05/investors-turn-hesitant-on-crypto-after-grayscale-victory-optimism-fades-away-analytics-firm-glassnode/\">Investors Turn Hesitant on Crypto After Grayscale Victory Optimism Fades Away: Analytics Firm Glassnode</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]