[
  {
    "source": "Cointelegraph",
    "date": "2023-08-28T06:17:05.000Z",
    "title": "Weekend Wrap: Bitcoin could return to $10K, warns McGlone, Aptos buddies with Lotte and more",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-on-the-weekend",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/49ce4f13-5053-4197-842f-530122a6b860.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bloomberg Intelligence’s Mike McGlone thinks we may be in for a \"global economic reset\" that could send Bitcoin down to $10,000.</p>\n                    <p><h3>‘Global economic reset’ could push Bitcoin to 2020 levels</h3><p>A potential “global economic reset” could see the price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) pushed down to a level not seen since mid-2020, according to Bloomberg Intelligence senior macro strategist Mike McGlone.</p><p>On Aug. 25, McGlone <a href=\"https://www.youtube.com/watch?v=wKVsSetMHQA\" target=\"_blank\" rel=\"noopener nofollow\">spoke</a> to Kitco News suggesting that troubling economic indicators from China reportedly show signs its economy is slowing down — which could be the catalyst for the next big global bust.</p><blockquote class=\"twitter-tweet\"><p lang=\"zxx\" dir=\"ltr\"><a href=\"https://t.co/UJN4NtW7HT\">https://t.co/UJN4NtW7HT</a></p>&mdash; Mike McGlone (@mikemcglone11) <a href=\"https://twitter.com/mikemcglone11/status/1695071698075193446?ref_src=twsrc%5Etfw\">August 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>He said such a potential disaster could push the price of Bitcoin down to $10,000.</p><blockquote>“Bitcoin was hovering around $10,000 before the big pump of liquidity. I know things have changed, I know on-chain metrics have increased but there's a potential we can easily get back there if we get the reset I think we're going to get.”</blockquote><p>McGlone added he’s looking at Bitcoin as a leading indicator for most risk assets and even if Bitcoin drops to $10,000 it's “still probably the best-performing asset ever — so that to me is a problem.” </p><p>He said what caused Bitcoin’s past performance was a zero-interest rate environment, however, he still holds some hope it will hit $200,000 unless “we get the global economic reset I think we're going to get.”</p><h3>Aptos grows partnerships by a Lotte</h3><p>Layer-1 blockchain Aptos Network has announced a partnership with Daehong Communications, the marketing business owned by the multi-industry conglomerate Lotte Group.</p><p>In Aug. 26 post, Aptos said the partnership is focused on providing the back end for “Super Jelly” a reward system tied to Daehong’s nonfungible token (NFT) collection Bellygom and its upcoming online virtual world Bellyland.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">PARTNERSHIP ANNOUNCEMENT  <br><br>We are happy to announce the partnership with <a href=\"https://twitter.com/Aptos_Network?ref_src=twsrc%5Etfw\">@Aptos_Network</a> <br><br>Stay tuned for a whole brand new experience by Aptos &amp; Lotte on the Bellygom ecosystem!  <a href=\"https://t.co/8CdtATBSOg\">https://t.co/8CdtATBSOg</a></p>&mdash; daehong_official (@Daehongofficial) <a href=\"https://twitter.com/Daehongofficial/status/1695251430725357941?ref_src=twsrc%5Etfw\">August 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Aptos’ mainnet will host the rewards that are earned through playing various games in Bellyland.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ About BellyLand<br>BellyLand is made of 12 mystical-themed areas. Adorable Bellygom is ready to play with you every night&amp;day in BellyLand. I’m not just saying, Bellygom might be snoring at night and taking selfies during the day. Also, BellyLand is more beautiful at night! <a href=\"https://t.co/RfDVT95Kdd\">pic.twitter.com/RfDVT95Kdd</a></p>&mdash; Bellygom NFT (@bellygom_nft) <a href=\"https://twitter.com/bellygom_nft/status/1695248524856938598?ref_src=twsrc%5Etfw\">August 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>It hinted the work with Daehong was a starting point and the partnership could see Aptos “explore Web3 innovation across many areas of the Lotte business network.”</p><h3>Roll up! Roll up! — ETH layer 2’s process 5x more than Ethereum mainnet</h3><p>Ethereum’s layer-2 blockchains have scaled the layer-1 network by over five times in the past week, according to L2Beat <a href=\"https://l2beat.com/scaling/activity\" target=\"_blank\" rel=\"noopener nofollow\">data</a>.</p><p>Crypto education YouTuber Patrick Scott first highlighted the change in an Aug. 26 X (Twitter) post and said the scaling factor grew from under 1 times to 5.2 times in under a year.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">From a scaling factor of under 1 to 5.25X in 1 year, Layer 2 Rollups, now process 5X the transactions of Ethereum mainnet.<br><br>In another year, this comparison won&#39;t even make sense as Layer 2s will process so many magnitudes more transactions. <a href=\"https://t.co/3xkpJM3Uc0\">pic.twitter.com/3xkpJM3Uc0</a></p>&mdash; Patrick | Dynamo DeFi (@Dynamo_Patrick) <a href=\"https://twitter.com/Dynamo_Patrick/status/1695721677735260184?ref_src=twsrc%5Etfw\">August 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“In another year, this comparison won't even make sense as Layer 2s will process so many magnitudes more transactions,” Scott added.</p><p><a href=\"https://cointelegraph.com/learn/a-beginners-guide-on-blockchain-layer-2-scaling-solutions\">Layer 2’s</a> such as Polygon or <a href=\"https://cointelegraph.com/news/coinbase-base-network-first-seven-days-of-onchain-summer\">Coinbase’s Base</a> bundle thousands of transactions for processing on Ethereum to ensure they’re immutably recorded with many boasting higher transactions per second and lower fees compared to Ethereum.</p><p>According to L2Beat the largest L2 was Arbitrum with a nearly 56% market share, followed by Optimisims OP Mainnet at 26% and zkSync Era at 4.2%.</p><h3>Scams using verified accounts are 'out of control,' warns ZachXBT</h3><p>Blockchain sleuth ZachXBT has raised the alarm over copycat verified organizations on X, which are “out of control” posting phishing links to fool unsuspecting users.</p><p>In an Aug. 27 post, ZachXBT shared an image of 12 X-verified organizations that were made in the past two days — all impersonations of legitimate crypto projects including Lido, Friend.tech, Synthetix and ApeCoin (<a href=\"https://cointelegraph.com/apecoin-ape-price-index\">APE</a>). </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Hello <a href=\"https://twitter.com/X?ref_src=twsrc%5Etfw\">@x</a> <a href=\"https://twitter.com/premium?ref_src=twsrc%5Etfw\">@premium</a> the phishing scam spam from fake verified orgs on Twitter has gotten out of control. <br><br>These 12 accounts are all just from the past 48 hrs alone.<br><br>Verified orgs were intended to make it harder for scammers but it has just created a new black market for accounts… <a href=\"https://t.co/cppyD5cUSj\">pic.twitter.com/cppyD5cUSj</a></p>&mdash; ZachXBT (@zachxbt) <a href=\"https://twitter.com/zachxbt/status/1695929732158636422?ref_src=twsrc%5Etfw\">August 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Twitter changed its <a href=\"https://cointelegraph.com/news/elon-musk-twitter-blue-rebrand-x-premium\">verification system</a> following Elon Musk’s purchase of the platform moving to a paid verification system that allows businesses to pay $1,000 per month for a gold checkmark.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-community-biden-crypto-tax-reporting-rules\"><strong><em>Crypto community reacts to Biden’s proposed crypto tax reporting rules</em></strong></a></p><p>Musk <a href=\"https://twitter.com/elonmusk/status/1684089506394263553\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> the subscription cost was to “make it expensive for scammers to create millions of accounts.”</p><p>It’s unclear how the fake accounts are proliferating but ZachXBT has <a href=\"https://twitter.com/zachxbt/status/1695930992484114795\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the alleged scammers buy the already-verified accounts on Telegram.</p><p>X <a href=\"https://help.twitter.com/en/using-twitter/verified-organizations\" target=\"_blank\" rel=\"noopener nofollow\">says</a> to qualify for the gold tick an organization must give a matching active account, organization email, address and website domain.</p><p>“Verified orgs were intended to make it harder for scammers but it has just created a new black market for accounts with no way for us to report and take down these accounts easily,” ZachXBT added.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/recursive-inscriptions-bitcoin-supercomputer-defi-aws-possible/\"><strong><em>Recursive inscriptions — Bitcoin ‘supercomputer’ and BTC DeFi coming soon</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-28T06:30:44.000Z",
    "title": "Shibarium Is Live And Scaling, What’s Ahead For Shiba Inu Price?",
    "url": "https://www.newsbtc.com/news/ethereum/shibarium-is-live-scaling-whats-ahead-shiba-inu-price/",
    "description": "In a new blog post today, Shytoshi Kusama, the lead developer of Shiba Inu, announced that Shibarium is now live and scaling optimally. Kusama stated, &#8220;Shibarium is LIVE and operating well! Now that we&#8217;ve proven that all funds are safu (as we said), and that Shibarium is ready for prime time, we will reopen our channels.&#8221; As per the latest statistics, the network has already amassed over 65,000 wallets and has processed 350,000 transactions. The diversity of tokens deployed on Shibarium is evident, with Kusama noting a mix of &#8220;fun, unusual, and sometimes offensive tokens.&#8221; He optimistically added, &#8220;Within these thousands of tokens, we will see which will rise to the top.&#8221; Kusama also took a moment to reflect on the resilience and determination of the Shiba Inu community, quoting Ryoshi, &#8220;Those who build in the bear market, will win in the bull market.&#8221; He expressed profound gratitude to the Polygon team, specifically mentioning Sandeep Naiwal, for their unwavering support during challenging times. “Quickly after the incident began, I called Sandeep from Polygon directly and without a second thought, he helped provide additional resources to ensure a perfect outcome to the situation,&#8221; Kusama revealed. The SHIB lead dev also highlighted that it is by design that the SHIB, Leash, WEth withdrawals through the bridge take at least 2 checkpoints (45 minutes to 3 hours), and BONE withdrawal will take up to 7 days. Related Reading: Shibarium Launch Proves Positive As Shiba Inu-Based BONE Celebrates New Milestone According to data from Shibariumscan.io, the network processed 132,739 transactions on August 25, marking its highest activity since its public restart on August 24. However, the network did experience a decline in transactions over the weekend, recording 78,870 transactions on Saturday and 40,433 on Sunday. It&#8217;s worth noting that Shibarium&#8217;s initial launch on August 16 encountered issues that halted block production. However, the team appears to have resolved these issues, setting the stage for what could be a transformative period for the Shiba Inu ecosystem. SHIB Price Analysis The Shiba Inu token (SHIB) has been on a rollercoaster ride, especially in the wake of Shibarium&#8217;s initial troubled launch. After reaching a 4-month high of $0.00001134 on August 12, the token&#8217;s price plummeted. Currently, SHIB is trading below all major daily moving averages, with the 50-day EMA acting as a formidable resistance level. Related Reading: Shiba Inu Whale Buys 708 Billion SHIB, Sparks Speculation Of Price Recovery Over the past 11 days, there have been three failed attempts to break above the 50-day EMA. This has led to a series of five red daily candles, indicating bearish sentiment. Most recently, SHIB fell below the 61.8% Fibonacci retracement level at $0.00000805. At press time, SHIB stood at $0.00000795. The relaunch of Shibarium could serve as a catalyst for SHIB&#8217;s price. With new use cases and potential for increased SHIB burns, the bulls may find new strength in the coming days. However, the path to recovery is fraught with resistance levels that need to be overcome. These include the 61.8% Fibonacci level at $0.00000805, the area between the 100-day EMA at $0.00000867 and the 50% Fibonacci level at $0.00000869, and further up, the 200-day EMA at $0.00000932 and the 38.2% Fibonacci level at $0.00000931. In summary, while the successful relaunch of Shibarium is a positive development, SHIB&#8217;s price has multiple hurdles to clear before a bullish trend can be confirmed. The coming days will be crucial in determining whether Shibarium&#8217;s operational success can translate into upward momentum for SHIB. Featured image from Shiba Inu Ecosystem, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-28T06:32:11.000Z",
    "title": "Enjin Coin (ENJ) Holders Seek Refuge in an Upcoming Meme Coin Amidst Market Uncertainty",
    "url": "https://www.crypto-news-flash.com/enjin-coin-enj-holders-seek-refuge-in-an-upcoming-meme-coin-amidst-market-uncertainty/",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-93.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-93.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-93-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-93-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto market is as volatile as ever, as we lead up to the next bull run. This market uncertainty has left many investors wondering what their next move must be. You don&#8217;t want to make any move that wouldn&#8217;t yield profits. The case is similar for Enjin Coin (ENJ) holders as they seek a [...]"
  }
]