[
  {
    "source": "Decrypt",
    "date": "2023-12-04T19:01:28.000Z",
    "title": "Bitcoin Funds Bloated With Cash as Investors Rush In",
    "url": "https://decrypt.co/208531/bitcoin-funds-bloated-investors-rush-in",
    "description": "Crypto investment funds have received their biggest 10-week inflows since the October 2021 bull run. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-04T18:59:39.000Z",
    "title": " Coinbase initiative announces crypto-themed US presidential forum ",
    "url": "https://cointelegraph.com/news/coinbase-crypto-presidential-forum",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZDM5MmJlNDUtNzM4Yy00ZWEwLWJkZjUtZjM3YjBiMDQ2MTNhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Presidential candidates Asa Hutchinson, Vivek Ramaswamy and Dean Phillips will discuss blockchain and crypto ahead of the New Hampshire Primary.</p>\n                    <p><p >The ‘Stand With Crypto’ campaign launched by cryptocurrency exchange Coinbase plans to bring candidates for the 2024 United States Presidential Election together to discuss blockchain technology and digital assets.</p><p >According to its website as of Dec. 4, Stand With Crypto <a href=\"https://twitter.com/standwithcrypto/status/1730693103210635302\" target=\"_blank\" rel=\"noopener nofollow\">confirmed</a> that Republican candidates Asa Hutchinson and Vivek Ramaswamy, as well as Democratic candidate Dean Phillips, will appear in person in New Hampshire on Dec. </p><p >“This special opportunity allows you to hear from each presidential candidate and will provide candidates with a venue to address the crypto and blockchain community in New Hampshire,” said Stand With Crypto. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We are excited to announce the first-ever Crypto Presidential Forum!<br><br>Join us in New Hampshire to hear directly from candidates about their positions on crypto policy and a wide range of other topics. <br><br>Local leaders will also be… <a href=\"https://t.co/B5fqd5TlfE\">pic.twitter.com/B5fqd5TlfE</a></p>&mdash; Stand With Crypto️ (@standwithcrypto) <a href=\"https://twitter.com/standwithcrypto/status/1730693103210635302?ref_src=twsrc%5Etfw\">December 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p >On Jan. </p><p >At the time of publication, polls suggested that President Biden was most likely to face Trump in 2024, with the former president double digits <a href=\"https://projects.fivethirtyeight.com/polls/president-primary-r/2024/national/\" target=\"_blank\" rel=\"noopener nofollow\">ahead</a> of DeSantis, Haley, and Ramaswamy — roughly 58% to their 5%-13%. 1 Quinnipiac poll <a href=\"https://poll.qu.edu/poll-release?releaseid=3881\" target=\"_blank\" rel=\"noopener nofollow\">showed</a> RFK Jr. </p><p ><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ftx-sam-bankman-fried-sbf-offer-donald-trump-not-to-run-president\"><strong><em>FTX founder mulled giving Trump $5B not to run for president, says author</em></strong></a></p><p >It’s unclear whether the Dec. and Ramaswamy, have <a href=\"https://cointelegraph.com/news/vivek-ramaswamy-unveils-cryptocurrency-policy-platform-criticizing-mixer-sanctions\">made digital assets</a> one of the key issues in their campaigns, but frontrunners Biden and Trump rarely speak publicly on crypto and blockchain.</p><p >In El Salvador, former President Nayib Bukele resigned his position on Dec. Bukele advocated for the Central American nation to adopt Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) as legal tender and has <a href=\"https://cointelegraph.com/news/el-salvador-bitcoin-portfolio-swings-profit\">been behind multiple buys</a> of the cryptocurrency for the government</p><p><a href=\"https://cointelegraph.com/news/coinbase-crypto-presidential-forum\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-04T18:55:49.000Z",
    "title": "Bitcoin miner Riot Platforms gears up for halving with strategic $290M hardware investment",
    "url": "https://cryptoslate.com/bitcoin-miner-riot-platforms-gears-up-for-halving-with-strategic-290m-hardware-investment/",
    "description": "<p>Texas-based Bitcoin (BTC) miner Riot Platforms secured its largest-ever order of hash rate through the acquisition of 66,560 units of BTC miners, representing 18 EH/s, from MicroBT for $290.5 million, according to a Dec. 4 statement. Riot furthered that it also obtained options to acquire 265,000 additional miners from MicroBT, which would add up to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-miner-riot-platforms-gears-up-for-halving-with-strategic-290m-hardware-investment/\">Bitcoin miner Riot Platforms gears up for halving with strategic $290M hardware investment</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-12-04T18:52:24.000Z",
    "title": "Pro-XRP Lawyer John Deaton Reveals Being Invested 10x More Heavily in Bitcoin than XRP",
    "url": "https://www.cryptoglobe.com/latest/2023/12/pro-xrp-lawyer-john-deaton-reveals-being-invested-10x-more-heavily-in-bitcoin-than-xrp/",
    "description": "Introduction to Key Industry Figures and Their Interactions In a series of engaging discussions on the social media platform X (formerly Twitter), several prominent figures in the crypto space shared insights and opinions that shed light on personal investment strategies, legal battles, and the impact on the broader crypto industry. Caitlin Long’s Praise for John […]\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-04T19:02:38.000Z",
    "title": "Terraform Labs highlights SEC’s potential sanction in Do Kwon’s case",
    "url": "https://crypto.news/terraform-labs-highlights-secs-potential-sanction-in-do-kwons-case/",
    "description": "The legal team of Terraform Labs and its founder, Do Kwon, has drawn attention to a potential sanction threat against the SEC by a Utah federal judge. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-04T19:00:00.000Z",
    "title": "Crypto Analyst Says It’s “Not Too Late” To Buy Ethereum, Here’s Why",
    "url": "https://www.newsbtc.com/news/ethereum/crypto-analyst-not-too-late-buy-ethereum-why/",
    "description": "A crypto analyst has explained how the range around $2,000 could become a major Ethereum support base for years, making it not too late to buy ETH right now. 43.8 Million Ethereum Was Acquired Between $1,900 And $2,100 In a new post on X, analyst Ali has discussed about why Ethereum could still be worth getting into at this point. The analyst has cited data from the market intelligence platform IntoTheBlock to explain this, referring to the on-chain acquisition distribution of the cryptocurrency. The data for the cost basis distribution of the asset &#124; Source: @ali_charts on X In the above graph, the dots represent the number of investors or addresses who bought their coins within the corresponding price range. Naturally, the larger the size of the dot, the more is the density of holders who bought inside the range. It appears that out of all the price ranges that ETH has visited in its entire history, the $1,900 to $2,100 one hosts the cost basis of the largest number of holders. Related Reading: Bitcoin Triumphs Over $41,000, But Here’s What Could Prevent $50,000 ETH was just recently consolidating inside this range, and as trading occurred inside it, the investors slowly gained their cost basis there, which is why the range has now swelled so large. Now, what relevance does this range have for Ethereum? To understand this, how investor psychology works must first be known. To any investor, their cost basis is a particular price level, as their profit-loss situation can flip when the asset&#8217;s spot price retests it. Because of this reason, the holder might be more likely to show some kind of move when this retest takes place. If the investor had last been in profits, they might expect the same level to be profitable again, so they may just buy more. A few investors doing such buying won&#8217;t make the market budge at all, but if a large number of investors bought inside the same tight range, the levels might just end up providing support to Ethereum should it make a retest. The $1,900 to $2,100 buyers are obviously in profits, so this range, which hosts the cost basis of 5.85 million addresses who acquired 43.8 million ETH there, could show a major buying reaction if ETH dips towards it. Ali explains, &#8220;this range could become a significant support level for years ahead. So, it&#8217;s not too late to get in on ETH!&#8221; Related Reading: Crypto Analyst Predicts Bitcoin 400% Surge To $200,000, Here’s When In another post yesterday, the same analyst had posted the Ethereum weekly chart, noting that if ETH could secure a sustained candle close above the $2,150 mark, the asset could be set for some exciting uptrend. ETH may be breaking out of the triangle &#124; Source: @ali_charts on X As is visible from the chart, the ETH weekly price could be breaking above an ascending triangle pattern. &#8220;Targets in sight? We could be looking at ETH marching towards $2,600, and possibly even soaring to $3,500!&#8221; says Ali. ETH Price Ethereum has enjoyed some fresh bullish momentum during the past few days as it has now soared above the $2,200 mark. Looks like the price of the asset has been going up recently &#124; Source: ETHUSD on TradingView Featured image from Bastian Riccardi on Unsplash.com, charts from TradingView.com, IntoTheBlock.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-04T18:44:47.000Z",
    "title": "A New Contender Gains Traction, Challenging the Dominance of Cosmos (ATOM) and Terra (LUNA)",
    "url": "https://www.crypto-news-flash.com/a-new-contender-gains-traction-challenging-the-dominance-of-cosmos-atom-and-terra-luna/?utm_source=rss&utm_medium=rss&utm_campaign=a-new-contender-gains-traction-challenging-the-dominance-of-cosmos-atom-and-terra-luna",
    "description": "<img width=\"512\" height=\"321\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-29.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-29.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-29-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-29-343x215.jpg 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-29-326x205.jpg 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-29-163x102.jpg 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cosmos (ATOM) can cross the $16 price mark in 2024, as experts predict future growth. Market analysts remain optimistic about the future of Terra (LUNA) and predict a 78% price increase for the coin in 2024. One of the new ICOs has stunned the community with an impressive public presale performance. Cosmos (ATOM) has dipped [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-04T19:05:11.000Z",
    "title": "Bitcoin Is Going to New All-Time Highs Faster Than We Planned, Says Top Trader – Here’s His Outlook",
    "url": "https://dailyhodl.com/2023/12/04/bitcoin-is-going-to-new-all-time-highs-faster-than-we-planned-says-top-trader-heres-his-outlook/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/pour-capital-into-bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/pour-capital-into-bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/pour-capital-into-bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/pour-capital-into-bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/pour-capital-into-bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/pour-capital-into-bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/pour-capital-into-bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed analyst and trader says Bitcoin (BTC) will likely reach a new all-time high (ATH) faster than most are expecting. The analyst pseudonymously known as The Flow Horse tells his 189,500 followers on the social media platform X that Bitcoin will likely remain in an uptrend and soon surpass the prior high of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/04/bitcoin-is-going-to-new-all-time-highs-faster-than-we-planned-says-top-trader-heres-his-outlook/\">Bitcoin Is Going to New All-Time Highs Faster Than We Planned, Says Top Trader – Here’s His Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]