[
  {
    "source": "CoinDesk",
    "date": "2023-06-12T20:56:38.000Z",
    "title": "Bitcoin Dithers Below $26K as Investors Eye CPI Data, FOMC Rate Hike Decision",
    "url": "https://www.coindesk.com/markets/2023/06/12/bitcoin-dithers-below-26k-as-investors-eye-cpi-data-fomc-rate-hike-decision/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The largest cryptocurrency held its perch where it spent much of the previous three days."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-12T20:56:37.000Z",
    "title": "SEC's Temporary Restraining Order Would 'Effectively End' Binance.US Business, Company Claims",
    "url": "https://www.coindesk.com/policy/2023/06/12/secs-temporary-restraining-order-would-effectively-end-binanceus-business-company-claims/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A Securities and Exchange Commission (SEC) Monday effort to freeze Binance.US's funds is a \"draconian and unduly burdensome\" move, the U.S. affiliate of the global crypto exchange argued Monday."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-12T20:48:29.000Z",
    "title": "UN Warns of AI-Generated Deepfakes Fueling Hate and Misinformation Online",
    "url": "https://decrypt.co/144281/un-united-nations-ai-deepfakes-hate-misinformation",
    "description": "The United Nations expressed particular concern over the role of AI-generated deepfakes in conflict zones."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T20:55:11.000Z",
    "title": "Whale deposits $43 million worth of ETH into the Aave platform",
    "url": "https://www.cryptopolitan.com/whale-deposits-43m-eth-on-aave-platform/",
    "description": "A whale made a huge deposit of 25,000 ETH (about $43 million) into the Aave platform and took out a large loan of 35 million USDT, a significant milestone for the crypto market. The Binance exchange&#8217;s growing significance within the crypto ecosystem is further highlighted by speculations that the whale has put 35 million USDT ... <a title=\"Whale deposits $43 million worth of ETH into the Aave platform\" class=\"read-more\" href=\"https://www.cryptopolitan.com/whale-deposits-43m-eth-on-aave-platform/\" aria-label=\"More on Whale deposits $43 million worth of ETH into the Aave platform\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T20:54:53.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-12T21:00:26.000Z",
    "title": "MATIC Price Displays Recovery But Can Bulls Sustain The $0.50 Support?",
    "url": "https://www.newsbtc.com/matic/matic-price-displays-recovery-but-can-bulls-sustain-the-0-50-support/",
    "description": "Over the past 24 hours, the Polygon (MATIC) price has shown attempts to reverse its downward movement. The altcoin has regained more than 4% of its value during this time. However, on the weekly chart, MATIC has experienced a decline of over 27%, causing it to breach important support levels. The technical analysis of MATIC indicates a prevailing bearish sentiment in the market, with low levels of demand and accumulation. The volatility of Bitcoin has influenced the price action of altcoins, including MATIC, which have struggled to maintain support levels. Related Reading: Cardano Price Falls Below Key Support Levels, Will It Continue To Fall? A significant return of buying strength is needed for MATIC to surpass immediate resistance. Additionally, the overall strength of the broader market, particularly Bitcoin, will impact MATIC and other altcoins. The decrease in market capitalization for MATIC indicates lower buying activity for the coin. MATIC Price Analysis: One-Day Chart At the time of writing, the altcoin price was $0.64. The bulls have managed to defend the support level at $0.60 but sustained low demand could pose challenges for them to maintain it. The immediate resistance level is at $0.67; if surpassed, another resistance may be encountered at $0.73. On the other hand, if the price falls from $0.64, the bears could gain control, causing the altcoin to trade below $0.60. Failure to stay above the $0.60 level in upcoming trading sessions could push MATIC below $0.50. The trading volume for the altcoin in the previous session has declined, indicating stronger selling pressure in the market. Technical Analysis Investor confidence in MATIC has waned since June following its rejection at the $0.76 level. The Relative Strength Index (RSI) indicates that the coin is currently oversold and undervalued, with the RSI falling below both the half-line and the 30-mark. Moreover, the price has dipped below the 20-Simple Moving Average line, indicating low demand and the dominance of sellers in driving the price momentum. To see a resurgence in demand, MATIC must trade above the $0.70 price. This level becomes crucial for the coin to attract buyers and potentially reverse the current bearish sentiment. Aligning with the bearish sentiments observed in other technical indicators, the Directional Movement Index (DMI) confirms the negative price direction of an altcoin. The -DI line (orange) was positioned above the +DI line (blue), indicating a prevailing downward trend. Related Reading: Bitcoin Bearish Signal: Miners Sell At 3rd Largest Scale Ever Additionally, the Chaikin Money Flow (CMF), which tracks capital inflows and outflows, was below the half-line. This signifies that capital outflows outweighed inflows at the time, indicating a decrease in buying pressure. Featured Image From UnSplash, Charts From TradingView.com"
  }
]