[
  {
    "source": "CoinDesk",
    "date": "2023-08-16T19:42:06.000Z",
    "title": "How PayPal Upended the Crypto Debate in Washington D.C.",
    "url": "https://www.coindesk.com/consensus-magazine/2023/08/16/how-paypal-upended-the-crypto-debate-in-washington-dc/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The fintech giant’s PYUSD stablecoin has forced a rethink among Democratic policymakers who previously resisted federal legislation, says John Rizzo."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-16T19:42:27.000Z",
    "title": "Coinbase Gives Out $120,000 Worth of Bitcoin to WNBA Players",
    "url": "https://decrypt.co/152719/coinbase-gives-out-120000-worth-bitcoin-wnba-players",
    "description": "New York Liberty and Las Vegas Aces players earned a Bitcoin bonus amid the WNBA Commissioner’s Cup Championship on Tuesday."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T19:41:02.000Z",
    "title": "Dubai imposes $2.7 million fine on Three Arrows Capital founders over OPNX",
    "url": "https://www.cryptopolitan.com/dubai-imposes-2-7-million-fine-on-three-arrows-capital-founders-over-opnx/",
    "description": "Regulatory authorities in Dubai have imposed a hefty fine of $2.7 million on the founders of the once-prominent crypto hedge company, Three Arrows Capital. The penalty comes in connection with their association with the OPNX digital asset market, as reported by the Virtual Assets Regulatory Authority (VARA). Dubai&#8217;s Virtual Assets Regulatory Authority (VARA) has taken ... <a title=\"Dubai imposes $2.7 million fine on Three Arrows Capital founders over OPNX\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dubai-imposes-2-7-million-fine-on-three-arrows-capital-founders-over-opnx/\" aria-label=\"More on Dubai imposes $2.7 million fine on Three Arrows Capital founders over OPNX\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T20:07:30.000Z",
    "title": "Ledger partners with PayPal to enhance Bitcoin, crypto purchase",
    "url": "https://crypto.news/ledger-partners-with-paypal-to-enhance-bitcoin-crypto-purchase/",
    "description": "Ledger, the manufacturer of hardware wallets, has unveiled a strategic on-ramp integration with PayPal"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-16T19:46:22.000Z",
    "title": "Crypto millionaire found murdered in Bulgaria, suspect arrested",
    "url": "https://crypto.news/crypto-millionaire-found-murdered-in-bulgaria-suspect-arrested/",
    "description": "Christian Peev, a crypto millionaire from the United States, was found dead last weekend, days after disappearing in early August"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-16T20:00:27.000Z",
    "title": "Toncoin (TON) Investors Load Up Their Bags As Majority Of Cryptos Nosedive",
    "url": "https://www.newsbtc.com/toncoin-ton/toncoin-ton-investors-load-up-their-bags-as-majority-of-cryptos-nosedive/",
    "description": "Toncoin (TON) has showcased healthy market status since the end of last week. According to historical data from TradingView, it witnessed a consecutive bullish trajectory from August 11, 2023, until today, August 16. The upward movement drew the attention of investors, resulting in a price increment of over 12% gain in the past seven days. Notably, the latest developments within Toncoin’s ecosystem could be the reason for the market uptick in the past few days.  However, TON’s market value today, August 16, is $1.44, representing a price drop of over 2% in the last 24 hours. With this current price, the asset is almost 19.7% up in the past 14 days, 7% in 30 days, and 17% in the past year.  Related Reading: Best-Selling Author Touts Buy XRP Now, But This Price Is Crucial Recent Development Within Toncoin Ecosystem Pushes TON’s Value There have been a lot of events on Toincoin’s ecosystem attracting massive investor attention and investment. Today August 16, Toincoin shared a post on X about its Indonesia event in Bali slated for August 23, inviting the crypto community to join.  Also, on August 14, Toincoin shared another update on expanding its ecosystem globally through the X platform. Toincoin shared that it has taken another step to increase its global reach by launching the network’s website in Ukraine. This move shows the project&#8217;s commitment to increasing the asset&#8217;s adoption. Also, the team behind the TON projects wants to discover how Web3 teams could easily sign documents in Telegram.  In its X post, the team behind TON wrote: For those who will be in Lisbon this Thursday, August 17, TON Society Europe is kicking off its journey with an exciting offline event. Earlier on August 11, the TON community, via its X handle, shared a tweet from a known payment gateway for cryptocurrencies, NOWPayments.  The report noted that the payment service had incorporated TON into its technology to enable a seamless non-fungible token checkout from different marketplaces. This announcement triggered a rise in the market value of TON, verifiably from historical data on TradingView. From the data, the digital asset kick-started its bullish trend on the same day the news was announced.  It recorded a price gain from $1.259 to $1.302, reflecting a positive price change of about 3.4% in 24 hours. As the news spread, investors filled their portfolios with TON, despite the price decline of some other crypto assets. Related Reading: SEI Token Breaks Into Top 100 One-Day Post-Debut On Major Exchanges Toncoin entry into the NFT sector could have been the reason for the continued purchase of more TON tokens. Investors are hopeful that the digital asset&#8217;s value will appreciate in the future because of NFTs. These new updates contributed to the positive market sentiment after the association with NOWPayments triggered the price gains. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-16T20:00:52.000Z",
    "title": "Bitcoin Supply Crisis Would Trigger BTC Bull Market Even if ETF Bids Get Denied: Crypto Analyst",
    "url": "https://dailyhodl.com/2023/08/16/bitcoin-supply-crisis-would-trigger-btc-bull-market-even-if-etf-bids-get-denied-crypto-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/bitcoin-supply-crisis-trigger.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/bitcoin-supply-crisis-trigger.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/bitcoin-supply-crisis-trigger.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/bitcoin-supply-crisis-trigger.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/bitcoin-supply-crisis-trigger.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/bitcoin-supply-crisis-trigger.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/bitcoin-supply-crisis-trigger.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto analyst believes Bitcoin (BTC) will witness another bull run even if regulators reject all proposed BTC exchange-traded fund (ETF) applications. Analyst Josh Rager tells his 201,600 X followers that he expects there to be a BTC supply crisis following the next Bitcoin halving, slated for April 2024. According to the crypto strategist, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/16/bitcoin-supply-crisis-would-trigger-btc-bull-market-even-if-etf-bids-get-denied-crypto-analyst/\">Bitcoin Supply Crisis Would Trigger BTC Bull Market Even if ETF Bids Get Denied: Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-16T19:55:08.000Z",
    "title": "Coinbase Wins Approval to Sell Bitcoin (BTC) and Ethereum (ETH) Futures Products in the US",
    "url": "https://dailyhodl.com/2023/08/16/coinbase-wins-approval-to-sell-bitcoin-btc-and-ethereum-eth-futures-products-in-the-us/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/Coinbase-Executive-Reassures-Traders.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/Coinbase-Executive-Reassures-Traders.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/Coinbase-Executive-Reassures-Traders.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/Coinbase-Executive-Reassures-Traders.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/Coinbase-Executive-Reassures-Traders.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/Coinbase-Executive-Reassures-Traders.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/Coinbase-Executive-Reassures-Traders.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>American crypto exchange Coinbase has acquired approval from the government to offer Bitcoin (BTC) and Ethereum (ETH) futures in the US. In a new company blog post, Coinbase says it has been given the green light by the National Futures Association (NFA) to manage a futures commission merchant (FCM) and offer eligible US traders BTC [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/16/coinbase-wins-approval-to-sell-bitcoin-btc-and-ethereum-eth-futures-products-in-the-us/\">Coinbase Wins Approval to Sell Bitcoin (BTC) and Ethereum (ETH) Futures Products in the US</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]