[
  {
    "source": "CoinDesk",
    "date": "2024-03-07T23:19:46.000Z",
    "title": "Protocol Village: Abitrum Orbit Layer 3s Now Available on Coinbase Layer-2 Base",
    "url": "https://www.coindesk.com/tech/2024/03/06/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of March 7-March 13."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-07T23:01:02.000Z",
    "title": "Could Bitcoin’s Recent Surge Frighten the Fed?",
    "url": "https://decrypt.co/220681/bitcoin-bull-run-delay-fed-rate-cut",
    "description": "Bitcoin's bullish moves, along with soaring tech stocks, could discourage the Federal Reserve from cutting interest rates, a JPMorgan strategist says."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-07T22:01:15.000Z",
    "title": "Gaming Tokens Rebound as Bitcoin, Ethereum Continue to Rally",
    "url": "https://decrypt.co/220679/gaming-tokens-bitcoin-ethereum-rebound-rally",
    "description": "Immutable (IMX), Ronin (RON), Xai (XAI), and other gaming tokens are bouncing back alongside Bitcoin and Ethereum."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-07T21:47:00.000Z",
    "title": "Is This Bitcoin Bull Market Early? Here's What the Data Says About Timing the Top",
    "url": "https://decrypt.co/220677/is-this-bitcoin-bull-market-early-heres-what-the-data-says-about-timing-the-top",
    "description": "The bull market is well underway, but blockchain analysts say Bitcoin’s price could still rise 4X from here."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-07T21:16:21.000Z",
    "title": "Palantir Wins $175 Million Army Contract to Build AI Targeting System",
    "url": "https://decrypt.co/220654/palantir-wins-175-million-army-contract-to-build-ai-targeting-system",
    "description": "The next-generation mobile ground station will tap artificial intelligence to sense beyond line of sight."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-07T20:56:55.000Z",
    "title": "SEC Punts on BlackRock Bitcoin ETF Options Trading",
    "url": "https://decrypt.co/220651/bitcoin-etf-blackrock-options-trading-sec",
    "description": "The regulator said it will render its decision at the end of April. "
  },
  {
    "source": "Decrypt",
    "date": "2024-03-07T20:56:03.000Z",
    "title": "Jupiter Surges 35% as JUP Holders Stake $123 Million to Pick Next Solana Token Launch",
    "url": "https://decrypt.co/220659/jupiter-surges-stake-123-million-next-solana-token-launch",
    "description": "Users have already staked $123 million worth of JUP to vote on which Solana project will get to debut a token via Jupiter's LFG launchpad."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-07T23:05:32.000Z",
    "title": " Zhu Su pumps Milady to $19K, Alchemy Pay crypto bank, HK tokens: Asia Express ",
    "url": "https://cointelegraph.com/magazine/alchemy-pay-crypto-bank-zhu-su-pumps-milady-hong-kong-tokens-asia-express/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2024/01/magazine-Asia-Express-10_02_23-scaled.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Zhu Su helps pump Milady floor price, Singapore’s Alchemy Pay to open crypto bank, Hong Kong to tokenize financial services: Asia Express.</p>\n                    <p><p>Singaporean blockchain payments operator Alchemy Pay is planning to open a Web3 bank this year contingent on the approval of an Authorised Payment Institution (API) license from U.K. authorities to conduct remittance, payment processing, and managed account operations. </p><p>The firm <a href=\"https://alchemypay.org/news-and-press/alchemy-pay-roadmap-breakdown-web3-digital-bank-for-users-and-companies/\" target=\"_blank\" rel=\"nofollow\">said</a> on March 7 that upcoming Web3 Digital Bank euro and U.S. dollar bank accounts will support both enterprises and users. “Through our collaboration with banks, both conventional enterprises and Web3 firms can establish multi-currency accounts via Alchemy Pay. Real-time currency swaps are facilitated between EUR and USD, as well as between fiat and USDC/USDT,” Alchemy wrote.</p><p>Founded in Singapore in 2017, Alchemy currently supports fiat to crypto on-ramping and payment solutions in 173 countries. The firm allows users to purchase nonfungible tokens directly using their fiat payment methods and use their virtual or physical crypto cards for instant spending.  </p><p><a href=\"https://cointelegraph.com/magazine/alchemy-pay-crypto-bank-zhu-su-pumps-milady-hong-kong-tokens-asia-express/\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-07T21:37:46.000Z",
    "title": " Philippine central banker reveals details about wCBDC pilot project ",
    "url": "https://cointelegraph.com/news/philippine-central-banker-reveals-details-wcbdc-pilot-project",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNmQzM2Y2MjUtNGM3MC00NTExLTlhZjItOTZjNmQ4MTA1MzhkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Project Agila will first look at transfers between commercial banks and later try securities settlements and other high-value services.</p>\n                    <p><p>An official of the Bangko Sentral ng Pilipinas’ (BSP) has revealed more details about the central bank’s plans for to study wholesale central bank digital currency (wCBDC), according to a local press <a href=\"https://www.gmanetwork.com/news/money/companies/899638/pilot-run-of-central-bank-digital-currency-completed-by-end-2024-bsp/story/\" target=\"_blank\" rel=\"noopener nofollow\">report</a>.</p><p>BSP deputy governor for payments and currency management sector Mamerto Tangonan told a press conference on March 6 that the wCBDC pilot project, called Project Agila, would be completed by the end of this year. Tangonan called the pilot project a “learning exercise.” Tangonan said:</p><p>Six domestic banks — BDO Unibank, China Banking Corp., Land Bank of the Philippines, Rizal Commercial Banking Corporation, Union Bank of the Philippines and Maya Philippines — are taking part in pilot along with the BSP. The project is using the wCBDC to transfer funds among the banks. </p><p><a href=\"https://cointelegraph.com/news/philippine-central-banker-reveals-details-wcbdc-pilot-project\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-07T21:39:03.000Z",
    "title": "Uzbekistan taps Tether to boost crypto, blockchain development and regulation",
    "url": "https://cryptoslate.com/uzbekistan-taps-tether-to-boost-crypto-blockchain-development-and-regulation/",
    "description": "<p>Stablecoin issuer Tether Limited has entered a Memorandum of Understanding (MOU) with the Republic of Uzbekistan&#8217;s National Agency of Perspective Projects (NAPP) to develop a regulatory and legal framework for digital assets in the country, according to a March 7 press release. NAPP is the primary government agency overseeing crypto regulation and development, according to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/uzbekistan-taps-tether-to-boost-crypto-blockchain-development-and-regulation/\">Uzbekistan taps Tether to boost crypto, blockchain development and regulation</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Coin Telegraph India",
    "date": "2024-03-07T23:05:32.000Z",
    "title": " Zhu Su pumps Milady to $19K, Alchemy Pay crypto bank, HK tokens: Asia Express ",
    "url": "https://cointelegraph.com/magazine/alchemy-pay-crypto-bank-zhu-su-pumps-milady-hong-kong-tokens-asia-express/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2024/01/magazine-Asia-Express-10_02_23-scaled.jpg\"></p><p>Zhu Su helps pump Milady floor price, Singapore’s Alchemy Pay to open crypto bank, Hong Kong to tokenize financial services: Asia Express.</p>\n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-07T22:22:45.000Z",
    "title": "Zircuit Staking Program Breaks $500M TVL and Adds Ethena Integration",
    "url": "https://www.cryptoglobe.com/latest/2024/03/zircuit-staking-program-breaks-500m-tvl-and-adds-ethena-integration/",
    "description": "George Town, Grand Cayman, March 7th, 2024, Chainwire Zircuit, a zk rollup with parallelized circuits and AI-enabled security at the sequencer level, today announced its staking program has surpassed $500M in TVL. Currently, in the testnet phase, Zircuit is poised to hit a manner TVL on day one that surpasses major blockchains such as Linea, […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-07T22:19:42.000Z",
    "title": "Masa Network Completes Its CoinList Community Sale in Just 17 Minutes",
    "url": "https://www.cryptoglobe.com/latest/2024/03/masa-network-completes-its-coinlist-community-sale-in-just-17-minutes/",
    "description": "San Francisco, USA, March 7th, 2024, Chainwire Masa, the world’s leading decentralized personal data network, announces that its MASA Community Sale on CoinList has witnessed record-breaking participation. The community sale participants purchased the initial allocation of 63,554,660 MASA Tokens, or $5,000,000, in just 17 minutes. The additional token allocation also sold-out, bringing a grand total […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-07T21:10:16.000Z",
    "title": "Zircuit Staking Program Breaks $500M TVL And Adds Ethena Integration",
    "url": "https://cryptodaily.co.uk/2024/03/zircuit-staking-program-breaks-500m-tvl-and-adds-ethena-integration",
    "description": "Zircuit Staking Program Breaks $500M TVL And Adds Ethena Integration"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-07T23:00:31.000Z",
    "title": "Transak Achieves Industry-First SOC 2 Type 2 Compliance in Crypto Sector",
    "url": "https://news.bitcoin.com/transak-achieves-industry-first-soc-2-type-2-compliance-in-crypto-sector/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/hh8899-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/hh8899-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/hh8899-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/hh8899-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/hh8899-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/hh8899-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/hh8899-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/hh8899.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a landmark achievement for the cryptocurrency sector, Transak has become the first global on/off-ramp service to secure SOC 2 Type 2 compliance. The firm explained to Bitcoin.com News that the accomplishment underscores the company&#8217;s commitment to data security and customer trust, paving the way for broader Web3 industry collaborations with heavily-regulated companies worldwide. Transak [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-07T21:30:52.000Z",
    "title": "Fed Chair Powell Eases CBDC Concerns: US Far From Direct Fed Accounts, Emphasizes Need for Congressional Approval",
    "url": "https://news.bitcoin.com/fed-chair-powell-eases-cbdc-concerns-us-far-from-direct-fed-accounts-emphasizes-need-for-congressional-approval/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/cbdccd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Fed Chair Powell Eases CBDC Concerns: US Far From Direct Fed Accounts, Emphasizes Need for Congressional Approval\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/cbdccd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/cbdccd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/cbdccd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/cbdccd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/cbdccd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/cbdccd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/cbdccd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Federal Reserve Chairman Jerome Powell engaged with the Senate Banking Committee, signaling that the U.S. is just beginning to contemplate the introduction of a central bank digital currency (CBDC). Powell Assures No Direct Fed Accounts in CBDC Plans, Seeks Congressional Go-Ahead In his conversation with the Senate Banking Committee, Fed Chair Jerome Powell explored the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T21:19:08.000Z",
    "title": "Aptos Price Prediction for 2024 – 2033: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2024-2033 As we venture into 2024 to 2033, the period is critical for Aptos as it strives to establish itself as a significant blockchain platform. The rapidly changing market dynamics, technological advancements, and evolving adoption trends will undoubtedly shape Aptos’s path. Against this backdrop, investors and stakeholders are keen to gain insights [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T21:11:08.000Z",
    "title": "Zircuit Staking Program Breaks $500M TVL And Adds Ethena Integration",
    "url": "https://www.cryptopolitan.com/zircuit-staking-program-breaks-500m-tvl-and-adds-ethena-integration/",
    "description": "George Town, Grand Cayman, March 7th, 2024, Chainwire Zircuit, a zk rollup with parallelized circuits and AI-enabled security at the sequencer level, today announced its staking program has surpassed $500M in TVL. Currently in testnet phase, Zircuit is poised to hit a mainnet TVL on day one that surpasses major blockchains such as Linea, Manta, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T23:11:14.000Z",
    "title": "Shiba Inu & DOGE partake in Kelexo presale, sparking market interest",
    "url": "https://crypto.news/shiba-inu-doge-partake-in-kelexo-presale-sparking-market-interest/",
    "description": "Shiba Inu (SHIB) and Dogecoin (DOGE), two prominent meme coins with a rallying history, have added flair to the presale frenzy. #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T21:19:12.000Z",
    "title": "Worldcoin: How will Elon Musk’s lawsuit against OpenAI impact WLD Price? ",
    "url": "https://crypto.news/worldcoin-elon-musk-lawsuit/",
    "description": "Worldcoin on-chain analysis provides data drive insights into how Elon Musk's lawsuit against OpenAI could impact WLD price action in the near-term."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T21:07:40.000Z",
    "title": "SEC delays spot Bitcoin ETF options request until April 4",
    "url": "https://crypto.news/bitcoin-etf-options-sec/",
    "description": "The SEC postponed a decision on two requests to bring options on spot Bitcoin ETFs to market following the successful launch by nine issuers, excluding Grayscale’s GBTC."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-07T23:00:07.000Z",
    "title": "Solana (SOL) Hits $144: Analysts Feel Optimistic, Is A New ATH Imminent?",
    "url": "https://www.newsbtc.com/news/solana/solana-sol-hits-144-analysts-feel-optimistic-is-a-new-ath-imminent/",
    "description": "Solana (SOL) has been experiencing some volatility this week, but analysts seem optimistic about an ‘imminent markup’ around the corner. In the past 24 hours, Solana (SOL) has registered a 10.6% increase after breaking through the $140 barrier again. Related Reading: Solana Meme Coin Dogwifhat (WIF) Hits New ATH, Market Cap Breaks $1.6 Billion Solana Rises Above $140 January of 2022 marks the last time Solana’s native token traded above the $140 price range. On Thursday, the fifth-largest cryptocurrency by market capitalization hit a new high and followed the uptrend the crypto market is experiencing. JUST IN: #SOLANA BROKE $140 🚀#SOL $SOL pic.twitter.com/KbHkiwm8uf &#8212; 👑BitcoinExpert.sol👑 (@PeterAnagno) March 7, 2024 On March 5, SOL’s price spiked 7.5% after going from $132 to $142. However, the excitement about the cryptocurrency surpassing $140 was short-lived. The price started what looked like a freefall descent that shredded 16% of the token’s price, stopping at the $119 price range. Throughout Wednesday, SOL’s price continued to move in both directions while trying to stabilize above the $128 support level. The token finished the day hovering between the $130-$132 price range. On Thursday, Solana picked up some momentum and tested the $141 level before facing a pullback to the $135 support zone. Later, SOL broke through the $140 barrier again as the price skyrocketed to $144, increasing 6.6% in just two hours. SOL’s price performance in the hourly chart. Source: SOLUSDT on TradingView.com For the past hour, SOL’s price has hovered between the $140-$142 price range, briefly falling below the $140 support zone. At writing time, the cryptocurrency trades at $142.10, accounting for an increase of 10.6% in the last 24 hours and 9.5% in 7 days. In the 30-day time frame, Solana has seen a stellar price surge of 50.8%. However, SOL seems to be experiencing a slow market activity. According to CoinMarketCap data, the daily trading volume has decreased by 37.7% in the past 24 hours to $6.4 billion. Is A New ATH Imminent For SOL? Pseudonym crypto trader and analyst Bluntz previously forecasted Solana’s next leg up to be around the corner, saying that “the revenge pump is close.” Today, the trader reaffirmed that stance on an X (formerly Twitter) post. Right before the price hit $140, the analyst posted two charts displaying SOL’s pair with BTC and USDT. The trader highlighted the patterns he previously used to make a prediction in February. feels like a $SOL markup is imminent. https://t.co/suhs2SZroC pic.twitter.com/RJSlovIzhr &#8212; Bluntz (@Bluntz_Capital) March 7, 2024 Based on the “nice simple ABC zigzag” with its BTC pair and the “nice sideways accumulation wave 4” with its USDT pair, the analyst considers that an SOL markup is “imminent.” Related Reading: Ethereum Recovers From Dip: ETH Hits $3,900 For The First Time In Two Years Moreover, crypto trader Ansem suggested that Solana’s new all-time high might be closer than expected. In an X post, the trader shared a chart exhibiting the price performance of the cryptocurrency. Solana's performance in the all-time chart. Source: @blknoiz06 on X.com The chart above shows that SOL’s price of $138 was first achieved in early September 2021. Approximately 60 days later, Solana reached its all-time high of $260. If history repeats itself, according to the trader&#8217;s post, we could see “Solana&#8217;s new all-time high in less than 60 days.” Featured image from Unsplash.com, Chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-07T22:00:42.000Z",
    "title": "Wall Street Expert Says $100 XRP Price Prediction Has Expired, What Does This Mean?",
    "url": "https://www.newsbtc.com/analysis/xrp/100-xrp-price-prediction/",
    "description": "Wall Street veteran Shannon Thorp has publicly admitted that her earlier bullish price projections for the XRP price have expired. The forecast, which had previously been a source of speculation and expectation within the XRP community, has fallen short of realization, leading market observers to further reflect on XRP’s price dynamics.   XRP Price Prediction Falls Flat On Friday, March 1, Thorp took to X (formerly Twitter) to announce that her earlier ambitious forecast of XRP had come to an end. The Wall Street veteran acknowledged that her predictions had fallen flat, describing the unfortunate outcome as a “bittersweet” situation. Related Reading: Why Did Bitcoin Price Crash 10% After Reaching $69,000 All-Time High? Previously, in July 2023, Thorp had made a bold prediction of XRP, projecting that the price of the cryptocurrency would surge between $100 to $500 in four to seven months. The Wall Street expert had provided critical analysis and statistics to back her projections, highlighting XRP’s potential for gaining more liquidity strength and achieving widespread adoption in the financial sector.  Now in March 2024, almost seven months after Thorp’s price prediction and analysis, XRP has failed to attain the projected $100 price mark. At the time of writing, the cryptocurrency is trading below $1 at $0.62, according to CoinMarketCap.  Since last year, the price of XRP has struggled to keep up with the market’s bullish trends and has been consolidating around the price of $0.50 for months. However, recently, the cryptocurrency witnessed a surge in its value after breaking through crucial resistance levels around the $0.6 price mark. The unexpected price gain has heightened anticipation for a significant price movement, suggesting a potential uptrend during this bullish period. Wall Street Expert Remains Optimistic After acknowledging the unmet $100 XRP price prediction, Thorp highlighted XRP’s accomplishments, underscoring the cryptocurrency’s resilience in overcoming challenges that could have severely disrupted other digital currencies under similar circumstances.  Related Reading: Analyst Predicts Massive Rally For Dogecoin Price With A $1 Target, Here’s How According to the Wall Street veteran, XRP has shown its immense potential by enduring an extensive lawsuit filed by the United States Securities and Exchange Commission (SEC). She revealed that XRP has continued to prevail, holding its title as one of the top 10 cryptocurrencies despite facing multiple adversaries and regulatory hurdles during its developmental and advancement stages.  “Are we really to believe that XRP will fail? Well, I refuse to believe that because still to this day, I know what I hold,” Thorp stated.  Despite her predictions not coming to fruition, the Wall Street veteran has remained optimistic about XRP’s prospects, staying consistent with her support for the cryptocurrency and its development team. XRP at $0.62 &#124; Source: XRPUSDT on Tradingview.com Featured image from Crypto News, chart from Tradingview.com"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-07T21:00:49.000Z",
    "title": "Spain Blocks Worldcoin Project Over Data Privacy Concerns, WLD Token Slides 7%",
    "url": "https://www.newsbtc.com/news/spain-blocks-worldcoin-project-over-data-privacy-concerns-wld-token-slides-7/",
    "description": "The cryptocurrency project Worldcoin, spearheaded by Sam Altman, has faced another setback as Spain takes steps to block the venture. The Spanish data protection regulator, AEPD, has ordered Worldcoin to immediately halt the collection of personal information within the country and cease using the data it has already gathered.  Concerns Over Worldcoin Eyeball-Scanning Data Collection According to a Financial Times report, the AEPD expressed concerns about the project&#8217;s use of an eyeball-scanning &#8220;orb&#8221; to collect customers&#8217; data. The regulator is expected to announce a &#8220;precautionary measure&#8221; on Wednesday, and Worldcoin has been given 72 hours to demonstrate compliance with the order. Worldcoin, co-founded by Altman in 2019, has offered its cryptocurrency tokens to individuals worldwide in exchange for consent to scan their eyes with an orb. The scans serve as a means of identification, aiming to establish a reliable mechanism to distinguish between humans and machines as artificial intelligence advances.  However, the Spanish regulator&#8217;s action adds to a series of setbacks faced by Altman and his co-founders, Max Novendstern and Alex Blania, who have encountered resistance in various countries. Related Reading: Solana DeFi Landscape Thrives With Record $11 Billion Trading Volume Last year, Worldcoin faced opposition from authorities in Kenya, resulting in an order to cease operations. Additionally, the project refrained from launching its crypto tokens in the United States due to the country&#8217;s stringent regulations on digital assets.  The report further notes that major global markets such as China and India have also not made the Worldcoin token available. The UK&#8217;s Information Commissioner&#8217;s Office had also expressed intentions to investigate Worldcoin. Consumer Complaints In Spain While some jurisdictions have questioned the viability of Worldcoin&#8217;s cryptocurrency token, Spain&#8217;s recent action specifically targets the project&#8217;s core objective of establishing a method to verify customers&#8217; &#8220;personhood.&#8221; Altman acknowledged the possibility of Worldcoin existing without its in-house cryptocurrency, as the start-up faces growing scrutiny. Worldcoin has reportedly registered approximately 4 million users, and investments totaling around $250 million have come from venture capital firms such as Andreessen Horowitz and Khosla Ventures and prominent individuals like Reid Hoffman and Sam Bankman-Fried.  The project gained media attention and sparked consumer complaints in Spain, particularly as queues formed at shopping center stands where Worldcoin offered cryptocurrency in exchange for eye scans. In January, the data protection watchdog in Spain&#8217;s Basque Country, known as AVPD, warned about the eye-scanning technology used by Worldcoin in a mall in Bilbao.  The AVPD deemed it subject to biometric data protection rules and called for a risk assessment. As a result of Spain&#8217;s regulatory action, the native token of Worldcoin, WLD, has experienced a 7% decline within the past 24 hours. WLD Halts 200% Price Surge  Worldcoin&#8217;s native token, WLD, has halted its 200% upward trend over the past 30 days as the focus shifts to Bitcoin (BTC), which recently achieved a new all-time high (ATH) on Tuesday. Despite the significant uptrend in the past month, WLD has experienced a 5.8% price correction in the last seven days. Furthermore, the token&#8217;s market capitalization has slipped below the $1 billion mark and currently stands at $997 million. However, the advancements in artificial intelligence (AI) technology developed by Sam Altman&#8217;s projects hold the potential to influence the token&#8217;s price in the future significantly.  Related Reading: Why Did Bitcoin Price Crash 10% After Reaching $69,000 All-Time High? Despite being down by 26% from its ATH of $9.44, the ongoing technological advancements in this field indicate that the token&#8217;s prospects remain promising. Moving forward, it remains to be seen how the project&#8217;s founders will respond to the regulatory measures taken in Spain and how these actions will ultimately impact the token&#8217;s future price trajectory. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-07T22:05:13.000Z",
    "title": "XRP Price Analysis: $107 Target as Analyst Spots Bullish Hammer Pattern",
    "url": "https://www.crypto-news-flash.com/xrp-price-analysis-107-target-as-analyst-spots-bullish-hammer-pattern/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-price-analysis-107-target-as-analyst-spots-bullish-hammer-pattern",
    "description": "<img width=\"1804\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-stacked-on-top-of-each-other.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Grayscale XRP ETF\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-stacked-on-top-of-each-other.jpg 1804w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-stacked-on-top-of-each-other-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-stacked-on-top-of-each-other-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-stacked-on-top-of-each-other-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-stacked-on-top-of-each-other-1536x1022.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-stacked-on-top-of-each-other-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-stacked-on-top-of-each-other-450x299.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-silver-coins-stacked-on-top-of-each-other-1200x798.jpg 1200w\" sizes=\"(max-width: 1804px) 100vw, 1804px\" />With XRP price consolidating above $0.6, the top market analyst has projected a $107 price target in the long term. With positive fundamentals in the market, XRP’s future looks bright with the likelihood of hitting this target. Renowned market analyst, EGRAG CRYPTO, has set eyes on a bold target for XRP, predicting a surge to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-07T22:01:59.000Z",
    "title": "Shiba Inu Officially Launches Shib Name Service Amid Price Volatility: What’s Next for SHIB?",
    "url": "https://www.crypto-news-flash.com/shiba-inu-officially-launches-shib-name-service-amid-price-volatility-whats-next-for-shib/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-officially-launches-shib-name-service-amid-price-volatility-whats-next-for-shib",
    "description": "<img width=\"1200\" height=\"700\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/SHIBA-INU-D.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/SHIBA-INU-D.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/SHIBA-INU-D-300x175.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/SHIBA-INU-D-768x448.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/SHIBA-INU-D-150x88.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/SHIBA-INU-D-450x263.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />The launch of SHIB domain names has been facilitated by the D3 platform and will support web3 while operating on the DNS for full internet compatibility. The launch of the SHIB domain names will have a profound impact on the mass adoption of Shiba Inu as a utility-based meme coin. Shiba Inu (SHIB), the leading [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-07T21:35:28.000Z",
    "title": "XRP Community Abuzz Over Ripple CTO’s Exchange with Elon Musk: Potential Alliance Brewing?",
    "url": "https://www.crypto-news-flash.com/xrp-community-abuzz-over-ripple-ctos-exchange-with-elon-musk-potential-alliance-brewing/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-community-abuzz-over-ripple-ctos-exchange-with-elon-musk-potential-alliance-brewing",
    "description": "<img width=\"1920\" height=\"1189\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-300x186.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-1024x634.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-768x476.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-1536x951.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-163x102.jpg 163w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-24x15.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-48x30.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />According to one XRP influencer, Ripple CTO David Schwartz has &#8220;joined forces&#8221; with X Corp owner Elon Musk, bonded by their mutual fight against the US SEC. Ripple has continued to expand its license portfolio through strategic acquisitions, aiming to offer a wider range of products to its users, especially institutional clients. The enemy of [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-07T23:01:00.000Z",
    "title": "Tesla and SpaceX Currently Hold $1,340,000,000 in Bitcoin Across 96 Addresses, Says Blockchain Intelligence Firm",
    "url": "https://dailyhodl.com/2024/03/07/tesla-and-spacex-currently-hold-1340000000-in-bitcoin-across-96-addresses-says-blockchain-intelligence-firm/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/elon-musk-witenesses-net.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/elon-musk-witenesses-net.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/elon-musk-witenesses-net.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/elon-musk-witenesses-net.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/elon-musk-witenesses-net.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/elon-musk-witenesses-net.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/elon-musk-witenesses-net.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New data reveals that two companies owned by billionaire Elon Musk hold over $1.3 billion worth of Bitcoin (BTC) across multiple addresses. According to blockchain analytics firm Arkham Intelligence, Tesla and SpaceX currently hold $1.34 billion worth of the top crypto asset by market cap across 96 combined wallet addresses. “Arkham has identified the BTC [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/07/tesla-and-spacex-currently-hold-1340000000-in-bitcoin-across-96-addresses-says-blockchain-intelligence-firm/\">Tesla and SpaceX Currently Hold $1,340,000,000 in Bitcoin Across 96 Addresses, Says Blockchain Intelligence Firm</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-07T21:00:56.000Z",
    "title": "TradFi Investors on Unprecedented Bitcoin Accumulation Spree, Scooping Thousands of BTC per Day: CryptoQuant",
    "url": "https://dailyhodl.com/2024/03/07/tradfi-investors-on-unprecedented-bitcoin-accumulation-spree-scooping-thousands-of-btc-per-day-cryptoquant/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/spree-scooping-per-day.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/spree-scooping-per-day.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/03/spree-scooping-per-day.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/spree-scooping-per-day.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/spree-scooping-per-day.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/spree-scooping-per-day.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/03/spree-scooping-per-day.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Investors from the traditional finance sector are gobbling up Bitcoin (BTC) at &#8220;unprecedented&#8221; levels, according to the co-founder and chief executive of analytics platform CryptoQuant. Ki Young Ju tells his 335,600 followers on the social media platform X that traditional finance investors are dollar-cost averaging 6,896 BTC per day. &#8220;They accumulated 103,726 BTC over the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/07/tradfi-investors-on-unprecedented-bitcoin-accumulation-spree-scooping-thousands-of-btc-per-day-cryptoquant/\">TradFi Investors on Unprecedented Bitcoin Accumulation Spree, Scooping Thousands of BTC per Day: CryptoQuant</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-07T20:55:37.000Z",
    "title": "Bitcoin Firmly in the Pre-Halving Rally Phase, According to Analyst – But There’s a Catch",
    "url": "https://dailyhodl.com/2024/03/07/bitcoin-firmly-in-the-pre-halving-rally-phase-according-to-analyst-but-theres-a-catch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Bitcoin-Price-Incoming-10.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Bitcoin-Price-Incoming-10.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Bitcoin-Price-Incoming-10.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Bitcoin-Price-Incoming-10.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Bitcoin-Price-Incoming-10.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Bitcoin-Price-Incoming-10.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Bitcoin-Price-Incoming-10.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto analyst says that Bitcoin (BTC) is currently decisively in the midst of its pre-halving rally. Pseudonymous crypto strategist Rekt Capital tells his 410,900 followers on the social media platform X that despite this, the top crypto asset by market cap could still see some dips along the way. “Bitcoin is still [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/07/bitcoin-firmly-in-the-pre-halving-rally-phase-according-to-analyst-but-theres-a-catch/\">Bitcoin Firmly in the Pre-Halving Rally Phase, According to Analyst – But There’s a Catch</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]