[
  {
    "source": "CoinDesk",
    "date": "2023-11-29T13:01:00.000Z",
    "title": "First Mover Americas: Standard Chartered Bank Thinks BTC Will Reach $100K by End of 2024",
    "url": "https://www.coindesk.com/markets/2023/11/29/first-mover-americas-standard-chartered-bank-thinks-btc-will-reach-100k-by-end-of-2024/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin [BTC] and crypto markets in context for Nov. 29, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-29T12:54:23.000Z",
    "title": "UK crypto hodlers get a call from the tax grinch",
    "url": "http://cointelegraph.com/news/uk-crypto-hodlers-get-a-call-from-the-tax-grinch",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/20837f2c-6a5c-43ff-b241-d6a575add0cb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>HMRC has issued a stark warning to crypto, NFT and utility token holders that they must pay their taxes on time or face the consequences.</p>\n                    <p><p>His Majesty’s Revenue and Customs (HMRC) has issued a stern warned crypto users that they must declare and pay their taxes on digital assets within a strict timeframe, or face the consequences. The tax office issued <a href=\"https://www.gov.uk/guidance/tell-hmrc-about-unpaid-tax-on-cryptoassets\" target=\"_blank\" rel=\"noopener nofollow\">guidance</a> on how to go about declaring and paying taxes on their crypto holdings published on Nov. 29, starts with a clear warning: </p><blockquote>“If you do not contact us to declare your unpaid tax, you could be liable to additional interest and penalties.”</blockquote><p>The HMRC specifies the amount of time users are given to pay outstanding taxes will depend on why they didn’t pay up earlier. It suggests taxpayers choose from three options and confess whether they didn’t take enough care, evaded paying deliberately, or intended to pay but somehow failed. </p><p>Users who intended to pay but somehow failed will owe the HMRC the payment for four previous years. The less careful taxpayer will have to pay for the last six years, and the deliberate tax evader must pay taxes on all crypto stored for up to the previous 20 years. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/crypto-losses-on-tax-returns-in-the-us-uk-canada\"><strong><em>How to manage crypto losses on tax returns in the US, UK and Canada</em></strong></a></p><p>The tax service also reminded taxpayers of the interest, charged daily from the date tax is due until it is paid. As an additional tax on previous-year crypto holdings would now be classified as late, it automatically suggests the <a href=\"https://www.gov.uk/guidance/calculate-interest-and-penalties-for-tax-years-ended-5-april-2003-to-5-april-2021\" target=\"_blank\" rel=\"noopener nofollow\">interest</a> due. A failure to include the correct interest will result in a rejection of disclosure.</p><p>After disclosing unpaid taxes, users will get payment reference numbers and 30 days to remit the entire sum owed. The disclosure must include “exchange tokens,” such as Bitcoin, as well as any non-fungible tokens (NFTs) and “utility tokens.” </p><p>The HMRC treats crypto similarly to most other financial assets and thus subjects it to Capital Gains Tax (CGT). The current CGT rates range from 10% to 20%, depending on the individual’s income and gains. You can read more about U.K. tax rules <a href=\"https://cointelegraph.com/news/crypto-losses-on-tax-returns-in-the-us-uk-canada\">here</a>. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/real-ai-use-cases-crypto-no-2-ai-can-run-dao/\"><strong><em>Real AI use cases in crypto, No. 2: AIs can run DAOs</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T13:08:05.000Z",
    "title": "Decentralized exchanges Velodrome and Aerodrome warn users of DNS attack",
    "url": "https://www.cryptopolitan.com/velodrome-and-aerodrome-warn-of-dns-attack/",
    "description": "In a recent development, decentralized exchanges Velodrome and Aerodrome have issued warnings to their users, notifying them of a potential security breach on their official websites. The incident is suspected to be a domain name system (DNS) attack, wherein hackers gain control of a website and redirect users to malicious phishing sites, with the aim ... <a title=\"Decentralized exchanges Velodrome and Aerodrome warn users of DNS attack\" class=\"read-more\" href=\"https://www.cryptopolitan.com/velodrome-and-aerodrome-warn-of-dns-attack/\" aria-label=\"More on Decentralized exchanges Velodrome and Aerodrome warn users of DNS attack\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T12:48:59.000Z",
    "title": "Philippines SEC issues warning against Binance for unauthorized operations",
    "url": "https://www.cryptopolitan.com/philippines-sec-warning-against-binance/",
    "description": "The Philippines Securities and Exchange Commission (SEC) has issued a stern warning against cryptocurrency exchange Binance, stating that it has been operating without the necessary approvals or licenses in the country. The regulator&#8217;s announcement on November 28, 2023, has raised concerns about Binance&#8217;s legality in the Philippines and the potential consequences for those involved in ... <a title=\"Philippines SEC issues warning against Binance for unauthorized operations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/philippines-sec-warning-against-binance/\" aria-label=\"More on Philippines SEC issues warning against Binance for unauthorized operations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T12:48:31.000Z",
    "title": "Charles Hoskinson clarifies grand conspiracy comments on SEC",
    "url": "https://www.cryptopolitan.com/charles-hoskinson-explains-sec-conspiracy/",
    "description": "In a recent development in the cryptocurrency sector, Charles Hoskinson, the founder of Cardano, has addressed the ongoing debate with XRP community members. This follows a series of events where Charles Hoskinson criticized the United States Securities and Exchange Commission (SEC) for its seemingly preferential treatment of Bitcoin and Ethereum. At the same time, other ... <a title=\"Charles Hoskinson clarifies grand conspiracy comments on SEC\" class=\"read-more\" href=\"https://www.cryptopolitan.com/charles-hoskinson-explains-sec-conspiracy/\" aria-label=\"More on Charles Hoskinson clarifies grand conspiracy comments on SEC\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T12:46:20.000Z",
    "title": "Amazon’s AWS Expands Transcription Capabilities with AI Advancements",
    "url": "https://www.cryptopolitan.com/amazons-aws-expands-transcription/",
    "description": "Amazon Web Services (AWS) has unveiled major enhancements to its cloud-based automatic speech recognition service, Amazon Transcribe, ushering in a new era of accessibility for transcription services. With the introduction of generative AI models and self-supervised algorithms, AWS has expanded the reach of transcription across more than 100 languages, promising improved accuracy and usability for ... <a title=\"Amazon&#8217;s AWS Expands Transcription Capabilities with AI Advancements\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amazons-aws-expands-transcription/\" aria-label=\"More on Amazon&#8217;s AWS Expands Transcription Capabilities with AI Advancements\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-29T13:06:12.000Z",
    "title": "Bitcoin targets $40k, GMX and InQubeta bullish",
    "url": "https://crypto.news/bitcoin-retests-key-resistance-gmx-and-inqubeta-bullish/",
    "description": "Bitcoin is trending higher. Meanwhile, experts are bullish on GMX and InQubeta. Over $5.4 million has been raised in the QUBE presale"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-29T13:02:04.000Z",
    "title": "Philippines securities regulator flags Binance for operating without license",
    "url": "https://crypto.news/philippines-securities-regulator-flags-binance-for-operating-without-license/",
    "description": "Crypto exchange Binance has been operating in the Philippines without securing the necessary license or approval, as reported by the country&#8217;s securities regulator. On Nov. 28, The Philippines Securities and Exchange Commission (SEC)&#160;released&#160;a warning about Binance, notifying the public that&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-29T12:40:06.000Z",
    "title": "Forbes forks release of 30 Under 30 to Ethereum blockchain",
    "url": "https://crypto.news/forbes-forks-release-of-30-under-30-to-ethereum-blockchain/",
    "description": "Forbes Magazine has announced&#160;that the next edition of its annual 30 Under 30 will be released on the Ethereum blockchain. According to Forbes, blockchain will be used to publish the highly anticipated annual ranking of the top performing entrepreneurs across&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-29T12:45:46.000Z",
    "title": "Trading Guru John Bollinger Warns Of Buying Litecoin, Here’s Why",
    "url": "https://www.newsbtc.com/news/litecoin/john-bollinger-warns-of-buying-litecoin/",
    "description": "In his latest analysis, legendary trader John Bollinger has expressed concerns over Litecoin&#8217;s performance, particularly in comparison to Bitcoin. Bollinger, known for developing the popular technical analysis tool Bollinger Bands, highlighted a worrying pattern in the Litecoin market. He remarked, “I was asked for an analysis of LTCBTC. The thing that concerns me the most is its underperformance vs Bitcoin. From a price perspective the controlling LTCUSD feature is the 2 bar reversal at the lower Bollinger Band which is typically considered a bearish signal by traders.” Bollinger&#8217;s Bearish Litecoin Prediction Explained The chart of the LTC/USD pair provided by Bollinger on November 28, 2023, shows Litecoin&#8217;s price action in relation to its Bollinger Bands on both a daily and weekly scale. The price is currently hovering around $69.566, which is significantly lower than the upper Bollinger Band, suggesting a lack of bullish momentum. Related Reading: Litecoin Sustains 4-Month Run With 37% Gain, Beating Most Of Its Peers – Details The Bands form by plotting a range of standard deviations above and below a simple moving average, commonly enveloping the price action. In this chart, the daily vs. weekly candles chart shows that the LTC/USD price is struggling beneath the midpoint of these bands, which is a bearish indication. The price currently near $69.566 is substantially below the upper band level of around $90, which represents a potential resistance level. The Bollinger Bands (BB) on the chart are set with a 20-period moving average with a 2 standard deviation range. Bollinger&#8217;s analysis points to a &#8216;2 bar reversal&#8217; pattern at the lower band. This pattern emerges when a bar reaches a high above the preceding bar but then closes below the close of that same previous bar, hinting at a possible reversal from the uptrend. Such a pattern took place near the lower band, indicating that any effort to drive the price higher meets with resistance, and the prevailing selling pressure is taking hold. Related Reading: Litecoin Whales Are Back In The Game, Can Price Reach $100? The Bollinger %B indicator is also crucial here as it compares the price of Litecoin to the range defined by the Bollinger Bands. A %B value below 0.5 indicates that Litecoin&#8217;s price sits nearer to the lower band than to the upper band, potentially signaling weakness. The chart shows the indicator failing to cross the 0.5 level after a plunge toward 0, signifying that the price frequently touches or falls below the lower band. LTC Price Under Pressure The Bollinger Band Width (BBW) serves as another indicator, measuring volatility by assessing the Bollinger Bands&#8217; width. A narrowing of the Bands, as seen in the latter part of the chart, suggests a decrease in volatility and often precedes a significant price movement. In this context, the BBW&#8217;s narrowing on the Litecoin chart might indicate that the market is tensing, possibly gearing up for an impending breakout or breakdown. When Bollinger mentions Litecoin&#8217;s underperformance relative to Bitcoin, it&#8217;s important to note that Bitcoin often leads the crypto market trend. If Litecoin is not keeping up with Bitcoin&#8217;s movements, it could suggest a lack of confidence or interest from traders in altcoins (as the current rise in Bitcoin dominance shows) and Litecoin specifically. In summary, Bollinger&#8217;s technical analysis indicates that Litecoin is in a precarious position. The price action at the lower Bollinger Band, the bearish &#8216;2 bar reversal&#8217; pattern, the sub-0.5 Bollinger %B values, and the narrowing BBW all suggest that Litecoin may continue to see downward pressure in the near term. At press time, Litecoin traded at $70.05. The 1-day chart of LTC/USD shows that the altcoin fell below the key support of the 0.236 Fibonacci retracement level at $69.98 two days ago. A retest is currently taking place, a daily close above this is of utmost importance for the Litecoin price. Featured image from Unsplash / Kanchanara, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-29T13:08:34.000Z",
    "title": "Bware Labs partners with OVHcloud to deliver one of the fastest blockchain API platforms on the market",
    "url": "https://www.crypto-news-flash.com/bware-labs-partners-with-ovhcloud-to-deliver-one-of-the-fastest-blockchain-api-platforms-on-the-market/?utm_source=rss&utm_medium=rss&utm_campaign=bware-labs-partners-with-ovhcloud-to-deliver-one-of-the-fastest-blockchain-api-platforms-on-the-market",
    "description": "<img width=\"1024\" height=\"512\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/imgpsh_fullsize_anim-10.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/imgpsh_fullsize_anim-10.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/imgpsh_fullsize_anim-10-300x150.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/imgpsh_fullsize_anim-10-768x384.png 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />The Context Bware Labs delivers a powerful blockchain infrastructure built to meet the challenges of Web3. The company aims to play a major role in blockchain adoption worldwide, offering a growing ecosystem of products designed for successful Web3 innovation. Bware Labs’ flagship product – Blast – is one of the world’s fastest blockchain API platforms. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-29T12:48:24.000Z",
    "title": "Microsoft AI’s Top Crypto Picks – Ripple (XRP), Polygon (MATIC), and Everlodge (ELDG) Set to Soar",
    "url": "https://www.crypto-news-flash.com/microsoft-ais-top-crypto-picks-ripple-xrp-polygon-matic-and-everlodge-eldg-set-to-soar/?utm_source=rss&utm_medium=rss&utm_campaign=microsoft-ais-top-crypto-picks-ripple-xrp-polygon-matic-and-everlodge-eldg-set-to-soar",
    "description": "<img width=\"512\" height=\"299\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-106.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-106.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-106-300x175.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Microsoft AI has recently unveiled its top crypto picks for 2024. Among these selections, Ripple (XRP), Polygon (MATIC), and Everlodge (ELDG) stand out as promising assets expected to soar in the coming years. Ripple (XRP): Analysts&#8217; Bullish Sentiment Microsoft AI&#8217;s choice indicates a bullish future for Ripple (XRP). In recent Ripple XRP news, the CryptoBull [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-29T12:41:48.000Z",
    "title": "VeChain Involved? New Look Ties the Knot with Blockchain for Sustainability",
    "url": "https://www.crypto-news-flash.com/vechain-involved-new-look-ties-the-knot-with-blockchain-for-sustainability/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-involved-new-look-ties-the-knot-with-blockchain-for-sustainability",
    "description": "<img width=\"640\" height=\"427\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/burgess-milner-OYYE4g-I5ZQ-unsplash.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"New Look se une a Blockchain en pro de la sostenibilidad\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/burgess-milner-OYYE4g-I5ZQ-unsplash.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/burgess-milner-OYYE4g-I5ZQ-unsplash-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/burgess-milner-OYYE4g-I5ZQ-unsplash-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />New Look, in partnership with TrusTrace, leads sustainable fashion with transparency and corporate responsibility. Blockchain traceability: A key tool for New Look in its commitment to reduce emissions and sustainability. In an effort to combat environmental challenges in the fashion industry, UK retailer, New Look, has taken a bold step towards sustainability by partnering with [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-29T12:40:42.000Z",
    "title": "Ripple CLO Takes a Swipe at SEC Chair: ‘Runway Is Getting Shorter’",
    "url": "https://www.crypto-news-flash.com/ripple-clo-takes-a-swipe-at-sec-chair-runway-is-getting-shorter/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-clo-takes-a-swipe-at-sec-chair-runway-is-getting-shorter",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/securities-and-exchange-7232757_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/securities-and-exchange-7232757_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/securities-and-exchange-7232757_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/securities-and-exchange-7232757_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/securities-and-exchange-7232757_1920-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Ripple&#8217;s Chief Legal Officer, Stuart Alderoty, criticizes the SEC and hints at a dwindling timeframe for the regulator&#8217;s internal proceedings without jury supervision. Analysts continue to predict bullish case scenarios for XRP expecting its price to surge 6000 percent next year in 2024. Ripple CLO Stuart Alderoty is leaving no stone unturned when it comes [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-29T13:00:09.000Z",
    "title": "Chainlink’s Upgrade V0.2 Unleashes Native Staking System",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/chainlinks-upgrade-v0-2-unleashes-native-staking-system/",
    "description": "<p>This groundbreaking enhancement has propelled the staking pool size to an impressive 45 million LINK. Setting the stage for a more robust and decentralized network. Chainlink has long been recognized as a pioneer in providing decentralized and tamper-proof data to smart contracts on various blockchain platforms. Let&#8217;s discover more about Chainlink&#8217;s Upgrade V0.2. The Priority [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/chainlinks-upgrade-v0-2-unleashes-native-staking-system/\">Chainlink&#8217;s Upgrade V0.2 Unleashes Native Staking System</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-29T12:59:47.000Z",
    "title": "Chainlink (LINK) Surges Over 5% on Staking Upgrade Enthusiasm",
    "url": "https://coinedition.com/chainlink-link-surges-over-5-on-staking-upgrade-enthusiasm/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Chainlink-Price-Analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Chainlink-Price-Analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Chainlink-Price-Analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Chainlink-Price-Analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Chainlink-Price-Analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Chainlink-Price-Analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Chainlink-Price-Analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Chainlink (LINK) has recently witnessed a notable market value surge following the launch of its staking v0.2 priority migration. This upgrade, a significant stride in Chainlink&#8217;s ecosystem, introduces enhanced stakeholder flexibility, robust security measures, and a dynamic rewards system. Consequently, LINK, Chainlink&#8217;s native token, has seen a bullish trend, with market analysts predicting a potential [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/chainlink-link-surges-over-5-on-staking-upgrade-enthusiasm/\">Chainlink (LINK) Surges Over 5% on Staking Upgrade Enthusiasm</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-29T12:57:00.000Z",
    "title": "Weekly Crypto Asset Inflow Strikes $346M, Highest Since 2021",
    "url": "https://coinedition.com/weekly-crypto-asset-inflow-strikes-346m-highest-since-2021/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/ATOM-ADA-and-SOL-Are-up-as-Crypto-Market-Cap-Breaks-1TRILLION.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ATOM, ADA and SOL Are up as Crypto Market Cap Breaks $1TRILLION\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/ATOM-ADA-and-SOL-Are-up-as-Crypto-Market-Cap-Breaks-1TRILLION.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/ATOM-ADA-and-SOL-Are-up-as-Crypto-Market-Cap-Breaks-1TRILLION-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/ATOM-ADA-and-SOL-Are-up-as-Crypto-Market-Cap-Breaks-1TRILLION-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/ATOM-ADA-and-SOL-Are-up-as-Crypto-Market-Cap-Breaks-1TRILLION-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/ATOM-ADA-and-SOL-Are-up-as-Crypto-Market-Cap-Breaks-1TRILLION-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A recent CoinShares report showed that $346 million was injected into the digital asset market last week in investment products. With that amount, it became the highest weekly inflow into the crypto market since the bull run of late 2021. Of the recorded weekly inflows into the digital assets market, CoinShares reported that Bitcoin had [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/weekly-crypto-asset-inflow-strikes-346m-highest-since-2021/\">Weekly Crypto Asset Inflow Strikes $346M, Highest Since 2021</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-29T12:45:04.000Z",
    "title": "Bitcoin December Rally in Sight As BTC Forms Setup Strikingly Similar to Three Years Ago: Crypto Trader",
    "url": "https://dailyhodl.com/2023/11/29/bitcoin-december-rally-in-sight-as-btc-forms-setup-strikingly-similar-to-three-years-ago-crypto-trader/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Bitcoin-December-Rally.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Bitcoin-December-Rally.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Bitcoin-December-Rally.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Bitcoin-December-Rally.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Bitcoin-December-Rally.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Bitcoin-December-Rally.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Bitcoin-December-Rally.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed analyst believes that December will be a bullish month for Bitcoin (BTC) as the crypto king mirrors a setup last witnessed exactly three years ago. Kevin Svenson tells his 131,000 followers on the social media platform X that Bitcoin appears to be mimicking its late 2020 price action when BTC was consolidating [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/29/bitcoin-december-rally-in-sight-as-btc-forms-setup-strikingly-similar-to-three-years-ago-crypto-trader/\">Bitcoin December Rally in Sight As BTC Forms Setup Strikingly Similar to Three Years Ago: Crypto Trader</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]