[
  {
    "source": "Cointelegraph",
    "date": "2024-01-12T01:05:59.000Z",
    "title": " Vanguard users threaten to close accounts after firm blocks spot Bitcoin ETFs ",
    "url": "https://cointelegraph.com/news/vanguard-investors-threaten-to-close-accounts-ban-spot-bitcoin-etfs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZmNlMGQ0ZGYtN2MzOS00NmM2LWFkNGQtYmQyYjBmMzI3NTJiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Spot Bitcoin ETFs were also reportedly not currently available for purchase on the brokerage platforms of Citi, Merill Lynch, Edward Jones, and UBS.</p>\n                    <p><p>Asset manager Vanguard’s apparent decision not to allow the purchase of spot Bitcoin exchange-traded funds (ETF) on its platform has seemingly pushed a few customers toward the exit door.</p><p>According to a Jan. 11 report from The Wall Street Journal, Vanguard <a href=\"https://www.wsj.com/livecoverage/stock-market-today-cpi-report-inflation-01-11-2024/card/vanguard-has-no-plans-to-offer-spot-bitcoin-etfs-on-its-platform-ZTqcqY5ISZsOZkjiJnxC\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it won’t offer the new spot Bitcoin ETFs on its brokerage platform as it did not align with its traditional offerings. </p><p>\"Spot bitcoin ETFs will not be available for purchase on the Vanguard platform,” said the company in a statement to the WSJ. “We also have no plans to offer Vanguard bitcoin ETFs or other crypto-related products.”</p><p><a href=\"https://cointelegraph.com/news/vanguard-investors-threaten-to-close-accounts-ban-spot-bitcoin-etfs\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-12T00:48:09.000Z",
    "title": " Spot Bitcoin ETFs top $4.5B total volume on the first day of trading ",
    "url": "https://cointelegraph.com/news/bitcoin-spot-etf-volumes-break-records-blackrock-fidelity-grayscale",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOTljNjU1YTgtNGQwYi00NjY0LWJlMDAtYjc3ZDk4Y2E2ZjllLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Spot Bitcoin ETFs topped $4.5 billion in trading volume on the first day of trading, but one of the issuers has clarified it hasn’t yet made the cut.</p>\n                    <p><p>The first day of trading for a suite of new Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds (ETFs) has gone off with a bang, with BlackRock, Grayscale, and Fidelity’s ETFs coming out on top in total volumes. One issuer, however, didn't get to start as expected.</p><p>Aggregated data from Yahoo Finance, compiled by Cointelegraph, shows that the total volume across ten of the spot Bitcoin ETFs reached more than $4.5 billion in total volume for day one trading. </p><p>BlackRock’s Bitcoin ETF, the iShares Bitcoin Trust (IBIT), was the top performer of the newly-listed funds, handling just over $1 billion in volume — 22% of the group's total volume — per Yahoo Finance <a href=\"https://au.finance.yahoo.com/quote/IBIT?p=IBIT&amp;.tsrc=fin-srch\" target=\"_blank\" rel=\"noopener nofollow\">data</a>. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-spot-etf-volumes-break-records-blackrock-fidelity-grayscale\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-12T01:00:10.000Z",
    "title": "Bitcoin ETF launch day: Analysis of the historic moment",
    "url": "https://cryptoslate.com/podcasts/bitcoin-etf-launch-day-analysis-of-the-historic-moment/",
    "description": "<p>On Jan. 11, 2024, the first Bitcoin spot ETFs in the U.S. finally launched after years of anticipation. To mark this milestone, CryptoSlate&#8217;s team was joined by SwissBorg&#8217;s Alex Fazel to share their perspectives. Impact on Bitcoin price The panelists had mixed views on how quickly the ETFs may impact Bitcoin&#8217;s price. Fazel noted research [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/podcasts/bitcoin-etf-launch-day-analysis-of-the-historic-moment/\">Bitcoin ETF launch day: Analysis of the historic moment</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-12T01:06:38.000Z",
    "title": "FTX advances asset recovery process with major Bahamas property auction",
    "url": "https://www.cryptopolitan.com/ftx-asset-recovery-bahamas-property-auction/",
    "description": "The ongoing bankruptcy proceedings of the once-prominent cryptocurrency exchange FTX have entered a pivotal phase. The court-approved administrators overseeing the FTX estate are set to auction off a collection of luxury properties in the Bahamas. This move is a crucial step in recouping funds for the beleaguered company&#8217;s account holders and creditors. Among the assets [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-12T01:00:01.000Z",
    "title": "Is Bitcoin Near Top Yet? What Glassnode’s Price Multiplier Model Says",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-top-glassnodes-price-multiplier-model/",
    "description": "Glassnode&#8217;s model for tracking the &#8220;price multiplier&#8221; effect for Bitcoin could provide some hints about whether the asset is near the top or not so far. Bitcoin Is Observing A Multiplier Effect Of 4-5x Right Now In a new post on X, the lead on-chain analyst at Glassnode, Checkmate, has discussed the &#8220;price multiplier&#8221; effect of Bitcoin. This effect refers to the fact that the capital that flows into the cryptocurrency is not always (in fact, most of the time) the same as the change reflected in the market cap. Related Reading: Sell The News: Bitcoin Short-Term Holders Participate In $2 Billion Selloff To track the exact ratio between the two, Glassnode has defined the &#8220;Realized Capital to Valuation Change Ratio.&#8221; This indicator measures how much capital flows into the &#8220;Realized Cap&#8221; for every unit change in the market cap. The Realized Cap refers to a capitalization model for Bitcoin that assumes that the real value of each coin in circulation is not the current spot price but the price at the time it was last transferred on the blockchain. This last transfer could be considered the previous moment the coin changed hands, so the Realized Cap adds up the cost basis or acquisition value of all coins in circulation. Put another way, the Realized Cap is a model that measures the total amount of capital the investors have used to buy Bitcoin. Now, here is a chart that shows the trend in the BTC Realized Capital to Valuation Change Ratio over the past several years: The data for the 90-day change in the metric &#124; Source: @_Checkmatey_ on X The above graph shows that the Bitcoin Realized Capital to Valuation Change Ratio (90-day) has recently been below the 4-year median of 0.25. As Checkmate notes, this model suggests the current multiplier effect of BTC is around 4 to 5 times. This means that for every $0.20 to $0.25 going into the realized cap, the market cap is moving by $1. From the chart, it&#8217;s apparent that the multiplier has generally shot up during bull markets. &#8220;Bull market tops often correspond with $0.80 to over $1.0 in capital inflows needed to achieve a $1 change in the market cap (unsustainable &#60; 1x Multipler),&#8221; explains the Glassnode lead. On the other hand, bear markets &#8220;often see heightened volatility with $0.2 in capital flows having a $1.0 impact on MCap (5x Multipler),&#8221; according to the analyst. Suppose this historical pattern is anything to go by. In that case, the current Bitcoin multiplier is still at relatively low values, which would imply the cryptocurrency still has a lot of room to go before a potential top is encountered. Related Reading: PEPE Breaks Out Of Descending Channel: Analyst Puts These Targets Another curious pattern in the ratio is also visible in the same chart. It appears that the 4-year median has been going down as the years have passed. This would mean that BTC&#8217;s market cap has, on average, been becoming easier to shift with time. BTC Price In the past day, the Bitcoin spot ETFs were finally cleared by the US SEC, and it would appear that the market has reacted by buying this news, as the price has now breached the $48,000 level. Looks like the price of the coin has shot up over the past day &#124; Source: BTCUSD on TradingView Featured image from Dmytro Demidko on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-12T01:00:04.000Z",
    "title": "Trader Says Altcoin From Bitcoin Ecosystem Has a Lot of Room To Run, Updates Outlook on SEI and BONK",
    "url": "https://dailyhodl.com/2024/01/11/trader-says-altcoin-from-bitcoin-ecosystem-has-a-lot-of-room-to-run-updates-outlook-on-sei-and-bonk/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/trader-says-lot-room.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/trader-says-lot-room.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/trader-says-lot-room.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/trader-says-lot-room.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/trader-says-lot-room.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/trader-says-lot-room.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/trader-says-lot-room.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Widely followed crypto trader Altcoin Sherpa is bullish on one altcoin operating in the Bitcoin (BTC) ecosystem. The pseudonymous analyst tells his 205,000 followers on the social media platform X that Stacks (STX) has more upside potential. &#8220;STX: entry at $1.75 or around there would be excellent. Eyes on this one. I think it&#8217;s really [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/11/trader-says-altcoin-from-bitcoin-ecosystem-has-a-lot-of-room-to-run-updates-outlook-on-sei-and-bonk/\">Trader Says Altcoin From Bitcoin Ecosystem Has a Lot of Room To Run, Updates Outlook on SEI and BONK</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]