[
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T20:00:39.000Z",
    "title": "Cathie Wood’s ARK buys $21.6M Coinbase shares as SEC doubles down on crypto crackdown",
    "url": "https://www.cryptopolitan.com/cathie-woods-ark-buys-21-6m-coinbase-shares/",
    "description": "Cathie Wood&#8217;s Ark Investment Management, the second-largest holder of Coinbase Global (COIN) stock, boosted its investment in the crypto exchange after the U.S. Securities and Exchange Commission sued the only publicly traded crypto exchange, causing a sharp fall in share prices. The SEC filed a lawsuit against the crypto exchange Coinbase on June 6, alleging ... <a title=\"Cathie Wood&#8217;s ARK buys $21.6M Coinbase shares as SEC doubles down on crypto crackdown\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cathie-woods-ark-buys-21-6m-coinbase-shares/\" aria-label=\"More on Cathie Wood&#8217;s ARK buys $21.6M Coinbase shares as SEC doubles down on crypto crackdown\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T19:54:42.000Z",
    "title": "Binance CEO receives summons from U.S. court in response to SEC lawsuit",
    "url": "https://www.cryptopolitan.com/binance-ceo-receives-summons-from-u-s-court-in-response-to-sec-lawsuit/",
    "description": "In the latest twist of events surrounding Binance, the United States District Court for Washington, D.C. has issued a summons for Binance CEO Changpeng Zhao. This development follows the recent lawsuit the US Securities and Exchange Commission (SEC) filed against the exchange, alleging violations of US securities laws. The summons, issued on June 7th, grants ... <a title=\"Binance CEO receives summons from U.S. court in response to SEC lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-ceo-receives-summons-from-u-s-court-in-response-to-sec-lawsuit/\" aria-label=\"More on Binance CEO receives summons from U.S. court in response to SEC lawsuit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T19:52:03.000Z",
    "title": "Ex-NFL owner faces 75-month prison sentence over crypto",
    "url": "https://www.cryptopolitan.com/ex-nfl-owner-prison-sentence-over-crypto/",
    "description": "The past few days have been somber in the world of the NFL, not for losses on the gridiron, but in the courtroom. In a recent turn of events that has left the sports community in shock, former NFL owner, Reginald Fowler, was met with a hefty 75-month prison sentence. The charges? Orchestrating unregulated transactions, ... <a title=\"Ex-NFL owner faces 75-month prison sentence over crypto\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ex-nfl-owner-prison-sentence-over-crypto/\" aria-label=\"More on Ex-NFL owner faces 75-month prison sentence over crypto\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T19:41:07.000Z",
    "title": "America’s true impact on the world’s economy",
    "url": "https://www.cryptopolitan.com/americas-true-impact-on-the-worlds-economy/",
    "description": "America has quietly redefined its role in the international economic sphere, a change that carries profound implications not only for the world economy but also for the intricate web of global alliances. As America formulates its new blueprint for international economic engagement, the primary concern appears to be strategic competition with China. America&#8217;s Dual-Purpose Industrial ... <a title=\"America&#8217;s true impact on the world&#8217;s economy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/americas-true-impact-on-the-worlds-economy/\" aria-label=\"More on America&#8217;s true impact on the world&#8217;s economy\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-07T20:00:16.000Z",
    "title": "Stake Your Claim in the Crypto Landscape with Polkadot (DOT) and DigiToads (TOADS) Presale",
    "url": "https://nulltx.com/stake-your-claim-in-the-crypto-landscape-with-polkadot-dot-and-digitoads-toads-presale/",
    "description": "The crypto landscape has been a yielding investment option for people interested in long-term returns. The high turnaround of some cryptocurrencies makes them the best cryptos to buy. Although the volatile market and many crypto projects may not appear promising, presale tokens are some of the best coins to stake your claim on. DigiToads (TOADS) [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-07T19:42:35.000Z",
    "title": "Changpeng Zhao summoned in SEC lawsuit by US court",
    "url": "https://crypto.news/changpeng-zhao-summoned-in-sec-lawsuit-by-us-court/",
    "description": "The United States district court in Washington, D.C. wasted no time in issuing a summons for Binance CEO Changpeng Zhao on June 7."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-07T20:00:20.000Z",
    "title": "Shiba Inu (SHIB) Price Could Soar To Major Highs Soon, Here’s Why",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-shib-price-could-soar-to-major-highs-soon-heres-why/",
    "description": "Shiba Inu (SHIB) appears to be refueling its engines following a recent downturn. As the crypto community collectively holds its breath, the dog-inspired cryptocurrency could skyrocket to major highs sooner than expected. The latest catalyst propelling SHIB&#8217;s resurgence is a leap into the Metaverse. On June 6, the Shiba Inu Metaverse division unveiled its impending release of the long-awaited Rocket Pond trailer. As an integral part of Shiba&#8217;s virtual cosmos, the reveal of this trailer is set to enchant audiences with a peek into the Metaverse odyssey. The Dawn Of The SHIB Metaverse: Rocket Pond Since the unveiling of Rocket Pond&#8217;s initial sketch in September 2022, the SHIB community has been buzzing with anticipation. The release of the colored design offered users a preview of the Metaverse&#8217;s visual prowess, setting the stage for a reveal. Related Reading: Shiba Inu (SHIB) Poised For Significant Breakout: Here’s What To Watch Out For The SHIB Metaverse development squad amplified the excitement, taking to Twitter to tease their forthcoming release: We&#8217;re thrilled to announce that the trailer for Rocket Pond will be released tomorrow! We are so excited about the impressive progress the project has made, and this is just the beginning. Get ready to be amazed Rocket Pond is described as a secluded mountain retreat, infusing elements of quintessential camping experiences akin to YMCA or KOA, with modern attractions.  Rocket Pond To Soar SHIB&#8217;s Value The anticipated trailer showcases the narrative and design of Rocket Pond. This Metaverse hub is designed to provide users with an immersive experience. The charm of Rocket Pond draws its inspiration from picturesque locations such as Cape Canaveral, the Monument to the Conquerors of Space, Lake Tahoe, Glenwood Caverns Adventure Park, and Heavenly Village. The SHIB Metaverse merges nature with modern luxuries; particularly, Rocket Pond presents a unique offering. Notably, as this facet of the SHIB Metaverse continues to charm the community, it carries the potential to bolster the value and recognition of SHIB. The successful launch and adoption of Rocket Pond could fuel renewed interest and investment in Shiba Inu. This influx of attention could invariably lead to increased demand for SHIB, thereby providing upward pressure on its price. Related Reading: Shiba Inu Whale Accumulates 261 Billion Shib Tokens In Just Three Days With the confluence of factors, including the resurgence of SHIB and the rising popularity of Metaverses, Rocket Pond&#8217;s impact could send Shiba Inu (SHIB) soaring to new highs. Meanwhile, SHIB has been in the red over the past 7 days, down by 5.5%. Interestingly, despite the unveiling of the Rocket Pond trailer, the dog-inspired memecoin has recorded a continuous downtrend in the past 24 hours, down by 1.9% with a market price of $0.00000792. Featured image from Shutterstock, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-07T20:00:05.000Z",
    "title": "Veteran Trader Tone Vays Says Bitcoin (BTC) Presenting Prime Opportunity for Bulls – Here’s His Outlook",
    "url": "https://dailyhodl.com/2023/06/07/veteran-trader-tone-vays-says-bitcoin-btc-presenting-prime-opportunity-for-bulls-heres-his-outlook/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/veteran-trader-btc-prime.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/veteran-trader-btc-prime.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/veteran-trader-btc-prime.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/veteran-trader-btc-prime.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/veteran-trader-btc-prime.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/veteran-trader-btc-prime.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/veteran-trader-btc-prime.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Seasoned trader Tone Vays believes that the latest Bitcoin (BTC) correction is giving bulls the chance to load up on the top crypto by market cap at discounted prices. In a new strategy session, Vays tells his 123,000 YouTube subscribers that Bitcoin&#8217;s dip on Monday is largely a news-driven event. According to the trader, investors got [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/07/veteran-trader-tone-vays-says-bitcoin-btc-presenting-prime-opportunity-for-bulls-heres-his-outlook/\">Veteran Trader Tone Vays Says Bitcoin (BTC) Presenting Prime Opportunity for Bulls – Here’s His Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-07T19:55:53.000Z",
    "title": "Senator Haggerty Tells Gary Gensler To Expect To Hear From Congress as US Officials Respond to SEC Lawsuits",
    "url": "https://dailyhodl.com/2023/06/07/senator-haggerty-tells-gary-gensler-to-expect-to-hear-from-congress-as-us-officials-respond-to-sec-lawsuits/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/11/senator-propose-accelerate.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/11/senator-propose-accelerate.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/11/senator-propose-accelerate.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/11/senator-propose-accelerate.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/11/senator-propose-accelerate.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/11/senator-propose-accelerate.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/11/senator-propose-accelerate.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>US lawmakers are issuing a warning to the Chair of the U.S. Securities and Exchange Commission (SEC), saying that he could soon hear from Congress. In a recent announcement, Republican Senator Bill Haggerty of Tennessee says that the SEC Is weaponizing itself to destroy an entire industry and tells Chair Gary Gensler to anticipate having [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/07/senator-haggerty-tells-gary-gensler-to-expect-to-hear-from-congress-as-us-officials-respond-to-sec-lawsuits/\">Senator Haggerty Tells Gary Gensler To Expect To Hear From Congress as US Officials Respond to SEC Lawsuits</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]