[
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T02:42:25.000Z",
    "title": "UK to spend $130M on AI chips amid scramble to buy up computing power",
    "url": "https://cointelegraph.com/news/rishi-sunak-buy-ai-chips-in-race-for-computing-power",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/6268bb3f-2dfa-4019-9dad-b83c1b52ebee.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The chips will be used to set up an AI resource as a recent report said 20% of firms can’t get enough computing power for AI.</p>\n                    <p><p>British Prime Minister Rishi Sunak is set to spend $130 million (100 million pounds) to buy thousands of computer chips to power artificial intelligence, amid a global shortage and race for computing power.</p><p>The Telegraph <a href=\"https://www.telegraph.co.uk/business/2023/08/20/sunak-spend-100m-taxpayer-cash-ai-chips-global-race/\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on Aug. 20 that the United Kingdom aims to build an \"AI Research Resource\" by mid-2024 as part of Sunak’s plan to <a href=\"https://cointelegraph.com/news/uk-to-get-early-or-priority-access-to-ai-models-from-google-and-openai\">make the country an AI tech hub</a>.</p><p>The government is reportedly sourcing chips from makers NVIDIA, Intel and AMD — and it is understood that the science funding body UK Research and Innovation — which is leading the effort — is in the late stages of ordering 5,000 <a href=\"https://cointelegraph.com/news/nvidia-drops-new-ai-chip-expected-to-cut-development-costs\">NVIDIA graphic processing units</a> (GPUs). </p><p>However, while $130 million has been allocated to the project, the funds are reportedly seen as insufficient to match Sunak’s AI hub ambition, meaning government officials could pressure for more funding in an upcoming November AI safety summit.</p><p>It follows a recent report that said many companies are struggling to deploy AI due to available resources and technical obstacles.</p><p>In March, an independent <a href=\"https://www.gov.uk/government/publications/future-of-compute-review/the-future-of-compute-report-of-the-review-of-independent-panel-of-experts\" target=\"_blank\" rel=\"noopener nofollow\">review</a> of the country’s AI computing capabilities said investment in the space is “seriously lagging” behind international counterparts <a href=\"https://cointelegraph.com/news/ai-working-group-announced-by-house-democrats\">in the United States</a> and European Union.</p><p>At the time, less than 1,000 NVIDIA chips were available for researchers to train <a href=\"https://cointelegraph.com/news/how-to-use-third-party-chatgpt-plugins\">AI models</a> — a panel recommended the U.K. make available at least 3,000 top-quality chips to meet immediate needs.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/us-china-ai-tech-standoff-spread-overseas\"><strong><em>US and China AI-tech standoff shows signs of spreading to other countries</em></strong></a></p><p>On Aug. 16, S&amp;P Global’s global AI trend <a href=\"https://www.weka.io/lp/2023-global-trends-in-ai/\" target=\"_blank\" rel=\"noopener nofollow\">report</a> found that many firms reported they’re not ready to support AI, due to not having enough computing power, along with challenges managing data and security concerns.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We teamed with S&amp;P Global to launch a global survey of <a href=\"https://twitter.com/hashtag/AI?src=hash&amp;ref_src=twsrc%5Etfw\">#AI</a> practitioners &amp; decision-makers to see what’s driving or hindering their AI projects.  <br><br>Today, we published the survey’s findings in this new 2023 Global Trends In AI report. Get the skinny here <a href=\"https://t.co/k9W5AQ9hwg\">https://t.co/k9W5AQ9hwg</a></p>&mdash; WEKA (@WekaIO) <a href=\"https://twitter.com/WekaIO/status/1691802710855581957?ref_src=twsrc%5Etfw\">August 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While it's still early days for AI — S&amp;P senior research analyst Nick Patience said a deciding factor for who will lead in the space will be decided by who can support AI workloads.</p><p><strong><em>AI Eye: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-apple-devloping-pocket-ai-deep-fake-music-deal-hypnotize-gpt-4/\"><strong><em>Apple developing pocket AI, deep fake music deal, hypnotizing GPT-4</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2023-08-21T02:59:39.000Z",
    "title": "Avalanche and TRON’s Stagnation Pushing Investors Towards Rising Crypto Gem",
    "url": "https://nulltx.com/avalanche-and-trons-stagnation-pushing-investors-towards-rising-crypto-gem/",
    "description": "As Avalanche (AVAX) and TRON navigate through price shifts and moments of inactivity, Borroe ($ROE) emerges as a luminary in the domain of Web3 Blockchain Innovation. At the forefront of this revolution is Borroe ($ROE), pioneering Web3. In a landscape where investors are ceaselessly pursuing inventive and promising avenues for growth, Borroe ($ROE) confidently secures [&#8230;]"
  }
]