[
  {
    "source": "Cointelegraph",
    "date": "2024-01-05T20:43:55.000Z",
    "title": " CertiK&#039;s X account briefly hacked by Forbes impersonator ",
    "url": "https://cointelegraph.com/news/certik-x-account-briefly-hacked-forbes-impersonator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvN2IzNDllN2UtNDdiNy00ODIxLTk1OGItZmU2NDkwYThiNGEyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The scammer posted a malicious message urging readers to revoke approvals using a fake Revoke.cash app.</p>\n                    <p><p>A phishing scammer who posed as a Forbes reporter briefly <a href=\"https://twitter.com/CertiK/status/1743252309662912937\" target=\"_blank\" rel=\"noopener nofollow\">gained</a> access to the X (formerly Twitter) account of blockchain security platform CertiK and used it to post messages advertising a malicious Web3 app, according to a Jan. 5 X post from CertiK.</p><p>The malicious messages were discovered within seven minutes of them being posted, CertiK claimed, and the team immediately began a recovery process to remove the attacker's access to its X account. Within 14 minutes, the team managed to delete the first of the malicious posts. After 37 minutes, the team’s investigation was over and the danger was neutralized. </p><p>CertiK claimed that the scam was part of “a large scale ongoing attack” similar to the one described by X user NFT_Dreww.eth in a Dec. 21 post. NFT_Dreww.eth had <a href=\"https://twitter.com/nft_dreww/status/1737824627378798897\" target=\"_blank\" rel=\"noopener nofollow\">described</a> a phishing scam in which the attacker posed as a Forbes reporter and asked victims to connect their X accounts to the Calendly calendar app to schedule a meeting. The links did not actually go to Calendly’s official website. Instead, they went to a fake Calendly site with a misspelled URL. Once the victim “connected” their X account to the fake site, they unwittingly approved permissions for the attacker to post to X on their behalf.</p><p><a href=\"https://cointelegraph.com/news/certik-x-account-briefly-hacked-forbes-impersonator\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-05T21:00:05.000Z",
    "title": "TechCrunch reporter revises Bitcoin ETF prediction, expects greenlight next week",
    "url": "https://cryptoslate.com/techcrunch-reporter-revises-bitcoin-etf-prediction-expects-greenlight-next-week/",
    "description": "<p>TechCrunch reporter Jacquelyn Melinek posted a statement on Jan. 5 updating her expected timeline for spot Bitcoin ETF approvals. Earlier, Melinek said she had spoken with sources and &#8220;expected something&#8221; on Friday without explicitly stating that an approval would occur. Today, she postponed the expected date in a message on X, writing: &#8220;Hearing similar/new updates [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/techcrunch-reporter-revises-bitcoin-etf-prediction-expects-greenlight-next-week/\">TechCrunch reporter revises Bitcoin ETF prediction, expects greenlight next week</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-05T20:57:00.000Z",
    "title": "Crypto Investment Surge: Solana Outperformed Ethereum with $167M Inflows Last Year",
    "url": "https://www.cryptoglobe.com/latest/2024/01/crypto-investment-surge-solana-outperformed-ethereum-with-167m-inflows-last-year/",
    "description": "Over the last year, cryptocurrency investment products saw inflows of around $2.2 billion, with Bitcoin-focused products making up the lion’s share of these funds, with $1.93 billion coming in from institutional investors. When it comes to altcoins, the leading altcoin these investors bet on what the smart contract platform Solana ($SOL), which saw inflows of […]\n"
  },
  {
    "source": "NullTX",
    "date": "2024-01-05T20:58:41.000Z",
    "title": "Celestia Achieves New All-Time High At $17.23 Following Raas Deployment",
    "url": "https://nulltx.com/celestia-achieves-new-all-time-high-at-17-23-following-raas-deployment/",
    "description": "In the past 24 hours, Celestia&#8217;s native token, $TIA, surged from a low of $14.68 to hit an all-time high (ATH) at $17.23, currently experiencing a slight dip to $15.46 at press time. Despite this minor decline, Celestia has exhibited remarkable growth, boasting a weekly chart increase of over 28%. [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-05T21:00:04.000Z",
    "title": "dYdX Founder Skeptical Of Current Bull Run, Cites Low Participation",
    "url": "https://www.newsbtc.com/news/dydx-founder-skeptical-of-bull-run-low-participation/",
    "description": "Taking to X on January 5, Antonio Juliano, the founder of dYdX, a decentralized exchange (DEX), expressed skepticism regarding the current crypto bull run. Juliano attributed the recent price surge to &#8220;light trading volumes.&#8221; This formation might, despite the overall confidence, not sustain the uptrend. Founder: This Bull Run Is Different, Participation Is Low Juliano asserted that a true bull cycle is not defined solely by price action but by participation and community enthusiasm. The founder continued that this &#8220;does not seem to be happening yet.&#8221; Related Reading: Ethereum Mega Whales Continue To Buy: Do They Know Something You Don’t? The founder attributed the lack of widespread adoption to the absence of &#8220;groundbreaking&#8221; products that have captured the attention of a &#8220;broader&#8221; audience. However, releasing these &#8220;products&#8221; to the market could revive activity, driving crypto trading volume.  Juliano&#8217;s comments come ahead of the potential approval of the first spot Bitcoin exchange-traded fund (ETF) by the U.S. Securities and Exchange Commission (SEC). Among several applicants are Fidelity, Grayscale, and BlackRock. Insiders claim the agency could approve the first product in the coming days.  A spot Bitcoin ETF may open the floodgates to institutional investors, allowing them to gain exposure to the Bitcoin and crypto market in a regulated manner. As it is currently structured, willing institutions regulated by the SEC can only get exposure through Grayscale&#8217;s products, including the GBTC. Along the same line, some commentators have speculated that the SEC&#8217;s approval of a spot Bitcoin ETF could lead to the approval of a spot Ethereum ETF in 2024. An Ethereum Futures ETF was approved in 2023 and is currently available for trading. Even so, the product, like Bitcoin Futures ETFs that are widespread, tracks an Ethereum index price, not the Ethereum spot rate. Even so, whether the SEC will greenlight a spot Ethereum ETF remains to be seen.  Will A Bitcoin ETF Approval Revive DYDX Demand? Trading volume is a critical metric for measuring participation and, thus, interest in a particular asset. The higher it is, the more liquid the asset is.  Depending on the prevailing sentiment, this might support prices or lead to a sell-off. As the crypto community eagerly waits for the SEC to decide on the flagship product, altcoins, including DYDX, have been firm. Related Reading: Maker Market Heats Up: Over 600 Addresses Complete MKR Trades In Single Day Looking at the DYDX price chart in the daily chart, prices are moving horizontally but relatively high from the October 2023 lows.  The coin is up roughly 50% but remains under pressure in the short term. DYDX is down 40% from November 2023 peaks, trading below December 2023 lows in a bearish breakout formation. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-05T21:00:45.000Z",
    "title": "Solana (SOL) Primed to Implode by 80% and Sink to $20, Predicts Bitcoin (BTC) Bull Max Keiser",
    "url": "https://dailyhodl.com/2024/01/05/solana-sol-primed-to-implode-by-80-to-20-predicts-bitcoin-btc-bull-max-keiser/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/sol-primed-implode-by.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/sol-primed-implode-by.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/sol-primed-implode-by.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/sol-primed-implode-by.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/sol-primed-implode-by.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/sol-primed-implode-by.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/sol-primed-implode-by.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bitcoin (BTC) firebrand Max Keiser thinks Ethereum (ETH) rival Solana (SOL) is primed to implode. The outspoken crypto pundit predicts SOL will crash down to $20, a more than 80% drop from its current price point. &#8220;SOL shitcoin-aholics will: 1. Lose 100% purchasing power vs. Bitcoin 2. Get rug pulled (a few times) 3. ‘Time’ [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/05/solana-sol-primed-to-implode-by-80-to-20-predicts-bitcoin-btc-bull-max-keiser/\">Solana (SOL) Primed to Implode by 80% and Sink to $20, Predicts Bitcoin (BTC) Bull Max Keiser</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-05T20:55:01.000Z",
    "title": "Crypto Analyst Says Bear Market Is in the Rearview, Updates Outlook on Bitcoin (BTC) and Uniswap (UNI)",
    "url": "https://dailyhodl.com/2024/01/05/crypto-analyst-says-bear-market-is-in-the-rearview-updates-outlook-on-bitcoin-btc-and-uniswap-uni/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/08/bitcoin-bear-bull.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/08/bitcoin-bear-bull.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/08/bitcoin-bear-bull.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/08/bitcoin-bear-bull.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/08/bitcoin-bear-bull.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/08/bitcoin-bear-bull.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/08/bitcoin-bear-bull.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says is updating his bull market outlook, starting with Bitcoin (BTC). Pseudonymous crypto trader Rekt Capital tells their 382,300 followers on the social media platform X that with the bear market behind BTC, a full bull market lies ahead. &#8220;There&#8217;s an entire BTC Bear Market behind us And an entire BTC [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/05/crypto-analyst-says-bear-market-is-in-the-rearview-updates-outlook-on-bitcoin-btc-and-uniswap-uni/\">Crypto Analyst Says Bear Market Is in the Rearview, Updates Outlook on Bitcoin (BTC) and Uniswap (UNI)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]