[
  {
    "source": "CoinDesk",
    "date": "2023-12-07T22:24:51.000Z",
    "title": "Solana Protocol Kamino Eyes Airdrop Following Jito Token Launch",
    "url": "https://www.coindesk.com/business/2023/12/07/solana-protocol-kamino-eyes-airdrop-following-jito-token-launch/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Solana's SOL token has more than tripled since mid-October as DeFi traders return to the ecosystem's on-chain trading, borrowing, lending and yield-generating projects, most notably Kamino."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-07T22:15:00.000Z",
    "title": " Bitcoin options data shows whales betting big — Will $50K BTC come in January? ",
    "url": "https://cointelegraph.com/news/bitcoin-options-data-shows-whales-betting-big-will-50k-btc-come-in-january",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNmZhMzRhOGQtMDkxMS00NmQyLWIxMjMtNTAxOTM1ZTkyNTc5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Institutional investor interest soars as Bitcoin options open interest hits record high.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) options open interest reached an unprecedented milestone, surging to a staggering $20.5 billion on Dec. 7. This remarkable achievement signifies the active <a href=\"https://cointelegraph.com/news/bitcoin-beneficiary-crypto-funds-notch-10-week-streak-coinshares\" >involvement of institutional investors</a> in the cryptocurrency space. Unlike futures contracts, BTC options come with predetermined expiration prices, offering valuable insights into traders’ expectations and the markets’ sentiment.</p><p>At the forefront of the Bitcoin options market stands Deribit, boasting an impressive 90% market share. The exchange currently holds a substantial $2.05 billion open interest for options expiring on Jan. 26. However, it's worth noting that a significant portion of these bets may lose their value as the deadline approaches. </p><p>Nonetheless, with the prospect of a spot exchange-traded fund (ETF) gaining regulatory approval, previously sidelined bullish bets are reentering the playing field.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-options-data-shows-whales-betting-big-will-50k-btc-come-in-january\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-07T22:30:04.000Z",
    "title": "Ten years ago, Michael Saylor worried Bitcoin might fail at $1k",
    "url": "https://cryptoslate.com/ten-years-ago-michael-saylor-worried-bitcoin-might-fail-at-1k/",
    "description": "<p>A decade ago, MicroStrategy CEO Michael Saylor expressed skepticism about Bitcoin, warning about possible regulatory threats. On Dec. 7, 2013, Saylor wrote: &#8220;Lacking a credible sponsor, #Bitcoin is in imminent danger of being regulated out of existence.&#8221; In the decade since, not only has Bitcoin not been regulated out of existence, but it has thrived, [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ten-years-ago-michael-saylor-worried-bitcoin-might-fail-at-1k/\">Ten years ago, Michael Saylor worried Bitcoin might fail at $1k</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  }
]