[
  {
    "source": "Cointelegraph",
    "date": "2023-09-08T21:30:00.000Z",
    "title": "Crypto Biz: Coinbase’s lending bet, a new ads policy at Google and Marathon’s mining performance",
    "url": "https://cointelegraph.com/news/crypto-biz-coinbase-s-lending-bet-a-new-ads-policy-at-google-and-marathon-s-mining-performance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/decdf1f1-0cb9-4810-86f5-9031c95d0562.jpeg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This week’s Crypto Biz explores Coinbase's lending platform, Marathon Digital’s latest Bitcoin mining report, Hana Bank’s move to offer crypto custody and Google’s new crypto ads policy.</p>\n                    <p><p>Crypto giant Coinbase seems to be strategically steering its ship amid constant crypto industry turbulence in 2023. The company recently unveiled its lending platform for institutional investors, aiming to fill the void left behind by major players during 2022’s crypto winter, when firms such as Celsius Network, BlockFi and Genesis went bankrupt. </p><p>The move comes after the company shut down its Borrow service for retail customers in May amid regulatory scrutiny. The service allowed certain customers to use crypto as collateral to receive a cash loan. The new lending solution, however, focuses on institutional investors — companies or organizations investing on behalf of their clients, such as mutual funds and pension plans. </p><p>Coinbase’s new venture amassed millions in capital within a few days of launching, documents filed with the United States Securities and Exchange Commission (SEC) show. Despite headwinds and uncertainty, the service debut indicates that crypto lending among high-profile investors is still in demand in the United States.</p><p>This week’s Crypto Biz also explores Marathon Digital’s latest Bitcoin mining report, Hana Bank’s move to offer crypto custody and Google’s new crypto ads policy.</p><h3>Coinbase launches crypto lending platform for U.S. institutions</h3><p>Crypto exchange Coinbase <a href=\"https://cointelegraph.com/news/coinbase-launches-crypto-loans-for-institutional-investors\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coinbase-launches-crypto-loans-for-institutional-investors/amp\">has rolled out a crypto lending service</a> for institutional investors in the U.S., which reportedly seeks to capitalize on massive failures in the crypto lending market. According to a filing with the SEC, Coinbase customers have already invested over $57 million in the lending program since the first sale occurred on Aug. 28. In another headline, Coinbase’s recently released Base network reached over 700,000 nonfungible tokens (NFTs) minted in August. The tokens minted were part of the launch’s strategy to spur adoption. Base’s launch, however, has not been flawless. The network <a href=\"https://cointelegraph.com/news/coinbase-base-network-major-outage\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coinbase-base-network-major-outage/amp\">suffered an outage</a> on Sept. 5 when its sequencer stopped producing blocks. Several scams have also been promoted on the network, including a $6.5 million rug-pull by Magnate Finance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/c9996010-0a8a-4b00-9175-35db1e6256f2.png\"><figcaption style=\"text-align: center;\"><em>Data from a SEC filing by Coinbase Credit. Source: Coinbase SEC Filings</em></figcaption></figure><h3>Marathon’s Bitcoin mining rate fell 9% in August</h3><p>Crypto mining operator Marathon Digital Holdings <a href=\"https://cointelegraph.com/news/marathon-s-bitcoin-mining-rate-fell-9-in-august\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/marathon-s-bitcoin-mining-rate-fell-9-in-august/amp\">produced 1,072 Bitcoin in August</a> — 9% less than in July. According to the company, the smaller production resulted from increased curtailment activity in Texas due to record-high temperatures. The term curtailment refers to the reduction of electricity generated to maintain a balance between demand and supply. The temporary shutdowns more than offset the progress made by the company to increase its operational hash rate and optimize operations, according to its CEO, Fred Thiel. Marathon increased its U.S. operational hash rate by 2% month-over-month to 19.1 exahashes in August. The performance increase is attributed to the upgrade of Bitmain Antminer S19j Pro miners to the more efficient S19 XP models.</p><h3>Google will allow ads for NFT games starting Sept. 15</h3><p>Google has <a href=\"https://cointelegraph.com/news/google-ads-nft-cryptocurrency-games-september\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/google-ads-nft-cryptocurrency-games-september/amp\">updated its cryptocurrency advertising policy</a> to allow for blockchain-based NFT gaming advertisements as long as they don’t promote gambling or gambling services. The new policy will continue to ban advertisements for games that allow players to wager or stake NFTs against other players or for rewards. NFT casino games offering players to wager or play for prizes — such as NFTs, cash or cryptocurrency — will also continue to be banned. Google previously banned all cryptocurrency-related advertising across its platforms in March 2018. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">NFT gaming advertisements will soon be welcome on Google's Search platform as long as they don't promote any form of gambling. <a href=\"https://t.co/gSVeHxxkjx\">https://t.co/gSVeHxxkjx</a></p>— Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1699454677665075251?ref_src=twsrc%5Etfw\">September 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>South Korean Hana Bank enters crypto custody business with BitGo</h3><p>One of the largest South Korean banks, KEB Hana Bank, <a href=\"https://cointelegraph.com/news/south-korean-hana-bank-enters-crypto-custody-business-with-bitgo\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/south-korean-hana-bank-enters-crypto-custody-business-with-bitgo/amp\">is moving to offer digital asset custody services</a> through a new partnership with cryptocurrency custody firm BitGo Trust Company. According to local media reports, KEB Hana Bank signed a strategic business agreement with BitGo to jointly establish digital asset custody in South Korea. The commercial bank has a network of 111 branches with local banking assets of nearly $10 billion and equity of $490 million. Together, Hana Bank and BitGo plan to launch their joint cryptocurrency custody venture in the second half of 2024.</p><p><em>Crypto Biz is your weekly pulse of the business behind blockchain and crypto, delivered directly to your inbox every Thursday.</em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T21:13:18.000Z",
    "title": "Joe Biden has a Saudi problem – and it is really very bad",
    "url": "https://www.cryptopolitan.com/biden-saudi-problem-is-really-very-bad/",
    "description": "As President Joe Biden aims his attention on bolstering the U.S. economy and battling inflation in his pursuit of re-election, he finds himself facing an emerging, problematic situation: a Saudi-imposed oil price surge. With Saudi Arabia and Russia joining forces to push oil prices closer to the alarming $100 mark, Biden&#8217;s economic strategies are in ... <a title=\"Joe Biden has a Saudi problem &#8211; and it is really very bad\" class=\"read-more\" href=\"https://www.cryptopolitan.com/biden-saudi-problem-is-really-very-bad/\" aria-label=\"More on Joe Biden has a Saudi problem &#8211; and it is really very bad\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-08T21:30:17.000Z",
    "title": "Charting The Course: This Indicator Sparks Confidence In Bitcoin Rise To $27,000",
    "url": "https://www.newsbtc.com/bitcoin-news/charting-the-course-this-indicator-sparks-confidence-in-bitcoin-rise-to-27000/",
    "description": "For Bitcoin (BTC), the largest cryptocurrency in the market, the month of September has seen a lack of definitive strength from both bulls and bears, resulting in a period of sideways chop and rapid bouts of volatility.  Material Indicators, a prominent crypto analysis firm, sheds light on the prevailing market conditions and highlights the intricacies of short-term price action (PA) against the backdrop of the macro sentiment. Unpredictable Market Conditions Prevail As BTC Seeks Direction Despite a bearish macro sentiment, where a broader downtrend is anticipated, short-term price action often deviates from the macro trend. This phenomenon explains the occasional short-term pumps and rallies observed even within a prevailing downtrend.  Related Reading: Dogecoin Poised for a 150% Surge? Key Price Levels to Watch Material Indicators emphasizes the importance of understanding these dynamics and the potential implications they hold for Bitcoin. Yesterday&#8217;s performance of the leading cryptocurrency may have come to a close, but Material Indicators point to indications that another rally could be on the horizon.  The firm highlights the Trend Precognition A1- indicator developed and used to spot micro, and macro trends by the firm- continues to exhibit a slight uptick in bullish momentum across the daily (D), weekly (W), and monthly (M) charts, as seen above.  This trend suggests the possibility of a resurgence in Bitcoin&#8217;s value, albeit with the need for caution and further analysis. As of the time of writing, Bitcoin is currently trading at $25,800, continuing its prolonged period of sideways price movement since the start of the month. However, it is worth noting that Bitcoin has been unable to regain the critical $26,000 level, which holds significant importance for the cryptocurrency.  Reclaiming this level is crucial in order to invalidate any potential bearish pressure and mitigate the possibility of Bitcoin experiencing a further decline in its price. Surge In New Bitcoin Addresses Signals Growing Interest  Amidst ongoing uncertainty and sideways price action, an intriguing trend has emerged that sheds light on the expanding interest in Bitcoin.  Notably, approximately 527,000 fresh Bitcoin addresses are being created on a daily basis, reaching a new yearly high. Renowned crypto analyst Ali Martinez delves into the significance of this surge and its implications for the cryptocurrency market. The surge in new Bitcoin addresses suggests a growing curiosity and engagement with the digital currency, even during a period when its price has witnessed occasional drops.  This surge in address creation indicates that an increasing number of individuals are showing interest in Bitcoin, potentially attracted by its underlying technology, decentralized nature, and potential for financial independence. For long-term investors and advocates of Bitcoin, this surge in address creation serves as a positive sign, reflecting sustained interest and trust in the cryptocurrency&#8217;s network. It demonstrates that individuals are not deterred by short-term price volatility and are committed to participating in the Bitcoin ecosystem for the long haul. Related Reading: LINK Price Surge Ahead? Chainlink Sharks Bet Big On Accumulation By actively creating new Bitcoin addresses, individuals are essentially establishing a connection to the network and positioning themselves to engage in various Bitcoin-related activities, including sending and receiving funds, participating in decentralized applications (DApps), and exploring the broader cryptocurrency ecosystem. Ali Martinez emphasizes that this upward trend in address creation is significant as it suggests an expanding user base and a potential influx of new participants into the Bitcoin market.  As more individuals join the network, it strengthens the overall resilience and legitimacy of Bitcoin, further solidifying its position as a prominent player in the global financial landscape. Featured image from iStock, chart from TradingView.com"
  }
]