[
  {
    "source": "Cointelegraph",
    "date": "2024-02-23T19:30:00.000Z",
    "title": " Thai SEC proposes to revoke license of troubled exchange Zipmex  ",
    "url": "https://cointelegraph.com/news/thai-sec-proposes-revoke-license-troubled-exchange-zipmex",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvODk4MzJjMjYtMWU4OC00NzA4LWExMzQtMTZjMjBkODk0NjU3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Asian digital asset exchange was hit hard by the crypto winter and is finding recovery difficult.</p>\n                    <p><p>The Securities and Exchange Commission Board of Thailand (SEC) has forwarded a recommendation to the Finance Ministry to revoke crypto exchange Zipmex’s digital asset business license, it announced on Feb. 23. This is the latest in a series of setbacks in Thailand for the exchange.</p><p>At a meeting on Feb. 21, the SEC also resolved that Zipmex’s business suspension, imposed on Feb. 1, would continue and clients could request the return of their assets on the exchange through March 11. After that date, Zipmex will be required to place unclaimed assets in a “trusted and secured system” and report it to the SEC. The agency <a href=\"https://www.sec.or.th/EN/Pages/News_Detail.aspx?SECID=10590&amp;NewsNo=10590&amp;NewsYear=10590&amp;Lang=10590\" target=\"_blank\" rel=\"noopener nofollow\">noted</a>:</p><p>This move comes after Zipmex failed to meet a deadline to increase its net capital and improve its personnel and management structure, which the SEC had found to be “inappropriate and insufficient.” On Ge Zipmex <a href=\"https://cointelegraph.com/news/thai-sec-zipmex-suspend-services\">was given 15 days to comply</a> with the SEC on Feb. 1. It was ordered to suspend business operations at that time. The SEC <a href=\"https://cointelegraph.com/news/thai-sec-charges-former-zipmex-ceo-fraud\">said it was charging former Zipmex CEO</a> Akalarp Yimwilai with corruption on Feb. 8.</p><p><a href=\"https://cointelegraph.com/news/thai-sec-proposes-revoke-license-troubled-exchange-zipmex\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-23T19:25:00.000Z",
    "title": " ERC-20 wallet drainer gets a business license, Aave deploys on BNB: Finance Redefined ",
    "url": "https://cointelegraph.com/news/wallet-drainer-business-license-aave-bnb-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMzVmM2FkNGUtODcxMi00M2ZlLTgyNGEtZGI5ZjcxMjJjY2M3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The creators of a wallet drainer application have registered their business in the United Kingdom.</p>\n                    <p><p data-ct-non-breakable=\"true\">Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>A “Nova Drainer” phishing tool developer has officially registered as a business in the United Kingdom. Pyth Network has introduced Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) price feeds to allow DeFi developers access to real-time market data, bridging the gap between traditional and decentralized finance. And the DeFi lending and leverage protocol Blueberry urged users to withdraw funds immediately when it discovered a mysterious exploit.</p><p>The top 100 DeFi tokens by market cap continued their bullish momentum, with total value locked (TVL) exceeding $80 billion.</p><p><a href=\"https://cointelegraph.com/news/wallet-drainer-business-license-aave-bnb-finance-redefined\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-23T19:21:13.000Z",
    "title": "CoinMarketCap launches ‘Oscars of Crypto’ to celebrate industry accomplishments",
    "url": "https://cryptoslate.com/coinmarketcap-launches-oscars-of-crypto-to-celebrate-industry-accomplishments/",
    "description": "<p>CoinMarketCap has announced the launch of the inaugural CMC Crypto Awards to recognize the accomplishments of networks, people, and technology in the crypto industry. The awards are scheduled to take place between Feb. 21 and March 6. The selection of winners will rely on CoinMarketCap data, insights from expert panels, and community votes, with the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/coinmarketcap-launches-oscars-of-crypto-to-celebrate-industry-accomplishments/\">CoinMarketCap launches &#8216;Oscars of Crypto&#8217; to celebrate industry accomplishments</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T19:21:00.000Z",
    "title": "AI Revolutionizes Marketing and Advertising: Insights from AI Connect Event",
    "url": "https://www.cryptopolitan.com/ai-revolutionizes-marketing-and-advertising/",
    "description": "The advertising and marketing sectors are witnessing a pivotal shift towards artificial intelligence (AI), a transformation underscored at the recent AI Connect event hosted at Google HQ in Dublin. The event, a collaboration between the Institute of Advertising Practitioners in Ireland (IAPI), Google, and Enterprise Ireland, brought together over 300 professionals to explore the impact [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T19:14:00.000Z",
    "title": "Uniswap Price Prediction 2024-2033: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2024-2033 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T19:13:14.000Z",
    "title": "Former FTX co-CEO to face sentencing in May",
    "url": "https://www.cryptopolitan.com/former-ftx-co-ceo-to-face-sentencing-in-may/",
    "description": "Ryan Salame, former co-CEO of FTX Digital Markets, is set to appear in a New York courtroom on May 1 for sentencing after pleading guilty to two felony counts. The charges stem from his involvement in fraudulent activities at the now-defunct cryptocurrency exchange FTX. Salame admitted guilt to one count of making unlawful political contributions [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-23T19:13:26.000Z",
    "title": "Ethereum hits $3,000 as DeeStream attracts Dogecoin and Bitcoin Cash",
    "url": "https://crypto.news/ethereum-hits-3000-as-deestream-attracts-dogecoin-and-bitcoin-cash/",
    "description": "Ethereum recently broke $3,000. Dogecoin (DOGE) and Bitcoin Cash (BCH) investors are now looking into DeeStream (DST)"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-23T19:30:46.000Z",
    "title": "Filecoin (FIL) Surges Another 9.3%, Are The Bulls Getting Ready For More?",
    "url": "https://www.newsbtc.com/news/filecoin/filecoin-fil-surges-another-9-3-are-the-bulls-getting-ready-for-more/",
    "description": "Filecoin (FIL) has been among the top gainers during the current market rally. Throughout February, FIL has shown a formidable performance fueled by the bullish momentum and its partnership with a major blockchain. This performance has analysts and important crypto actors predicting a potential bullish run around the corner for the decentralized storage network’s native token. Related Reading: Crypto Analyst Predicts 10X Move For Filecoin (FIL) To $70, But Can It Reach ATH? Should Filecoin Investors Get Ready For A Bull Run? Pseudonym analyst and trader Crypto Breakout highlighted that FIL broke through a crucial resistance in the 3-day timeframe, signaling that the “bulls return with force.” The chart shared by the analyst illustrates a downtrend pattern in FIL’s price since 2022. Two years ago, as the chart below shows, the token traded at $11 before facing a pullback that shredded about 70% of the token’s value in the following months. By February 2023, the token recovered and broke through the $9 resistance level before repeating a similar downtrend. FIL's downtrend pattern since 2022. Source: Crypto Breakout on CoinMarketCap Since 2023, the price has remained well below this level, only breaking through the $8 support zone once at the very beginning of 2024. Throughout January, FIL’s price had a turbulent performance, falling around 40%. The price has picked up the crypto market uptrend, and, as the analyst highlights, it has been gaining positive momentum. The 3-day time frame shows that FIL has been following an upward trend that led to the token breaking through the crucial $8 support zone this Friday. As the post suggests, this break out of the downtrend could signal FIL&#8217;s “beginning of an epic bullish rally” and that investors should “get ready for exciting moves ahead.” Renowned crypto analyst Ali Martinez made a similar prediction. Earlier this week, Martinez highlighted Filecoin moving within a parallel channel on the 3-day chart. He suggested a successful breakthrough from the $8.50 barrier could catapult the token’s price to $25.5. Artur Hayes Predicts $100 As FIL Continues To Rise After the token’s recent surge, BitMEX co-founder Arthur Hayes shared his FIL prediction. On an X (former Twitter) post, Hayes forecasted that FIL’s price would rally to $100, also calling the arrival of the bull market. Welcome to the bull market. May all things AI related levitate. $FIL = $100 Yachtzee 😘😘😘😘 pic.twitter.com/oggCeY8IGc &#8212; Arthur Hayes (@CryptoHayes) February 23, 2024 Filecoin, a decentralized storage network, recently integrated with Ethereum’s rival Solana to make its blockchain history more accessible and usable. According to the announcement, the integration is a significant move away from centralized storage solutions, which seek to improve reliability and scalability in the Solana blockchain. This move has considerably fueled the ongoing upward momentum for FIL. The token has shown a considerable performance in recent weeks, with FIL increasing 53.9% in the last two weeks and 67.7% in 30 days. The token trades at $8.19 at writing time, representing a 9.6% surge in 24 hours and 39.0% in the last seven days. FIL is currently the 25th largest cryptocurrency by market capitalization, at $4.2 billion, a 12.38% increase from yesterday. Its trading activity also saw a recent rise, with its daily trading volume at $895.2 million, 44% more than the day before. Related Reading: New ATH For WIF? Analyst Thinks Dogwifhat Will Go “Turbo Parabolic” Soon FIL performance in the 1-day chart. Source: FILUSDT on TradingView.com Featured image from Unsplash.com, Chart from Tradingview.com"
  }
]