[
  {
    "source": "CoinDesk",
    "date": "2024-01-12T09:41:25.000Z",
    "title": "Telcoin Restores User Balances After Exploit, Records 400% Increase in Deposits",
    "url": "https://www.coindesk.com/tech/2024/01/12/telcoin-restores-user-balances-after-exploit-records-400-increase-in-deposits/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The issue apparently resulted from a fault in the interaction between Telcoin’s digital wallet and a proxy contract that incorrectly performed certain storage functions."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-12T09:43:57.000Z",
    "title": "Ethereum Community Divided Over Vitalik’s Proposal to Increase Gas Limit",
    "url": "https://www.cryptoglobe.com/latest/2024/01/ethereum-community-divided-over-vitaliks-proposal-to-increase-gas-limit/",
    "description": "The Ethereum community is currently engaged in a debate over a recent proposal by co-founder Vitalik Buterin to increase the network’s gas limit. This suggestion, aimed at potentially improving network throughput, has sparked discussions among developers, node operators, and users, highlighting the complexities of managing a major blockchain protocol. Buterin’s Proposal for Gas Limit Increase […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-12T10:00:11.000Z",
    "title": "Coinbase’s Rollup Base Updates Roadmap and Goals for 2024",
    "url": "https://news.bitcoin.com/coinbases-rollup-base-updates-roadmap-and-goals-for-2024/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/2b5f0d32-31c5-40b7-b8d3-eeb6fedfc707-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Coinbase&#039;s Rollup Base Updates Roadmap and Goals for 2024\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/2b5f0d32-31c5-40b7-b8d3-eeb6fedfc707-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/2b5f0d32-31c5-40b7-b8d3-eeb6fedfc707-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/2b5f0d32-31c5-40b7-b8d3-eeb6fedfc707-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/2b5f0d32-31c5-40b7-b8d3-eeb6fedfc707-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/2b5f0d32-31c5-40b7-b8d3-eeb6fedfc707-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/2b5f0d32-31c5-40b7-b8d3-eeb6fedfc707-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/2b5f0d32-31c5-40b7-b8d3-eeb6fedfc707.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Base, the Coinbase incubated rollup, has updated its roadmap and goals for 2024. In a blog post, Base informed that it will not only focus on building a development platform but on fostering the decentralization of such an environment, building on-chain apps, and bringing liquidity to its ecosystem. Base to Focus on Building a &#8216;New [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-12T09:59:14.000Z",
    "title": "Extradition delay prompts request to postpone SEC trial of former Terra CEO Do Kwon",
    "url": "https://www.cryptopolitan.com/request-to-postpone-sec-trial-of-do-kwon/",
    "description": "The former CEO of Terra, Do Kwon, is facing a delay in his Securities and Exchange Commission (SEC) trial as his extradition proceedings in Montenegro are taking longer than expected.  Kwon&#8217;s counsel has requested the U.S. court postpone the trial until his arrival, expecting him won&#8217;t be in the United States until February or March. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-12T09:43:57.000Z",
    "title": "Navigating the Competitive Job Market of 2024: Avoiding Resume Red Flags",
    "url": "https://www.cryptopolitan.com/navigating-competitive-job-market-of-2024/",
    "description": "In today&#8217;s fiercely competitive job market, standing out is essential for job seekers looking to land their dream job in 2024. However, it&#8217;s crucial to stand out as a star candidate and not as an applicant filled with resume red flags. With the employment landscape continuously evolving due to technological advancements and changing industry norms, [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-12T10:04:32.000Z",
    "title": "Early Solana (SOL) Investors Buy into the Pushd (PUSHD) Presale While Dogecoin (DOGE) Drops in Value",
    "url": "https://nulltx.com/early-solana-sol-investors-buy-into-the-pushd-pushd-presale-while-dogecoin-doge-drops-in-value/",
    "description": "Cryptocurrency investors are shifting their sights away from the current cryptos and onto newer ones. Solana (SOL) and Dogecoin (DOGE) are among the most notable casualties, considering that they are losing investors and dropping in value. In contrast, Pushd (PUSHD) is making headlines because of the stir it has caused [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-12T09:59:28.000Z",
    "title": "Binance Coin (BNB) and Meme Moguls (MGLS) Set to Surge in Value in January 2024",
    "url": "https://nulltx.com/binance-coin-bnb-and-meme-moguls-mgls-set-to-surge-in-value-in-january-2024/",
    "description": "Binance Coin, the native token of the Binance exchange, experienced steady growth in 2023. In total, its value increased by 9.21%, and its blockchain had over 1 million daily users. Now, experts predict that Binance Coin could surge in 2024 as investors look for a secure exchange for transactions. At [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-12T09:58:00.000Z",
    "title": "Crypto Analyst Egrag Crypto Thinks Ripple May Rise In 2024; Injective Awaits Major Upgrade Whilst Pullix Prepares For Q1 Launch",
    "url": "https://nulltx.com/crypto-analyst-egrag-crypto-thinks-ripple-may-rise-in-2024-injective-awaits-major-upgrade-whilst-pullix-prepares-for-q1-launch/",
    "description": "Crypto analyst Egrag Crypto posted a chart believing that Ripple could potentially pump soon. Meanwhile, the Injective community looks forward to the Volan Mainnet upgrade this week.  Also Pullix which is now in the 5th stage of its ICO is set to be launching a BETA version of its hybrid [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-12T09:55:53.000Z",
    "title": "January’s High Potential Investment Choices – Lido DAO, Rebel Satoshi, and GMT for Significant Profits",
    "url": "https://nulltx.com/januarys-high-potential-investment-choices-lido-dao-rebel-satoshi-and-gmt-for-significant-profits/",
    "description": "TLDR Lido DAO gained 60% in Q4 2023, and experts predict more growth by 2025. GMT surged 86% in Q4 2023, and analysts expect bulls to remain dominant. Rebel Satoshi emerges as a top investment after promising more presale gains.  Top altcoins like Lido DAO (LDO) and GMT (GMT) performed [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-12T09:54:38.000Z",
    "title": "Record Highs in Bitcoin Mining & Transfers; Crypto Experts Predict High-Value Surge for Rebel Satoshi",
    "url": "https://nulltx.com/record-highs-in-bitcoin-mining-crypto-experts-predict-high-value-surge-for-rebel-satoshi/",
    "description": "In the dynamic world of cryptocurrencies, Bitcoin stands out as one of the top crypto coins, breaking records in both mining activities and transactions. As enthusiasts weigh their options on what crypto to buy, the spotlight now shifts to Rebel Satoshi ($RBLZ), a community-driven meme token gaining traction for its [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-12T09:53:32.000Z",
    "title": "Shiba Inu Surpasses Ethereum In Trading Volume; InQubeta Sets The Stage For Significant Moves",
    "url": "https://nulltx.com/shiba-inu-surpasses-ethereum-in-trading-volume-inqubeta-sets-the-stage-for-significant-moves/",
    "description": "Shiba Inu (SHIB) investors who stuck with the project through its days of bearish trends are now reaping the benefits following its recent performances. This meme coin gained significant attention due to the massive burns of Shiba Inu tokens, which led to its increased value. Shiba Inu&#8217;s trading volume recently [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-12T10:00:03.000Z",
    "title": "Shiba Inu Burn Rate Skyrockets Over 300% As Price Sheds A Zero",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-burn-rate-skyrockets-over-300-as-price-sheds-a-zero/",
    "description": "The Shiba Inu burn initiative has been one of the most notable developments this week that has gained the interest of the crypto community, witnessing massive surges in its token burn rate in the past few days. Shiba Inu Burn Rate On The Rise Data from Shiba Inu burn tracker Shibburn shows that the SHIB burn rate has increased significantly in the past 24 hours. According to the tracking platform, the burn rate has witnessed a 395.43% uptick today, January 12. The tracker reveals that over 18 million SHIB tokens have been destroyed in the past 24 hours. The rise in burn rate came in light of Shiba Inu experiencing a price rally which has led to the token erasing another zero. Related Reading: Shiba Inu Burn Rate Rises Rapidly In One Week, What’s Been Driving It? It is noteworthy that three burn transactions were responsible for the rise in burn rate today. Shibburn revealed that the three transactions incinerated a total of 16.56 million SHIB tokens in less than 8 hours. The first transaction carried out by the wallet address 0x618ffd1cdabee36&#8230;3f21272bd7 saw about 7.77 million SHIB tokens being burned. Additionally, another wallet address 0xab782bc7d4a2b30&#8230;f8f63ee1bc sent over 3.33 million SHIB to the burn wallet five hours later. Meanwhile, the third transaction initiated by the wallet address 0xa9d1e08c7793af6&#8230;7fb81d3e43 incinerated about 5.46 million SHIB tokens.  Over the past few days, the Shiba Inu burn rate has been recording major spikes. The development seems to have caused quite a speculative frenzy within the crypto space. On Tuesday, January 9, the tracking platform recorded an increase in burn rate of over 28,000%. The surge was caused by a burn transaction carried out by the Shiba Inu team. The team sent a whopping 9.35 billion SHIB tokens valued at $92,553 to the burn address. This marks the highest burn the team has initiated since it started burning SHIB. SHIB Erases Another Zero Post ETF Approval The majority of crypto assets are flashing green, signaling a general upturn in the cryptocurrency market. The recent approval of the Bitcoin Spot Exchange-Traded Funds (ETFs) by the SEC is largely considered to be responsible for the upward trend. Related Reading: Shiba Inu Price Enters Most Crucial Week In 1.5 Years, Here’s Why Prior to the approval of Bitcoin ETFs, Shiba Inu was trading at a comparatively low value of $0.0000095. However, after the approval, SHIB has witnessed a price increase, allowing the token to shed another zero. The increase in SHIB price post-ETF has garnered interest from investors and generated speculations over the coin&#8217;s potential for long-term growth. Currently, SHIB is trading at $0.000010, indicating a 0.60% decrease in the past 24 hours. However, the token&#8217;s trading volumes appear to be down in the past day by over 12%, according to CoinMarketCap. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-12T10:00:55.000Z",
    "title": "$CORGI, $FLOKI and $GFOX — Which is a Better Buy in 2024?",
    "url": "https://www.crypto-news-flash.com/corgi-floki-and-gfox-which-is-a-better-buy-in-2024/?utm_source=rss&utm_medium=rss&utm_campaign=corgi-floki-and-gfox-which-is-a-better-buy-in-2024",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-88.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-88.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-88-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-88-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-88-450x300.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cryptocurrency enthusiasts constantly look for the next big thing in the ever-evolving digital asset landscape. In 2024, three contenders making waves are $CORGI, $FLOKI, and the promising newcomer and the best upcoming ICO, $GFOX. Let&#8217;s dive into each to see which might be the better buy for investors seeking the next moonshot. The Rise of [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-12T09:49:03.000Z",
    "title": "Bitcoin ETFs Off to a Huge Start! More Reactions",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/bitcoin-etfs-off-to-a-huge-start-more-reactions/",
    "description": "<p>The SEC’s approval of 11 outstanding Bitcoin ETF requests is no doubt a perfect start to the year. As expected, the news was met with wild jubilation from different corners of the crypto market. Crypto Twitter is currently raving following the impressive numbers recorded on the first day of trading. Let&#8217;s describe how was the [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/bitcoin-etfs-off-to-a-huge-start-more-reactions/\">Bitcoin ETFs Off to a Huge Start! More Reactions</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-12T09:53:57.000Z",
    "title": "“Grossly Unfair”: FTX Customers Ask Court to Block Valuation Plan",
    "url": "https://coinedition.com/grossly-unfair-ftx-customers-ask-court-to-block-valuation-plan/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/FTX_customers_file_class_action_to_lay_claim_to_dwindling_assets.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX_customers_file_class_action_to_lay_claim_to_dwindling_assets\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/FTX_customers_file_class_action_to_lay_claim_to_dwindling_assets.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/FTX_customers_file_class_action_to_lay_claim_to_dwindling_assets-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/FTX_customers_file_class_action_to_lay_claim_to_dwindling_assets-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/FTX_customers_file_class_action_to_lay_claim_to_dwindling_assets-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/FTX_customers_file_class_action_to_lay_claim_to_dwindling_assets-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/FTX_customers_file_class_action_to_lay_claim_to_dwindling_assets-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Customers of the troubled cryptocurrency exchange FTX have asked a US Bankruptcy Judge to stop the exchange’s proposed plan to value crypto assets using November 2022 prices, Reuters reported.&#160; Over the past week, dozens of the crypto exchange’s customers from around the world have written letters to Judge John Dorsey in Delaware, who is overseeing [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/grossly-unfair-ftx-customers-ask-court-to-block-valuation-plan/\">“Grossly Unfair”: FTX Customers Ask Court to Block Valuation Plan</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]