[
  {
    "source": "CoinDesk",
    "date": "2023-06-15T12:53:40.000Z",
    "title": "Wallet Linked to Curve Founder Repays $1.3M to Aave Amid CRV Token Decline",
    "url": "https://www.coindesk.com/markets/2023/06/15/wallet-linked-to-curve-founder-repays-13m-to-aave-amid-crv-token-decline/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Lending protocol Aave DAO has already been recommended to “freeze” millions worth of CRV tokens."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-15T13:01:11.000Z",
    "title": "Cyber Criminals Are Turning to Crypto Mining Pools to Wash Ill-Gotten Funds: Chainalysis",
    "url": "https://decrypt.co/144762/cyber-criminals-are-turning-crypto-mining-pools-wash-ill-gotten-funds-chainalysis",
    "description": "Ransomware actors are increasingly trying to pass off their own funds as proceeds received from cryptocurrency mining, claims Chainalysis. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-15T13:00:00.000Z",
    "title": "Here’s how hackers are using mining pools as mixers: Chainalysis",
    "url": "https://cointelegraph.com/news/hackers-use-mining-pools-as-mixers-chainalysis-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/69f7ef90-a7aa-4bb6-9075-81f0e176c1f7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A wallet linked to ransomware attacks funneled funds through a mining pool to make it seem like the digital assets were earned through mining.</p>\n                    <p><p>While good actors within the crypto space channel their creativity toward building new things, bad actors use the same energy to devise more ingenious ways to hide their ill-gotten gains. </p><p>A new report from blockchain analytics firm Chainalysis shows how wallets involved in ransomware attacks are turning to crypto mining pools to launder the funds acquired through exploits. </p><p>According to the firm, a highly active wallet address from what it described as a “mainstream exchange” has received funds from wallets and mining pools linked to ransomware. The deposit address received almost $100 million in digital assets, with $19.1 million coming from ransomware addresses and $14.1 million from mining pools. </p><p>The chart shows a complex attempt to launder funds through mining pools. According to Chainalysis, the ransomware actor sent funds to the exchange through a mining pool. Through this, they can “avoid triggering compliance alarms” within the exchange. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/4c30e11a-afc4-419c-b594-00b023384f1f.png\"  /><figcaption style=\"text-align: center;\"><em>Graph showing how a wallet linked to ransomware sends funnels funds through a mining pool. Source: Chainalysis</em></figcaption></figure><p>In this case, the mining pool performs the function of a crypto mixer and makes the origin of the funds obscure. This creates a smokescreen, leading observers to believe that the funds are earned through mining and are not from a ransomware attack.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-launches-bitcoin-mining-cloud-services-amid-sec-crackdown-in-the-us\"><strong><em>Binance launches Bitcoin mining cloud services amid SEC crackdown in the US</em></strong></a></p><p>According to the analysis firm, there has been an increase in value sent from ransomware wallets to mining pools. In one instance, Chainalysis highlighted that an exchange wallet address had received $158.3 million from ransomware addresses since 2018.</p><p>While the problem appears to be a huge headache for the crypto space, Chainalysis suggested that it can be solved by mining pools applying a more comprehensive wallet screening process in addition to Know Your Customer measures and rejecting funds coming from illicit addresses. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethics-101-crypto-projects-negotiate-hackers/\"><strong><em>Should crypto projects ever negotiate with hackers? Probably</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-15T13:00:00.000Z",
    "title": "A PR expert’s tips for memecoin projects",
    "url": "https://cointelegraph.com/innovation-circle/a-pr-experts-tips-for-memecoin-projects",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/3d44465a-c2b7-4e19-8ad9-090f9e0295b4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The difference between winging it and hiring professionals is the difference between Pepecoin and others that never make a dent.</p>\n                    <p><p>Popular culture depicts publicists as soulless spin doctors who will sell their mother if it means landing a feature in <em>The Wall Street Journal</em>. While it’s true that any serious PR pro is ambitious about earning coverage for clients, the idea that we are unshackled by ethics and objectivity is nonsense. PR is about connections, and integrity means lasting relationships with journalists. </p> <p>That’s why the astronomical success of memecoins — most recently, Pepecoin — is so fascinating. Absent an actual product, structured business model and even sometimes public team, memecoins offer a rare opportunity to test the powers of unshackled PR and marketing. With memecoins, the messaging is 99% of the product. That doesn’t mean PR folks can leave their ethics at the door when promoting a memecoin, but it does mean they have much more liberty than usual in their campaigns.</p> <p>So what exactly did Pepecoin do right? Beyond sheer luck, which plays perhaps an even more crucial role for memecoins than it does for other projects, here are some of the things memecoin founders should consider when building their product, and therefore their PR strategy.</p> <h3><strong>Pick the right mascot</strong></h3> <p>Mascots in business aren’t new — everyone knows the GEICO gecko and the Gatorade gator. But there are a few key differences between the likes of these two reptile marketers and the memecoins that have capitalized on crypto culture. </p> <p>The first, of course, is that companies like GEICO and Gatorade sold actual products and services. The mascots provided the creative basis for brilliant marketing campaigns, but the fate of the company didn’t depend on their success. Secondly, memes have become much more influential cultural movers and shakers than commercial mascots. Dogecoin, which <a href=\"https://finbold.com/there-are-now-over-1000-doge-made-millionaires-after-dogecoin-price-skyrockets/#:~:text=However%2C%20the%20number%20fell%20below,first%20time%20since%20April%202022.\">minted</a> more than a thousand brand-new millionaires as of 2022, became one of the top cryptocurrencies based on a popular meme of a dog. </p> <p>In creating Doge, co-founders Billy Markus and Jackson Palmer took a meme that had been widely shared on Instagram by the millennial generation and turned it into a cryptocurrency, thus essentially monetizing a digital joke. The move showed a deep understanding of their target market — terminally online crypto bros that had come of age consuming memes.</p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://circle.cointelegraph.com/learn-more?utm_campaign=Coin&_ga=2.123197772.699257063.1649682515-719256619.1645538730\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <p>While still not as notorious as Dogecoin, whose success was famously adopted as the pet project of Elon Musk, Pepecoin took that audience capture to the next level. Beyond the fact that cryptocurrency appealed to terminally online men, the founders of Pepecoin must have been more than familiar with cryptocurrency history in online circles. The idea of turning the meme most associated with the most online, crypto-savvy demographic into a memecoin produced Pepecoin, and it worked.</p> <p>But there are other elements at play here.</p> <h3><strong>Controversy is a must</strong></h3> <p>We have to remember that Bitcoin — the founding father of the broader crypto industry — was born out of a rebellious desire on the part of an anonymous entity to revamp the global financial system based on a digital currency. That was unprecedented on a scale that’s easy to take for granted today.</p> <p>No one should be surprised that the industry today thrives on an edgy sort of controversy, and on the micro-scale, that troll culture drives the memecoin industry. Think of how absurd it would seem ten years ago for someone as influential as Elon Musk to support the pumping of a digital currency that was created as a parody of Bitcoin, and yet that’s exactly what happened with Doge. </p> <p>Doge worked because it was original and edgy. Shiba Inu, which branded itself as a competitor to Doge, didn’t make the same dent as the original dog coin because it didn’t bring anything fresh to the table.</p> <p>Pepe, on the other hand, capitalized on a meme associated with a fringe of the internet. Of course, the “Pepe the Frog meme” itself was merely hijacked by trolls, so no one is accusing the founders or investors of Pepecoin of anything nefarious. On the contrary, the Pepecoin founders’ keen eye for the line between tactful controversy and tone-deaf overkill produced a cryptocurrency that <a href=\"https://www.coindesk.com/markets/2023/05/05/pepecoins-bewildering-rise-turned-a-pittance-into-an-almost-5000000-meme-coin-profit/\">touched</a> a billion-dollar market cap just a few weeks after its launch. </p> <h3><strong>“Pump the frog.”</strong></h3> <p>That’s it. That’s Pepecoin’s slogan. Not even the best copywriter in the world could explain why exactly it works, but it simply does. </p> <p>Whether a crypto slogan, a social post, or an op-ed, the general rule of thumb for writing sharp content is “say the most you can, with as few words as possible.” That’s easier said than done, and it becomes even more challenging with shorter content. There’s a reason generative AI tools, such as ChatGPT, are much more adept at long-form content than social posts and titles. </p> <p>Memecoins thrive on short-form content. It’s not in-depth thought leadership and visionary market analysis that drives their success, but rather witty tweets, Reddit threads and, most importantly, funny memes. Any crypto project looking to go viral needs the sharpest marketers and PR pros they can get their hands on, whether it’s an agency or in-house to have the best shot at going viral. </p> <p>The difference between winging it and hiring professionals is the difference between Pepecoin and others that never make a dent.</p> <p><em>The information provided here is not investment, tax or financial advice. You should consult with a licensed professional for advice concerning your specific situation.</em></p> <p><em>Motti Peer is the Chairman and Co-CEO of <a href=\"https://www.reblonde.com/\">ReBlonde</a>, an award-winning PR agency specializing in technology and crypto.</em></p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\" /> </div> </div> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://circle.cointelegraph.com/\"><em><strong>Learn more about Cointelegraph Innovation Circle and see if you qualify to join</strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-15T12:50:22.000Z",
    "title": "Celsius seeks to convert alts to Bitcoin and Ether under reorganization plan",
    "url": "https://cointelegraph.com/news/celsius-seeks-to-convert-alts-to-bitcoin-and-ether-under-reorganization-plan",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/962c5e3e-6b5c-4e61-bf80-ce2324955d1b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto lender has proposed converting all its altcoin holdings into Bitcoin and Ethereum to quell growing regulatory concerns and maximize the value of its assets.</p>\n                    <p><p>Defunct crypto lender Celsius has revised its bankruptcy filing, awaiting approval from a bankruptcy court in New York after a successful acquisition deal with the Fahrenheit crypto consortium. The crypto lender <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysb.312902/gov.uscourts.nysb.312902.2807.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> its reorganization plan on June 15.</p><p>Under the revised plan Celsius will be selling all altcoins from all customers except Custody and Withhold accounts and converting them into Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), starting from July 1. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Celsius will be selling all altcoins from all customers (except Custody and Withhold accounts) starting July 1st and will be converting them into Bitcoin and Ethereum.</p>&mdash; Celsians (@CelsiansNetwork) <a href=\"https://twitter.com/CelsiansNetwork/status/1669289468489084930?ref_src=twsrc%5Etfw\">June 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The new reorganization plan proposes to treat the “Retail Borrow Claims” through the “Set Off Treatment.” The term \"set off\" refers to the comparison of losses against profits in a given year. Losses that are not offset against income can be carried over and offset against income in later years.</p><p>David Adler from McCarter &amp; English law firm <a href=\"https://twitter.com/DavidJAdler1991/status/1669222668762071040?t=e7QdRzZy-YfPwb2i1VZqpg&amp;s=19\" target=\"_blank\" rel=\"noopener nofollow\">tweeted</a> that the restructuring proposal by Celsius could face opposition from the borrowers. He noted that the debtor (Celsius Lending) is demanding a repayment of the loans yet has no intention of fulfilling its contractual obligations such as returning the collateral to the borrowers. This could be something borrowers would object to, he added.</p><blockquote>“This proposed ‘treatment’ violates every consumer lending law out there (state, federal) and the ad hoc Borrower group will be opposing this plan.\"</blockquote><p>Additionally, Celsius has asked for permission to appoint Chris Ferraro as the foreign representative in connection with the English Court's Cross Border Insolvency Regulations (CBIR) for the United Kingdom. In this way, the company's assets in the UK would be safeguarded, and the United States Chapter 11 would be acknowledged as the \"foreign main proceedings\" in order to organize a global resolution. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/celsius-784m-steth-in-lidos-long-withdrawal-queue\"><strong><em>Celsius adds over 428K stETH to Lido’s lengthening withdrawal queue</em></strong></a></p><p>Fahrenheit consortium, which comprises venture capital firm Arrington Capital and miner US Bitcoin Corp, won <a href=\"https://cointelegraph.com/news/fahrenheit-wins-bid-to-acquire-assets-of-crypto-lender-celsius\">the bid to acquire Celsius assets on May 25</a>. At the time Celsius assets were estimated to be about $2 billion in value. Under the new deal, the new company is expected to receive about $450- $500 million worth of liquid cryptocurrency, while US Bitcoin Corp plans to construct a 100-megawatt Bitcoin mining plant.</p><p>Celsius paused <a href=\"https://twitter.com/CelsiusNetwork/status/1536169010877739009?t=cbWd7tJ_aeNmC07Z_h59Zg&amp;s=19\" target=\"_blank\" rel=\"noopener nofollow\">withdrawals</a> on June 13, 2022 after the firm got entangled in bad investments and crypto contagion.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tiffany-fong-flames-celsius-ftx-and-ny-post-hall-of-flame/\"><strong><em>Tiffany Fong flames Celsius, FTX and NY Post: Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-15T13:00:00.000Z",
    "title": "Polygon Launches Web3 Loyalty Program With Flipkart",
    "url": "https://cryptodaily.co.uk/2023/06/polygon-launches-web3-loyalty-program-with-flipkart",
    "description": "<p class=\"md-end-block md-p md-focus\">Flipkart, a leading figure in Indian digital commerce, has formed a key alliance with Polygon, one of the industry's key crypto firms building infrastructure around an ecosystem of Web3 products.</p>\n<p class=\"md-end-block md-p\">The result of this collaboration is the conception of the Blockchain-eCommerce Centre of Excellence, a hub for research and development. The center's primary focus is to navigate the nascent landscape of Web3 and the metaverse, mapping out the next phase of digital commerce.The Indian digital commerce heavyweight is partnering with Polygon Labs and Hang, a leading next-generation loyalty platform, to introduce a specialized loyalty program named FireDrops 2.0. Aiming to reinvent the wheel of customer engagement and loyalty, FireDrops 2.0, powered by Hang's loyalty platform, will use underlying non-fungible token (NFT) technology to incentivize millions of Flipkart users through gamification. The application of Web3 and NFTs to brand loyalty programs is expected to revolutionize brand marketing, storytelling, and customer engagement.</p>\nPolygon x Flipkart: Loyalty NFTs via FireDrops\n<p class=\"md-end-block md-p\">The use of NFTs in the program allows for easy ownership and redemption of rewards, thereby generating new revenue streams for brands and enabling customers to participate actively in the loyalty ecosystem. The FireDrops program also envisions a dynamic marketplace where users can buy and sell rewwards, bringing flexibility to loyalty programs and enhancing brand engagement.</p>\n<p class=\"md-end-block md-p\">FireDrops 2.0 aims to offer an immersive experience to users, enticing them with surprises, games, and rewards related to their favorite brands. These interactions could allow users to earn benefits like membership passes, lifetime discounts, and more, fosterling deeper connections between users and brands.</p>\n<p class=\"md-end-block md-p\">The partnerships underscores Flipkart's commitment to fostering innovation and expanding its tech offerings to transform the experience of online shopping for millions worldwide. As Flipkart steps into the Web3 arena, it is set to reshape the contours of commerce, consumption, and value generation in the digital world.</p>\n<p class=\"md-end-block md-p\">Jeyandran Venugopal, the Chief Product and Technology Officer at Flipkart, expressed his enthusiasm about the partnership:</p>\n\n<p class=\"md-end-block md-p\">&ldquo;Innovation is one of the main pillars for Flipkart and we have consistently worked towards technology solutions to scale new frontiers and introduce new products and services,&rdquo; Venugopal shares.</p>\n\n<p class=\"md-end-block md-p\">Previously, Flipkart made its maiden voyage into the metaverse through eDAO, a project nurtured by Polygon. The venture, known as \"Flipverse,\" has played a crucial role in redefining the dynamic between brands and consumers. It promotes novel, interactive experiences via non-fungible tokens (NFTs). Additionally, Flipkart's FireDrops&mdash;an accessible platform for NFTs&mdash;cultivates a space where creators, brands, and consumers can delve into the multi-dimensional value of NFTs.</p>\n<p class=\"md-end-block md-p\">Prominent brands such as Adidas, Adobe, Robinhood, and Stripe have already chosen Polygon as their entry point to Web3. Flipkart's decision to align with this flourishing ecosystem underscores its forward-thinking approach to harnessing the potential of blockchain. Polygon's recent developments, notably the zkEVM scaling solution, will be pivotal in accommodating the global influx of users in Web3's next chapter.</p>\n<p class=\"md-end-block md-p\">Sandeep Nailwal, Polygon's co-founder, praised the partnership when it first began sometime in late 2022, sharing that Polygon:</p>\n<p class=\"md-end-block md-p\">\"serves as the bridge to Web3 for the world's biggest corporations. Our goal is to shepherd the next billion users into Web3, so our partnership with Flipkart to create the Blockchain-eCommerce Centre of Excellence is an exciting prospect.\"</p>\n<p class=\"md-end-block md-p\">Nailwal adds that Polygon recognizes the sheer amount of blockchain talent to be found in the country, and that such a resource forms opportunities for the partnership to stimulate R&amp;D, and further \"solidify India's stature as a Web3 titan.\"</p>\n<p class=\"md-end-block md-p\">Polygon's Current Regulatory Predicament</p>\n<p class=\"md-end-block md-p\">Polygon recently launched its Version 2.0 amid the troubles that it's currently facing with SEC's claim of $MATIC being a security. The crypto firm is currently expanding its efforts at privacy, and has since launched a zero-knowledge identity infrastructure program for Web3 with PolygonID.</p>\n<p class=\"md-end-block md-p\">In response to the SEC's allegations, trading platform Robinhood took the step of delisting Solana, Cardano, and Polygon, effective from June 27. However, it reassured its users that the removal would be restricted to SOL, ADA, and MATIC, and no other coins on the platform would be affected.</p>\n<p class=\"md-end-block md-p\">Solana (SOL), Cardano (ADA), Cosmos Hub (ATOM), Filecoin (FIL), Decentraland (MANA), Algorand (ALGO), The Sandbox (SAND), Coti (COTI), and Axie Infinity (AXS) were the other tokens implicated, as regulatory scrutiny also hit major exchanges such as Binance and Coinbase.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-15T13:00:18.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Moves Below $25,000 Following Fed Meeting",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-moves-below-25000-following-fed-meeting/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2233606395-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BTC Moves Below $25,000 Following Fed Meeting\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2233606395-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2233606395-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2233606395-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2233606395-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2233606395-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2233606395-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2233606395.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin fell below the $25,000 level for the first time since March, as the Federal Reserve opted to keep rates unchanged. However, to the surprise of many, the Fed also forecasted two further hikes in this current cycle. Ethereum reacted negatively to the news, dropping below $1,700. Bitcoin Bitcoin plunged to a multi-month low on [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T12:56:29.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-15T12:44:03.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "The automatic release of new APT tokens into the open market is valued at over $50 million based on current prices. Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for a decoupling of on-chain and off-chain trading activity. So, it&#8217;s interesting to see how the ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-15T13:00:00.000Z",
    "title": "AI goes mainstream, billions will be poured through InQubeta and QUBE",
    "url": "https://crypto.news/ai-goes-mainstream-billions-will-be-poured-through-inqubeta-and-qube/",
    "description": "InQubeta is spearheading the AI and DeFi revolution. Its presale has raised over $400,000 as millions of QUBE have been sold"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T13:00:59.000Z",
    "title": "Crypto whale moves 31.7M of Shiba Inu, Tradecurve is expecting another 50% surge, and Polygon is up 8%",
    "url": "https://www.crypto-news-flash.com/crypto-whale-moves-31-7m-of-shiba-inu-tradecurve-is-expecting-another-50-surge-and-polygon-is-up-8/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-whale-moves-31-7m-of-shiba-inu-tradecurve-is-expecting-another-50-surge-and-polygon-is-up-8",
    "description": "The cryptocurrency market is no stranger to large-scale investors&#8217; influence, often called &#8220;whales.&#8221; These entities hold substantial amounts of digital assets, and their movements can significantly impact market trends. In recent developments, crypto whales have been making notable moves, with 31.7 million Shiba Inu tokens changing hands.  Meanwhile, Tradecurve, an innovative trading platform, is poised [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-15T12:56:04.000Z",
    "title": "Polygon: Billion Dollar Indian E-commerce Powerhouse Flipkart Unveils FireDrops 2.0, an NFT Loyalty Program on MATIC Blockchain",
    "url": "https://www.crypto-news-flash.com/polygon-billion-dollar-indian-e-commerce-powerhouse-flipkart-unveils-firedrops-2-0-an-nft-loyalty-program-on-matic-blockchain/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-billion-dollar-indian-e-commerce-powerhouse-flipkart-unveils-firedrops-2-0-an-nft-loyalty-program-on-matic-blockchain",
    "description": "Polygon and Flipkart partner to launch an NFT loyalty program. Flipkart has also partnered with Ensologic.  One of the most renowned Indian e-commerce marketplaces, Flipkart is introducing FireDrops 2.0 on the Polygon blockchain in collaboration with a customer relationship-building platform Hang. FireDrops 2.0 has been designed to provide users with engagement and loyalty, and also [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-15T12:55:47.000Z",
    "title": "How the US Paved the Way for Crypto in 1971",
    "url": "https://www.altcoinbuzz.io/top-article/how-the-us-paved-the-way-for-crypto-in-1971/",
    "description": "<p>For several decades, fiat and gold-pegged currencies served as the foundation of the world&#8217;s economy. But these have shifted over the years. There&#8217;s now an alternative financial system. It&#8217;s decentralized finance fueled by Bitcoin and other cryptos. But how did we get here? Very few dates are as significant in US economic history as August [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/top-article/how-the-us-paved-the-way-for-crypto-in-1971/\">How the US Paved the Way for Crypto in 1971</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-15T12:48:00.000Z",
    "title": "Regulatory Clarity ‘Irrelevant’ in SEC vs. Binance: Ex-SEC Official",
    "url": "https://coinedition.com/regulatory-clarity-irrelevant-in-sec-vs-binance-ex-sec-official/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/SEC-not-letting-Binance-2-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/SEC-not-letting-Binance-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/SEC-not-letting-Binance-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/SEC-not-letting-Binance-2.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>A former senior official at the United States Securities and Exchange Commission (SEC) attempted to pour water on optimism in the crypto space after a hearing in the SEC’s lawsuit against Binance this Tuesday, June 13. In a lengthy tweet, John Reed Stark, previously the SEC’s chief of internet enforcement, denied that Judge Amy Berman [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/regulatory-clarity-irrelevant-in-sec-vs-binance-ex-sec-official/\">Regulatory Clarity ‘Irrelevant’ in SEC vs. Binance: Ex-SEC Official</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]