[
  {
    "source": "Cointelegraph",
    "date": "2023-12-06T18:47:30.000Z",
    "title": " Moody’s launches quantum-as-a-service platform for finance ",
    "url": "https://cointelegraph.com/news/moody-s-launches-quantum-as-a-service-platform-for-finance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNGI5OTJlMTMtN2JmYy00MWM3LWEzYTItMjQ3N2U1NTRiZWUzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The platform allows clients to compare and benchmark quantum and classical algorithms for a given task.</p>\n                    <p><p>According to the Moody’s Analytics website, QFStudio is a software-as-a-service (SaaS) offering that will <a href=\"https://www.moodysanalytics.com/microsites/quantum\" target=\"_blank\" rel=\"noopener nofollow\">serve</a> as “a continuous integration, benchmark, and delivery platform” for quantum computing solutions.</p><p>The burgeoning quantum computing sector is expected to experience steady growth over the next few decades. A recent forecast <a href=\"https://www.fortunebusinessinsights.com/u-s-quantum-computing-market-107727\" target=\"_blank\" rel=\"noopener nofollow\">predicted</a> that quantum computing technologies would grow from a market capitalization in the United States of about $138 million in 2022 to $1.2 billion by 2030.</p><p>Currently, most of the focus in quantum computing is on research and development. Companies such as IBM, Microsoft, Google, D-Wave and Rigetti have quantum, cloud-based quantum and hybrid quantum computing offerings on the market, but most of these solutions are geared toward early movers exploring use cases.</p><p><a href=\"https://cointelegraph.com/news/moody-s-launches-quantum-as-a-service-platform-for-finance\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-06T18:58:20.000Z",
    "title": "JPMorgan CEO says Bitcoin should be closed down, citing criminal use concerns",
    "url": "https://cryptobriefing.com/jpmorgan-ceo-bitcoin-should-closed-down-citing-criminal-use-concerns/?utm_source=feed&utm_medium=rss",
    "description": "Testifying to Senate, JPMorgan's Dimon states he is \"deeply opposed to crypto\" including Bitcoin which lacks compliance checks."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-06T19:00:10.000Z",
    "title": "Is Bitcoin Overvalued Yet? What Historical Data Suggests",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-overvalued-yet-historical-data-suggests/",
    "description": "Here&#8217;s what the data of this historical on-chain indicator suggests regarding whether Bitcoin has become overvalued after its latest uptrend. Bitcoin MVRV Z-Score Hasn&#8217;t Climbed Too High Yet As the Reflexivity Research co-founder pointed out in a post on X, the BTC MVRV Z-Score readings have heated up little compared to the values observed in past bull runs. The &#8220;Market Value to Realized Value (MVRV) ratio&#8221; is an indicator that measures the ratio between the Bitcoin market cap and the realized cap. The &#8220;realized cap&#8221; refers to a capitalization model for the cryptocurrency that assumes the &#8220;true&#8221; value of any coin in circulation is the price at which it was last transacted on the blockchain. Related Reading: Tether (USDT) Cap Approaches $90 Billion: Why This Affects Bitcoin Since the last transaction price of any coin was likely the price at which it changed hands, one way to interpret the realized cap is that it represents the total capital the holders have invested into the asset. Since the MVRV ratio compares the market cap (the spot price) against this model, it can tell us whether the investors are holding more value than they put in right now. If the investors are holding more than what they bought the coin for (that is, they are in net profits), they might be tempted to sell, and thus, BTC might be likely to see a correction. Similarly, the market being in losses can suggest the cryptocurrency&#8217;s price is currently undervalued and might be due to a rebound. Now, here is a chart that shows the trend in the Z-Score of the Bitcoin MVRV ratio over the history of the coin: The value of the metric appears to have been going up in recent days &#124; Source: @WClementeIII on X The &#8220;Z-Score&#8221; is a statistical tool used to measure how far a data point is from the mean. In the graph, the analyst has marked two zones for the Bitcoin MVRV Z-Score where BTC has attained an overbought/underbought condition. It would appear that historical bottoms in the asset&#8217;s price have formed when the metric has dipped inside the green zone. The tops haven&#8217;t been so simple, though, as they fluctuate a bit. Related Reading: Sleeping Bitcoin Giants Wake Up: Pattern Mirrors 2021 Bull Run One common thing between all tops is that they have occurred at decently high values of the indicator. At such values, the investors make very high profits, so tops naturally become significantly probable. The chart shows that the Bitcoin MVRV Z-Score has been climbing recently as the asset has rallied, but it&#8217;s yet to arrive at levels similar to past tops. &#8220;There will be corrections along the way, but zooming out Bitcoin is far from overvalued based on historical readings,&#8221; notes the analyst. BTC Price At the time of writing, Bitcoin is trading at around $43,800, up 15% in the last week. Looks like BTC has registered a sharp uptrend over the last few days &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-06T18:57:02.000Z",
    "title": "Polygon is Leading the Charge in Zero-Knowledge Rollups With Massive New Update",
    "url": "https://www.crypto-news-flash.com/polygon-is-leading-the-charge-in-zero-knowledge-rollups-with-massive-new-update/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-is-leading-the-charge-in-zero-knowledge-rollups-with-massive-new-update",
    "description": "<img width=\"1043\" height=\"606\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/polygon-network-.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/polygon-network-.png 1043w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/polygon-network--300x174.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/polygon-network--1024x595.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/polygon-network--768x446.png 768w\" sizes=\"(max-width: 1043px) 100vw, 1043px\" />Polygon launched its zero-knowledge solution for the Ethereum ecosystem this year with the zkEVM and according to the brain behind it, it&#8217;s just the beginning of the scaling journey. Jordi Baylina also acknowledged other significant milestones this year, including Polygon 2.0 outlining the ecosystem&#8217;s scaling plans and Chain Development Kit. As scalability took centre stage [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-06T19:05:53.000Z",
    "title": "Solana-Based Altcoin Instantly Explodes Over 75% After Project Makes Big Announcement",
    "url": "https://dailyhodl.com/2023/12/06/solana-based-altcoin-instantly-explodes-over-75-after-project-makes-big-announcement/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/03/solana-bump-coinbase.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/03/solana-bump-coinbase.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/03/solana-bump-coinbase.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/03/solana-bump-coinbase.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/03/solana-bump-coinbase.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/03/solana-bump-coinbase.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/03/solana-bump-coinbase.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>One Solana (SOL)-based altcoin project is soaring after the project issued a major announcement. Decentralized wireless network project Helium (HNT) announced Tuesday the launch of a new affordable cell phone plan over its network available to those in the United States. Says Helium Mobile, “It’s here. Our nationwide $20/month unlimited phone plan is now available! [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/06/solana-based-altcoin-instantly-explodes-over-75-after-project-makes-big-announcement/\">Solana-Based Altcoin Instantly Explodes Over 75% After Project Makes Big Announcement</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]