[
  {
    "source": "Decrypt",
    "date": "2023-09-27T10:42:52.000Z",
    "title": "Binance Quits Russia With Sale of Local Business to CommEX",
    "url": "https://decrypt.co/198916/binance-quits-russia-with-sale-of-local-business-to-commex",
    "description": "The exchange is leaving the Russian market over compliance concerns, selling its regional unit to the newly-launched CommEX."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-27T10:56:56.000Z",
    "title": "CIA to build its own Chat-GPT-style AI bot for investigations: Report ",
    "url": "https://cointelegraph.com/news/cia-builds-its-own-chatgpt-style-ai-bot",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/62e0bef6-d381-45bb-bf19-09dd71a2350e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The CIA says it is creating its own Chat-GPT AI tool for its agencies to conduct open-source investigations through analyzing public information. </p>\n                    <p><p>According to a Bloomberg report, the CIA plans to equip its analysts with the new AI tool to better access open-source intelligence. This includes sifting through public information for leads in investigations. </p><p>Agency officials said they intend to roll out the tool “soon.” Randy Nixon, the director of the division, told Bloomberg that they have gone from utilizing, “newspapers and radio, to newspapers and television, to newspapers and cable television, to basic internet, to big data, and it just keeps going.” </p><p>The development comes after critics have called the current methods of CIA processing available public data “slow.” </p><p>Bloomberg reported that the new tools will provide its users with the ability to see the original source of the information being sourced, along with a chat feature. </p><blockquote>“Then you can take it to the next level and start chatting and asking questions of the machines to give you answers, also sourced.” </blockquote><p>There was no mention to the model from which the CIA is building its new tool nor its privacy protections, though Nixon said it “closely follows” privacy law in the U.S.</p><p>The tool will reportedly be available across the 18 agencies that make up the U.S. intelligence. This includes the CIA, National Security Agency and the Federal Bureau of Investigation, along with military-run agencies. </p><p>The Central Intelligence Agency (CIA) of the United States is planning to build and deploy its own Chat-GPT-style artificial intelligence (AI) bot for investigations, according to a <a href=\"https://www.bloomberg.com/news/articles/2023-09-26/cia-builds-its-own-artificial-intelligence-tool-in-rivalry-with-china?embedded-checkout=true#xj4y7vzkg\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from Bloomberg. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/gensler-testimony-crypto-enforcement-actions-due-to-noncompliance\"><strong><em>Gensler testimony — Crypto enforcement actions driven by “wide-ranging noncompliance”</em></strong></a></p><p>This development from the CIA comes after recent confirmation from other governmental agencies of the use of AI. </p><p>On Sept. 12, Gary Gensler, the chair of the Securities and Exchange Commission (SEC), confirmed to the U.S. Senate that his department is <a href=\"https://cointelegraph.com/news/gary-gensler-confirms-sec-ai-financial-surveillance\">currently employing AI tools</a> to monitor the finance industry to search for clues of fraud and manipulation. </p><p>In a speech on July 17, Gensler praised the use of AI tools in a speech saying that SEC staff could benefit from greater use of AI in “market surveillance, disclosure review, exams, enforcement, and economic analysis.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/\"><strong><em>‘AI has killed the industry’: EasyTranslate boss on adapting to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-27T10:45:24.000Z",
    "title": "Zuckerberg predicts AI reshaping daily life, Meta to pursue ‘relentless’ integration – Forbes",
    "url": "https://cryptoslate.com/zuckerberg-predicts-ai-reshaping-daily-life-meta-to-pursue-relentless-integration-forbes/",
    "description": "<p>Mark Zuckerberg touted artificial intelligence as a transformative technology poised to reshape the tech industry in an interview with Forbes published Wednesday, Sept. 27. Zuckerberg said recent AI breakthroughs represent &#8220;awesome progress&#8221; and predicted AI will become more ubiquitous in daily life. &#8220;There&#8217;s going to be a lot of different AIs that people interact with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/zuckerberg-predicts-ai-reshaping-daily-life-meta-to-pursue-relentless-integration-forbes/\">Zuckerberg predicts AI reshaping daily life, Meta to pursue &#8216;relentless&#8217; integration &#8211; Forbes</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-27T10:50:44.000Z",
    "title": "JPMorgan CEO Warns of Rising Energy Prices and Geopolitical Tensions in CNBC TV18 Interview",
    "url": "https://www.cryptoglobe.com/latest/2023/09/jpmorgan-ceo-warns-of-rising-energy-prices-and-geopolitical-tensions-in-cnbc-tv18-interview/",
    "description": "On 26 September 2023, Jamie Dimon, the Chairman and CEO of JPMorgan Chase (aka “JPMorgan”), engaged in a comprehensive interview with Shereen Bhan, the Managing Editor of CNBC TV18. JPMorgan Chase &amp; Co., a leading financial services firm headquartered in the United States, boasts a global operational footprint. As of June 30, 2023, the company […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-27T10:59:49.000Z",
    "title": "SCBX and Hashed Join Forces in a Landmark Web3 R&D Partnership",
    "url": "https://cryptodaily.co.uk/2023/09/scbx-and-hashed-join-forces-in-a-landmark-web3-rd-partnership",
    "description": "In a significant move that underscores the growing importance of decentralized technology in the financial sector, Public Company Limited (SCBX), Thailand's leading financial technology group, has entered into a strategic partnership with Hashed, a global frontrunner in Web3 venture capital. This collaboration is set to pioneer research and development in Web3 technology trends, including blockchain and AI, aiming for broader public market adoption."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-27T10:54:26.000Z",
    "title": "Pudgy Penguins Now Available In 2000 Different Walmart Locations",
    "url": "https://cryptodaily.co.uk/2023/09/pudgy-penguins-now-available-in-2000-different-walmart-locations",
    "description": "The floor price of the popular NFT collection registered an increase of 11% following the deal with the world’s largest retailer."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-27T11:00:49.000Z",
    "title": "NAKA Launching the First Self-Custodial Payment Card/Scheme Working on POS Terminals Worldwide",
    "url": "https://news.bitcoin.com/naka-launching-the-first-self-custodial-payment-card-scheme-working-on-pos-terminals-worldwide/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/img_20230926_114558_360-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/img_20230926_114558_360-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/img_20230926_114558_360-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/img_20230926_114558_360-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/img_20230926_114558_360-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/img_20230926_114558_360-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/img_20230926_114558_360-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/img_20230926_114558_360.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. SLOVENIA &#8211; Sep 27th, 2023 &#8211; NAKA introduces a new decentralized approach to finances, built upon a pioneering blockchain-based payment scheme and a payment card that links to the wallet managed by MetaMask and can be read by any POS terminal worldwide. NAKA has developed a new technology that bridges the gap between [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T10:56:29.000Z",
    "title": "AI Stocks and TSMC Rally in Taiwan Amidst Global Market Uncertainty",
    "url": "https://www.cryptopolitan.com/ai-stocks-tsmc-rally-taiwan-global-market/",
    "description": "Despite heavy losses in the U.S. markets overnight, Taiwan&#8217;s stock market rebounded as investors rallied behind contract chipmaker Taiwan Semiconductor Manufacturing Co. (TSMC) and select companies involved in artificial intelligence (AI) development. The Taiex, the weighted index on the Taiwan Stock Exchange (TWSE), defied initial losses to close slightly higher, demonstrating resilience amidst global market ... <a title=\"AI Stocks and TSMC Rally in Taiwan Amidst Global Market Uncertainty\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-stocks-tsmc-rally-taiwan-global-market/\" aria-label=\"More on AI Stocks and TSMC Rally in Taiwan Amidst Global Market Uncertainty\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T10:49:47.000Z",
    "title": "Tree-Hugging AI to the Rescue of Brazilian Amazon",
    "url": "https://www.cryptopolitan.com/tree-hugging-ai-to-the-rescue-of-brazilian-amazon/",
    "description": "Small, artificially intelligent boxes named &#8220;curupiras&#8221; are being hailed as the latest weapon in the ongoing battle against destructive jungle invaders in the Brazilian Amazon. Developed by a team of scientists and environmentalists, these innovative devices are equipped with sensors and AI software designed to recognize the sounds of chainsaws and tractors, often harbingers of ... <a title=\"Tree-Hugging AI to the Rescue of Brazilian Amazon\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tree-hugging-ai-to-the-rescue-of-brazilian-amazon/\" aria-label=\"More on Tree-Hugging AI to the Rescue of Brazilian Amazon\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T10:49:12.000Z",
    "title": "Binance exits Russia with its subsidiary sale to CommEX",
    "url": "https://www.cryptopolitan.com/binance-exits-russia-with-a-sale-to-commex/",
    "description": "Wednesday, the global leading crypto exchange Binance announced that it will sell its Russia business to the newly-launched crypto exchange CommEX, becoming the latest company to pull out of Moscow since Russia&#8217;s invasion of Ukraine. The largest crypto exchange in the world did not disclose the financial details of the deal. The company stated that ... <a title=\"Binance exits Russia with its subsidiary sale to CommEX\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-exits-russia-with-a-sale-to-commex/\" aria-label=\"More on Binance exits Russia with its subsidiary sale to CommEX\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T10:46:32.000Z",
    "title": "Unlocking Marketing Insights with Machine Learning: Beyond the Hype",
    "url": "https://www.cryptopolitan.com/marketing-insights-with-machine-learning/",
    "description": "In the era of data-driven marketing, the power of machine learning cannot be overstated. While AI, including machine learning, has captured the imagination of many recently, it&#8217;s important to remember that these technologies have quietly been transforming industries for years. Machine learning has been at the heart of everything from chatbots answering customer service queries ... <a title=\"Unlocking Marketing Insights with Machine Learning: Beyond the Hype\" class=\"read-more\" href=\"https://www.cryptopolitan.com/marketing-insights-with-machine-learning/\" aria-label=\"More on Unlocking Marketing Insights with Machine Learning: Beyond the Hype\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-27T10:45:02.000Z",
    "title": "Solana Bulls Struggle To Break $21 Barrier – What Lies Ahead?",
    "url": "https://www.newsbtc.com/news/solana-bulls-struggle-to-break-21-barrier-what-lies-ahead/",
    "description": "Solana (SOL) has found itself in the midst of a price battle, with neither bulls nor bears able to establish dominance. The daily charts have revealed a story of indecisiveness, characterized by the formation of neutral doji candles. This hesitation in price movement follows a previous sharp decline, indicating that the bearish momentum is losing steam. Despite the cautious optimism among bulls, the recent price action has been far from encouraging. The $21 resistance level proved to be a formidable barrier that buyers struggled to breach. This resistance level has been a key focal point for traders, as it represents a crucial milestone for SOL&#8217;s bullish aspirations. As of now, SOL is trading at $19.05 according to CoinGecko, reflecting a 1.6% decline in the past 24 hours and a 5.2% dip over the last seven days. While these figures may seem discouraging, there is still a glimmer of hope for those betting on a bullish reversal. Related Reading: Cardano $0.24 Support Test: Can ADA Price Reverse Its Downward Trend? Solana Watch: Key Metrics To Watch Amidst the market&#8217;s uncertainty, technical analysts have identified an intriguing pattern on the daily time frame chart—a potential inverted head and shoulders pattern. This pattern is often regarded as a bullish reversal indicator, and its completion could be a sign of better days ahead for SOL. The pattern consists of three main parts: a left shoulder, a head, and a right shoulder. The recent pullback in SOL&#8217;s price is seen as the completion of the right shoulder, setting the stage for a potential rally. The key support level to watch is $19 which, if held, could pave the way for SOL to retest the neckline resistance at $20.80. SOL registers a market cap of nearly $8 billion today. Chart: TradingView.com Indicators Signal Caution  While the inverted head and shoulders pattern offers a glimmer of hope, traders must remain cautious. The Relative Strength Index (RSI) has been lingering below the neutral 50 level in recent days, suggesting that bearish sentiment still holds sway. Additionally, the On-Balance Volume (OBV) has struggled to break through local resistance despite multiple attempts in September, indicating that sellers may still have the upper hand. SOL seven-day price movement. Source: Coingecko To flip the market structure bearishly, a price report notes SOL would need to breach the $18.58 level convincingly. Until then, the possibility of SOL forming a short-term consolidation range before making a potential upward move remains on the table. However, the current evidence suggests that sellers are not ready to relinquish control just yet. Related Reading: Is Terra Classic Planning For USTC To Be Pegged To The Dollar Again? The emergence of an inverted head and shoulders pattern provides a glimmer of hope for bullish traders, but caution is advised as key indicators signal ongoing uncertainty in the market. The coming days will likely determine whether SOL can break free from its current range and embark on a path toward higher prices. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-27T11:09:28.000Z",
    "title": "Stellar-Powered Future: MoneyGram Partners with Stellar for Zero-Fee Wallet to Conquer Billion-Dollar Market",
    "url": "https://www.crypto-news-flash.com/stellar-powered-future-moneygram-partners-with-stellar-for-zero-fee-wallet-to-conquer-billion-dollar-market/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-powered-future-moneygram-partners-with-stellar-for-zero-fee-wallet-to-conquer-billion-dollar-market",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Stellar MoneyGram\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-48x27.jpg 48w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />MoneyGram and Stellar partner to launch a digital wallet in early 2024, simplifying global payments and enabling fiat-to-crypto transitions. Users can cash out digital assets at MoneyGram locations, reducing cross-border fees and enjoying flexible fund management. MoneyGram, the renowned global financial institution, is making remarkable advancements in the digital finance sphere. In a move set [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-27T11:00:45.000Z",
    "title": "Prices of Cosmos (ATOM) and NEAR Protocol (NEAR) Ascending; Over 142% Presale Surge Anticipated for VC Spectra (SPCT)",
    "url": "https://www.crypto-news-flash.com/prices-of-cosmos-atom-and-near-protocol-near-ascending-over-142-presale-surge-anticipated-for-vc-spectra-spct/?utm_source=rss&utm_medium=rss&utm_campaign=prices-of-cosmos-atom-and-near-protocol-near-ascending-over-142-presale-surge-anticipated-for-vc-spectra-spct",
    "description": "<img width=\"512\" height=\"256\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-159.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-159.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-159-300x150.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The prices of Cosmos (ATOM) and NEAR Protocol (NEAR) have been on the rise, driven by positive developments and new integrations within their respective ecosystems. Meanwhile, VC Spectra (SPCT) is generating significant anticipation with its ongoing presale, with analysts predicting a potential surge of over 142% in token price. What factors are driving the surging [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-27T11:01:11.000Z",
    "title": "Bitcoin Could Fall to $21.7K Amid Bearish Sentiment: Analyst",
    "url": "https://coinedition.com/bitcoin-could-fall-to-21-7k-amid-bearish-sentiment-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Bitcoin_Analysis_BTC_Recovers_From_Lows_of_18000_After_Dip.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin Analysis: BTC Recovers From Lows of $18,000 After Dip\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Bitcoin_Analysis_BTC_Recovers_From_Lows_of_18000_After_Dip.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Bitcoin_Analysis_BTC_Recovers_From_Lows_of_18000_After_Dip-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Bitcoin_Analysis_BTC_Recovers_From_Lows_of_18000_After_Dip-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Bitcoin_Analysis_BTC_Recovers_From_Lows_of_18000_After_Dip-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Bitcoin_Analysis_BTC_Recovers_From_Lows_of_18000_After_Dip-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Annii, host of the Crypto Banter YouTube channel, projects that the price of Bitcoin will likely fall to $21,700. The Crypto Banter host analyzed Bitcoin’s recent behavior, noting that it has failed to get back to the support created during the last bull market. In a recently uploaded video, Annii revealed a developing bearish trend [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-could-fall-to-21-7k-amid-bearish-sentiment-analyst/\">Bitcoin Could Fall to $21.7K Amid Bearish Sentiment: Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]