[
  {
    "source": "CoinDesk",
    "date": "2023-06-14T16:10:34.000Z",
    "title": "BCB Group Abandons Sutor Bank Acquisition on Regulatory Delay",
    "url": "https://www.coindesk.com/business/2023/06/14/bcb-group-abandons-sutor-bank-acquisition-on-regulatory-delay/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The payments processor also cited crypto market conditions as a reason for the exit."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T16:29:23.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T16:11:44.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution that has gained popularity recently among Ethereum users for ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-14T16:31:09.000Z",
    "title": "R3 updates Corda to enable interoperability and scalability",
    "url": "https://crypto.news/r3-updates-corda-to-enable-interoperability-and-scalability/",
    "description": "R3 has rolled out an upgrade of Corda, its enterprise-grade distributed ledger technology  (DLT) network. The team claims the next-gen Corda offers users increased scalability, interoperability, privacy, and security."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-14T16:15:56.000Z",
    "title": "Maker (MKR) Records Positive Moves As Majority Of Coins Bleed",
    "url": "https://www.newsbtc.com/maker-mkr/maker-mkr-records-positive-moves-as-majority-of-coins-bleed/",
    "description": "Amidst the bloodbath present ravaging the majority of cryptocurrencies, Maker (MKR) has managed to maintain its value and shown positive momentum. This current performance is noteworthy and has triggered the interest of investors and market observers. Its positive performance in challenging market conditions highlights the potential for long-term success. And it may inspire other projects seeking to thrive in a highly volatile market. Maker (MKR) Thrives With Resilience Amid Turbulent Crypto Market Maker is a decentralized organization built on the Ethereum blockchain committed to bringing financial stability and transparency to the crypto market. Related Reading: Bitcoin (BTC) Stored On Exchanges Plummets Amid Regulatory Uncertainties: Santiment According to data from CoinMarketCap, MKR is currently trading at $655.38, representing an increase of 3.25%. MKR has exhibited bullish sentiment since the last 30-day trading period with an increase of 2.96%. The MKR price is still up in the 7-day trading session, representing an increase of 4.14%. The asset exhibiting bullish momentum in its 7-day and 30-day trading periods indicates that MKR demand and buying pressure are growing. And it can be further seen as a positive sign for investors and traders. Both the overall market cap and its 24-hour trading volume are also up today by 3.07% and 24.98%. This represents a value of $639 million and $24 million, accompanied by a circulating supply of 977,631 MKR, which is almost depleted. Notably, as the circulating supply dwindles, the asset becomes scarcer in the market. This limited availability can potentially drive up demand and create a sense of urgency among investors and traders. MKR&#8217;s price might surge as demand outpaces the available circulating supply, as buyers will be willing to pay higher prices to acquire MKR. Crypto Market Volume Declines By 30.07% In 24 Hours In the past 24 hours, the total volume of the cryptocurrency market has amounted to $23.64 billion, showing a significant decrease of 30.07%. Within the crypto market, the decentralized finance (DeFi) sector volume stands at $1.68 billion, accounting for 7.12% of the total crypto market volume.  Furthermore, stablecoins contribute significantly to the overall market volume, with a value of $22.38 billion, representing 94.64% of the total crypto market volume. Regarding market dominance, Bitcoin currently holds a share of 47.65%, experiencing a slight decrease of 0.06% throughout the day.  Several Indicators Signal Bullish Sentiment For MKR Amid Declining Market Volume Currently, the asset is trading above the middle band of the Bollinger Band, suggesting a potential uptrend. This indicates that the asset&#8217;s price is higher than the average and could signal continued bullish momentum in the near term. Related Reading: XRP And Ethereum Seeing Increased Social Media Talk As Bitcoin Loses Interest MKR&#8217;s Moving Average Convergence/Divergence (MACD) is above the signal line, also confirming the bullish sentiment and a potential buy signal. Lastly, the asset’s Relative Strength Index (RSI) is at 54.8, indicating a moderate bullish momentum. It implies that the asset&#8217;s price has seen some positive movement, and there is still potential for further upward price action. Featured image from Pixabay and chart from TradingView.com"
  }
]