[
  {
    "source": "Cointelegraph",
    "date": "2023-07-06T04:56:30.000Z",
    "title": "Binance, Coinbase and Gemini staff are among the least happy, data suggests",
    "url": "https://cointelegraph.com/news/binance-coinbase-gemini-staff-among-least-happy-glassdoor",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/154ca2b3-ed97-43dd-af6e-b82be7a74ae5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Crypto exchange Binance said its “hardcore” work culture could explain some of the results, while recruiters warn the data should be taken with a grain of salt.  </p>\n                    <p><p>Crypto exchanges including Gemini, Binance and Coinbase are home to some of the least happy employees in the industry, according to data derived from Glassdoor — though some argue the results may be skewed. </p><p>A quadrant <a href=\"https://www.trueup.io/crypto/trends#layoffs\" target=\"_blank\" rel=\"noopener nofollow\">chart</a> by tech recruitment firm TrueUp — understood to have collated data from job review platform Glassdoor — mapped out how crypto firms stack up when it comes to employee happiness versus growth. </p><p>27 of the most valuable cryptocurrency firms were placed on TrueUp’s quadrant chart.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/7dfa8eb5-6e5b-46bb-8464-dfb28fedc9c0.png\"  /><figcaption style=\"text-align: center;\"><em>A chart depicting the happiest, least happy workers and fastest and slowest growing cryptocurrency firms. Source: TrueUp</em></figcaption></figure><p>The chart shows defunct crypto lender Celsius, crypto exchange Gemini, and crypto trading firm Amber Group with the least happy employees, with data <a href=\"https://www.glassdoor.com/Reviews/Gemini-Reviews-E1400858.htm\" target=\"_blank\" rel=\"noopener nofollow\">gleaned</a> from 80, 139, and 42 reviews respectively.</p><p>Binance and Coinbase also appear on the left side of the chart, with the respective Glassdoor listings <a href=\"https://www.glassdoor.com.au/Reviews/Binance-Reviews-E1816824.htm\" target=\"_blank\" rel=\"noopener nofollow\">showing</a> a total of 1,257 reviews.</p><p>Glassdoor doesn't have a happiness metric but it does gauge whether the reviewer would recommend the company to a friend, whether they approve of the CEO they worked under and whether the reviewer had a positive outlook for the company.</p><h3>Binance attributes score to ‘hardcore’ values</h3><p>Speaking to Cointelegraph, a Binance spokesperson explained that the firm <a href=\"https://cointelegraph.com/news/binance-employees-to-adhere-to-90-day-period-prior-to-trading\">seeks to hire candidates</a> “who can thrive in a truly high-performance environment” in addition to being “obsessively focused on delivering for our users.”</p><p>They explained that not every Binance employee is cut out to be “hardcore” — one of the firm’s core values:</p><blockquote>“It also means that sometimes, we have some who are not able to thrive in this unique, brutally fast environment, and we have to accept some negative reviews as a result.”</blockquote><p>“Negative feedback enables us to address problems and we’re on a constant journey to improve our employee experience,” the Binance spokesperson added.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/cc699e15-49b0-4720-9bb0-7b257dacf404.PNG\"  /><figcaption style=\"text-align: center;\"><em>Glassdoor summary of Binance. Source: Glassdoor</em></figcaption></figure><p>Cointelegraph also reached out to Coinbase, Moonpay, Bitpanda and 21Shares for comment but did not receive a response at the time of publication. Gemini declined to comment. </p><h3>Glassdoor concerns </h3><p>Glassdoor reviews are user-submitted and the information contained is self-reported, which has previously raised concerns about reliability. In 2017, recruiters raised <a href=\"https://www.linkedin.com/pulse/10-reasons-you-shouldnt-trust-glassdoor-reviews-katie-bowles-1/\" target=\"_blank\" rel=\"noopener nofollow\">concerns</a> over the legitimacy of Glassdoor data, suggesting that reviews can be easily faked or manipulated.</p><p>Glassdoor however <a href=\"https://help.glassdoor.com/s/article/Review-Integrity-Fraud-Detection?language=en_US\" target=\"_blank\" rel=\"noopener nofollow\">states</a> that every review goes through a “moderation process” before it is approved to be published on its website.</p><p>Neil Dundon, the founder of CryptoRecruit told Cointelegraph that while the Glassdoor data is “speculative,” it appears as though employees “building infrastructure” are more satisfied than those working at exchanges:</p><blockquote>“The sadder employees may not be as fulfilled given they are working in a more speculative/exchange environment whereas the right side are actually building infrastructure for blockchain so these employees may feel they have more purpose in their work.”</blockquote><p>The <a href=\"https://cointelegraph.com/news/binance-plans-new-round-of-layoffs-to-address-increased-regulatory-scrutiny\">large staff layoffs</a> amongst top tier firms has likely been factored into the figures, Dundon suggested. </p><p>“Across the industry in general though it’s hard to feel happy in your job when there is underlying insecurity amongst employees with all of the layoffs that have happened over the last year,” he said.</p><p>The silver lining, according to Dundon, is that “the worst” <a href=\"https://cointelegraph.com/news/crypto-layoffs-decelerate-with-layoffs-falling-to-570-in-february\">may be behind crypto employees</a> now. </p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/crypto-recruitment-execs-reveal-the-safest-jobs-amid-layoff-season\"><strong>Crypto recruitment execs reveal the safest jobs amid layoff season </strong></a></em></p><p>Meanwhile, the TrueUp chart suggests the “happiest” workers in the industry came from Ava Labs — the team behind the Avalanche blockchain — cryptocurrency exchange and wallet provider Blockchain.com and Fireblocks — an institutional digital asset custodian.</p><p>Glassdoor data also shows that Alex Mashinsky, the founder and former CEO of the now-bankrupt <a href=\"https://cointelegraph.com/news/celsius-has-finally-filed-for-bankruptcy-law-decoded-july-18-25\">cryptocurrency lending platform Celsius</a>, was one of the industry’s most disliked CEOs, with only 27% of past and present Celsius employees “approving” of him.</p><p>Brian Armstrong and Changpeng \"CZ\" Zhao, the respective CEOs of Binance and Coinbase, currently have approval ratings of 69% and 65% — both lower than the average approval rate of technology-based CEOs.</p><p><em><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong>Can you trust crypto exchanges after the collapse of FTX?</strong></a></em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-06T04:48:19.000Z",
    "title": "Ethereum Price Retests Uptrend Support But Can Bulls Save The Day",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-retests-1900/",
    "description": "Ethereum price started a downside correction below $1,950 against the US Dollar. ETH is testing the $1,900 support and is showing a few bearish signs. Ethereum is correcting gains below the $1,950 zone. The price is trading below $1,940 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance near $1,925 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start another increase unless there is a close below $1,900 in the near term. Ethereum Price Corrects Gains Ethereum’s price failed to clear the $1,975 resistance and started a downside correction. ETH traded below the $1,950 level and extended its decline, similar to Bitcoin. There was a move below the $1,920 support. Finally, the price spiked below $1,900. A low is formed near $1,894 and the price is now consolidating losses. It is now trading near the 23.6% Fib retracement level of the recent decline from the $1,974 swing high to the $1,894 low. Ether is trading below $1,940 and the 100-hourly Simple Moving Average. There is also a key bearish trend line forming with resistance near $1,925 on the hourly chart of ETH/USD. Immediate resistance is near the $1,925 level the 100-hourly Simple Moving Average. The next major resistance is near the $1,945 level. It is close to the 61.8% Fib retracement level of the recent decline from the $1,974 swing high to the $1,894 low. Source: ETHUSD on TradingView.com A clear move above the $1,945 resistance could push the price toward $1,975. The main resistance is still near the $2,000 level, above which the price could start a decent increase. The next major resistance is near the $2,120 level. Any more gains could send Ether toward the $2,200 resistance. More Losses in ETH? If Ethereum fails to clear the $1,925 resistance or $1,945, it could continue to move down. Initial support on the downside is near the $1,900 level. The first major support is near the $1,870 level. The next major support is near the $1,820 level. If there is a move below the $1,820 support, the price could drop toward the $1,770 support level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,900 Major Resistance Level – $1,945"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T05:05:44.000Z",
    "title": "TRON (TRX) Implements Bandwidth Modification Proposal: Boosting Efficiency and Reducing Low-Value Transactions",
    "url": "https://www.crypto-news-flash.com/tron-trx-implements-bandwidth-modification-proposal-boosting-efficiency-and-reducing-low-value-transactions/?utm_source=rss&utm_medium=rss&utm_campaign=tron-trx-implements-bandwidth-modification-proposal-boosting-efficiency-and-reducing-low-value-transactions",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Stanslavs-TRON-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Stanslavs-TRON-3.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Stanslavs-TRON-3-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Stanslavs-TRON-3-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Stanslavs-TRON-3-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />In a recent tweet, Tron revealed that the network has successfully implemented the proposal to modify the freenetlimit.  The proposal will change the freenetlimit, which will result in the daily free bandwidth for a single account dropping from 1500 to 600. As the Tron blockchain network grows and attracts more users, network developers are actively [...]"
  }
]