[
  {
    "source": "CryptoSlate",
    "date": "2023-06-30T17:59:16.000Z",
    "title": "Recent spot Bitcoin ETF applications fall short of SEC’s expectations on a technicality, but are not out of the running yet",
    "url": "https://cryptoslate.com/recent-spot-bitcoin-etf-applications-fall-short-of-secs-expectations/",
    "description": "<p>On June 30, reports emerged that the U.S. Securities and Exchange Commission (SEC) has returned recent spot Bitcoin exchange-traded fund (ETF) applications. The applications, submitted by exchanges on behalf of BlackRock and Fidelity Investments, among others, were deemed not &#8220;sufficiently clear or comprehensive.&#8221; An anonymous source cited by the Wall Street Journal shared that the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/recent-spot-bitcoin-etf-applications-fall-short-of-secs-expectations/\">Recent spot Bitcoin ETF applications fall short of SEC&#8217;s expectations on a technicality, but are not out of the running yet</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-30T17:40:06.000Z",
    "title": "Bitcoin Cash (BCH) Witnesses Dramatic Surge",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-cash-bch-witnesses-dramatic-surge",
    "description": "<p>BCH has seen a spectacular surge recently, registering weekly gains of 114.3%. </p>\n<p>Bitcoin Cash (BCH) has become this week&rsquo;s highest gainer in the top 300 tokens by market cap following a 114.3% surge in price. The token continues its uptrend, spurred by its listing on EDX Markets.</p>\nBCH Reaches One-Year High\n<p>The token reached a one-year high this week, just days after it listed on the EDX Markets exchange. EDX is backed by several Wall Street heavyweights such as Fidelity Digital Assets, Citadel Securities, Sequoia Capital, and Charles Schwab.</p>\n<p>Unlike other crypto exchanges, EDX only allows investors to trade bitcoin (BTC), Ethereum (ETH), Litecoin (LTC), and BCH.</p>\n<p>Crypto research firm Santiment found BCH has benefitted from EDX&rsquo;s launch, rising trading volumes and social media interest.</p>\n\n<p dir=\"ltr\" lang=\"en\">📈 With the assistance of #EDXMarkets, launched on June 20th, #BitcoinCash has been the biggest beneficiary with a massive +79% price gain in 4 days. Notably, $BCH has seen a 3-year high in social discussion rates, &amp; volume has easily eclipsed 2023 highs. https://t.co/6fz4RL28tH pic.twitter.com/MNn59zRy8T</p>\n&mdash; Santiment (@santimentfeed) June 24, 2023\n<p>\n\n</p>\n<p>The firm further found BCH&rsquo;s sudden price move attracted retail trader attention, with the token&rsquo;s trading volume this year hitting a record.</p>\nBCH Surge Driven by South Korean Traders\n<p>Industry analyst Colin Wu tweeted today that BCH&rsquo;s price increase may be due to trading activity on South Korean exchanges.</p>\n\n<p dir=\"ltr\" lang=\"en\">South Korea may be the reason for the BCH PUMP. In the past 24h, the largest exchange in South Korea, Upbit, has recorded a trading volume of over $350 million for the BCH/KRW, contributing to 23.58% of the total trading volume for BCH. It is also the 3x the trading volume of the&hellip;</p>\n&mdash; Wu Blockchain (@WuBlockchain) June 30, 2023\n<p>\n\n</p>\n<p>Wu noted South Korea&rsquo;s largest exchange Upbit recorded massive trading volumes on the BCH/KRW pair over the past 24 hours. He said more than $350 million in volume accounted for nearly a quarter of the total volume for BCH over that time.</p>\n<p>BCH surged an incredible 31% over the past 24 hours, allowing it to top $300 for the first time since April 2022. The token, however, remains down 92% from its all-time high of $3,785 in December 2017.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T18:00:00.000Z",
    "title": "5 Crypto Projects Defying Crypto Winter – Making Gains While The Market Dips",
    "url": "https://www.cryptopolitan.com/5-crypto-projects-defying-crypto-winter-making-gains-while-the-market-dips/",
    "description": "InQubeta (QUBE) is one of the cryptocurrency projects that’s actively growing despite the ongoing cryptocurrency winter caused by the 2022 market crash. That’s a positive sign for such platforms since it means investor interest in these projects is so high, they can generate substantial token sales despite crypto investors feeling bearish.&#160; InQubeta setting the stage ... <a title=\"5 Crypto Projects Defying Crypto Winter &#8211; Making Gains While The Market Dips\" class=\"read-more\" href=\"https://www.cryptopolitan.com/5-crypto-projects-defying-crypto-winter-making-gains-while-the-market-dips/\" aria-label=\"More on 5 Crypto Projects Defying Crypto Winter &#8211; Making Gains While The Market Dips\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T17:44:07.000Z",
    "title": "Web3 innovators wanted: Binance Labs opens Season 6 Incubation Program",
    "url": "https://www.cryptopolitan.com/web3-innovators-wanted-binance-labs-opens-season-6-incubation-program/",
    "description": "Binance Labs, the venture capital and incubator arm of Binance, has announced the opening of applications for Season 6 of its prestigious Incubation Program. The program is designed to foster innovation in the Web3 space, a burgeoning sector that is at the forefront of the digital revolution. A proven path to success Binance Labs has ... <a title=\"Web3 innovators wanted: Binance Labs opens Season 6 Incubation Program\" class=\"read-more\" href=\"https://www.cryptopolitan.com/web3-innovators-wanted-binance-labs-opens-season-6-incubation-program/\" aria-label=\"More on Web3 innovators wanted: Binance Labs opens Season 6 Incubation Program\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T17:41:00.000Z",
    "title": "Are There Benefits in Evolving From Traditional to Decentralized Media?",
    "url": "https://www.cryptopolitan.com/traditional-to-decentralized-media-benefits/",
    "description": "The digital landscape is perpetually evolving. A concept once relegated to the realms of theoretical discourse and speculative fiction, decentralized media, has now emerged as a distinct reality. Today, it holds the potential to radically reshape the global media landscape and redefine our comprehension of information dissemination. The aim of this comprehensive guide is to ... <a title=\"Are There Benefits in Evolving From Traditional to Decentralized Media?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/traditional-to-decentralized-media-benefits/\" aria-label=\"More on Are There Benefits in Evolving From Traditional to Decentralized Media?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-30T17:43:17.000Z",
    "title": "SEC’s rebuttal to Coinbase’s legal defense set for July 13th",
    "url": "https://crypto.news/secs-rebuttal-to-coinbases-legal-defense-set-for-july-13th/",
    "description": "According to a recent court order issued on Thursday, June 29, the United States Securities and Exchange Commission (SEC) is scheduled to deliver its response to Coinbase's initial legal defense on July 13."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-30T18:00:26.000Z",
    "title": "Bitcoin Price Takes A Hit As SEC Deems Spot ETF Filings ‘Inadequate’",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-price-takes-a-hit-as-sec-deems-spot-etf-filings-inadequate/",
    "description": "The US Securities and Exchange Commission (SEC) has reportedly told exchanges Nasdaq and Cboe that recent filings for spot Bitcoin (BTC) exchange-traded funds (ETFs) from asset managers including BlackRock and Fidelity were not “clear and comprehensive” enough. Bitcoin ETFs In Jeopardy? The SEC has rejected several Bitcoin ETF filings in recent years due to concerns over potential fraudulent and manipulative practices associated with the cryptocurrency market.  The agency has stated that the filings do not meet the standards designed to protect investors and the public interest. In particular, the SEC has expressed concerns about the lack of regulation and oversight in the cryptocurrency market, which could make it easier for bad actors to manipulate the price of Bitcoin and other cryptocurrencies.  Related Reading: Litecoin Up 18% In Past 24 Hours, Is Halving Rally Here? The SEC has also expressed concerns about custody and liquidity issues related to cryptocurrency. While some asset managers have attempted to address these concerns in their filings, the SEC has continued to reject them as inadequate. However, Several proposed solutions have been put forward to address the SEC&#8217;s concerns around Bitcoin ETFs.  One potential solution is the use of regulated custodians to hold the Bitcoin backing the ETF, which would provide greater oversight and security for investors. Some asset managers have also proposed using futures contracts to track the price of Bitcoin, rather than holding the actual cryptocurrency, which could help address liquidity concerns.  In addition, some have suggested that the SEC could work with industry participants to establish best practices and guidelines for the cryptocurrency market, which could help mitigate risks associated with fraudulent and manipulative practices.  Despite these proposals, the SEC has continued to scrutinize Bitcoin ETF filings, indicating that more work may need to be done to address the agency&#8217;s concerns. The SEC declined to comment on the Wall Street Journal report, while Nasdaq and Cboe were not available for immediate comment. The decision is a blow to asset managers&#8217; attempts to launch Bitcoin ETFs, which have been repeatedly blocked by regulators in the US. BTC’s Price Tumbles, Signaling The End Of The Bull Run?  The latest criticism by the US Securities and Exchange Commission (SEC) on filings for spot Bitcoin exchange-traded funds has caused BTC’s price to drop from over $31,000 to $29,800.  Although Bitcoin is currently trading above the $30,000 line, there is uncertainty around the ETF filings by BlackRock and other major financial players, which could lead to another downtrend and a test of lower support. If this were to happen, Bitcoin bulls must hold the $29,500 line, which is the next support below $30,000. Additionally, Bitcoin&#8217;s 50-day moving average (MA) on the daily chart could provide strong support for the cryptocurrency, currently placed at $28,100. Related Reading: Ethereum Classic (ETC) Resumes Uptrend, Notches 13% In The Last Day Nevertheless, as reported on June 29th by NewsBTC, Bitcoin is likely to enter a 10-day period of downtrend due to the loss of the strength of the current uptrend, as noted by the Average Directional Index (ADX) on the 1-day chart. The ADX is a technical indicator that measures the strength of a trend and is used by traders to identify potential price movements. Bitcoin&#8217;s ADX is already spiking down, which suggests a potential shift in trend. Additionally, the squeeze momentum indicator also reflects the downtrend that Bitcoin could be poised to experience in the coming week and a half. Overall, the recent criticism by the US SEC of the filings for spot BTC ETFs by BlackRock and Fidelity adds to the uncertainty surrounding the cryptocurrency&#8217;s future price movements. If the asset managers cannot find common ground with the SEC&#8217;s expectations, their ETF applications could be in jeopardy. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T18:12:22.000Z",
    "title": "Shiba Inu’s Shibarium Hits Impressive Milestones, Fueling Price Surge to $0,0001 and Mainnet Anticipation",
    "url": "https://www.crypto-news-flash.com/shiba-inus-shibarium-hits-impressive-milestones-fueling-price-surge-to-00001-and-mainnet-anticipation/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-shibarium-hits-impressive-milestones-fueling-price-surge-to-00001-and-mainnet-anticipation",
    "description": "Shiba Inu&#8217;s price gained about 3.3 percent in the past 24 hours to trade around $0.00000756 on Friday. According to on-chain data, the Shibarium layer two beta network has processed more than 25.6 million transactions with over 17 million wallets created. The Shiba Inu (SHIB) ecosystem continues to discuss the best route for layer two [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T18:00:10.000Z",
    "title": "Do Meme Coins Like Dogecoin and Shiba Inu have a future or will AI Cryptos like Avorak AI dominate?",
    "url": "https://www.crypto-news-flash.com/do-meme-coins-like-dogecoin-and-shiba-inu-have-a-future-or-will-ai-cryptos-like-avorak-ai-dominate/?utm_source=rss&utm_medium=rss&utm_campaign=do-meme-coins-like-dogecoin-and-shiba-inu-have-a-future-or-will-ai-cryptos-like-avorak-ai-dominate",
    "description": "Meme coins stormed the cryptocurrency arena and executed a meteoric rise, with Dogecoin and Shiba Inu riding on social media buzz and celebrity endorsements. However, as the crypto landscape evolves, an intriguing question emerges: Do these meme coins have a lasting future, or will they eventually be overshadowed by the dominance of AI-driven cryptocurrencies such [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-30T18:05:12.000Z",
    "title": "Crypto Analyst Predicts Bitcoin To Explode by Over 130% and Hit a New All-Time High – Here’s the Timeline",
    "url": "https://dailyhodl.com/2023/06/30/crypto-analyst-predicts-bitcoin-to-explode-by-over-130-and-hit-a-new-all-time-high-heres-the-timeline/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/02/btc-explode-to-50.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/02/btc-explode-to-50.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/02/btc-explode-to-50.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/02/btc-explode-to-50.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/02/btc-explode-to-50.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/02/btc-explode-to-50.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/02/btc-explode-to-50.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto strategist and trader is predicting Bitcoin (BTC) will reach a new all-time high before the end of 2023. Pseudonymous analyst Credible Crypto tells his 341,500 Twitter followers that the top digital asset is likely to rise by more than 130% from its current value of $30,057 in just a matter of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/30/crypto-analyst-predicts-bitcoin-to-explode-by-over-130-and-hit-a-new-all-time-high-heres-the-timeline/\">Crypto Analyst Predicts Bitcoin To Explode by Over 130% and Hit a New All-Time High – Here’s the Timeline</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]