[
  {
    "source": "Cointelegraph",
    "date": "2023-10-02T21:55:41.000Z",
    "title": "Class-action suit filed against Binance for alleged harm to FTX before its collapse",
    "url": "https://cointelegraph.com/news/class-action-suit-filed-against-binance-alleged-harm-ftx-collapse",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/dca70ed3-6097-4421-b4b8-bcbea7f755cb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A California resident is suing Binance and its CEO for tweets last November that, according to allegations, led to the collapse of the rival exchange. </p>\n                    <p><p>A class-action suit was filed against Binance.US and Binance CEO Changpeng Zhao on Oct. 2 in the District Court of Northern California <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cand.418891/gov.uscourts.cand.418891.1.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">alleging</a> various violations of federal and California law on unfair competition for attempting to monopolize the cryptocurrency market by harming its competitor FTX. The suit was brought by Nir Lahav, who is identified only as a California resident. </p><p>At issue are posts made by Zhao on Twitter (now X) in early November on the eve of FTX’s collapse. The posts were made in conjunction with the decision by the defendants to liquidate their holdings in the FTX utility token FTT on Nov. 6. The plaintiffs estimated that Binance owned up to 5% of all FTT tokens. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/7986cab2-32f0-44ca-9c28-411dece73af9.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Suit filed against Binance and Changpeng Zhao. Source: CourtListener</em></figcaption></figure><p>The following day, Zhao stated in a Twitter post that Binance had signed a letter of intent to acquire FTX, but it backed out of that deal one day later. According to the suit:</p><blockquote>“Zhao publicly disseminated this information [on the withdrawal of the acquisition offer] on twitter and other social media platforms to hurt FTX Entities that ultimately lead to a rushed and unprecedented collapse of FTX Entities.” </blockquote><p>After began its argumentation with a defense of the Securities and Exchange Commission’s (SEC) policies on crypto and invocation of the Supreme Court’s Howey and Reves decisions, among others. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">As part of Binance’s exit from FTX equity last year, Binance received roughly $2.1 billion USD equivalent in cash (BUSD and FTT). Due to recent revelations that have came to light, we have decided to liquidate any remaining FTT on our books. 1/4</p>&mdash; CZ  Binance (@cz_binance) <a href=\"https://twitter.com/cz_binance/status/1589283421704290306?ref_src=twsrc%5Etfw\">November 6, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>It went on to claim that Zhao’s Nov. 6 tweet, “Due to recent revelations that have came [sic] to light, we have decided to liquidate any remaining FTT on our books,” was false and misleading, since Binance has already sold its FTT holdings, and the post was “intended to cause the price of FTT in the market to decline.”</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/new-ftx-documentary-to-spotlight-sbf-cz-relationship\">New FTX documentary to spotlight SBF-CZ relationship</a></em></strong></p><p>The plaintiffs found evidence for their claim in the same post by Zhao, where he wrote, “We are not against anyone. […] But we won’t support people who lobby against other industry players behind their backs.” The plaintiffs took the latter sentence to indicate that Binance opposed FTX CEO Sam Bankman-Fried’s “regulatory efforts.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Sad day. Tried, but </p>&mdash; CZ  Binance (@cz_binance) <a href=\"https://twitter.com/cz_binance/status/1590463239925944320?ref_src=twsrc%5Etfw\">November 9, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The suit alleges that Zhao’s proposal to acquire FTX was not made in good faith and the episode would “ultimately lead” to the collapse of FTX:</p><blockquote>“Zhao’s tweet resulted in FTT price declining from US 23.1510 to US 3.1468. This significant drop plummeted FTX Entities into bankruptcy without giving an opportunity or chance to FTX Entities’ executives and board of directors a chance [sic] to salvage the situation and put in safe guards to protect its clients and end-users.” </blockquote><p>The suit demanded monetary damages, court costs and disgorgement of ill-gotten gains based on seven counts. “Plaintiff believes that there are thousands of members of the proposed class,” the suit stated. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">CZ just executed the most gangster play we&#39;ve seen in Crypto, ever, period. The BALLS on this man. Truly -- bravo.<br><br>Also bravo to Sam to choose the correct option that protects customer assets, swallow his pride, and not burn everything down in an unnecessary fight.<br><br>WHAT A SHOW!</p>&mdash; Autism Capital  (@AutismCapital) <a href=\"https://twitter.com/AutismCapital/status/1590014212721758208?ref_src=twsrc%5Etfw\">November 8, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As the suit noted, both Binance and FTX are currently subject to SEC actions. The criminal case against Bankman-Fried <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-preview\">will begin Oct. 4 in New York</a>. Zhao addressed potential accusations of unfair competition in the same tweet that is cited in the suit. “Regarding any speculation as to whether this is a move against a competitor, it is not,” he wrote. </p><p>His statement <a href=\"https://cointelegraph.com/news/binance-s-ftx-acquisition-seen-as-chess-move-by-crypto-community\">did not stop speculation</a> to that effect within the crypto community, however.  The CEOs of the crypto exchanges <a href=\"https://cointelegraph.com/news/cz-and-sbf-duke-it-out-on-twitter-over-failed-ftx-binance-deal\">traded jibes on then-Twitter</a> for weeks afterward.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ftx-bankruptcy-filing-details-binance-crypto-industry-fund-us-cbdc-pilot-hodlers-digest-nov-13-19/\">FTX bankruptcy filing details, Binance’s crypto industry fund and a U.S. CBDC pilot: Hodler’s Digest, Nov. 13-19</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-02T21:50:59.000Z",
    "title": "Ethereum futures ETFs launch with modest first day of trading",
    "url": "https://cryptoslate.com/ethereum-futures-etfs-launch-with-modest-first-day-of-trading/",
    "description": "<p>Nine Ethereum futures exchange-traded funds (ETFs) became available for trading on Oct. 2. The nine funds in that category are offered by six different asset managers: Valkyrie, VanEck, ProShares, Bitwise, Kelly, and VolShares. Each fund is currently trading on the Cboe exchange. Four of the ETFs invest in a combination of Bitcoin futures and Ethereum [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ethereum-futures-etfs-launch-with-modest-first-day-of-trading/\">Ethereum futures ETFs launch with modest first day of trading</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-02T22:00:05.000Z",
    "title": "Will Ethereum Flip Bitcoin? Crypto Analyst Explains How",
    "url": "https://www.newsbtc.com/news/ethereum/will-ethereum-flip-bitcoin/",
    "description": "As the largest cryptocurrency, Bitcoin (BTC) has always dominated the headlines and drives the mainstream hype around cryptocurrencies. In terms of performance, it&#8217;s no news Ethereum (ETH) has followed behind BTC in the past few years. However, according to crypto analyst Dave the Wave, Ethereum could outperform Bitcoin in the coming years.  A Different Perspective Dave the Wave took to social media to share his views on the Ethereum/Bitcoin price action. The current trajectory shows Ethereum has been falling against Bitcoin in terms of performance since the beginning of the year.  Related Reading: IPO Frenzy: What Happens To XRP Price If Ripple Stock Climbs To $600? A more in-depth examination reveals that Ethereum has been following a pattern of lower highs and lower lows, which is indicative of a continued downward trend. However, according to the pseudonymous crypto analyst, a larger timeframe presents a better view of the general situation of things.  “The longer timeframe trumps the shorter, and helps to predict future price action, which is what speculation is all about, as opposed to simply describing recent past price action,” he said. ETH/ BTC Careful of [shorter-term] hindsight bias &#8211; it&#8217;s a series of lower highs until it&#8217;s not. The longer time-frame trumps the shorter&#8230;. and helps to predict future price action, which is what speculation is all about, as opposed to simply describing recent past price… pic.twitter.com/kMrqN3istb — dave the wave🌊🌓 (@davthewave) September 29, 2023 A closer look into a multi-year timeframe shows a falling wedge has been forming in the Ethereum/Bitcoin pair&#8217;s performance since July of 2022. The current situation shows the formation of this wedge might be nearing its end which indicates a decrease in downside momentum and a potential trend reversal.  This possible reversal is reiterated by the Fibonacci indicator, which shows the downward trend is at the 0.236 level. Can Ethereum Outperform Bitcoin? Ethereum has frequently outperformed Bitcoin for periods stretching months at a time. The ecosystem also has a few key advantages over BTX that could help it outperform in the coming years.  Although Bitcoin still reigns as the top cryptocurrency, Ethereum seems poised to gain more mainstream traction in the coming years. As more projects and blockchains are built and connected to the Ethereum network, we could see Ethereum flip Bitcoin in terms of performance as early as next year. Related Reading: Crypto CEO Very Bullish On XRP Price, Sets Make Or Break Point BTC Remains The Primary Vehicle For Wealth Creation Bitcoin still remains the primary vehicle for building wealth in both the crypto and traditional markets. According to Dave The Wave, Bitcoin is poised to continue on this trajectory for the next few years before becoming fully capitalized and on the same level as traditional markets. The analyst makes this prediction by sharing a logarithmic growth curve chart showing BTC still has a higher chance for growth in the longer term.  BTC chart for growth &#124; Source: X Bitcoin, in particular, has led the crypto markets in gains for the past week. Meanwhile, Ethereum has also recorded gains of 9.82% in a 7-day timeframe and is currently trading at $1,730. However, Ethereum faces a resistance at $1,750 which could force a downside correction.  ETH price looks strong above $1,700 &#124; Source: ETHUSD on Tradingview.com Featured image from StealthEX, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-02T22:01:44.000Z",
    "title": "Banking Giant UBS Launches Tokenized Money Market Fund Pilot on Ethereum (ETH)",
    "url": "https://dailyhodl.com/2023/10/02/banking-giant-ubs-launches-tokenized-money-market-fund-pilot-on-ethereum-eth/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/Sends-Over-200000-Eth.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/Sends-Over-200000-Eth.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/Sends-Over-200000-Eth.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/Sends-Over-200000-Eth.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/Sends-Over-200000-Eth.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/Sends-Over-200000-Eth.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/Sends-Over-200000-Eth.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Swiss multinational investment bank and financial services company UBS is launching a &#8220;tokenized money market fund&#8221; pilot program on Ethereum (ETH). In a new blog post, UBS Asset Management announces what it calls the &#8220;first blockchain-native tokenized VCC fund pilot&#8221; in Singapore. Says Thomas Kaegi, Head of UBS Asset Management, Singapore &#38; Southeast Asia, &#8220;This [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/02/banking-giant-ubs-launches-tokenized-money-market-fund-pilot-on-ethereum-eth/\">Banking Giant UBS Launches Tokenized Money Market Fund Pilot on Ethereum (ETH)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]