[
  {
    "source": "Crypto Daily",
    "date": "2023-07-14T21:00:00.000Z",
    "title": "Synthetix Founder Launches Infinex Perpetuals Exchange $SNX",
    "url": "https://cryptodaily.co.uk/2023/07/synthetix-founder-launches-infinex-perpetuals-exchange-snx",
    "description": "<p class=\"md-end-block md-p\">Kain Warwick, founder of the Synthetix derivatives protocol, has introduced Infinex, a new decentralized perpetuals exchange.</p>\n<p class=\"md-end-block md-p\">The venture sets its sights on challenging the dominance of centralized exchanges such as Binance by prioritizing user experience, marking a notable shift in the DeFi status quo.</p>\n<p class=\"md-end-block md-p\">Infinex: Reinventing DeFi User Experience</p>\n<p class=\"md-end-block md-p\">The inception of Infinex reflects a crucial shift among blockchain developers. Increasingly, these innovators recognize that improving user experience is key to onboarding new users and expanding the DeFi sector. </p>\n<p class=\"md-end-block md-p\">In a significant departure from typical DeFi user interfaces, Infinex eliminates the need to use a crypto wallet to sign transactions. Instead, it adopts a common approach: users create a username and password. Their private keys, still essential for signing transactions, are stored in their browsers. However, according to Warwick, these keys will not be able to withdraw deposited funds, prioritizing user security.</p>\n<p class=\"md-end-block md-p\">Centralized Exchanges in Infinex&rsquo;s Sights</p>\n<p class=\"md-end-block md-p\">Warwick has a clear vision for Infinex: directly compete with centralized exchanges like Binance. To achieve this, the exchange needs to balance several factors. It must ensure a user experience on par with centralized counterparts, maintain a genuinely decentralized framework, and address potential security concerhns of storing private keys in the browser.</p>\n<p class=\"md-end-block md-p\">Infinex also recognizes the importance of regulatory compliance. The exchange is defsigned to minimize proprietary components, emphasizing its decentralized foundations and reshaping the traditional concept of liability.</p>\n<p class=\"md-end-block md-p\">Infinex Governance and Operational Design</p>\n<p class=\"md-end-block md-p\">According to details on the project shared via Mirror.xyz, Infinex won't issue its own token for governance purposes. Instead, it will use Synthetix's SNX token to manage its governance. </p>\n<p class=\"md-end-block md-p\">Infinex's initial target market comprises existing crypto traders. To kickstart their trading on Infinex, users will need to deposit either USDT or USDC, both dollar-pegged stablecoins.</p>\n<p class=\"md-end-block md-p\">The exchange is expected to generate revenue from several sources, including trading fees, integration fees from a rewards program, and fees from staking SNX.</p>\n<p class=\"md-end-block md-p\">With the unveiling of Infinex, Warwick brings a fresh perspective to the DeFi sector, placing a premium on user experience. This approach underscores a shift in priorities within the industry and sets a new standard for decentralized exchanges.</p>\n<p class=\"md-end-block md-p\">By focusing on existing crypto traders, Infinex makes a calculated move to attract a significant segment of the market that currently operates on centralized exchanges. The success of this approach will undoubtedly be observed closely by other players in the DeFi sector.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-14T21:00:53.000Z",
    "title": "XRP Explodes With 1,300% Surge In Trading Volume As crypto Exchanges Jump On Board",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-explodes-with-1300-surge-in-trading-volume-as-crypto-exchanges-jump-on-board/",
    "description": "In a long-awaited decision, Judge Torres ruled in favor of XRP in their case against the U.S. Securities and Exchange Commission (SEC) yesterday. The verdict is a positive development for the cryptocurrency industry, particularly with a focus on whether digital assets should be deemed securities in the US. The ruling is expected to set a precedent for the industry moving forward. It is positive for both altcoins and the wider industry, as the default expectation is that these assets are not deemed securities so long as they are made available to the public.  This event will likely have wider implications for ongoing legal cases and may help rebuild confidence in the industry for developers and attract more liquidity to the ecosystem. XRP Defies Expectations With Massive Price Surge And Trading Volume Spike Following the news, XRP saw a surge in price, reaching as high as $0.93, the highest price since May 2021, and closing at $0.82.  According to data compiled by the research company CCData, the news led to an influx of trading activity, with XRP trading pairs on centralized exchanges (CEX) recording a total volume of $6.05 billion on the day, an increase of 1351% from the previous day. Related Reading: Crypto Liquidations Cross $300 Million Amid Massive Market Recovery The relisting of the asset on other centralized exchanges, including Coinbase, Kraken, and Gemini has also contributed to the spike in volumes.  The news surrounding the ruling also led to almost 100% daily gains for XRP, with other tokens such as Solana (SOL) and Cardano (ADA), recently deemed securities, seeing significant gains of 35% and 28%, respectively. Despite the negative backdrop that XRP has faced due to the lawsuit, its market depth liquidity at the 1% level has remained resilient year-to-date (YTD). XRP’s 1% bid/ask side depth at Yearly Open was 26.5 million XRP, which saw a variance of 0.41% throughout the year and remained strong at 25.1 million XRP on the 12th of July. Derivatives Data Shows Positive Sentiment According to the report, Derivatives data indicate that XRP&#8217;s positive funding rate remained steady over the past few days, in line with the wider positive market sentiment.  The lawsuit news generated a significant rise in speculative interest on the bid side, with a $280 million increase in Open Interest, from $635 million to a high of $913 million across exchanges. Moreover, funding rates reached over 0.03% across exchanges, over three times higher than its baseline level of under 0.01% before the announcement. On the other hand, the funding rate history of XRP shows that speculators trading perpetual contracts have been favoring the upside, with minimal time spent this year in negative funding rate territory.  This underscores the positive sentiment of traders for XRP, which was recently rewarded with a large price rise due to the announcement. While it remains to be seen whether XRP will maintain its extremely positive funding rate, it is currently a good standard for gauging positive sentiment within altcoins, given the attention and volume it is generating. Considering the lawsuit&#8217;s success, the implications for the market are overwhelmingly positive, and the ruling provides clarity that did not exist before the judgment.  Related Reading: Here’s What On-Chain Data Reveals About XRP Rally According to CCData, the market could see a few trends emerge, such as coins deemed securities recovering well and potentially outperforming and the potential for Bitcoin dominance to drop as an overall percent of market cap, given renewed optimism in altcoins. Despite the recent surge in positive sentiment and renewed investor confidence, XRP has experienced a significant price drop. After coming close to reaching the $1 mark, which it has not seen since November 2021, XRP is currently trading at $0.7002, marking a decrease of over 11% in the last 24 hours. Featured image from Unsplash, chart from TradingView.com"
  }
]