[
  {
    "source": "Cointelegraph",
    "date": "2024-02-06T00:05:24.000Z",
    "title": " ‘Substitution’ of gold for Bitcoin is now underway, says Cathie Wood ",
    "url": "https://cointelegraph.com/news/substitution-gold-for-bitcoin-now-underway-cathie-wood",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvN2NhNTliYjEtNzFmNC00OTQ5LWI0M2QtZGZhOTU0M2JiMzdkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The ARK Invest CEO expects that trend to continue now that investors can trade Bitcoin in a more accessible way through spot Bitcoin ETFs.</p>\n                    <p><p>Investors are started to move from gold to Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> after the launch of spot Bitcoin exchange-traded funds (ETFs), according to the CEO of ARK Invest. </p><p>“Relative to gold, Bitcoin has been rising. There’s now a substitution into Bitcoin and we think that is going to continue now that there is a less friction-filled way to access Bitcoin,” said ARK Invest’s Cathie Woods in a Feb. 4 chat with chief futurist Brett Winton on the firm’s YouTube channel.</p><p>Like gold, Wood expects Bitcoin to prove itself as a “risk off asset” when the banking sector shows signs of weakness. </p><p><a href=\"https://cointelegraph.com/news/substitution-gold-for-bitcoin-now-underway-cathie-wood\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-06T00:00:25.000Z",
    "title": "Ripple must provide financial statements at SEC’s request, judge rules",
    "url": "https://cryptoslate.com/ripple-must-provide-financial-statements-at-secs-request-judge-rules/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC)&#8217;s request to have Ripple produce certain information has been granted by a judge. Though the SEC&#8217;s case against Ripple has otherwise concluded, the agency requested financial statements, contracts, and a response to an interrogatory on Jan. 11 in order to determine penalties and remedies. U.S. Magistrate Judge Sarah [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ripple-must-provide-financial-statements-at-secs-request-judge-rules/\">Ripple must provide financial statements at SEC&#8217;s request, judge rules</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-06T00:00:30.000Z",
    "title": "Reunit Wallet Launches Reward Program: Trade To Earn",
    "url": "https://news.bitcoin.com/reunit-wallet-launches-reward-program-trade-to-earn/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240205_195539_567-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240205_195539_567-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240205_195539_567-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240205_195539_567-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240205_195539_567-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240205_195539_567-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240205_195539_567-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240205_195539_567-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Reunit Wallet, an omnichain wallet built on technology developed by LayerZero &#38; Stargate Finance, is launching a volume-based reward program. In an effort to stimulate trading activity on its integrated platform and attract new users, Reunit Wallet is implementing a reward system for traders. Starting now, for every $100 in generated volume, users [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-06T00:00:02.000Z",
    "title": "Dogecoin Trounced: Chainlink’s 34% Jump Kicks DOGE Out Of Top 10 List",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-chainlink-34-kicks-doge-top-crypto/",
    "description": "After Chainlink&#8217;s impressive run of more than 34% over the past week, LINK has dethroned Dogecoin (DOGE) from the top 10 crypto by market cap list. Chainlink Has Pulled Away From The Crowd With A Sharp Surge Recently While most cryptocurrency sectors have observed minimal movement recently, Chainlink has emerged as an outlier, enjoying a surge of over 34% in the last week. Related Reading: Bitcoin CDD Shows Bullish Breakout, Rally Returning In Full Flow? The below chart shows how LINK has performed over the past month. The price of the coin seems to have observed a sharp increase in recent days &#124; Source: LINKUSD on TradingView LINK had achieved a major milestone, breaking above the $18 level earlier during this latest rally, but with a sharp 8% continuation of the run, the coin has now surged beyond the $19.5 mark for the first time since early 2022. Should Chainlink&#8217;s surge continue, the cryptocurrency would be retesting the $20 level, which could prove to be a source of major resistance, according to on-chain data. LINK has surged more than 38% over the past thirty days, which means it has significantly outperformed the wider sector. Bitcoin, for instance, hasn&#8217;t even been able to put together positive returns in this period, as the original cryptocurrency&#8217;s price has declined by almost 2%. Thanks to this strong rally, Chainlink has changed its standing among the wider sector. Specifically, the token has shaken things up in the market cap list. Dogecoin Has Lost Its Position In The Top 10 List To LINK Following the rally, LINK has improved its market cap rank and is now the 10th largest cryptocurrency in the sector based on this metric. Dogecoin, holding this spot earlier, has now fallen to 11th. The table below shows how the two assets fit in the broader sector. The current data of the coins placed 9th to 12th on the market cap list &#124; Source: CoinMarketCap Although Chainlink has now surpassed Dogecoin in this metric, the gap between the two assets is still not much. This means the two coins may continue to flip each other in the coming days unless one shows diverging performance. As LINK has arrived at this spot with a sharp surge, things may be looking favorably for the asset, especially considering that DOGE has rather put up negative returns in the past week. Related Reading: These Are The Four Key Bitcoin Price Levels To Watch, Reveals Analyst The overall picture has also been a bit dire for the memecoin recently, as the chart below displays that its price has followed a sideways trajectory during the past month. Looks like the memecoin has observed stale price action for most of this period &#124; Source: DOGEUSD on TradingView Unless things change fast for Dogecoin, its exit from the top 10 list may be here to stay. Of course, this only assumes that Chainlink itself doesn&#8217;t fall off shortly. Featured image from Shutterstock.com, charts from TradingView.com"
  }
]