[
  {
    "source": "Decrypt",
    "date": "2024-04-01T18:00:00.000Z",
    "title": "Solana DeFi Trading Hits All-Time High Amid Meme Coin Frenzy",
    "url": "https://decrypt.co/224308/solana-defi-trading-all-time-high-meme-coin-frenzy",
    "description": "Decentralized exchanges on Solana just had a record month as meme coins like Dogwifhat (WIF) and others continue flying."
  },
  {
    "source": "Decrypt",
    "date": "2024-04-01T17:42:23.000Z",
    "title": "Bitcoin Miner IREN's Stock Price Surges Ahead of Halving",
    "url": "https://decrypt.co/224309/bitcoin-miner-iren-stock-price-surges-ahead-halving",
    "description": "The firm now holds $300 million of debt-free cash on its balance sheet ahead of the Bitcoin halving, with expansion plans on the horizon."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-01T17:55:30.000Z",
    "title": " DeFi hub Chainage seeks tokenholder approval for $13M capital raise ",
    "url": "https://cointelegraph.com/news/defi-hub-chainage-seeks-tokenholder-approval-capital-raise",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvMjI0YzY5YTYtNTU2ZC00YTI1LTkwOGUtMWE5YjM2Yjc3MjMwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>\"Pending DAO approval, we will advance with the particulars of the investment and detail the precise arrangements and plans,\" developers wrote. </p>\n                    <p><p>Decentralized finance service provider Chainage, with around $100 million in total value locked, is seeking to raise $13 million for protocol expansion, contingent on tokenholders’ approval within its native decentralized autonomous organization (DAO).</p><p>According to the April 1 snapshot <a href=\"https://snapshot.org/#/chaingers.eth/proposal/0xbf261c0205370e4284a72b9b08d1b372f5f5e820b6d6f6d583cd0423f09229ad\" target=\"_blank\" rel=\"noopener nofollow\">proposal</a>, the $13 million raise, led by an unknown venture capital firm, will result in the issuance of 50 million additional XCHNG protocol tokens representing approximately 10% of Chainage’s circulating supply. The issuance price of $0.26 is roughly at par with XCHNG’s token price at the time of publication. </p><p>Users are able to vote in the proposal by staking their native XCHNG tokens in exchange for “vXCHNG,\" which represents voting rights tokens. “We are set to implement numerous strategies to enhance usage and profitability, as a result enabling us to assure vXCHNG holders a minimum of $1 Million in profit generation for Q2,\" developers wrote, adding: </p><p><a href=\"https://cointelegraph.com/news/defi-hub-chainage-seeks-tokenholder-approval-capital-raise\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-04-01T18:07:23.000Z",
    "title": "Bitcoin falls over 4% to retest $68k support as Q2 starts",
    "url": "https://cryptoslate.com/bitcoin-falls-over-4-to-retest-68k-support-as-q2-starts/",
    "description": "<p>Bitcoin fell over 4.5% to a local low of $68,000 on April 1, marking a red start to the month after seven consecutive monthly closes in the green. The flash crash resulted in $319.43 million in liquidations over the past 24 hours — with longs making up the vast majority at $252.42 million. While there [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-falls-over-4-to-retest-68k-support-as-q2-starts/\">Bitcoin falls over 4% to retest $68k support as Q2 starts</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-04-01T17:54:57.000Z",
    "title": "$BTC: We Are in the Phase of Transitioning Between ‘Enthusiastic Bull’ and ‘Euphoric Bull’, Says Glassnode Analyst",
    "url": "https://www.cryptoglobe.com/latest/2024/04/btc-we-are-in-the-phase-of-transitioning-between-enthusiastic-bull-and-euphoric-bull-says-glassnode-analyst/",
    "description": "In a recent interview with Cointelegraph, James Check, the lead on-chain analyst at Glassnode, shared his predictions and insights into the Bitcoin market. He suggested that we’re on the cusp of entering the second, more explosive phase of the current bull cycle, referred to as “the euphoric bull.” James Check explains that we are transitioning […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-01T17:53:00.000Z",
    "title": "BEFE Coin: A New Contender in the Crypto World, Comparable to $PEPE, $WIF, and $SLERF",
    "url": "https://cryptodaily.co.uk/2024/04/befe-coin-a-new-contender-in-the-crypto-world-comparable-to-pepe-wif-and-slerf",
    "description": "With the ongoing bull cycle where both Bitcoin and Ethereum are touching all-time highs, altcoins and memecoins are also set to witness impressive pumps in price. $PEPE, $WIF, and $SLERF"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T17:55:27.000Z",
    "title": "Romanian CS:GO Player Makes History with Major Win",
    "url": "https://www.cryptopolitan.com/romanian-csgo-player-makes-history/",
    "description": "Ivan “iM” Mihai, representing NAVI, has secured his place in Counter-Strike history by clinching the first CS2 Major trophy. The 24-year-old Romanian player received a hero’s welcome upon his return home, greeted by enthusiastic fans who celebrated his groundbreaking achievement. NAVI’s triumph at PGL Copenhagen marks a significant milestone for the organization and Romanian esports. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T17:51:24.000Z",
    "title": "Warzone Introduces Totally Advanced Resurgence Mode for Chaotic Gameplay",
    "url": "https://www.cryptopolitan.com/warzone-totally-advanced-resurgence/",
    "description": "Warzone enthusiasts are in for a treat as Raven Software launches the Totally Advanced Resurgence mode, adding a unique twist to the battle royale experience. With a flurry of gameplay modifiers, this limited-time mode promises to deliver an adrenaline-fueled adventure like never before. What is Totally Advanced Resurgence Mode? Warzone’s Totally Advanced Resurgence mode is [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T17:45:00.000Z",
    "title": "Uniswap Price Prediction 2024-2033: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2024-2033 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-04-01T17:59:48.000Z",
    "title": "ETHEREUM PRICE ANALYSIS & PREDICTION (April 1) – ETH Remains Bullish But May Lose Grip If This Support Collapses",
    "url": "https://nulltx.com/ethereum-price-analysis-prediction-april-1-eth-remains-bullish-but-may-lose-grip-if-this-support-collapses/",
    "description": "Ethereum’s ETH correlation with Bitcoin’s pattern is still much intact but appears to be lagging in the recent recovery. However, it is down 4% today following the latest decrease in the global market. The bears are showing interest! The late February recovery has temporarily halted due to a choppy price [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-01T18:00:10.000Z",
    "title": "Forget Bitcoin, Altcoins Are The Winners Of This Cycle, Crypto Analyst Says",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-altcoins-winners-crypto/",
    "description": "All eyes look to be on the flagship crypto, Bitcoin, ahead of the Bitcoin Halving, as market analysts predict further upside moves for the crypto token. However, crypto analyst Jason Pizzino recently made a strong case for altcoins like Ethereum (ETH) and Solana (SOL) and why much focus should also be placed on them.  Ethereum And Solana Still Primed For Strong Moves Ahead Of Bitcoin Pizzino suggested in a video on his YouTube channel that Ethereum could experience a breakout in the coming months. This came following his analysis of the ETH/BTC pair, in which he noted that Bitcoin was currently taking the spotlight with new all-time highs (ATH) while ETH looks to be consolidating.  Related Reading: Panel Of Experts Reveal When The Cardano Price Will Reach $3 As highlighted by the analyst, this is similar to the previous bull run when ETH consolidated while Bitcoin was hitting new ATHs. However, ETH experienced a significant rise soon after then while Bitcoin cooled off. As such, if history were to repeat itself, ETH could once again enjoy a trend reversal soon enough and make a parabolic move to the upside. Pizzino also mentioned SOL as another altcoin that can potentially move to new prices against Bitcoin’s value. In the last bull run, the crypto token also experienced significant moves to the downside as Bitcoin hit new ATHs. However, a trend reversal quickly followed afterward, with SOL enjoying moves to the upside.  Therefore, SOL, like ETH, could be primed for price surges if history were to repeat. Pizzino added that this is a time to be aware and see any price dip as a buying opportunity to position for these price gains that could be on the horizon.  Ethereum Showing Some Strength  Crypto analyst Michaël van de Poppe echoed Pizzino’s sentiments in a post on his X (formerly Twitter) platform. While analyzing the ETH/BTC pair, he noted that ETH’s price hasn’t made any significant move against Bitcoin’s as of yet. However, he added that it is a “good sign to see some slight strength in Ethereum.” Related Reading: Prepping For $100,000: Bitcoin Shark And Whales Spend Over $18 Billion To Buy BTC Like Pizzino, van de Poppe also expects Ethereum to make a massive move against Bitcoin’s value soon enough. The crypto expert explicitly stated that he still expects “a lot” from the second-largest crypto token by market cap. Besides Ethereum, van de Poppe has continued making a case for other altcoins as he believes they are still undervalued.  In another X post, he highlighted that altcoins are down between 25% and 40% from their recent highs. However, van de Poppe remarked that this is the perfect time to take positions and that these consolidations should be seen as opportunities rather than a drawbacks.  BTC takes crypto market down with flash crash &#124; Source: BTCUSD on Tradingview.com Featured image from The Top Coins, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-04-01T18:08:45.000Z",
    "title": "SOL and Solana-Based Altcoin Set for New Heights, Trader Reassesses Dogecoin Outlook",
    "url": "https://www.crypto-news-flash.com/sol-and-solana-based-altcoin-set-for-new-heights-trader-reassesses-dogecoin-outlook/?utm_source=rss&utm_medium=rss&utm_campaign=sol-and-solana-based-altcoin-set-for-new-heights-trader-reassesses-dogecoin-outlook",
    "description": "<img width=\"1260\" height=\"787\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Solana.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Solana\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Solana.jpg 1260w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Solana-300x187.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Solana-1200x750.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Solana-768x480.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Solana-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Solana-450x281.jpg 450w\" sizes=\"(max-width: 1260px) 100vw, 1260px\" />Crypto analyst Bluntz predicts a bullish trend for Solana (SOL) and Dogecoin (DOGE) based on technical indicators and historical patterns. Turner&#8217;s insights on Solana&#8217;s milestones and Bitcoin&#8217;s halving event contribute to the positive market sentiment, driving SOL&#8217;s surge toward the $300 milestone. Cryptocurrency analyst Bluntz, renowned for his accurate altcoin forecasts, has signaled potential bullish [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-04-01T17:46:46.000Z",
    "title": "DOS Labs Secures $2.45 Million Investment to Revolutionize Battle Royale Gaming with MetaDOS",
    "url": "https://www.crypto-news-flash.com/dos-labs-secures-2-45-million-investment-to-revolutionize-battle-royale-gaming-with-metados/?utm_source=rss&utm_medium=rss&utm_campaign=dos-labs-secures-2-45-million-investment-to-revolutionize-battle-royale-gaming-with-metados",
    "description": "<img width=\"1200\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-01T204412.968.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-01T204412.968.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-01T204412.968-300x300.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-01T204412.968-1024x1024.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-01T204412.968-150x150.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-01T204412.968-768x768.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-01T204412.968-450x450.png 450w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-01T204412.968-24x24.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-01T204412.968-48x48.png 48w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/unnamed-2024-04-01T204412.968-96x96.png 96w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />DOS Labs, the visionary developer and publisher behind the highly anticipated battle royale game MetaDOS, has successfully raised $2.45 million in funding. The investment round was led by prominent venture capital firms Kangaroo Capital, AZA Ventures, Brainbox, GD10 Capital, and Avalon Wealth Club.  The infusion of capital will fuel the development and imminent launch of [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-04-01T18:05:56.000Z",
    "title": "Bitcoin-Powered Altcoin Skyrockets Over 470% in Just Over a Week As Rest of Market Corrects",
    "url": "https://dailyhodl.com/2024/04/01/bitcoin-powered-altcoin-skyrockets-over-470-in-just-over-a-week-as-rest-of-market-corrects/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/radar-altcoin-amid-doldrums.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/radar-altcoin-amid-doldrums.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/radar-altcoin-amid-doldrums.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/radar-altcoin-amid-doldrums.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/radar-altcoin-amid-doldrums.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/radar-altcoin-amid-doldrums.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/radar-altcoin-amid-doldrums.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>One layer-one blockchain project developing in the Bitcoin (BTC) ecosystem is skyrocketing in value as the broader crypto market consolidates. Core (CORE), which aims to leverage Bitcoin’s proof-of-work system (POW) along with the attributes of proof-of-stake (POS) using its own consensus mechanism called satoshi plus, has soared more than 477% in the past week. Core [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/04/01/bitcoin-powered-altcoin-skyrockets-over-470-in-just-over-a-week-as-rest-of-market-corrects/\">Bitcoin-Powered Altcoin Skyrockets Over 470% in Just Over a Week As Rest of Market Corrects</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]