[
  {
    "source": "Decrypt",
    "date": "2024-01-26T22:43:29.000Z",
    "title": "Someone Recreated 'Diablo III' in NFT Game 'Nifty Island' Amid Airdrop Campaign",
    "url": "https://decrypt.co/214465/someone-recreated-diablo-3-nft-game-nifty-island-amid-airdrop-campaign",
    "description": "A passionate Diablo fan created an expansive game modeled after the popular franchise within Nifty Island, a buzzy new NFT game."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-26T23:00:43.000Z",
    "title": "Worldcoin to Redesign Iris Scanning Orb",
    "url": "https://news.bitcoin.com/worldcoin-to-redesign-iris-scanning-orb/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/b396f385-83e9-4658-bf5d-b7ef6751e60a-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Worldcoin to Redesign Iris Scanning Orb\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/b396f385-83e9-4658-bf5d-b7ef6751e60a-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/b396f385-83e9-4658-bf5d-b7ef6751e60a-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/b396f385-83e9-4658-bf5d-b7ef6751e60a-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/b396f385-83e9-4658-bf5d-b7ef6751e60a-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/b396f385-83e9-4658-bf5d-b7ef6751e60a-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/b396f385-83e9-4658-bf5d-b7ef6751e60a-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/b396f385-83e9-4658-bf5d-b7ef6751e60a.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Worldcoin will change the design of the Orb, the device used for scanning the irises of users as proof of personhood for the project, to be more friendly and less polarizing. Alex Blania, CEO and co-founder of Tools For Humanity, the company behind Worldcoin, stated that the next iteration would be akin to an &#8220;Apple [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T22:58:28.000Z",
    "title": "Global stock market ticks up as dollar loses ground",
    "url": "https://www.cryptopolitan.com/global-stocks-tick-up-as-dollar-loses-ground/",
    "description": "Friday brought a flicker of optimism to global markets as the MSCI&#8217;s global stock index nudged upwards, a subtle yet telling sign of shifting investor sentiment. Meanwhile, the dollar, that bastion of financial stability, found itself on a slight decline, an intriguing twist in the economic narrative especially after the latest inflation data from the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T22:53:59.000Z",
    "title": "BlackRock’s iShares Bitcoin ETF (IBIT) surpasses $2 billion AUM in just ten days",
    "url": "https://www.cryptopolitan.com/blackrocks-ishares-bitcoin-etf-ibit-2-b/",
    "description": "BlackRock&#8217;s iShares Bitcoin ETF (IBIT) has made a significant impact on the cryptocurrency investment industry by amassing over $2 billion in assets under management (AUM) within a mere ten days of its trading debut, as reported by Bloomberg Terminal data. This achievement highlights not only the strong interest among investors but also signifies a pivotal [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-26T23:00:46.000Z",
    "title": "Bitcoin Crash Ahead: Expert Predicts Testing $20K Before Rebound",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-crash-ahead-expert-predicts-testing-20k-before-rebound/",
    "description": "Bitcoin, the largest cryptocurrency in the market, experienced a price recovery on Friday; however, industry experts anticipate a further test of sub-$30,000 levels in the near term.  The prolonged downtrend observed over the past fourteen days, coupled with mounting selling pressure, has raised concerns about the sustainability of the recent rebound. BTC’s Local Bottom Predicted Chris Burniske, co-founder of a New York-based venture crypto firm, highlights several factors contributing to the anticipated downward movement of Bitcoin.  Burniske suggests that the consolidation phase may extend longer than expected due to many variables, including crypto-market dynamics, macroeconomic conditions, adoption trends, and new product developments.  Burniske offers his outlook on Bitcoin, stating that a local bottom could be reached in the $30,000 to $36,000 range. However, he wouldn&#8217;t be surprised if the cryptocurrency tests the mid-to-high $20,000 before recovery occurs, leading to a renewed push toward previous all-time highs.  Burniske cautions that the path to such a recovery will likely be volatile, marked by potential fakeouts, and may span several months. Related Reading: Is Chainlink (LINK) Ready To Soar? Key Indicators To Monitor The market expert advises investors to exercise patience during this period of uncertainty. Burniske suggests that other cryptocurrencies may experience more significant percentage declines if his predictions hold Bitcoin. Burniske further stated: Before you get mad with, &#8220;We&#8217;re just getting this cycle started, Chris!!!&#8221; Mostly agree, ~called the cycle bottom in Nov 2022 and continue to believe the long-term trend remains robust. Have also seen a lot of crypto volatility over the last decade+&#8230;. recently, I&#8217;ve specifically been discussing a local top and local low, not a cycle-wide top and low.  Buy Signal For Bitcoin Crypto analyst Ali Martinez has provided insights into potential price movements for Bitcoin in its latest analysis conducted on the social media platform X (formerly Twitter).  Martinez&#8217;s assessment indicates that the TD Sequential indicator recently flashed a buy signal on the daily chart, coinciding with Bitcoin&#8217;s current position above the 100-day Simple Moving Average (SMA) at approximately the $40,000 level.  According to Martinez, if Bitcoin surpasses the $40,550 resistance level, it may trigger an upswing with a target price of $43,000. This bullish scenario implies a potential price rally for Bitcoin soon.  However, the analyst also highlights the importance of closely monitoring the 100SMA support level, as a breach of this level could have significant implications for the cryptocurrency&#8217;s price trajectory. Martinez cautions that if the 100SMA support level is breached, it might result in Bitcoin experiencing a downward move toward the $33,300 level. This potential downside scenario indicates a critical support level that, if broken, could lead to increased selling pressure and a bearish sentiment in the market. Related Reading: Algorand CEO’s X Account Hacked, Is Justin Sun Involved? At the time of writing, BTC’s price has recovered 3.8% over the past 24 hours, resulting in a current trading price of $41,400. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-26T23:01:18.000Z",
    "title": "Coinbase Stock on the Rise After Oppenheimer Upgrade To ‘Outperform’: Report",
    "url": "https://dailyhodl.com/2024/01/26/coinbase-stock-on-the-rise-after-oppenheimer-upgrade-to-outperform-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/Coinbase-Will-Win-Lawsuit-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/Coinbase-Will-Win-Lawsuit-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/Coinbase-Will-Win-Lawsuit-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/Coinbase-Will-Win-Lawsuit-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/Coinbase-Will-Win-Lawsuit-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/Coinbase-Will-Win-Lawsuit-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/Coinbase-Will-Win-Lawsuit-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Coinbase’s (COIN) stock is rising after multiple reports of being upgraded to “outperform” by a prominent investment brokerage and bank. According to a new report by Yahoo Finance, financial services giant Oppenheimer expects the top US-based crypto exchange platform’s stock to outperform expectations and reach a price tag of $160. In an accompanying research note, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/26/coinbase-stock-on-the-rise-after-oppenheimer-upgrade-to-outperform-report/\">Coinbase Stock on the Rise After Oppenheimer Upgrade To ‘Outperform’: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]