[
  {
    "source": "CoinDesk",
    "date": "2023-07-11T18:43:58.000Z",
    "title": "Arkham CEO Defends ‘DOX-to-Earn’ Program, Says Public Blockchains ‘Worst’ for Privacy",
    "url": "https://www.coindesk.com/tech/2023/07/11/arkham-ceo-defends-dox-to-earn-program-says-public-blockchains-worst-for-privacy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "“Publicly available blockchains are probably the worst possible way of keeping one’s private information private,” said Arkham CEO Miguel Morel."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-11T18:39:34.000Z",
    "title": "UK Treasury plans to exclude derivatives and 'unbacked' tokens from regulatory sandbox",
    "url": "https://cointelegraph.com/news/uk-treasury-exclude-derivatives-unbacked-tokens-regulatory-sandbox",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/3353dc6c-718f-45a7-9dd8-7d05bcfcbb10.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>“Until there is more certainty in these frameworks, we are intending to utilise existing regulatory initiatives to develop policy and regulation for this asset class,” said Treasury.</p>\n                    <p><p>The treasury department of the United Kingdom has proposed excluding unbacked cryptoassets and derivatives from its plans for a Digital Securities Sandbox.</p><p>In a consultation paper released on July 11, HM Treasury <a href=\"https://www.gov.uk/government/consultations/consultation-on-the-digital-securities-sandbox\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the regulatory sandboxes which will be established under the country’s Financial Services and Markets Act will provide the U.K. government the time to modify existing legislation, if needed, for crypto products. The proposed framework was aimed at giving firms the opportunity to operate as parliament considers where its products or services may fall under existing regulations.</p><p>However, according to the consultation paper, these considerations may not extend to “unbacked cryptoassets” for which regulations were “still evolving” as well as derivatives. Treasury said it would consider feedback on its proposed digital securities sandbox until the consultation ends in August 2023.</p><p>The framework suggested that assets including Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) may not qualify under the Treasury initiative. U.K. lawmakers have previously <a href=\"https://cointelegraph.com/news/crypto-regulated-as-gambling-uk-treasury\">labeled the cryptocurrencies</a> as “unbacked” and argued for them to be treated as gambling.</p><p>“Until there is more certainty in these frameworks, we are intending to utilise existing regulatory initiatives to develop policy and regulation for this asset class,” said Treasury, in reference to unbacked tokens.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-law-united-kingdom-law-commission-recommends-crypto-law-reforms\"><strong><em>UK Law Commission recommends ‘distinct’ legal category for crypto</em></strong></a></p><p>Under the Financial Services and Markets Act, crypto companies operating in the U.K. will have to comply with certain guidelines aimed at promoting innovative technologies while protecting consumers. The country’s Financial Conduct Authority <a href=\"https://cointelegraph.com/news/uk-financial-watchdog-reminds-crypto-firms-october-deadline-marketing-compliance\">issued a warning to firms</a> that the framework would allow only “four routes to lawfully communicate cryptoasset promotions” starting in October 2023. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T18:56:21.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-11T19:00:05.000Z",
    "title": "BNB Whale Moves $35 Million To Binance Ahead Of Arkham (ARKM) Sale",
    "url": "https://www.newsbtc.com/altcoin/bnb-whale-moves-35-million-to-binance/",
    "description": "In a stunning development that has reverberated throughout the cryptocurrency community, a massive whale transaction involving $35 million worth of BNB deposits has sent shockwaves through the upcoming ARKM token sale on Binance.  Unveiling the Whale&#8217;s Enormous BNB Deposit for ARKM Token Sale Lookonchain, an on-chain smart money analytical platform, has shed light on this extraordinary event, revealing that the whale strategically divided the deposits into four batches across different Binance deposit addresses.  A giant whale deposited 141,835 $BNB ($35M) to #Binance 3 hrs ago through 4 Binance deposit addresses. The whale may participate in the Arkham (ARKM) token sale. Due to the purchase cap of 300K $ARKM, the whale deposited $BNB to 4 Binance accounts in order to buy more $ARKM. pic.twitter.com/9hlSCPLlKj — Lookonchain (@lookonchain) July 11, 2023 The timing and magnitude of this transaction have ignited speculations about the whale&#8217;s intentions and its potential impact on the ARKM token sale, heightening anticipation within the industry. Related Reading: Solana (SOL) Outperforms Top Coins With 14% Gains In Last Week Lookonchain&#8217;s report highlights the staggering scale of the whale&#8217;s deposit, amounting to a remarkable 141,835 BNB tokens valued at an astounding $35 million.  As industry observers dissect the implications of this massive deposit, the crypto community eagerly awaits further developments surrounding the ARKM token sale. Strategic Maneuvering to Surpass ARKM Limit per User The timing and nature of the whale&#8217;s deposit suggest a calculated strategy to bypass the imposed ARKM limit per user. Lookonchain&#8217;s analysis posits that by utilizing multiple Binance accounts, the whale aims to acquire a larger allocation of ARKM tokens than the prescribed limit of 300,000 per participant. BNB price recovers ahead of Arkham sale &#124; Source: BNBUSD on TradingView.com This crafty maneuver has sparked conversations about the potential impact on the token sale&#8217;s dynamics and has set the stage for an intriguing battle between the whale and the established rules of participation. In preparation for the highly anticipated ARKM token sale, Binance has unveiled a comprehensive four-step plan that ensures a fair and transparent process for all participants.  The stages include a meticulous calculation of participants&#8217; balances during the preparation period, followed by a subscription period where users commit their BNB tokens by signing a Token Purchase Agreement. Related Reading: MATIC Gains 10% In One Day, Is A Price Rally Coming? Subsequently, the calculation period concludes the subscription phase and marks the initiation of token allocation calculations. Finally, the token sale culminates with the Final Token Distribution stage, where BNB tokens are deducted and users receive their ARKM and remaining BNB tokens. The implications of the whale&#8217;s actions on the allocation process and the overall dynamics of the sale remain uncertain. But with Binance&#8217;s carefully orchestrated four-step plan in place, the industry is bracing itself for a high-stakes showdown that could reshape the landscape of this eagerly anticipated token sale. Featured image from Blockchain Media Indonesia, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-11T18:45:04.000Z",
    "title": "XRPL at the Forefront of CBDC Explorations by Governments, Says Analytics Firm Messari",
    "url": "https://dailyhodl.com/2023/07/11/xrpl-at-the-forefront-of-cbdc-explorations-by-governments-says-analytics-firm-messari/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/xrpl-at-cbdc-says.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/xrpl-at-cbdc-says.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/xrpl-at-cbdc-says.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/xrpl-at-cbdc-says.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/xrpl-at-cbdc-says.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/xrpl-at-cbdc-says.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/xrpl-at-cbdc-says.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analytics platform Messari says Ripple is working with governments across the globe to explore central bank digital currencies (CBDCs) built atop the XRP Ledger (XRPL) blockchain. According to Messari, Ripple is collaborating with over a dozen countries on CBDCs that will run on the XRPL blockchain. The XRP Ledger uses XRP as the native [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/11/xrpl-at-the-forefront-of-cbdc-explorations-by-governments-says-analytics-firm-messari/\">XRPL at the Forefront of CBDC Explorations by Governments, Says Analytics Firm Messari</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-11T18:41:07.000Z",
    "title": "Kevin O’Leary-Backed Wonderfi Closes Merger To Create Largest Crypto Platform in Canada",
    "url": "https://dailyhodl.com/2023/07/11/kevin-oleary-backed-wonderfi-closes-merger-to-create-largest-crypto-platform-in-canada/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/03/lawmakers-ban-crypto-russian.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/03/lawmakers-ban-crypto-russian.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/03/lawmakers-ban-crypto-russian.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/03/lawmakers-ban-crypto-russian.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/03/lawmakers-ban-crypto-russian.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/03/lawmakers-ban-crypto-russian.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/03/lawmakers-ban-crypto-russian.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A Canadian crypto exchange backed by one of the stars of the hit TV show Shark Tank is closing in on a merger that will create the largest crypto trading platform in Canada. Kevin O&#8217;Leary, aka Mr. Wonderful, a long-time crypto supporter, is backing Wonderfi, a Canadian exchange that is merging with other major Canadian [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/11/kevin-oleary-backed-wonderfi-closes-merger-to-create-largest-crypto-platform-in-canada/\">Kevin O’Leary-Backed Wonderfi Closes Merger To Create Largest Crypto Platform in Canada</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]