[
  {
    "source": "Cryptopolitan",
    "date": "2023-12-16T11:55:15.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-16T11:50:01.000Z",
    "title": "Frax Finance’s Strategic Expansion Across DeFi Platforms via Axelar Network",
    "url": "https://www.cryptopolitan.com/frax-finances-expansion-defi-axelar-network/",
    "description": "Frax Finance has announced a groundbreaking initiative to expand its ecosystem. Leveraging the Axelar Network, Frax Finance is set to issue its key ecosystem assets, including its stablecoin FRAX and frxETH, across multiple DeFi platforms. This strategic move aims to amplify the reach of Frax Finance&#8217;s assets and fortify its position in the DeFi space. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-16T11:47:51.000Z",
    "title": "Ripple forecasts major shifts in crypto regulation for 2024",
    "url": "https://www.cryptopolitan.com/ripple-clo-forecasts-major-shifts-in-crypto/",
    "description": "Stuart Alderoty, the Chief Legal Officer at Ripple, has set a bold tone for 2024 with his predictions concerning U.S. crypto regulation and the ongoing legal battle between Ripple and the U.S. Securities and Exchange Commission (SEC). Alderoty anticipates the conclusion of Ripple&#8217;s protracted legal case with the SEC, which he calls a &#8220;misguided lawsuit,&#8221; [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-16T11:43:18.000Z",
    "title": "CfA Highlights Concerns Over Circle’s Operations and Ties to TRON",
    "url": "https://www.cryptopolitan.com/cfa-concern-circles-operations-and-ties-tron/",
    "description": "Campaign for Accountability (CfA) sent a letter to U.S. Senators Sherrod Brown and Elizabeth Warren addressing Circle Chief Strategy Officer Dante Disparte’s response to CfA’s previous concerns about the company&#8217;s operations.  CfA, a nonpartisan, nonprofit watchdog organization, initially raised concerns over Circle’s USDC stablecoin, its integration with the Asian blockchain network TRON, and TRON’s founder, [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-16T11:59:24.000Z",
    "title": "ETHEREUM PRICE ANALYSIS & PREDICTION (December 15) – ETH Dips Below $2,300 In The Ongoing Meltdown, Incoming Correction? ",
    "url": "https://nulltx.com/ethereum-price-analysis-prediction-december-15-eth-dips-below-2300-in-the-ongoing-meltdown-incoming-correction/",
    "description": "Ethereum lost 3% of its value today following the current drawdown across the crypto market. It has formed a bearish pattern and now looks set for a big drop in the lower timeframe.  During the last leg up, ETH touched $2,403 last week and saw a quick rejection there. This [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-16T12:08:16.000Z",
    "title": "Analyst Predicts XRP Price Will Rise 800% To $5.5 – The Timeframe Will Shock You",
    "url": "https://www.newsbtc.com/news/analyst-predicts-xrp-price-will-rise-800-to-5-5-the-timeframe-will-shock-you/",
    "description": "Popular crypto analyst EGRAG crypto has dropped what looks like the most bullish price prediction for XRP. XRP has been subjected to various price predictions in the past few months from EGRAG and other crypto analysts, as the crypto now has free rein on its price movement. This time, the analyst claims XRP is ready to explode 800% in just two weeks, rocketing from under $0.65 today to over $5.50 in just 14 days. EGRAG&#8217;s analysis pointed to price movement and the Fibonacci indicator, indicating XRP is gearing up for a huge rally. Related Reading: Osmosis Rally Intensifies With 77% Increase – Will OSMO Hit $2 This Month? Massive XRP Price Surge In A Short Time EGRAG took to social media platform X to reveal his latest prediction about XRP. The prediction came as an update to the analyst’s earlier prediction in May, where he shared that XRP&#8217;s price was at the final wake up line. The Final Wake Up Line was drawn from XRP&#8217;s all time high of $3.40 in 2018, sloping downwards as the crypto continued to form lower highs. At that time, XRP was trading at $0.4639 and EGRAG gave three price targets of $0.85 to $1, $5.5, and $6.1 in the coming months. The analyst also drew a bottom (Atlas) line on higher lows since 2021 to form a symmetrical triangle. #XRP Mid-Term Target (0.85c &#8211; $1 &#8211; $5.5 &#8211; $6.4): The &#8216;Final Wake Up Line&#8217; is gauging the next #XRP breakout. Once #XRP breaks it and retest it without breaking Fib 0.236 (0.45c) on the Weekly Time frame then I can say with high degree of certainty that Fib 1.618 ($5.5 &#8211; $6.4)… pic.twitter.com/xzPMi7b7FN — EGRAG CRYPTO (@egragcrypto) May 22, 2023 Now five months after, XRP has had major events in its ecosystem, becoming the only crypto asset to receive regulatory clarity in the US. As a result, XRP went on a price growth that led to a spike over $0.93 against USDT on various crypto exchanges. According to EGRAG, his first target of the $0.85 to 1$ was completed amidst the price spike.  XRPUSD currently trading at $0.6231  territory. Chart: TradingView.com A look at the price chart shared by EGRAG reveals XRP seems to have formed a support around this final wake-up line. Now, the next target is around $5.5, a measured move of the symmetrical triangle formed between the final wake up and atlas line. EGRAG claims we could see XRP trade at this price point in just two weeks.  #XRP 3 Targets 🚀🎯: Curious about the specifics? Check out the May 2022 post for all the details:https://t.co/CGLMB7CgGi Target 1: 0.85 &#8211; 1$ (Completed) Target 2: $ 5.5 (Might be achieved in two weeks) Target 3: $ 6.4 (Fib 1.618 will be extended wick)#XRPArmy STAY STEAD and… pic.twitter.com/vTYMwxFbA1 — EGRAG CRYPTO (@egragcrypto) December 14, 2023 How Feasible Is This Price Prediction? XRP has since fallen below the analyst&#8217;s first target of $0.85. At the time of writing, XRP is trading at $0.62, down by 9.59% in a 7-day timeframe. EGRAG argued that the recent price correction could make investors jump ship, but HOLDing is still the best decision at this moment. Related Reading: Why BONK Keeps On Rising, Price Explodes 124% Today – Here’s The Scoop A surge to $5.5 would mean an 800% price gain from the current level before the end of the year. However, current fundamentals points to an increase of this magnitude in such a short timeframe being very unlikely . EGRAG clarified in a comment that the prediction wasn&#8217;t based on the next two weeks. Instead the rally to $5.5 would be completed in just a two week timeframe.   Not within the next 2 weeks but in 2 weeks duration all this move will be completed. 👍 — EGRAG CRYPTO (@egragcrypto) December 14, 2023 Featured image from Shutterstock"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-16T11:56:00.000Z",
    "title": "BNB Chain Moves to Liquidate 100% USDT, USDC of BNB Bridge Exploiter",
    "url": "https://coinedition.com/bnb-chain-moves-to-liquidate-100-usdt-usdc-of-bnb-bridge-exploiter/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Planning_to_go_long_on_BNB_Chain_BNB_Read_this_to_get_a_grip_on.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Planning_to_go_long_on_BNB_Chain_BNB_Read_this_to_get_a_grip_on\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Planning_to_go_long_on_BNB_Chain_BNB_Read_this_to_get_a_grip_on.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Planning_to_go_long_on_BNB_Chain_BNB_Read_this_to_get_a_grip_on-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Planning_to_go_long_on_BNB_Chain_BNB_Read_this_to_get_a_grip_on-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/Planning_to_go_long_on_BNB_Chain_BNB_Read_this_to_get_a_grip_on-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Planning_to_go_long_on_BNB_Chain_BNB_Read_this_to_get_a_grip_on-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Planning_to_go_long_on_BNB_Chain_BNB_Read_this_to_get_a_grip_on-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>After more than a year of the attack, BNB Chain Core has officially proposed a comprehensive plan to seize the collateral of the BNB Bridge exploiter and utilize the funds to repay outstanding debts without resorting to market liquidation of BNB.&#160; The proposal outlined a detailed execution strategy to mitigate potential losses for the Venus [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bnb-chain-moves-to-liquidate-100-usdt-usdc-of-bnb-bridge-exploiter/\">BNB Chain Moves to Liquidate 100% USDT, USDC of BNB Bridge Exploiter</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]