[
  {
    "source": "CoinDesk",
    "date": "2023-11-01T14:53:15.000Z",
    "title": "Near Token Rallies Amid Nym Partnership, Ahead of Nearcon Conference",
    "url": "https://www.coindesk.com/markets/2023/11/01/near-token-rallies-amid-nym-partnership-ahead-of-nearcon-conference/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Near Foundation announced a partnership with Nym Technologies, a privacy layer-0 infrastructure startup."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-01T15:04:54.000Z",
    "title": "Reddit's Hottest Crypto Picks: Are These the Next Big Winners? Shiba Inu (SHIB), Everlodge (ELDG), Toncoin (TON)",
    "url": "https://cryptodaily.co.uk/2023/11/reddits-hottest-crypto-picks-are-these-the-next-big-winners-shiba-inu-shib-everlodge-eldg-toncoin-ton",
    "description": "The Reddit community has become a hub for passionate cryptocurrency investors, traders, and enthusiasts."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-01T14:51:16.000Z",
    "title": "Will Ethereum (ETH) and Algorand (ALGO) Thrive or Take a Dive In the November Limelight?",
    "url": "https://cryptodaily.co.uk/2023/11/will-ethereum-eth-and-algorand-algo-thrive-or-take-a-dive-in-the-november-limelight",
    "description": "Delve into the realm of digital currencies with Ethereum (ETH) and Algorand (ALGO) taking center stage for the month of November. Gain valuable perspectives on their market behavior, technical evaluations, and possible prospects in the ever-evolving cryptocurrency arena. Stay updated and make informed choices as you explore the intricacies of these notable digital assets."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-01T15:00:54.000Z",
    "title": "Bitcoin Whales Ramp Up Selling, BTC To Decline Below $32,000?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-whales-ramp-selling-btc-decline-32000/",
    "description": "On-chain data shows the Bitcoin whales have potentially ramped up their selling recently, something that could lead to a drawdown for the asset. Bitcoin Exchange Whale Ratio Has Spiked Recently As explained by an analyst in a CryptoQuant Quicktake post, the price of Bitcoin could correct towards the $31,000 to $32,000 range from the current whale selling pressure. The relevant indicator here is the &#8220;exchange whale ratio,&#8221; which measures the ratio between the sum of the top 10 transfers to exchanges and the total exchange inflow. The 10 largest transactions going towards these platforms generally come from the whales, so this ratio can tell us about how the inflow activity of the whales currently compares against the rest of the market. Related Reading: Can PEPE Build On Its 60% Rise? Here’s What On-Chain Data Says These humongous investors may transfer their coins to these central entities for a variety of purposes, one of which could be for selling. Thus, whenever the whales occupy a large part of the total exchange inflows, it&#8217;s a potential sign that the selling pressure being mounted by this cohort is rising. Historically, the indicator crossing the 0.90 mark has particularly been bearish for the cryptocurrency. At this level, 90% of the total inflows are coming from the wallets of the whales. Now, here is a chart that shows the trend in the 72-hour moving average (MA) Bitcoin exchange whale ratio over the past few months: The 72-hour MA value of the metric seems to have gone up in recent days &#124; Source: CryptoQuant In the above graph, the quant has marked the 0.90 level in red and has highlighted the points in the Bitcoin price corresponding to the instances where the 72-hour MA exchange whale ratio crossed this line. The analyst notes that in all of these occurrences, the cryptocurrency first registered some volatility and then observed a decline in the short term, leading toward a local bottom formation. Given the close timings, it would appear possible that the higher inflows from the whales during these instances were at least partially made for selling purposes. From the chart, it&#8217;s visible that the indicator has once again risen above the 0.90 level recently, suggesting that the whales have considerably ramped up their inflows. Related Reading: Ethereum Bearish Signal: MVRV Has Entered The “Danger” Zone Naturally, these high values of the metrics don&#8217;t necessarily have to be bearish for the asset, as it&#8217;s possible that this cohort is simply opening up positions on the derivatives market this time (and to some extent, it has to be true in either case, as the futures open interest has seen an increase in the last few days). Given the pattern that has followed in the last few instances, though, the quant says, &#8220;I expect increased volatility in Bitcoin and anticipate a new local bottom with a drop to the 31,000 to 32,000 dollar range, which previously acted as resistance.&#8221; BTC Price Bitcoin hasn&#8217;t been able to find any direction in the last few days as the coin has been consolidating above $34,000. If the exchange whale ratio is anything to go by, though, things might change soon for the asset. Looks like BTC has continued to move sideways recently &#124; Source: BTCUSD on TradingView Featured image from Rémi Boudousquié on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-01T15:05:01.000Z",
    "title": "Flare Network Hits Partnership Deal with Asset Management Protocol Elliptic",
    "url": "https://www.crypto-news-flash.com/flare-network-hits-partnership-deal-with-asset-management-protocol-elliptic/?utm_source=rss&utm_medium=rss&utm_campaign=flare-network-hits-partnership-deal-with-asset-management-protocol-elliptic",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/FLARE.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/FLARE.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/FLARE-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Flare Network has partnered with Elliptic to enhance its ecosystem’s risk management. This collaboration marks one of the many Flare has inked recently to expand its ecosystem. Top Layer-1 blockchain Flare Network has inked a strategic partnership with Elliptic, a crypto asset risk management firm.  According to a press release shared with Crypto News Flash, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-01T15:07:00.000Z",
    "title": "SOL’s Uptober Rise to Continue Into Moonvember as Sentiment Shifts",
    "url": "https://coinedition.com/sols-uptober-rise-to-continue-into-moonvember-as-sentiment-shifts/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Solana-Price-Analysis-5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SOL’s Uptober Rise to Continue Into Moonvember as Sentiment Shifts\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Solana-Price-Analysis-5.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Solana-Price-Analysis-5-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Solana-Price-Analysis-5-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Solana-Price-Analysis-5-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Solana-Price-Analysis-5-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Santiment, the blockchain intelligence platform, predicted in an X post published earlier today that sentiment around Solana (SOL) is transitioning from bearish to bullish. According to the post, nearly 2% of all discussions relating to the top 100 cryptocurrency assets are related to SOL. Santiment attributed the growth in SOL’s social activity to its meteoric [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sols-uptober-rise-to-continue-into-moonvember-as-sentiment-shifts/\">SOL’s Uptober Rise to Continue Into Moonvember as Sentiment Shifts</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]