[
  {
    "source": "Decrypt",
    "date": "2023-08-15T16:01:02.000Z",
    "title": "Helium Mobile Debuts Crypto Wireless Network in Miami—For $5 a Month",
    "url": "https://decrypt.co/152533/helium-mobile-debuts-crypto-wireless-network-miami-5-month",
    "description": "Powered by the Helium network, the hybrid mobile carrier takes its first public steps with a cheap unlimited plan and crypto token rewards."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-15T16:00:00.000Z",
    "title": "11 potential impacts on crypto and the market from the rise of CBDCs",
    "url": "https://cointelegraph.com/innovation-circle/11-potential-impacts-on-crypto-and-the-market-from-the-rise-of-cbdcs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/4dc9818a-34df-4255-8cf0-54fb35ad9cdb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The ultimate impacts of CBDCs on the crypto industry may be a mixed bag of positives and negatives, and insiders need to monitor developments.</p>\n                    <p><p>In June 2023, the Atlantic Council, based in the United States, announced the<a href=\"https://www.reuters.com/markets/currencies/study-shows-130-countries-exploring-central-bank-digital-currencies-2023-06-28/\"> results</a> of a study on global nations’ interest in and progress toward creating their own central bank digital currencies. Eleven countries have already launched CBDCs; 130 others are in the exploratory phase, and about half of those have begun the development process. </p> <p>Market watchers cite multiple factors behind governments’ push toward CBDCs, from the decreasing use of cash by the general population to geopolitical tensions and events. Whatever the underlying reasons, though, crypto industry players need to keep an eye on developments and consider how the rise of CBDCs could impact the industry and global marketplace. Here, 11 members of <a href=\"https://circle.cointelegraph.com/?_ga=2.198681135.1484442309.1667485998-1927108766.1652715111\">Cointelegraph Innovation Circle</a> share their predictions for possible outcomes from the ever-expanding development and introduction of CBDCs.</p> <h2>A boost in the uptake of cryptocurrencies</h2> <p>CBDCs manifest the “if we can’t beat them, join them” attitude of governments in response to blockchain technology. In the short to medium term, CBDCs could help legitimize crypto but struggle to compete in utility and benefits, likely leading to a boost in the uptake of cryptocurrencies. In the long term, governments may attempt to stealthily “phase out” crypto as CBDCs mature and gain relevancy. –<a href=\"https://circle.cointelegraph.com/u/bcb46b42-12ad-4937-8069-b741c596ef3c\"> Sheraz Ahmed</a>,<a href=\"http://storm.partners/\"> STORM Partners</a></p> <h2>Deepened importance of decentralization</h2> <p>CBDCs are still largely unknown territory. The risks to personal freedoms are real. A potential crypto industry impact is the deepened importance of decentralization, privacy and other forms of the human rights of freedom and self-determination. –<a href=\"https://circle.cointelegraph.com/u/16cde551-5395-4ca9-8281-7152cbb88396\"> Tiago Serôdio</a>,<a href=\"https://www.partisiablockchain.com/\"> Partisia Blockchain</a></p> <h2>Tighter regulations</h2> <p>The rise of CBDCs may validate blockchain technology and cryptocurrencies, boosting public familiarity with and acceptance of digital assets. However, this could also bring tighter regulations, impacting existing crypto market dynamics. It’s a delicate balance between validation and regulation. –<a href=\"https://circle.cointelegraph.com/u/0d167285-44f8-41a6-9001-72aab6b4058d\"> Tomer Warschauer Nuni</a>,<a href=\"http://www.kryptomon.co\"> Kryptomon</a></p> <h2>Recognition of stablecoins as CBDCs</h2> <p>CBDCs are an almost inevitable game theory of governments trying to copy or provide an alternative to decentralized money, but with government trust anchoring the confidence. With USDC and USDT being backed by bonds now through BlackRock, I would say that the USD-based stablecoins that are prevalent are already a form of CBDC, since governments can monetize and mint digital USD through debt. –<a href=\"https://circle.cointelegraph.com/u/b559ba2c-4526-4824-a90d-52601574a7ef\"> Jagdeep Sidhu</a>,<a href=\"https://syscoin.org/\"> Syscoin Foundation</a></p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://hubs.ly/Q0152XyT0\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <h2>Cryptocurrencies being viewed as competition</h2> <p>The rise of CBDCs could have both positive and negative impacts on the crypto industry. One con could be that governments might perceive CBDCs as competition to private cryptocurrencies. However, on the other hand, CBDC adoption plays well for the larger narrative of the adoption of blockchain technology and cryptocurrencies. –<a href=\"https://circle.cointelegraph.com/u/1d9f8b61-2e77-4452-a837-4db4245d01ca\"> Abhishek Singh</a>,<a href=\"http://acknoledger.com/\"> Acknoledger</a></p> <h2>A bridged gap between Web2 and Web3</h2> <p>CBDCs could help bridge the gap between Web2 and Web3. If they are allowed to coexist with crypto, CBDCs can actually reduce friction between the traditional finance and decentralized finance worlds. For example, these new payment systems could serve as an on- and/or off-ramp for people trying to convert fiat into crypto. So instead of killing crypto, CBDCs could actually help Web3 become more accessible than ever. –<a href=\"https://circle.cointelegraph.com/u/abc0e9e1-b580-49da-b9fb-105caa752b79\"> Wolfgang Rückerl</a>,<a href=\"https://entity.global\"> ENT Technologies AG</a></p> <h2>New curiosity about other crypto offerings</h2> <p>While there’s much anxiety about the development and rollout of CBDCs, industry leaders should embrace their inclusion as a new avenue for entering the DeFi space. The normalization of crypto by governments could inspire otherwise reluctant participants to develop curiosity about other offerings available throughout the space. Then, the true test for CBDCs can become how they survive the free market. –<a href=\"https://circle.cointelegraph.com/u/83c71aad-8be6-470a-aaf9-7f146821217c\"> Oleksandr Lutskevych</a>,<a href=\"http://cex.io\"> CEX.IO</a></p> <h2>A more diverse product landscape</h2> <p>CBDCs are a double-edged sword, because while they drive the adoption of digital currencies, they do so at the expense of sacrificing a core value proposition of cryptocurrency: decentralization. It is unrealistic to assume CBDCs will not emerge, since many on-chain products are needed to ultimately build out a diverse landscape of products that can serve all levels of consumers. –<a href=\"https://circle.cointelegraph.com/u/84007b98-8c0e-4c02-8807-ff7876b7765d\"> Megan Nyvold</a>,<a href=\"http://bingx.com/en-us/\"> BingX</a></p> <h2>More access to financial services for the unbanked</h2> <p>Increased financial inclusion and credit access for the unbanked population is one valuable utility of CBDCs, since non-bank payment system providers can distribute CBDCs, eliminating the need for a traditional bank account. The rise of CBDCs would allow individuals without bank accounts to build credit and access lower-interest-rate loans if CBDC data is shareable with banks. –<a href=\"https://circle.cointelegraph.com/u/a27b7ccb-dfb8-468f-83ae-4aac596f0a40\"> Vinita Rathi</a>,<a href=\"https://www.systango.com\"> Systango</a></p> <h2>Heightened focus on existing cryptocurrencies</h2> <p>CBDCs will lead to a heightened regulatory focus on the crypto industry. As central banks begin to explore CBDCs, they will also be conducting research and risk assessments on the existing crypto ecosystem, which could lead to policy changes. Experts debate CBDCs’ impact on anonymity and decentralization while acknowledging their role in mainstream adoption and familiarity with digital currencies. –<a href=\"https://circle.cointelegraph.com/u/5cae7f29-8588-4852-bb31-c66fd1d805c6\"> Anthony Georgiades</a>,<a href=\"https://pastel.network/\"> Pastel Network</a></p> <h2>Nothing of significance</h2> <p>I see no material effect; it’s net-neutral, in my opinion. Although CBDCs further legitimize blockchain technology, to a degree, that is offset by the fact that the CBDCs will run on private blockchains (such as Hyperledger), where there is no need for a token. On the fringe, maybe it pushes a few skeptics over the edge in terms of validating the space. –<a href=\"https://circle.cointelegraph.com/u/313a59f1-efb9-465c-aee3-750eaa69f776\"> Timothy Enneking</a>,<a href=\"http://www.digital-capital-management.com/\"> Digital Capital Management</a></p> <hr class=\"wp-block-separator\" /> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://hubs.ly/Q0152XyT0\"><em><strong><u>Learn more about Cointelegraph Innovation Circle and see if you qualify to join.</u></strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-15T15:45:00.000Z",
    "title": "BTC price can reach $34K as Bitcoin faces support 'kiss' — QCP Capital",
    "url": "https://cointelegraph.com/news/btc-price-34k-reach-bitcoin-support-analysis",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/dd32ba62-9ca3-4a69-af3d-db334ae6aefa.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin lacks major volatility catalysts, but a classic support bounce could spark the return of the highest BTC prices in over a year, analysis predicts.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) may be weeks from a “sharo rally” toward $34,000, trading platform QCP Capital believes.</p><p>In its <a href=\"https://qcp.capital/featured-article/market-update-15-aug-23/\" target=\"_blank\" rel=\"noopener nofollow\">latest market update</a> released on Aug. 15, analysts said that the coming weeks include a key decision point for BTC price action.</p><h2>BTC price due September \"termination point\"</h2><p>With Bitcoin still rangebound after months of indecisive behavior, market observers are keen to <a href=\"https://cointelegraph.com/news/btc-price-breakout-august-things-bitcoin-this-week\">predict the return</a> of some sort of market trend.</p><p>For QCP Capital, September is the key month in the calendar, thanks to BTC/USD completing a rising wedge construction which began during the end of the 2022 bear market.</p><p>“On the charts, the wedge pattern that BTC has been trading in since its 15k lows reaches its first termination point at the start of Sep,” part of the update explained.</p><p>QCP noted that the specific area of interest was $29,300 — exactly the current focal point for the Bitcoin spot price.</p><p>“Will there be a sharp rally that takes us to the 34k resistance — like the prior three times which kissed the support trendline this year?” it continued about the rising wedge. </p><blockquote>“We think it could still be another quiet few weeks before we find out. We are on the lookout to buy back our end-Sep short calls and go long end-Dec vol in due time.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/141d34c1-c10e-4161-a4bf-f54e8ed5f627.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: QCP Capital</em></figcaption></figure><p>QCP’s perspective chimes with various more optimistic takes on BTC price strength for the short term, including one which gives October as the deadline for the <a href=\"https://cointelegraph.com/news/bitcoin-price-bull-next-month-200-week-trendline\">return of the 2023 Bitcoin bull market</a>.</p><p>As Cointelegraph <a href=\"https://cointelegraph.com/news/bitcoin-price-prediction-october-100k-2026-analysis\">reported</a>, however, market expectations are fragmented on the topic, with others warning that new lows may yet enter before a broad recovery ensues.</p><h2>No macro BTC price catalyst in sight</h2><p>Addressing macroeconomic trends, QCP meanwhile argued that significant change was still to appear, echoing the status quo in crypto.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/btc-price-prediction-100k-2024-bitcoin-halving\">BTC price won’t hit $100K before 2024 halving — Bitcoin investment exec</a></em></strong></p><p>“The last time trading was this compressed, it was during the crypto winter of 2018 and 2019, and it took a change in the macro environment to revive the market again,” it wrote.</p><p>Bitcoin's volatility is challenging historic lows, as shown by Bitcoin Historical Volatility Index (BVOL) data from <a href=\"https://www.tradingview.com/chart/Aiej0hLA/?symbol=BITMEX%3ABVOL\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/fc10a388-53f6-468a-9c91-bdd1a376ac4a.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Historical Volatility Index (BVOL) chart. Source: TradingView</em></figcaption></figure><p>“While that game changing shift in the macro environment is not yet in sight, there are a few short term catalysts coming up on the crypto calendar late next month, including Mt Gox, GBTC, a possible SEC verdict on Blackrock/Fidelity’s applications, and some potential centralized crypto exchange and stablecoin news,\" QCP continued.</p><p>Among other things, analysts referenced the September deadline for commentary on the initial Bitcoin spot price exchange-traded fund (ETF) applications — widely considered to be a turning point for the industry.</p><p>Europe’s first Bitcoin spot ETF <a href=\"https://cointelegraph.com/news/europe-first-bitcoin-etf-hits-euronext-amsterdam-exchange\">began trading on Aug. 15</a>, custodied by Fidelity Investments.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\">Deposit risk: What do crypto exchanges really do with your money?</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-15T16:00:27.000Z",
    "title": "Long-term Bitcoin holders cash in with profits nearing $100M",
    "url": "https://cryptoslate.com/insights/long-term-bitcoin-holders-cash-in-with-profits-nearing-100-million/",
    "description": "<p>Quick Take A notable trend of profit-taking has been observed among long-term Bitcoin holders, particularly those who have retained their Bitcoins for a period exceeding 155 days. These individuals have recently taken profits nearing the $100 million mark, a significant volume not observed since the peak earlier this year in April. The phenomenon of profit-taking [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/long-term-bitcoin-holders-cash-in-with-profits-nearing-100-million/\">Long-term Bitcoin holders cash in with profits nearing $100M</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-15T15:53:55.000Z",
    "title": "Arbitrum One Gets Upgrade with AllianceBlock Launch on Nexera Exchange",
    "url": "https://cryptobriefing.com/allianceblock-launch-on-nexera-exchange/?utm_source=feed&utm_medium=rss",
    "description": "AllianceBlock debuts Nexera Exchange with on-chain order book protocol on Arbitrum One to deepen liquidity."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-15T15:58:00.000Z",
    "title": "Coinbase Enters Canada: Unlocking New Crypto Frontier",
    "url": "https://cryptodaily.co.uk/2023/08/coinbase-enters-canada-unlocking-new-crypto-frontier",
    "description": "<p>Coinbase has announced its official entry into the Canadian market in a strategic move that involved the integration of Interac payment rails.&nbsp;</p>\nExpanding Horizons: Canada as a Crypto Hub\n<p>On Monday, Coinbase executives Nana Murugesan and newly-appointed Lucas Matheson penned a joint announcement declaring Coinbase's decision to venture into Canada's crypto landscape.&nbsp;</p>\n<p>The statement also addressed the various factors why Canada was chosen as the next Coinbase outpost, calling it the world's third-most crypto-aware nation, with a thriving local tech ecosystem that firmly positions it as a potential global leader in the crypto-economy. The duo pulled up the Ontario Securities Commission's survey highlights, which revealed that over 30% of Canadians are gearing up to explore crypto assets within the year.</p>\nPioneering Innovations for Canadians\n<p>According to the statement, Coinbase will be presenting a slew of innovative offerings to cater to the Canadian market. The integration of Interac payment rails takes center stage as it would enable Canadian users to effortlessly deposit and withdraw funds (CAD) to and from their Coinbase wallets in an attempt to make the crypto experience more accessible to Canadians.</p>\n<p>They also revealed the launch of Coinbase One, which is being touted to feature benefits like a 30-day trial period, zero trading fees, enhanced staking rewards, and priority support.&nbsp;</p>\nCoinbase Appoints New Canada Director\n<p>In March 2023, Coinbase appointed Lucas Matheson as the Country Director for Canada. Matheson, who has experience leading operation and financial teams, will be focusing on Coinbase&rsquo;s offerings for Canadians by working with partners, government, and regulators.&nbsp;</p>\n<p>On the regulatory front, the company has also signed an Enhanced Pre-Registration Undertaking in order to highlight its dedication to regulatory compliance.&nbsp;</p>\n<p>The firm has almost 200 full-time employees at the Canadian tech hub, thus making the most of local talent and fostering a user-centric platform tailored to Canadian citizens.&nbsp;&nbsp;</p>\nOther Crypto Firms In Canada\n<p>Other leading crypto firms have also turned to Canada, especially in the wake of growing regulatory uncertainty in the United States. Crypto exchange Kraken has demonstrated its commitment to Canada's financial sector by signing a pre-registration undertaking (PRU) with the Ontario Securities Commission.&nbsp;</p>\n<p>However, a few of them, like Binance and ByBit, have had to wrap up their Canada operations, citing an unfavorable regulatory climate in the country.&nbsp;</p>\n<p>In summary, Coinbase's official launch in Canada, backed by Interac payment integration, Coinbase One, and a strong commitment to local engagement, ushers in a new chapter in Canada's crypto journey. This move is a testament to Coinbase's unwavering dedication to fostering financial empowerment through innovative crypto solutions.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-15T16:00:24.000Z",
    "title": "Biggest Movers: SOL, TON Move to Multi-Week Highs on Tuesday",
    "url": "https://news.bitcoin.com/biggest-movers-sol-ton-move-to-multi-week-highs-on-tuesday/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2143719983-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: SOL, TON Move to Multi-Week Highs on Tuesday\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2143719983-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2143719983-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2143719983-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2143719983-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2143719983-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2143719983-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2143719983.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Solana was one of Tuesday’s big gainers, rising to a multi-week high following a ‘death cross’ of moving averages. The move came despite the global market cap falling marginally lower as of the time of writing. Toncoin was another notable mover, rising for a sixth-straight day. Solana (SOL) Solana (SOL) surged higher on Tuesday, as [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T15:49:29.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T15:47:02.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T15:42:30.000Z",
    "title": "PwC Empowers Workforce with Innovative Private Generative AI Tool",
    "url": "https://www.cryptopolitan.com/pwc-empower-innovative-private-generative-ai/",
    "description": "In a bid to elevate its AI capabilities and drive innovation, PricewaterhouseCoopers (PwC), the global professional services firm, has unveiled its latest technological venture: ChatPwC. This groundbreaking conversational generative AI tool, developed with the power of OpenAI&#8217;s technology and fine-tuned with specialized data, marks a pivotal step in PwC&#8217;s journey towards embracing artificial intelligence to ... <a title=\"PwC Empowers Workforce with Innovative Private Generative AI Tool\" class=\"read-more\" href=\"https://www.cryptopolitan.com/pwc-empower-innovative-private-generative-ai/\" aria-label=\"More on PwC Empowers Workforce with Innovative Private Generative AI Tool\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-15T16:00:45.000Z",
    "title": "DeFiance Capital Gains Upper Hand In Jurisdiction Battle Against 3AC: Singapore Courts To Preside",
    "url": "https://www.newsbtc.com/crypto/defiance-capital-gains-upper-hand-jurisdiction-against-3ac/",
    "description": "The crypto finance world has witnessed numerous disputes, but few have been similar to that of the ongoing feud between DeFiance Capital and Three Arrows Capital Limited (3AC). Particularly, this dispute underscores the intricate interplay between traditional financial frameworks and the evolving dynamics of digital assets. In a tweet posted earlier today, DeFiance Capital CEO shed new light on their ongoing legal tussle with 3AC, suggesting a turn in the tide. Statement and Update on Dispute with Three Arrows Capital Limited (3AC) We are very pleased to share a positive development on our end with the public. It is well-known that for the past year, we have been locked in a dispute with the 3AC estate who are claiming that the assets… — Arthur (@Arthur_0x) August 15, 2023 DeFiance Capital: A Year-long Struggle Almost a year ago, the disagreement between DeFiance Capital and the 3AC estate took center stage when the estate contended that the assets held by DeFiance Capital should be used to square off the debts of 3AC. Related Reading: 3AC NFTs Sale To Commence Soon Due to Liquidation Countering this claim, DeFiance maintained that they had complete authority and rightful ownership of their assets. This stance, they assert, aligns with common industry perceptions and is supported by available evidence. The debate took a geographical turn when the liquidators insisted on settling the dispute in the British Virgin Islands (BVI). DeFiance Capital, which was managed from Singapore alongside 3AC, found this choice of jurisdiction puzzling. They argued that the primary evidence and witnesses were based in Singapore, making it a more apt location for the hearing. Their persistence bore fruit last week when the High Court of Singapore agreed to their jurisdiction preference, subtly undermining the liquidators&#8217; earlier narrative that DeFiance&#8217;s stance held no ground. The Road Ahead: Seeking Effective Resolutions Despite these disagreements, DeFiance has shown a willingness to collaborate. They have extended assistance to 3AC&#8217;s liquidators in understanding the position of DeFiance and even offered help in identifying 3AC&#8217;s assets. The intention, as expressed by the CEO &#38; CIO of DeFiance, was to minimize the resources spent on deciding the hearing location and instead concentrate on the core issues at hand. However, the journey hasn&#8217;t been without its hitches. The liquidators faced setbacks in the US while trying to hold Three Arrows Capital Co-Founder  Kyle Davies accountable in a US court. This effort was thwarted when it came to light that Davies was no longer a US citizen, an information oversight that resulted in unnecessary legal expenses. Blossom Hing, representing DeFiance, highlighted the significance of the recent jurisdiction decision. Emphasizing that the Singapore International Commercial Court could address issues pertaining to BVI law, she expressed optimism about an efficient resolution that benefits all parties. Related Reading: Crypto Hedge Fund 3 Arrows Capital (3AC) Files For Bankruptcy Hing noted: We welcome the decision by the Singapore Court as it will ensure that important evidence located in Singapore would be available for the purposes of resolving the dispute in a just and efficient manner. Coupled with the fact that the Singapore International Commercial Court can hear arguments on and decide on BVI law issues, we believe that having the dispute heard in Singapore will result in considerable savings of costs and time for all parties. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-15T16:06:19.000Z",
    "title": "Toncoin Surges 21% in Unexpected Breakthrough: Can Bulls Maintain Momentum?",
    "url": "https://www.crypto-news-flash.com/toncoin-surges-21-in-unexpected-breakthrough-can-bulls-maintain-momentum/?utm_source=rss&utm_medium=rss&utm_campaign=toncoin-surges-21-in-unexpected-breakthrough-can-bulls-maintain-momentum",
    "description": "<img width=\"1429\" height=\"952\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/price.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/price.jpg 1429w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/price-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/price-1024x682.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/price-104x69.jpg 104w\" sizes=\"(max-width: 1429px) 100vw, 1429px\" />Toncoin (TON) breaks consolidation yet can&#8217;t breach the $1.50 barrier. Bears persist, and cautious sentiment lingers.  Uptick in trading volume, a 60.0% rise, aligns with circulating supply.  Toncoin (TON) recently achieved a notable breakthrough, breaking out of its month-long consolidation and offering traders a promising outlook. The cryptocurrency, previously locked within the $1.31 to $1.49 [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-15T16:00:03.000Z",
    "title": "With Ripple (XRP) Garnering Huge Inflows, DigiToads (TOADS) Is Poised for A 100% Surge",
    "url": "https://www.crypto-news-flash.com/with-ripple-xrp-garnering-huge-inflows-digitoads-toads-is-poised-for-a-100-surge/?utm_source=rss&utm_medium=rss&utm_campaign=with-ripple-xrp-garnering-huge-inflows-digitoads-toads-is-poised-for-a-100-surge",
    "description": "<img width=\"512\" height=\"365\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-34.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-34.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-34-300x214.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-34-269x192.jpg 269w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the dynamic landscape of cryptocurrency, promising tokens continue to capture the attention of investors seeking substantial gains. One such token that has been making waves is DigiToads (TOADS). As the token heads towards its official launch, its remarkable performance is drawing attention, with indications pointing towards an encouraging culmination. Surpassing the $6.9 million milestone, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-15T16:01:00.000Z",
    "title": "Several Alts May Get Squeezed This Week, Predicts Analyst",
    "url": "https://coinedition.com/several-alts-may-get-squeezed-this-week-predicts-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Several Alts May Get Squeezed This Week, Predicts Analyst\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Weekly-Token-Narrative-Watchlist-🔎-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Miles Deutscher, a prominent cryptocurrency analyst, took to Twitter yesterday to share his thoughts on various cryptocurrencies. In the post, he shed light on current trends, potential price squeezes, and areas of opportunity within the market to watch out for in the following week. One of the central topics of Deutscher&#8217;s tweet is the impending [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/several-alts-may-get-squeezed-this-week-predicts-analyst/\">Several Alts May Get Squeezed This Week, Predicts Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]