[
  {
    "source": "CryptoSlate",
    "date": "2023-10-06T23:00:56.000Z",
    "title": "Yuga Labs cuts staff as part of larger restructuring",
    "url": "https://cryptoslate.com/yuga-labs-cuts-staff-amidst-restructuring/",
    "description": "<p>Yuga Labs, the company behind Bored Ape Yacht Club, has laid off a portion of its staff according to a blog post published by the firm on Oct. 6. The company&#8217;s CEO, Daniel Alegre, wrote: &#8220;After &#8230; thoughtful consideration, I have decided that we need to restructure the Yuga Labs teams. The implication of these [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/yuga-labs-cuts-staff-amidst-restructuring/\">Yuga Labs cuts staff as part of larger restructuring</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-06T23:00:55.000Z",
    "title": "Solana Enhances Privacy Offerings As SOL’s Uptrend Persists With 4% Gains",
    "url": "https://www.newsbtc.com/news/solana/solana-enhances-privacy-offerings-as-sols-uptrend-persists-with-4-gains/",
    "description": "Solana (SOL), a layer 1 proof-of-stake blockchain, has introduced version 1.16, which enhances user privacy through &#8220;Confidential Transfers.&#8221; This update includes encrypted Solana Program Library (SPL) token transactions, ensuring confidentiality rather than anonymity.  The adoption of version 1.16 by Solana&#8217;s network of validators has reached a majority after ten months of development and an audit by Halborn, a blockchain security firm. Solana Labs Rolls Out Privacy-Enhancing Update According to the announcement made by Solana’s infrastructure provider Helius, The update has undergone rigorous testing, with v1.16 running on testnet since June 7, 2023.  Volunteer and canary nodes have reportedly played a crucial role in identifying and resolving issues during the testing phase. Solana Labs has also deployed canary nodes on mainnet-beta to monitor the stability of v1.16 under real-world conditions. Related Reading: Chainlink To Go “Parabolic” After Breaking 28-Month Downtrend? Solana employs a feature gate system to prevent consensus-breaking changes, ensuring that validators running older versions do not fork off the canonical chain.  What’s more, Consensus-breaking changes now require a Solana Improvement Document (SIMD) and greater transparency through documentation. Confidential Transfers, introduced by Token2022, utilize zero-knowledge proofs to encrypt balances and transaction amounts of  SPL tokens, prioritizing user privacy.  Looking ahead, Solana Labs plans to adopt a more agile release cycle, targeting smaller releases approximately every three months.  Room For Growth According to a Nansen report, Solana has witnessed a significant surge in its Total Value Locked (TVL) throughout this year, nearly doubling since the beginning of 2023, and currently boasting a TVL of 30.95 million SOL.  Monthly transactions on the Solana network have remained relatively stable, with an increase in vote transactions, encompassing both vote and non-vote transactions. Furthermore, Nansen highlights that Solana has implemented innovative solutions such as state compression and isolated fee markets to address prominent issues within its tech stack. One notable solution, state compression, has substantially reduced the cost of non-fungible token (NFT) minting on Solana more than 2,000 times.   State Compression Unleashes Affordable NFT Minting For instance, the cost of minting 1 million NFTs before the introduction of state compression would have amounted to approximately $253,000. In contrast, with state compression enabled, the cost is significantly reduced to just $113.  In comparison, minting a similar collection size on Ethereum would cost approximately $33.6 million, and on Polygon, it would amount to around $32,800. Furthermore, the liquid staking landscape on Solana is experiencing rapid growth, with leading platforms like Marinade Finance, Lido Finance, and Jito taking the forefront.  Related Reading: Ripple Vs. SEC: Crypto CEO Predicts SEC Will Drop Charges Against Executives However, despite this growth, the current amount of staked SOL in Solana&#8217;s liquid staking protocols accounts for less than 3% of the total staked SOL, indicating substantial room for expansion. It is worth noting that the report by Nansen raises concerns about the uncertainty surrounding FTX/Alameda&#8217;s SOL holdings, as FTX holds over 71.8 million SOL, representing approximately 17% of the circulating supply and 13% of the total supply.  While this situation may present temporary risks to Solana&#8217;s growth trajectory, it is essential to monitor its impact closely. On the other hand, the native token of the protocol, SOL, continues to exhibit substantial gains across all timeframes. The token is trading at $23.68, reflecting an increase of over 4% in the past 24 hours. Featured image from Shutterstock, chart from TradingView.com "
  }
]