[
  {
    "source": "Bitcoin.com",
    "date": "2023-05-28T06:00:12.000Z",
    "title": "Makerdao Considers Significant DAI Savings Rate Hike: 3.3% on the Horizon, If Vote Passes",
    "url": "https://news.bitcoin.com/makerdao-considers-significant-dai-savings-rate-hike-3-3-on-the-horizon-if-vote-passes/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/daiiii-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Makerdao Considers Significant DAI Savings Rate Hike: 3.3% on the Horizon, If Vote Passes\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/daiiii-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/daiiii-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/daiiii-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/daiiii-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/daiiii-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/daiiii-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/daiiii.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Makerdao collective is currently immersed in a discussion about the potential rise of the DAI stablecoin&#x2019;s savings rate to 3.3%. This suggestion was introduced by Block Analitica and revealed to the community on May 26 under the title &#x201C;Stability Scope Parameter Changes #2.&#x201D; Block Analitica Proposes Raising DSR to 3.3% Risk and intelligence firm [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-28T06:07:41.000Z",
    "title": "Sui price analysis: Riding a wave of bullish momentum, the SUI price recovers to $1.010",
    "url": "https://www.cryptopolitan.com/sui-price-analysis-2023-05-28/",
    "description": "According to the most recent Sui price analysis, the market has displayed a bullish trend with signs of recovery over the past 24 hours. Despite a gradual price oscillation, the bulls have successfully gained dominance on the price chart by elevating the coin&#8217;s value. This positive development indicates a promising outlook for the bulls, as ... <a title=\"Sui price analysis: Riding a wave of bullish momentum, the SUI price recovers to $1.010\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-analysis-2023-05-28/\" aria-label=\"More on Sui price analysis: Riding a wave of bullish momentum, the SUI price recovers to $1.010\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-28T05:59:59.000Z",
    "title": "Aptos Hackathon, Partnerships Set APT Bulls Up For A Strong Run",
    "url": "https://www.newsbtc.com/aptos-apt/aptos-hackathon-partnerships-set-apt-bulls-up-for-a-strong-run/",
    "description": "At the time of writing, there are indications of a potential market recovery, at least the major coins like Bitcoin and Ethereum are posting decent gains. Aptos (APT) is one of the tokens that is expected to experience an increase in bullishness and price. Although APT’s gains are minuscule at 1.7% in the last 24 hours, the project&#8217;s partnerships and on-chain developments point to a somewhat rosy picture. APT price rose to $8.30 at the time of writing, contributing highly to this bullish momentum. Source: Coingecko Related Reading: Shiba Inu All Green Today – What’s The Energy Behind The Glow? Aptos Returns With Hack Holland  Crypto ecosystems use contests to support new projects that need funding. Aptos Hack returns with Hack Holland, an event to find the new wave of Web3 projects that will contribute to the industry’s growth. The Hack Holland hackathon, which takes place on June 5–7th, is set to engender the next wave of DeFi products and services on Aptos. The event will give away prizes in categories like NFTs, DeFi, public goods, and many more.  Ready to show off your skills and earn some serious rewards? 🏆💰 Aptos Hack Holland is your chance to hack game-changing Web3 ideas and win huge prizes. Step up to the challenge! Applications close May 29th ⤵️https://t.co/K6DGUNRUoi pic.twitter.com/BIpC7HDaP6 — Aptos (@Aptos_Network) May 27, 2023 More Projects In The Pipeline Along with the recent buzz Hack Holland produced is the upcoming second playtest of Metapixel’s Gran Saga: Unlimited. Metapixel is the Web3 arm of South Korean gaming company NPIXEL which entered the world of Web3 in November last year. If the playtest is successful, we may see more games built on the Aptos blockchain, further providing positivity in the long term.  Another exciting development is Quicknode’s announcement of its strategic partnership with Aptos in the realm of remote node infrastructure. This partnership is crucial for Aptos’ success as a robust blockchain infrastructure will ensure the dominance of the Aptos blockchain. Aptos joins the @QuickNode network to provide developers easy-to-use remote node infrastructure services &#8211; so devs can spend less time on node operations and more time on building and innovating. Learn more at https://t.co/fYorOhQFak. https://t.co/6gVy4dMaM5 — Aptos (@Aptos_Network) May 24, 2023 To onboard more developers on Aptos, Move launched a Developer Hub featuring tutorials and documents on how to get started building the Aptos blockchain using the Move developer language. This consolidation of resources should also have an effect on the amount of dApps the platform will have in the future.  APT total market currently at $1.6 billion on the weekend chart at TradingView.com Related Reading: Shiba Inu (SHIB) Price Slump Leaves Over 1 Million Wallets In The Red Zone At $8.30, Investors Have Room For Gains After reaching its all-time-high price back in January, APT has been in decline since then. However, this may change in the coming days or months. At the moment, the token is trading in a very tight range which contributes to the bullishness.  APT price performance. Source: Coingecko Meanwhile, investors and traders should defend the $7.5 support level if the market flips from bullish to bearish. Holding this support level will allow the bulls to target the $12 range in the medium to long term. If the momentum permits it, we might even see a return to $16 in the long run.  -Featured image from Asia Crypto Today"
  }
]