[
  {
    "source": "Decrypt",
    "date": "2023-09-20T20:15:45.000Z",
    "title": "Shrapnel Studio Head Talks Unity Fees and Game Industry Challenges",
    "url": "https://decrypt.co/videos/interviews/F09XirN4/shrapnel-studio-head-talks-unity-fees-and-game-industry-challenges",
    "description": "Shrapnel's Head of Studio Don Norbury shares his perspective on the \"tumultuous\" video games industry and the Unity fee news that's upset developers with Decrypt's Kate Irwin."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-20T20:33:03.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>PayPal has launched PYUSD on Venmo starting September 20 and rolling out to all eligible users throughout the next few weeks. CoinEx has rebuilt its wallet system following a $70 million hack and is set to resume deposit and withdrawals for select cryptocurrencies. Meanwhile, DeFi protocol Balancer has warned users to stay away from its frontend website, after an apparent attack that has siphoned over $200,000 in cryptocurrency.</p><h2>PayPal rolls out PYUSD stablecoin to Venmo users</h2><p>PayPal announced the immediate availability of its PYUSD stablecoin on the Venmo platform. </p><p>According to a statement, <a href=\"https://cointelegraph.com/news/paypal-rolls-out-pyusd-stablecoin-venmo\">PYUSD is already available to some Venmo users</a> and will be rolling out fully in “the coming weeks” </p><p>“PYUSD is already present in native crypto experiences, and continues to be made more broadly available as the ecosystem grows,” said PayPal, in a statement. “In the few weeks since its launch in the open market, PYUSD is already present on select exchanges including Crypto.com, Bitstamp, Coinbase, and Kraken.\"</p><p>The community response on X has been almost uniformly positive with many calling the move “bullish” or otherwise indicating general approval. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">bullish </p>&mdash; bojak.eth (@W0JAK) <a href=\"https://twitter.com/W0JAK/status/1704569847558946924?ref_src=twsrc%5Etfw\">September 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>CoinEx to resume service with new wallet system following $70M hack</h3><p>Cryptocurrency exchange CoinEx is set to resume deposit and withdrawals for its users more than a week after it suffered a $70 million hack due to compromised hot wallet private keys.</p><p>In previous correspondence with Cointelegraph, the exchange outlined its priority to build and deploy a new wallet system to facilitate activities for the 211 blockchains and 737 tokens that it served before the hacking incident.</p><p>The latest statement from the exchange announces the resumption of deposit and withdrawal services of BTC, ETH, USDT, USDC and other tokens from Sept. 21.</p><p>CoinEx will update deposit addresses for the listed tokens and will generate new deposit addresses for its users. CoinEx customers were advised not to deposit into old addresses on the platform, as this would result in assets being permanently lost. The exchange also warned of a potentially large number of pending withdrawals at the resumption of its operations:</p><blockquote>“We ensure the new wallet system is stable, and we will gradually resume deposit and withdrawal services for more assets.”</blockquote><p>The exchange maintains that it has implemented a 100% asset reserve policy to safeguard users against potential security threats. Previous updates following the hacking incident also stated that users assets were not affected and that CoinEx's User Asset Security Foundation would cover any financial losses.</p><p>CoinEx has since revealed that compromised private keys for a number of its hot wallet addresses allowed hackers to withdraw some $70 million worth of cryptocurrencies. The hot wallets were used as temporary storage for user deposits, withdrawals and temporary storage.</p><p>Blockchain analytics firm Elliptic has linked the incident to North Korean “Lazarus Group” hackers, while the exchange told Cointelegraph that it was still investigating the identity of the perpetrators. CoinEx released further details of the assets that were stolen in the incident on Sept. 20.</p><h3>Balancer warns frontend has been attacked, $238K crypto stolen</h3><p>Balancer, an Ethereum-based decentralized finance protocol has warned users to stay away from its website until further notice, after an attack on its frontend. </p><p>Balancer said the details of the attack are under investigation. The firm hasn't officially commented on whether user funds were affected, but Balancer contributor Cosme Fulanito has reportedly <a href=\"https://twitter.com/DefiantNews/status/1704305237929173479\" target=\"_blank\" rel=\"noopener nofollow\">confirmed</a> that Balancer's vault remains \"100% fine.\"</p><p>Blockchain security firms including PeckShield and blockchain analyst ZachXBT however estimated at least $238,000 in crypto has been stolen so far.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/PeckShieldAlert?src=hash&amp;ref_src=twsrc%5Etfw\">#PeckShieldAlert</a> <a href=\"https://twitter.com/Balancer?ref_src=twsrc%5Etfw\">@Balancer</a> has reported that its frontend under an attack, ~$238k worth of cryptos were stolen <a href=\"https://t.co/aAaj0Xqery\">https://t.co/aAaj0Xqery</a> <a href=\"https://t.co/YDIjfnNYM4\">pic.twitter.com/YDIjfnNYM4</a></p>&mdash; PeckShieldAlert (@PeckShieldAlert) <a href=\"https://twitter.com/PeckShieldAlert/status/1704306602529247294?ref_src=twsrc%5Etfw\">September 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Some users have been reporting that when interacting with the website, they're being prompted to approve a malicious contract that drains users' wallets.</p><p>The attacker has since started to move the allegedly stolen funds, <a href=\"https://twitter.com/PeckShieldAlert/status/1704316676127490124\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to PeckShield.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-20T20:30:00.000Z",
    "title": "Apple, Goldman Sachs drop plans for trading app: Report",
    "url": "https://cointelegraph.com/news/apple-goldman-sachs-drop-plans-trading-app-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/db82ca7b-ce0f-4038-929b-2c792d4e1c43.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Initial plans called for a 2022 rollout, but economic conditions caused the project to be reportedly shelved last year.</p>\n                    <p><p>Apple and Goldman Sachs scrapped plans to launch an app for futures trading, CNBC <a href=\"https://www.cnbc.com/2023/09/20/apple-goldman-sachs-were-planning-a-stock-trading-feature-for-iphones.html\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-cnbc-com.cdn.ampproject.org/c/s/www.cnbc.com/amp/2023/09/20/apple-goldman-sachs-were-planning-a-stock-trading-feature-for-iphones.html\">reported</a> on Sept. 19, citing people familiar with the plans. </p><p>The project had an initial rollout date for 2022, but it was put on hold last year as economic conditions deteriorated, with a rise in interest rates and inflation pressures driving investors away from risky assets. </p><p>According to the sources, the project infrastructure was “mostly built” and is ready for launch if Apple proceeds with its original plan. Additionally, it is unclear whether Goldman and Apple intended to include crypto futures trading in the application. </p><p>During the pandemic, Apple sought to diversify its business and offer financial solutions for clients in the United States, partnering with Goldman Sachs to develop its initiatives.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Looks like all big technology guys are tying back to a Fin-tech product.  <a href=\"https://t.co/lYWowJ14np\">https://t.co/lYWowJ14np</a></p>— Githinji Mwai (@GithinjiMwai) <a href=\"https://twitter.com/GithinjiMwai/status/1701898721825337729?ref_src=twsrc%5Etfw\">September 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In collaboration with the bank, Apple first launched a credit card in 2019. Earlier this year, the tech giant released its buy now, pay later feature, allowing users to split purchases into four equal payments without charging any interest. </p><p>A few weeks later, in April, the company announced another Goldman Sachs-backed product, a savings account providing a 4.15% annual percentage yield. According to a recent report, user deposits in Apple’s savings account had <a href=\"https://www.apple.com/newsroom/2023/08/apple-cards-savings-account-by-goldman-sachs-sees-over-10-billion-usd-in-deposits/\" target=\"_blank\" rel=\"noopener nofollow\">topped</a> $10 billion. However, the partnership was not without its challenges. Goldman Sachs reportedly suffered a financial setback from managing Apple’s credit card, with an average customer acquisition cost of $350.</p><p>Apple’s venture into financial services isn’t an isolated move. After acquiring X (formerly Twitter), Elon Musk <a href=\"https://cointelegraph.com/news/elon-musk-says-x-will-offer-an-entire-financial-world-in-the-coming-months\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/elon-musk-says-x-will-offer-an-entire-financial-world-in-the-coming-months/amp\"></a><a href=\"https://cointelegraph.com/news/elon-musk-says-x-will-offer-an-entire-financial-world-in-the-coming-months\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/elon-musk-says-x-will-offer-an-entire-financial-world-in-the-coming-months/amp\">disclosed plans to make the social network</a> an “everything app,” incorporating financial services on the platform. According to Musk, in the coming months, users will be able to conduct their “entire financial world” on X. </p><p>Musk’s plans appear to be moving forward. Rhode Island regulators <a href=\"https://cointelegraph.com/news/x-twitter-crypto-payments-rhode-island-licence\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/x-twitter-crypto-payments-rhode-island-licence/amp\">granted X a currency transmitter license</a> on Aug. 30, marking a step forward for the company’s venture into financial services. The license is required for companies providing financial services on behalf of users, which includes both fiat and crypto assets. As a result of the approval, X will be able to custody, transfer and exchange digital currencies. Money transmitter licenses were also issued to X in Arizona, Georgia, Maryland, Michigan, Mississippi, Missouri and New Hampshire.</p><p><strong><em>Magazine:</em></strong> <a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-09-20T20:19:11.000Z",
    "title": "LayerZero Leaves Decentralization for Google Cloud",
    "url": "https://cryptobriefing.com/layerzero-leaves-decentralization-google-cloud/?utm_source=feed&utm_medium=rss",
    "description": "Blockchain network LayerZero chooses Google Cloud over decentralized alternatives like Chainlink, sparking concerns over centralization."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-20T20:30:48.000Z",
    "title": "Stanford University Vows to Return $5.5M FTX Donations; Funds Initially Allocated for Pandemic Prevention",
    "url": "https://news.bitcoin.com/stanford-university-vows-to-return-5-5m-ftx-donations-funds-initially-allocated-for-pandemic-prevention/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/sbf-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Stanford University Vows to Return $5.5M FTX Donations; Funds Initially Allocated for Pandemic Prevention\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/sbf-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/sbf-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/sbf-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/sbf-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/sbf-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/sbf-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/sbf-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In the wake of a lawsuit targeting the parents of Sam Bankman-Fried, Stanford University&#8217;s spokesperson has announced intentions to give back the millions garnered from FTX and its affiliates. Records indicate that a whopping $5.5 million in gifts to Stanford traces back to the FTX empire. FTX&#8217;s Pandemic Protection Push Pauses: Stanford Announces Donation Reversal [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-20T20:19:02.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here’s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-20T20:10:10.000Z",
    "title": "Congressman accuses DOJ of retaliation against tech CEO Elon Musk",
    "url": "https://www.cryptopolitan.com/congressman-accuse-doj-of-retaliation-elon-musk/",
    "description": "In a recent House Committee on Judiciary oversight hearing, Congressman Thomas Massie accused the U.S. Department of Justice (DOJ) of employing “mafia tactics” in its dual investigations against Tesla and SpaceX CEO Elon Musk. Massie suggested that the government&#8217;s actions are retaliatory following Musk&#8217;s exposure to what he termed a “censorship regime.” Elon Musk, a ... <a title=\"Congressman accuses DOJ of retaliation against tech CEO Elon Musk\" class=\"read-more\" href=\"https://www.cryptopolitan.com/congressman-accuse-doj-of-retaliation-elon-musk/\" aria-label=\"More on Congressman accuses DOJ of retaliation against tech CEO Elon Musk\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-20T20:33:44.000Z",
    "title": "Balancer confirms social engineering attack caused front end issues",
    "url": "https://crypto.news/balancer-confirms-social-engineering-attack-caused-front-end-issues/",
    "description": "The decentralized finance protocol Balancer suffered an exploit attack for nearly $900,000 in just a few days after a critical vulnerability was discovered. The Balancer team said a DNS attack was the source of an issue on its interface that&#8230;"
  }
]