[
  {
    "source": "CoinDesk",
    "date": "2023-08-01T16:47:58.000Z",
    "title": "How DeFi Protocols are Building More Granular and Extensible Capabilities",
    "url": "https://www.coindesk.com/consensus-magazine/2023/08/01/how-defi-protocols-are-building-more-granular-and-extensible-capabilities/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The trend towards \"micro-primitives\" creates protocols that are more extensible, programmable and composable. But it also creates greater vulnerability at a time when protocols are under increasingly hack-attack."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-01T16:54:54.000Z",
    "title": "Binance Japan begins launching trading services for residents",
    "url": "https://cointelegraph.com/news/binance-japan-begins-launching-trading-services",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/225a57af-f15c-4796-8787-c4e26fe8d4a9.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Japan-based crypto exchange said it was offering spot trading for 34 tokens as of Aug. 1, with plans to migrate global Binance users starting on Aug. 14.</p>\n                    <p><p>Major cryptocurrency exchange Binance has announced the launch of a Japan-based arm roughly two years after receiving a warning from the country’s financial regulator.</p><p>In an Aug. 1 announcement, Binance <a href=\"https://www.binance.com/en/blog/ecosystem/introducing-binance-japan-a-dedicated-platform-for-residents-in-japan-6690583502875080854?ref=AZTKZ9XS&amp;utm_source=BinanceTwitter&amp;utm_medium=GlobalSocial&amp;utm_campaign=GlobalSocial\" target=\"_blank\" rel=\"noopener nofollow\">said</a> local crypto exchange Sakura Exchange Bitcoin has launched as Binance Japan in an effort to operate within the country’s regulatory framework. The firm said it was offering spot trading for 34 tokens as of Aug. 1, with plans to migrate global Binance users starting on Aug. 14.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We’re proud to announce that <a href=\"https://twitter.com/hashtag/Binance?src=hash&amp;ref_src=twsrc%5Etfw\">#Binance</a> has officially launched in Japan as Binance Japan K.K.  <br><br>Users in the country now have access to more tradable tokens than any other exchange, with Spot and Earn products available.  <br><br>Find more details below.<a href=\"https://t.co/grxPYSsp84\">https://t.co/grxPYSsp84</a></p>&mdash; Binance (@binance) <a href=\"https://twitter.com/binance/status/1686335562276274176?ref_src=twsrc%5Etfw\">August 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Japan, briefly home to Binance CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/changpeng-zhao\">Changpeng Zhao</a>, was also the headquarters of the crypto exchange following the move of its operations from China. However, Binance relocated to Malta in 2018 following warnings from Japanese financial regulators on its license.</p><p>The Financial Services Agency (FSA) of Japan issued a letter to Binance in June 2021, warning the exchange for operating in the country without a license. A spokesperson told Cointelegraph at the time that the firm did not “hold exchange operations” in the country or “actively solicit Japanese users”.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/token-issuers-in-japan-exempt-from-30-crypto-tax-on-paper-gains\"><strong><em>Token issuers in Japan exempt from 30% crypto tax on paper gains</em></strong></a></p><p>Binance <a href=\"https://cointelegraph.com/news/binance-to-re-enter-japan-via-acquired-regulated-exchange-sebc\">acquired Sakura Exchange Bitcoin</a> in November 2022, suggesting the firm planned to re-enter the Japanese crypto market under the required regulatory regime. The company said the move was aimed at “bolster[ing] the development of the Japanese digital-asset market”, citing its growing interest in blockchain.</p><p>Japanese Prime Minister Fumio Kishida has <a href=\"https://cointelegraph.com/news/binance-web3-japan-to-promote-web3-as-binance-announces-imminent-launch\">stood behind the government’s plans</a> to promote Web3 innovations in the country. However, other crypto exchanges including Kraken and Coinbase <a href=\"https://cointelegraph.com/news/kraken-quits-japan-for-second-time-blaming-a-weak-crypto-market\">announced their intention</a> of shuttering operations in Japan, citing market conditions.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-city-guide-osaka-japan/\"><strong><em>Crypto City: Guide to Osaka, Japan’s second-biggest city</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-01T16:42:52.000Z",
    "title": "Bitcoin investor sentiment slumps to a new low, even as macro and equities show improvement",
    "url": "https://cointelegraph.com/news/bitcoin-investor-sentiment-slumps-to-a-new-low-even-as-macro-and-equities-show-improvement",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/0e8242e1-ef81-48eb-9564-9ec8e263c7ff.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Three key Bitcoin price indicators explain why BTC price continues to fall toward new lows.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) surpassed the $30,000 resistance on June 21, or 40 days ago, after a notable 19.5% gain in a week. Since then, it has been moving within a range filled with occasional moderate corrections and BTC price trades near $29,300. While these consolidation periods are common in traditional markets, they tend to make crypto investors quite anxious.</p><p>As Bitcoin's price repeatedly fails to break the $31,000 level, traders are becoming increasingly tense and their sentiment is worsening. This trend could reverse suddenly, regardless of any relevant news or macroeconomic factors that might support an upward move andcrypto traders' emotions can magnify positive and negative price swings, leading to euphoric and fear-led price action. </p><h2>Bitcon’s low volatility sessions have traders worried </h2><p>The increased anxiety among traders is partly due to Bitcoin's historical volatility, which used to be much higher than its current levels. Presently, the 33% annualized 50-day volatility is the lowest in 6 months, contrasting sharply with the 60% or higher volatility observed for 245 days throughout 2022. Despite the rationale for this shift, the recent period has been relatively calm for Bitcoin's price.</p><p>To put it in perspective, consider that auto and electric battery producer Tesla (TSLA), a top-10 global asset and part of the S&amp;P 500 index, currently experiences a 58% annualized volatility. In comparison, graphics chipmaker NVidia (NVDA) has consistently demonstrated a 70% or higher volatility for most of 2021. </p><p>While some analysts use volatility data to predict trends, it's essential to note that this indicator relies on absolute price changes, yielding the same outcome for both upward and downward price swings. Therefore, volatility only provides information about the magnitude of daily oscillations.</p><p>However, apart from price changes, there are other metrics that can indicate investors' excitement or lack of interest in an asset, such as evaluating its market share or market dominance.</p><h2>Bitcoin dominance shows declining interest relative to altcoins</h2><p>On July 30, Bitcoin's market share in the total crypto capitalization dropped to 49.5%, the lowest figure since June 16.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5f5c27d7-1dcd-4ff7-a09a-abf42bfa53be.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin (BTC) dominance, % terms. Source: </em><a href=\"https://www.tradingview.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>This decline can be partially attributed to a <a href=\"https://cointelegraph.com/news/ripple-s-major-success-in-the-court-battle-with-the-sec-law-decoded-july-10-17\">favorable legal decision for Ripple Labs</a> on July 13, which reduced regulatory risks for altcoins. Industry representatives believe this decision will benefit crypto exchanges Coinbase and Binance in their SEC lawsuits. The diminishing dominance of Bitcoin marks a trend shift from the gains observed between December 2022 and June 2023 when it increased from 40.2% to 52%.</p><h2>Lackluster network activity is another sign of negative investor sentiment </h2><p>Bitcoin's 1-year active supply, representing the sum of unique BTC transacted in the trailing 12 months, reached its lowest level since February 2016 at 6.0 million BTC as of July 26. This data, compared to the 6.2 million BTC activity three months prior, raises concerns, especially with the potential approval of spot ETFs in the U.S.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/41d03881-22b6-4f2e-9286-e612de2c9dc9.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 1-year active supply, BTC. Source: Coin Metrics</em></figcaption></figure><p>The decreasing number of Bitcoin moved on-chain might have been offset by the increased use of the Lightning Network as an alternative solution. However, this Layer 2 solution currently holds a mere $138 million in Total Value Locked (TVL) and shows a near unmoving 16,382 nodes in the past 30 days.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/us-banking-advocacy-senator-warren-crypto-bill\">US banking advocacy group supports Sen. Warren’s reintroduced crypto bill</a></em></strong></p><h2>Bitcoin options traders are losing confidence</h2><p>The main \"fear and greed\" metric for Bitcoin options, the 25% delta skew, indicates that bulls are becoming less confident over time. Readings above 7% suggest traders anticipate a drop in Bitcoin's price, while periods of excitement typically yield a -7% skew.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/a844ec1e-e78d-4cac-a966-d7a1d522dfe9.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 30-day options 25% delta skew. Source: Laevitas</em></figcaption></figure><p>Currently, the 30-day metric remains flat at 1%, indicating a balanced demand between call (buy) options and protective puts, signaling a neutral market. However, it does show a decreased appetite among bulls compared to the 2% to 14% discount on neutral-to-bearish put (sell) options between June 19 and July 29. This derivatives data strongly supports the notion that traders have become less confident since the $29,500 support level broke.</p><p>As investors' mood worsens and indicators point to increased tension, Bitcoin price faces mounting pressure in the near term. Falling dominance, lackluster network activity and concerns in the options markets all contribute to the potential negative impact on Bitcoin price. On a positive note, if traders remain cautious and anticipate further downward movement, the likelihood of excessive liquidations among leverage traders is reduced.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-01T17:00:33.000Z",
    "title": "Long-term Bitcoin holder supply posts new ATH, undeterred by price",
    "url": "https://cryptoslate.com/long-term-holder-btc-supply-posts-new-ath/",
    "description": "<p>On July 30, the amount of Bitcoin held by long-term holders reached an all-time high. According to data from blockchain analytics firm Glassnode, long-term holders now possess 14.55 million BTC, marking a new record in Bitcoin’s history. Long-term holders (LTHs) are defined as addresses that have held onto their Bitcoin for over 155 days playing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/long-term-holder-btc-supply-posts-new-ath/\">Long-term Bitcoin holder supply posts new ATH, undeterred by price</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T17:06:57.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T17:06:54.000Z",
    "title": "HSBC’s H1 net profit more than doubles – What’s next?",
    "url": "https://www.cryptopolitan.com/hsbcs-h1-net-profit-more-than-doubles/",
    "description": "The financial world is always on the lookout for a success story, and HSBC&#8217;s latest report is nothing short of triumphant. As Europe&#8217;s largest bank by assets, HSBC&#8217;s net profit soared to a staggering $18.1 billion in the first half of this year, a leap that more than doubled the $9 billion from the same ... <a title=\"HSBC&#8217;s H1 net profit more than doubles &#8211; What&#8217;s next?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hsbcs-h1-net-profit-more-than-doubles/\" aria-label=\"More on HSBC&#8217;s H1 net profit more than doubles &#8211; What&#8217;s next?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T17:01:23.000Z",
    "title": "Iran’s push to be part of BRICS gains momentum",
    "url": "https://www.cryptopolitan.com/iran-push-to-be-part-of-brics-gains-momentum/",
    "description": "Iran&#8217;s drive to secure a place within the influential BRICS economic group has taken a bold stride forward. The nation is unabashedly exerting itself on the world stage to cement its economic future, seeking alliances with major powers within the BRICS nations, namely Brazil, Russia, India, China, and South Africa. This is not a subtle ... <a title=\"Iran&#8217;s push to be part of BRICS gains momentum\" class=\"read-more\" href=\"https://www.cryptopolitan.com/iran-push-to-be-part-of-brics-gains-momentum/\" aria-label=\"More on Iran&#8217;s push to be part of BRICS gains momentum\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T16:45:49.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T16:41:34.000Z",
    "title": "South Korea ditches China for the U.S. – Why?",
    "url": "https://www.cryptopolitan.com/south-korea-ditches-china-for-the-u-s-why/",
    "description": "The geopolitical landscape is shifting as South Korea moves away from China and aligns more closely with the U.S., a tectonic shift with potential consequences for the global economic balance. While the shift may seem gradual, it&#8217;s as clear as day and backed by hard facts. South Korea&#8217;s journey from being intertwined with China to ... <a title=\"South Korea ditches China for the U.S. &#8211; Why?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/south-korea-ditches-china-for-the-u-s-why/\" aria-label=\"More on South Korea ditches China for the U.S. &#8211; Why?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-01T17:01:56.000Z",
    "title": "Bitcoin Investor Sentiment Flips Toward Greed Despite Fall Below $29,000",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-investor-sentiment-flips-toward-greed-despite-fall-below-29000/",
    "description": "Amid the turbulence, the Bitcoin price has finally fallen below the $29,000 support. This decline points to the bears taking over the market, but investor sentiment has not swung the way it normally would in such circumstances. Instead of swinging toward bearish momentum, investors are rather leaning toward greed, suggesting that they do not expect this decline to last. Bitcoin Fear &#38; Greed Index Moves Toward Greed The Bitcoin Fear &#38; Greed Index measures investor sentiment toward the market by taking into account things like surveys, social media posts, market volume, and volatility, among others. The aggregate of these metrics is then used to determine if investors are feeling bearish or bullish. Related Reading: Litecoin Sharks Buy More Than 200,000 LTC Ahead Of Wednesday’s Halving The scale goes from 1-100 with 1-25 standing for extreme fear, 26-47 means fear, 54-75 means greed, and 76-100 represents extreme greed. The 48-53 level represents neutral sentiment, which is where the index has been for the last week. The direction in which the index points toward neutral is of interest here. On Monday, the index was sitting at a completely neutral score of 50. However, by Tuesday, the index is now sitting at a neutral score of 53. This move from 50 to 53 indicates that despite the price of BTC falling below $29,000, investors are still viewing it in a positive light. Otherwise, the index would’ve fallen below 50. Fear &#38; Greed Index sitting at 53 &#124; Source: alternative.me Given this, the chances that the current decline will not last long are high. This is because investors being bullish about BTC means they’re likely to put more money into it. Once such buying pressure begins to mount, then BTC could recover above $29,000 once more. Attention Remains On BTC On Monday, Bitcoinist reported an 82% spike in Bitcoin’s daily trading volume, indicating renewed interest in the digital asset. This saw BTC’s trading volume climb to $10.8 billion, but the cryptocurrency has still not slowed down. BTC’s daily trading volume also saw another significant jump on Tuesday, rising 22% in the 24-hour period. This brought the digital asset’s daily volume to $13.4 billion at the time of writing. This continuous rise reiterates the rising interest in the asset, showing that the move in the Fear &#38; Greed Index toward the greed territory is not a fluke. Related Reading: Cardano (ADA) Price Remains Muted Despite Significant Milestones, Why? The volumes could point to accumulation among investors. And if this is the case, then BTC will likely recover over $29,000. A recovery above this mark would put the digital asset back on track to retest the $30,000 resistance before the weekend. BTC price falls below $29,000 support &#124; Source: BTCUSD on Tradingview.com Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-01T17:00:41.000Z",
    "title": "Binance Pulling Out From Germany, Will This Pump Non-Custodial Trading Driving QUBE 5X On Uniswap?",
    "url": "https://www.crypto-news-flash.com/binance-pulling-out-from-germany-will-this-pump-non-custodial-trading-driving-qube-5x-on-uniswap/?utm_source=rss&utm_medium=rss&utm_campaign=binance-pulling-out-from-germany-will-this-pump-non-custodial-trading-driving-qube-5x-on-uniswap",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T121410.826.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T121410.826.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T121410.826-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As a novel innovation, the crypto landscape is no stranger to regulatory changes as countries grapple with it. In recent developments, Binance, the largest centralized crypto exchange, announced its decision to withdraw its crypto license application in Germany. This was in response to a strict regulatory environment. Despite withdrawing from Germany, Binance is determined to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-01T16:48:06.000Z",
    "title": "Bitcoin (BTC) Volatility Hits Lowest Level Since July 2020: A Precursor to a Parabolic Rally?",
    "url": "https://www.crypto-news-flash.com/bitcoin-btc-volatility-hits-lowest-level-since-july-2020-a-precursor-to-a-parabolic-rally/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-btc-volatility-hits-lowest-level-since-july-2020-a-precursor-to-a-parabolic-rally",
    "description": "<img width=\"1280\" height=\"890\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280-300x209.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280-1024x712.png 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />On-chain data reveals that Bitcoin&#8217;s volatility is at its lowest since July 2022. Bitcoin&#8217;s price has exhibited little inclination to rise or fall and has been consolidating around the $30K level for the past few weeks. The world&#8217;s largest cryptocurrency, Bitcoin (BTC), has experienced minimal movement and extremely low volatility in the past week. On-chain [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-01T16:56:00.000Z",
    "title": "Lazarus Group’s Funds Previous Exploits Come Together On-Chain",
    "url": "https://coinedition.com/lazarus-groups-funds-previous-exploits-come-together-on-chain/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Lazarus Group’s Funds Previous Exploits Come Together On-Chain\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-Hack-5-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Lazarus Group, the notorious cybercrime syndicate based in North Korea, is reportedly on the move again. Popular crypto sleuth ZachXBT reported earlier today that the funds from Lazarus’ previous exploits had come together on-chain. This included funds from the Harmony Protocol hack, the Atomic Wallet exploit, the CoinsPaid hack, and the Alphapo hot wallet hack. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/lazarus-groups-funds-previous-exploits-come-together-on-chain/\">Lazarus Group’s Funds Previous Exploits Come Together On-Chain</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-01T16:55:52.000Z",
    "title": "Nearly 75% of the World’s Largest Banks Support the Transfer of Funds to Major Crypto Exchanges: CoinGecko",
    "url": "https://dailyhodl.com/2023/08/01/nearly-75-of-the-worlds-largest-banks-support-the-transfer-of-funds-to-major-crypto-exchanges-coingecko/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/nearly-largest-support-funds.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/nearly-largest-support-funds.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/nearly-largest-support-funds.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/nearly-largest-support-funds.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/nearly-largest-support-funds.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/nearly-largest-support-funds.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/nearly-largest-support-funds.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An overwhelming majority of the world’s largest banks support the transfer of client funds to major crypto exchanges, according to a new study by digital asset data aggregator CoinGecko. The study examines how crypto-friendly the world&#8217;s largest 50 banks are based on two criteria: whether they offer crypto trading or on-ramping services within the bank’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/01/nearly-75-of-the-worlds-largest-banks-support-the-transfer-of-funds-to-major-crypto-exchanges-coingecko/\">Nearly 75% of the World’s Largest Banks Support the Transfer of Funds to Major Crypto Exchanges: CoinGecko</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-01T16:43:08.000Z",
    "title": "Enjinstarter IDO Investors Win Big With AI",
    "url": "https://dailyhodl.com/2023/08/01/enjinstarter-ido-investors-win-big-with-ai/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Enjinstarter-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Enjinstarter-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/08/Enjinstarter-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/08/Enjinstarter-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Enjinstarter-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/08/Enjinstarter-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>August 1, 2023 – Singapore, Singapore Launchpad delivers 142.4% ROI YTD thanks to carefully curated selection of AI projects. Leading IDO launchpad, Enjinstarter, announced today that its stable of AI-powered Web 3.0 projects has earned investors an average ROI of 142.4% YTD in 2023. This puts Enjinstarter firmly in the top three of IDO providers [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/01/enjinstarter-ido-investors-win-big-with-ai/\">Enjinstarter IDO Investors Win Big With AI</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]