[
  {
    "source": "Cointelegraph",
    "date": "2023-12-02T00:00:09.000Z",
    "title": " The SEC is facing another defeat in its recycled lawsuit against Kraken ",
    "url": "https://cointelegraph.com/news/sec-facing-defeat-lawsuit-against-kraken",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZGFhYmVlNDQtYzQ4OS00ZTM3LTgzZjUtMDE2OTYwOThmNjk1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Securities and Exchange Commission is suing Kraken for selling cryptocurrencies, but it looks like a recycled version of a losing lawsuit.</p>\n                    <p><p >The legal duel between the United States Securities and Exchange Commission (SEC) and Kraken, a leading cryptocurrency exchange, looks like another misguided attempt by the SEC to exert control over an industry that fundamentally challenges an outdated regulatory playbook. The agency’s lawsuit, filed in November, <a href=\"https://cointelegraph.com/news/sec-sues-kraken-for-securities-laws-violations\">accuses Kraken of operating as an unregistered securities exchange</a>.</p><p >The lawsuit isn’t just a repeat of the SEC’s past failures. </p><p >The lawsuit isn’t just a repeat of the SEC’s past failures. </p><p ><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-companies-excited-bitcoins-halving-expect-some-fail\"><strong><em>Expect some crypto companies to fail in the wake of Bitcoin's halving</em></strong></a></p><p >Unlike traditional securities exchanges, platforms like Kraken offer a diverse range of digital assets that do not fit neatly into the securities framework. </p><figure ><img src=\"https://s3.cointelegraph.com/uploads/2023-12/2ab655ab-565f-4b84-9d90-95561fe6e7a2.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">The SEC lawsuit against Kraken shamed the exchange for telling users they could attempt to profit by dollar-cost averaging into Solana. </p><p><a href=\"https://cointelegraph.com/news/sec-facing-defeat-lawsuit-against-kraken\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-01T23:55:05.000Z",
    "title": "KyberSwap commits to covering user losses from recent exploit",
    "url": "https://cryptoslate.com/kyberswap-commits-to-covering-user-losses-from-recent-exploit/",
    "description": "<p>KyberSwap announced on Dec. 1 that it will offer grants in order to compensate users affected by a recent exploit. The decentralized exchange acknowledged that a recent attack drained $48.8 million of user funds from its elastic liquidity pools — a feature that allows users to stake cryptocurrency in order to earn interest or generate [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/kyberswap-commits-to-covering-user-losses-from-recent-exploit/\">KyberSwap commits to covering user losses from recent exploit</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-02T00:01:06.000Z",
    "title": "Bitcoin’s Bullish Surge Ahead: Deribit Predicts Major Price Leap In Early 2024",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bullish-surge-ahead-deribit-predicts-leap/",
    "description": "A recent analysis by Deribit, a leading derivatives exchange, suggests a bullish sentiment for Bitcoin as we approach early 2024. This optimism is rooted in the current Bitcoin put-call options ratio, a critical option market metric. Related Reading: Bitcoin Alert: $137 Million Moved By Long-Sleeping Whale, Market Braces For Impact Deribit&#8217;s Insight: Bitcoin Calls Outpace Puts Signaling Market Confidence Notably, options are financial instruments that give traders the right, but not the obligation, to buy (call options) or sell (put options) an underlying asset at a specified price within a set time frame. The put-call ratio is used in options trading to measure market sentiment. A put option signifies a bet on the price of an asset falling, while a call option represents a wager on its rise. A lower put-call ratio indicates that more traders are betting on the asset&#8217;s price increasing rather than decreasing. Deribit&#8217;s analysis shows an increasing trend in the number of call options outstripping put options in Bitcoin’s options market. Luuk Strijers, Chief Commercial Officer at Deribit, highlighted that the put-call ratio for Bitcoin has consistently hovered &#8220;between 0.4 and 0.5&#8221; throughout the year. This trend is particularly noticeable for options expiring in March and June 2024, suggesting that investors are increasingly using call options to position for a potential appreciation in Bitcoin&#8217;s value during this period. The put-call options ratio falling below one is a bullish market indicator, as it shows that call volume, or bets on the price increase, surpasses the put volume, which are bets on the price decrease. According to Deribt, Bitcoin&#8217;s put-call ratio currently stands at 0.42, as of today. A Surge In Crypto Derivatives Activity Meanwhile, November has seen significant activity in the crypto derivatives market, as noted by Strijers. The Deribit executive attributes this increased market activity to higher levels of &#8220;implied volatility (DVOL),&#8221; which have spurred &#8220;opportunities and overall market volumes.&#8221; The expiration dates of the upcoming options, especially the significant one on December 29, are expected to maintain the heightened interest and activity in the market. With $5.7 billion in Bitcoin options and $2.7 billion in Ethereum options set to expire at the end of December, the market is poised for notable movements. Bitcoin maintains its upward momentum, advancing by 1.8% over the past 24 hours. With Bitcoin currently trading at $38,344, the asset has sustained the gains achieved at the close of the previous month. Related Reading: Bitcoin On The Brink? Analyst Predicts Soaring Open Interest May Signal 20% Price Correction Bitcoin’s trading volume significantly reflects heightened market activity, suggesting ongoing buying pressure. In just the last day, trading volumes have surged from around $11 billion earlier in the week to over $21 billion, a noteworthy indication of increasing investor engagement. Featured image from Unsplash, Chart from TradingView"
  }
]