[
  {
    "source": "Decrypt",
    "date": "2023-08-11T01:01:02.000Z",
    "title": "Binance Labs Invests $10M to Accelerate Helio Protocol's Liquid Staking Pivot",
    "url": "https://decrypt.co/151990/binance-labs-invests-10m-accelerate-helio-protocols-liquid-staking-pivot",
    "description": "LSDfi is a fast growing space within DeFi. Now Binance is throwing capital into it. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-11T00:45:56.000Z",
    "title": "Pentagon forms ‘Task Force Lima’ to map generative AI for US defense",
    "url": "https://cointelegraph.com/news/pentagon-task-force-lima-to-study-generative-ai-defense",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/76b2a5de-c332-4a22-8f87-3f4178a5a29f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Task Force Lima will look into how artificial intelligence can be used across the U.S. defense, including warfighting capabilities.</p>\n                    <p><p>The United States Pentagon has launched a new task force to look into how generative artificial intelligence can be used for the nation’s defense.</p><p>On Aug. 10, the Pentagon <a href=\"https://www.defense.gov/News/Releases/Release/Article/3489803/dod-announces-establishment-of-generative-ai-task-force/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> the formation of “Task Force Lima” which would look into integrating AI across the U.S. defense apparatus so it can “design, deploy, and use generative AI technologies.”</p><p>In a statement, the Department of Defense said the aim is to <a href=\"https://cointelegraph.com/news/chatgpt-and-claude-are-becoming-capable-of-tackling-real-world-missions-say-scientists\">use AI to enhance</a> its business affairs, health, readiness, policy and warfighting capabilities.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, <a href=\"https://twitter.com/DepSecDef?ref_src=twsrc%5Etfw\">@DepSecDef</a> signed Task Force Lima into effect. This <a href=\"https://twitter.com/DeptofDefense?ref_src=twsrc%5Etfw\">@DeptofDefense</a>-wide generative AI task force will examine generative AI use cases from across the federal government &amp; develop recommendations on responsibly using these powerful tools. Learn more: <a href=\"https://t.co/GELM3aJqRf\">https://t.co/GELM3aJqRf</a></p>&mdash; DOD Chief Digital &amp; AI Office (@DODCDAO) <a href=\"https://twitter.com/DODCDAO/status/1689712784190099457?ref_src=twsrc%5Etfw\">August 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Deputy Secretary of Defense Dr. Kathleen Hicks <a href=\"https://media.defense.gov/2023/Aug/10/2003279040/-1/-1/1/ESTABLISHMENT_OF_CDAO_GENERATIVE_AI_AND_LARGE_LANGUAGE_MODELS_TASK_FORCE_TASK_FORCE_LIMA_OSD006491-23_RES_FINAL.PDF\" target=\"_blank\" rel=\"noopener nofollow\">said</a> part of Lima’s mission would also study how the department can defend against and respond to malicious or adversarial uses of AI.</p><p>The newly formed Chief Digital and Artificial Intelligence Office (CDAO) — which launched in June 2022 — will lead the new task force, with U.S. Navy Captain Manuel Xavier Lugo named Lima’s mission commander.</p><p>Lima’s creation comes as tensions between the U.S. and China over AI technology continue to heighten.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/us-pentagon-is-testing-whether-ai-can-plan-response-to-an-all-out-war\"><strong><em>Pentagon is testing whether AI can plan response to an all-out war</em></strong></a></p><p>On Aug. 9 President Joe Biden <a href=\"https://cointelegraph.com/news/us-china-ai-tech-standoff-spread-overseas\">signed an executive order</a> that named China, Hong Kong and Macau as countries of concern and tech investments in those regions would be would regulated and restricted.</p><p>Such tech investments — deemed critical for China’s military, intelligence and cyber capabilities — included semiconductors which are often vital for developing AI models. </p><p>The order adds to restrictions on AI chip sales to China that Biden implemented in October 2022 and U.S. officials are mulling <a href=\"https://cointelegraph.com/news/us-considers-tightening-restrictions-on-ai-chip-exports\">tighter controls on such sales</a>. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\"><strong><em>Experts want to give AI human ‘souls’ so they don’t kill us all</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-11T01:00:32.000Z",
    "title": "Dogecoin Rally Ahead? This Positive Correlation Data Points To A Potential 20% Jump For DOGE",
    "url": "https://www.newsbtc.com/dogecoin-2/this-positive-correlation-data-points-to-a-potential-20-jump-for-dogecoin/",
    "description": "Dogecoin has been one of the cryptocurrencies to watch in the past few weeks. However, the token’s price appears to be slowing down after recording significant bullish momentum. Interestingly, there might be renewed optimism around the DOGE price, as a crypto analyst has offered insight on what to expect from the meme coin in the coming weeks. Related Reading: Dogecoin Falls While Others Rally, Is It Decoupling From The Market? Dogecoin To Experience A 20% Price Rally?   On Thursday, August 10, crypto analyst Ali Martinez shared data from IntoTheBlock, suggesting that DOGE might witness a positive price movement soon. This suggestion is based on the similarities in the price history of both Shiba Inu (SHIB) and Dogecoin.  According to his post on X (formerly Twitter), there is a “strong” positive correlation of 0.74 between the two meme coins over the past two months. This indicates that when SHIB’s price shifts, the price of DOGE often moves in the same direction.  Source: TradingView/ali_charts Interestingly, this hasn&#8217;t happened in the past few days, as the DOGE price has not taken significant action. The value of SHIB, on the other hand, has surged by 22% in the last seven days. However, Ali Martinez noted that “given their high correlation coefficient,” a bullish price movement might still be on the horizon for DOGE. So, investors might want to keep a keen eye on the token’s performance in the coming days. DOGE Price Stuck In A Range &#8211; Price Overview Dogecoin has struggled to maintain the momentum garnered from Elon Musk’s support a few weeks ago. The meme coin has been trading mainly within a range since then, recording a mere 3.1% gain in the past week. After reaching a 7-day high of $0.07658 on Saturday, August 5, the DOGE price shed all its gain to trade below $0.073. However, the token&#8217;s price is back up, hovering around its weekly high. Related Reading: Dogecoin Falls While Others Rally, Is It Decoupling From The Market? This price action underscores the meme coin’s unsuccessful attempts at breaking the $0.08 resistance level. DOGE trades about 5.5% down from the significant $0.08 zone after failing to breach it on July 31. As of this writing, the Dogecoin price is $0.075739,  having leaped by 0.3% in the last 24 hours. With a nearly $10.7 billion market cap, DOGE ranks as the 8th-largest cryptocurrency. CoinGecko data reveals that there has been a substantial boost in DOGE’s market activity, with a 17.6% increase in its daily trading volume. The cryptocurrency currently has a 24-hour trading volume of over $430.2 million. DOGEUSDT approaching the $0.08 level on the daily timeframe &#124; Source: DOGEUSDT chart from Tradingview Featured image from iStock, charts from TradingView"
  }
]