[
  {
    "source": "CryptoGlobe",
    "date": "2023-06-02T06:17:20.000Z",
    "title": "Nike’s NFT Platform .SWOOSH to Integrate with EA Sports Games",
    "url": "https://www.cryptoglobe.com/latest/2023/06/nikes-nft-platform-swoosh-to-integrate-with-ea-sports-games/",
    "description": "Nike, the global sportswear giant, has partnered with EA Sports to integrate its non-fungible token (NFT) platform, “.SWOOSH”, which is still in closed beta, into EA Sports games. This move is expected to bring Nike’s virtual footwear and apparel into the gaming world, potentially reaching millions of players. On November 14, 2022, Nike announced the […]\n"
  },
  {
    "source": "NullTX",
    "date": "2023-06-02T06:29:31.000Z",
    "title": "Ethereum Price Analysis & Prediction (June 1st) – ETH Signals Bearish, Targets $1,700 as Next Swing Low",
    "url": "https://nulltx.com/ethereum-price-analysis-prediction-june-1st-eth-signals-bearish-targets-1700-as-next-swing-low/",
    "description": "Ethereum and most top altcoins have suffered a substantial loss amidst the latest crypto market&#8217;s downfall. The bears are stepping back to pull the price to $1,700 in the next few days. It lost 2.5% overnight. Following last week’s recovery that pushed the price above the $1900 level last weekend, Ethereum’s price broke slightly above [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-02T06:13:44.000Z",
    "title": "Cardano Price Analysis & Prediction (June 1st) – ADA Retests This Channel’s Lower Boundary, as it Negotiates For a Break or Bounce",
    "url": "https://nulltx.com/cardano-price-analysis-prediction-june-1st-ada-retests-this-channels-lower-boundary-as-it-negotiates-for-a-break-or-bounce/",
    "description": "After witnessing a series of drops in the past weeks, Cardano reached a critical trading area where a major bounce or breakdown may come into play. Now negotiating for the next direction. The price of Cardano looks overstretched following past weeks of negative actions across the market. Due to the extreme drop in price, the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-02T06:26:30.000Z",
    "title": "OpenAI CTO’s Twitter account hijacked to promote crypto scam",
    "url": "https://crypto.news/openai-ctos-twitter-account-hijacked-to-promote-crypto-scam/",
    "description": "The Twitter account of Mira Murati, OpenAI&#8217;s Chief Technology Officer, fell victim to an apparent hack on June 2. The attacker exploited her Twitter to promote a deceptive crypto airdrop. Murati found her account used to advertise a fraudulent cryptocurrency&#8230;"
  }
]