[
  {
    "source": "CoinDesk",
    "date": "2024-02-19T18:55:52.000Z",
    "title": "Craig Wright Witness Defends Saying Headed for ‘Train Wreck’ With COPA Trial",
    "url": "https://www.coindesk.com/policy/2024/02/19/craig-wright-witness-defends-saying-headed-for-train-wreck-with-copa-trial/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Stefan Matthews said the damning message referred to poor trial prep and not Wright’s claims to being Bitcoin inventor Satoshi Nakamoto."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-19T18:45:55.000Z",
    "title": " Forbes launches permanent metaverse presence featuring ‘luxurious pool,’ ‘elegant bar’  ",
    "url": "https://cointelegraph.com/news/forbes-launches-permanent-metaverse-presence-sandbox-web3",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvY2MzNTM1YmMtYjk2NS00MjA4LTg1YWQtNDk4MzdjYjg3OTE4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Hong Kong-owned magazine now owns virtual real-estate in the Sandbox Metaverse.</p>\n                    <p><p>Forbes, a business magazine founded in 1917, now has a distinguished, permanent Web3 presence on the Sandbox Metaverse. </p><p>Nestled to the west of “Dracula's Castle” and a few plots north of “HODL Island,” within the virtual world, the new Forbes experience is currently <a href=\"https://www.sandbox.game/en/map/?mode=play&amp;zoom=1&amp;lat=-53&amp;lng=16\" target=\"_blank\" rel=\"noopener nofollow\">available</a> to the public.</p><p>The Sandbox officially opened for business in November of 2023. Cointelegraph <a href=\"https://cointelegraph.com/news/metaverse-future-shape-users-brands-creators-sandbox-cofounders\">caught up with Sandbox co-founder Sebastien Borget on the day of the launch</a>. He explained then that “now [anyone] can open their experience to the public [and] make it accessible, which will increase the amount of experience and content that people can play and discover on the platform.”</p><p><a href=\"https://cointelegraph.com/news/forbes-launches-permanent-metaverse-presence-sandbox-web3\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-19T19:07:58.000Z",
    "title": "South Korea’s ruling party mulls Bitcoin ETFs as election promise: Report",
    "url": "https://www.cryptopolitan.com/south-koreas-ruling-party-mulls-bitcoin-etfs/",
    "description": "South Korea&#8217;s ruling People Power Party is contemplating significant changes in the country&#8217;s cryptocurrency landscape as part of its campaign pledges for the forthcoming general election in April.&#160; Reports suggest that the party is considering lifting the ban on spot bitcoin exchange-traded funds (ETFs) and exploring avenues to allow institutional investment in cryptocurrencies, including initial [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-19T19:03:41.000Z",
    "title": "Central banks are going to crash the global economy",
    "url": "https://www.cryptopolitan.com/central-banks-to-crash-the-global-economy/",
    "description": "Settle in, guys. I&#8217;m afraid I&#8217;ve got some terrible news. Our central banks, those institutions that keep the global economy on a somewhat even keel, are now showing signs that they&#8217;re about to throw us all into an apocalypse. Gone are the days when global trends were the main drivers behind price outlooks. Now, it [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-19T19:00:11.000Z",
    "title": "Fetch.AI (FET) Prints Strong Bullish Signal, Targets 500% Spike",
    "url": "https://www.newsbtc.com/news/fetch-ai-fet-strong-bullish-signal-targets-500-spike/",
    "description": "In a new technical analysis, renowned crypto analyst Gert van Lagen forecasts a 500% surge in the value of Fetch.AI (FET), with a price target of $5.5. This bold prediction comes as the AI-centric cryptocurrency coin, FET, records a 12% increase over the past 24 hours and an impressive 45% gain over the last week. Currently trading with a momentum that correlates with the buzz around AI technology giant Nvidia, Fetch.AI is riding the wave of heightened interest as Nvidia approaches its Q4 2023 earnings release on February 21. Nvidia&#8217;s stock has experienced a remarkable 45% surge since their previous earnings report, expanding its market cap by an unprecedented $600 billion. As the tech community anticipates Nvidia&#8217;s next financial update, speculation abounds regarding the potential influence of the company&#8217;s performance on the broader AI and cryptocurrency markets. FET, along with other AI-tied tokens such as The Graph (GRT), Injective (INJ), Render Network (RNDR), and SingularityNET (AGIX), stands at a critical juncture where Nvidia&#8217;s financial results could significantly sway investor sentiment within the AI and crypto sectors. A positive report from Nvidia could catalyze a wave of enthusiasm, potentially bolstering investments in AI-dedicated cryptocurrencies. Fetch.AI (FET) Eyes A 500% Rally Van Lagen&#8217;s chart showcases a massive inverse &#8216;Head and Shoulders&#8217; (H&#38;S) pattern, consisting of three troughs: the left shoulder formed in early 2022, the head reached its nadir at the end of 2022, and the right shoulder developed in August 2023. Related Reading: Fetch AI Breakout Confirmed: Analysts Reveal Bullish Targets For FET Price The pattern is characterized by a &#8216;neckline,&#8217; which is a resistance level that the price must surpass to confirm the reversal. For Fetch.AI, the neckline is situated around the $0.5 mark, a threshold that was successfully retested as support in January 2024. This retest is seen as a bullish confirmation, reinforcing the integrity of the reversal pattern. A noteworthy element in the analysis is the decisive breakout from the green Fibonacci resistance zone last week. The Fibonacci retracement tool is commonly used to ascertain potential support and resistance zones, and a breach beyond these confines typically suggests a strong market conviction. Related Reading: OpenAI Setback No Match For FET’s 160% Surge: Time To Invest In AI? Thus, Fetch.AI has not only surmounted the neckline but has also made strides past the resistance zone, paving the way for the asset to strive towards new all-time highs. Van Lagen has calculated a technical target for the iH&#38;S pattern at $5.5, extrapolated from the depth of the pattern&#8217;s head to the neckline, and projected upwards from the breakout point. The analyst has also stipulated a condition for the invalidation of this bullish scenario: should Fetch.AI print a &#8216;lower low&#8217; (LL), it would disrupt the structure of the iH&#38;S pattern and potentially signal a bearish shift in the market&#8217;s sentiment. He summarizes: FET [1W] &#8211; Head and Shoulders bottom playing out neatly: + Dec-23 breakout of the right shoulder &#38; the green Fib resistance zone; + Jan-24 multi-week successful retest of the neckline; + Feb-24 clearance for new ATHs Technical target iH&#38;S: $5.5 Invalidation: print LL At press time, FET traded at $0.92. Featured image from MEXC Blog, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-19T19:05:25.000Z",
    "title": "Whale Abruptly Accumulates 54,721 Ethereum Worth $154,400,000 in Just 32 Hours: On-Chain Data",
    "url": "https://dailyhodl.com/2024/02/19/whale-abruptly-accumulates-54721-ethereum-worth-154400000-in-just-32-hours-on-chain-data/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Ethereum-To-Massively-Underperform.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Ethereum-To-Massively-Underperform.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Ethereum-To-Massively-Underperform.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Ethereum-To-Massively-Underperform.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Ethereum-To-Massively-Underperform.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Ethereum-To-Massively-Underperform.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Ethereum-To-Massively-Underperform.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto whale has been spotted rapidly accumulating nine figures worth of Ethereum (ETH) in less than a day and a half. First reported by blockchain tracker Lookonchain, an unknown entity withdrew 54,721 ETH worth $154.4 million from crypto exchange Binance and decentralized exchanges (DEXes). Based on the history of the address in question, Lookonchain [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/19/whale-abruptly-accumulates-54721-ethereum-worth-154400000-in-just-32-hours-on-chain-data/\">Whale Abruptly Accumulates 54,721 Ethereum Worth $154,400,000 in Just 32 Hours: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]