[
  {
    "source": "CoinDesk",
    "date": "2023-10-31T20:47:48.000Z",
    "title": "AI-Related Tokens Stumble After White House Executive Order",
    "url": "https://www.coindesk.com/markets/2023/10/31/ai-related-tokens-stumble-after-white-house-executive-order/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Issued Monday, President Biden's executive order is aimed at potential threats posed by artificial intelligence, but critics of the White House action wonder if innovation could be stifled."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-31T20:57:02.000Z",
    "title": "Twitch Is 'Safest' Platform for Streamers Says Exec as Rival Kick Gains Steam",
    "url": "https://decrypt.co/203913/twitch-safest-platform-streamers-says-exec-rival-kick-gains-steam",
    "description": "Should streamers go green or keep bleeding purple? Twitch exec Mary Kish weighs in on simulcasting and safety on the biggest livestreaming platform."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-31T20:40:00.000Z",
    "title": "Twitch CEO Dan Clancy Is a 'Wild Card,' Says Marketing Director",
    "url": "https://decrypt.co/videos/interviews/qCOCtPKe/twitch-ceo-dan-clancy-is-a-wild-card-says-marketing-director",
    "description": "Twitch Senior Director of Community Marketing Mary Kish speaks with Decrypt's Kate Irwin about Twitch CEO Dan Clancy, Ninja, Twitch's new simulcasting rules, the biggest differences between Twitch and rival platform Kick, and the role of esports on the streaming platform."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-31T20:45:00.000Z",
    "title": "Bitcoin futures data highlight investors’ bullish view, but there’s a catch",
    "url": "http://cointelegraph.com/news/bitcoin-futures-highlight-investors-bullish-view-but-theres-a-catch",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/7c6d6a82-a2a1-4107-9cb2-995cd3f87c0e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The stars are lining up for Bitcoin price, but a few major price threats remain in play.  </p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price surged by 26.5% in October and several indicators hit a one-year high, including the BTC futures premium and the Grayscale GBTC discount. </p><p>For this reason, it's challenging to present a bearish thesis for BTC as data reflects the post-FTX-Alameda Research collapse recovery period and is also influenced by the recent increase in interest rates by the U.S. Federal Reserve.</p><p>Despite the positive indicators, Bitcoin price still remains around 50% below its all-time high of $69,900 which was hit in November 2021. In contrast, gold is trading just 4.3% below its $2,070 level from March 2022. This stark difference diminishes the significance of Bitcoin's year-to-date gains of 108% and highlights the fact that Bitcoin's adoption as an alternative hedge is still in its early stages.</p><p>Before deciding whether the improvement in Bitcoin futures premium, open interest and the GBTC fund premium signal a return to the norm, or the initial signs of institutional investors' interest, it's essential for investors to analyze the macroeconomic environment.</p><h3>The U.S. budget issue sparks Bitcoin’s institutional hope</h3><p>On Oct. 30, the U.S. Treasury announced plans to auction off $1.6 trillion of debt over the next six months. However, the <a href=\"https://www.cnbc.com/2023/10/31/treasury-refunding-debt-announcement-all-eyes-on-it-before-fed.html\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-cnbc-com.cdn.ampproject.org/c/s/www.cnbc.com/amp/2023/10/31/treasury-refunding-debt-announcement-all-eyes-on-it-before-fed.html\">key factor</a> to watch is the size of the auction and the balance between shorter-term Treasury bills and longer-duration notes and bonds, according to CNBC.</p><p>Billionaire and Duquesne Capital founder Stanley Druckenmiller criticized Treasury Secretary Janet Yellen's focus on shorter-term debt, calling it \"the biggest blunder in the history of the Treasury.\" This unprecedented increase in the debt rate by the world's largest economy has led Druckenmiller to praise <a href=\"https://cointelegraph.com/news/legendary-investor-stanley-druckenmiller-wants-bitcoin\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/legendary-investor-stanley-druckenmiller-wants-bitcoin/amp\">Bitcoin as an alternative store of value.</a></p><p>The surge in Bitcoin futures open interest, reaching its highest level since May 2022 at $15.6 billion, can be attributed to institutional demand driven by inflationary risks in the economy. Notably, the CME has become the second-largest trading venue for Bitcoin derivatives, with $3.5 billion notional of BTC futures.</p><p>Moreover, the Bitcoin futures premium, which measures the difference between 2-month contracts and the spot price, has reached its highest level in over a year. These fixed-month contracts typically trade at a slight premium to spot markets, indicating that sellers are requesting more money to delay settlement.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/173bfe1f-c563-4673-8eb7-e3abcf622ab3.png\"><figcaption style=\"text-align: center;\"><em>Bitcoin 2-month futures annualized premium. Source: Laevitas</em></figcaption></figure><p>The demand for leveraged BTC long positions has significantly increased, as the futures contract premium jumped from 3.5% to 8.3% on Oct. 31, surpassing the neutral-to-bullish threshold of 5% for the first time in 12 months.</p><p>Further bolstering the speculation of institutional demand is Grayscale's GBTC fund discount narrowing the gap to the equivalent underlying BTC holdings. This instrument was trading at a 20.7% discount on Sept. 30 but has since reduced this deficit to 14.9% as investors anticipate a higher likelihood of a spot Bitcoin exchange-traded fund (ETF) approval in the U.S.</p><h3>Not everything is rosy for Bitcoin, and exchange risks loom</h3><p>While the data seems undeniably positive for Bitcoin, especially when compared to previous months, investors should take exchange-provided numbers with caution, particularly when dealing with unregulated derivatives contracts.</p><p>The U.S. interest rate has surged to 5.25%, and exchange risks have escalated post-FTX, making the 8.6% Bitcoin futures premium less bullish. For comparison, the CME Bitcoin annualized premium stands at 6.8%, while Comex gold futures trade at a 5.5% premium, and CME's S&P 500 futures trade at 4.9% above spot prices.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/will-weakness-in-magnificent-7-stocks-spread-to-bitcoin-price\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/will-weakness-in-magnificent-7-stocks-spread-to-bitcoin-price/amp\">Will weakness in Magnificent 7 stocks spread to Bitcoin price?</a></em></strong></p><p>The Bitcoin futures premium, in the broader context, is not excessively high, especially considering that Bloomberg analysts give a<a href=\"https://cointelegraph.com/news/what-happens-if-sec-appeal-grayscale-spot-bitcoin-etf-ruling\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/what-happens-if-sec-appeal-grayscale-spot-bitcoin-etf-ruling/amp\"> 95% chance of approval for a Bitcoin spot ETF</a>. Investors are also mindful of the general risks in cryptocurrency markets, as highlighted by U.S. Senator Cynthia Lummis's call for the Justice Department to take<a href=\"https://cointelegraph.com/news/cynthia-lummis-charge-binance-tether-illicit-activities\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cynthia-lummis-charge-binance-tether-illicit-activities/amp\"> \"swift action\" against Binance and Tether.</a></p><p>The approval of a spot Bitcoin ETF could trigger sell pressure from GBTC holders. Part of the $21.4 billion in GBTC holdings will finally be able to exit their positions at par after years of limitations imposed by Grayscale's administration and exorbitant 2% yearly fees. In essence, the positive data and performance of Bitcoin reflect a return to the mean rather than excessive optimism.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-31T20:50:19.000Z",
    "title": "Bernstein anticipates $150k Bitcoin by 2025",
    "url": "https://cryptoslate.com/bernstein-anticipates-150k-bitcoin-by-2025/",
    "description": "<p>Financial brokerage firm Bernstein predicts that Bitcoin (BTC) could reach a staggering high of $150,000 during the 2024-2027 cycle. $150k BTC According to commentators, Bernstein&#8217;s report highlighted the cyclical nature of Bitcoin price cycles, which typically follow four-year patterns coinciding with Bitcoin halving events. With the next Bitcoin halving expected in April 2024, the report [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bernstein-anticipates-150k-bitcoin-by-2025/\">Bernstein anticipates $150k Bitcoin by 2025</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-31T21:00:00.000Z",
    "title": "Coin Bureau’s 10 Steps to Wealth Generation",
    "url": "https://www.cryptoglobe.com/latest/2023/10/coin-bureaus-10-steps-to-wealth-generation/",
    "description": "Introduction In a video released earlier today by Coin Bureau, hosted by Guy Turner, viewers are offered a comprehensive guide on how to get rich. The video emphasizes that while becoming wealthy is not easy, it is achievable. Guy Turner shares insights he has gained from spending time with wealthy individuals, outlining a 10-step plan […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-31T20:49:00.000Z",
    "title": "XRP Weekly Price Chart Shows Bullish Signals, Analyst Says $1.36 is Possible",
    "url": "https://www.cryptoglobe.com/latest/2023/10/xrp-weekly-price-chart-shows-bullish-signals-analyst-says-1-36-is-possible/",
    "description": "A well-known cryptocurrency analyst on the microblogging platform X (formerly known as Twitter) has recently forecast a significant bullish $XRP price prediction after examining the token’s latest market activity. The ananlyst suggested the cryptocurrency could rise to as much as $1.36. According to pseudonymous cryptocurrency ananlyst Cryptoinsightuk, the price of XRP will need to keep […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-31T20:45:48.000Z",
    "title": "Benk On Building A Global Financial ‘Super App’",
    "url": "https://news.bitcoin.com/benk-on-building-a-global-financial-super-app/",
    "description": "<img width=\"768\" height=\"403\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/photo_2023-10-31_20-36-52-768x403.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/photo_2023-10-31_20-36-52-300x158.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/photo_2023-10-31_20-36-52-1024x538.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/photo_2023-10-31_20-36-52-768x403.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/photo_2023-10-31_20-36-52.jpg 1200w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Today, it&#8217;s exciting to announce the birth of Benk, a pivotal development within the decentralized economy. Benk introduces a secure and user-friendly monetary management system, along with investment prospects in various domains, including startups, stocks, cryptocurrencies, and more. This financial solution is made accessible to a global audience, irrespective of their location. The [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-31T21:00:20.000Z",
    "title": "FTX Transfers $150M In Assets, Including Ethereum And Solana, Amid Bankruptcy",
    "url": "https://www.newsbtc.com/ftx/ftx-transfers-150m-in-assets-including-ethereum-and-solana-amid-bankruptcy/",
    "description": "Blockchain analytics firm Nansen has recently revealed that wallets associated with bankrupt crypto exchange FTX have transferred approximately $156 million worth of digital assets, including Ethereum (ETH) and Solana (SOL), in a series of transactions over the past week.  The movement of these funds has raised concerns and attracted the attention of industry experts and investors. Nansen&#8217;s report sheds light on the ongoing transfers and provides valuable insights into the extent of FTX&#8217;s asset movements. Related Reading: Spot Bitcoin ETF: Here’s The Magic Number To Push BTC Past $40,000 Bankrupt FTX Wallets Unstake $57 Million Worth Of SOL Tokens According to the Nansen report, funds from FTX wallets have continued to migrate to various exchanges since the previous update. The report specifies the following notable transactions: 695,000 Perpetual Protocol (PERP) tokens worth $423,000 767,000 Biconomy (BICO) tokens worth $182,000 833,000 Kyber Network (KNC) tokens worth $616,000 108 million TrueFI (TRU) tokens worth $420,000 138,000 Band (BAND) tokens worth $221,000 2.5 million Graph (GRT) tokens worth $273,000 845 Maker (MKR) tokens worth $1.17 million 7.16 million Render (RNDR) tokens worth $17.8 million 10.5 million USD Coin (USDC) 23,000 Polygon (MATIC) tokens worth $15,000 9.5 million Ren (REN) tokens worth $500,000 1.1 million ETH tokens worth $2 million Additionally, the report highlights that an additional 1.6 million SOL tokens worth $57.6 million have initiated the unstaking process. While these funds have not yet left the associated wallet, their potential movement would bring the total SOL tokens moved by FTX to just under $90 million.  Moreover, considering the unstaking of SOL and the new assets transferred by FTX to Coinbase and Binance, the total value of funds moved by FTX now stands at $156 million. Major Transfers Of LINK, AAVE, And MKR Unveiled Nansen&#8217;s previous investigation revealed significant transfers from wallets linked to FTX and Alameda Research, FTX’s trading arm. These funds were initially withdrawn from FTX and Alameda wallets before being sent to intermediary wallets and eventually deposited into Binance and Coinbase. The report discloses the following noteworthy movements: 2.2 million USD worth of Chainlink (LINK) tokens 1 million USD worth of Aave (AAVE) tokens 2 million USD worth of MKR tokens 3.4 million USD worth of ETH tokens In addition to these transfers, Nansen discovered that 943,000 SOL tokens, equivalent to approximately $32 million, were moved from the FTX Cold Storage wallet. Related Reading: Trader Who Bought Dogecoin In 2017 Maps Out Meteoric 37500% Rise To $26 Overall, the recent findings by Nansen regarding the movement of funds from wallets associated with the bankrupt crypto exchange FTX have sparked concerns within the cryptocurrency community.  The report highlights substantial transfers of various digital assets, including ETH and SOL, and provides insight into the scale of FTX&#8217;s asset movements.  As of the current market conditions, FTX&#8217;s native token, FTT, is trading at $1.23. Despite a false breakout on October 23, where the token briefly surpassed $1,360, it has since declined consistently.  However, over the past 30 days, FTT has maintained a profit margin of 3.7%, signifying relative stability within this time frame. Featured image from Shutterstock, chart from TradingView.com "
  }
]