[
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T02:58:00.000Z",
    "title": "Marathon Digital sees 670% revenue gain in Q3 as Bitcoin production surges",
    "url": "http://cointelegraph.com/news/bitcoin-miner-marathon-digital-uptick-q3-revenue-bitcoin-production-surge",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/95ed4e4a-b32c-4f68-aca6-efbf5525006a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Marathon announced a 467% increase in Bitcoin production year-on-year in the third quarter, while hashrate rose over 400% in the same timeframe. </p>\n                    <p><p>Bitcoin mining firm Marathon Digital Holdings saw its revenue surge $670% year-on-year in the third quarter of 2023, amid a nearly five-fold increase in Bitcoin production.</p><p>The results saw Marathon also swing to a quarterly profit, with $64.1 million of net income in the third quarter, <a href=\"https://ir.mara.com/news-events/press-releases/detail/1333/marathon-digital-holdings-reports-third-quarter-2023-results\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to the firm’s Nov. 8 results filing.</p><p>The firm partly attributed the improved financial results to a 467% spike in Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> production from <a href=\"https://cointelegraph.com/news/bitcoin-mining-firm-marathon-mines-invalid-block-btc\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-mining-firm-marathon-mines-invalid-block-btc/amp\">6.7 mined BTC in Q3 2022</a> to 37.9 BTC in Q3 2023. Similarly, Marathon’s energized hashrate boosted 403% over the same timeframe. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Marathon’s Q3 Earnings Release is here:<br>- Revenue of $97.8M, due to 467% increase in <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&ref_src=twsrc%5Etfw\">#Bitcoin</a> production and higher BTC prices.<br>- Adjusted EBITDA improves to $43.7M.<br>- 8% increase in hash rate; expanding with hydro-powered ventures in Paraguay.<br>- Long-term debt reduced by 56%,…</p>— Marathon Digital Holdings (NASDAQ: MARA) (@MarathonDH) <a href=\"https://twitter.com/MarathonDH/status/1722366712815739308?ref_src=twsrc%5Etfw\">November 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Part of Marathon’s boost in hashrate came from its new, 27-megawatt hydro-powered mining venture in Paraguay, which it <a href=\"https://seekingalpha.com/news/4031910-marathon-digital-builds-out-bitcoin-mining-project-in-paraguay\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> on Nov. 8.</p><p>Marathon’s CEO and chairman Fred Thiel said the “significant progress” has helped strengthen <a href=\"https://cointelegraph.com/news/bitcoin-production-growth-and-capital-strategy-guiding-marathon-digital-ceo\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-production-growth-and-capital-strategy-guiding-marathon-digital-ceo/amp\">the firm’s balance sheet</a> ahead of the <a href=\"https://cointelegraph.com/news/why-2024-bitcoin-halving-play-out-differently-than-previous\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/why-2024-bitcoin-halving-play-out-differently-than-previous/amp\">Bitcoin halving event</a> scheduled for April 2024.</p><p>A $417 million note exchange completed in September managed to reduce Marathon’s long-term debt to 56% and in doing so captured over $100 million in cash savings for shareholders, Thiel noted, adding:</p><blockquote>“For the first time in two years, our combined cash and bitcoin holdings exceeded our debt at the quarter's end.”</blockquote><p>Meanwhile, Marathon remains committed to increasing its hashrate in the short to mid-term. </p><p>Its installed hashrate currently sits at 23.1 exahashes per second but the firm is looking to boost that to 26 EH/s and a further 30% in 2024.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/marathon-riot-most-overvalued-mining-stocks-minermetrics\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/marathon-riot-most-overvalued-mining-stocks-minermetrics/amp\"><strong><em>Marathon, Riot among most overvalued Bitcoin mining stocks: Report </em></strong></a></p><p>Marathon’s (MARA) share price fell 6.9% to $8.55 on Nov. 8 but rebounded 4.3% in after-hours trading following the release of Marathon’s earnings statement, <a href=\"https://www.google.com/finance/quote/MARA:NASDAQ\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Google Finance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/9dbc48e7-ef10-4efe-a1be-2d3268757663.png\"><figcaption style=\"text-align: center;\"><em>MARA’s change in share price on Nov. 8 (including after-hours trading). Source: Google Finance<strong>.</strong></em></figcaption></figure><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh </em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T02:49:11.000Z",
    "title": "SAG-AFTRA Approves Deal to End Actors Strike, Secures AI Protections and Historic Pay Increase",
    "url": "https://www.cryptopolitan.com/sag-aftra-deal-actors-strike-ai-protections/",
    "description": "In a momentous turn of events, the Screen Actors Guild‐American Federation of Television and Radio Artists (SAG-AFTRA) has reached a groundbreaking deal, marking the end of the longest actors strike in Hollywood history after a grueling 118 days.&#160; The union&#8217;s negotiating committee has unanimously approved a tentative agreement, introducing unprecedented protections for actors against artificial ... <a title=\"SAG-AFTRA Approves Deal to End Actors Strike, Secures AI Protections and Historic Pay Increase\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sag-aftra-deal-actors-strike-ai-protections/\" aria-label=\"More on SAG-AFTRA Approves Deal to End Actors Strike, Secures AI Protections and Historic Pay Increase\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-09T03:08:50.000Z",
    "title": "Bitcoin Price Breaks $36K – Is This Start of A Fresh Rally?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-breaks-36k/",
    "description": "Bitcoin price finally cleared the $36,000 resistance. BTC is showing positive signs and might continue to rise toward the $37,500 resistance. Bitcoin gained pace for a move above the $36,000 resistance zone. The price is trading above $36,000 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support near $35,800 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair is consolidating gains and might continue to rise toward $37,500. Bitcoin Price Spikes Higher Bitcoin price remained well-bid above the $35,000 support zone. BTC formed a base above the $35,500 zone and finally started a decent increase. It broke the key hurdle at $36,000 to start a fresh rally. There was a spike toward the $36,500 level. A high is formed near $36,525 and the price is now consolidating gains. It is trading above the 23.6% Fib retracement level of the upward move from the $35,100 swing low to the $36,525 high. Bitcoin is also trading above $36,000 and the 100 hourly Simple moving average. Besides, there is a key bullish trend line forming with support near $35,800 on the hourly chart of the BTC/USD pair. The trend line is near the 50% Fib retracement level of the upward move from the $35,100 swing low to the $36,525 high. Source: BTCUSD on TradingView.com On the upside, immediate resistance is near the $36,500 level. The next key resistance could be near $37,000, above which the price might accelerate further higher. In the stated case, it could test the $37,500 level. Any more gains might send BTC toward the $38,000 level. Are Dips Limited In BTC? If Bitcoin fails to rise above the $36,500 resistance zone, it could start a downside correction. Immediate support on the downside is near the $36,150 level. The next major support is near the $35,800 zone or the trend line. If there is a move below $35,800, there is a risk of more downsides. In the stated case, the price could decline toward the key support at $35,000 in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $36,150, followed by $35,800. Major Resistance Levels – $36,500, $37,000, and $37,500."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-09T03:00:16.000Z",
    "title": "Analyst Endorses MATIC, Time To Double Down On Polygon And Ethereum Layer-2 Tokens?",
    "url": "https://www.newsbtc.com/matic/analyst-endorses-matic-double-down-polygon-ethereum-layer-2-tokens/",
    "description": "Ryan Sean Adams, a vocal Ethereum commentator and crypto investor, is bullish on MATIC, the native token of Polygon. Taking to X on November 8, Adams said MATIC should be a top-10 crypto asset, adding that people are asleep on layer-2s. Polygon (MATIC) Remains In An Uptrend When writing on November 8, MATIC is among the top 15 most valuable coins by market cap. It also remains volatile, fluctuating, and moving up and down the market cap leaderboard rankings. Even so, considering its spot valuation exceeding $7.3 billion according to CoinMarketCap (CMC), a crypto tracker, MATIC remains relatively liquid with a broad user base.  Related Reading: Ethereum Failed Transactions: You Won’t Believe How Much Users Have Lost Etherscan data on November 8 shows that there are 629,967 MATIC holders, down roughly 2%, but the number remains higher despite the contraction following the crypto winter of 2022, which spilled over to 2023. As of November 8, MATIC is up 60% from September 2023 lows. According to CMC, the coin is also up 13% on the last trading day, pushing weekly gains to over 27%. Looking at the candlestick arrangement in the daily chart, the uptrend momentum is strong, and buyers appear to be doubling down. Presently, bull bars are aligned along the upper BB, suggesting that there is intense buying pressure. At the same time, MATIC is within a bullish breakout formation, breezing past August highs.  Polygon, a sidechain, is among the many scaling solutions for Ethereum. The platform is compatible with Ethereum, allowing protocols to build on Polygon while enjoying the high activity and security of the first smart contract network. Polygon is also considered a layer-2, though it isn&#8217;t technically a layer-2 since it doesn&#8217;t depend on roll-ups like Arbitrum or OP Mainnet. Time To Double Down On MATIC And Layer-2 Tokens In Adams&#8217; view, considering layer-2 tokens, including MATIC or ARB, at spot levels could translate to more gains in the next bull run. Nonetheless, it should be noted that MATIC, for instance, is down 72% from 2021 highs. Moreover, the coin is trending inside June&#8217;s bear trade range. A comprehensive close above this level may signal the end of the bear run, possibly anchoring buyers targeting $1.5. In late October, Polygon Labs officially launched the POL, a token that will prime Polygon 2.0, Ethereum, signaling the first steps to see MATIC gradually phased out. POL will serve more roles in Polygon 2.0, specifically powering an ecosystem of zero knowledge-based layer-2 chains using Polygon&#8217;s infrastructure. News of this smart contract launch seemed to have catalyzed demand, driving token prices higher. Related Reading: Shiba Inu Price Eyes Key Resistance, Poised For November Surge Feature image from Canva, chart from TradingView"
  }
]