[
  {
    "source": "CoinDesk",
    "date": "2023-07-14T04:17:02.000Z",
    "title": "XRP Short Traders Log Highest Losses in 2023 After Landmark Court Ruling",
    "url": "https://www.coindesk.com/markets/2023/07/14/xrp-short-traders-log-highest-losses-in-2023-after-landmark-court-ruling/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "XRP token market capitalization has jumped to over $40 billion, its largest level since April 2022."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-14T04:18:58.000Z",
    "title": "XRP Price Retreats After Massive 80% Rally, Buy The Dips?",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-retreats-rally-0-95/",
    "description": "XRP price rallied over 80% after the court’s ruling and jumped above $0.80 against the US Dollar. It tested the $0.95 zone and is currently correcting gains. Ripple’s token price surged above the $0.65 and $0.80 resistance levels against the US dollar. It is trading well above $0.5000 and the 100-day simple moving average. There was a break above a major bearish trend line with resistance near $0.50 on the daily chart of the XRP/USD pair (data source from Kraken). The pair is currently correcting gains but the bulls might be active near $0.70. Ripple’s XRP Price Surges Over 80% After the court’s verdict in favor of Ripple, XRP saw a monster rally above the $0.45 resistance. It broke many hurdles near $0.50, dragging Bitcoin and Ethereum high as well. There was a break above a major bearish trend line with resistance near $0.50 on the daily chart of the XRP/USD pair. It opened the doors for a strong increase above the $0.65 resistance. The price gained over 80% and even spiked toward the $0.95 level. A high is formed near $0.9479 and the price is now correcting gains. It is trading below the 23.6% Fib retracement level of the upward move from the $0.4460 swing low to the $0.9479 high. XRP is still well above $0.5000 and the 100-day simple moving average. Immediate resistance is near the $0.85 level. The first major resistance is seen near the $0.92 level, above which the price might revisit the $0.95 resistance zone. Source: XRPUSD on TradingView.com The main barrier could be near the $1 level. A clear break above the $1 resistance could open the doors for a sharp increase toward the $1.10 resistance. The next major resistance above the $1.10 level could be near the $1.20 level. Are Dips Supported? If XRP fails to clear the $0.850 resistance, it could continue to move down. Initial support on the downside is near the $0.750 level. The first major support could be near the $0.70 level or the 50% Fib retracement level of the upward move from the $0.4460 swing low to the $0.9479 high. If the price fails to stay above $0.70, it could start another major decline toward $0.55. Technical Indicators Daily MACD – The MACD for XRP/USD is now losing momentum in the bullish zone. Daily RSI (Relative Strength Index) – The RSI for XRP/USD is in the overbought zone. Major Support Levels – $0.7500, $0.7000 and $0.6500. Major Resistance Levels – $0.8500, $0.9200 and $0.9500."
  }
]