[
  {
    "source": "Crypto Daily",
    "date": "2023-06-26T07:00:00.000Z",
    "title": "Maverick Protocol Secures $9m, Binance and Coinbase Among Backers",
    "url": "https://cryptodaily.co.uk/2023/06/maverick-protocol-secures-9m-binance-and-coinbase-among-backers",
    "description": "<p class=\"md-end-block md-p\">DeFi infrastructure startup Maverick Protocol has raised an estimated $9 million from a funding round. Among its investors are Pantera Capital, Binance, Coinbase, and Apollo Crypto.</p>\n<p class=\"md-end-block md-p md-focus\">In its page on Medium, the startup said that the latest funding round is aimed at expanding its ecosystem and build more efficient Liquid Staking Token (LST) Infrastructure, enable deployment to other chains, and subsequently attract new players and projects to its ecosystem.</p>\nUnderstanding Maverick's Liquid Staking Token Infrastructure\n<p class=\"md-end-block md-p\">Maverick Protocol, a DeFi infrastructure startup, has shown considerable potential in its aim to revolutionize the decentralized finance landscape. One of the critical aspects of its infrastructure that the firm plans to enhance is its Liquid Staking Token (LST) Infrastructure.</p>\n<p class=\"md-end-block md-p\">Liquid staking represents an innovative approach within the blockchain and DeFi space. Traditionally, staking involves participants locking up their cryptocurrencies to support operations such as block validation on a proof-of-stake (PoS) blockchain. In return, stakers receive rewards. However, staked tokens often remain locked and inactive, reducing their utility within the wider crypto ecosystem.</p>\n<p class=\"md-end-block md-p\">This is where liquid staking comes into play. It allows users to stake their tokens and still maintain their liquidity. In essence, when users stake their tokens, they receive a representative token in return. This representative or 'liquid' token can be freely traded, providing the holder with liquidity while the original tokens remain staked.</p>\n<p class=\"md-end-block md-p\">By prioritizing an efficient LST infrastructure, Maverick is aiming to optimize capital efficiency. This infrastructure could enable the deployment of its services to other chains, broadening Maverick's ecosystem and attracting new players and projects.</p>\nMaverick&rsquo;s Steps Towards Improving DeFi Infrastructure\n<p class=\"md-end-block md-p\">The second phase was the introduction of Boosted Positions just last May which it defined as a &ldquo;set of incentivization tools for token projects hat provided token projects with greater control over liquidity.&rdquo; Its latest phase, introduced just a day ago, unveiled its own voting-escrow (ve) model that enable voting on liquidity positions through its own MAV token.</p>\n<p class=\"md-end-block md-p\">Last March, Maverick also launched its own exchange which, as of writing, has amassed $40.9 million in total value locked, according to aggregated blockchain data from CoinMarketCap. The protocol was also recently introduced alongside the Binance Launchpool program. Maverick has been steadily charting its own course in improving DeFi infrastructure and it remains optimistic for its future.</p>\n\n<p class=\"md-end-block md-p\">&ldquo;Down the road, Maverick will also announce more ecosystem partners and explore more cross-chain opportunities to enable market efficiency across the whole industry,\" the firm said.</p>\n\n<p class=\"md-end-block md-p\">'Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T07:03:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-26T06:45:42.000Z",
    "title": "Few Things To Pay Attention To In The Lead-up To Litecoin’s Halving",
    "url": "https://nulltx.com/few-things-to-pay-attention-to-in-the-lead-up-to-litecoins-halving/",
    "description": "The next Litecoin halving is scheduled to occur on August 2, 2023, that&#8217;s barely 37 days to go from today.  This event will reduce the block reward for Litecoin miners by 50%, from 12.5 LTC to 6.25 LTC. Halvings are a significant event in the Litecoin ecosystem, as they have historically been followed by price [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-26T07:05:00.000Z",
    "title": "Uniswap (UNI) Price Rockets 22% – Is There More Fuel In The Tank?",
    "url": "https://www.newsbtc.com/news/uniswap-uni-price-rockets-22-is-there-more-fuel-in-the-tank/",
    "description": "Uniswap (UNI) has emerged as a formidable force within the cryptocurrency space, showcasing an impressive growth of 22% in recent weeks. As one of the leading decentralized exchanges (DEX) built on the Ethereum blockchain, Uniswap has gained widespread recognition for its innovative approach to facilitating peer-to-peer token swaps.  With its unique automated market maker (AMM) model and emphasis on user empowerment, Uniswap has become a go-to platform for traders and liquidity providers alike. The significant surge in UNI&#8217;s value begs the question: does it have enough fuel to climb higher? Uniswap Optimism Incentives Contributes To UNI Rally A recent UNI report has highlighted that Uniswap&#8217;s incentives on the Optimism network (OP) have generated diverse outcomes when it comes to liquidity and the decentralized finance (DeFi) sector. While the effectiveness of these incentives may have varied, the price of UNI has demonstrated a strong bullish trend on the charts. Over the past 24 hours, UNI has experienced a significant rally, with its price reaching $5.46 on CoinGecko, marking an impressive 15.3% increase. UNI price hits the 15.3 mark. Source: Coingecko Additionally, in the span of the last seven days, UNI has likewise demonstrated remarkable growth, surging by nearly 22%. These substantial price gains indicate a positive market sentiment surrounding UNI and suggest the potential for further upward movement. UNI price movement in the last seven days. Source: Coingecko Impact Of Decreased UNI Supply On Exchanges On-chain data analysis has unveiled a significant drop in Uniswap&#8217;s supply on exchanges during early June, followed by a period of sideways movement from mid-June onwards. This data suggests that the selling pressure on UNI has eased in the short term, as the amount of UNI being moved to centralized exchanges (CEX) for offloading has decreased. The decrease in UNI supply on exchanges implies that holders are becoming less inclined to sell their tokens in the immediate term. This reduction in selling pressure could have positive implications for the price of UNI, as a lower supply available for trading may create a more favorable supply-demand dynamic. UNI market cap currently at $3.13 billion on the daily chart at TradingView.com Additionally, the sideways movement of UNI on exchanges indicates a potential shift in market sentiment. Investors and traders may be adopting a more long-term approach to holding UNI, considering the potential for further price appreciation or the desire to participate in the governance and staking mechanisms provided by Uniswap. #UNI is one of my small wallet, investing about $5,000. but who knows, this can give 10x or 50x one day. What attracted me to this coin is its max supply of 1B, check coingecko info, and it&#8217;s a utility. Hence it satisfies investment criteria. #uniswap pic.twitter.com/FX6PZzAi50 — Prof. Smalltimer (@RJinvestcoin) June 25, 2023 This shift in UNI supply and trading behavior highlights the evolving dynamics within the Uniswap ecosystem. With reduced short-term selling pressure and a potential increase in long-term holding, UNI&#8217;s price stability and upward potential may be bolstered. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Alamy"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-26T07:04:04.000Z",
    "title": "Seasoned Trader Tone Vays Predicts Rallies for Bitcoin, Says BTC in Full Bullish Mode – Here’s Are His Targets",
    "url": "https://dailyhodl.com/2023/06/26/seasoned-trader-tone-vays-predicts-rallies-for-bitcoin-says-btc-in-full-bullish-mode-heres-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-Could-Plunge-50.png?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-Could-Plunge-50.png 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-Could-Plunge-50.png?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-Could-Plunge-50.png?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-Could-Plunge-50.png?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-Could-Plunge-50.png?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-Could-Plunge-50.png?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Veteran crypto trader Tone Vays is predicting upcoming rallies for Bitcoin (BTC), saying that the crypto king is in full-on bullish mode. In a new strategy session, the seasoned analyst tells his 123,000 YouTube subscribers that the top crypto asset by market cap is flashing signs that it is set to burst to the upside. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/26/seasoned-trader-tone-vays-predicts-rallies-for-bitcoin-says-btc-in-full-bullish-mode-heres-are-his-targets/\">Seasoned Trader Tone Vays Predicts Rallies for Bitcoin, Says BTC in Full Bullish Mode – Here’s Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]