[
  {
    "source": "Cointelegraph",
    "date": "2023-06-28T12:00:00.000Z",
    "title": "Bitcoin no longer crypto of choice for illicit crypto activity: TRM Labs",
    "url": "https://cointelegraph.com/news/bitcoin-btc-no-longer-favored-illicit-crypto-activity-trm-labs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/6f0dacb6-41fb-4433-9f04-908315089e59.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>While fiat channels remain the dominant tool for criminal financing, Bitcoin appears to have fallen out of favor for criminals as far as cryptocurrencies go.</p>\n                    <p><p>According to new research, fewer cybercriminals are turning to Bitcoin as their primary method of moving illicit funds, with bad actors opting to go back to fiat channels or choosing other cryptocurrencies.</p><p>Digital asset compliance and risk management firm TRM Labs revealed that illicit finance volumes involving Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) had fallen significantly over the past seven years, according to its “Illicit Crypto Ecosystem Report,” released on June 28. </p><p>TRM Labs said instead a new multichain era has led to a “qualitative leap” away from Bitcoin as a primary means of moving criminal proceeds. The firm also highlighted that cash and other forms of fiat-related finance remain the “default” means of criminal money movements.</p><blockquote>“Indeed, cash and even older forms of finance such as hawala (transferring money without physically moving it) remain the default means by which illicit activity is financed and its proceeds are laundered.”</blockquote><p>TRM Labs also noted that while illicit activity involving crypto has increased, “crypto did not invent these criminal forms.\"</p><p>The firm reported that around $2 billion in crypto was stolen through attacks on cross-chain bridges in 2022, but very little of that was Bitcoin.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/3f07c52a-9339-426a-845a-fd5723638421.PNG\"  /><figcaption style=\"text-align: center;\"><em>Charts showing the volume of Bitcoin used across various types of illicit activity. Source: TRM Labs</em></figcaption></figure><p>“The multi-chain era has had a sweeping impact on the distribution of illicit crypto volume as a whole,” it noted, adding that Bitcoin’s share of illicit transactions plummeted from 97% in 2016 to just 19% in 2022.</p><p>Furthermore, while two-thirds of the <a href=\"https://cointelegraph.com/news/the-10-largest-crypto-hacks-and-exploits-in-2022-saw-2-1b-stolen\">crypto hack</a> volume was in Bitcoin back in 2016, that had fallen to just under 3% by 2022. The slack was taken up by Ethereum (68%) and BNB Smart Chain (19%), it said.</p><p>Meanwhile, Bitcoin was also once the “exclusive currency” for terrorist financing back then as well, but by 2022 it had been “all but replaced” by Tron, with 92%, TRM Labs claims.</p><p>Additionally, TRM Labs claims that there has been a 240% increase in the use of Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) among the terror financing entities that it tracked in 2022. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/730aa220-ea04-4674-9eff-f4621de1ce40.jpg\"  /><figcaption style=\"text-align: center;\"><em>Use of USDT and BTC for terrorist financing. Source: TRM Labs</em></figcaption></figure><p>The latest illicit finance figures in crypto may be brighter news for Bitcoin, which in recent days looks to be <a href=\"https://cointelegraph.com/news/bitcoin-hits-28-000-after-blackrock-files-for-btc-etf\">back on the table for institutional adoption</a>.</p><p>However, the cryptocurrency saw at least $7.8 billion paid into Ponzi and pyramid schemes, as much as $1.5 billion was spent on darknet markets specializing in narcotics, and $3.7 billion was stolen through DeFi hacks and exploits in 2022, according to TRM Labs.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/north-korea-and-criminals-are-using-defi-services-for-money-laundering-us-treasury\"><strong><em>North Korea and criminals are using DeFi services for money laundering</em></strong></a></p><p>Earlier this year, Cointelegraph reported that <a href=\"https://cointelegraph.com/news/illicit-crypto-transactions-reached-all-time-highs-in-2022-report\">2022 set a new record for illicit crypto transactions</a>. The total cryptocurrency value received by illicit addresses topped $20 billion last year, according to analytics firm Chainalysis.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-analyst-21-anthony-pompliano-william-clemente-crypto-twitter-hall-of-flame/\"><strong><em>Hall of Flame: William Clemente III tips Bitcoin will hit six figures toward end of 2024</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-28T12:01:45.000Z",
    "title": "FTX invites investors to register interest to restart rebranded exchange – report",
    "url": "https://cryptoslate.com/ftx-invites-investors-to-register-interest-to-restart-rebranded-exchange-report/",
    "description": "<p>Investors eager to help FTX reboot its global exchange must register their initial interest this week, the Wall Street Journal reported on June 28, citing sources familiar with the matter. FTX CEO John J. Ray III said that FTX &#8220;has begun the process of soliciting interested parties to reboot the FTX.com exchange,&#8221; as per the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ftx-invites-investors-to-register-interest-to-restart-rebranded-exchange-report/\">FTX invites investors to register interest to restart rebranded exchange &#8211; report</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-28T11:55:00.000Z",
    "title": "Azuki Elementals Sells Out In Record Time",
    "url": "https://cryptodaily.co.uk/2023/06/azuki-elementals-sells-out-in-record-time",
    "description": "<p>The much-awaited Azuki Elementals NFT collection has sold out in a record 15 minutes and has raked in a whopping $38 million.&nbsp;</p>\nElementals Rakes In $38M In Presale\n<p>The fervor around Azuki Elementals has resulted in the collection being whisked off just 15 minutes after its drop. The third iteration of the highly popular Azuki universe, the Elementals collection, covers four different domains - Lightning, Earth, Water, and Fire. Although there were 20,000 NFTs in the collection, they did not even make it to the public sale market. The first 10,000 NFTs were directly airdropped to Azuki holders during the recent Vegas event. The remaining 10,000 NFTs were put up for presale, first for Azuki holders and ten minutes later for Beanz holders. The initial plan was to follow the presale up with a public auction. However, the entire collection got sold out within 15 minutes of minting for 20,000 ETH, which is around $38 million.&nbsp;</p>\nFrustration And Disappointment?&nbsp;\n<p>The minting process evoked diverse responses, with numerous individuals, primarily Azuki holders, expressing joy and satisfaction over their successful minting experience. However, there was an overwhelming sense of frustration from those who were unable to secure a mint and disappointment from those who were not happy with the NFTs themselves.&nbsp;</p>\n<p>Since there was no minting cap imposed on the presale, many Azuki holders took the opportunity to mint more than 10 NFTs, with one user minting a total of 332 Elementals. As a result, even many Beanz holders were unable to participate.&nbsp;</p>\n<p>Plus, many users commented on the Elementals collection, claiming that the anime art bore a striking resemblance to the original Azuki collection.&nbsp;</p>\nAzuki&rsquo;s Response\n<p>The Azuki team has taken the negative feedback in its stride and responded to it on Twitter, claiming that the goal was to create characters that felt consistent with the Azuki aesthetic while offering something new by introducing the domains and the unique traits and features tied to the specific domains.&nbsp;</p>\n<p>The team wrote,&nbsp;</p>\n\n<p>&ldquo;It's always both challenging &amp; exciting opening up the gate to the Garden. This time, we missed the mark. We hear you - the mint process was hectic, the PFPs feel similar and, even worse, dilutive to Azuki&hellip;However, our ambitious goals led to a new collection which confused the community on the tangible differences with the original Azuki collection&hellip;Azuki&rsquo;s vision is to build a decentralized brand. Doing so requires great communication and execution, both of which were lacking with the Elementals sale. We know that we lost a piece of trust today, but nothing gets us more motivated to make things right.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T12:05:33.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T11:55:44.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 BREAKING: Twitter to enable #crypto trading in partnership with eToro. Users searching using a $Cashtag symbol currently see live charts for a select few financial assets, like $LTC. Users will soon be able to click through to eToro &#38; have the option to invest in #Litecoin. Is Litecoin silver to Bitcoin&#8217;s ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-28T12:00:00.000Z",
    "title": "Weekly crypto market analysis: TCRV, XMR, and SHIB",
    "url": "https://crypto.news/weekly-crypto-market-analysis-tcrv-xmr-and-shib/",
    "description": "This article looks at the market analysis of three top cryptocurrencies in the market: tradecurve (TCRV), monero (XMR), and shiba inu (SHIB)"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T12:00:16.000Z",
    "title": "Bitcoin Miners Send 315% Of Daily Revenue To Exchanges Recording High Interaction",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-miners-send-daily-revenue-to-exchanges/",
    "description": "In the fast-paced world of Bitcoin mining, recent unusual activity has caught the attention of cryptocurrency watchers. Particularly, a surge in exchange interactions has been observed, with Bitcoin miners sending a record amount to exchanges. Prominent on-chain analytics firm, Glassnode, has been at the forefront of tracking these transactions. In a recent tweet, the firm reported that Bitcoin miners have been engaging in a noteworthy level of interaction with exchanges, transferring an all-time high of $128 million worth of Bitcoin. Exceptional Exchange Activity By Miners The significant update found in this report is the amount of funds involved. According to Glassnode, the $128 million sent to exchanges by Bitcoin miners represents 315% of their daily revenue. The on-chain analytics firm tweeted: Bitcoin Miners are currently recording extremely high Exchange interaction, sending an ATH of $128 million to Exchanges, equivalent to 315% of their daily revenue. Related Reading: Lightning Network Hits Record Highs In Bitcoin And US Dollar Capacity Typically, the transfer of coins from miner or investor wallets to exchanges is perceived as an intention to sell or liquidate coins. However, in this context, it can also be seen as a reflection of optimism about Bitcoin&#8217;s future price potential. Implications And Market Perception The mining revenue in the Bitcoin network is intimately linked with the price of Bitcoin. Therefore, miners tend to increase their sales when they perceive the market to be robust enough to absorb the additional supply. This recent move could indicate strong confidence in the current market strength. Glassnode, in additional tweets, points out a growing trend of strong accumulation and a shift towards self-custody, especially in the wake of the recent LUNA debacle and FTX fallout. This suggests an increasing trend among investors and miners towards maintaining control of their own assets as opposed to relying on third-party custodians. Regardless, Bitcoin has seen a slight decline in the past 24 hours, down by 0.6% with a trading price still above the recently reclaimed $30,000. Prior to the retracement, Bitcoin has since been on an upward trajectory over the past two weeks up by more than 10%. Bitcoin surged from trading below $25,000 amid the intensified regulatory scrutiny from the United States Securities and Exchange Commission (SEC) which eventually affected the world&#8217;s largest crypto exchanges Binance and Coinbase as the US regulator filed a lawsuit against both companies for the offering of unregistered securities. Related Reading: BTC Continues Uptrend As Fidelity Plans To Submit Bitcoin Spot ETF Filing However, weeks following the lawsuit, BTC was quick to recover with more than $100 billion added to its market cap in the last 14 days, up by 16.8%. Interestingly, BTC&#8217;s daily trading volume has recorded a plunge in the past week. The assets&#8217; daily trading volume has declined from a high of $31 billion last Wednesday to a low of $16 billion in the last 24 hours. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T12:02:32.000Z",
    "title": "Shiba Inu Hits Historic Milestone and Prepares to Publish Super Important Worldpaper to Enter the Shibarium Era – Can SHIB Eliminate Another Zero?",
    "url": "https://www.crypto-news-flash.com/shiba-inu-hits-historic-milestone-and-prepares-to-publish-super-important-worldpaper-to-enter-the-shibarium-era-can-shib-eliminate-another-zero/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-hits-historic-milestone-and-prepares-to-publish-super-important-worldpaper-to-enter-the-shibarium-era-can-shib-eliminate-another-zero",
    "description": "Shiba Inu is on the cusp of being a star in the crypto industry with the launch of Shibarium and the release of its whitepaper &#8216;Worldpaper.&#8217; Analysts note that SHIB is one of the most undervalued coins in the market, and now in its accumulation phase is poised for an explosion. Shiba Inu has been [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T12:00:43.000Z",
    "title": "Expert Opinion: Does the Savings DAI Token (sDAI) Hold Potential? What About SPCT’s BRC-20 Standard?",
    "url": "https://www.crypto-news-flash.com/expert-opinion-does-the-savings-dai-token-sdai-hold-potential-what-about-spcts-brc-20-standard/?utm_source=rss&utm_medium=rss&utm_campaign=expert-opinion-does-the-savings-dai-token-sdai-hold-potential-what-about-spcts-brc-20-standard",
    "description": "In the exciting world of digital investments, there are two tokens that hold great promise: VC Spectra (SPCT) BRC-20 standard token SPCT and the savings DAI token sDAI. These tokens offer unique opportunities for people like you to invest and be a part of the growing blockchain and technology industry. Let&#8217;s dive in and see [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T11:56:08.000Z",
    "title": "How To Make Informed Crypto Investment Decisions",
    "url": "https://www.crypto-news-flash.com/how-to-make-informed-crypto-investment-decisions/?utm_source=rss&utm_medium=rss&utm_campaign=how-to-make-informed-crypto-investment-decisions",
    "description": "&#8220;FOMO&#8221; or &#8220;Fear of Missing Out&#8221;. A word we are familiar with as crypto users. With cryptocurrencies revolutionizing the financial landscape and challenging the established financial order, it&#8217;s only natural for savvy investors closely following this trend to experience a sense of FOMO. Some investors believe that seizing and recognizing the potential of these digital [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-28T11:53:23.000Z",
    "title": "Is this the Fastest L2 Chain on Bitcoin?",
    "url": "https://www.altcoinbuzz.io/reviews/is-this-the-fastest-l2-chain-on-bitcoin/",
    "description": "<p>Tectum is the Ultimate Bitcoin Layer-2 Scaling Solution that got instant immutable transactions. 1.3 million TPS. They just announced a launchpad from June 27th to 30th. Source: Twitter Altcoin Buzz General Manager Anindya (Ani) Baidya anchored the Tectum AMA session with Russell Sean, CEO of Tectum Segment 1: Introduction Q &#8211; Please, tell us a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/reviews/is-this-the-fastest-l2-chain-on-bitcoin/\">Is this the Fastest L2 Chain on Bitcoin?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-28T12:00:00.000Z",
    "title": "Saylor: The Next US President Will Be a pro-Bitcoin President",
    "url": "https://coinedition.com/saylor-the-next-us-president-will-be-a-pro-bitcoin-president/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"US pro-Bitcoin President\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/photo_2022-11-23_11-44-44-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>MicroStrategy Founder &#38; Chairman Michael Saylor expressed his belief in a future where the President of the United States fully supports Bitcoin. “The next President will be a pro-Bitcoin President,” Saylor remarked in a recent tweet, citing a post by presidential candidate Robert F. Kennedy. Kennedy&#8217;s tweet emphasized his commitment to ensuring the inviolable right [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/saylor-the-next-us-president-will-be-a-pro-bitcoin-president/\">Saylor: The Next US President Will Be a pro-Bitcoin President</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-28T11:45:20.000Z",
    "title": "Here’s When Bitcoin (BTC) Will Break Above $100,000, According to Crypto Analyst",
    "url": "https://dailyhodl.com/2023/06/28/heres-when-bitcoin-btc-will-break-above-100000-according-to-crypto-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/bitcon-break-above-100.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/bitcon-break-above-100.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/bitcon-break-above-100.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/bitcon-break-above-100.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/bitcon-break-above-100.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/bitcon-break-above-100.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/bitcon-break-above-100.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is predicting when Bitcoin (BTC) will likely hit six figures for the first time in its history. Pseudonymous analyst Kaleo tells his 592,400 Twitter followers that he believes Bitcoin will cross the $100,000 level in late 2024 or in early 2025. “When do you think Bitcoin breaks above $100,000? My [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/28/heres-when-bitcoin-btc-will-break-above-100000-according-to-crypto-analyst/\">Here’s When Bitcoin (BTC) Will Break Above $100,000, According to Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]