[
  {
    "source": "CoinDesk",
    "date": "2024-02-14T04:59:24.000Z",
    "title": "Sandbox’s SAND Slides, ApeCoin Steady Ahead of $125M in Unlocks",
    "url": "https://www.coindesk.com/markets/2024/02/14/sandboxs-sand-slides-apecoin-steady-ahead-of-125m-in-unlocks/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Token unlocks refer to the release of previously locked or restricted tokens into the market."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-14T04:50:07.000Z",
    "title": " Angel Drainer targets users with malicious Safe contract: $403K stolen ",
    "url": "https://cointelegraph.com/news/angel-drainer-attack-gnosis-safe-vault-contract-etherscan",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMTcxYmQ0NDUtNjAxOS00ZTgzLWJkMTYtYWNlY2QzMDZlOTI0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The notorious phishing group deployed a nefarious Safe vault contract that used Etherscan to provide victims with a “false sense of security.”</p>\n                    <p><p>Notorious phishing group Angel Drainer has reportedly stolen over $400,000 from 128 crypto wallets through a new attack vector that has leveraged Etherscan’s verification tool to cover up the malicious nature of a smart contract.</p><p>The attack started at 6:40 am Feb. 12 when Angel Drainer deployed a malicious Safe (formerly Gnosis Safe) vault contract, wrote blockchain security firm Blockaid in a Feb. 13 <a href=\"https://twitter.com/blockaid_/status/1757469197960196322\" target=\"_blank\" rel=\"noopener nofollow\">post</a> to X.</p><p>At total of 128 wallets then signed a “Permit2” transaction on the Safe vault contract, leading to $403,000 in funds being stolen.</p><p><a href=\"https://cointelegraph.com/news/angel-drainer-attack-gnosis-safe-vault-contract-etherscan\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-14T05:00:23.000Z",
    "title": "Bitcoin’s risk-adjusted return potential skyrockets as Sharpe Signal surges",
    "url": "https://cryptoslate.com/bitcoins-risk-adjusted-return-potential-skyrockets-as-sharpe-signal-surges/",
    "description": "<p>On Jan. 26, Glassnode&#8217;s Sharpe Signal hit its lowest level since March 2020. It dropped to 0.2531 from a high of 0.7042 on Jan. 10. However, by Feb. 11, as Bitcoin&#8217;s price crossed $48,000, the Sharpe Signal increased to 0.7371.  This sharp spike in the Sharpe Signal has profound implications for the crypto market, indicating a [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoins-risk-adjusted-return-potential-skyrockets-as-sharpe-signal-surges/\">Bitcoin&#8217;s risk-adjusted return potential skyrockets as Sharpe Signal surges</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-14T04:40:31.000Z",
    "title": "Blockchain Association Critiques Senator Elizabeth Warren’s Crypto AML Bill",
    "url": "https://cryptodaily.co.uk/2024/02/blockchain-association-critiques-senator-elizabeth-warrens-crypto-aml-bill",
    "description": "In a letter to Congress, the cryptocurrency advocacy group Blockchain Association raised several concerns about Senator Elizabeth Warren’s proposed crypto AML bill. The letter received support from 80 individuals, many of whom have been involved with the US military or government."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-14T05:00:37.000Z",
    "title": "Zimbabwe to Launch ‘Structured Currency’ Linked to Gold, Says Finance Minister",
    "url": "https://news.bitcoin.com/zimbabwe-to-launch-structured-currency-linked-to-gold-says-finance-minister/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_310583504-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_310583504-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_310583504-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_310583504-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_310583504-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_310583504-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_310583504-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_310583504.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Zimbabwean government plans to launch what it calls a &#8220;structured currency.&#8221; Some commentators and social media users have expressed skepticism over the government’s latest currency plans. Zimbabwe&#8217;s Structured Currency The Zimbabwean Finance Minister, Mtuli Ncube, has said his government plans to halt the local currency&#8217;s freefall by linking it to gold and establishing a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-14T04:53:40.000Z",
    "title": "Navigating Fraud in 2024 – Advanced Fraud Monitoring and Prevention Strategies",
    "url": "https://www.cryptopolitan.com/2024-advanced-fraud-monitoring-strategies/",
    "description": "In the rapidly evolving digital landscape of 2024, the specter of online fraud looms larger than ever before. With online payment fraud losses doubling since 2021 and a staggering three-quarters of online merchants reporting increased fraud attacks amidst the pandemic, businesses are under immense pressure to fortify their defenses. At the heart of this digital [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-14T05:00:39.000Z",
    "title": "Stacks (STX) Skyrockets Over 43% And Smashes $2 Threshold, Setting Sights On New All-Time Highs",
    "url": "https://www.newsbtc.com/stacks/stacks-stx-skyrockets-over-43-and-smashes-2-threshold-setting-sights-on-new-all-time-highs/",
    "description": "Stacks (STX) has garnered significant attention in the cryptocurrency industry as it emerges as a leading altcoin contender. With an impressive performance surpassing all top 100 tokens, except for Dymension (DYM), Stacks has witnessed a remarkable surge in the past 24 hours, catapulting its value well above the $2 mark and inching closer to its all-time high (ATH) of $2.492.  This surge can be attributed to various factors, including its positioning as a Bitcoin layer for smart contracts, the recent surge in Bitcoin&#8217;s price, and the token&#8217;s adoption and growth rate. Stacks Climbs The Market Cap Rankings As outlined in the project&#8217;s white paper, Stacks serves as a Bitcoin layer for smart contracts, enabling trustless utilization of Bitcoin as an asset in smart contracts and facilitating transaction settlements on the Bitcoin blockchain.  Related Reading: Expert Who Predicted 2021 Bitcoin Peak Expects $600,000 By 2026 The recent surge in Bitcoin&#8217;s price over the past few weeks has also acted as a catalyst for Stacks&#8217; price surge. Currently trading at $2,156, Stacks has experienced a significant recovery from its low of $1,241 during a market downturn that bottomed on January 23.  Notably, this recovery coincided with Bitcoin&#8217;s price rebound from $38,500 to $43,000, highlighting the correlation between the two assets. Market expert Trover.btc, known on X (formerly Twitter), has noted Stacks&#8217; impressive ascent in the market cap rankings. From being ranked around 60, Stacks has climbed to the 34th position within a year, surpassing well-known projects.  With the Bitcoin Layer 2 narrative gaining prominence and Layer 1 network fees reaching all-time highs, expectations are high for Stacks to enter the top 20 rankings around the halving, according to Trevor.btc.  STX Sets All-Time High Total Value Locked  A key metric to consider is its market capitalization (fully diluted) to gauge Stacks&#8217; adoption and growth rate. According to Token Terminal data, Stacks&#8217; market cap has experienced a notable surge of 187% in the past 90 days and an impressive increase of over 527% year-to-date, aligning with the token&#8217;s price surge. Moreover, data from on-chain analytics aggregator DefiLlama reveals that Stacks&#8217; total value locked (TVL) has reached an all-time high of $70.41 million.  This represents a significant increase of over 400% in just four months, highlighting the growing confidence and demand for Stacks within the decentralized finance (DeFi) ecosystem. Related Reading: Ethereum ETF: Franklin Templeton Enters The Fray As ETH Rallies As the demand and interest in the protocol and its native token continue to grow, whether Stacks will surpass its previous all-time high or experience a correction remains to be seen.  The notable correlation between STX and BTC suggests that Bitcoin&#8217;s retracement from its current two-year high could also impact the price of STX. However, the token has significant interest, as reflected in the highlighted metrics above. With the anticipated bull run gaining momentum leading up to the Bitcoin halving event, STX has the potential to reach even higher levels and climb the crypto rankings within the industry. Observing how the STX price reacts in the coming days and weeks will be interesting. While uncertainties exist, the token&#8217;s current high level of interest suggests a positive outlook for its future performance. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-14T04:40:39.000Z",
    "title": "Ethereum Price Close Above $2,700 Could Spark Larger Degree Rally",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-2700-rally/",
    "description": "Ethereum price is consolidating gains above the $2,575 support. ETH could start a major rally if there is a close above the $2,700 resistance. Ethereum is consolidating gains above the $2,575 support zone. The price is trading above $2,620 and the 100-hourly Simple Moving Average. There is a short-term breakout pattern forming with resistance at $2,640 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase if it stays above the $2,575 support zone. Ethereum Price Eyes Another Increase Ethereum price gained pace above the $2,600 level and traded close to the $2,700 resistance zone. ETH traded as high as $2,681 before it started a downside correction. There was a move below the $2,640 and $2,620 levels. The price declined below the 23.6% Fib retracement level of the upward move from the $2,472 swing low to the $2,681 high, like Bitcoin. However, the bulls were active near the $2,600 zone. Ethereum found support at $2,600 and is currently attempting a fresh increase. It is now trading above $2,620 and the 100-hourly Simple Moving Average. Immediate resistance is near the $2,640 level. There is also a short-term breakout pattern forming with resistance at $2,640 on the hourly chart of ETH/USD. The first major resistance is near the $2,680 level. The next major resistance is near $2,720, above which the price might rise and test the $2,800 resistance. Source: ETHUSD on TradingView.com If the bulls remain in action, they could even push the price above the $2,800 resistance. In the stated case, the price could rise toward the $3,000 level. Another Decline In ETH? If Ethereum fails to clear the $2,640 resistance, it could start another decline. Initial support on the downside is near the $2,620 level. The next key support could be the $2,600 zone. A clear move below the $2,600 support might send the price toward $2,575 or the 50% Fib retracement level of the upward move from the $2,472 swing low to the $2,681 high. The main support could be $2,550 or the 100 hourly SMA. Any more losses might send the price toward the $2,440 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $2,600 Major Resistance Level – $2,640"
  }
]