[
  {
    "source": "Decrypt",
    "date": "2023-09-30T13:01:02.000Z",
    "title": "Biggest Video Games Releasing in October 2023",
    "url": "https://decrypt.co/199403/biggest-video-games-releasing-october-2023",
    "description": "From Assassin's Creed Mirage to Spider-Man 2 and Super Mario Bros. Wonder, these are the can't-miss video game launches in October."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-30T13:01:00.000Z",
    "title": "AI tech boom: Is the artificial intelligence market already saturated? ",
    "url": "https://cointelegraph.com/news/ai-market-saturated-investment",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/4da5e6a8-5054-4d62-bfdd-83ca1836fa40.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The AI sector has seen rapid investment over the last two years, but does that mean the market is overheated? </p>\n                    <p><p>From voice assistants to algorithms predicting global market trends, artificial intelligence (AI) is seeing explosive growth. But as with any emerging technology, there comes a point where innovation risks giving way to oversaturation.</p><p>The rapid proliferation of AI tools and solutions in recent months has ignited discussions among industry experts and investors alike. Are we witnessing the zenith of AI’s golden age, or are we on the precipice of a market saturated beyond capacity?</p><p>The tech landscape has always been dynamic, with innovations often outpacing the market’s ability to adapt. </p><h2>Historical tech boom-and-busts</h2><p>The late 1990s saw the dot-com bubble, a period marked by exuberant optimism around internet-based companies. Startups with little more than a web presence achieved staggering valuations, only for many to crash spectacularly when the bubble burst.</p><p>In 2017, the world witnessed a surge in initial coin offerings (ICOs), a fundraising method where new cryptocurrency projects sold their underlying tokens to investors. </p><p>This period was marked by immense enthusiasm for the potential of blockchain and decentralized technologies. However, excitement often overshadowed the practicality and viability of many projects. </p><p>As a result, investments were made in ventures that either had limited real-world applications or, in some cases, no genuine ties to cryptocurrency whatsoever.</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/google-ai-content-policy\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/google-ai-content-policy/amp\">Google paves way for AI-produced content with new policy</a></em></strong></p><p>A notable example was during 2017’s “blockchain naming” trend with the company previously known as “Long Island Iced Tea Corp.” The company made soft drinks and had little to do with blockchain. In a bid to capitalize on the blockchain hype, the company <a href=\"https://cointelegraph.com/news/textbook-case-of-crypto-hype-how-iced-tea-company-went-blockchain-and-failed-despite-a-289-percent-stock-rise\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/textbook-case-of-crypto-hype-how-iced-tea-company-went-blockchain-and-failed-despite-a-289-percent-stock-rise/amp\">rebranded itself as “Long Blockchain Corp.”</a></p><p>Following this rebranding, the company’s stock price soared, with shares rising by an astonishing 275% in just one day. This increase, despite no substantial shift in its business model or operations, highlighted the speculative nature of the market at the time and the lengths to which companies would go to ride the blockchain wave.</p><p>The enthusiasm was short-lived, however. According to Bitcoin.com, almost half of the projects offering ICOs in 2017 had <a href=\"https://news.bitcoin.com/46-last-years-icos-failed-already/\" target=\"_blank\" rel=\"noopener nofollow\">failed</a> by February 2018.</p><h2>AI’s impact goes beyond speculation</h2><p>While the dot-com and blockchain bubbles were characterized by speculation and, at times, a lack of authentic value, the AI wave is fundamentally different.</p><p>Companies like Microsoft and Google are not just dabbling in AI — they’re integrating it into products and services that millions use daily, showcasing real-world applications that are actively improving industries.</p><p>Michael Koch, co-founder and CEO of HubKonnect — an AI platform for local store marketing campaigns — told Cointelegraph: </p><blockquote>“The AI market feels saturated because people who thought they were technologists and failed at crypto are now moving onto the next hot technology, which is AI — but there are actually real builders and leaders in AI. There needs to be advanced eyes out there for people to really continue to build and take advantage of the evolution of AI.”</blockquote><p>Google’s generative AI, Google Bard, <a href=\"https://www.similarweb.com/blog/insights/ai-news/chatgpt-bard/\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-similarweb-com.cdn.ampproject.org/c/s/www.similarweb.com/amp/blog/insights/ai-news/chatgpt-bard/\">attracted</a> over 140 million visitors in May alone, sports teams are <a href=\"https://www.irishtimes.com/technology/2023/08/16/irish-rugby-team-adopts-game-changing-new-tech-ahead-of-rugby-world-cup/\" target=\"_blank\" rel=\"noopener nofollow\">receiving</a> real-time analytics, and AI chatbots are <a href=\"https://www.commbox.io/chatbots-sales-revenue/\" target=\"_blank\" rel=\"noopener nofollow\">becoming</a> more time and cost-efficient.</p><h2>The modern AI gold rush</h2><p>The allure of artificial intelligence has led to a surge in AI-driven tools, solutions and startups. According to Precedence Research, the global artificial intelligence market was <a href=\"https://www.precedenceresearch.com/artificial-intelligence-market\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-precedenceresearch-com.cdn.ampproject.org/c/s/www.precedenceresearch.com/artificial-intelligence-market/amp\">valued</a> at $454 billion in 2022 and is projected to grow to $538 billion in 2023. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/c536ae2c-0fa6-4c3b-a80f-a1917914f008.png\"></figure><p>Venture capital (VC) has been a significant funding source for the AI sector in 2023. Data from PitchBook <a href=\"https://pitchbook.com/news/articles/Amazon-Bedrock-generative-ai-q1-2023-vc-deals\" target=\"_blank\" rel=\"noopener nofollow\">indicates</a> that generative AI startups raised over $1.7 billion in Q1 of 2023, with an additional $10.7 billion worth of deals announced that were not yet completed. </p><p>Some of the most notable raises included Google-backed Anthropic, which <a href=\"https://www.reuters.com/markets/deals/alphabet-backed-ai-startup-anthropic-raises-450-million-funding-freeze-thaws-2023-05-23/\" target=\"_blank\" rel=\"noopener nofollow\">secured</a> $450 million at a reported $5 billion valuation. Builder.AI <a href=\"https://techcrunch.com/2023/05/23/modular-app-building-platform-builder-ai-raises-250-million-series-d-funding/\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://techcrunch-com.cdn.ampproject.org/c/s/techcrunch.com/2023/05/23/modular-app-building-platform-builder-ai-raises-250-million-series-d-funding/amp/\">raised</a> $250 million. Mistral AI managed to <a href=\"https://techcrunch.com/2023/06/13/frances-mistral-ai-blows-in-with-a-113m-seed-round-at-a-260m-valuation-to-take-on-openai/\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://techcrunch-com.cdn.ampproject.org/c/s/techcrunch.com/2023/06/13/frances-mistral-ai-blows-in-with-a-113m-seed-round-at-a-260m-valuation-to-take-on-openai/amp/\">raise</a> $113 million without a product or even a proof-of-concept. With the injection of VC thrown at these AI startups like wildfire, one can draw some similarities to the ICO bust. In that situation, there was also a lot of hype without any actual use cases or proof of viability. However, what distinguishes AI is its multitude of use cases and real-life examples of success. Take, for instance, ChatGPT, which rapidly reached 100 million users in just two months, demonstrating AI’s tangible impact.</p><p>Yet, with this rapid growth and high valuations, some feel the AI market is overheating. JPMorgan’s chief markets strategist, Marko Kolanovic, believes the AI market is near its saturation point. As reported by <a href=\"https://www.forbes.com/sites/dereksaul/2023/07/24/ai-driven-bubble-may-burst-and-drag-down-stock-market-jpmorgan-says/?sh=4bcdfa407626\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-forbes-com.cdn.ampproject.org/c/s/www.forbes.com/sites/dereksaul/2023/07/24/ai-driven-bubble-may-burst-and-drag-down-stock-market-jpmorgan-says/amp/\">Forbes</a>, Kolanovic said the recent market uptick is a result of an “AI-driven bubble” and that the hype around the technology was due to the “popularization of chatbots that often fail in basic questions” rather than “AI-powered earnings growth.” </p><p>Leif-Nissen Lundbæk, founder and CEO of generative AI company Xayn, has a contrasting view and believes we are only at the tip of the iceberg. He told Cointelegraph:</p><blockquote>“The AI market is not close to becoming saturated. Currently, companies have tried their hand here and there, with some proofs-of-concept materializing. The real large-scale production cases are only getting started, or are yet to come.”</blockquote><h2>Between saturation and innovation</h2><p>The sheer volume of companies entering the AI space has raised concerns about a potentially saturated market. Companies worldwide are now utilizing AI as part of their core functionalities. From 10Web’s no-code website builder to RainbowAI’s weather app, and from ICarbonX’s AI providing personalized health analyses to SherpaAI’s virtual personal assistant, the stage has been set for countless others to follow suit.</p><p>Lundbæk recognizes that the influx of new companies could lead to the market becoming saturated in some areas but does not see it as a pertinent issue, stating, “The business-to-customer market is perhaps a bit more saturated but has not yet reached full capacity, while the business-to-business market is only in its infancy, even though AI has been around for a while. The vast majority of corporations are only using AI or machine learning for a few visible projects, if at all, that are easier to implement with lower risk, but aren’t applying it yet on a large scale.”</p><p>Koch says that the influx of newcomers might give the illusion of an oversaturated AI market, but he views initial saturation as a necessary phase to foster future advancements.</p><p>He stated: “AI will never be saturated because we are only on the first off-ramp of the AI super highway. It seems saturated because people from other industries are trying to step into the space, but when it comes down to innovation, there’s already a select group of companies that are so far ahead and that have been in the AI space for decades. To be able to drive innovation forward, saturation will arise at a basic level, but there are elite players and companies that are leading the future of AI.”</p><h2>Reflecting on AI’s market dynamics</h2><p>The rapid growth, high valuations and influx of new entrants into the AI realm have sparked debates about market saturation. Historical tech bubbles, such as the dot-com era and the blockchain hype, serve as reminders of the potential repercussions of unchecked growth and speculation.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\">Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis</a></em></strong></p><p>However, the depth of AI’s potential is far from fully realized. The technology’s tangible impact speaks to its practical and transformative nature.</p><p>It’s evident that the AI market is multifaceted. As with any burgeoning technology, the challenge is to strike a balance between rapid growth and sustainable development.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-30T13:03:25.000Z",
    "title": "The Growing Threat of AI-Powered Disinformation in Global Elections",
    "url": "https://www.cryptopolitan.com/the-growing-threat-of-ai-powered-disinformation-in-global-elections/",
    "description": "As elections unfold worldwide, they face an evolving and formidable threat from foreign actors wielding a potent weapon: artificial intelligence. The realm of election influence entered a new phase in 2016 when Russian disinformation campaigns targeted the U.S. presidential election through social media. In the subsequent years, countries like China and Iran followed suit, using ... <a title=\"The Growing Threat of AI-Powered Disinformation in Global Elections\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-growing-threat-of-ai-powered-disinformation-in-global-elections/\" aria-label=\"More on The Growing Threat of AI-Powered Disinformation in Global Elections\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-30T13:02:48.000Z",
    "title": "Homemade by Eden Life: Pioneering the Culinary Evolution in Nigeria",
    "url": "https://www.cryptopolitan.com/homemade-by-eden-life-pioneering-the-culinary-evolution-in-nigeria/",
    "description": "Nadayar Enegesi, an ambitious entrepreneur with a Computer Science degree from the University of Waterloo, is on a mission to enhance the quality of life for Africa&#8217;s youth through his brainchild, Homemade by Eden Life. This innovative endeavor is reshaping the dining landscape in Nigeria by harnessing food technology to bring homemade meals right to ... <a title=\"Homemade by Eden Life: Pioneering the Culinary Evolution in Nigeria\" class=\"read-more\" href=\"https://www.cryptopolitan.com/homemade-by-eden-life-pioneering-the-culinary-evolution-in-nigeria/\" aria-label=\"More on Homemade by Eden Life: Pioneering the Culinary Evolution in Nigeria\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-30T12:55:06.000Z",
    "title": "Chancellor Jeremy Hunt Proposes Innovative Approaches to Address Taxation Challenges",
    "url": "https://www.cryptopolitan.com/jeremy-hunt-proposes-approaches-to-tax/",
    "description": "In a recent interview with The Times, Chancellor Jeremy Hunt has put forth a forward-thinking strategy to tackle rising taxes in the United Kingdom. Hunt emphasized the significance of welfare reforms and the integration of cutting-edge technology into the public sector as key measures to alleviate the growing tax burden. Hunt believes that embracing technological ... <a title=\"Chancellor Jeremy Hunt Proposes Innovative Approaches to Address Taxation Challenges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/jeremy-hunt-proposes-approaches-to-tax/\" aria-label=\"More on Chancellor Jeremy Hunt Proposes Innovative Approaches to Address Taxation Challenges\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-30T12:47:14.000Z",
    "title": "The Dark Side of AI: How ChatGPT and Generative AI Tools Fuel Cyberattacks",
    "url": "https://www.cryptopolitan.com/the-dark-side-of-ai-how-chatgpt-and-generative-ai-tools-fuel-cyberattacks/",
    "description": "Recently, the tech world has been abuzz with the capabilities of ChatGPT, an AI-based chatbot developed by OpenAI. This versatile tool has garnered praise for its ability to generate persuasive prose and even functional code. However, as technology evolves, so do the methods of malicious actors, and ChatGPT&#8217;s prowess is not immune to exploitation by ... <a title=\"The Dark Side of AI: How ChatGPT and Generative AI Tools Fuel Cyberattacks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-dark-side-of-ai-how-chatgpt-and-generative-ai-tools-fuel-cyberattacks/\" aria-label=\"More on The Dark Side of AI: How ChatGPT and Generative AI Tools Fuel Cyberattacks\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-30T13:04:00.000Z",
    "title": "Cryptocurrency awareness vs knowledge: To educate to empower | Opinion",
    "url": "https://crypto.news/cryptocurrency-awareness-vs-knowledge-to-educate-to-empower-opinion/",
    "description": "Crypto educators and content creators must prioritize engagement while designing educational materials to attract audience and increase awareness about decentralized finances."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-30T13:05:10.000Z",
    "title": "John Deaton Receives Esteemed Defender of Freedom Award for Championing Crypto Holder Rights",
    "url": "https://www.crypto-news-flash.com/john-deaton-receives-esteemed-defender-of-freedom-award-for-championing-crypto-holder-rights/?utm_source=rss&utm_medium=rss&utm_campaign=john-deaton-receives-esteemed-defender-of-freedom-award-for-championing-crypto-holder-rights",
    "description": "<img width=\"800\" height=\"390\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple vs sec\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1.png 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1-300x146.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/Ripple-vs-SEC-1-768x374.png 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" />John Deaton is honored with the inaugural Defender of Freedom Award for his visionary strategy in representing digital asset holders against SEC enforcement actions. His significant contribution in the SEC v. Ripple case showcased the power of collective community action in the crypto domain. In a marked acknowledgment of courage and innovative legal prowess, the [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-30T12:46:00.000Z",
    "title": "Paradigm Files Amicus Brief in the SEC-Binance Lawsuit: Report",
    "url": "https://coinedition.com/paradigm-files-amicus-brief-in-the-sec-binance-lawsuit-report/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Paradigm Files Amicus Brief in the SEC-Binance Lawsuit: Report\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Binance_has_hired_a_former_prosecutor_M_Kendall_Day_at_DOJ_to_represent-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Paradigm files an amicus brief in the SEC lawsuit against Binance. The platform points out the SEC’s “capacious” and “unreasonable” norms, highlighting the need for Congressional authorization. Per their official announcement, Paradigm opposes the SEC’s gambit despite the platform’s non-involvement with Binance. The research-driven technology investment firm Paradigm recently filed an amicus brief in the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/paradigm-files-amicus-brief-in-the-sec-binance-lawsuit-report/\">Paradigm Files Amicus Brief in the SEC-Binance Lawsuit: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]