[
  {
    "source": "CoinDesk",
    "date": "2024-02-12T18:18:11.000Z",
    "title": "FTX to Sell Custody Unit for $500K After Paying $10M Just Months Before Collapse ",
    "url": "https://www.coindesk.com/business/2024/02/12/ftx-to-sell-custody-unit-for-500k-after-paying-10m-just-months-before-collapse/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The bankrupt exchange's unit, Digital Custody Inc., which FTX bought for $10 million, sold for just $500k to CoinList."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-12T18:35:12.000Z",
    "title": "Google Gemini Advanced vs OpenAI ChatGPT Plus: Here's How They Stack Up",
    "url": "https://decrypt.co/216982/gemini-advanced-chatgpt-plus-feature-comparison",
    "description": "We put the two top-shelf chatbots from two tech titans to the test. Digging into the details is worth more than a thousand words."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-12T18:11:32.000Z",
    "title": "Pudgy Penguins NFTs Top $50K—Will They Flip Bored Apes?",
    "url": "https://decrypt.co/217061/pudgy-penguins-nfts-top-50k-flip-bored-apes",
    "description": "Pudgy Penguins have surged in value to recent months while Bored Apes are down sharply from their all-time high. Is a \"flippening\" imminent?"
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-12T18:20:29.000Z",
    "title": " Price analysis 2/12: SPX, DXY, BTC, ETH, BNB, SOL, XRP, ADA, AVAX, DOGE ",
    "url": "https://cointelegraph.com/news/price-analysis-2-12-spx-dxy-btc-eth-bnb-sol-xrp-ada-avax-doge",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvM2U2MTNhZWYtZGJkMi00Yzg1LWIzMGYtYzEzY2U3MDdiZGIzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The rally in the S&P 500 and strong inflows into the Bitcoin ETFs appear to be fueling BTC's price surge above $50,300.  </p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has reached the psychologically crucial level of $50,000, boosted by the strength in the United States stock markets and solid inflows into the spot Bitcoin exchange-traded funds (ETFs). Popular trader Daan Crypto Trades pointed out in a X post that net inflows into the Bitcoin ETFs have been <a href=\"https://cointelegraph.com/news/bitcoin-50k-shortly-btc-price-erases-etf-dip\">positive for 11 consecutive days</a>.</p><p>Several analysts expect the bull run to continue, but CryptoSlate research and data analyst James Van Straten cautioned traders about a possible correction. Van Straten said in a X post that <a href=\"https://cointelegraph.com/news/best-weekly-close-since-2021-5-things-bitcoin-this-week\">Bitcoin’s total supply in profit is nearing 95%</a>, which “usually marks tops.”</p><p>While short-term risks of a pullback remain, the long-term picture looks encouraging. Crypto analysis platform Glassnode said in a X post on Feb. 10 that select on-chain indicators are showing signs that Bitcoin could be in the <a href=\"https://cointelegraph.com/news/on-chain-indicators-suggest-high-risk-bitcoin-market-glassnode\">initial stages of a bull market</a>.</p><p><a href=\"https://cointelegraph.com/news/price-analysis-2-12-spx-dxy-btc-eth-bnb-sol-xrp-ada-avax-doge\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-12T18:18:50.000Z",
    "title": " CEO of Ripple-owned blockchain custody firm Metaco steps down ",
    "url": "https://cointelegraph.com/news/ripple-metaco-ceo-steps-down",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYzE0MDg1ZDctZDJjMS00Y2U3LTllNGYtNDJiZmJlY2ZkNzFiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ripple purchased blockchain firm Metaco in May 2023 for $250 million as part of efforts to expand its custody services.</p>\n                    <p><p>Adrien Treccani, the CEO of Ripple Labs-owned blockchain custody firm Metaco, has left the company after more than eight years.</p><p>According to a Feb. 12 Reuters report, Trecanni <a href=\"https://www.reuters.com/technology/ripple-owned-crypto-custody-firm-metacos-ceo-departs-2024-02-12/\" target=\"_blank\" rel=\"noopener nofollow\">was</a> no longer the CEO of Metaco, a company he founded in 2015 in Switzerland. Trecanni’s LinkedIn page at the time of publication <a href=\"https://www.linkedin.com/in/atreccani/\" target=\"_blank\" rel=\"noopener nofollow\">showed</a> he left the firm in 2023. Ripple <a href=\"https://cointelegraph.com/news/ripple-acquires-swiss-blockchain-custody-firm-metaco-for-250m\">acquired Metaco in May 2023</a> for $250 million, aiming to expand its services for custody, issuance and settlement of tokenized assets.</p><p>“We appreciate the strong and industry-leading custody business that Adrien and his team built, as well as his leadership in integrating the custody team and solution with Ripple following the acquisition last year,” a Ripple spokesperson told Cointelegraph. </p><p><a href=\"https://cointelegraph.com/news/ripple-metaco-ceo-steps-down\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-12T18:34:53.000Z",
    "title": "Philippines to exclude blockchain from its CBDC plan",
    "url": "https://cryptobriefing.com/philippines-exclude-blockchain-cbdc-plan/?utm_source=feed&utm_medium=rss",
    "description": "The Philippines plans to take a divergent path in CBDC development, opting out of blockchain technology."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-12T18:38:14.000Z",
    "title": "Bitcoin reaches $50k as ETFs record $2.8b net assets in January",
    "url": "https://crypto.news/bitcoin-50000-etf-net-assets/",
    "description": "Bitcoin surged to $50,000, marking its highest point in over two years."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-12T18:30:23.000Z",
    "title": "Strategic Exploit: Crypto Traders Harvested $3 Billion From ‘Kimchi Premium’?",
    "url": "https://www.newsbtc.com/news/strategic-exploit-crypto-traders-harvested-3-billion-from-kimchi-premium/",
    "description": "South Korea’s local media, Newsis, recently reported the case of certain crypto traders who had sent about $3 billion overseas in a bid to profit from the ‘Kimichi Premium.’ Interestingly, the court found 14 out of 16 of these traders not guilty despite their alleged actions.  Related Reading: Bitcoin Bears Brewing: Analyst Predicts A Pullback Before Halving How This Group Of Crypto Traders Operated These crypto traders are said to have sent these sums of money through local banks under the guise of these transactions being foreign exchange remittances. However, this was allegedly not the case, as they would then use the funds to purchase virtual currencies abroad and send those crypto assets back to domestic exchanges, where they eventually offload them.  This was done to allegedly profit from the ‘Kimichi Premium.’ This phenomenon occurs when crypto assets are more expensive in South Korea than overseas due to the country&#8217;s particular regulations. This has created an arbitrage opportunity that crypto traders have sought to exploit. Meanwhile, the Korean government has tried to prevent traders from doing so.  That is why the prosecution charged 16 people, including someone referred to as Mr. A in the news report, with violating the Specific Financial Information Act. Mr. A and others were accused of illegally transferring foreign currency worth 4.3 trillion won ($3 billion) overseas between April 2021 and August 2022 to exploit the Kimichi premium allegedly.  The prosecution believes these crypto traders made a market profit of as much as 210 billion won ($158 million). In their defense, the defendants argued against any wrongdoing since they weren’t precisely the ones facilitating the foreign exchange business but the bank. The traders argued they were platform users, not virtual asset business operators. The bank involved also tried to absolve itself from the case as it claimed it carried out the transaction based on the &#8220;false evidence&#8221; the defendants submitted.  Court Finds The Defendants Not Guilty The court agreed with most defendants’ arguments, acquitting 14 (including Mr. A) out of the 16 persons charged. A local Judge who ruled over the case opined that their actions didn’t violate the objective of the Foreign Exchange Transactions Act and, therefore, could not be punished under that law.  The Judge added that there was &#8220;nothing to suggest that the defendants operated as virtual asset business operators.&#8221; If the reverse was the case, they could have been punished for not registering their business or making certain disclosures as required by the law.  Related Reading: Crypto Drama Unfolds: Ethereum Co-Founder’s 22,000 ETH Transfer Sparks Price Speculation Interestingly, Judge Park further distinguished the current case from a Supreme Court precedent as he noted that the highest court did not “explicitly judge the issues in this case.” The prosecution already submitted an appeal, dissatisfied with the court’s ruling.  Chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-12T18:14:55.000Z",
    "title": "DeFi Protocols Need to Quantify Their Users’ Market Loss from Bad Oracle Latency",
    "url": "https://www.crypto-news-flash.com/defi-protocols-need-to-quantify-their-users-market-loss-from-bad-oracle-latency/?utm_source=rss&utm_medium=rss&utm_campaign=defi-protocols-need-to-quantify-their-users-market-loss-from-bad-oracle-latency",
    "description": "<img width=\"1200\" height=\"684\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-12T211136.882.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-12T211136.882.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-12T211136.882-300x171.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-12T211136.882-768x438.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-12T211136.882-150x86.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-12T211136.882-450x257.png 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Within the ever-evolving realm of decentralized finance (DeFi), it is of extreme importance that the accuracy of any sensitive market data being provided to users is of extremely high quality. However, as things stand, a number of protocols operating in this space have had to grapple with the critical challenge of ‘oracle latency’ and the [...]"
  }
]