[
  {
    "source": "Bitcoin.com",
    "date": "2023-05-26T20:00:51.000Z",
    "title": "Digital Currency Group to Sunset Tradeblock, Cites ‘Regulatory Challenges’ and ‘Prolonged Crypto Winter’",
    "url": "https://news.bitcoin.com/digital-currency-group-to-sunset-tradeblock-cites-regulatory-challenges-and-prolonged-crypto-winter/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/clsoedds-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Digital Currency Group to Sunset Tradeblock, Cites ‘Regulatory Challenges’ and ‘Prolonged Crypto Winter’\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/clsoedds-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/clsoedds-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/clsoedds-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/clsoedds-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/clsoedds-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/clsoedds-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/clsoedds.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Digital Currency Group has revealed its decision to sunset its institutional trading platform, Tradeblock, on May 31, 2023. The company attributes the move to the &#8220;challenging regulatory environment&#8221; and the enduring effects of the &#8220;prolonged crypto winter,&#8221; signaling the conclusion of its subsidiary&#8217;s operations. DCG to Shut Down Institutional Trading Arm Tradeblock by the Month’s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T20:02:58.000Z",
    "title": "Presidential candidate Ramaswamy hits back at DeSantis’ Bitcoin statement",
    "url": "https://www.cryptopolitan.com/ramaswamy-hits-back-at-desantis-btc-remark/",
    "description": "In a move that highlights the growing intersection between politics and crypto, US presidential candidate Alex Rivaswamy took a sharp swipe at Florida Governor Ron DeSantis following the latter&#8217;s recent remarks on Bitcoin. The comment has ignited a fierce culture war surrounding the controversial crypto, putting the spotlight on its role in shaping political landscapes. ... <a title=\"Presidential candidate Ramaswamy hits back at DeSantis&#8217; Bitcoin statement\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ramaswamy-hits-back-at-desantis-btc-remark/\" aria-label=\"More on Presidential candidate Ramaswamy hits back at DeSantis&#8217; Bitcoin statement\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-05-26T20:00:30.000Z",
    "title": "Why Chainlink (LINK), DigiToads (TOADS), and Cosmos (ATOM) Are Your Best Bets for 2023",
    "url": "https://nulltx.com/why-chainlink-link-digitoads-toads-and-cosmos-atom-are-your-best-bets-for-2023/",
    "description": "The ongoing cryptocurrency market crisis has impacted many stable and top crypto projects, causing investors to question their cryptocurrency portfolios. The growing uncertainty of the market enables investors to eye more stable crypto coins. This article will explore the top DeFi coins with significant growth potential- DigiToads, Chainlink, and Cosmos. Chainlink (LINK), DigiToads (TOADS), and [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-26T20:01:13.000Z",
    "title": "Arbitrum (ARB) Fallout: 70% Price Drop, But These Charts Reveal Its True Value",
    "url": "https://www.newsbtc.com/analysis/arb/arbitrum-arb-fallout-70-price-drop-but-these-charts-reveal-its-true-value/",
    "description": "Arbitrum (ARB) has been making waves in the crypto world as it recently became the 4th largest ecosystem in the market. Despite experiencing a sharp decline of 70% since its airdrop, Arbitrum’s native token has continued to gain attention from investors, currently trading around $1.158, down from $1.1808 on April 18th. Related Reading: Toncoin (TON) Continues Downward Trend As Bears Maintain Control Arbitrum Defies The Odds According to the Decentralized Finance (DeFi) researcher Deebs, Arbitrum has emerged as a major player in the crypto market, with its Total Value Locked (TVL) soaring to an impressive $2.3 billion. This puts it in 4th position by TVL, surpassing many of its competitors.  Additionally, since the launch of Arbitrum, the value of stablecoins has grown by over $500 million in just two months. At its peak, the network&#8217;s active user base reached over 600,000, surpassing Optimism (OP), a fast, stable, and scalable L2 blockchain built by Ethereum developers, and nearly overtaking the blockchain platform designed to host decentralized, scalable applications Solana (SOL).  Despite these impressive metrics, ARB’s price has experienced a significant drop of 70% since its airdrop and has had very little positive price action since. However, DeFi researcher Deebs believes that this dip in price may be a sign of a hidden gem in the crypto market. One of the main factors that make Arbitrum an attractive investment opportunity is its high TVL, user base, and liquidity. In fact, since its launch, Arbitrum has maintained the highest liquidity of all Layer 2 (L2) networks and is the third highest of all chains on DeFi Llama. Furthermore, while many other chains have a market capitalization to TVL ratio above 1, Arbitrum boasts one of the smallest ratios at 0.6. This means that the potential price upside for ARB is significantly higher than its competitors, making it an enticing investment opportunity for those looking for long-term gains. Additionally, ARB&#8217;s technology has been praised for its ability to address some of the key issues facing the crypto industry, such as scalability and high transaction fees. ARB&#8217;s use of cutting-edge technology such as Optimistic Rollups provides a solution to these problems, making it an attractive option for investors looking for a reliable network with great potential. Another positive sign for ARB is the amount of support it has received from major players in the crypto industry. This includes partnerships with well-known crypto projects such as Uniswap, Aave, and Chainlink. These collaborations demonstrate that the industry recognizes the value of ARB&#8217;s technology and the potential it holds for the future of decentralized finance. Related Reading: JPMorgan Predicts Bitcoin (BTC) To Revisit $45,000, Here’s Why Overall, despite the recent drop in price, ARB&#8217;s strong fundamentals and growing network usage suggest that it is a hidden gem in the crypto market. Its partnerships with major players in the industry, as well as its innovative technology, make it a promising investment opportunity for those looking to capitalize on the potential of decentralized finance. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-26T20:00:34.000Z",
    "title": "Crypto Project Defies Bitcoin Slump, Surges 125% This Week Amid New App Launch",
    "url": "https://dailyhodl.com/2023/05/26/crypto-project-defies-bitcoin-slump-surges-125-this-week-amid-new-app-launch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/blockcahin-infrastructure-slump-week.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/blockcahin-infrastructure-slump-week.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/blockcahin-infrastructure-slump-week.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/blockcahin-infrastructure-slump-week.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/blockcahin-infrastructure-slump-week.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/blockcahin-infrastructure-slump-week.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/blockcahin-infrastructure-slump-week.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The token ARPA Network (ARPA) is seeing massive gains this week as the crypto community awaits the launch of its first application. The decentralized secure computation network recently announced that it will introduce a random number generator (RNG) called Randcast. A random number generator is a mathematical construct designed to generate a random set of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/26/crypto-project-defies-bitcoin-slump-surges-125-this-week-amid-new-app-launch/\">Crypto Project Defies Bitcoin Slump, Surges 125% This Week Amid New App Launch</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-26T19:55:15.000Z",
    "title": "Analyst Who Called 2022 Crypto Bottom Says Current Bitcoin Price Action Has Him Excited – Here’s Why",
    "url": "https://dailyhodl.com/2023/05/26/analyst-who-called-2022-crypto-bottom-says-current-bitcoin-price-action-has-him-excited-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/btc-bottom-phase.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/btc-bottom-phase.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/btc-bottom-phase.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/btc-bottom-phase.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/btc-bottom-phase.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/btc-bottom-phase.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/btc-bottom-phase.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst who called the 2022 market bottom says that he’s excited about Bitcoin’s (BTC) current price action. The pseudonymous strategist DonAlt tells his 487,000 Twitter followers that the king crypto’s current price action is more exhilarating to him than the “garbage” action that preceded before. According to DonAlt, BTC’s current rally, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/26/analyst-who-called-2022-crypto-bottom-says-current-bitcoin-price-action-has-him-excited-heres-why/\">Analyst Who Called 2022 Crypto Bottom Says Current Bitcoin Price Action Has Him Excited – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]