[
  {
    "source": "Cointelegraph",
    "date": "2023-11-24T14:20:20.000Z",
    "title": "Blockchain devs expect complications from EU smart contract kill switch",
    "url": "http://cointelegraph.com/news/blockchain-adoption-eu-smart-contracts-law",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/e2777e43-495e-4c69-866e-77b9d8c0bbfe.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The EU’s Data Act could introduce “kill switch” requirements for smart contracts, raising questions about how decentralized projects would handle such a scenario. </p>\n                    <p><p>The Data Act — a contentious piece of European Union legislation that includes a clause requiring the ability to terminate smart contracts — has been <a href=\"https://cointelegraph.com/news/eu-backs-data-act-clause-shut-off-smart-contracts\">approved by the European Parliament</a>. If introduced, the legislation will require a smart contract to have a “kill switch.”</p><p>In a Nov. 9 press release, the parliament announced that the legislation was passed with 481 votes in favor and 31 against. The next step for it to become law is to gain the approval of the European Council.</p><p>In its current form, the Data Act stipulates that smart contracts must have the capability to be “interrupted and terminated,” and it mandates controls that allow for the resetting or halting of the contract. The stipulation appears to be a significant departure from the blockchain’s foundational ethos of decentralization.</p><p>How such kill switches would be implemented, and how they could impact the development and use of smart contracts remains unclear. Scott McKinney and Laura De Boel, attorneys with Wilson Sonsini Goodrich &amp; Rosati, told Cointelegraph that such a kill switch is “fundamentally incompatible with what a smart contract is” and how it’s viewed.</p><p>They added that the definition of a smart contract included in the Data Act is “overbroad” and likely to encompass computer programs that wouldn’t currently be considered a <a href=\"https://cointelegraph.com/learn/what-are-smart-contracts-a-beginners-guide-to-automated-agreements\">smart contract</a>. They added:</p><blockquote>“However, it’s important to understand that the EU Data Act’s smart contract requirements will likely only apply to a relatively small subset of smart contracts (or potential smart contracts), i.e., smart contracts for executing of ‘data sharing agreements’ governed by the Data Act.“</blockquote><p>Given the EU’s requirements — including the kill switch and data archiving obligations — they suggested that many companies entering applicable data sharing agreements “will simply decide not to use smart contracts in their applications.”</p><p>Gracy Chen, managing director at cryptocurrency exchange Bitget, told Cointelegraph that the implementation of such a kill switch “introduces a centralized element,” which may “erode trust in smart contracts, as users may beware of relying on contracts that external entities could potentially modify or shut down.”</p><p>As the EU moves closer to potentially cementing a smart contract kill switch into law, it’s unclear how it would enforce its application.</p><h2>Enforcing a “kill switch” </h2><p>Implementing and regulating such a mechanism would, according to Wirex co-founder and CEO Pavel Matveev, see smart contract deployers “self-assess compliance with essential requirements and issue an EU declaration of conformity.”</p><p>Matveev told Coinelegraph that the Data Act’s definition of smart contracts is “expansive and lacks precision regarding the circumstances under which interruptions or terminations should be initiated.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/be1528a2-a6fe-466b-bb83-241337121ef3.png\"  /><figcaption style=\"text-align: center;\"><em>Highlighted excerpt of the Data Act relating to smart contracts. Source: European Parliament</em></figcaption></figure><p>McKinney and De Boel believe the regulation could hinder blockchain innovation in the EU as its requirements are “quite strict, and vendors will need to go through potentially burdensome conformity assessments.”</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/milei-presidential-election-argentina-bitcoin\">Milei presidential victory fuels optimism in Argentina’s Bitcoin community</a></em></strong></p><p>Not everything is a negative, however, as the attorneys noted the Data Act provides “that European standardization organizations will be requested to draft harmonized standards for smart contracts.” They added:</p><blockquote>“Increased standardization could strengthen the use of blockchain in the EU, and could even lead to greater adoption of smart contracts outside of the data access agreements that are regulated by the Data Act.”</blockquote><p>Arina Dudko, head of corporate payment solutions for cryptocurrency exchange Cex.io, told Cointelegraph that as regulatory oversight of crypto companies builds, many have “settled on a system of transparency and detailed reporting.” That system has seen them adhere to applicable directives.</p><p>Dudko further compared the development of rules around blockchain tech to safety and standards rules for automobiles. When cars first hit roads, seatbelts weren’t mandatory, safety standards varied wildly, and when regulations were eventually introduced, “some vehemently fought progress in safety standards before they became accepted practice.”</p><p>Over time, she said, regulations surrounding these safety standards saved lives and led to safer roads. She likened these advances to the EU’s Data Act, saying it’s been facing a “similar phase of reactionary blowback.”</p><p>Dudko said that much like “emergency exits and fire codes, these accommodations are critical to ensuring the environments and products we share are safe for all.” Crypto market participants, she said, need a way to escape if they “get locked into a nefarious or misguided commitment.” </p><blockquote>“While this could discourage hardliners from engaging with these resources, introducing basic user protections could serve to welcome skeptics and crypto-curious participants to make their first transaction.”</blockquote><h2>Impact on blockchain adoption</h2><p>The debate on how the EU’s Data Act will impact the industry is ongoing, with some suggesting it could lead to a retreat or even hinder adoption.</p><p>Several provisions could hinder smart contract adoption in Europe, including geo-fencing services to maintain regulatory compliance. </p><p>According to Dudko, there’s an “unfortunate aversion to regulation in some offshoots of the crypto ecosystem that runs antithetical to the industry’s founding principles,” but to her, regulation is only a hindrance to those “with limited vision.”</p><p>Dudko argued that the Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) genesis block reference to the 2008 financial crisis was an “explicit mention” of the “pallid response” to the crisis, which was itself “the product of lax oversight.” She added:</p><blockquote>“Retail customers want less risk in their transactions, and legislators are right to seek the ability to pull the plug if an opportunity proves too good to be true. The challenge for developers now is to work within these confines and still stick the landing on user satisfaction.”</blockquote><p>Chen said that the kill switch could “impose additional compliance requirements on developers,” which could lead to delays and increased costs when deploying smart contracts.</p><p>On top of that, the effectiveness and functionality of these smart contracts could suffer due to strict data obligations. Chen added, “The enforceability of smart contracts heavily relies on their autonomous and self-executing nature, and any intervention or interference by third parties poses a risk to their integrity.”</p><h2>Don’t make perfect the enemy of good</h2><p>While the EU’s new regulatory landscape poses some significant challenges for businesses employing smart contracts, it provides an imperfect but visible set of rules that isn’t present in many jurisdictions. </p><p>In the United States, regulators have been <a href=\"https://cointelegraph.com/news/former-sec-chief-blasts-bogus-catchphrase-regulation-by-enforcement\">accused of regulation by enforcement</a> after suing various crypto exchanges, including Coinbase, Kraken and Binance. To this day, the very definition of cryptocurrency differs between different U.S. financial watchdog agencies. </p><p>Chen said that the EU is “generally more cautious and regulation-focused” than other major economies, while McKinney and De Boel said Europe is “typically at the forefront when it comes to regulating data-driven industries.” </p><blockquote>”The Data Act, as part of this digital strategy, sets harmonized rules for data sharing arrangements. It is the first major regulation of this kind having such specific requirements and implications for smart contracts.”</blockquote><p>In contrast, they said that the U.S. doesn’t have a federal smart contracts law and has “relatively few state laws regarding smart contracts, most of which simply clarify that a smart contract can be a valid, binding contract.“</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/bitcoin-supercycle-2024-investment-trading\">Bitcoin supercycle 2024: Is this the cycle to end them all?</a></em></strong></p><p>Dudko said the EU has led with “common sense regulations that speak to the public’s broad understanding and usage of digital currencies,” adding that “the U.S. and United Kingdom place “greater emphasis on asset classification and promotional messaging respectively,” while the EU is “continuing to set standards around procedure and project functionality.”</p><p>While the Data Act is progressing, it is still yet to be passed into law, meaning the blockchain industry still has time to prepare. The industry will only know the true scope of the law once it has come into effect. </p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-24T14:25:22.000Z",
    "title": "Top 3 Blockchain and Web3-focused P2E Projects to Explore in 2024",
    "url": "https://cryptodaily.co.uk/2023/11/top-3-blockchain-and-web3-focused-p2e-projects-to-explore-in-2024",
    "description": "The cryptocurrency market is finally beginning to show strong signs of recovery after an extended bear market that left many industry participants without adequate resources to maintain their operations. Despite these challenging circumstances,"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-24T14:30:47.000Z",
    "title": "Do Kwon Faces Extradition Dilemma: Montenegro’s Justice Minister to Decide Between US and South Korea",
    "url": "https://news.bitcoin.com/do-kwon-faces-extradition-dilemma-montenegros-justice-minister-to-decide-between-us-and-south-korea/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/kwon-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Do Kwon Faces Extradition Dilemma: Montenegro&#039;s Justice Minister to Decide Between US and South Korea\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/kwon-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/kwon-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/kwon-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/kwon-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/kwon-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/kwon-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/kwon.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a decision by the Podgorica High Court, ex-Terraform Labs chief executive Do Hyeong Kwon (Do Kwon) is set to be extradited following his four-month incarceration in Montenegro for fabricating travel papers. The extradition bids originate from both the United States and South Korea, with the final determination of Kwon&#8217;s destination resting in the hands [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-24T14:32:28.000Z",
    "title": "GORILLA tanks 30%, meme coin investors considering MK",
    "url": "https://crypto.news/gorilla-tanks-30-meme-coin-investors-considering-mk/",
    "description": "As GORILLA falls, meme coin enthusiasts are exploring a new altcoin, Meme Kombat (MK), which recently launched its presale"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-24T14:24:44.000Z",
    "title": "What is XNA, and why is it up 280% in the last week?",
    "url": "https://crypto.news/what-is-xna-and-why-is-it-up-280-in-the-last-week/",
    "description": "Over the past week, XNA has surged by 280%, with a 30% increase in just the last 24 hours, trading at $0.003988 as of press time. This remarkable rise has raised many eyebrows and questions among traders and investors. What is Neurai, and what are the factors behind its rapid ascension?"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-24T14:13:02.000Z",
    "title": "Ripple (XRP) price analysis hints at a possible upsurge: What do experts predict?",
    "url": "https://crypto.news/ripple-xrp-price-prediction-and-analysis/",
    "description": "Current bullish indicators in Ripple XRP price prediction suggest a potential rise in its short-term value. How far will it go?"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-24T14:25:36.000Z",
    "title": "Will the Digital Euro Have an Expiration Date Like the Digital Yuan and Force Us Into Consumption? Bitcoin Is the Better Choice",
    "url": "https://www.crypto-news-flash.com/will-the-digital-euro-have-an-expiration-date-like-the-digital-yuan-and-force-us-into-consumption-bitcoin-is-the-better-choice/?utm_source=rss&utm_medium=rss&utm_campaign=will-the-digital-euro-have-an-expiration-date-like-the-digital-yuan-and-force-us-into-consumption-bitcoin-is-the-better-choice",
    "description": "<img width=\"1000\" height=\"662\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/g0d4ather-Zentralbank-Euro-EZB.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"g0d4ather\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/g0d4ather-Zentralbank-Euro-EZB.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/g0d4ather-Zentralbank-Euro-EZB-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/g0d4ather-Zentralbank-Euro-EZB-768x508.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/g0d4ather-Zentralbank-Euro-EZB-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The European Central Bank (ECB) is set to provide more details about its digital euro plans, cautioning against high initial expectations. The ECB plans a two-year investigative phase to determine the core features of a digital euro, emphasizing its immediate usefulness and the ability for further development. The European Central Bank (ECB) aims to provide [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-24T14:24:28.000Z",
    "title": "Seeking High Returns in Crypto: Turning to a New Play-to-Earn Presale as BNB and TRON Decline",
    "url": "https://www.crypto-news-flash.com/seeking-high-returns-in-crypto-turning-to-a-new-play-to-earn-presale-as-bnb-and-tron-decline/?utm_source=rss&utm_medium=rss&utm_campaign=seeking-high-returns-in-crypto-turning-to-a-new-play-to-earn-presale-as-bnb-and-tron-decline",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-43-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-43-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-43-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-43-1-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Binance Coin’s network activity has fallen slightly, causing investors to fear a potential BNB decline. Tron’s (TRX) bullish performance in November has declined over the past few days. NuggetRush (NUGX) steals the show after revealing its plans for NFT staking and several other rewards in its play-to-earn adventure. Polygon surpassed Binance Coin’s network activity in [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-24T14:18:53.000Z",
    "title": "The Next Ripple (XRP) and Tron (TRX) Challenger: Everlodge (ELDG) Emerges as a Presale Star",
    "url": "https://www.crypto-news-flash.com/the-next-ripple-xrp-and-tron-trx-challenger-everlodge-eldg-emerges-as-a-presale-star/?utm_source=rss&utm_medium=rss&utm_campaign=the-next-ripple-xrp-and-tron-trx-challenger-everlodge-eldg-emerges-as-a-presale-star",
    "description": "<img width=\"512\" height=\"299\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-50-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-50-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-50-1-300x175.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the booming landscape of cryptocurrencies, the emergence of potential contenders always grabs attention. Everlodge (ELDG) is the latest sensation causing ripples in the market, positioning itself as a possible challenger to established giants like Ripple (XRP) and Tron (TRX). This article will review their latest developments and find out what&#8217;s in store for all [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-24T14:17:37.000Z",
    "title": "Ripple’s Revolution: How XRP Spot ETFs Could Transform the Crypto Market",
    "url": "https://www.crypto-news-flash.com/ripples-revolution-how-xrp-spot-etfs-could-transform-the-crypto-market/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-revolution-how-xrp-spot-etfs-could-transform-the-crypto-market",
    "description": "<img width=\"720\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/ripple-6237041__480.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/ripple-6237041__480.jpg 720w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/ripple-6237041__480-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/ripple-6237041__480-104x69.jpg 104w\" sizes=\"(max-width: 720px) 100vw, 720px\" />Spot ETFs, which require physical possession of underlying assets, are set to revolutionize cryptocurrency investments, as highlighted by XRP community figure Chad Steingraber. There is growing anticipation in the crypto world for an XRP spot ETF, especially following delays in Bitcoin ETF approvals and increasing interest from major asset managers. The cryptocurrency market is witnessing [...]"
  }
]