[
  {
    "source": "Decrypt",
    "date": "2023-11-21T01:03:16.000Z",
    "title": "Drug Giant AstraZeneca Launches Evinova to Quicken Clinical Trials",
    "url": "https://decrypt.co/206789/astrazeneca-launches-evinova-faster-clinical-trials",
    "description": "Evinova aims to use AI to design studies, automate cost calculations, and determine feasibility for drug testing."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-21T00:41:37.000Z",
    "title": "Blockchain Association files support in suit to lift Tornado Cash sanctions",
    "url": "http://cointelegraph.com/news/blockchain-association-support-suit-lifting-tornado-cash-sanctions",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/dfff1600-4e37-4b41-a1b4-4cf34135cfe4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto advocacy group said OFAC must act within its statutory authority by sanctioning bad actors, not open-source software tools.</p>\n                    <p><p>The Blockchain Association has thrown fresh support behind six plaintiffs suing the United States Treasury Office of Foreign Assets Control (OFAC) over its sanctions on the crypto mixer Tornado Cash.</p><p>In a Nov. 20 amicus curiae <a href=\"https://theblockchainassociation.org/wp-content/uploads/2023/11/FILE-STAMPED-23-50669-Amicus-Brief.pdf\" target=\"_blank\" rel=\"noopener nofollow\">brief</a> to a U.S. appellate court, the crypto advocacy group argued OFAC’s decision to sanction the privacy protocol was not only unlawful but exceeded its statutory authority and was both “arbitrary and capricious” — contrary to the U.S. Constitution.</p><p>It’s the second amicus brief filed by the Blockchain Association supporting a group of Tornado Cash users <a href=\"https://cointelegraph.com/news/tornado-cash-appeal-judgment-us-treasury\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/tornado-cash-appeal-judgment-us-treasury/amp\">appealing a lower court’s ruling</a> that upheld OFAC’s decision to add the cryptocurrency mixer to its list of sanctioned entities.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today we filed an amicus brief in the 5th Circuit appeal of Van Loon v. Treasury regarding OFAC’s sanctions against Tornado Cash. <br><br>Read Senior Counsel <a href=\"https://twitter.com/MTCoppel?ref_src=twsrc%5Etfw\">@MTCoppel</a>'s thread below for more. <a href=\"https://t.co/1pmSAt1Bds\">https://t.co/1pmSAt1Bds</a> <a href=\"https://t.co/c5ScaTDr9N\">https://t.co/c5ScaTDr9N</a> <a href=\"https://t.co/e9ySvcKdeM\">pic.twitter.com/e9ySvcKdeM</a></p>— Blockchain Association (@BlockchainAssn) <a href=\"https://twitter.com/BlockchainAssn/status/1726709704792100951?ref_src=twsrc%5Etfw\">November 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Blockchain Association senior counsel Marisa Coppel emphasized in a Nov. 20 <a href=\"https://theblockchainassociation.org/blockchainassociation-files-second-amicus-brief-in-office-of-foreign-assets-control-lawsuit-against-tornado-cash/\" target=\"_blank\" rel=\"noopener nofollow\">statement</a> that OFAC needs to focus on sanctioning bad actors rather than outright banning tools, which she claimed it has no authority over.</p><p>“OFAC must see Tornado Cash for what it is: a tool that can be used by anyone,” Coppel said. “Rather than sanctioning a tool with a lawful purpose, OFAC should remain focused on the bad actors that misuse such tools.”</p><blockquote>“OFAC’s action sets a dangerous new precedent that drastically exceeds their authority and jeopardizes law-abiding Americans’ right to privacy.”</blockquote><p>In its brief, the Blockchain Association suggested OFAC should act within the bounds of the law by seeking approval from Congress to ban crypto mixers such as Tornado Cash.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/kenyan-lawmakers-blockchain-association-crypto-bill\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/kenyan-lawmakers-blockchain-association-crypto-bill/amp\"><strong>Kenyan lawmakers ask local Blockchain Association to come up with crypto bill </strong></a></em></p><p>“The proper remedy is to seek legislation from Congress that would provide supplemental authority in the uniquely decentralized digital asset context — not to improperly stretch its existing authorities,”  it said.</p><blockquote>“Such a power-grab would be a slippery slope that could threaten all manner of internet-based tools that have heretofore been freely available.”</blockquote><p>The Blockchain Association has long held that Tornado Cash has no owner or operator and can function automatically without human intervention or assistance.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">5/ OFAC’s authority only extends to persons or property…the Tornado Cash software is neither. <br><br>There is no owner. <br>No operator. <br>It functions autonomously. <br>And immutably.</p>— Marisa Tashman Coppel (@MTCoppel) <a href=\"https://twitter.com/MTCoppel/status/1726706543637491813?ref_src=twsrc%5Etfw\">November 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>OFAC <a href=\"https://cointelegraph.com/news/us-treasury-sanctions-usdc-and-eth-addresses-connected-to-tornado-cash\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-treasury-sanctions-usdc-and-eth-addresses-connected-to-tornado-cash/amp\">first sanctioned Tornado Cash</a> in August 2022. It <a href=\"https://home.treasury.gov/news/press-releases/jy0916\" target=\"_blank\" rel=\"noopener nofollow\">alleged</a> that individuals and groups had used the mixer to launder more than $7 billion in cryptocurrencies since 2019, including the $455 million stolen by the North Korea-affiliated Lazarus Group.</p><p>Crypto exchange <a href=\"https://cointelegraph.com/news/crypto-investors-backed-by-coinbase-sue-u-s-department-of-treasury-after-tornado-cash-sanctions\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-investors-backed-by-coinbase-sue-u-s-department-of-treasury-after-tornado-cash-sanctions/amp\">Coinbase also backed</a> the suit, pledging to </p><p><strong><em>Magazine:</em></strong><a href=\"https://cointelegraph.com/magazine/6-questions-for-lugui-tillier-about-bitcoin-ordinals-and-the-future-of-crypto/\"><strong><em> </em></strong><strong><em>6 Questions for Lugui Tillier about Bitcoin, Ordinals, and the future of crypto</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-21T01:00:16.000Z",
    "title": "AVAX Open Interest Climbs 10.4% To $224 Million, Is $30 Possible?",
    "url": "https://www.newsbtc.com/analysis/avax/avax-open-interest-224-million/",
    "description": "The open interest for AVAX has been on a consistent rise over the last month, carrying the price of the altcoin along with it. The result of this continuous climb is the fact that the open interest has now surged to May 2022 levels, a development that could spell a massive rally for the price. AVAX Open Interest Surge To $224 Million According to data from Coinglass, the AVAX open interest has now climbed to $224 million. The website shows that there was an over 10% increase in the open interest in a 24-hour period which brought the total open interest above 10.04 million AVAX. Related Reading: Cardano Falling Wedge Pattern: Analyst Predicts 100% Increase Following Breakout Binance actually commands almost half of the total of this open interest at 4.48 million AVAX worth a little over $100 million. This suggests that a good portion of the demand is coming from the crypto exchange. The total open interest also saw a 9.94% increase in the 24 hour period. Source: CoinGlass ByBit exchange accounts for the second-largest open interest at 2.04 million AVAX worth $46.09 million. BingX comes in third place with 1.24 million AVAX worth $27.59. But none of these exchanges account for the largest jump in the last day. The largest jump in open interest was recorded on the Bitmex exchange as it rose 17.78% to bring the crypto exchange’s total open interest to 55,340 AVAX with $1.53 million. Altogether, the open interest in the altcoin has risen from $82.8 million on October 20 to $224 million on November 20, meaning that the open interest has grown 170% in one month. Token price holds above $22 &#124; Source: AVAXUSD on Tradingview.com Can Price Cross $30? The last time that the AVAX open interest was this high, the price was trading much higher which opens the possibility of a rally above $30. As Coinglass data shows, the last time that the open interest crossed $220 million was in May 2022 when the price was still trading above $50. Related Reading: Bitcoin Open Interest Tops 19-Month High: Historical Data Shows What To Expect Also, taking a look at AVAX’s historical performance, it shows that whenever the open interest has risen quickly, the price tends to follow suit. This was the case back in August 2021 when the open interest went from $14.53 million to $123.5 million, and the AVAX price rose accordingly from $19.15 to $55. If the same trend were to take place here, then $30 may only be a starting point for the AVAX price. Following all historical performances, the current volume of open interest puts the AVAX fair price at around $40, meaning the altcoin could be trading well below its fair value. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Coin Culture, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-21T01:00:22.000Z",
    "title": "Top Trader Predicts Imminent Rally for Solana (SOL) and Polygon (MATIC) – Here Are His Targets",
    "url": "https://dailyhodl.com/2023/11/20/top-trader-predicts-imminent-rally-for-solana-sol-and-polygon-matic-here-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/solana-whale-moves-secures.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/solana-whale-moves-secures.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/solana-whale-moves-secures.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/solana-whale-moves-secures.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/solana-whale-moves-secures.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/solana-whale-moves-secures.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/solana-whale-moves-secures.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A trader who nailed the floor price of Bitcoin (BTC) during the 2018 bull market believes Solana (SOL) and Polygon (MATIC) are about to witness bursts to the upside. Pseudonymous analyst Bluntz tells his 229,100 followers on the social media platform X that Solana looks ready to rally after pulling back to last week&#8217;s low [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/20/top-trader-predicts-imminent-rally-for-solana-sol-and-polygon-matic-here-are-his-targets/\">Top Trader Predicts Imminent Rally for Solana (SOL) and Polygon (MATIC) – Here Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]