[
  {
    "source": "Cointelegraph",
    "date": "2024-03-19T18:20:00.000Z",
    "title": " Sygnum bank to tokenize $50M of Matter Labs’ reserves for transparency ",
    "url": "https://cointelegraph.com/news/sygnum-bank-tokenize-50-m-matter-labs-reserves-transparency",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZjJjNDY0ZGYtYmYxNy00OWIyLWFhMWUtNGM3NzRhNjhhYzkyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The crypto-forward banking group is tokenizing funds in the Fidelity Institutional Liquidity Fund, the first time it has tokenized traditional assets. </p>\n                    <p><p>Swiss-based global digital asset banking group Sygnum will invest $50 million in the Fidelity Institutional Liquidity Fund on behalf of its client Matter Labs. Those funds will be tokenized as the first step in Matter Labs’ long-term strategy to move all of its treasury reserves on-chain with institutional custodians.</p><p>The funds will be tokenized onto the Ethereum-based zkSync layer-2 blockchain, which Matter Labs curates. The tokenized funds will represent part of Matter Labs’ holdings in the Fidelity Institutional Liquidity Fund, an open-ended $6.3-billion umbrella for money-market funds that is domiciled in Ireland.</p><p>The funds are intended to provide transparency for Matter Labs’ proof of reserves. Matter Labs senior vice president of business and operations Marco Cora <a href=\"https://www.prnewswire.com/apac/news-releases/sygnum-tokenises-matter-labs-treasury-reserves-in-usd-6-9bn-fidelity-mmf-302092675.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a statement, \"Moving USD 50m of our treasury reserves onto the zkSync blockchain showcases its institutional-grade security as well as our commitment to transparency.” </p><p><a href=\"https://cointelegraph.com/news/sygnum-bank-tokenize-50-m-matter-labs-reserves-transparency\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T18:34:19.000Z",
    "title": "Messi’s Highly Anticipated RWA Presale Begins",
    "url": "https://cryptodaily.co.uk/2024/03/messis-highly-anticipated-rwa-presale-begins",
    "description": "Have you ever thought of making a meaningful contribution to the cause of planetary sustainability but are unsure where to start? Do you believe web3 to be a space that is niche and too unique to be in? The \"Join the Planet\" movement and its RWA are here to remove those doubts."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T18:15:56.000Z",
    "title": "Analysts Favor Chainlink and Dogecoin for This Week's Gains: Could a Rising Presale Token Outshine Them?",
    "url": "https://cryptodaily.co.uk/2024/03/analysts-favor-chainlink-and-dogecoin-for-this-weeks-gains-could-a-rising-presale-token-outshine-them",
    "description": "Explore the market's expectations on Chainlink and Dogecoin for this week's gains. Read about a rising presale token that could be a potential game-changer and possibly outshine these favored cryptocurrencies."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-19T18:27:37.000Z",
    "title": "Solana breaks $200 as market fluctuates, Galaxy Fox pre-sale heats up",
    "url": "https://crypto.news/solana-breaks-200-as-market-fluctuates-galaxy-fox-pre-sale-heats-up/",
    "description": "Amidst market fluctuations, Solana surpasses $200 while Galaxy Fox pre-sale captivates investors with a $4.8 million cap. #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-19T18:17:34.000Z",
    "title": "Stellar launches Soroban smart contracts platform",
    "url": "https://crypto.news/stellar-soroban-launch-smart-contracts/",
    "description": "The Stellar Development Foundation recently announced the launch of Soroban, a smart contracts platform, honoring an upgrade in the Stellar network's history."
  }
]