[
  {
    "source": "Decrypt",
    "date": "2023-07-27T16:59:19.000Z",
    "title": "Stablecoin Bill Stymied, House Financial Services Chair Blames White House",
    "url": "https://decrypt.co/150339/stablecoin-bill-stymied-house-financial-services-chair-blames-white-house",
    "description": "House Republicans are pressing ahead with a bill to regulate stablecoins, but Democrats say that it's inadequate for the task."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-27T16:45:00.000Z",
    "title": "Stablecoins pose lower risk than bank deposits, says ex-Fed policy analyst ",
    "url": "https://cointelegraph.com/news/stablecoins-pose-lower-risk-than-bank-deposits-paradigm-ex-fed-policy-analyst",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/a6cfb817-692f-488b-a174-f58434a88b79.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Stablecoins cannot be compared to bank deposits in terms of risk, nor can they be compared to money market funds, argues a new policy paper released by Paradigm.</p>\n                    <p><p>Stablecoins cannot be compared to bank deposits in terms of risk, argues a new policy paper authored by former Federal Reserve Board analyst Brendan Malone on behalf of technology investment firm Paradigm. </p><p>The document <a href=\"https://policy.paradigm.xyz/writing/The-Future-of-Payments-Includes-Stablecoins\" target=\"_blank\" rel=\"noopener nofollow\">explores</a> the risks stablecoins pose to the financial system, noting that current legislative proposals in the United States could incorporate crypto payment instruments into existing banking and securities frameworks. Malone argues that the risks posed by stablecoins are lower than bank deposits and different from money market funds. </p><p>Stablecoins are cryptocurrencies programmed to have a stable value relative to a specific asset, generally a fiat currency like the U.S. dollar. A money market fund is a type of mutual fund that invests in short-term assets, cash and cash equivalents with a lower level of risk than other mutual funds.</p><p>According to Malone, banks are exposed to so-called maturity transformation when they accept short-term deposits and use those funds to offer long-term loans that are not repaid for years. The maturity transformation creates a continuous risk for banks and requires permanent risk management. </p><p>A recent example of risks associated with maturity transformation is the collapse of Silicon Valley Bank in March. The U.S. bank reportedly had client deposits allocated to long-term assets and <a href=\"https://cointelegraph.com/news/silicon-valley-bank-shut-down-by-california-regulator\">had to be shut down by regulators</a> following a bank run.</p><p>In Malone’s view, stablecoins pegged to a fiat currency do not inherently pose similar risks because their reserve assets are usually backed by short-dated Treasurys and segregated from the issuer’s assets. “Federal regulation implemented under new legislation can require specific safeguards. If so, then unlike bank deposits, there would be no duration mismatch between short-term liabilities (a stablecoin holder can redeem at any time at par on demand) and long-term or risky assets,” he explained.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/af8d65fc-6253-4a17-ad02-cb6cc10bb322.jpeg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Total value settled with stablecoins by year worldwide. Source: CoinMetrics</em></figcaption></figure><p>Stablecoins also serve very different purposes than money market funds. Malone argues that they are primarily used as a means of payment or transactions based on the U.S. dollar peg rather than as an investment option or a cash management vehicle. “For the largest U.S. dollar-pegged stablecoins, holders do not receive any return based on the reserves. Rather, the stablecoins are used as the equivalent of cash itself,” he writes.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/how-and-why-do-stablecoins-depeg\">How and why do stablecoins depeg?</a></em></strong></p><p>According to the paper, if stablecoins are regulated through existing frameworks without considering their unique characteristics, it will lead to strict bank-like oversight of stablecoin issuers. Such oversight could limit competition and increase the market dominance of a few large players. </p><p>“Regulatory guardrails can help preserve confidence in stablecoins as a form of money — and ensure that the power to dictate our system of money does not fall into the hands of a few market participants,” reads the document, adding that stablecoin legislation should address the technology’s specific risks while still allowing innovation.</p><p>Since 2022, at least <a href=\"https://cointelegraph.com/news/crypto-bills-could-change-us-landscape-explained\">50 digital asset bills have been introduced</a> to U.S. Congress, covering everything from stablecoins to U.S. regulatory jurisdiction. Several of these bills seek to regulate stablecoins, including the <a href=\"https://cointelegraph.com/news/us-senator-toomey-introduces-stablecoin-bill-as-congressional-session-wraps-up\">Stablecoin TRUST Act</a> and the <a href=\"https://cointelegraph.com/news/us-lawmaker-introduces-bill-for-government-backed-insurance-of-qualified-stablecoins\">Stablecoin Innovation and Protection Act</a>.</p><p><strong><em>Magazine:</em></strong><strong><em> </em></strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-27T17:00:03.000Z",
    "title": "Bitcoin, Solana community calls out Coinbase CEO on crypto payment vision",
    "url": "https://cryptoslate.com/bitcoin-solana-community-calls-out-coinbase-ceo-on-crypto-payment-vision/",
    "description": "<p>The vision for a future where crypto payments are instant, accessible, and global has ignited a spirited debate among industry leaders on the path toward achieving this goal. As reported by Brian Armstrong, CEO of Coinbase, the crypto industry, including Coinbase, focuses on integrating layer 2 solutions, better on-ramps, and simpler user experiences to bring [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-solana-community-calls-out-coinbase-ceo-on-crypto-payment-vision/\">Bitcoin, Solana community calls out Coinbase CEO on crypto payment vision</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T17:05:43.000Z",
    "title": "The European economy is in a lot of trouble – What’s ECB doing?",
    "url": "https://www.cryptopolitan.com/the-european-economy-is-in-a-lot-of-trouble/",
    "description": "As Europe stumbles through a period of economic turbulence, all eyes are firmly planted on the European Central Bank (ECB), the watchdog tasked with stabilizing the continent&#8217;s economic heartbeat. Remarkably, the ECB has cranked up interest rates to a record high last seen in 2001, marking its ninth straight increase. A move echoing the US ... <a title=\"The European economy is in a lot of trouble &#8211; What&#8217;s ECB doing?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-european-economy-is-in-a-lot-of-trouble/\" aria-label=\"More on The European economy is in a lot of trouble &#8211; What&#8217;s ECB doing?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T16:57:53.000Z",
    "title": "U.S. drops this charge against Sam Bankman-Fried",
    "url": "https://www.cryptopolitan.com/us-drops-charge-against-sam-bankman-fried/",
    "description": "In an unexpected turn of events, U.S. prosecutors declared a concession in the ongoing legal battle against Sam Bankman-Fried, founder of FTX. Amid a myriad of allegations, one count of illicit campaign contributions stands out &#8211; and now, it&#8217;s off the table. Bankman-Fried recently emerged from a courtroom hearing where the threat of his $250 ... <a title=\"U.S. drops this charge against Sam Bankman-Fried\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-drops-charge-against-sam-bankman-fried/\" aria-label=\"More on U.S. drops this charge against Sam Bankman-Fried\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T16:57:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. BNB prices have dropped by 23.95% since April 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T16:51:19.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T16:43:27.000Z",
    "title": "Kevin O’Leary says more US banks will fail – His reasons are convincing",
    "url": "https://www.cryptopolitan.com/kevin-oleary-says-more-us-banks-will-fail/",
    "description": "A startling revelation from the discerning business mogul Kevin O&#8217;Leary has sent ripples across the financial sector. With his prediction that the incessant cycle of Federal Reserve rate hikes is poised to push more U.S. regional banks into the murky waters of failure, it&#8217;s time to buckle up and take heed. As a shrewd investor ... <a title=\"Kevin O&#8217;Leary says more US banks will fail &#8211; His reasons are convincing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kevin-oleary-says-more-us-banks-will-fail/\" aria-label=\"More on Kevin O&#8217;Leary says more US banks will fail &#8211; His reasons are convincing\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-27T16:59:16.000Z",
    "title": "FTX (FTT) looking to relaunch its Crypto Exchange, but investors are focused on this new AI Crypto",
    "url": "https://nulltx.com/ftx-ftt-looking-to-relaunch-its-crypto-exchange-but-investors-are-focused-on-this-new-ai-crypto/",
    "description": "As cryptocurrency gains more mainstream adoption, there’s increasing need for more accessibility and real-world applications. However, while FTX looks to relaunch its crypto exchange, many investors seem more focused on a new AI crypto known as Avorak AI. What happened to FTX? FTX faced a series of unfortunate events that led to its eventual liquidation [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-27T17:04:21.000Z",
    "title": "Worldcoin onboarding 1 user every 8 seconds despite waning interest",
    "url": "https://crypto.news/worldcoin-records-verifications-every-8-seconds-despite-suggested-fallen-interest/",
    "description": "Worldcoin is onboarding 1 user every 8 secs despite waning interest less than a week after launch. For every signup, a user receives 25 WLD"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-27T17:00:32.000Z",
    "title": "PEPE Whales Load Up Their Bags As Memecoin Jumps 13%",
    "url": "https://www.newsbtc.com/altcoin/pepe-whales-load-up-bags-memecoin-jumps-13/",
    "description": "Data shows the PEPE whales have been buying the meme coin as its price has observed a sharp 13% rally during the past 24 hours. PEPE Whales Have Bought 1.56 Trillion Tokens During The Last Day After consolidating straight for more than a month, the meme coin based on the popular internet frog avatar finally buckled a few days back and saw a sharp decline, as did others in the sector like Bitcoin and Ethereum. The asset extended this decline in the days that followed, but the downtrend this time was much more gradual. And yesterday, the coin may have found its bottom, as it has observed a sharp surge since then. The asset seems to have enjoyed some sharp recovery during the past day &#124; Source: PEPEUSD on TradingView While the rise in the meme coin&#8217;s price has been rapid, the asset has still not fully recovered to the levels it had been at before the earlier plummet. But nonetheless, if PEPE can keep this momentum up, it&#8217;s possible that it might retest those levels soon enough. This latest rally has come as whales have been participating in some buying activity. According to Lookonchain on Twitter, an account that keeps track of moves being made by smart-money holders, two whales have bought sizeable portions of the meme coin using Ethereum during the past day. Related Reading: This AMD Ryzen Bug Can Compromise Your Crypto Wallet Keys The first of these humongous investors made a total purchase of around 874 billion PEPE using 600 ETH ($1.12 million), and at the time this holder made the transactions, the meme coin was floating around $0.000001286, meaning that by now, the investor would have made a profit of more than 9%. Looks like the investor has made some sizeable purchases during the past day &#124; Source: @lookonchain on Twitter As a Twitter user in the comments has pointed out, this whale (who goes by &#8220;yougetnothing.eth&#8221;) has been quite the enthusiastic altcoin trader during the last three months. The other whale who made a large PEPE purchase today was a little late to the party, as they bought 658 billion PEPE with 500 ETH ($938,000) while the meme coin&#8217;s price was trading around $0.000001366. This investor bought around six hours after the previous whale &#124; Source: @lookonchain on Twitter This holder is also in profit, obviously, but their gains would be just around 3% at the moment, notably less than what the other whale would have managed to make. Related Reading: Bitcoin Exchange Supply Only Slips Further Despite Price Decline The latest rise in PEPE has come as the original meme coin, Dogecoin, has also been enjoying bullish winds recently. While the former is still significantly in the red in the past week, the latter has outperformed the top assets with its 15% gains. PEPE Market Cap The sharp 13% surge during the past day has naturally meant that the meme coin&#8217;s standing in the wider cryptocurrency market has improved. At present, PEPE is 71st on the market cap list, as its total valuation is around $552 million currently. At the time of writing, PEPE is trading around $0.000001408, up 13% in the last day. The token's standing amongst its peers &#124; Source: CoinMarketCap Featured image from iStock.com, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-27T17:00:51.000Z",
    "title": "As Analysts Predict A Dip for Dogecoin (DOGE), Investors See InQubeta (QUBE) and Aave (AAVE) as the most reliable options for big gains",
    "url": "https://www.crypto-news-flash.com/as-analysts-predict-a-dip-for-dogecoin-doge-investors-see-inqubeta-qube-and-aave-aave-as-the-most-reliable-options-for-big-gains/?utm_source=rss&utm_medium=rss&utm_campaign=as-analysts-predict-a-dip-for-dogecoin-doge-investors-see-inqubeta-qube-and-aave-aave-as-the-most-reliable-options-for-big-gains",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T180237.378.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T180237.378.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T180237.378-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T180237.378-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As the crypto markets navigate the unpredictable waves of volatility, investors are continually on the hunt for potential winners that can deliver significant returns. Amid predictions of a dip for Dogecoin (DOGE), investors are setting their sights on two rising stars of the crypto world – InQubeta&#8217;s QUBE and Aave (AAVE). Both these assets offer [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-27T16:55:42.000Z",
    "title": "Chainalysis Teams Up With Deloitte To Surveil the Blockchain and Help Governments Fight Crime",
    "url": "https://dailyhodl.com/2023/07/27/chainalysis-teams-up-with-deloitte-to-surveil-the-blockchain-and-help-governments-fight-crime/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/chainanalysis-teams-up-with.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/chainanalysis-teams-up-with.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/chainanalysis-teams-up-with.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/chainanalysis-teams-up-with.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/chainanalysis-teams-up-with.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/chainanalysis-teams-up-with.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/chainanalysis-teams-up-with.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Blockchain data platform Chainalysis and accounting giant Deloitte are announcing a new partnership to help governments with blockchain surveillance. The partnership, announced during the Chainalysis Trace DC event, targets government agencies facing hurdles in fighting crypto-related crimes. “Chainalysis will work with Deloitte’s blockchain and digital assets practice across cryptocurrency and digital asset risk, analytics, investigation, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/27/chainalysis-teams-up-with-deloitte-to-surveil-the-blockchain-and-help-governments-fight-crime/\">Chainalysis Teams Up With Deloitte To Surveil the Blockchain and Help Governments Fight Crime</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]