[
  {
    "source": "CoinDesk",
    "date": "2024-01-18T15:55:04.000Z",
    "title": "Towards Governance Abstraction: Understanding a 'Friendly' Way to Manage DAOs",
    "url": "https://www.coindesk.com/consensus-magazine/2024/01/18/towards-governance-abstraction-understanding-a-friendly-way-to-manage-daos/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Dagon, a technical implementation introduced by core developer Ross Campbell, looks to improve DAO governance and delegation using smart contracts."
  },
  {
    "source": "CoinDesk",
    "date": "2024-01-18T15:46:25.000Z",
    "title": "Tether Reportedly Bought 8.9K Bitcoin for $380M, Remaining 11th-Largest BTC Holder",
    "url": "https://www.coindesk.com/markets/2024/01/18/tether-purchased-another-89k-bitcoin-for-380m-remaining-11th-largest-btc-holder/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The stablecoin issuer announced in May 2023 that it would start buying bitcoin in an effort to diversify the backing of its USDT stablecoin."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-18T16:04:00.000Z",
    "title": "You Won't Believe Solana's (SOL) Next Move – Is $105 Just the Beginning?",
    "url": "https://cryptodaily.co.uk/2024/01/you-wont-believe-solanas-sol-next-move-is-105-just-the-beginning",
    "description": "Discover Solana's (SOL) thrilling journey in the crypto world! Dive into our latest analysis where we uncover the bullish signals fueling Solana's potential surge. From its impressive rebound to the buzz around a possible SOL-ETF, find out why investors are turning their attention to Solana and what this could mean for its future. Stay ahead in the crypto race with our insightful, up-to-the-minute coverage on Solana's market trends and predictions."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-18T15:46:36.000Z",
    "title": "Top Crypto Gainers After SEC Decision on Bitcoin ETF – Cardano, Ethereum Classic, and NuggetRush",
    "url": "https://cryptodaily.co.uk/2024/01/top-crypto-gainers-after-sec-decision-on-bitcoin-etf-cardano-ethereum-classic-and-nuggetrush",
    "description": "Ethereum Classic is grabbing headlines with a 44% price increase over the week. Also, crypto analyst Crypto ZX has predicted a significant price jump for Cardano following Bitcoin's halving."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T15:57:06.000Z",
    "title": "Binance Announces Delisting of Select Spot Trading Pairs",
    "url": "https://www.cryptopolitan.com/binance-delisting-select-spot-trading-pairs/",
    "description": "In a move aimed at preserving the integrity of its trading environment and ensuring a high-quality market for its users, Binance, a leading global cryptocurrency exchange, has announced the removal of certain spot trading pairs from its platform. The decision, part of Binance&#8217;s routine market review process, is set to enhance the overall trading experience [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T15:56:09.000Z",
    "title": "Delphi Labs and Astroport Foundation Launch Asteroid Protocol on Cosmos Hub",
    "url": "https://www.cryptopolitan.com/delphi-labs-astroport-foundation-protocol/",
    "description": "Delphi Labs, a prominent research and development firm, in collaboration with the Astroport Foundation, has introduced a groundbreaking inscriptions platform named Asteroid for the Cosmos Hub network.&#160; The innovative protocol is set to redefine the way data is embedded onto blockchains, particularly those without native support for smart contracts. Asteroid: Pioneering inscriptions in the Cosmos [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T15:55:18.000Z",
    "title": "Ethereum Price Prediction 2024-2033: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2024-2033 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T15:55:07.000Z",
    "title": "Kiln Secures $17 Million to Fuel Expansion and Innovation in Crypto Staking",
    "url": "https://www.cryptopolitan.com/kiln-17-million-innovation-in-crypto-staking/",
    "description": "Kiln, a leading institutional crypto staking platform, has successfully closed a $17 million funding round, marking a significant milestone in its journey to reshape the digital assets ecosystem. The funding round, led by 1kx and featuring prominent participants like Crypto.com, IOSG, and Wintermute Ventures, reflects the industry&#8217;s confidence in Kiln&#8217;s innovative approach and strategic vision. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T15:51:29.000Z",
    "title": "Sui Foundation Partners with Stork to Enhance Real-Time Pricing Data in Blockchain",
    "url": "https://www.cryptopolitan.com/sui-foundation-stork-pricing-data-blockchain/",
    "description": "The Sui Foundation, the driving force behind the $2 billion-valued layer-1 blockchain Sui, has announced a partnership with Stork, an advanced off-chain data feed oracle.  The collaboration is set to redefine the landscape of trading and app development by providing ultra-fast, accurate pricing data to builders on the Sui blockchain. Ultra-low-latency trading with Stork&#8217;s Oracle [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T15:46:34.000Z",
    "title": "NEC’s Ren AI Pan: Bread with Romantic Flavors",
    "url": "https://www.cryptopolitan.com/necs-ren-ai-pan-bread-with-romantic-flavors/",
    "description": "In a groundbreaking collaboration, renowned Japanese bakery Kimuraya has joined forces with technology giant NEC to introduce a unique line of bread, &#8220;Ren AI Pan,&#8221; aimed at bridging flavors with romantic sentiments. The innovative product, set to hit supermarkets and online stores in the Tokyo area, represents a fusion of artificial intelligence (AI) analysis and [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-18T16:06:41.000Z",
    "title": "BlackRock reports diverse investor interest in its spot Bitcoin ETF",
    "url": "https://crypto.news/blackrock-reports-diverse-investor-interest-in-its-spot-bitcoin-etf/",
    "description": "BlackRock reveals its spot Bitcoin ETF is drawing a wide range of investors, reflecting growing interest across different investor profiles in the crypto market."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-18T15:46:39.000Z",
    "title": "Manta Network emerges on top trending list following airdrop news",
    "url": "https://crypto.news/manta-network-emerges-on-top-trending-list-following-airdrop-news/",
    "description": "Manta Network, a modular ecosystem within the web3 space, is in CoinGecko’s trending report for Jan. 18."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-18T16:00:05.000Z",
    "title": "XRP On Edge: Supply Hits Historical High-Risk Levels, Brace For Impact?",
    "url": "https://www.newsbtc.com/xrp-news/xrp-supply-high-risk-profit-levels-correction/",
    "description": "Data shows the XRP supply in profit is currently at levels that have historically put the cryptocurrency&#8217;s price in a high-risk zone. XRP, Bitcoin, And Ethereum Are All In High-Risk Zone Right Now According to data from the on-chain analytics firm Santiment, Bitcoin, Ethereum, and XRP are assets that may be in a high-risk zone currently when compared to their historical averages. The indicator of interest here is the &#8220;Percent of Total Supply in Profit,&#8221; which, as its name suggests, tracks the percentage of the total circulating supply of any cryptocurrency with some unrealized profit. This metric works by going through the transaction history of each coin in circulation to see what price it was last transferred on the blockchain. Assuming that the last movement of any coin was changing hands (that is, a new holder bought it), this last transfer price would naturally reveal its profit-loss status. Related Reading: HODLing Rewards: Average Bitcoin Long-Term Holder Now Carries 55% Profit If this previous price for any coin was less than the current spot value of the asset, then that particular coin can be considered to be in profit at the moment. The Percent of Total Supply in Profit adds up all such green coins and calculates what percentage of the supply they make up for. Now, here is a chart that shows the trend in the Percent of Total Supply in Profit for Bitcoin, Ethereum, and XRP over the past few years: Looks like the metric's value has been quite high for all of these three assets in recent days &#124; Source: Santiment on X As displayed in the above graph, the Percent of Total Supply in Profit has recently been at relatively high levels for all three of these assets. At present, 81% of the XRP supply is in the green, while the metric&#8217;s value is 83% and 84% in the case of Bitcoin and Ethereum, respectively. Generally, the investors holding their coins at a profit are more likely to participate in selling, as the allure of profit-taking can be overwhelming. As such, the more holders there are in profit (or, the more supply is in profit), the more likely it is for a mass selloff to take place for the cryptocurrency. Based on this relationship between the Percent Supply in Profit and the prices of the various assets, Santiment has defined three zones for the indicator, as the chart highlights. Since 2018, XRP, BTC, and ETH have hovered between an average of 55% to 75% supply in profit. The assets are currently above this range, so they may be considered inside the high-risk zone. Related Reading: Bitcoin Has Large Resistance Wall Ahead: Here’s The Level To Watch &#8220;Crypto can absolutely still climb due to more exposure from ETFs and other positive news, explains the analytics firm. &#8220;But ideally, a great signal to watch that would imply continued long-term growth would be a breach below 75% of their supplies in profit once again.&#8221; XRP Price XRP has been unable to recover from its crash near the start of the month, as its price is still trading around $0.56. And given the current still-high supply in profit, the pain might only grow deeper for the asset&#8217;s holders soon. The price of the coin has been sliding off in the last few days &#124; Source: XRPUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-18T16:00:14.000Z",
    "title": "Injective and Shiba Inu Investors Shift Focus to Newcomer Rebel Satoshi in Latest Trading Frenzy",
    "url": "https://www.crypto-news-flash.com/injective-and-shiba-inu-investors-shift-focus-to-newcomer-rebel-satoshi-in-latest-trading-frenzy/?utm_source=rss&utm_medium=rss&utm_campaign=injective-and-shiba-inu-investors-shift-focus-to-newcomer-rebel-satoshi-in-latest-trading-frenzy",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-18T094011.270.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-18T094011.270.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-18T094011.270-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-18T094011.270-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-18T094011.270-450x281.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Injective (INJ) gains after Trust Wallet becomes a validator for the coin.  Shiba Inu (SHIB) soars after Mantra Protocol announces NFT collection on Shibarium.  Rebel Satoshi (RBLZ) raises $1 million in its presale to attract investors.  The crypto market is volatile; therefore, there are always surprises in the store for crypto enthusiasts. Recently, top altcoins [...]"
  }
]