[
  {
    "source": "NewsBTC",
    "date": "2024-01-23T02:00:39.000Z",
    "title": "Ethereum Futures Market Cool Off Sets Stage For ETH To Rally: Quant",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-futures-sets-stage-eth-rally-analyst/",
    "description": "An analyst has explained that the latest cooldown in the Ethereum futures market could suggest there is potential for a price rise to resume for ETH. Ethereum Funding Rates Have Seen A Decline Recently An analyst in a CryptoQuant Quicktake post explained that the ETH funding rates have seen a cooldown from their previously overheated levels. The &#8220;funding rate&#8221; refers to the periodic fees that futures contract holders on derivative platforms currently exchange with each other. When the value of this metric is positive, it means that the long contract holders are paying a premium to the shorts to hold onto their positions. Such a trend implies that most traders share a bullish sentiment right now. Related Reading: Bitcoin Puell Multiple At Crucial Juncture: Will Retest Save Rally? On the other hand, the under zero indicates that a bearish sentiment is currently dominant in the futures market, as the short traders are overwhelming the longs. Now, here is a chart that shows the trend in the Ethereum funding rates over the last few months: The value of the metric seems to have been low in recent days &#124; Source: CryptoQuant As displayed in the above graph, the Ethereum funding rates have been mostly positive during the last few months, implying that traders on the futures side of the market have mostly been bullish about the asset. The few times that the metric did dip into the negative inside this period didn&#8217;t turn out to be anything major, as the indicator only attained low red values and rebounded back inside the green territory without too much wait. The chart shows that during some phases of this lasting period of bullish sentiment, the metric attained particularly high values. &#8220;However, it&#8217;s crucial to note that elevated values in funding rates raise concerns about a potential overheated state in the perpetual markets, signaling the possibility of an impending long-squeeze event,&#8221; notes the quant. A &#8220;squeeze&#8221; is an event in which a sharp swing in the price triggers a large number of liquidations, which in turn feed into this price move, elongating it and causing further liquidations. When such a cascade of liquidations affects the long side of the market (that is, the price move in question is a rapid drawdown), the event is known as a &#8220;long squeeze.&#8221; Generally, the side of the futures market most heavily dominated by traders is likelier to fall prey to a squeeze. Thus, when the funding rates are highly positive, a long squeeze can be more probable. Related Reading: Cardano To $7? Analyst Predicts When ADA Will Resume Uptrend Recently, though, as Ethereum has gone through its latest correction, so have the funding rates. Although they are still positive, their magnitude may no longer be associated with an overheated market, and the risk of a long squeeze would have thus fallen. &#8220;Consequently, there exists the potential for the price to resume its upward trajectory following the completion of the ongoing correction stage,&#8221; explains the analyst. ETH Price Ethereum has declined by around 5% during the past week as its price has now fallen under $2,400. Looks like the price of the coin has been sliding off recently &#124; Source: ETHUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-23T01:59:39.000Z",
    "title": "Sui Foundation and Mysten Labs Debut Sui Basecamp, the First-Ever Global Conference for Sui",
    "url": "https://dailyhodl.com/2024/01/22/sui-foundation-and-mysten-labs-debut-sui-basecamp-the-first-ever-global-conference-for-sui/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-MystenLabs-Industry-Announcement-Featured-Image-Template.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-MystenLabs-Industry-Announcement-Featured-Image-Template.jpg 1500w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-MystenLabs-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-MystenLabs-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-MystenLabs-Industry-Announcement-Featured-Image-Template.jpg?resize=768,768 768w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-MystenLabs-Industry-Announcement-Featured-Image-Template.jpg?resize=1024,1024 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-MystenLabs-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-MystenLabs-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-MystenLabs-Industry-Announcement-Featured-Image-Template.jpg?resize=750,750 750w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-MystenLabs-Industry-Announcement-Featured-Image-Template.jpg?resize=1140,1140 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>January 23, 2024 – Palo Alto, United States Inaugural Sui ecosystem event comes to Paris on April 10-11, 2024. Today, Sui Foundation and Mysten Labs announced Sui Basecamp, the first global conference dedicated to the Sui ecosystem, and a celebration of the builders and entrepreneurs building on Sui, the layer one blockchain and smart contract [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/22/sui-foundation-and-mysten-labs-debut-sui-basecamp-the-first-ever-global-conference-for-sui/\">Sui Foundation and Mysten Labs Debut Sui Basecamp, the First-Ever Global Conference for Sui</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]