[
  {
    "source": "Cointelegraph",
    "date": "2023-08-31T04:52:00.000Z",
    "title": "Can PEPE make a comeback? Traders, analysts and Pepe maxis weigh in",
    "url": "https://cointelegraph.com/news/pepe-comeback-memecoin-traders-analysts-price-prediction",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/e49ca472-3dbe-42c7-b4d8-0e7784cbca3e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cointelegraph also spoke to developers purportedly behind a new PEPE token spin-off, who claim the new one is everything \"the old Pepe token should have been.\"</p>\n                    <p><p>The biggest new memecoin of 2023, Pepe (PEPE) suffered one of the worst possible fates that can befall a new crypto asset; a partial rug pull — after its <a href=\"https://cointelegraph.com/news/pepe-token-plunges-strange-token-transfers-fears-rug-pull\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/pepe-token-plunges-strange-token-transfers-fears-rug-pull/amp\">anonymous developers abruptly sold</a> nearly $16 million worth of the token on Aug. 24. </p><p>The official Pepe X (formerly known as Twitter) account explained the drop was due to “three ex-team members” going behind their back and selling the tokens without their knowledge — a move that saw the price of Pepe plummet as much as 26% in the days following, without much <a href=\"https://www.coingecko.com/en/coins/pepe\" target=\"_blank\" rel=\"noopener nofollow\">respite</a>. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">an announcement to the <a href=\"https://twitter.com/search?q=%24PEPE&src=ctag&ref_src=twsrc%5Etfw\">$PEPE</a> community: <br><br>Yesterday on August 24th, 2023, a series of unexpected transactions took place from the <a href=\"https://twitter.com/search?q=%24PEPE&src=ctag&ref_src=twsrc%5Etfw\">$PEPE</a> multisig CEX <br>Wallet in which ~16 Trillion <a href=\"https://twitter.com/search?q=%24PEPE&src=ctag&ref_src=twsrc%5Etfw\">$PEPE</a> tokens (worth roughly $15m USD) were transferred to various crypto exchanges (OKX, Binance,… <a href=\"https://t.co/iZmXV1TAvw\">pic.twitter.com/iZmXV1TAvw</a></p>— Pepe (@pepecoineth) <a href=\"https://twitter.com/pepecoineth/status/1695267128428114005?ref_src=twsrc%5Etfw\">August 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In the wake, crypto investors and memecoin enthusiasts are still scratching their heads — pondering if the frog-themed token could ever hope to return to pre-rug prices. </p><p>Speaking to Cointelegraph, crypto trader Reetika Trades saw some potential positivity for PEPE, despite admitting the manner in which the devs sold wasn’t ideal. She believes that the event will ultimately have “negligible effects” on the token’s outlook in the long run.</p><p>“It’s a memecoin with no promise of utility, so some devs leaving makes no difference to the token,” she said. </p><blockquote>“By selling a lot of the coins now, the threat of the total number of potential coins the devs could dump on people has reduced in the future — which is healthier in the long run.”</blockquote><p>However, Reetika also pointed out that Pepe is a memecoin that has made its name by being forward that it is  fundamentally worthless and has no underlying value upon which to price it. As a result, the price of memecoins are prone to extreme volatility, and any investment in these assets should be treated as more akin to gambling. </p><p>Similarly, pseudonymous trader Horse said that getting the remaining supply of the tokens out of the hands of the developers who sold was a beneficial move long term, especially if it’s “attempting to become similar” to Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>). </p><blockquote>“I think it will make a comeback.”</blockquote><p>These sentiments were echoed in a <a href=\"https://marketing.kaiko.com/pepe-plunges-as-founders-sell?ecid=AOKeC1YNetdNJGLJZEhsDPWUnt5NO8z-a84vMpnapfodldVqIQ56fIoeYnutzkzWHdBaMKR8_MEn&utm_campaign=Research%20newsletter&utm_source=hs_email&utm_medium=email&utm_content=75519093&_hsenc=p2ANqtz--1Y3n5edWxlkfHqQi5QxpYNOH5JF3X8Js6ARlw3_J16JPlVMVLqTrpidY7MdYHtUqkhS1fOioD1VvQbN7wsuv5HJp0iw\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from crypto data provider Kaiko, which noted that despite the sudden crash in price, the liquidity of the memecoin held up surprisingly well. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/72f1ad73-5df4-4c05-a21c-0350e893e80d.png\"><figcaption style=\"text-align: center;\"><em>Pepe liquidity held strong despite the sudden plunge. Source: Kaiko</em></figcaption></figure><p>“It seems that the team’s potential abandonment of the project is not yet the death sentence that some have proclaimed,” Kaiko researchers concluded. </p><p>However, not everyone agrees that the future is distinctly bright for Pepe. </p><h3>Pepe might not be coming back</h3><p>Analysts from Santiment warned that traders should expect “higher volatility” despite Pepe becoming the top trending cryptocurrency in the wake of the rug pull allegations. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> If you are riding the wave of <a href=\"https://twitter.com/hashtag/memecoins?src=hash&ref_src=twsrc%5Etfw\">#memecoins</a> during these uncertain market conditions, <a href=\"https://twitter.com/hashtag/Pepecoin?src=hash&ref_src=twsrc%5Etfw\">#Pepecoin</a> has quickly become the top trending <a href=\"https://twitter.com/hashtag/crypto?src=hash&ref_src=twsrc%5Etfw\">#crypto</a> topic this weekend. Former team members are accused of removing $16M. Expect even more high volatility than usual. <a href=\"https://t.co/iQLD7h224s\">https://t.co/iQLD7h224s</a> <a href=\"https://t.co/UOR4sTcWwv\">pic.twitter.com/UOR4sTcWwv</a></p>— Santiment (@santimentfeed) <a href=\"https://twitter.com/santimentfeed/status/1695658006082711591?ref_src=twsrc%5Etfw\">August 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Offering possible the most bearish take on Pepe was prominent trader Kaleo, who said he hoped that the memecoin “completely collapses.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This may be a controversial take, but at this point I hope <a href=\"https://twitter.com/search?q=%24PEPE&src=ctag&ref_src=twsrc%5Etfw\">$PEPE</a> completely collapses. While I understand a community has developed outside of the founders - the fact remains, as long as the coin survives and does well - the founders continue to do well with it.<br><br>And they don’t…</p>— K A L E O (@CryptoKaleo) <a href=\"https://twitter.com/CryptoKaleo/status/1695482206641152493?ref_src=twsrc%5Etfw\">August 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Even following the announcement of the new direction from the Pepe team, Kaleo said he would remain on the sidelines. However, he admitted that Pepe would probably “rally to new highs from here just to spite me because I decided to take a perceived moral high ground and sideline myself.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/pepe-price-zero-rug-pull-memecoin-risk\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/pepe-price-zero-rug-pull-memecoin-risk/amp\"><strong><em>PEPE price to zero? Pepecoin rug pull allegations put memecoin at risk</em></strong></a></p><p>Meanwhile, in the wake of the turmoil with Pepe, one anonymous team has ventured to create yet another spin-off of the original Pepe token, one that they claim is free from the issues that came along with its predecessor.</p><p>Speaking to Cointelegraph, the team behind the project described the new PEPE token as the “true essence” of decentralized finance (DeFi). </p><p>“The new Pepe token is essentially what the old Pepe token should have been; decentralized, community driven, no team tokens and deflationary,” they said. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\"><strong><em>How smart people invest in dumb memecoins — 3-point plan for success</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T05:01:20.000Z",
    "title": "AI-Controlled Drone System “Swift” Outperforms Professional Pilots in Head-to-Head Races",
    "url": "https://www.cryptopolitan.com/ai-controlled-drone-system-swift/",
    "description": "In a groundbreaking display of technological prowess, an AI-controlled drone system named &#8220;Swift&#8221; has triumphed over three professional human drone pilots in a series of intense head-to-head races. Developed by robotics engineer Elia Kaufmann from the University of Zurich in collaboration with researchers at Intel Labs, Swift showcased its exceptional capabilities by winning 15 out ... <a title=\"AI-Controlled Drone System &#8220;Swift&#8221; Outperforms Professional Pilots in Head-to-Head Races\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-controlled-drone-system-swift/\" aria-label=\"More on AI-Controlled Drone System &#8220;Swift&#8221; Outperforms Professional Pilots in Head-to-Head Races\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-31T04:43:05.000Z",
    "title": "Ethereum Holds Uptrend Support And Could Aim Fresh Rally To $1,800",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-fresh-rally-to-1800/",
    "description": "Ethereum price is correcting gains from the $1,750 resistance against the US Dollar. ETH is trading above the $1,680 support and might start a fresh increase. Ethereum started a downside correction below the $1,720 level. The price is trading above $1,690 and the 100-hourly Simple Moving Average. There is a connecting bearish trend line forming with resistance near $1,705 on the hourly chart of ETH/USD (data feed via Kraken). The pair could soon start a fresh increase above $1,720 and $1,750. Ethereum Price Eyes Fresh Increase Ethereum’s price started a decent increase above the $1,700 level. ETH climbed toward the $1,750 zone before the bears appeared, like Bitcoin. A high was formed near $1,747 and the price recently started a downside correction. There was a move below the $1,720 level. It even traded close to the 50% Fib retracement level of the key increase from the $1,640 swing low to the $1,747 high. However, the bulls are active above the $1,680 level. Ether is now trading above $1,690 and the 100-hourly Simple Moving Average. Besides, there is a connecting bearish trend line forming with resistance near $1,705 on the hourly chart of ETH/USD. Source: ETHUSD on TradingView.com On the upside, the price might face resistance near the $1,700 level and the trend line. The next resistance is near the $1,710 level. A close above the $1,710 level might send the price toward the $1,750 zone. If there is a clear move above $1,750, Ethereum could rise toward the $1,800 resistance. Any more gains might send the price toward the $1,850 resistance. More Losses in ETH? If Ethereum fails to clear the $1,710 resistance, it could continue to move down. Initial support on the downside is near the $1,690 level. The first key support is close to $1,680 or the 61.8% Fib retracement level of the key increase from the $1,640 swing low to the $1,747 high. The next major support is near the $1,665 level. If there is a downside break below $1,665, the price could extend its decline toward the $1,620 level. Any more losses might send the price toward the $1,540 level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,680 Major Resistance Level – $1,710"
  }
]