[
  {
    "source": "Decrypt",
    "date": "2024-02-19T16:55:28.000Z",
    "title": "What is Nolus? How the DeFi Leasing Platform Simplifies Crypto Lending",
    "url": "https://decrypt.co/resources/what-is-nolus-how-the-defi-leasing-platform-simplifies-crypto-lending",
    "description": "Nolus Protocol aims to address the inefficiencies of DeFi lending and borrowing with a new concept, the DeFi Lease. Here's how it works."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-19T17:03:18.000Z",
    "title": " Emojis can predict better crypto trading outcomes, according to scientists ",
    "url": "https://cointelegraph.com/news/emojis-predict-better-crypto-trading-outcomes-according-scientists",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNmQ2OTZlNGYtNzU0Ny00MzE4LWIzOWQtZGVmZTMyYzU2MjNlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The researchers came up with two algorithms based on social media sentiment, both showed consistent positive returns.</p>\n                    <p><p>A multidisciplinary team of researchers from Europe and Asia recently conducted research to determine if it was possible to predict positive crypto trading outcomes using nothing but emoji sentiment on social media. </p><p>According to the team’s preprint research paper, emoji associated with positive sentiment accurately <a href=\"https://arxiv.org/ftp/arxiv/papers/2402/2402.10481.pdf\" target=\"_blank\" rel=\"noopener nofollow\">foreshadowed</a> positive market movement:</p><p>In order to discover the relationship between social media posts featuring emojis associated with positive sentiment towards cryptocurrency and increased trading returns the researchers turned to X, formerly Twitter.</p><p><a href=\"https://cointelegraph.com/news/emojis-predict-better-crypto-trading-outcomes-according-scientists\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-19T16:56:33.000Z",
    "title": "AllianceBlock Rebrands as Nexera Foundation to Accelerate Financial Tokenization",
    "url": "https://cryptodaily.co.uk/2024/02/allianceblock-rebrands-as-nexera-foundation-to-accelerate-financial-tokenization",
    "description": "Blockchain infrastructure platform for asset tokenization, AllianceBlock, has announced a rebrand and a new vision for open finance."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-19T17:09:05.000Z",
    "title": "Ghost-Type Pokémon Revealed: Weaknesses, Resistances, and Counters Uncovered",
    "url": "https://www.cryptopolitan.com/ghost-pokemon-weaknesses-resistances/",
    "description": "Ghost-type Pokémon have long haunted the imaginations of trainers, with their eerie presence and spectral powers. Ghost-type Pokémon, a staple since the inception of the franchise, boast an enigmatic allure and often lurk in the shadows. With only 87 species out of over 1000, these spectral beings are both elusive and formidable. Their presence is [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-19T17:00:48.000Z",
    "title": "Bitcoin Open Interest Reaches $69,000 ATH Levels, What This Means For Price",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-open-interest-69000-ath/",
    "description": "The Bitcoin open interest has been on the rise over the last few weeks as the price has climbed continuously. This sustained rise in the open interest is a reflection of the heightened interest in the cryptocurrency since the United States Securities and Exchange Commission (SEC) approved Spot Bitcoin ETFs for trading. The BTC open interest has now climbed to historical levels, reaching 2021 all-time high levels. Bitcoin Open Interest At 2021 Levels According to data from Coinglass, the Bitcoin open interest has risen to more than $24 billion. This growth represents around a 50% jump in the open interest since the year 2024 began. But more importantly, the open interest has risen to levels not seen since 2021. Related Reading: 4 Surprising Insights From Coinbase’s Earnings, COIN Sees Bullish Surge Looking at the open interest chart, the last time that the Bitcoin OI was this high was back in November 2021, when the cryptocurrency reached its all-time high price of $69,000. This rise in the OI has been consistent across crypto exchanges, with CME, Binance, and ByBit leading the charge and commanding more than 50% of the open interest. Source: Coinglass The continuous rise has also come with a rise in the greed levels among crypto investors. Currently, the Crypto Fear &#38; Greed Index is sitting firmly in Greed, suggesting that crypto investors are in a place where they are willing to take more risks than usual. Implications For The BTC Price With the Bitcoin open interest this high, it could end up being negative for the BTC price. This is because past performances where the open interest has risen so rapidly have often ended in a market crash. The same was the case in 2021 when the Bitcoin OI had set its previous record. Related Reading: $400 XRP Price Point: Analyst Breaks Down The Future Surge Date In 2021, when the BTC price crossed $69,000 and the open interest crossed $22 billion, the euphoria was incredibly high as it is now. However, this would be short-lived, with a market crash happening shortly after. The BTC price would eventually go from $69,000 to $46,000 by December, dropping by almost 40% in the space of one month. If this same trend were to repeat itself in the current trend, then there could be a massive crash in the cards for Bitcoin. A similar decline would see Bitcoin fall back toward $41,000, which would wipe out the gains of the last few weeks. However, there are different factors at play in the current market, such as Spot Bitcoin ETF issuers seeing massive interest in their exchange-traded products. Just last week, inflows into Spot BTC ETFs reached a new record of $2.2 billion. So if these large institutions continue buying BTC to meet the demand of their customers, then the BTC price could continue to rally. BTC bulls push price above $52,300 &#124; Source: BTCUSD on Tradingview.com Featured image from Barron&#8217;s, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-19T16:54:00.000Z",
    "title": "Ripple’s CTO Denies Price Manipulation Allegations on X Platform",
    "url": "https://coinedition.com/ripples-cto-denies-price-manipulation-allegations-on-x-platform/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple&#039;s CTO Denies Price Manipulation Allegations on X Platform\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/Ripple_CTO_Confirms_Ripple_Will_Announce_IPO_or_Settlement_at_NYC-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Ripple&#8217;s Chief Technology Officer (CTO), David Schwartz, took to X on February 18, to address accusations of price manipulation concerning XRP sales. Amid the increasing concerns over Ripple&#8217;s handling of XRP and its impact on the token&#8217;s value, Schwartz denied the allegations. The skepticism and controversies surrounding Ripple&#8217;s operations have led to suspicions among some [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ripples-cto-denies-price-manipulation-allegations-on-x-platform/\">Ripple&#8217;s CTO Denies Price Manipulation Allegations on X Platform</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]