[
  {
    "source": "CoinDesk",
    "date": "2023-06-19T13:45:27.000Z",
    "title": "EU Legislation for Digital Euro Is Put on Hold: Source",
    "url": "https://www.coindesk.com/policy/2023/06/19/eu-legislation-for-digital-euro-is-put-on-hold-source/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A bill covering privacy and distribution of the central bank digital currency, originally scheduled for June 28, will be delayed"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-19T13:40:05.000Z",
    "title": "Why ZK rollups need data availability - Polygon co-founder ",
    "url": "https://cointelegraph.com/news/zk-rollups-need-data-availability-says-polygon-co-founder",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/021b59e3-9dac-4434-bf91-55191c84d186.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Zero knowledge rollups hold great promise for scaling blockchains but the technology requires certain provisions to ensure its success. </p>\n                    <p><p><a href=\"https://cointelegraph.com/magazine/ethereums-layer-2-zk-rollups-can-become-interoperable/\">Zero knowledge proofs</a> have been hailed as a major advancement for blockchain technology but the efficacy of these protocols will require streamlined data availability solutions to unlock their full potential.</p><p>Anurag Arjun, co-founder of Polygon and blockchain data availability protocol Avail, highlighted the importance of data availability for ZK rollups in an interview with Cointelegraph. </p><p><a href=\"https://cointelegraph.com/news/privacy-scaling-drives-use-cases-for-zero-knowledge-technology\">ZK rollups</a> are a layer 2 blockchain scaling solution for blockchain networks allowing transactions to be batched and submitted to a layer 1 blockchain with the provision of a cryptographic proof. ZK proofs aim to provide faster and more efficient transaction processing while maintaining the security of a blockchain system. </p><p>As Ethereum continues on its roadmap following its shift to <a href=\"https://cointelegraph.com/news/the-ethereum-merge-is-completed-here-s-what-s-next\">proof-of-stake after the Merge</a>, data availability is set to become an important factor in an increasing dependence on rollup scaling protocols for transaction batching and verification.</p><p>Arjun, who’s spearheading Avail’s growth following the platform’s spin off from Polygon Labs, said that base layer blockchain protocols of the future will have to optimize data availability for proofs, verifications and settlements rather than execution. </p><blockquote>“If the execution is being scaled by layer 2s or rollups, the base layer then doesn't have to worry about execution. They now have to optimize on things that they are used for, which is data availability.”</blockquote><p>The transition sees blockchain technology moving from a ‘monolithic sort of blockchain architecture’ to more modular setups like that of Avail, which provides infrastructure for ZK rollups and other off-chain scaling solutions.</p><p><a href=\"https://cointelegraph.com/news/polygon-s-holy-grail-ethereum-scaling-zkevm-beta-hits-mainnet\"><strong><em>Related: Polygon’s ‘holy grail’ Ethereum-scaling zkEVM beta hits mainnet </em></strong></a></p><p>Arjun said that ZK proofs are under-appreciated given that they have removed the need for crypto economic assumptions in blockchain systems:</p><blockquote>“It changes the whole landscape, you no longer need these very heavy execution engines or validator run systems because you have ZKs that provide absolute execution proof guarantee. The only other thing that you require is data availability.”</blockquote><p>The importance of data availability for ZK proofs is tied to the nature of the technology, which essentially provides proof of a transaction or network state without revealing the data itself. </p><blockquote>“That's why it's named a validity proof, it does not give any indication of what the data is like.”</blockquote><p>Providing a protocol that handles data availability also addresses the current costs associated with submitting ZK rollups and optimistic rollups to the Ethereum blockchain for example. </p><p>As Arjun explained, rollups face two primary costs in submitting transaction data and proof data, with up to 70 percent of today’s costs spent on storing transaction data on Ethereum. Transaction data submission costs and proof verification costs could be reduced significantly by using a base layer data availability protocol. </p><p>Arjun added that proofs and data go hand in hand despite the fact that ZKs provide verifiable mathematical proofs or ‘absolute execution proof guarantee’ on chain without revealing data or the data needing to be verified. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ethereums-layer-2-zk-rollups-can-become-interoperable/\">Here’s how Ethereum’s ZK-rollups can become interoperable</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-19T14:05:57.000Z",
    "title": "French regulator calls for global coordination on “same risk, same regulation” policy for DeFi",
    "url": "https://cryptoslate.com/french-regulator-calls-for-global-coordination-and-same-risk-same-regulation-for-defi/",
    "description": "<p>The Autorité des Marchés Financiers (AMF) has said that the approach of &#8220;same activities, same risks, same regulation&#8221; should apply &#8220;unambiguously&#8221; when regulating DeFi. The French markets regulator laid out its opinion on regulating decentralized finance (DeFi) in a discussion paper published on June 19. However, the watchdog highlighted that DeFi poses more risks than [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/french-regulator-calls-for-global-coordination-and-same-risk-same-regulation-for-defi/\">French regulator calls for global coordination on “same risk, same regulation” policy for DeFi</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-19T14:00:23.000Z",
    "title": "Altcoin ETPs see inflows amid ETH, BTC outflows as alts recover",
    "url": "https://cryptoslate.com/altcoin-etps-see-inflows-amid-eth-btc-outflows-as-alts-recover/",
    "description": "<p>The week ending June 19, 2023, saw minor outflows totaling $5.1 million from digital asset investment products, as reported in CoinShares&#8217; Digital Asset Fund Flows Weekly. Despite these outflows, altcoins experienced inflows totaling $2.4 million following the prior week&#8217;s price crash, suggesting a shift in investor sentiment. While Ethereum (ETH) experienced the most significant outflows [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/altcoin-etps-see-inflows-amid-eth-btc-outflows-as-alts-recover/\">Altcoin ETPs see inflows amid ETH, BTC outflows as alts recover</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-19T14:00:00.000Z",
    "title": "Independent Reserve Eyes Expansion To Hongkong",
    "url": "https://cryptodaily.co.uk/2023/06/independent-reserve-eyes-expansion-to-hongkong",
    "description": "<p class=\"md-end-block md-p\">The Sydney-based crypto exchange is eyeing an expansion to Hong Kong in the &ldquo;next few months&rdquo; according to an interview with Lasanka Perera, the CEO of its Singapore operations.</p>\n<p class=\"md-end-block md-p\">Having had a solid foundation in Singapore for the past decade, Perera says that the firm is now looking for other hubs and is currently applying for a license to operate in Hong Kong. Perera cited Hong Kong&rsquo;s advantage as an &ldquo;active financial hub with deep capital markets.&rdquo; </p>\n<p class=\"md-end-block md-p\">Towards the end of October last year, the Monetary Authority of Singapore (MAS) enacted an overhaul on its crypto regulations which introduced tighter restrictions and discouraged retail trading. Perera commented on how these restrictions caused a significant drop in Independent Reserve&rsquo;s business, forcing the exchange to focus more on wealth management and Web3 payment segments. Perera also notes the conservatism </p>\n<p class=\"md-end-block md-p md-focus\">Around the same time, Hong Kong announced an easing up on its regulations, culminating in the announcement just last March of an open regulatory framework which took effect this June. This new framework encouraged the adoption of digital assets while protecting its users from crises in the sector and is expected to foster the development and growth of the digital asset market.</p>\nRegulatory Shifts Impacting Market Strategies\n<p class=\"md-end-block md-p\">The stricter regulatory environment imposed by the Monetary Authority of Singapore (MAS) in October last year has served as a critical inflection point for crypto firms like Independent Reserve. The introduction of tighter constraints on cryptocurrency trading, particularly discouraging retail trading, had a significant impact on Independent Reserve's business, causing a marked drop in trading activity.</p>\n<p class=\"md-end-block md-p\">In contrast, Hong Kong has welcomed digital assets with more liberal regulatory practices, a move that Independent Reserve sees as an opportunity for expansion. Hong Kong's open regulatory framework, enacted this June, aims to foster digital asset adoption while providing user protection. This proactive, balanced approach to digital asset regulation makes Hong Kong an attractive market for crypto companies seeking a more welcoming regulatory climate.</p>\nEyeing Expansion Beyond Asia\n<p class=\"md-end-block md-p\">Independent Reserve's expansion strategy does not stop in Asia. The firm is also setting sights further afield, notably towards Dubai. Perera highlights that stepping into Dubai would potentially open up pathways to affluent European markets and capital. This strategic move underscores the firm's ambition to become a truly global player in the digital asset space.</p>\n<p class=\"md-end-block md-p\">However, the key to successful market entry hinges on Dubai adopting sensible and supportive regulations for crypto exchanges. Independent Reserve's leadership is watching regulatory developments closely as they form the backbone of their growth strategy. As the firm plans its next steps, observers are waiting to see how these international expansions will reshape the broader crypto landscape.</p>\n<p class=\"md-end-block md-p\">Hong Kong is well on its way to becoming a crypto hub in Southeast Asia and observers will take note of the way this relates to China&rsquo;s crypto policies as a whole; Perera himself has noted how Hong Kong is &ldquo;the doorway to [greater] China&rdquo;. And of course, one will have to take note how this squares with the especially dire state of the cryptocurrency sector in the United States.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T14:06:05.000Z",
    "title": "France wants to go toe-to-toe with US, China on AI revolution",
    "url": "https://www.cryptopolitan.com/france-go-toe-to-toe-us-china-ai-revolution/",
    "description": "Headlining an ambitious leap into the future, France is gearing up to become Europe&#8217;s powerhouse in the realm of Artificial Intelligence (AI). Striving to go shoulder-to-shoulder with global frontrunners like the US and China, France is fully embracing this rapidly advancing technology, casting aside inhibitions and accelerating investment in a bid to outpace rivals. Gaining ... <a title=\"France wants to go toe-to-toe with US, China on AI revolution\" class=\"read-more\" href=\"https://www.cryptopolitan.com/france-go-toe-to-toe-us-china-ai-revolution/\" aria-label=\"More on France wants to go toe-to-toe with US, China on AI revolution\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T13:59:25.000Z",
    "title": "Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 If you are thinking of investing in a cryptocurrency, Algorand is one of the best choices you can make. However, it is not just enough to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You have to look at Algorand&#8217;s price prediction from 2023 ... <a title=\"Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T13:58:22.000Z",
    "title": "China could surpass the US: Yuan will never surpass USD",
    "url": "https://www.cryptopolitan.com/china-surpass-us-yuan-will-never-surpass-usd/",
    "description": "While China is making formidable strides towards potentially becoming the world&#8217;s largest economy by 2030, a shift in currency dominance isn&#8217;t necessarily part of that equation. Akin to the historic transition when the United States overtook Great Britain, the greenback isn&#8217;t likely to abdicate its throne as the globe&#8217;s principal currency anytime soon, even with ... <a title=\"China could surpass the US: Yuan will never surpass USD\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-surpass-us-yuan-will-never-surpass-usd/\" aria-label=\"More on China could surpass the US: Yuan will never surpass USD\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T13:40:40.000Z",
    "title": "JP Morgan foresees Ether’s ascendancy following the release of the pivotal Hinman documents",
    "url": "https://www.cryptopolitan.com/jp-morgan-foresees-ethers-ascendancy-following-hinman-documents/",
    "description": "June 12 marked a pivotal moment in the ongoing battle between Ripple and the U.S. Securities and Exchange Commission (SEC) with the release of the much-anticipated Hinman documents. It is essential to note that the SEC had initially hoped to keep these documents sealed, but the presiding judge denied this motion, leading to their public ... <a title=\"JP Morgan foresees Ether&#8217;s ascendancy following the release of the pivotal Hinman documents\" class=\"read-more\" href=\"https://www.cryptopolitan.com/jp-morgan-foresees-ethers-ascendancy-following-hinman-documents/\" aria-label=\"More on JP Morgan foresees Ether&#8217;s ascendancy following the release of the pivotal Hinman documents\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-19T14:00:11.000Z",
    "title": "Compelling Evidence Shows This AI Crypto Will Overtake Filecoin and Decentraland In 2023",
    "url": "https://nulltx.com/compelling-evidence-shows-this-ai-crypto-will-overtake-filecoin-and-decentraland-in-2023/",
    "description": "Avorak AI, a new AI crypto has been gaining traction in the crypto market. Analysts suggest that there is compelling evidence to show that this AI crypto will overtake Filecoin and Decentraland in 2023. What happened to Decentarand (MANA)? Decentraland, the Ethereum-based virtual reality project, has faced several challenges leading to a decline in its [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-19T14:00:10.000Z",
    "title": "Trust Wallet Token (TWT) Tallies 22% In Last Week, Will It Test $1 Mark?",
    "url": "https://www.newsbtc.com/trust-wallet-token-twt/trust-wallet-token-twt-tallies-22-in-last-week-will-it-test-1-mark/",
    "description": "Amid the recent regulatory hurdles in the crypto market, Trust Wallet Token (TWT) still managed to show bullish momentum, boasting an impressive growth rate of 22% in the past week. This rapid increase has sparked speculation and curiosity among traders and investors about whether TWT will reach the highly anticipated $1 mark.  The Surge Of Trust Wallet Token (TWT): Factors And Analysis Trust Wallet Token is a cryptocurrency associated with the popular mobile wallet for holding/storing digital assets, Trust Wallet. The integration of TronDAO Staking V2 into TrustWallet on June 16 likely positively impacted the price of the Trust Wallet token (TWT).  The feature increased user convenience and utility, attracting more investor confidence, increasing the demand for TWT, and raising its price. Related Reading: PEPE Sustains Steady Ascent, Fueling Speculation Of Profits Also, the recent partnership between Trust Wallet and Tezos offering users a free McLaren F1 digital collectible likely positively impacted the Trust Wallet Token (TWT). The development created excitement and increased user engagement, potentially leading to increased demand for TWT and subsequent price growth. As of the time of writing, Trust Wallet Token (TWT) is exhibiting a bullish momentum, resulting in a 24-hour increase of 2.26%, representing a price mark of $0.9212. According to CoinMarketCap&#8217;s data, the trading volume of TWT experienced a significant increase. Specifically, it jumped by more than 13% and reached a value of $19 Million. This notable surge in trading volume suggests that there has been a genuine retail buy-up from members of the Trust Wallet community. The Prospects Of Trust Wallet Token Reaching The $1 Mark At present, the Trust Wallet Token is trading above the middle line of the Bollinger Bands indicator, which suggests that the price is currently higher than the average value. This can be seen as a positive sign, indicating potential strength or bullishness in the asset&#8217;s price trend. Also, the Moving Average Convergence Divergence (MACD) of the Trust Wallet Token ($TWT) is above its signal line, and the histogram bars display green, signifying a robust bullish signal. The combination of these indicators suggests a strong bullish momentum and $TWT can potentially hit the $1 mark soon. Related Reading: Ethereum Cancun Upgrade: Why Arbitrum, Optimism Will Profit Massively One important advantage investors in TWT might consider is that its value is based on its fundamental usefulness. Unlike some other digital currencies that the Securities and Exchange Commission (SEC) considers investment contracts, TWT has a specific purpose in powering the decentralized Trust Wallet ecosystem. Similarly, this has given investors confidence in the token&#8217;s potential and value. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T13:57:13.000Z",
    "title": "Bank of England and BIS Conduct Successful CBDC Trial Using Blockchain: Is Stellar (XLM) Involved? Report",
    "url": "https://www.crypto-news-flash.com/bank-of-england-and-bis-conduct-successful-cbdc-trial-using-blockchain-is-stellar-xlm-involved-report/?utm_source=rss&utm_medium=rss&utm_campaign=bank-of-england-and-bis-conduct-successful-cbdc-trial-using-blockchain-is-stellar-xlm-involved-report",
    "description": "The BIS Innovation Hub has revealed the results of Project Rosalind, a collaboration between the Bank of England and the BIS Innovation Hub. Quant&#8217;s digital currency surged 20% following its partnership announcement with the Bank of England for Project Rosalind. The BIS Innovation Hub has announced the outcomes of Project Rosalind, a collaborative effort between [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-19T13:55:52.000Z",
    "title": "Celsius Debtors File to Swap Altcoins to Bitcoin or Ethereum",
    "url": "https://coinedition.com/celsius-debtors-file-to-swap-altcoins-to-bitcoin-or-ethereum/",
    "description": "<img width=\"150\" height=\"150\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Celsius_Network_Revival_Plan_–_Heres_What_It_Includes-150x150.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Celsius_Network_Revival_Plan_–_Here’s_What_It_Includes!\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" /><p>Celsius debtors have filed in court to have the ability to swap all altcoins in their possession to Bitcoin (BTC) or Ether (ETH). The debtors made the filing on June 14, 2023, to the United States Bankruptcy Court, Southern District of New York. According to reports, the filing requests the debtors to begin the sales [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/celsius-debtors-file-to-swap-altcoins-to-bitcoin-or-ethereum/\">Celsius Debtors File to Swap Altcoins to Bitcoin or Ethereum</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-19T13:40:18.000Z",
    "title": "STEPN Price Prediction 2023-2030: Will GMT Price Hit $1 Soon?",
    "url": "https://coinedition.com/stepn-gmt-price-prediction/",
    "description": "<img width=\"150\" height=\"150\" src=\"https://coinedition.com/wp-content/uploads/2022/09/STEPN-GMT-PRICE-PREDICTION-150x150.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"STEPN (GMT) Price Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" /><p>Aside from Bitcoin (BTC) and Ethereum (ETH), there are other digital currencies worth considering for people looking to diversify their portfolios and get experience with new cryptocurrencies, STEPN (GMT) is one of them. STEPN is a health and fitness application that allows you to earn money by moving. Users can earn cryptocurrency tokens by walking, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/stepn-gmt-price-prediction/\">STEPN Price Prediction 2023-2030: Will GMT Price Hit $1 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]