[
  {
    "source": "Decrypt",
    "date": "2024-03-14T23:32:24.000Z",
    "title": "Telegram's 'Notcoin' Giving Out $400K in TON, Plus Millions of In-Game Coins",
    "url": "https://decrypt.co/221836/telegram-notcoin-giving-400k-toncoin-millions-in-game-coins",
    "description": "Viral clicker game Notcoin just launched a new promo ahead of the airdrop, offering up 100,000 Toncoin and heaps of in-game coins."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-14T23:23:11.000Z",
    "title": "Crypto Holders Favor Donald Trump for U.S. President: Poll",
    "url": "https://decrypt.co/221829/crypto-poll-trump-biden-bitcoin-etf",
    "description": "Younger voters of color are increasingly adopting cryptocurrencies, making holders a potential swing vote in a tight race."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-14T23:10:16.000Z",
    "title": "This is The Time of SOL",
    "url": "https://decrypt.co/videos/interviews/DIZFtR67/this-is-the-time-of-sol",
    "description": "ETFs match last week’s inflows in just 3 days. ETH Dencun upgrade goes, ETH coins broadly fall. ETH L2 costs for trading decrease dramatically. SOL nears $100bn FDV as activity soars. SOL DEX volume now 3x ETH mainnet. MicroStrategy plans $500m raise to buy more BTC. Franklin Templeton releases memecoin paper. AEVO faces FUD about tokenomics."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-14T23:21:27.000Z",
    "title": " Game firm’s stock triples after it buys Bitcoin, Hong Kong’s in-kind BTC ETF: Asia Express ",
    "url": "https://cointelegraph.com/magazine/game-firms-stock-triples-after-it-buys-bitcoin-hong-kongs-in-kind-btc-etf-asia-express/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2024/01/Magazine-asia-Express-2504-1-scaled.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Gaming firm to invest another $100M in Bitcoin and ETH after stock triples, Hong Kong’s in-kind Bitcoin ETF, Bybit warning: Asia Express.</p>\n                    <p><p>Shares of Hong Kong online gaming firm Boyaa Interactive have soared 318% over the past month after the firm approved a <a href=\"https://cointelegraph.com/magazine/hong-kong-game-company-90m-btc-eth-china-uae-cbdc-deal-asia-express/\" target=\"_blank\" rel=\"nofollow\">$100 million initiative</a> to allocate $45 million of corporate funds to Bitcoin (BTC), $45 million to Ether (ETH), and $10 million to stablecoins such as Tether (USDT) and USD Coin (USDC). </p><p>“As of the date of this announcement, the Company purchased a total of 1,110 Bitcoin with an average unit price of approximately $41,790, a total of 14,855 Ether with an average unit price of approximately $2,777 and approximately 8,000,000 units of Tether USD,” the firm <a href=\"https://www.boyaa.com.hk/attachment/2024030800309.pdf\" target=\"_blank\" rel=\"nofollow\">said</a> on March 8 and announced plans to double down on its purchase with an additional $100 million investment into cryptocurrencies.</p><p>Aside from the gigantic purchase, the firm also has a solid underlying gaming business, bringing around 100 million yuan ($13.90 million) in revenue and 32.05 million yuan ($4.46 million) in earnings, with growth rates of 6% and 72%, respectively. Due to the ongoing bearish stock market in China, most firms have large cash balances available with some firms trading for far below their nominal book value. </p><p><a href=\"https://cointelegraph.com/magazine/game-firms-stock-triples-after-it-buys-bitcoin-hong-kongs-in-kind-btc-etf-asia-express/\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2024-03-14T23:21:27.000Z",
    "title": " Game firm’s stock triples after it buys Bitcoin, Hong Kong’s in-kind BTC ETF: Asia Express ",
    "url": "https://cointelegraph.com/magazine/game-firms-stock-triples-after-it-buys-bitcoin-hong-kongs-in-kind-btc-etf-asia-express/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2024/01/Magazine-asia-Express-2504-1-scaled.jpg\"></p><p>Gaming firm to invest another $100M in Bitcoin and ETH after stock triples, Hong Kong’s in-kind Bitcoin ETF, Bybit warning: Asia Express.</p>\n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-14T23:10:42.000Z",
    "title": "Tether Assists US Government in Seizing $1.4 Million From Unhosted Wallet",
    "url": "https://news.bitcoin.com/tether-assists-us-government-in-seizing-1-4-million-from-unhosted-wallet/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/f62d3690-71c3-4e6d-9c4b-0126b8339de1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Tether Assists US Government in Seizing $1.4 MIllion From Tech Scheme Linked Unhosted Wallet\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/f62d3690-71c3-4e6d-9c4b-0126b8339de1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/f62d3690-71c3-4e6d-9c4b-0126b8339de1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/f62d3690-71c3-4e6d-9c4b-0126b8339de1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/f62d3690-71c3-4e6d-9c4b-0126b8339de1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/f62d3690-71c3-4e6d-9c4b-0126b8339de1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/f62d3690-71c3-4e6d-9c4b-0126b8339de1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/f62d3690-71c3-4e6d-9c4b-0126b8339de1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Tether, the company behind the issuance of USDT, the largest stablecoin in the cryptocurrency market, announced that it helped the U.S. government to seize $1.4 million linked to an alleged fraud scheme. According to the Northern District of Illinois U.S. Attorney&#x2019;s Office, the seizure marks one of the first times that the U.S. has recovered [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-14T23:30:55.000Z",
    "title": "Crypto Market’s ‘Monster Cycle’: $7.5 Trillion Market Value By 2025, Bitcoin Targets $150,000",
    "url": "https://www.newsbtc.com/news/crypto-markets-monster-cycle-7-5-trillion-market-value-by-2025-bitcoin-targets-150000/",
    "description": "In a recent Bloomberg report, it has been revealed that the market value of crypto assets is expected to witness a remarkable surge, nearly tripling to $7.5 trillion by 2025.  Wall Street Firm Predicts &#8220;Monster Of A Crypto Cycle” The next few years are likely to usher in a &#8220;monster of a crypto cycle,&#8221; according to Wall Street research firm Bernstein. In addition, Bernstein analysts have an &#8220;outperform&#8221; rating on the stock as they initiate coverage of online brokerage Robinhood Markets.  Analyst Gautam Chhugani believes investors should take advantage of the opportunity to ride the &#8220;crypto comeback arc,&#8221; envisioning a “ninefold increase” in Robinhood&#8217;s crypto trading volume over the next two years. Related Reading: Classic Minerals And AuResources Drive Blockchain-Backed Funding For Gold Mining Ventures Chhugani expressed his confidence in Robinhood&#8217;s prospects, stating that now is the opportune time to enter the market with an 18-24 month window to capitalize on the crypto resurgence. Assigning a price target of $30 to the stock, Chhugani&#8217;s price target is currently the highest among analysts tracked by Bloomberg. Following the publication of positive February operating data, which included increases in assets under custody and surging trade volume, Robinhood shares surged as much as 12% in New York trading, reaching the highest intraday level since December 2021.  So far this year, the stock has gained over 40%. However, Wall Street remains cautious about its outlook, with six analysts rating the stock as a buy, ten suggesting a hold, and three recommending selling. With the anticipated growth of crypto assets from $2.6 trillion to $7.5 trillion, the largest digital currency, Bitcoin, is set to become a $3 trillion asset by 2025. According to Chhugani, this surge is expected to be fueled by the &#8220;unprecedented success&#8221; of exchange-traded funds (ETFs) tied to the cryptocurrency.  Additionally, Chhugani predicts that Bitcoin will reach a high of $150,000 next year. He emphasized the ongoing institutional adoption of cryptocurrencies and expressed expectations for the continued success of the Bitcoin ETF and the potential launch of an Ethereum ETF within the next 12 months. Robinhood Positioned For Success In the context of Robinhood, Chhugani highlighted the company&#8217;s &#8220;full suite crypto offering within a regulated broker platform,&#8221; which positions it favorably. Bloomberg notes that traditional broker platforms, such as Charles Schwab Corp., have been more hesitant in offering cryptocurrency services. Summing up his bullish stance, Chhugani stated:  In short, we are bullish on crypto, and we believe Robinhood&#8217;s crypto business resurgence will restore its fortunes with investors. The projected exponential growth of the cryptocurrency market and the optimistic outlook for Robinhood&#8217;s crypto business have captured the attention of market observers. With the increasing mainstream acceptance and institutional adoption of digital assets, the next few years hold significant potential for investors and market participants alike. Related Reading: Cardano Ready For Breakout As Network Adoption Hits Major Milestone Featured image from Shutterstock, chart from TradingView.com"
  }
]