[
  {
    "source": "Cointelegraph",
    "date": "2023-12-06T01:42:11.000Z",
    "title": " Bitcoin futures open interest on CME nears 2021 all-time high ",
    "url": "https://cointelegraph.com/news/bitcoin-futures-cme-open-interest-nears-high",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZGZmZTA0MmMtYmQ4NC00N2Q3LTg2ODMtNGNkNzEzZWQ0ZTAxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The futures positioning on CME shows Bitcoin could still move higher from its current price, says IG Australia analyst Tony Sycamore. </p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) futures open interest has reached $5.2 billion on the global derivatives giant Chicago Mercantile Exchange (CME), $200 million shy of its late October 2021 all-time high.</p><p>Open interest in CME’s Bitcoin futures has grown from $3.63 billion to $5.20 billion over the last 30 days, according to Coinglass <a href=\"https://www.coinglass.com/BitcoinOpenInterest\" target=\"_blank\" rel=\"noopener nofollow\">data</a>. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-12/2622739c-4ac5-4a03-9bc5-d061e00dbb2b.png\"><figcaption style=\"text-align: center;\"><em>CME’s Bitcoin futures open interest reached $5.2 billion on Dec. Source: Coinglass</em></figcaption></figure><p>From Oct. </p><p>The rapid uptick in open interest also coincided with a drastic price jump for Bitcoin, which grew from $45,000 to $66,000.</p><p>IG Australia analyst Tony Sycamore told Cointelegraph the open interest uptick shows a renewed interest in Bitcoin, but it doesn’t explain how CME traders are positioned.</p><p>Sycamore pointed to CME’s Nov. 28 <a href=\"https://www.cftc.gov/dea/futures/deacmesf.htm\" target=\"_blank\" rel=\"noopener nofollow\">report</a> to the Commodities Futures Trading Commission, which showed the “big players” on its platform were sitting net short at the time, with 20,724 short positions compared to 18,979 longs, Sycamore explained.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-12/6c2d4728-9d50-4b45-b0e7-a547da1b7e73.png\"><figcaption style=\"text-align: center;\"><em>Futures positions on CME had been net short as of Nov. Source: CFTC</em></figcaption></figure><p>Until CME’s latest report comes through on Tuesday, Dec. </p><p>“What we can’t see right now is whether the big players have gone from a net short to a net long, Sycamore said. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-price-hit-2023-high-why-are-retail-traders-on-sidelines\" ><strong><em>Bitcoin price hit 2023 high, so why are retail traders waiting on the sidelines?</em></strong></a></p><p>The massive uptick in Bitcoin’s price is being driven by more than just speculation around the SEC’s <a href=\"https://cointelegraph.com/news/first-deadline-window-looms-for-sec-to-approve-bitcoin-etfs-law-decoded-nov-6-13\" >potential approval of a roster of spot ETF products</a>, Sycamore added. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-futures-cme-open-interest-nears-high\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-06T01:52:16.000Z",
    "title": "Does DeFi still have a chance at fulfilling its promise?",
    "url": "https://cryptoslate.com/does-defi-still-have-a-chance-at-fulfilling-its-promise/",
    "description": "<p>Decentralized finance (DeFi) emerged as a movement with the promise of revolutionizing the global financial system based on a simple yet powerful premise — offering access to better solutions with its peer-to-peer asset transfer and smart contract-powered autonomy. Since 2015, multiple sub-sectors like lending, trading, and automatic market-making quickly emerged, amassing US$175 billion in Total [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/does-defi-still-have-a-chance-at-fulfilling-its-promise/\">Does DeFi still have a chance at fulfilling its promise?</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-12-06T01:42:00.000Z",
    "title": "Cardano’s Large Transactions Reach New Highs, Signaling Growing Interest from Whales and Institutions",
    "url": "https://www.cryptoglobe.com/latest/2023/12/cardanos-large-transactions-reach-new-highs-signaling-growing-interest-from-whales-and-institutions/",
    "description": "The Cardano network has seen a significant increase in the volume of transactions exceeding $100,000 as these consistently reach new highs, indicating institutional investors and whales’ growing interest in Cardano and its native cryptocurrency ADA. According to popular cryptocurrency analyst Ali Martinez, over the last three months there has been a significant increase in ADA […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-06T02:00:11.000Z",
    "title": "NFT Scams: Types And How To Avoid Them",
    "url": "https://www.newsbtc.com/nft/nft-scams-how-to-avoid/",
    "description": "NFT scams have quickly become a major concern in the digital asset realm, overshadowing the growing Non-Fungible Token world. They range from NFT scams on Instagram to complex NFT art frauds like the Bored Ape Yacht Club and Logan Paul&#8217;s NFT game. The risks are varied and significant. This guide explores the murky world of NFT fraud, highlighting various forms such as fake NFTs, NFT Ponzi schemes, and common OpenSea scams. Overview Of NFT Scams The Non-Fungible Tokens (NFTs) realm has opened a new digital frontier, bringing with it a surge in NFT scams, troubling both investors and enthusiasts. These scams, leveraging the novelty and complexity of NFTs, often catch even experienced participants off guard. NFT scams vary widely and continue to evolve, from simple phishing attempts to more complex Ponzi schemes. These fraudulent activities occur not only on lesser-known platforms but also on popular ones like OpenSea and in high-profile projects like the Bored Ape Yacht Club. The growth of social media further complicates matters, with platforms like Instagram becoming centers for NFT fraud. Understanding the range and mechanics of these scams is essential for anyone involved in the NFT space. The risks are numerous, from fake NFTs posing as legitimate digital art to Ponzi schemes presented as attractive investments, and phishing scams targeting valuable digital assets. True Or Not: NFTs Are A Scam? The question of whether NFTs are a scam is complex and requires a nuanced understanding of the NFT ecosystem. At the outset, it&#8217;s important to clarify that not all NFTs are scams. NFTs, by their very nature, are a legitimate technological innovation, providing a unique way to authenticate and trade digital assets on the blockchain. They have been utilized in various fields, from digital art and entertainment to real estate and identity verification. However, the burgeoning interest in NFTs has also attracted scammers looking to exploit the hype and the often limited understanding of the technology among the general public. This has led to a significant number of fraudulent schemes within the NFT space. Scams such as selling plagiarized digital art, creating fake NFT marketplaces, or promoting non-existent NFT projects are not uncommon. High-profile cases, like certain celebrity-endorsed NFT projects, have also raised suspicions and added to the skepticism. The key takeaway is that while NFTs as a concept are not a scam, the ecosystem has been marred by fraudulent activities that prey on the uninformed. The presence of scams does not invalidate the entire NFT space but serves as a cautionary tale about the need for due diligence and skepticism, especially in a field that is relatively new and rapidly evolving. As the NFT market continues to mature, it is hoped that better regulation and informed participation will reduce the prevalence of these scams. Types of NFT Scams The world of NFTs, while offering vast opportunities for creators and collectors, is also rife with various types of scams. Here’s a list of the most common NFT scams: Plagiarized NFTs / Fake NFTs One of the most common types of NFT scams involves the sale of plagiarized or fake NFTs. In these scams, fraudsters create and sell NFTs that are unauthorized copies of existing digital artworks. They may also create entirely fake NFTs, passing them off as valuable or rare digital assets. These scams exploit the NFT hype, especially in digital art, by taking advantage of buyers&#8217; lack of knowledge in verifying NFT authenticity and originality. The decentralized, permissionless nature of blockchain, allowing anyone to mint NFTs, presents challenges in identifying these scams. It&#8217;s tough for buyers to distinguish between original and plagiarized NFTs without proper verification, leading to fraud and infringement on legitimate artists&#8217; rights and profits. To avoid such scams, thoroughly research the creator&#8217;s background and the NFT&#8217;s provenance. While platforms and marketplaces are increasingly vetting creators and artworks, buyers must still perform due diligence before purchasing. NFT Ponzi Schemes NFT Ponzi schemes are another alarming trend in the realm of digital assets. In these schemes, early investors are promised high returns based on the investments of new participants, rather than legitimate business activities or profit. The structure inevitably collapses once there are not enough new investors, leading to significant losses for later investors. These schemes exploit the hype and speculative nature of the NFT market, often using aggressive marketing and false promises of guaranteed returns. They might be disguised as innovative NFT projects or exclusive investment opportunities in the digital art world. To protect yourself from NFT Ponzi schemes, be wary of projects that promise high returns with little to no risk, and always research the project&#8217;s fundamentals and the credibility of its creators. Rug Pull Scams Rug pull scams are particularly nefarious in the NFT space. In these scams, the developers of an NFT project hype up their offering to increase demand and price. However, once they accumulate a substantial amount of funds, they abandon the project and disappear with the investors&#8217; money. This leaves investors with worthless NFTs and no way to recoup their investment. These scams are often associated with new projects that lack a track record or verifiable information about the team behind them. To avoid rug pulls, it&#8217;s essential to conduct thorough research on the NFT project, understand its utility, and verify the transparency and track record of the developers involved. Engaging with the community and looking for independent reviews can also provide valuable insights into the legitimacy of a project. Bidding NFT Scams Bidding NFT scams are a sophisticated form of fraud that occurs in the auction process of buying and selling NFTs. In these scams, fraudsters manipulate the bidding process to inflate the price of an NFT artificially. This is often done by using fake accounts to place high bids on the NFT, creating a false sense of demand and value. Unsuspecting buyers, believing the NFT to be more valuable than it actually is, are then tricked into placing even higher bids. Once the NFT is sold at the inflated price, the scammers withdraw, leaving the buyer with an asset worth significantly less than what they paid. To avoid falling victim to bidding scams, it’s crucial to research the bidding history of an NFT and be cautious of auctions where the price seems to escalate unusually quickly. It&#8217;s also advisable to verify the credibility of other bidders, if possible, and to understand the typical market value of similar NFTs. NFT Pump And Dumps NFT pump and dumps are similar in nature to their counterparts in the stock market. In these scams, a group of individuals or a single entity artificially inflates the value of an NFT or a series of NFTs through hype and misinformation. Scammers typically use social media to quickly spread rumors or exaggerated claims about an NFT’s potential value. After they pump up the price and attract other investors, they sell (or dump) their NFTs at a high price. This causes the value to plummet, leaving new investors with a devalued asset. To protect against pump and dump schemes, investors should be skeptical of NFTs that receive sudden and intense hype without tangible reasons or developments backing them. Independent research is crucial and should not rely solely on promotional materials or social media buzz to assess an NFT&#8217;s potential value. Phishing Scams Phishing scams are a prevalent issue in the NFT world, where scammers use deceptive methods to steal sensitive information, such as private keys or login credentials. These scams often occur through emails, social media messages, or fake websites that mimic legitimate NFT platforms. The scammers lure victims with the promise of exclusive NFT deals or access to rare digital assets, and once the victims enter their information on these fraudulent platforms, their digital wallets and the assets within them are compromised. To protect against phishing scams, always verify the authenticity of any communication or websites claiming to be from well-known NFT platforms. Be cautious of unsolicited offers and never share your private keys or sensitive account information. NFT Airdrop Or Giveaway Scams NFT airdrop or giveaway scams take advantage of users&#8217; desire for free assets. Scammers promote fake airdrops or giveaways, claiming to distribute free NFTs or cryptocurrencies. To participate, users are often asked to perform certain tasks like sending a small amount of cryptocurrency, sharing private keys, or completing a form with personal information. Once the information is shared or the payment is made, the scammers disappear without delivering the promised NFTs. To avoid these scams, be wary of any offer that seems too good to be true, especially if it requires an upfront payment or sensitive information. Legitimate airdrops and giveaways usually do not require such actions. Website Scams Website scams in the NFT space typically involve the creation of fraudulent websites that imitate legitimate NFT marketplaces or projects. These websites might offer the sale of fake NFTs or pretend to offer services related to NFT trading. Unsuspecting users who transact on these sites may end up losing their funds or digital assets. These scams are sophisticated, with websites often appearing highly credible and professional. To avoid falling for website scams, always double-check the URL of the website you&#8217;re visiting and ensure it&#8217;s the official site. Look for signs of legitimacy, such as secure connections (https), reviews from trusted sources, and verified contact information. Be cautious of websites that appear from unsolicited emails or social media links, and consider using browser extensions that can help detect and block malicious websites. Most Common NFT Ponzi Schemes NFT Ponzi schemes are significant frauds in the digital asset space, disguising themselves as legitimate investment opportunities. They benefit early initiators at the expense of later participants, often promising high returns quickly, backed by convoluted or non-existent business models. A common NFT Ponzi scheme form involves platforms claiming to offer exclusive access to rare or high-value NFTs, asserting rapid value appreciation. Investors are urged to buy and recruit others, with the promise of earning from higher future sales. However, returns typically come from new participants&#8217; investments. When new investors dwindle, the scheme collapses, leaving most at a loss. Another variant involves scammers creating NFT projects with elaborate backstories and promised future utility, attracting investors with high-quality artwork or supposed real-world asset tie-ins. The goal is to boost initial sales and trading volumes, after which the creators vanish, leaving investors with worthless tokens. To avoid NFT Ponzi schemes, thoroughly research any project or platform, especially those promising high returns. Seek transparent, realistic business models, and be cautious of projects reliant on recruiting new investors for profit. NFT Scams On Instagram Instagram&#8217;s large user base and visual focus have made it a breeding ground for NFT scams. Scammers exploit its popularity to commit various frauds, from fake NFT sales to phishing attacks. Instagram&#8217;s suitability for showcasing digital art allows scammers to use fake or hacked profiles to promote fraudulent NFT projects. A common NFT scam on Instagram features fraudsters posting digital art images, falsely advertising them as NFTs for sale. These posts often link to fake websites that prompt users to provide personal information or send cryptocurrency for nonexistent NFTs. Another method involves sending direct messages with offers to buy or invest in NFT projects, which are actually scams. Phishing attempts are rampant as well, directing users to fake websites that mimic popular NFT marketplaces or wallets. These sites steal login credentials, leading to loss of funds or NFTs from the victims&#8217; actual wallets. Staying safe from NFT scams on Instagram requires a high degree of vigilance. Always verify the authenticity of any NFT sale or project promoted on the platform. Be skeptical of unsolicited offers received via direct messages and avoid clicking on suspicious links. Additionally, cross-reference NFT offerings with official websites or platforms, and never share personal or wallet information on unverified sites. NFT Art Scams And NFT Fraud The NFT art world, despite its creativity and innovation, is still vulnerable to an array of scams and fraudulent activities. Common among these are the sales of counterfeit digital artworks, theft of artist identities, and fraudulent investment schemes posing as legitimate NFT projects. OpenSea Scams OpenSea, a leading NFT marketplace, attracts various scams. Scammers often list counterfeit versions of popular NFTs for sale, deceiving buyers into purchasing fake or plagiarized art. Another prevalent scam is phishing, using links that mimic legitimate OpenSea websites to steal wallet information and funds. To counter these scams, OpenSea has taken measures like account verification and flagging suspicious activities. However, users need to stay alert. They should verify NFT authenticity, assess seller credibility, and use OpenSea&#8217;s official website to avoid these scams. Bored Ape Scam Scammers have also targeted the Bored Ape Yacht Club (BAYC) collection, known for its high-value and celebrity-endorsed NFTs. The high demand and significant media attention make it an attractive target. Scams related to Bored Ape Yacht Club (BAYC) typically involve selling fake Bored Ape NFTs, phishing to steal these valuable NFTs from owners, and using the BAYC brand in fraudulent investment schemes to deceive victims. Collectors and investors looking to avoid Bored Ape scams should be wary of deals that appear overly attractive, verify the authenticity of Bored Ape NFTs via official channels, and stay alert to phishing attempts targeting BAYC NFT holders. Logan Paul NFT Game Scam Logan Paul, a well-known internet personality, and his associates face a class action lawsuit over their NFT project, CryptoZoo. Announced in September 2021, this NFT-based game claimed to be an &#8220;autonomous ecosystem&#8221; for trading virtual exotic animals. The lawsuit alleges that Paul&#8217;s team executed a rug pull, promoting CryptoZoo to his followers who were largely unfamiliar with digital currencies. This led to a significant number of them buying these NFTs. Further claims state that the game was non-functional or nonexistent, and the defendants manipulated the market for Zoo Tokens. After selling all their NFTs, they allegedly transferred the funds to their controlled wallets. Further accusations include that the game did not work or never existed, and that the defendants manipulated the digital currency market for Zoo Tokens to their advantage. After completing the sale of all their NFTs, the defendants allegedly transferred the money to wallets controlled by themselves. Avoiding NFT Scams: Best Practices Here are some essential tips to help you stay safe in the world of NFTs: Do Your Research: Ensure you conduct thorough research on the project, its creators, and the selling platform before investing in any NFT. Look for reviews, community feedback, and the track record of the creators. Verify Authenticity And Provenance: Confirm the authenticity of the NFT you&#8217;re interested in to ensure it&#8217;s not a counterfeit. Check the item&#8217;s history and originality, which can be verified on the blockchain. Use Reputable Platforms: Stick to well-known and reputable NFT marketplaces that have measures in place to prevent scams. These platforms often have verification processes for sellers and their NFTs. Be Wary of Unsolicited Offers: Exercise caution with unsolicited offers that come through email, social media, or direct messages, particularly if they promise high returns or exclusive opportunities. Secure Your Digital Wallet: Use a secure and reputable digital wallet to store your NFTs. Protect your wallet&#8217;s private keys and make sure never to share them with anyone. Watch Out For Phishing Attempts: Be vigilant about phishing scams. Always check the URL of a website to ensure it&#8217;s legitimate and be cautious about clicking on links in emails or social media messages. Avoid Overhyped Projects: Approach NFT projects surrounded by excessive hype with skepticism, particularly those lacking substantial and verifiable information. Stay Informed About Scam Trends: Keep yourself updated on the latest scam trends in the NFT space. Knowledge about how scammers operate can be your best defense. FAQ: NFT Scams What Are Common NFT Scams? Common NFT scams are phishing attacks, fake NFT sales, Ponzi schemes, rug pulls, bidding scams, and airdrop or giveaway scams. These tactics exploit the NFT hype, targeting uninformed buyers and investors. What Is The Most Common NFT Scam? The most frequent NFT scam involves selling fake or plagiarized NFTs. Scammers create and sell unauthorized copies of digital art or entirely fabricated NFTs, misrepresenting them as valuable. What Are NFT Art Scams? NFT art scams include selling fake digital art, using stolen artist identities, or promoting fraudulent investment schemes. These scams target collectors and investors in the digital art space. What Are Fake NFTs? Fake NFTs, non-genuine digital assets, include plagiarized copies of legitimate NFTs or entirely fabricated items misrepresented as valuable or rare. Creators make them to deceive buyers into purchasing something with little to no actual value. How To Avoid NFT OpenSea Scams? To avoid OpenSea scams, always verify the authenticity of NFTs and sellers, use OpenSea&#8217;s official website, be cautious of phishing links, and ensure your digital wallet&#8217;s security. Research and due diligence are key in avoiding scams on OpenSea. What Are Examples Of NFT Fraud? Examples of NFT fraud include the Bored Ape Yacht Club scams, Logan Paul NFT game scam, Ponzi schemes disguised as NFT projects, and phishing attacks targeting NFT collectors and investors. Are All NFTs Scam? No, not all NFTs are scams. While there are fraudulent activities within the NFT space, many legitimate NFTs offer genuine value and opportunities for artists, collectors, and investors. Are NFTs Ponzi Scheme? Not all NFTs are Ponzi schemes, but the NFT market has seen its share of Ponzi schemes disguised as legitimate investment opportunities. It&#8217;s important to differentiate between genuine NFT projects and those structured like Ponzi schemes. What Are The Most Common NFT Scams On Instagram? On Instagram, the most common NFT scams involve fake NFT sales and phishing attacks posing as legitimate offers. Additionally, scams often use hacked accounts to promote fraudulent NFT projects. NFTs Are A Scam? NFTs themselves are not a scam. They are a legitimate form of digital asset. However, like any emerging market, the NFT space has attracted scammers exploiting the hype and lack of regulation. Is The Logan Paul NFT Game A Scam? The NFT game CryptoZoo, associated with Logan Paul, is currently facing a class action lawsuit alleging it to be a &#8220;rug pull&#8221; scam. The lawsuit claims the game was non-functional or nonexistent and accuses the developers of financial manipulation. The ongoing case, still awaiting a final judgment, actively raises serious concerns about the project&#8217;s legitimacy due to these allegations. How To Spot Bored Ape Yacht Club Scams? To spot Bored Ape Yacht Club scams, start by verifying the authenticity of the NFTs through official channels. Additionally, be wary of offers that seem too good to be true and watch out for phishing attempts. Featured images from Shutterstock"
  }
]