[
  {
    "source": "Decrypt",
    "date": "2023-10-09T22:03:28.000Z",
    "title": "Dating App Tool Upgraded with AI Is Poised to Power Catfishing",
    "url": "https://decrypt.co/200787/lovegpt-ai-dating-apps-catfishing-hack-avast",
    "description": "Avast calls out an old tool that's learned new tricks, using AI to get even better at running romantic scams on dating apps."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-09T21:54:13.000Z",
    "title": "Rage Quit? Unity CEO Departs After New Fees Pissed Off Game Developers",
    "url": "https://decrypt.co/200797/rage-quit-unity-ceo-departs-after-new-fees-pissed-off-game-developers",
    "description": "Last month, Unity announced a \"runtime fee\" set to start in 2024, enraging developers. Now, longtime CEO John Riccitiello is leaving."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-09T21:42:26.000Z",
    "title": "Sam Bankman-Fried Lawyers May Already Be Angling for an Appeal, Says Former Prosecutor",
    "url": "https://decrypt.co/200767/sam-bankman-fried-lawyers-may-already-be-angling-for-an-appeal-says-former-prosecutor",
    "description": "Judge Kaplan called the defense’s repetitive cross-examination into question several times last week."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-09T22:00:56.000Z",
    "title": "US Stocks Overcome Early Decline Amid Israeli-Gaza Tensions to Close Higher",
    "url": "https://cointelegraph.com/news/us-market-review-10-09-2023",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/9a93ed0f-994e-4beb-aad7-327827121ee8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Dow and S&P 500 fell early in the day, but rebounded to end the day positive.</p>\n                    <p><p><em>October 9, 2023</em></p><p>US markets demonstrated resilience on Monday, initially succumbing to concerns over the escalating Israeli-Gaza conflict, but rebounding later to close in the green. The Dow closed up 0.5%, at 33,604.65. The S&amp;P 500 rose by 0.6%, reaching 4,335.66. The tech-heavy Nasdaq went to 13,484.24, a gain of 0.4%. The S&amp;P was down slightly at 10:50 a.m. ET, having fallen from 4281.91 to 4285.73, a loss of 3.852 points, but this loss was erased by the end of the day. The two other two indices made similar moves down, then up.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/6422396e-2d1f-49fa-a6a0-f625cae01c1b.png\"  /><figcaption style=\"text-align: center;\"><em>One-day chart for the S&amp;P 500. Source: MSN Money.</em></figcaption></figure><p>Over the weekend, Palestinian militant group Hamas launched an attack against Israel. The new outbreak of war caused some traders to fear volatility will rock the market, causing a bearish sentiment to take hold early on. However, these fears were largely shrugged off over the course of the day. Defense-related companies surged, with Lockheed Martin gaining 8.5% and Northrop Grumman Corp gaining 11%. Oil producers also gained thanks to a belief that high oil prices are coming. </p><p>Gold was buoyed by the turmoil, rising $13.59 (0.74%), to $1,861.53. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/200a92c3-54f7-4d3f-9a41-10bce7b67af9.png\"  /><figcaption style=\"text-align: center;\"><em>One-day gold chart, 10-9-2023. Source: GoldPrice, TradingView</em></figcaption></figure><p>Oil also rose today, with West Texas Intermediate hitting $86.29, a gain of 4.24% on the day. Brent crude rose to $88.05, a gain of 4.09% on the day. GasBuddy issued a report stating that US gasoline prices have declined by $0.11 per gallon, but this was mostly overlooked and failed to stop the war-driven oil rally.</p><p>The US Dollar Index by 0.03%, to 106.08. In tandem with the rise in the dollar, the euro fell 0.2220%, to 1.0566. The yen gained 0.5138%, bringing the number of yen needed to buy a dollar to 148.5070. The yen has been trading sideways since September 25, when the Bank of Japan stated that it would intervene if the currency fell much further. Prior to that date, it had lost 13% of its value since the start of the year.</p><p>Information for this news item was sourced from CNBC, OilPrice, Yahoo Finance, MSN Money, and Marketwatch.</p><p><em>Vintage Finance is dedicated to the in-depth exploration and reporting of traditional financial news, tracing the journey of global markets and economies from Stone Age to Stoned Age.</em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-09T21:50:34.000Z",
    "title": "Bitstamp executives says exchange to partner with three ‘household name banks’ in Europe",
    "url": "https://cryptoslate.com/bitstamp-executives-says-exchange-to-partner-with-three-household-name-banks-in-europe/",
    "description": "<p>A top Bitstamp executive stated that his crypto exchange will work with three major European banks in an interview on Oct. 9. Robert Zagotta, Bitstamp&#8217;s CEO for the Americas and Global Chief Commercial Officer, said that those partnerships concern the company&#8217;s Bitstamp-as-a-service feature. That feature is a white-label service that allows banks and other companies [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitstamp-executives-says-exchange-to-partner-with-three-household-name-banks-in-europe/\">Bitstamp executives says exchange to partner with three &#8216;household name banks&#8217; in Europe</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-09T22:00:46.000Z",
    "title": "Bitcoin Halving Is 200 Days Away, This Happens Every Time: Is It Time To Doubledown?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-halving-is-200-days-away-this-happens-every-time-is-it-time-to-doubledown/",
    "description": "Bitcoin is 200 days before halving, a supply shock that historical patterns show that prices tend to rally, even clearing previous all-time highs once it happens. In a price chart shared by the &#8220;thescalpingpro&#8221; on X on October 9, the analyst appears to suggest that the world&#8217;s most valuable coin is in the early stages of not only breaking above 2021 highs but registering new highs after the network halves in 2024. Early Signs Of Bull Rally: 200 Days Before Halving Thus far, the trader notes that Bitcoin is down 60% from previous all-time highs in 2021. This formation, the analyst says, appears to replicate the same pattern before Bitcoin halved in 2019. Then, just like it is presently, the coin fell 60% from 2017 highs of around $20,000. Related Reading: Shiba Inu-Based BONE Gearing Up For Massive Rally, Here’s Why As historical pattern shows, Bitcoin prices tend to bounce back strongly after posting sharp losses from previous highs. These upswings are often accelerated by the halving event momentum, pushing prices further away from cyclical lows.  Every four years, Bitcoin halving occurs, where the reward for mining a Bitcoin block is reduced by half. This feature is built into the protocol to slow the issuance of new Bitcoin. Due to the decrease in the number of coins released to circulation during halving, inflation is reduced, which supports prices, as previous price action has shown. Although the impact of halving has been well studied, the sequence of events preceding this event appears to be stirring demand. As aforementioned, 200 days before the 2016 and 2019 halvings, Bitcoin fell roughly 60% from all-time highs. The asset&#8217;s prices are at a similar price point precisely 200 days before halving. For this &#8220;near-perfect&#8221; replication of events, &#8220;thescalpingpro&#8221; is bullish that the coin might follow a familiar pattern of past cycles. Bitcoin Race To $48,000 Before Halving? The spike to all-time highs and beyond, as previewed, is a scenario that could happen once the halving happens. Before then, however, another analyst is convinced the coin could rally to $48,000.  Related Reading: Time For Self-Custody? Crypto Exchange Reveals Hackers Tried To Gain Access 159,000 Times The analysis is based on crucial support and resistance levels formed by the Fibonacci retracement levels. The analyst is convinced that the coin will retest the 61.8% of the swing high low of the recent 2021 to 2022 range, placing Bitcoin at $48,000 once it recovers.  The race to this level will be further driven by &#8220;halving momentum&#8221; and the &#8220;bear-to-bull transition from various indicators,&#8221; including the Relative Strength Index (RSI), Moving Average Convergence Divergence (MACD), and the on-balance volume of major exchanges, which appear oversold.  Feature image from Canva, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-09T21:50:56.000Z",
    "title": "Legal Battle Heats Up: DOJ Blocks FTX Founder from Discussing Anthropic AI Funds",
    "url": "https://www.crypto-news-flash.com/legal-battle-heats-up-doj-blocks-ftx-founder-from-discussing-anthropic-ai-funds/?utm_source=rss&utm_medium=rss&utm_campaign=legal-battle-heats-up-doj-blocks-ftx-founder-from-discussing-anthropic-ai-funds",
    "description": "<img width=\"1000\" height=\"623\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica.png 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-300x187.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-768x478.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-163x102.png 163w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-24x15.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-36x22.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ftx-exchange-review-blocknewsafrica-48x30.png 48w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The US Department of Justice has filed to bar Sam Bankman-Fried from citing Anthropic&#8217;s investment as a defense strategy. SBF trial has entered its second week with Caroline Ellison set to take the stand. Sam Bankman-Fried, the founder of bankrupt cryptocurrency exchange FTX Derivatives Exchange is facing restrictions on referencing the success of Artificial Intelligence [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-09T22:01:00.000Z",
    "title": "SEC Says Crypto Assets Have No ‘Inherent Value’ in New Court Motion Against Coinbase",
    "url": "https://dailyhodl.com/2023/10/09/sec-says-crypto-assets-have-no-inherent-value-in-new-court-motion-against-coinbase/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/sec-charges-scheme-returns.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/sec-charges-scheme-returns.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/sec-charges-scheme-returns.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/sec-charges-scheme-returns.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/sec-charges-scheme-returns.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/sec-charges-scheme-returns.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/sec-charges-scheme-returns.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Securities and Exchange Commission (SEC) has stated that digital assets have no inherent value. In a court motion filed last week against Coinbase, the top US crypto exchange by volume, the regulatory agency says that digital assets have no real value as they cannot generate profits on their own. &#8220;Real estate has &#8216;inherent [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/09/sec-says-crypto-assets-have-no-inherent-value-in-new-court-motion-against-coinbase/\">SEC Says Crypto Assets Have No ‘Inherent Value’ in New Court Motion Against Coinbase</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]