[
  {
    "source": "Cointelegraph",
    "date": "2023-08-28T18:02:03.000Z",
    "title": "SEC charges podcaster in first unregistered securities sales claim against NFT offering",
    "url": "https://cointelegraph.com/news/sec-charges-podcaster-first-unregistered-securities-sales-claim-against-nft-offering",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/ef9fa093-83bc-4bcd-ad2b-cad71111efb2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Impact Theory produces entertainment and educational podcasts and was “trying to build the next Disney” when it invited investors to purchase its NFTs. </p>\n                    <p><p>The United States Securities and Exchange Commission (SEC) has <a href=\"https://www.sec.gov/news/press-release/2023-163\" target=\"_blank\" rel=\"noopener nofollow\">charged</a> a media and entertainment company with conducting unregistered securities sales when it sold nonfungible tokens (NFTs) to investors between October and December 2021. </p><p>Impact Theory, a Los Angeles-based company that produces entertainment and educational content, including several podcasts, allegedly raised almost $30 million through the sales of NFTs it called Founder’s Keys, which were offered in three tiers. </p><p>The company “encouraged potential investors to view the purchase of a Founder’s Key as an investment into the business,” according to the SEC, and:</p><blockquote>“Impact Theory emphasized that it was ‘trying to build the next Disney,’ and, if successful, it would deliver ‘tremendous value’ to Founder’s Key purchasers.” </blockquote><p>The SEC found that the NFTs were investment contracts, and so securities, and the company violated the Securities Act of 1933 by selling them without registration. It <a href=\"https://www.sec.gov/files/litigation/admin/2023/33-11226.pdf\" target=\"_blank\" rel=\"noopener nofollow\">issued</a> a cease-and-desist order that Impact Theory has agreed to. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/get-ready-for-the-feds-to-start-indicting-nft-wash-traders\">Get ready for the feds to start indicting NFT traders</a></em></strong></p><p>Under the SEC order, the company was ordered to pay a total of more than $6.1 million in disgorgement, prejudgment interest and a civil penalty, without admitting or denying the agency’s findings. Further, a fund will be created to return money to investors in Founder’s Key NFTs. Impact Theory will destroy all Founder’s Keys in its possession or control, publish a notice of the order on its websites and social media channels, and <a href=\"https://cointelegraph.com/news/nft-platform-rarible-pledge-royalties-trading-volumes-jump\">not receive royalties</a> from future sales of the NFTs on the secondary market.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/fa9d660b-4832-4f8f-8d93-fd38d1105282.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>A Founder's Key \"Relentless\" NFT. Source: OpenSea</em></figcaption></figure><p>According to NFT Stats, a “Legendary” (top) tier Founder’s Key NFT last <a href=\"https://www.nft-stats.com/collection/impact-theory-founders-key\" target=\"_blank\" rel=\"noopener nofollow\">sold</a> two days ago for $1,468 as one of ten sales in the last week. The token supply is 13, 572, with 4,620 owners. The Founder’s Key is only one suite of NFTs the company offers. They did not respond to a Cointelegraph enquiry by the time of publication. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">How it started                  How it’s going <a href=\"https://t.co/REUcdwwY0k\">pic.twitter.com/REUcdwwY0k</a></p>&mdash; ZachXBT (@zachxbt) <a href=\"https://twitter.com/zachxbt/status/1696179530644308419?ref_src=twsrc%5Etfw\">August 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>This was the SEC’s first enforcement action involving an NFT, SEC commissioners Hester Peirce and Mark Uyeda <a href=\"https://www.sec.gov/news/statement/peirce-uyeda-statement-nft-082823?utm_medium=email&amp;utm_source=govdelivery\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in their dissent of the action. “The NFTs were not shares of a company and did not generate any type of dividend for the purchasers,” they wrote, adding</p><blockquote>“We share our colleagues’ worry about the type of hype that entices people to spend almost $30 million for NFTs seemingly without having a clear idea about how they will use, enjoy, or profit from them. […] This legitimate concern, however, is not a sufficient basis to pull the matter into our jurisdiction.” </blockquote><p>The promises made by Impact Theory and cited in the SEC order “are not the kinds of promises that form an investment contract.” The commissioners compared the promises made about the NFTs to statements made by sellers of collectibles. They went on to suggest a list of nine questions the agency should consider before pursuing NFTcases:</p><blockquote>“Regardless of what one thinks of the Howey analysis, this matter raises larger questions with which the Commission should grapple before bringing additional NFT cases.”</blockquote><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/pfp-holders-doomed-grails-famed-nft-artists-amazon-prime-nfts/\">Grails’ lucky dip of famous NFT artists, new hope for PFP holders: NFT Collector</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-28T17:53:32.000Z",
    "title": "Price analysis 8/28: SPX, DXY, BTC, ETH, BNB, XRP, ADA, DOGE, SOL, DOT",
    "url": "https://cointelegraph.com/news/price-analysis-8-28-spx-dxy-btc-eth-bnb-xrp-ada-doge-sol-dot",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/c5d8faa1-63bf-4d5c-94f9-27038bb1fef3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The S&P 500 is attempting a recovery, but Bitcoin and select altcoins are struggling to break above their respective resistance levels.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is down about 11% in August, <a href=\"https://cointelegraph.com/news/september-crash-5-things-bitcoin-btc-price-this-week\">just shy of the 13.88% fall</a> seen in the corresponding month in 2022, according to CoinGlass data. The picture does not look very bright for September either. History shows that every year since 2017, Bitcoin has declined in September. </p><p>Bloomberg Intelligence senior macro strategist <a href=\"https://cointelegraph.com/news/what-happened-in-crypto-on-the-weekend\">Mike McGlone is even more bearish</a> on Bitcoin. While speaking to Kitco News, McGlone warned that in case of a “global economic reset,” Bitcoin could nosedive to as low as $10,000.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/e846d631-0bd0-4fc8-a219-9f9e21c1f2b1.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>Although analysts have been giving both bullish and bearish targets, it is better to wait for the price to break out of the range before taking large bets. Typically, after a low volatile period, the volatility picks up but it is difficult to predict the direction of the breakout with certainty. </p><p>Do Bitcoin and the major altcoins show signs of a potential breakout? What are the important levels to watch out for? Let’s analyze the charts to find out.</p><h2>S&P 500 Index price analysis</h2><p>The S&amp;P 500 Index (SPX) turned down from the moving averages on Aug. 24 but the bears could not sustain the lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/b0f43d02-df5a-465b-bf94-d94fcd65f59a.png\"  /><figcaption style=\"text-align: center;\"><em>SPX daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=TVC%3ASPX\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>After the recovery on Aug. 25, the bulls maintained their buying pressure and pushed the index back to the moving averages. If buyers overcome this roadblock, the index could rally to the overhead resistance zone between 4,607 and 4,650. This zone is likely to witness a tough battle between the bulls and the bears.</p><p>If the price once again turns down from the moving averages, it will suggest that bears are fiercely defending the level. The pair may then slide to the pivotal support at 4,325. If this level breaks down, the index will complete a bearish head and shoulders pattern. That could start a correction toward the pattern target of 4,043.</p><h2>U.S. dollar index price analysis</h2><p>The bulls propelled the U.S. dollar index (DXY) above the downtrend line on Aug. 22, signaling that the correction may be over in the near term.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/6dd87522-3dac-47c8-ba68-a2ef59b58321.png\"  /><figcaption style=\"text-align: center;\"><em>DXY daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=TVC%3ADXY\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears tried to pull the price back below the level on Aug. 23 but the bulls held their ground. This suggests that the bulls successfully flipped the downtrend line into support. </p><p>The bulls will next attempt to push the price to 106. The rising 20-day exponential moving average (103) and the relative strength index (RSI) near the overbought territory indicate advantage to buyers.</p><p>If bears want to make a comeback, they will have to quickly pull the price back below the downtrend line. If they do that, the index may slide to the 50-day simple moving average (102).</p><h2>Bitcoin price analysis</h2><p>The bulls and the bears are not taking large bets as Bitcoin continues to trade inside the range between $24,800 and $26,833. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/55baa58c-b7ba-4570-8402-22bfc9d75911.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The downsloping moving averages and the RSI in the oversold zone indicate that bears are in command. However, sellers may find it difficult to resume the downward move because the bulls are likely to defend the $24,800 level with vigor.</p><p>If the price rebounds off the support, it will suggest that the BTC/USDT pair may continue its consolidation for some more time. On the upside, a rally above $26,833 will be the first sign of strength. That could push the price to the 50-day SMA ($28,806) and later to $30,000.</p><p>Contrarily, a break and close below the $24,800 support could start the next leg of the downtrend to $20,000.</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) has been trading near the crucial support at $1,626, indicating that the bears have kept up the selling pressure.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/38aa988b-3eb5-4b25-9568-3f47118c43b4.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AETHUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The failure of the bulls to start a strong rebound increases the risk of a break below $1,626. If that happens, the ETH/USDT pair could plummet to $1,550. This level may attract solid buying by the bulls. </p><p>If the price turns up from this level but turns down from $1,626, it will signal that bears have flipped the level into resistance. That may start a downtrend toward $1,368. The bulls will have to kick the price above the 20-day EMA ($1,716) to signal a comeback.</p><h2>BNB price analysis</h2><p>BNB’s (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) pullback is facing selling at the breakdown level of $220, indicating that the bears are trying to flip the level into resistance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/5b5af80f-dc48-47cd-aadc-b12501b1429d.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABNBUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>A minor positive in favor of the bulls is that they have not given up much ground from $220. This suggests that buyers are keeping up the pressure. The bulls will have to overcome the barrier at the 20-day EMA ($223) to start a relief rally to the resistance line. This level may again witness strong selling by the bears.</p><p>The first support on the downside is $213. If this level breaks down, the BNB/USDT pair could plunge to psychological support at $200. A break below this level may extend the decline to the next major support at $183.</p><h2>XRP price analysis</h2><p>The failure of the bulls to push XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) to the overhead resistance at $0.56 suggests a lack of demand at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/809f6573-5051-4c96-bb4b-99f13cc8482a.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AXRPUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The weak bounce off $0.50 may attract aggressive selling by the bears. If the $0.50 support gives way, the XRP/USDT pair could drop to the crucial support at $0.41. This level could witness strong buying by the bulls. If the price rebounds off this support, it will suggest that the pair may oscillate between $0.41 and $0.56 for a few more days.</p><p>Conversely, if the price turns up and breaks above $0.56, it will suggest the start of a sustained recovery. The pair may then climb to the 50-day SMA ($0.64).</p><h2>Cardano price analysis </h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) has been swinging inside the narrow range between $0.24 and $0.28 for the past few days. This suggests that the bulls are buying near the support and bears are selling at the resistance level. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/05261cd4-4313-4ed8-8ab2-22423f3029da.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AADAUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If buyers propel the price above the overhead resistance at $0.28, the ADA/USDT pair could start a rally to the 50-day SMA ($0.29). This level may act as an obstacle, but if overcome, the pair could shoot to $0.34.</p><p>The bears are likely to have other plans. They will try to defend the overhead resistance and tug the price to the support of the range at $0.24. If this level breaks down, the pair may slump to $0.22 and eventually to $0.20.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-traders-support-levels-btc-price-taps-26\"><em>Bitcoin traders pinpoint support levels as BTC price taps $26.2K</em></a></p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) has been trading between the strong support at $0.06 and the 20-day EMA ($0.07) for the past few days.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f6bb2eb1-9821-4326-bc28-5f53ead056ae.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOGEUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The 20-day EMA is sloping down and the RSI is in the negative territory, indicating that the bears have the edge. Sellers will try to sink the price below $0.06 and further strengthen their position. </p><p>Time is running out for the bulls. If they want to start a recovery, they will have to quickly drive the price above the 20-day EMA. If they do that, the DOGE/USDT pair could rally to the 50-day SMA ($0.07) and thereafter jump to $0.08.</p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) has been gradually drifting lower, indicating that the bears are pouncing on every minor relief rally.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/6c8eed8a-a7f3-4b0e-91e2-84939861f1cb.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ASOLUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The SOL/USDT pair could drop to the Aug. 22 intraday low of $19.35. If this level caves in, the selling could intensify and the pair may dive to $18 and eventually to the next major support at $15.60.</p><p>Contrary to this assumption, if the price turns up and breaks above $22.30, it will indicate solid buying at lower levels. The pair may first rise to the 50-day SMA ($23.61) and thereafter to the strong resistance at $26.</p><h2>Polkadot price analysis</h2><p>The bulls are trying to shove Polkadot (<a href=\"https://cointelegraph.com/polkadot-price-index\">DOT</a>) above the overhead resistance at the 20-day EMA ($4.64) but they are likely to encounter stiff resistance from the bears.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/fe386b57-81d8-4e69-abf8-bee603cdbf60.png\"  /><figcaption style=\"text-align: center;\"><em>DOT/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AMATICUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If the price turns down from the 20-day EMA, it will suggest that the sentiment remains negative and traders are selling on rallies. That could increase the likelihood of a retest of the crucial support at $4.22. If this support crumbles, the DOT/USDT pair may collapse to $4 and later to $3.88.</p><p>On the other hand, if buyers kick the price above the 20-day EMA, it will suggest the start of a stronger relief rally to the breakdown level of $5. This level could attract selling by the bears.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-28T18:00:12.000Z",
    "title": "SEC charges Impact Theory for ‘unregistered NFT offering,’ expanding enforcement actions to NFT market",
    "url": "https://cryptoslate.com/sec-charges-impact-theory-expanding-enforcement-actions-to-nft-market/",
    "description": "<p>The Securities and Exchange Commission (SEC) charged LA-based media and entertainment firm Impact Theory with conducting an unregistered offering of crypto asset securities in the form of non-fungible tokens (NFTs). According to an official press release by the SEC, the company raised approximately $30 million from hundreds of investors through their offering, violating federal securities laws. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-charges-impact-theory-expanding-enforcement-actions-to-nft-market/\">SEC charges Impact Theory for &#8216;unregistered NFT offering,&#8217; expanding enforcement actions to NFT market</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-28T18:00:00.000Z",
    "title": "\n                        US Unveils New Crypto Tax Reporting Guidelines\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/us-unveils-new-crypto-tax-reporting-guidelines",
    "description": "\n                        <p class=\"MsoNormal\" style=\"line-height: 150%;\">The US recently revealed new tax reporting rules as Congress and regulatory authorities focus on crypto users who may not be paying tax on their crypto-related activities.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Reuters reports the US Treasury Department issued a proposed rule on Friday, under which crypto brokers, including exchange and payment processors, would have to register new information on users&rsquo; crypto transactions to the Internal Revenue Service (IRS) in as soon as two years.&nbsp;</p>\nBiden Administration Proposes New Crypto Tax Reporting Mechanisms\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The IRS published proposed rules for crypto tax reporting on Friday, slated to give the industry its 1099 form. Under the proposed regulations, digital asset miners have been declared safe from future requirements.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">According to the 300-page proposal, the Treasury Department clarified the definition of a &ldquo;broker&rdquo; in terms of the crypto industry. The department defined how crypto companies and investors must comply with new tax reporting obligations. The proposal also addresses the issue of whether DeFi platforms and miners need to collect their users&rsquo; personal data.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Treasury introduced a custom tax form for the industry called the &ldquo;1099-DA&rdquo; that brokers can file.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Notably, the proposal exempts crypto miners from the tax rules, but some DeFi platforms may not receive similar exemptions.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">As the rules are still a proposal, it remains open to public commentary until October 30. The government must listen to participants in a set of public hearings scheduled for November 7 and 8. Treasury aims to have the rules for brokers take effect in 2025 for the 2026 tax filing season. </p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Treasury explained in a statement the goal of its proposed rules: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;This is part of a broader effort at Treasury to close the tax gap, address the tax evasion risks posed by digital assets, and help ensure that everyone plays by the same set of rules.&rdquo;&nbsp;</p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The proposal has been met with criticism from the digital asset industry. CEO of the DeFi Education Fund, Miller Whitehouse-Levine, commented on the Treasury&rsquo;s proposal and argued that it would not improve tax compliance nor would it make tax filings easier. He said in a statement: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;Today&rsquo;s proposal from the IRS is confusing, self-refuting, and misguided. It attempts to apply regulatory frameworks predicated on the existence of intermediaries where they don&rsquo;t exist.&rdquo;&nbsp;</p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-28T18:00:44.000Z",
    "title": "Charles Hoskinson Asserts Cardano Will Surpass All: Envisioning ADA as the Leading Global Cryptocurrency",
    "url": "https://news.bitcoin.com/charles-hoskinson-asserts-cardano-will-surpass-all-envisioning-ada-as-the-leading-global-cryptocurrency/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ada-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Charles Hoskinson Asserts Cardano Will Surpass All: Envisioning ADA as the Leading Global Cryptocurrency\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ada-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ada-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ada-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ada-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ada-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ada-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ada.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />During the Rare Evo blockchain and cryptocurrency convention, Cardano&#x2019;s founder Charles Hoskinson expressed his conviction that ADA will eventually become the &#x201C;biggest cryptocurrency in the world.&#x201D; Simultaneously, ADA&#x2019;s value has plummeted 15.2% against the U.S. dollar over the last month, earning it the seventh-largest spot based on crypto market capitalizations. Cardano Poised to Outshine Bitcoin [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T18:01:59.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T18:00:00.000Z",
    "title": "The Rise of $DOMI: How Domini is Redefining the Traditional Barriers to Art Investment",
    "url": "https://www.cryptopolitan.com/the-rise-of-domi-how-domini-is-redefining-the-traditional-barriers-to-art-investment/",
    "description": "The art market is a special industry that has existed for hundreds of years. Today, Domini ($DOMI) seeks to disrupt the current art ownership model by leveraging blockchain technology, trending NFTs, and tokenization. Crypto investors are studying Domini ($DOMI) at its early stages to determine its profit potential. So, without further ado, let’s delve into ... <a title=\"The Rise of $DOMI: How Domini is Redefining the Traditional Barriers to Art Investment\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-rise-of-domi-how-domini-is-redefining-the-traditional-barriers-to-art-investment/\" aria-label=\"More on The Rise of $DOMI: How Domini is Redefining the Traditional Barriers to Art Investment\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T17:48:26.000Z",
    "title": "On China’s economy: Markets send surprising message",
    "url": "https://www.cryptopolitan.com/china-economy-markets-surprising-message/",
    "description": "As China grapples with declining property prices and financial challenges among its large real estate developers, the alarm bells are ringing for some observers. They see shades of the 2008 financial crisis, predicting doom for China&#8217;s economy due to years of alleged over-investment and unproductive ventures. But surprisingly, markets are telling a different story, one ... <a title=\"On China&#8217;s economy: Markets send surprising message\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-economy-markets-surprising-message/\" aria-label=\"More on On China&#8217;s economy: Markets send surprising message\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-28T18:00:06.000Z",
    "title": "Traders’ Patience Fades: Bitcoin Price Stuck At $26,000, But Can It Hold?",
    "url": "https://www.newsbtc.com/bitcoin-news/traders-patience-fades-bitcoin-price-stuck-at-26000-but-can-it-hold/",
    "description": "The Bitcoin price has barely moved a few hundred dollars since late last week, but a vital metric hints at another aggressive move. In the meantime, the cryptocurrency is likely to keep trading sideways until another liquidation event flips momentum into a specific direction. Related Reading: JP Morgan Explains Why Bitcoin Price May Not Fall Further As of this writing, Bitcoin trades at $26,100 with sideways movement in the last 24 hours. In the previous seven days, BTC recorded similar price action while other tokens in the top 10 moved in tandem except for Binance Coin (BNB) and Solana (SOL). Bitcoin Price On Brink Of New Liquidation Event? As the Bitcoin spot price trends sideways, most of the action turns to option contracts where “smart money” is positioning for a big move. According to a report from derivatives platform Deribit, traders in the sector are betting on the long side solely based on the potential approval of a Bitcoin price spot Exchange Traded Fund (ETF) in the US. Thus, most traders have been buying call (buy) contracts for Bitcoin to rise above $30,000 by the end of the year. These might have been betting on the regulator and courts to announce a decision from the many petitions or because of the case filed by asset manager Grayscale. Neither of these events has come to fruition, which has led to a decline in the overall sentiment across derivatives. As the spike in call buyers suggested, this sentiment has been primarily bullish but will likely turn negative as the US stalls its Bitcoin price spot ETF decision. Deribit stated: Constant positivity on ETF approval has been the main driver for medium-long-term Call buying. And yet as this moves out the timeline from Q3 to Q4 to even &#8217;24, patience is running thin. With delays, drifting confidence &#38; macro headwinds, we start to observe downside hedges. These hedges might have contributed to the Bitcoin price&#8217;s recent action as operators sell their spot position to cover their call contracts with late expiration. In that sense, the main catalyzer was the liquidation cascade that the cryptocurrency experienced when moving around $29,000. Related Reading: CryptoQuant Discusses How Bitcoin Has Changed In Past 1 Year At that time, as BTC trended sideways, open interest across the derivatives sector trended to the upside. As pointed out by an analyst, a similar situation is taking place currently and could lead to another aggressive move with a downside potential. #Bitcoin Open Interest continues to rise again. Price is still moving sideways. I would assume that we&#8217;d see some proper action over the next couple of days as long as open interest keeps rising at this pace. pic.twitter.com/VV2xAds0t4 — Daan Crypto Trades (@DaanCrypto) August 28, 2023 Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-28T18:00:31.000Z",
    "title": "Shiba Sets Sights on $0.00001; This New AI Project is Gaining Strong Momentum in the NFT Community Here’s Why",
    "url": "https://www.crypto-news-flash.com/shiba-sets-sights-on-0-00001-this-new-ai-project-is-gaining-strong-momentum-in-the-nft-community-heres-why/",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-143.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-143.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-143-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-143-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-143-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-143-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the dynamic world of cryptocurrencies, market movements are often as intriguing as they are unpredictable. As Shiba Inu&#8217;s price aims for the ambitious target of $0.00001, investors find themselves navigating a sea of possibilities. Amidst this backdrop, a new and innovative project, Borroe ($ROE), is rapidly gaining traction within the NFT community. In this [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-28T18:00:16.000Z",
    "title": "Imagine Buying Bitcoin at a Dollar, Hot New BTC Fork Making Waves In DeFi",
    "url": "https://www.crypto-news-flash.com/imagine-buying-bitcoin-at-a-dollar-hot-new-btc-fork-making-waves-in-defi/",
    "description": "<img width=\"512\" height=\"283\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-147.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-147.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-147-300x166.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Decentralized Finance (DeFi) began with Bitcoin (BTC). And while many wish to get BTC, its high value makes it challenging. However, a new Bitcoin fork known as Bitcoin Spark (BTCS) is making waves in DeFi, with analysts suggesting it presents an opportunity akin to buying BTC at a dollar. What is a Bitcoin fork? A [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-28T17:48:22.000Z",
    "title": "Harness the Power of VeChain: Tokenization, NFTs, and APIs Made Easy on Vorj.io",
    "url": "https://www.crypto-news-flash.com/harness-the-power-of-vechain-tokenization-nfts-and-apis-made-easy-on-vorj-io/",
    "description": "<img width=\"1201\" height=\"768\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeChain-RuskaDesign-Shutterstock.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"VeChain VET\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeChain-RuskaDesign-Shutterstock.jpg 1201w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeChain-RuskaDesign-Shutterstock-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeChain-RuskaDesign-Shutterstock-1024x655.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeChain-RuskaDesign-Shutterstock-768x491.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeChain-RuskaDesign-Shutterstock-24x15.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeChain-RuskaDesign-Shutterstock-36x23.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeChain-RuskaDesign-Shutterstock-48x31.jpg 48w\" sizes=\"(max-width: 1201px) 100vw, 1201px\" />The Vorj.io platform is already live and will allow users to create tokens, mint NFTs, as well as integrate APIs. Apart from the smart contracts&#8217; interoperability, VORJ offers Blockchain data APIs, Carbon APIs, NFT APIs, Transaction executors, contract push notifications, contract deployer, etc. VeChain&#8217;s Web3-as-a-Service VORJ is now live, up and running in action once [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-28T18:01:00.000Z",
    "title": "Crypto Analyst Says Bitcoin’s Price Could Still Drop to $16,000",
    "url": "https://coinedition.com/crypto-analyst-says-bitcoins-price-could-still-drop-to-16000/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Analyzing_Bitcoin_MVRV_Ratio_A_Guide_to_Market_Trends_and_Predictions.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Crypto Analyst Says Bitcoin’s Price Could Still Drop to $16,000\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Analyzing_Bitcoin_MVRV_Ratio_A_Guide_to_Market_Trends_and_Predictions.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Analyzing_Bitcoin_MVRV_Ratio_A_Guide_to_Market_Trends_and_Predictions-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Analyzing_Bitcoin_MVRV_Ratio_A_Guide_to_Market_Trends_and_Predictions-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Analyzing_Bitcoin_MVRV_Ratio_A_Guide_to_Market_Trends_and_Predictions-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Analyzing_Bitcoin_MVRV_Ratio_A_Guide_to_Market_Trends_and_Predictions-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Analyzing_Bitcoin_MVRV_Ratio_A_Guide_to_Market_Trends_and_Predictions-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto analyst Crypto Banter says Bitcoin could increase or decline further in the coming days. The analyst says the current bear has spanned 490 days, making it the longest. Bitcoin needs to hold its $24k support to avoid a steeper decline. Crypto analyst Miles Deutscher, known as Crypto Banter on YouTube, in a recent post, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-analyst-says-bitcoins-price-could-still-drop-to-16000/\">Crypto Analyst Says Bitcoin’s Price Could Still Drop to $16,000</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-28T18:05:32.000Z",
    "title": "Pantera Capital Doubles Down on Big Bitcoin Price Prediction for 2025 – Here’s Its Target",
    "url": "https://dailyhodl.com/2023/08/28/pantera-capital-doubles-down-on-big-bitcoin-price-prediction-for-2025-heres-its-target/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/trader-christmas-rally-bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/trader-christmas-rally-bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/trader-christmas-rally-bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/trader-christmas-rally-bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/trader-christmas-rally-bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/trader-christmas-rally-bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/trader-christmas-rally-bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets-focused investment firm Pantera Capital has the conviction that Bitcoin (BTC) will spark a parabolic bull run after the halving event next year. In its latest blockchain letter, the firm, which has $3.5 billion in assets under management, says Bitcoin will likely increase by more than 466% from its current value, hitting six figures [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/28/pantera-capital-doubles-down-on-big-bitcoin-price-prediction-for-2025-heres-its-target/\">Pantera Capital Doubles Down on Big Bitcoin Price Prediction for 2025 – Here’s Its Target</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]