[
  {
    "source": "Decrypt",
    "date": "2023-09-15T13:43:45.000Z",
    "title": "How to Use Yieldflow: the DeFi Protocol for Passive Growth of Digital Assets",
    "url": "https://decrypt.co/155780/how-to-use-yieldflow-the-defi-protocol-for-passive-growth-of-digital-assets",
    "description": "While centralized exchanges expose customers to security risk in the event that they collapse, and to unpredictable liquidity, inflexible staking rules, and more, YieldFlow aims for a smooth user experience governed by trust, security, and decentralization."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-15T13:41:06.000Z",
    "title": "Japan to allow start-ups to raise funds by issuing crypto instead of stocks: Report",
    "url": "https://cointelegraph.com/news/japan-allows-start-ups-raise-funds-crypto-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/7b6d9702-85c7-4155-89e2-e2a31a3eb800.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to local media, Nikkei.com, this updated system is specifically applicable to a category of funds known as Investment Business Limited Partnerships (LPS).</p>\n                    <p><p>The Japanese government reportedly plans to permit start-ups to raise public funds through the issuance of crypto, assets, such as currencies, instead of stocks, local media has reported. </p><p>According to Japanese financial news site Nikkei.com, this updated system is specifically <a href=\"https://www.nikkei.com/article/DGXZQOUA012TT0R00C23A7000000/\" target=\"_blank\" rel=\"noopener nofollow\">applicable</a> to a category of funds known as Investment Business Limited Partnerships (LPS). So far, Japan has lagged behind the rest of the world on embracing digital assets. However, this has been changing in recent months.</p><p>Japan's primary financial regulatory authority, the Financial Services Agency (FSA), made a significant move on August 31, <a href=\"https://cointelegraph.com/news/crypto-japanese-regulator-seeks-to-scrap-unrealized-gains-tax-on-crypto\">seeking to amend the tax code related to cryptocurrencies,</a> thereby taking a more active role in cryptocurrency regulation. The noteworthy move is aimed at exempting local businesses from the year-end \"unrealized gains\" tax on cryptocurrencies.</p><p>Japanese Prime Minister Fumio Kishida reaffirmed the country’s commitment to fostering the Web3 industry, in a keynote address on day one of the WebX conference in Tokyo, Japan. He highlighted its potential to transform the internet and kindle social change. </p><p>Binance recently confirmed to Cointelegraph that it would<a href=\"https://cointelegraph.com/news/binance-web3-japan-to-promote-web3-as-binance-announces-imminent-launch\"> offer its services to Japanese cryptocurrency users</a> from August onwards. This happened after the company acquired the local exchange platform Sakura Exchange Bitcoin (SEBC) in November 2022, which acquisition of the Japanese-registered crypto exchange service provider paved the way for Binance’s reentry into the country.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/kbw-2023-avalanche-partners-japan-loyalty-marketing-company-onboard-100-million-users-web3\"><strong><em>Marketing company wants 90% of Japanese population on Web3: KBW 2023</em></strong></a></p><p>Cointelegraph has reached out to the Japanese government for more details and is yet to receive feedback at the time of publication.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market. Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-15T14:00:25.000Z",
    "title": "Bitcoin’s Mempool Congestion: Unconfirmed Transactions Approach 700,000 in September",
    "url": "https://news.bitcoin.com/bitcoins-unconfirmed-transactions-approach-700000/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/gmax-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin&#039;s Mempool Congestion: Unconfirmed Transactions Approach 700,000 in September\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/gmax-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gmax-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gmax-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gmax-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gmax-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gmax-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gmax.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Over the last fortnight, the quantity of unconfirmed bitcoin (BTC) transactions has consistently exceeded the 500,000 mark, nearly touching 700,000 on September 6, 2023. Metrics indicate that Bitcoin&#x2019;s mempool, a shortened term for &#x201C;memory pool,&#x201D; has not completely cleared in more than four months, dating back to April 22, 2023. Bitcoin&#x2019;s Backlog Swells: Unconfirmed Transactions [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-15T14:08:55.000Z",
    "title": "Bull Bitcoin taps SINPE Movil for Costa Rica expansion",
    "url": "https://www.cryptopolitan.com/bull-bitcoin-sinpe-costa-rica-expansion/",
    "description": "In a significant move amid the global expansion of cryptocurrency companies, Bull Bitcoin, a Canadian Bitcoin exchange, has announced its entry into the Costa Rican market. Bull Bitcoin has achieved a milestone by becoming the first Bitcoin enterprise to leverage SINPE Movil, the primary payment provider in Costa Rica, to offer a Bitcoin on-and-off-ramp service. ... <a title=\"Bull Bitcoin taps SINPE Movil for Costa Rica expansion\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bull-bitcoin-sinpe-costa-rica-expansion/\" aria-label=\"More on Bull Bitcoin taps SINPE Movil for Costa Rica expansion\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-15T13:59:21.000Z",
    "title": "Chainalysis reveals new update about North Korean hackers",
    "url": "https://www.cryptopolitan.com/chainalysis-update-north-korean-hackers/",
    "description": "In a significant development, the amount of cryptocurrency stolen by North Korea-linked hackers has seen a substantial decrease, plunging by 80% from the staggering figures reported in 2022. However, blockchain analysis expert Chainalysis has cautioned against interpreting this decline as a sign of progress in cybersecurity, as the threat remains ever-present. As of September 14, ... <a title=\"Chainalysis reveals new update about North Korean hackers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainalysis-update-north-korean-hackers/\" aria-label=\"More on Chainalysis reveals new update about North Korean hackers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-15T13:57:08.000Z",
    "title": "AI Progress in Earthquake Prediction: A Glimpse into the Future",
    "url": "https://www.cryptopolitan.com/ai-progress-in-earthquake-prediction/",
    "description": "In light of recent catastrophic seismic events in Morocco, Turkey, and Syria, scientists are redoubling their efforts to harness the potential of artificial intelligence (AI) for earthquake prediction. AI&#8217;s remarkable capabilities in this field offer renewed hope for bolstered disaster preparedness and mitigation. Unveiling earthquake prediction through AI The sheer computational prowess of AI comes ... <a title=\"AI Progress in Earthquake Prediction: A Glimpse into the Future\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-progress-in-earthquake-prediction/\" aria-label=\"More on AI Progress in Earthquake Prediction: A Glimpse into the Future\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-15T13:50:31.000Z",
    "title": "Is Binance in trouble?",
    "url": "https://crypto.news/is-binance-in-trouble/",
    "description": "Amidst regulatory confrontations and high-profile exits, Binance finds itself at a crossroads. This analysis looks into what's happening with Binance to find out if the exchange can hold its ground."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-15T14:00:36.000Z",
    "title": "Bitcoin Forecast: Analyst Who Predicted 2022 Bottom Unveils New Long Positions For BTC",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-forecast-analyst-who-predicted-2022-bottom-unveils-new-long-positions-for-btc/",
    "description": "In a recent YouTube interview with TechnicalRoundup, crypto Analyst DonAlt revealed he had purchased Bitcoin after the asset fell below the $25,000 level. According to the analyst also predicted the crypto market bottom in 2022, he had two choices before opening the new BTC position DonAlt Shares Insights On Bitcoin’s Next Price Moves Explaining the reasoning behind his decision to purchase Bitcoin, DonAlt told TechnicalRoundup: We&#8217;re at the point where you could make an argument for buying here [around $26,000]. And if you&#8217;re wrong, you get stopped out, and you get to buy at $19,000. The problem with kind of not doing anything, and the reason why I took a trade – I bought like a little bit, not too much, but a little bit of Bitcoin – is, basically, because I’m just guessing that I will not get an entry otherwise. Furthermore, DonAlt stated that if his prediction is correct, he will exit the trade after attaining a profit level of double-digit percentage points. According to him, his profit target is $30,000, but with a neutral sentiment on the trade.  &#8220;I’m not too bullish. I’m not too bearish. The reason why I kind of think this is an interesting trade in general is, basically, because I think if this fails… if you break down here [below $24,900]. I think we’re going to start capitulating. And then we’re going to start capitulating proper. And we’re going to go to $20,000. So, you basically have an invalidation around $25,000 right now,&#8221; he added. Meanwhile, bitcoin trades at $26,638 today, September 15, above the $24,900 capitulation zone. And according to another crypto analyst, Ali Charts, the TD sequential indicator has displayed a buy signal for BTC on the weekly chart. However, he believes that for this sentiment to be confirmed, BTC must close this week above $25,600. If this happens, BTC could rally to $28,350 or up to $31,800.  Crypto analyst Titan of Crypto, with over 44,000 Twitter followers, also chimed in on the asset, saying that past performance does not guarantee future results. However, he believes comparing the present price action to previous ones is important. He said that if BTC follows its past price action and there is no negative event before its halving, it can attain $37,500 before a pullback.  Will Bitcoin Hit The $30,000 Mark? Bitcoin has entered an accumulation phase after breaking above the 38.2% Fibonacci Level ($26,406). The buyers control the market, as evidenced by the four consecutive green candles on the daily chart.  However, it faces resistance at the 50% Fib level ($26,738). If the buyers continue to mount pressure, BTC will rise to the 61.8% Fib level ($27,069).  Also, the Relative Strength Index (RSI) indicator displays a value of 52.11 and is rising from the neutral zone into the buy zone as more traders enter long positions. Furthermore, the Moving Average Convergence/Divergence (MACD) is above its signal liner and displays a strong buy signal.  Related Reading: XRP Price Prediction – Key Reasons Why Bulls Could Aim Rally To $0.60 The green Histogram bars confirm that BTC is in a positive price trend. BTC will likely continue its rally in the coming weeks if the buyers sustain their pressure and break above the $26,738 resistance level. Although if traders begin to take profit, then a brief retracement will likely occur before a continuation of the uptrend.  Featured image from Pixabay and chart from TradingView.com"
  }
]