[
  {
    "source": "Bitcoin.com",
    "date": "2023-11-12T09:30:51.000Z",
    "title": "Near Foundation and Polygon Labs Partner to Build Zero-Knowledge ‘Prover’ for WASM Chains",
    "url": "https://news.bitcoin.com/near-foundation-and-polygon-labs-partner-to-build-zero-knowledge-prover-for-wasm-chains/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2040640298-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Near Foundation and Polygon Labs Partner to Build Zero-Knowledge &#039;Prover&#039; for WASM Chains\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2040640298-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2040640298-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2040640298-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2040640298-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2040640298-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2040640298-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_2040640298.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Near Foundation and Polygon Labs recently announced that they would build &#8220;a zero-knowledge (ZK) prover for WASM blockchains.&#8221; For WASM chains using the zkWASM prover, settling transactions will be more efficient and cost-effective with maximum security guarantees. Transaction Settling More Efficient and Cost-Effective Near Foundation, the organization supporting the development of the NEAR ecosystem, has [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-12T09:28:46.000Z",
    "title": "Boom! Cronos Unleashes 57% Weekend Explosion, Beating All In The Top 100 Crypto Ranking",
    "url": "https://www.newsbtc.com/altcoin/boom-cronos-unleashes-57-weekend-explosion-beating-all-in-the-top-100-crypto-ranking/",
    "description": "Cronos has experienced a robust and sustained bullish trajectory over the recent weeks. Over the course of the past seven days, it has consistently surged, reaching a solid pinnacle, a level not witnessed in months. At the time of writing, Cronos (CRO) showcased its impressive strength, outperforming some of the most prominent names in the top 100 cryptocurrency ranking over the weekend. With a remarkable 7% surge in the last 24 hours and a commanding 57% rally within the seven-day timeframe, as reported by Coingecko, Cronos is not just making waves but also setting itself apart as a standout performer in the current market dynamics. Source: Coingecko Cronos&#8217; Outstanding Performance In The Crypto Market Notably, the CRO token has surpassed the descending trendline, which links the highest points observed since February. This positive momentum underscores the current strength and upward momentum of Cronos, indicating a significant shift in its market dynamics. Related Reading: Solana Breaks Past $54 On Steady Price Momentum – Will SOL Hit $60 This Month? The market&#8217;s perception of the asset as overvalued at its current levels is suggested by the notably high Relative Strength Index (RSI) at 97.45, firmly placing it within the overbought zone. This could lead to a potential retracement or consolidation in the near future. However, in the short term, the cryptocurrency exhibits a robust bullish trend, as indicated by the 50-day Exponential Moving Average positioned at $0.0630, with the current trading price of approximately $0.1033 surpassing previous resistance levels. Targeting the key resistance point at $0.10, buyers are likely to drive the coin&#8217;s outlook to continue soaring. The ADX indicator has been consistently rising, and the Stochastic Oscillator has reached the overbought point. Total crypto market cap currently at $1.38 trillion. Chart: TradingView.com This, coupled with the increased volume, is a positive signal. Additionally, the CRO price has surged above all moving averages, indicating strong momentum in the market. Market Dynamics And Potential Scenarios The future course of cryptocurrencies is contingent upon the distribution of power between bulls and bears. In the case of Cronos, if the bulls are able to successfully move the price above $0.08352, we may expect more upward momentum, which would be good. CRO weekly price action. Source: Coingecko Furthermore, the coin&#8217;s ability to sustain its current level could potentially act as a catalyst for a robust push towards testing the resistance at $0.0900 before the month concludes. On the contrary, if the bears seize control and initiate a trend reversal, causing the price to lose momentum, a test of the $0.07390 support level becomes probable. Related Reading: Kaspa Rules The Weekend Top 100 Coin Roster With 63% Rally – Details Looking ahead, a continued decline might prompt the coin to challenge the lower support level of $0.06696 in the upcoming days, emphasizing the importance of monitoring market dynamics for potential shifts in sentiment and price action. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Vauld"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-12T09:12:32.000Z",
    "title": "Top 5 Low to Mid-Cap POW Coins to Keep an Eye On",
    "url": "https://www.altcoinbuzz.io/spotlight/top-5-low-to-mid-cap-pow-coins-to-keep-an-eye-on/",
    "description": "<p>We are keeping Bitcoin and Litecoin separate from this list. Here are 5 PoW coins positioned well for the next cycle. You can subscribe to Altcoin Buzz Alpha to have more analysis of this type. 1) Iron fish Iron Fish is a small-cap gem contender. It blends privacy, proof of work, and view-only/read-only capability. The [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/spotlight/top-5-low-to-mid-cap-pow-coins-to-keep-an-eye-on/\">Top 5 Low to Mid-Cap POW Coins to Keep an Eye On</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-12T09:15:47.000Z",
    "title": "Lido Finance (LDO) Targets $2.35 on Account of Surging AuM",
    "url": "https://coinedition.com/lido-finance-ldo-targets-2-35-on-account-of-surging-aum/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Lido-DAO-Price-Analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Lido-DAO-Price-Analysis\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Lido-DAO-Price-Analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Lido-DAO-Price-Analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Lido-DAO-Price-Analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/Lido-DAO-Price-Analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Lido-DAO-Price-Analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Lido-DAO-Price-Analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>As one of the largest liquid staking projects in the crypto industry, Lido Finance (LDO) has held on to its place at the top of the chain in the sector. One of the reasons for this is the way it offers its users a staked ETH token called Lido stETH to begin their staking journey. [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/lido-finance-ldo-targets-2-35-on-account-of-surging-aum/\">Lido Finance (LDO) Targets $2.35 on Account of Surging AuM</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]