[
  {
    "source": "Cointelegraph",
    "date": "2023-09-19T07:48:56.000Z",
    "title": "CoinEx hack - compromised private keys led to $70M theft ",
    "url": "https://cointelegraph.com/news/coinex-compromised-private-keys-behind-70-million-hack",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/3b60badc-8c5e-4123-b879-217dd1865750.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>CoinEx confirms that compromised private keys gave hackers access to hot wallets, leading to $70 million hack. </p>\n                    <p><p>Hong Kong-based cryptocurrency exchange CoinEx has revealed that compromised private keys allowed hackers to steal over $70 million of tokens, while the team looks to open lines of communication to claw back funds.</p><p>CoinEx representatives unpacked the finer details of their continuing investigation to Cointelegraph as the team works to build and deploy a new wallet architecture to restore impacted users and functionality of the platform.</p><p>Despite an estimated $70 million worth of cryptocurrency being stolen from the platform, the exchange claims this amount represents a small percentage of its total assets under management. CoinEx stated that affected users will be compensated entirely for any lost funds.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">2/ We&#39;ve finalized our strategy to resume withdrawals and are set to progressively resume these services within 7 working days. Ensuring 100% asset security remains our top priority before reactivating withdrawal functionalities.</p>&mdash; CoinEx Global (@coinexcom) <a href=\"https://twitter.com/coinexcom/status/1703686758079271258?ref_src=twsrc%5Etfw\">September 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>CoinEx said that it was still investigating the identity of those responsible for the security breach, which handful of blockchain security firms are attributing to to North Korean “Lazarus Group” hackers.</p><blockquote>“Additionally, we have opened communication channels to the hackers in hopes of proactive engagement toward a mutually agreeable resolution.”</blockquote><p>The exchange explained that a preliminary investigation pinned the root cause to a compromised private key for its hot wallets. These were used to store exchange assets for carrying out deposits and withdrawals.</p><p><a href=\"https://cointelegraph.com/news/new-york-bans-coin-ex-exchange-seizes-1-7m-crypto-assets\"><strong><em>Related: New York bans CoinEx exchange, seizes $1.7M in crypto assets</em></strong></a></p><p>CoinEx suspended its withdrawal service to avoid further losses, patched system vulnerabilities and transferred remaining assets from the affected hot wallets. The exchange told Cointelegraph that it expects to resume withdrawals progressively within 7 working days.</p><blockquote>“Our team is currently focused on building and deploying an entirely new and robust wallet system to handle activities within the 211 chains and 737 assets.”</blockquote><p>As Cointelegraph initially reported, CoinEx first <a href=\"https://cointelegraph.com/news/coinex-crypto-exchange-suspected-hacked-crypto-moved\">flagged</a> “anomalous withdrawals” from one of its hot wallets on Sept. 12, beginning with a transfer of 4,947 Ether (ETH). The hackers then began to withdraw large amounts of other tokens to the same address.</p><p>The value of stolen funds was first estimated at $27 million but has doubled in the week following the incident. </p><p>North Korean hackers have preyed on the cryptocurrency space for the past few years and have been responsible for the largest thefts in the space to date. The 2022  Axie Infinity Ronin Bridge hack alone saw over $650 million stolen.</p><p>Blockchain analytics firm Chainalysis estimates that North Korean hackers have stolen around $340 million of cryptocurrency in 2023. This <a href=\"https://cointelegraph.com/news/north-korean-crypto-hacks-down-but-could-change-overnight-chainalysis\">number is now expected to rise</a> with attributions made to the CoinEx hack as well a $41 million hack of cryptocurrency gambling platform <a href=\"https://cointelegraph.com/news/crypto-gambling-site-stake-sees-16-million-withdrawals-possible-hack\">Stake on Sept. 4</a>.</p><p>Magazine: <a href=\"https://cointelegraph.com/magazine/web3-gamer-pubg-20m-raise-shardbound/\"><em>Web3 Gamer: PUBG devs’ Web3 project, Animoca’s $20M raise, Shardbound review</em></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-19T08:04:10.000Z",
    "title": "QuickSwap and Orbs Tackle DeFi Liquidity Fragmentation",
    "url": "https://cryptodaily.co.uk/2023/09/quickswap-and-orbs-tackle-defi-liquidity-fragmentation",
    "description": "In response to DeFi's liquidity fragmentation challenges, the Liquidity Hub is poised to streamline trading for DEX users."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-19T08:00:15.000Z",
    "title": "Judge Refuses To Make Ruling In SEC-Binance Document Dispute",
    "url": "https://cryptodaily.co.uk/2023/09/judge-refuses-to-make-ruling-in-sec-binance-document-dispute",
    "description": "A US judge has refused to order Binance.US to make its executives available for dispositions or for the United States Securities and Exchange Commission (SEC) to back down from demanding more documents."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-19T07:50:20.000Z",
    "title": "Is The Bitcoin Price Rally Sustainable? On-Chain Data Provides Crucial Insights",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-rally-sustainable-on-chain-data/",
    "description": "Bitcoin has been trending up since hitting a local low below $25,000 on September 11th. Yesterday&#8217;s rally to $27,435 marked a 10% increase from the recent low. As NewsBTC reported, the rally was largely led by the futures market and a massive increase in open interest of over $1 billion, more than half of which was flushed out when BTC fell back below $27,000. Despite this, BTC is up around 7.5% from last week&#8217;s low. A reason to be bullish? Glassnode Report Sheds Light On Market Sentiment According to Glassnode, the Realized HODL Ratio (RHODL) serves as a crucial market sentiment indicator. It measures the balance between investments in recently moved coins (those held for less than a week) and those in the hands of longer-term HODLers (held for 1-2 years). The RHODL Ratio for the year 2023 is flirting with the 2-year median level. While this indicates a modest influx of new investors, the momentum behind this shift remains relatively weak. Glassnode&#8217;s Accumulation Trend Score further elaborates on this trend. It shows that the current recovery rally of 2023 has been significantly influenced by investor FOMO (Fear of Missing Out), with noticeable accumulation patterns around local price tops exceeding $30,000. This behavior contrasts sharply with the latter half of 2022, where newer market entrants showed resilience by accumulating Bitcoin at lower price levels. The Realized Profit and Loss indicators also reveal a complex picture. These metrics measure the value change of spent coins by comparing the acquisition price with the disposal price. In 2023, periods of intense coin accumulation were often accompanied by elevated levels of profit-taking. This pattern, which Glassnode describes as a &#8220;confluence,&#8221; is similar to market behavior seen in peak periods of 2021. Related Reading: End Of The Road? Why A Bitcoin Price Surge to $28,500 Could Lead To A Crash An assessment of Short-Term Holders (STH) uncovers a precarious situation. A staggering majority, more than 97.5% of the supply procured by these newcomers, is currently operating at a loss, levels unseen since the infamous FTX debacle. Using the STH-MVRV and STH-SOPR metrics, which quantify the magnitude of unrealized and realized profits or losses, Glassnode elucidates the extreme financial pressures recent investors have grappled with. Market Confidence Remains Low The report also delves into the realm of market confidence. A close examination of the divergence between the cost basis of two investor subgroups — spenders and holders — offers an indication of prevailing market sentiment. As the market reeled from the price plummet from $29k to $26k in mid-August, an overwhelmingly negative sentiment was evident. This was manifested as the cost basis of spenders fell sharply below that of holders, a clear signal of prevalent market panic. Related Reading: Why Is Bitcoin Price Up Today? BTC Climbs Above $27,000 To offer a clearer visualization, Glassnode has normalized this metric in relation to the spot price. A crucial observation is the cyclical nature of negative sentiment during bear market recovery phases, usually lasting between 1.5 to 3.5 months. The market recently plunged into its first negative sentiment phase since 2022&#8217;s conclusion. Currently, the trend lasts 20 days, which could mean that the end has not yet been marked by the recent rally, if history repeats itself. However, if there is a sustained bounce back into positive territory, it could be indicative of renewed capital inflow, signifying a return to a more favorable stance for Bitcoin holders. In conclusion, Glassnode&#8217;s on-chain data reveals a Bitcoin market that is currently in a state of flux. Although 2023 has seen new capital entering the market, the influx lacks strong momentum. Market sentiment, especially among short-term holders, is decidedly bearish. These findings indicate that caution remains the watchword, with underlying market sentiment offering mixed signals about the sustainability of the current Bitcoin rally. At press time, BTC traded at $26,846 after being rejected at the 23.6% Fibonacci retracement level (at $27,369) in the 4-hour chart. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-19T08:00:39.000Z",
    "title": "Remember The Man Who Made Millions from Ethereum ($ETH)? He’s Discovered a New Crypto Gem",
    "url": "https://www.crypto-news-flash.com/remember-the-man-who-made-millions-from-ethereum-eth-hes-discovered-a-new-crypto-gem/?utm_source=rss&utm_medium=rss&utm_campaign=remember-the-man-who-made-millions-from-ethereum-eth-hes-discovered-a-new-crypto-gem",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-110.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-110.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-110-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />According to savvy investors, the only way to become a crypto millionaire is by investing early in high-value tokens. Crypto investors like Cooper Turley, Glauber Contessoto, and Erik Finman became millionaires by getting in on Ethereum ($ETH) in the early days. Today, smart investors looking to capture the kind of high returns only available to [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-19T07:55:50.000Z",
    "title": "Court XRP Ruling vs. SEC Comments: Which Carries Weight in NYDFS’ Sight?",
    "url": "https://coinedition.com/court-xrp-ruling-vs-sec-comments-which-carries-weight-in-nydfs-sight/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/SEC-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SEC-XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/SEC-3.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/SEC-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/SEC-3-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/SEC-3-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/SEC-3-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The XRP community is pondering the essence of the U.S. court ruling affirming that XRP is a digital asset, not a security, amid recent action from the U.S. regulatory landscape. In particular, the New York Department of Financial Services (DFS) has recently outlined updates to its digital asset oversight regulations. Among the changes, DFS introduced [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/court-xrp-ruling-vs-sec-comments-which-carries-weight-in-nydfs-sight/\">Court XRP Ruling vs. SEC Comments: Which Carries Weight in NYDFS’ Sight?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]