[
  {
    "source": "CoinDesk",
    "date": "2023-10-03T11:41:29.000Z",
    "title": "Friend.Tech Users Targeted by SIM Swap Attack, Several Ether Drained",
    "url": "https://www.coindesk.com/tech/2023/10/03/friendtech-users-targeted-by-sim-swap-attack-several-ether-drained/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Users tie Friend.Tech accounts to real-world X profiles and phone numbers - which increases security risks."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-03T12:02:58.000Z",
    "title": "Protocol Village: LayerZero Joins With Conflux on China Telecom SIM Card",
    "url": "https://www.coindesk.com/tech/2023/10/02/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the week of Oct. 2-8, with live updates throughout."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-03T11:58:17.000Z",
    "title": "Samsung to develop AI chips with Canadian startup Tenstorrent  ",
    "url": "https://cointelegraph.com/news/samsung-ai-chips-canadian-startup-tenstorrent-nvidia",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/fe213de8-3da5-4b71-b591-ccdd0e91939e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The race to develop AI chips continues as Samsung’s chip manufacturing department partnered with Canadian startup Tenstorrent to produce chips and intellectual property for data centers.</p>\n                    <p><p>The Canadian startup Tenstorrent, which builds artificial intelligence (AI) processors among other things, <a href=\"https://tenstorrent.com/research/tenstorrent-selects-samsung-foundry-to-manufacture-next-generation-ai-chiplet/\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a> a new partnership with Samsung’s chip manufacturing department.</p><p>On Oct. 2, the startup announced the partnership with Samsung saying it will use the partnership to bring the, “next generation of AI chiplets to market.” Tenstorrent manufactures chips and intellectual property (IP) for data centers. </p><p>The deal includes the use of one of Samsung’s advanced manufacturing processes, the SF4X process and 4nm architecture, to produce its next-gen chips. According to the announcement the product to be developed with Samsung will be a chiplet, to be paired with other chiplets in one package. </p><p>Jim Keller, the CEO of Tenstorrent, said the goal is to develop “high performance compute” and to deliver these solutions to “customers around the world.”</p><p>In August Tenstorrent closed <a href=\"https://cointelegraph.com/news/ai-chip-developer-gets-100-million-from-samsung-and-hyundai\">a $100 million funding round</a> led by both Samsung and the automotive manufacturer Hyundai. At the time Tenstorrent said the funds would go towards acceleration of product development and design, AI chiplets, and a roadmap for machine learning software.</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/ai-market-saturated-investment\"><strong><em>AI tech boom: Is the artificial intelligence market already saturated?</em></strong></a></p><p>This development comes in the heat of the race to develop the most powerful AI chips to create high-level AI systems. </p><p>Currently, Nvidia is the market leader when it comes to chip development and the strength of the chips they have made available. Earlier this year the company<a href=\"https://cointelegraph.com/news/nvidia-briefly-hits-1-trillion-market-cap\"> briefly tipped $1 trillion value</a> amid the AI frenzy. </p><p>While Nvidia remains at the head of the pack for chip development, they recently <a href=\"https://cointelegraph.com/news/ai-chips-nividia-french-police-raid-report\">came under scrutiny</a> by authorities in France in an antitrust investigation. The local police raided Nvidia offices after the French antitrust authorities made a general inquiry into the cloud computing sector. </p><p>Following the events in France, on Oct. 2 the European Commission said EU antitrust regulators have not opened a formal investigation into AI chips, according to a Reuters <a href=\"https://www.reuters.com/technology/no-formal-investigation-into-ai-chips-eu-antitrust-regulators-say-2023-10-02/\" target=\"_blank\" rel=\"noopener nofollow\">report</a>. </p><p>In the United States, regulators have been actively pushing for control over the industry and issued<a href=\"https://cointelegraph.com/news/us-considers-tightening-restrictions-on-ai-chip-exports\"> a ban on exports of high-level Nvidia technology</a> to China in October 2022. They have further tightened measures in recent months. Nvidia is an American company and therefore is subject to U.S. regulations and restrictions. </p><p>The U.S. has also recently <a href=\"https://cointelegraph.com/news/us-vietnam-make-deals-on-ai-chips-tech\">made a deal with Vietnam</a>, a traditional trading partner with China and former adversary of the U.S., worth billions of dollars in regard to AI chips and AI tech. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/\"><strong><em>‘AI has killed the industry’: EasyTranslate boss on adapting to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-03T11:47:33.000Z",
    "title": "Exclusive: Hackers selling discounted tokens linked to CoinEx, Stake hacks ",
    "url": "https://cointelegraph.com/news/exclusive-hackers-selling-stolen-tokens-coinex-stake",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/61d6dff0-8257-408a-95cb-c52d3cedd1b4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchain analytics firm Match Systems has made contact with an individual who is believed to be selling tokens linked to the recent CoinEx and Stake hacks at discounted prices. </p>\n                    <p><p>Blockchain analytics investigators have uncovered an individual linked to a cryptocurrency laundering operation that is offering stolen tokens at discounted prices from recent high-profile exchange hacks.</p><p>Speaking exclusively to Cointelegraph, a representative from blockchain security firm Match Systems outlined how investigations into several major breaches featuring similar methods through the summer months of 2023 have pointed to an individual who is allegedly selling stolen cryptocurrency tokens via peer-to-peer transfers.</p><p><a href=\"https://cointelegraph.com/news/coinex-compromised-private-keys-behind-70-million-hack\"><strong><em>Related: CoinEx hack: Compromised private keys led to $70M theft</em></strong></a></p><p>The investigators managed to identify and make contact with an individual on Telegram offering stolen assets. The team confirmed that the user was in control of an address containing over $6 million worth of cryptocurrencies after receiving a small transaction from the corresponding address.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/d1782783-9913-47a1-99b3-db76427edeaf.jpg\"  /><figcaption style=\"text-align: center;\">A message from the seller advertising stolen tokens being linked to CoinEx and Stake hacks. Source: Match Systems</figcaption></figure><p>The exchange of stolen assets was then conducted through a specially created Telegram bot, which offered a 3% discount off the token’s market price. Following initial conversations, the owner of the address reported that the initial assets on offer had been sold and that new tokens would be available some three weeks later:</p><blockquote>“Maintaining our contact, this individual notified us about the commencement of new asset sales. Based on the available information, it is logical to assume that these are funds from CoinEx or Stake companies.”</blockquote><p>The Match Systems team has not been able to fully identify the individual but has narrowed down their location to the European time zone based on several screenshots they had received and timings of conversations:</p><blockquote>“We believe he is not part of the core team but is associated with them, possibly having been de-anonymized as a guarantee that he will not misuse the delegated assets.”</blockquote><p>The individual also reportedly displayed \"unstable\" and \"erratic\" behavior during various interactions, abruptly leaving conversations with excuses like \"Sorry, I must go; my mom is calling me to dinner”.</p><blockquote>\"Typically, he offers a 3% discount. Previously, when we first identified him, he would send 3.14 TRX as a form of proof to potential clients.”</blockquote><p>Match Systems told Cointelegraph that the individual accepted Bitcoin (BTC) as a means of payment for the discounted stolen tokens and had previously sold $6 million worth of TRON (TRX) tokens. The latest offering from the Telegram user has listed $50 million worth of TRX, Ether (ETH) and Binance Smart Chain (BSC) tokens.</p><p>Blockchain security firm CertiK <a href=\"https://cointelegraph.com/news/hackers-behind-stake-exploit-shifts-bnb-and-matic-latest-move\">previously outlined</a> the movement of stolen funds from the Stake heist in correspondence with Cointelegraph, with around $4.8 million of the total $41 million being laundered through various token movements and cross-chain swaps.</p><p><a href=\"https://www.fbi.gov/news/press-releases/fbi-identifies-lazarus-group-cyber-actors-as-responsible-for-theft-of-41-million-from-stakecom\" target=\"_blank\" rel=\"noopener nofollow\">FBI later identified</a> North Korean Lazarus Group hackers as the culprits of the Stake attack, while cyber security firm SlowMist also linked the $55 million CoinEx hack to the North Korean group. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/10317f5f-f7b7-4a93-baa7-0ee8d01fbef3.jpg\"  /></figure><p>This is in slight contrast to information obtained by Cointelegraph from Match Systems which suggests that the perpetrators of the CoinEx and Stake hacks had slightly different identifiers in methodology.</p><p>Their analysis highlights that previous Lazarus Group laundering efforts did not involve Commonwealth of Independent States (<a href=\"https://www.britannica.com/topic/Commonwealth-of-Independent-States\" target=\"_blank\" rel=\"noopener nofollow\">CIS</a>) nations like Russia and Ukraine while the 2023 summer hacks saw stolen funds being actively laundered in these jurisdictions.</p><p><a href=\"https://cointelegraph.com/news/stake-hack-of-41m-was-performed-by-north-korean-group-fbi\"><strong><em>Related: Stake hack of $41M was performed by North Korean group: FBI</em></strong></a></p><p>Lazarus hackers left minimal digital footprints behind while recent incidents have left plenty of breadcrumbs for investigators. Social engineering has also been identified as a key attack vector in the summer hacks while Lazarus Group targeted “mathematical vulnerabilities”.</p><p>Lastly the firm notes that Lazarus hackers typically used Tornado Cash to launder stolen cryptocurrency while recent incidents have seen funds mixed through protocols like Sinbad and Wasabi. Key similarities are still significant. All these hacks have used BTC wallets as the primary repository for stolen assets as well as the Avalanche Bridge and mixers for token laundering.</p><p>Blockchain data reviewed at the end of Sept. 2023 suggests that North Korean hackers have stolen an estimated $47 million worth of cryptocurrency this year, including $42.5 million in BTC and $1.9 million ETH.</p><p><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Magazine: Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-03T11:40:10.000Z",
    "title": "Brazil BTG Pactual bank buys Bitcoin-friendly brokerage Orama for $99M",
    "url": "https://cointelegraph.com/news/bitcoin-friendly-brokerage-orama-acquired-btg-pactual-bank",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/e07029dd-844b-49cd-ba70-c58cca7a30a6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTG Pactual is known for launching cryptocurrency trading services for its customers and is also planning to launch its own stablecoin.</p>\n                    <p><p>Major Brazilian investment bank BTG Pactual is acquiring cryptocurrency-friendly brokerage Orama as part of its strategy to expand the bank’s digital platforms.</p><p>BTG Pactual has <a href=\"https://valorinveste.globo.com/produtos/servicos-financeiros/noticia/2023/10/02/btg-anuncia-aquisio-da-rama-por-r-500-milhes.ghtml\" target=\"_blank\" rel=\"noopener nofollow\">signed</a> an agreement to buy 100% of Orama’s shares for 500 million Brazilian reais ($98.7 million).</p><p>Announcing the news on Oct. 2, BTG Pactual said that the acquisition is part of the bank’s digital expansion strategy and offers more investment opportunities.</p><p>“We are very excited about the acquisition, which will provide Orama customers with access to the complete BTG platform,” BTG’s digital platforms partner Marcelo Flora said. The acquisition is subject to the necessary regulatory approvals from authorities, including the central bank of Brazil, the announcement notes.</p><p>Founded in 2011, Orama is said to have nearly 18 billion reais ($3.6 billion) of assets under custody and services about 360,000 customers. Focused on the distribution of investment funds and fixed-income products, Orama has also been exploring cryptocurrency investment.</p><p>In April 2022, Orama’s wealth management arm, Orama Singular, <a href=\"https://www2.orama.com.br/investimentos/fundos-de-investimento/Block3-Ativos-Digitais-FIM-IE\" target=\"_blank\" rel=\"noopener nofollow\">launched</a> an actively managed fund focused on digital assets. Called Block3, the fund offers multimarket investment in the cryptocurrency industry, providing exposure to various crypto assets, including Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), tokens, derivatives and others.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-surge-brazil-central-bank-to-tighten-regulation\"><strong><em>Brazil’s crypto surge prompts central bank to tighten regulation</em></strong></a></p><p>Orama’s digital asset fund has <a href=\"https://www.bloomberg.com/quote/ORABLOK:BZ\" target=\"_blank\" rel=\"noopener nofollow\">recorded</a> a successful trend over the past year, surging more than 30% from 90.5 reais ($17.9) in October 2022 to 118.8 reais ($23.5) in September 2023, according to data from Bloomberg.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/eec54e03-5aa0-4996-8350-38b0e927b267.png\"  /><figcaption style=\"text-align: center;\"><em>Block3 Ativos Digitais FIM IE one-year price chart. Source: Bloomberg</em></figcaption></figure><p>It’s unclear whether BTG Pactual’s Orama purchase will result in some new crypto-related products at the bank. BTG Pactual didn’t immediately respond to Cointelegraph’s request to comment on the acquisition.</p><p>Apart from purchasing Bitcoin-friendly Orama, BTG Pactual has been active in crypto-related ventures in recent years. In April 2023, the bank <a href=\"https://cointelegraph.com/news/brazil-bank-btg-pactual-to-issue-usd-pegged-stablecoin\">announced plans to launch BTG Dol</a>, a new stablecoin pegged to the United States dollar on a 1:1 ratio, using the bank’s custody services. The <a href=\"https://cointelegraph.com/news/top-brazilian-investment-bank-btg-pactual-launches-crypto-trading-app\">bank previously launched a crypto trading app</a> enabling customers to directly invest in cryptocurrencies.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/minecraft-bans-bitcoin-play-earn-iphone-15-crypto-gaming-formulae-preview-web3-gamer/\"><strong><em>Web3 Gamer: Minecraft bans Bitcoin P2E, iPhone 15 &amp; crypto gaming, Formula E</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-03T12:05:57.000Z",
    "title": "Chainalysis Confirms Layoffs, Cites Shifting Market Conditions",
    "url": "https://cryptodaily.co.uk/2023/10/chainalysis-confirms-layoffs-cites-shifting-market-conditions",
    "description": "This is the second round of layoffs for the US-based firm; the first round back in February saw the exit of 40-50 employees."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-03T11:41:05.000Z",
    "title": "Polkadot & Composable announced as Diamond Sponsor at the Cosmoverse’23 conference in Istanbul",
    "url": "https://cryptodaily.co.uk/2023/10/polkadot-composable-announced-as-diamond-sponsor-at-the-cosmoverse23-conference-in-istanbul",
    "description": "Composable is presenting at Cosmoverse’23 as a Keynote Speaker and Diamond Sponsor, in collaboration with Polkadot and the Web3 Foundation."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-03T11:43:06.000Z",
    "title": "$ATOM Tokenomics Changes To Be Central Discussion At Cosmoverse ‘23",
    "url": "https://cryptodaily.co.uk/2023/10/atom-tokenomics-changes-to-be-central-discussion-at-cosmoverse-23",
    "description": "At this year's Cosmoverse 2023 conference in Istanbul, the Cosmos Hub community will be presented with a new vision for the Cosmos Hub and tokenomics of its native cryptocurrency, $ATOM."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-03T11:55:36.000Z",
    "title": "TYRION Advances Decentralized Advertising with Strategic Move to Coinbase's Base Chain",
    "url": "https://cryptodaily.co.uk/2023/10/tyrion-advances-decentralized-advertising-with-strategic-move-to-coinbases-base-chain",
    "description": "In an exhilarating development in the world of crypto and blockchain, TYRION the trailblazer in decentralized advertising, announces its strategic move to build its advertising platform on Coinbase's Base Chain."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-03T12:01:53.000Z",
    "title": "Crypto mining operators in Kazakhstan urge the president for tax reforms",
    "url": "https://www.cryptopolitan.com/cryptominers-in-kazakhstan-urge-tax-reform/",
    "description": "In a significant development in the cryptocurrency mining industry, eight leading mining operators in Kazakhstan have penned an open letter to President Kassym-Jomart Tokayev, expressing their deep concerns regarding the soaring energy costs crippling their operations. This move comes as Kazakhstan grapples with its status as the world&#8217;s third-largest Bitcoin mining hash rate market. The ... <a title=\"Crypto mining operators in Kazakhstan urge the president for tax reforms\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cryptominers-in-kazakhstan-urge-tax-reform/\" aria-label=\"More on Crypto mining operators in Kazakhstan urge the president for tax reforms\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-03T11:58:01.000Z",
    "title": "JPMorgan CEO Envisions AI’s Transformative Role in Shaping Tomorrow",
    "url": "https://www.cryptopolitan.com/jpmorgan-ceo-ais-transformative-tomorrow/",
    "description": "In a world where the specter of a jobless, possession-less future has been ominously forecasted, JPMorgan Chase &#38; Co Chief, Jamie Dimon, offers a contrasting vision. Dimon envisions a future powered by artificial intelligence (AI), describing it as a &#8220;living breathing thing&#8221; that will not only transform the job market but also extend human life. ... <a title=\"JPMorgan CEO Envisions AI&#8217;s Transformative Role in Shaping Tomorrow\" class=\"read-more\" href=\"https://www.cryptopolitan.com/jpmorgan-ceo-ais-transformative-tomorrow/\" aria-label=\"More on JPMorgan CEO Envisions AI&#8217;s Transformative Role in Shaping Tomorrow\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-03T12:00:36.000Z",
    "title": "Crypto Watchlist For October: Altcoins To Keep On Your Radar",
    "url": "https://www.newsbtc.com/news/crypto-watchlist-october-altcoins-keep-on-your-radar/",
    "description": "As the dynamic crypto landscape evolves, attention is turning not only to the giants but increasingly to emerging altcoins that show promise and innovation. October is shaping up to be a pivotal month for a select group of these altcoins, with potential frontrunners positioning themselves. Here are our top 4 altcoins for October. Arbitrum (ARB) Arbitrum (ARB) is thrust into the limelight as it inaugurates its Short Term Incentive Program (STIP), positioning 50 million ARB to be siphoned into protocols residing within its ecosystem. The maneuver is predictive of a substantial acceleration in liquidity, reminiscent of Optimism’s grant&#8217;s influential impact which witnessed the Total Value Locked (TVL) catapulting from $300 million to $1 billion during its grant distribution period, as highlighted by DeFi researcher Thor Hartvigsen. In total, over 105 applications have already been funneled into the Arbitrum STIP, predominantly from DeFi applications, and notably DEXes which are commandeering the dominant category followed by yield aggregators and lending markets. Related Reading: Is Your Crypto at Risk? FBI Issues Dire Warning Over ‘Phantom Hacker’ At press time, ARB was trading at $0.9295 after the price was rejected at the 38.2% Fibonacci retracement level ($0.9721). A break above this resistance is crucial. In particular, it is important for ARB not to fall below the descending trendline (black) again, which was breached on Sunday. Solana (SOL) Hartvigsen emphasized the potential he sees in SOL, noting, “Growing DeFi ecosystem and a very strong/vocal community. Solana has established itself as more than just another L1 as it has significant scaling benefits with product market fit.” This assertion further manifests with projects like Eclipse undertaking ambitious endeavors, specifically, &#8220;building an Ethereum L2 with the Solana VM.&#8221; Such innovations not only underscore Solana’s rising importance but also demonstrate its practicality and adaptability in the continuously evolving DeFi landscape. In the last 22 days, the SOL price has increased by almost 40%, and the sentiment around Solana is extremely positive. As the latest CoinShares weekly report shows, SOL has been one of the most popular investments among digital asset funds around the world in recent weeks. The Solana (SOL) price broke above the 200-day EMA on Sunday and also managed to cross the 38.2% Fibonacci retracement level. Assuming a successful retest, the SOL price could target the $26.63 and $32.35 levels. Radiant Capital (RDNT) Radiant Capital&#8217;s momentum in the crypto sphere took an intentional pause with the deferral of its Ethereum mainnet deployment from October 3rd to the 15th. Addressing this decision, Radiant Capital cited their unwavering commitment to quality, remarking: “During the final stages of testing for Ethereum mainnet deployment, we&#8217;ve identified opportunities for significant gas optimizations. It&#8217;s imperative to ensure competitive gas costs to deliver an optimal user experience.” Related Reading: Crypto Fund Flows: Bitcoin Leads As Solana Follows, But Why’s Ethereum Left Behind? Beyond the temporary shift in launch timelines, the organization&#8217;s team remains palpable. Thor Hartvigsen reflected on Radiant Capital&#8217;s prowess, stating, “RDNT &#8211; Already leading the lending/borrowing market on Arbitrum. Expecting TVL to rise from the cross chain expansion. Expecting TVL to rise from the cross chain expansion. Further: Arbitrum STIP proposal to receive 3.36 million ARB aimed at ecosystem growth.&#8221; RDNT saw a strong drawdown of close to 62% after the all-time high at $0.4956 on April 15. However, after the historical low at $0.1905, RDNT has already shown a strong reaction. Should the price break above the 23.6% Fibonacci retracement level at $0.2625, it could be interpreted as an indication of a breakout from the downtrend. Maker (MKR) Maker (MKR) has been generating significant attention in the crypto community, primarily due to its impressive rally in recent weeks. Central to Maker&#8217;s rise is its strong financial performance. Hartvigsen illuminates this by noting: &#8220;Maker is the largest revenue-generating protocol in DeFi with a current annualized revenue of $193m!&#8221; This revenue is primarily driven by interest accrued from DAI minters, with a significant proportion coming from Real World Assets (RWAs). As he further elaborates, &#8220;Currently, 53% of all DAI collateral comes from RWAs such as US t-bills paying out nearly 5% APY. Roughly 63% of the $193m in annualized revenue comes from the RWA collateral.&#8221; But what has precipitated this uptick in MKR’s valuation? Hartvigsen attributes it to two primary factors: &#8220;1) More of the collateral as RWA (and high US interest rates) and 2) A growing DAI supply.&#8221; He emphasizes the symbiotic relationship between Maker&#8217;s revenue and DAI&#8217;s market cap, stating that &#8220;Maker revenue depends primarily on the total market cap of DAI as the collateral backing this stablecoin is what generates fees.&#8221; On the horizon, MKR&#8217;s prospects appear even more promising. Hartvigsen lists several catalysts that could further propel its growth. One notable highlight is the potential impact of DAI&#8217;s ongoing expansion: &#8220;If the DAI supply can continue to grow, the Maker revenue will continue to grow which most likely will impact the price positively.&#8221; Additionally, forthcoming developments, including &#8220;a MKR 1:12000 token split,&#8221; a complete rebranding initiative, and the anticipated launch of subDAOs, are set to infuse MKR with enhanced utility and potentially greater demand in the market. As he concludes, these changes will enable &#8220;MKR holders to stake MKR to farm these new subDAO tokens which will create additional token utility.&#8221; After the MKR price crossed the 200-day EMA at 1,110 three weeks ago, the odds are good that the rally will continue. A possible target could be the 23.6% Fibonacci retracement level at $1,888. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-03T11:43:49.000Z",
    "title": "Circle Challenges SEC’s Authority Over Stablecoins Tether (USDT), USDC, and Others Asserts They’re Not Securities ",
    "url": "https://www.crypto-news-flash.com/circle-challenges-secs-authority-over-stablecoins-tether-usdt-usdc-and-others-asserts-theyre-not-securities/?utm_source=rss&utm_medium=rss&utm_campaign=circle-challenges-secs-authority-over-stablecoins-tether-usdt-usdc-and-others-asserts-theyre-not-securities",
    "description": "<img width=\"599\" height=\"443\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin vs altcoins\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins.png 599w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-300x222.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-24x18.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-36x27.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-48x35.png 48w\" sizes=\"(max-width: 599px) 100vw, 599px\" />Stablecoin Issuer Circle files an amicus curiae brief in the case between the SEC and Binance to provide further explanation on the nature of stablecoins. Binance was sued by the Commission for selling unregistered securities including BNB and BUSD.  The US Securities and Exchange Commission (SEC) recently accused Binance of violating federal securities laws by [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-03T11:52:00.000Z",
    "title": "Gala’s Price Continues to Rise and May Soon Overcome Resistance",
    "url": "https://coinedition.com/galas-price-continues-to-rise-and-may-soon-overcome-resistance/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months.png 730w, https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/09/Is_GALA_a_Good_Investment_The_Token_Has_Dropped_98_in_18_Months-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The price of Gala (GALA) added to its impressive weekly streak with a fresh 24-hour gain. GALA’s increase in price over the past trading day is not only noteworthy due to its remarkable performance over the past seven days, but also because it took place during a period wherein the majority of prices in the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/galas-price-continues-to-rise-and-may-soon-overcome-resistance/\">Gala’s Price Continues to Rise and May Soon Overcome Resistance</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-03T11:45:43.000Z",
    "title": "InvestAnswers Unveils ‘Max Upside’ Price Target for Bitcoin (BTC) in 2025",
    "url": "https://dailyhodl.com/2023/10/03/investanswers-unveils-max-upside-price-target-for-bitcoin-btc-in-2025/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/Max-Upside-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/Max-Upside-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/Max-Upside-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/Max-Upside-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/Max-Upside-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/Max-Upside-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/Max-Upside-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is laying out the upper bounds of his price target for Bitcoin (BTC) in 2025. In a new YouTube video, the anonymous host of InvestAnswers tells his 447,000 YouTube subscribers that his price target for Bitcoin is heavily dependent on multiple factors, including on-chain supply, the future of spot BTC [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/03/investanswers-unveils-max-upside-price-target-for-bitcoin-btc-in-2025/\">InvestAnswers Unveils ‘Max Upside’ Price Target for Bitcoin (BTC) in 2025</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]