[
  {
    "source": "Decrypt",
    "date": "2023-12-21T19:48:57.000Z",
    "title": "Got a Solana Saga Before They Sold Out? Here Are All the Airdrops You Can Claim",
    "url": "https://decrypt.co/210634/solana-saga-airdrops-tokens-nfts-you-can-claim",
    "description": "Beyond BONK: Solana Saga owners can now claim multiple token airdrops and other perks, with more in the works."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-21T20:00:17.000Z",
    "title": "Ethereum’s Dencun upgrade set for 2024 testnet launch",
    "url": "https://cryptoslate.com/ethereums-dencun-upgrade-set-for-2024-testnet-launch/",
    "description": "<p>Ethereum developers have tentatively decided on Jan. 17, 2024, for the upcoming &#8220;Dencun&#8221; upgrade&#8217;s first testnet deployment during the latest bi-weekly dev meeting on Dec. 21. Originally slated for the last quarter of 2023, the &#8216;Dencun upgrade was pushed to 2024 due to the engineering complexities involved. Tim Beiko, the protocol support lead at the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ethereums-dencun-upgrade-set-for-2024-testnet-launch/\">Ethereum&#8217;s Dencun upgrade set for 2024 testnet launch</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-21T20:00:10.000Z",
    "title": "Economist Harry Dent’s Grim Prediction — 2024 Market Crash to Eclipse Great Depression",
    "url": "https://news.bitcoin.com/economist-harry-dents-grim-prediction-2024-market-crash-to-eclipse-great-depression/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/dent-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/dent-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/dent-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/dent-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/dent-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/dent-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/dent-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/dent.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent interview with Fox News, renowned economist Harry Dent issued a dire prediction for the global economy, forecasting 2024 to be the year of the most significant financial crash in living memory. Citing a combination of overvalued markets, excessive stimulus spending, and artificial inflation of asset prices, Dent&#8217;s analysis paints a grim picture [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-21T20:04:22.000Z",
    "title": "Trezor hardware wallets integrate support for SOL and SPL tokens",
    "url": "https://www.cryptopolitan.com/trezor-wallets-integrate-support-sol-and-spl/",
    "description": "Trezor, a prominent web3 hardware wallet manufacturer, has expanded its token support, now accommodating SOL and Solana Program Library (SPL) tokens. This addition enhances the functionality of Trezor&#8217;s hardware wallets, the Model T and Safe 3, as announced on the social media platform X. Trezor&#8217;s Safe 3, priced at $79, boasts an additional layer of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-21T20:03:09.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices to consider when investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-21T20:00:25.000Z",
    "title": "Neon EVM Hits Record-High 730 TPS On Mainnet",
    "url": "https://www.newsbtc.com/news/neon-evm-hits-record-high-730-tps-on-mainnet/",
    "description": "In the rapidly evolving landscape of blockchain technology, Neon EVM, a smart contract on Solana (SOL) has emerged as a frontrunner by introducing a landmark parallel processing architecture on its mainnet.  This approach has enabled Neon EVM to achieve an increase in performance, scalability, and efficiency, according to a press release share with NewsBTC. Neon EVM Dominates Transaction Processing  Neon EVM, the first parallel Ethereum Virtual Machine (EVM) on mainnet, has achieved a record-breaking 730 Transactions Per Second (TPS) on its mainnet. Notably, this is the first time such high tps has been achieved on an EVM mainnet.  Related Reading: Renewed Hope For Crypto: 2023 Sets The Stage For A Monumental 2024 The milestone was reached on December 16, 2023, when Neon EVM&#8217;s mainnet showcased its transaction processing capabilities. While many blockchains demonstrate high tps on testnets, Neon EVM&#8217;s has standout by improving its scalability.  Neon EVM, which went live on the mainnet in July 2023, operates as a fully Ethereum-compatible environment on the Solana blockchain. Since its launch, Neon EVM has garnered investor interest, resulting in multiple listings on platforms such as ByBit, Crypto.com, and Gate.io.  Given these developments, the utility token NEON has experienced remarkable growth, with its value surging from $0.67 to $1.45 in just three days, representing a 116% increase. Neon EVM&#8217;s success comes when there is growing interest in high-speed, parallelized processing blockchains. Currently, Neon EVM stands as the only parallel processing EVM live on the mainnet, showcasing its tps capabilities compared to other blockchain networks. Outshining Ethereum&#8217;s Transaction Speed The fundamental difference between Neon EVM and blockchains like Bitcoin and Ethereum lies in their transaction processing approach. While Bitcoin and Ethereum process transactions sequentially, Neon EVM allows for simultaneous processing of multiple transactions, facilitating increased throughput and reducing the likelihood of congestion during periods of high demand. In a notable comparison, Neon EVM&#8217;s parallel processing architecture outperformed the combined tps of the entire Ethereum ecosystem on December 16, as reported by L2Beat.  The project&#8217;s commitment to Ethereum compatibility on the Solana blockchain and its high-speed transactions and low-cost benefits positions Neon EVM as an interesting project as a new Bull Cycle emerges. Layer 2 Scaling Solutions On The Rise Polygon, the layer 2 scaling solution that operates alongside the Ethereum blockchain, has also demonstrated its transaction processing speed capabilities.  In a recent post on X (formerly Twitter), Sandeep Nailwal, the founder of Polygon, shared notable statistics highlighting the network&#8217;s performance. According to Nailwal&#8217;s post, Polygon&#8217;s Proof of Stake (PoS) chain seamlessly handled over 16 million transactions in a single day, showcasing its scalability and efficiency.  During the peak period, the Polygon PoS chain achieved a throughput of 255 tps. This figure is approximately 2-3 times higher than the combined throughput of the entire Ethereum ecosystem.  Related Reading: XRP Whales Show Exchange Inflow Activity, Bad Sign For Price? Moreover, the validators on the Polygon network generated approximately 1 million in transaction fees in a single day, reflecting the network&#8217;s high level of activity. However, it is worth noting that gas fees experienced a spike during this period, which is a broader issue impacting the entire Ethereum ecosystem. In terms of rewards for validators, the block rewards on the Polygon network amounted to over 155,000 MATIC tokens. This translates to substantial revenue for validators, totaling around 1.2 million in a single day. These rewards incentivize validators and contribute to the overall security and stability of the PoS chain. The spike in transactions in both of these Layer-2 networks showcase the growing importance of scalability solutions. In the coming months, hundred of new users could onboard the crypto market via either of these solutions hinting at a potential benefit for their underlying tokens. Featured image from Shutterstock, chart from TradingView.com"
  }
]