[
  {
    "source": "Decrypt",
    "date": "2024-01-22T20:21:45.000Z",
    "title": "Bitcoin Falls Below $40,000 as Grayscale Unwind Continues",
    "url": "https://decrypt.co/213721/bitcoin-falls-below-40000-grayscale",
    "description": "Market watchers point to the flood of cash exiting Grayscale's Bitcoin ETF."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-22T20:22:40.000Z",
    "title": "Bitcoin Plummets Below $40K for First Time in 48 Days, Triggering Market-Wide Crypto Slide",
    "url": "https://news.bitcoin.com/bitcoin-plummets-below-40k-for-first-time-in-48-days-triggering-market-wide-crypto-slide/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/btcbear-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Plummets Below $40K for First Time in 48 Days, Triggering Market-Wide Crypto Slide\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/btcbear-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/btcbear-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/btcbear-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/btcbear-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/btcbear-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/btcbear-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/btcbear-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Monday, Jan. 22, 2024, the value of bitcoin fell below the $40K mark for the first time in 48 days, as per market analysis. In the last 24 hours, bitcoin witnessed a 4% decline, with a 14.2% decrease observed over the preceding two weeks. Bears Take the Reigns&#x2014;Bitcoin Falls Under $40K Amid Market Turbulence [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-22T20:38:28.000Z",
    "title": "Binance vs. SEC: Judge shows skepticism on BUSD as an investment contract",
    "url": "https://crypto.news/binance-vs-sec-judge-shows-skepticism-on-busd-as-an-investment-contract/",
    "description": "The highly anticipated hearing of the SEC’s lawsuit against Binance occurred today in Washington, as the trial revealed several challenges for the leading exchange."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-22T20:33:44.000Z",
    "title": "Bitcoin dips below $40k amid BTC ETF selloffs",
    "url": "https://crypto.news/bitcoin-dips-below-40k-amid-btc-etf-selloffs/",
    "description": "Bitcoin dropped under $40,000 amid GBTC sell-offs from bankrupt crypto exchange FTX and BTC deposits on Coinbase by spot BTC ETF issuer Grayscale."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-22T20:12:41.000Z",
    "title": "Gaming tokens take hit from Bitcoin’s dip to $40k",
    "url": "https://crypto.news/gaming-tokens-take-majority-of-the-hit-from-bitcoins-dip-to-40k/",
    "description": "The cryptocurrency market recently experienced a downturn, with significant declines in gaming tokens as Bitcoin's value approached $40,000."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-22T20:30:33.000Z",
    "title": "Bitcoin Price “Mad Heavy,” Why A Detour To $30,000 Might Be Imminent",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-price-mad-heavy-why-a-detour-to-30000-might-be-imminent/",
    "description": "The Bitcoin price took a downside turn over the weekend and seems ready to re-test critical support levels. The downside price action was triggered by a spike in selling pressure following the approval of Bitcoin spot Exchange Traded Funds (ETFs) in the US. Related Reading: Bitcoin Whale Carries Out Massive Sell-Off As BTC Price Suppression Continues As of this writing, the Bitcoin price trades at $40,900 with a 2% loss in the past 24 hours. Over the last week, these losses doubled, with other assets in the crypto top 10 by market underperforming, except for Dogecoin (DOGE), which still records a 4% profit in the same period. Bitcoin Price Loses Steam, How Low Can BTC Go? Via the social media platform X, the founder and former CEO of crypto exchange BitMEX, Arthur Hayes, shared a forecast for the Bitcoin price. According to Hayes, BTC seems poised to lose its current levels. The crypto founder and trader claims that the low timeframe price action will likely push Bitcoin below $40,000 and potentially below $35,000 if bulls fail to defend the higher area around these levels. The main issue regarding the current market structure rests upon the liquidity in the Bitcoin market. As seen in the chart below and as pointed out by Hayes, the liquidity in the BTC market has been trending to the downside since the Bitcoin spot ETF was approved. As a result, and due to the constant selling pressure from the Grayscale Bitcoin Trust (GBTC), the market has been trending to the downside and could maintain this course until the next major macroeconomic event. On the above, the BitMEX founder stated: Why has $SPX and $BTC stopped moving up together post US BTC ETF launch? Both are love more $ liq, which one is right about the future? $BTC is telling us that there are hiccups ahead for $ liq, next signpost is 31st Jan US Treasury refunding annc (announcement). If Bitcoin Goes South, What Levels Could Hold The Line? A pseudonym crypto analyst showed a cluster of buying orders stacked from the $38,819 to the $40,000 levels in a separate report. In other words, these levels should present opposition and seem like BTC’s biggest opportunity to bounce back, at least on low timeframes. Related Reading: Bitcoin Price Turns Red, Why BTC Could Tumble Below $40K In that sense, the analyst stated the following, anticipating a possible short-term recovery, and showing the image below: Some big zones starting to build up around 41K &#38; 42K. Pretty certain we&#8217;ll at least take out that top part somewhere next week. Will see if price sustains after that. Cover image from Unsplash, chart from Tradingview"
  }
]