[
  {
    "source": "NewsBTC",
    "date": "2024-03-31T07:38:43.000Z",
    "title": "Dogecoin Open Interest Hits Record $2.2 Billion – What’s Next For DOGE Price?",
    "url": "https://www.newsbtc.com/dogecoin-2/dogecoin-open-interest-hits-record-2-2-billion-whats-next-for-doge-price/",
    "description": "The Dogecoin open interest has been on the rise over the past few weeks, breaking and setting new all-time highs twice this March. Unsurprisingly, the price of the meme coin has been reflecting the growth seen by its open interest. This recent bullish momentum pushed the price of DOGE to break the $0.22 mark, its highest point in three years. However, the question is &#8211; how far can this rally go for the foremost meme token? Dogecoin Open Interest Breaks Above $2 Billion According to data from CoinGlass, the Dogecoin open interest broke through the $2 billion mark on Friday, March 29. Although DOGE’s open interest stands at around 1.96 billion at press time, it rose as high as $2.21 billion on Friday, a new record for the meme coin. Related Reading: Prepping For $100,000: Bitcoin Shark And Whales Spend Over $18 Billion To Buy BTC Open interest is a metric that measures the total number of futures or options contracts of a particular cryptocurrency (Dogecoin, in this case) in the market at a given time. It provides insight into the amount of money investors are pouring into DOGE derivatives at this time. The meme token’s open interest has had quite a performance since the start of March. DOGE’s open interest rose to $1.6 billion (an all-time high at the time) earlier in the month before retracing to below $1 billion by March 20. It is worth noting that there has been a high correlation between open interest and Dogecoin’s price, with both climbing at the same time and at almost the same pace. Typically, a rising open interest can suggest a continuation of the trend around the asset’s price at the moment. Ultimately, the current high open interest for DOGE could mean a rapid price movement for the meme coin in the near future. However, it would be difficult to tell the direction in which this spurt of volatility would take the price of Dogecoin, especially as open interest is not the most optimal indicator of trends or price action. DOGE Price Overview As of this writing, the Dogecoin price stands at $0.204, reflecting a 4.6% decline in the last 24 hours. While the meme token’s price has somewhat struggled since hitting the three-year high, it has managed to retain most of its profit from the past week. Related Reading: Panel Of Experts Reveal When The Cardano Price Will Reach $3 According to CoinGecko data, the Dogecoin price is up by a whopping 18% in the past seven days. This positive performance has strengthened DOGE’s position as the largest meme coin in the market, with a market capitalization of $29 billion. Dogecoin price sees slight correction on the daily timeframe &#124; Source: DOGEUSDT chart on TradingView Featured image from Pexels, chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-31T07:37:00.000Z",
    "title": "Pudgy Penguins Surges 7.7%, Becomes the Second-Largest NFT: Report",
    "url": "https://coinedition.com/runestone-marks-14percent-surge-while-pudgy-penguins-increases-by-7percent/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/What-Are-NFTs-What-Are-Its-Future-Possibilities.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Pudgy Penguins\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/What-Are-NFTs-What-Are-Its-Future-Possibilities.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/What-Are-NFTs-What-Are-Its-Future-Possibilities-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/What-Are-NFTs-What-Are-Its-Future-Possibilities-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/What-Are-NFTs-What-Are-Its-Future-Possibilities-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/What-Are-NFTs-What-Are-Its-Future-Possibilities-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>With a market cap of 129,676 ETH ($461,778,243), Pudgy Penguins becomes the second largest NFT after CryptoPunk. Pudgy Penguins has surged 7.7% in the last 24 hours, currently trading at a floor price of 14.59 ETH, equivalent to $51,955. Runestone marks a substantial surge of 14% in the last day, surpassing NodeMonkes. In the fast-moving [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/runestone-marks-14percent-surge-while-pudgy-penguins-increases-by-7percent/\">Pudgy Penguins Surges 7.7%, Becomes the Second-Largest NFT: Report</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]