[
  {
    "source": "Decrypt",
    "date": "2023-10-05T20:57:34.000Z",
    "title": "'Cyberpunk 2077' Goes Hollywood as Game Sells 25 Million Copies",
    "url": "https://decrypt.co/200338/cyberpunk-2077-goes-hollywood-game-sells-25-million-copies",
    "description": "Hollywood production company Anonymous Content plans to craft a live-action story set in the world of Cyberpunk 2077. Here's what we know so far."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-05T20:48:37.000Z",
    "title": "How will CBDCs be used for political oppression in your country?",
    "url": "https://cointelegraph.com/news/how-will-cbdcs-political-oppression-your-country",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/5ca32752-6677-40a3-a735-c2732540c5cf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Central bank digital currencies (CBDCs) are poised to give politicians unprecedented power to track your data, restrict your movements, and control your life.</p>\n                    <p><p><a href=\"https://cointelegraph.com/cryptocurrency-regulation-for-beginners/what-are-cbdcs-a-beginners-guide-to-central-bank-digital-currencies\">Central bank digital currencies (CBDCs)</a> have emerged as a prominent topic in the financial world. They promise elevated stability, security, efficiency, and reduced corruption. Central banks, the International Monetary Fund, the World Economic Forum, and the World Bank tell us CBDCs are a panacea waiting to cure all that ails our financial system.</p><p>Unfortunately, those claims may not match reality, because there are two characteristics of CBDCs that their proponents don’t often mention. First, they offer an eternal trail of data about how you’re spending your money. Secondly, they are subject to “<a href=\"https://cointelegraph.com/news/stablecoins-must-be-programmable-to-counter-cbdcs\">programmability</a>,” which means political leaders will have the ability to dictate whether you’re even allowed to spend your money.</p><h2>The data trail</h2><p>As an electronic legal tender directly issued by central banks to your <a href=\"https://cointelegraph.com/learn/bitcoin-wallets-a-beginners-guide-to-storing-btc\">digital wallet</a>, CBDCs will not be anonymous. The clients will have gone through identification processes matching the ones currently imposed by commercial banks. The design instances may vary in detail, but either commercial banks or the central bank or both will be privy to always knowing who holds the digitally issued fiat currency, how it is spent or transferred, to whom, and for which purpose. All this information will be stored on a central digital ledger operated by central banks.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cbdcs-threaten-our-future-so-it-s-time-to-take-a-stand\"><strong><em>CBDCs threaten our future, so it’s time to take a stand</em></strong></a></p><p>This system will enable central banks to assemble a ledger containing every citizen's financial transactions, from cradle to deathbed. While proponents may dismiss concerns, governments could take an interest in citizens' political affiliations, religious donations, mental health, and other personal details. Public health services might monitor alcohol and cigarette purchases as well as lifestyle choices for adapting insurance premiums. Even CO2 footprints of purchases may be tracked so that environmental policies can be adjusted, significantly compromising the data privacy of the citizenry.</p><h2>Restrictions and programmability</h2><p>The fact that retail CBDC is electronic cash held at the central bank will fundamentally change our legal ties to “our” money: With physical cash, we are always the proprietor and holder of those coins and notes in our pockets. With CBDC we will only be the proprietor of the digital cash. We will never be the holder of that money as it will be held in our name at the central bank. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The establishment are trying to force me out of the UK by closing my bank accounts. <br><br>I have been given no explanation or recourse as to why this is happening to me. <br><br>This is serious political persecution at the very highest level of our system. <br><br>If they can do it to me, they… <a href=\"https://t.co/O4xQ1h79ub\">pic.twitter.com/O4xQ1h79ub</a></p>&mdash; Nigel Farage (@Nigel_Farage) <a href=\"https://twitter.com/Nigel_Farage/status/1674357026921623552?ref_src=twsrc%5Etfw\">June 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Hence, we will never have full discretionary power over that money as the middleman central bank will always remain between us and our funds. Should this middleman refuse to transact on our behalf, we will not be able to purchase or transfer any money in a world where CBDCs have eventually replaced physical cash. We will no longer be able to pull a banknote from our wallet and hand it over to whomever we want.</p><p>In a nutshell, every CBDC transaction could be subject to restrictions. Such infringements could take the form of payment constraints or transfer limits, it could block us from sending money to specific groups of people or individuals, organizations, or companies. </p><p>Vice versa it could also prevent us from receiving money. It could furthermore limit the purposes we spend our money on, for instance, spending limits or payment blocks could be imposed on alcohol, cigarettes, but also fuel, electricity, or flight tickets – as the government deems appropriate.</p><p>Defunding dissenting voices — as Canadian Prime Minister Justin Trudeau did with <a href=\"https://cointelegraph.com/news/ontario-government-freezes-millions-more-in-donations-to-freedom-convoy\">members of the Freedom Convoy in 2022</a> — would thus become far more convenient and efficient for governments. No orders would need to be issued to freeze corporate or individual accounts at banks or payment providers. Instead, the administration could cut off any protesters from their cash with the push of a button.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/the-world-could-be-facing-a-dark-future-thanks-to-cbdcs\"><strong><em>The world could be facing a dark future thanks to CBDCs</em></strong></a></p><p>It is even conceivable that CBDCs could be used to impose curfews or place people under house arrest. On a keystroke and in real-time, CBDCs could — for example — be programmed to function only between 6 a.m. and 6 p.m., or just within four miles of your registered home address. Effectively, President Joe Biden could use a CBDC regime to prevent a Donald Trump rally from taking place. Alternatively, Trump could prevent a Bernie Sanders assembly from happening.</p><p>But gagging opposition is not where it ends: CBDCs could also be programmed in such a way that they depreciate over time. This could prove useful for officials in times of economic decline when governments and central banks want to stoke the economy. It goes without saying that in this scenario the saver is the one left holding the short end of the stick. Governments could further impose special taxes, forced loans, or directly access digital wallets for tax collection and fine deductions. Undoubtedly, financial autonomy would erode under a CBDC regime.</p><h2>Veil of ignorance</h2><p>However, next to constrained freedoms in terms of data privacy and financial autonomy, another — far more fundamental — danger looms around the corner. People in control may undermine democracy by abusing CBDCs for electronic power grabs. If the ones wandering the corridors of power are given the possibility to literally switch off opposition by defunding it, it will sooner or later happen. Or to put it at its simplest: Giving governments CBDCs and hoping that they won’t abuse them is like pouring the alcoholic a glass of whiskey and hoping that he won’t drink it.</p><p>Hence, in weighing the pros and cons of retail CBDCs, the concept of the “veil of ignorance” comes in handy. Applied to the case at hand, it prompts you not only to ponder the question of whether your current government would be inclined to abuse CBDCs, but if any future governments (behind the veil) could do so. </p><p>Think of the worst possible governments and reflect on whether they will misuse their power over CBDCs. You’ll understand why CBDCs are an imminent threat to freedom — in your country and around the globe.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Dr. Patrick Schueffel</strong> is an adjunct professor at Fribourg’s School of Management in Switzerland. His research focuses on fintech, digital assets, and entrepreneurship. He previously worked in Switzerland and Liechtenstein as the chief operating officer at Saxo Bank and as a member of senior management at Credit Suisse, and spent a three-year stint in Singapore. He holds a doctorate from the University of Reading’s Henley Business School, a master’s degree from the Norwegian School of Economics, and a diploma from Mannheim University in Germany.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph. </em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-05T20:56:48.000Z",
    "title": "SEC initiates legal action against Elon Musk over Twitter stock disclosures",
    "url": "https://cryptoslate.com/sec-initiates-legal-action-against-elon-musk-over-twitter-stock-disclosures/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) has initiated legal proceedings against Elon Musk due to his non-compliance with a subpoena. The financial authority is investigating whether the billionaire violated federal securities law with his Twitter purchase last year. The SEC stated that Musk failed to appear to testify last month as requested despite having [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-initiates-legal-action-against-elon-musk-over-twitter-stock-disclosures/\">SEC initiates legal action against Elon Musk over Twitter stock disclosures</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-05T20:48:52.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here’s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-05T21:00:22.000Z",
    "title": "Justin Sun Unstakes 20,000 Ethereum (ETH) From Lido Finance, What’s Going On?",
    "url": "https://www.newsbtc.com/news/ethereum/justin-sun-unstakes-20000-ethereum-lido-finance/",
    "description": "A crypto wallet associated with Justin Sun, the co-founder of Tron, a smart contract platform, has moved 20,000 Ethereum (ETH) worth roughly $32.4 million from Lido Finance, a liquidity staking platform. Funds were transferred to Binance, the world&#8217;s largest crypto exchange, trading volume and client count. The transaction, executed in a single batch, was captured by The Data Nerd, an analysis platform, and shared on X on October 5. As it is, Ethereum (ETH) is under pressure, looking at the performance in the daily chart.  Ethereum Drops 4%, Are Bears Flowing Back? Trackers show that the coin is down roughly 4% in three days, confirming sellers of October 2. Notably, the daily chart has a double bar formation with the bear candlestick of October 2, completely reversing buyers of October 1. This arrangement suggests that bears could be in control, especially considering the draw-down of the past few trading days and the level of participation on October 2 when the coin slipped.  Related Reading: Analyst Who Put Bitcoin Price At $130,000 Says You Should Buy BTC Now, Here’s Why In technical analysis, losses at the back of increasing volumes often point to high participation. If prices are rising, then the coin in question could rally. Conversely, a sell-off could worsen if the bar had high trading volumes. It is also unclear whether Justin Sun plans to sell ETH after transferring coins to exchanges. Crypto transfers to centralized exchanges, which support many stablecoins like USDT and others, are often associated with sell-offs.  Market participants may interpret such movements as bearish, fueling the sell-off, subsequently heaping more pressure on prices. ETH is now at a one-week low. Justin Sun Shuffling ETH In 2023 The Data Nerd observes that prices fell the last time the wallet moved ETH to Huobi, which has since rebranded to HTX. In August, the wallet moved 5,000 ETH to HTX. The deposit came a week before ETH prices crashed 12%.  Bitcoin and Ethereum prices fell sharply in mid-August, causing a &#8220;cascade liquidation&#8221; that spooked investors. ETH bulls have since failed to reverse those losses. Considering the relatively low trading volumes in the last two months, prices are still boxed within the August 17 trade range, a bearish signal. Related Reading: XRP, Polygon See Month-High Volumes As Investors Show FOMO In late February 2023, Justin Sun staked 150,000 ETH, worth roughly $240 million, to Lido Finance. The transfer remains the largest single-stay transaction, forcing the liquidity staking provider to activate the Staking Rate Limit feature, capping the amount of coins one can stake at 150,000 ETH.  Lido Finance said the feature is more of a &#8220;safety valve&#8221; that &#8220;addresses possible side-effects such as rewards dilution, without needing to pause stake deposits explicitly.&#8221;  Feature image from Canva, chart from TradingView"
  }
]