[
  {
    "source": "Decrypt",
    "date": "2023-11-28T01:58:26.000Z",
    "title": "4 Things CZ Can Do in Seattle While Waiting to See If He's Going to Prison",
    "url": "https://decrypt.co/207657/4-things-cz-seattle-waiting-see-going-prison",
    "description": "Binance founder Changpeng \"CZ\" Zhao got news today that he's stuck in America for the time being. So why not make the most of it?"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-28T02:00:25.000Z",
    "title": "Shifting the paradigm: Why Taipei is the preferred destination for Sora Ventures",
    "url": "https://cryptoslate.com/shifting-the-paradigm-why-taipei-is-the-preferred-destination-for-sora-ventures/",
    "description": "<p>In the fast-paced world of crypto, where innovation and adaptability are key, Taipei, Taiwan, is emerging as the new hub for forward-thinking crypto ventures, challenging the traditional dominance of Hong Kong and Singapore. Sora Ventures, led by Jason Fang, stands at the forefront of this shift, opting for Taipei to host its renowned Sora Summit conference [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/shifting-the-paradigm-why-taipei-is-the-preferred-destination-for-sora-ventures/\">Shifting the paradigm: Why Taipei is the preferred destination for Sora Ventures</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-28T02:00:51.000Z",
    "title": "On The Brink Of Breakthrough? Analyst Foresees Cardano (ADA) Hitting New Annual Heights",
    "url": "https://www.newsbtc.com/analysis/ada/analyst-foresees-cardano-ada-hitting-new-annual-heights/",
    "description": "Market analyst Ali Charts has recently shared insights on the Cardano (ADA) market trajectory. Observing recent trends, ADA appears to be in a bearish phase. In the last 24 hours, mainly, the asset has witnessed a 2.8% decline, resulting in its trading price falling to $0.37. However, despite the current dip, Ali offers an optimistic outlook, suggesting that Cardano may be gearing up for a significant price surge, possibly reaching its highest point for the year. Related Reading: History Repeats? Cardano (ADA) Set To Skyrocket In December, Predicts Analyst Analyst&#8217;s Positive Outlook On ADA: Understanding The Demand Zone In an X post uploaded earlier today, Ali shared his analysis on ADA, highlighting a crucial demand zone around the $0.37 and $0.38 marks. The analyst notes the substantial buying activity in this range, with over 166,470 wallets having purchased ADA at these levels. Ali states this robust demand indicates a strong support level at these price marks. With minimal resistance ahead, Ali&#8217;s analyst suggests that ADA could see an increase, potentially surpassing its yearly high of $0.4518. Notably, while the analyst points out that the current buying trend at the demand zone is a positive indicator of ADA&#8217;s strength, the analyst also cautions investors to remain vigilant. A failure to maintain support in this zone could result in ADA&#8217;s price dropping to lower levels, such as $0.34. #Cardano sits at a key demand zone between $0.37 and $0.38. Here, 166,470 wallets acquired 4.88 billion $ADA. With minimal resistance ahead and solid support below, remaining above this zone could pave the way for $ADA to climb to new yearly highs. Still, watch out, as losing… pic.twitter.com/GDjhspFSVr — Ali (@ali_charts) November 27, 2023 Cardano (ADA) Latest Price Action Recently, ADA has experienced a downturn, with its value decreasing nearly 5% over the past week. This downward trend has continued in the last 24 hours, with a 2.5% decline, bringing its trading price to roughly $0.378. This price point is significant as it aligns with the strong support level identified by analyst Ali. As highlighted above, according to Ali, a drop below this support level could potentially lead to a further decrease to around $0.34. Conversely, if ADA stabilizes or rebounds from this level, it may set the stage for a climb to new yearly highs. While ADA has faced a bearish phase recently, a broader perspective reveals a more positive outlook. Over the past month, ADA has demonstrated a 29% increase, and even considering the past two weeks, it maintains a 3.2% gain. Related Reading: Whale Alert: Big Players Scoop Up These 4 Altcoins, On-Chain Data Indicates Meanwhile, the asset&#8217;s daily trading volume has since been on a downward trend over the past weeks. In the past 24 hours, ADA&#8217;s daily trading volume has stood at $255 million, a significant plunge from over $600 million in the middle of this month. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-28T02:00:23.000Z",
    "title": "Bitcoin Sees Influx Of Over $1.5 Billion In 2023: Price Surge Aims For $43,000",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-sees-influx-of-over-1-5-billion-in-2023-price-surge-aims-for-43000/",
    "description": "Amidst the regulatory scrutiny and enforcement actions faced by the cryptocurrency industry, Bitcoin (BTC), the leading cryptocurrency by trading volume, has remained resilient and maintained its consolidation level between $36,000 and $37,000. It reached a new record for the year, surging to a new yearly high of $38,390 on Friday. $312 Million Inflows Amid Spot-Based ETF Expectations The latest report from CoinShares provides further evidence of Bitcoin&#8217;s robustness. Despite concerns that the regulatory feud involving Binance might trigger a sell-off of BTC, the report reveals a significant influx of capital into digital asset investment products.  Last week, these products witnessed a notable inflow of $346 million, marking the largest weekly inflows observed during a nine-week consecutive run. The CoinShares report highlights that the surge in inflows can be attributed to the anticipation surrounding the potential launch of a spot Bitcoin exchange-traded fund (ETF) in the United States, which has been eagerly awaited by investors but delayed by the US Securities and Exchange Commission (SEC). Related Reading: Cosmos Co-Founder’s Controversial Proposal Triggers 11% Plunge In ATOM Interestingly, this surge is the largest since the bull market of late 2021. CoinShares reports that the combination of rising prices and inflows has pushed total Assets Under Management (AuM) to $45.3 billion, the highest level seen in over a year and a half. Bitcoin&#8217;s inflows last week amounted to $312 million, bringing year-to-date inflows to just over $1.5 billion. Meanwhile, short-sellers are capitulating, with outflows totaling $0.9 million for the third consecutive week.  Since the peak in April 2023, AuM has declined by 61%. The use of exchange-traded Products (ETPs) to gain exposure to the asset class remains significant, with ETP volumes representing 18% of total spot Bitcoin volumes last week. Ethereum (ETH) also experienced a positive shift in sentiment, with inflows of $34 million last week and a four-week run of $103 million. This marks a turnaround from the outflows observed earlier this year.  Furthermore, other cryptocurrencies such as Solana (SOL), Polkadot (DOT), and Chainlink (LINK) saw inflows totaling $3.5 million, $0.8 million, and $0.6 million, respectively. Ichimoku Cloud Predicts Bitcoin Surge To $43,000 In a bold prediction backed by technical analysis, renowned crypto analyst &#8220;Crypto Con&#8221; suggests that Bitcoin (BTC) is poised for a significant surge in the coming weeks.  Crypto Con claims to have accurately predicted BTC&#8217;s previous rise to $38,000 two months before it occurred, using the weekly Ichimoku cloud. Now all eyes are on the completion of the current upward move, with the initial target set at $43,000. For further context, the Ichimoku cloud is a popular technical indicator used to gauge potential future price trends and identify key support and resistance levels. According to Crypto Con, the weekly Ichimoku cloud has projected a bullish cross shortly, indicating that Bitcoin&#8217;s upward trajectory is far from over. Based on historical data, Crypto Con notes that the completion of previous Bitcoin rallies following a similar cross has taken anywhere from 7 to 11 weeks, with an average duration of 10 weeks. Consequently, the analyst expects the current move to culminate in early January. Related Reading: Circle And SBI Holdings Partnership To Boost USDC In Japan When the rise reaches its peak, Crypto Con suggests that the top of the red cloud, a key feature of the Ichimoku cloud, becomes the primary target. While the analyst identifies $43,200 as the most conservative level for this target, Crypto Con asserts that the red cloud&#8217;s true top could reach as high as $48,000. Featured image from Shutterstock, chart from TradingView.com "
  }
]