[
  {
    "source": "NewsBTC",
    "date": "2023-09-22T03:00:20.000Z",
    "title": "Immutable (IMX) Up By 23% In A Single Day, Analyst Suspects Market Manipulation",
    "url": "https://www.newsbtc.com/altcoin/immutable-imx-up-by-23-in-a-single-day-analyst-suspects-market-manipulation/",
    "description": "IMX, native token of Ethereum layer-2 scaling solution Immutable X, recorded massive gains on Thursday, soaring by over 23% within the last 24 hours. Before this price gain, IMX had been relatively stable all week, hovering around the $0.52 price zone, according to data from Coingecko. Behind IMX’s Rise, Analysts Points To Price Manipulation Although there may be no clear reasons for the token&#8217;s positive price movement, Chinese reporter Colin Wu speculated about potential price speculation.  According to a post on X by Wu, 10.95 million of the token, valued at $8.1 million, were transferred to the Upbit exchange from several other crypto exchanges, including Binance, OKX, Bybit, Crypto.com, Gate, etc.  Following these transactions, the token surged from $0.56 to $0.74, representing a 34.5% price gain. Wu has stated that Korean traders are &#8220;behind this move.&#8221; The Upbit exchange is mainly popular in South Korea, dominating over 83% of the nation&#8217;s crypto market. Providing more insight into these transactions, on-chain analytics firm Lookonchain reports that these transfers to Upbit were sent to the same wallet with the address &#8220;0x2F77.&#8221; This indicates a single crypto whale was likely behind this price surge.  Related Reading: IMX Spikes 10% In Last 24 Hours – Will It Start The Week Strong? Within three hours on Thursday, 12.54 million of the token, valued at $9.45 million, was transferred to “0x2F77,&#8221; allowing this address to become the 9th largest holder of the token, owning 20.4 million worth $15 million.  Furthermore, Lookonchain also revealed that several IMX investors opted to take profit following the token’s price gain. These investors include GSR Markets, a crypto investment firm that moved 2 million IMX, worth $1.52 million, to Binance right after IMX rose. In addition, three investors withdrew 3.5 million IMX, valued at $2.3 million, from the Foundation Treasury Locked wallet and may be planning a market dump. Following such transactions, it is no surprise that IMX soon experienced a price decline of about 13.33% a few hours after its boost. Related Reading: SHIB Frenzy: Robinhood’s 35 Trillion Token Acquisition Sparks Speculation Of Imminent Price Surge IMX Gets Listed On Japanese Exchange In other news, IMX has also been listed on the Japanese exchange Coincheck. According to a blog post by the crypto exchange on Thursday, IMX will now be eligible for its various services, including Coincheck NFT and  Coincheck crypto lending service.  In addition to IMX, Coincheck also announced listing other cryptocurrencies, namely Apecoin (APE) and AXS, the governance token of the Axie Infinity gaming metaverse.  At the time of writing, the IMX trades at around $0.64, with a price loss of 1.8% in the last hour. Based on more data from Coingecko, the token’s daily trading volume rose by 238.20%, valued at $808.50 million. IMX trading at $0.6425 on the hourly chart &#124; Source: IMXUSDT chart on Tradingview.com Featured image from Binance, chart from Tradingview"
  }
]