[
  {
    "source": "CoinDesk",
    "date": "2023-08-25T08:58:02.000Z",
    "title": "JPMorgan Sees Limited Downside for Crypto Markets in the Near Term",
    "url": "https://www.coindesk.com/markets/2023/08/25/jpmorgan-sees-limited-downside-for-crypto-markets-in-the-near-term/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "News that Elon Musk’s SpaceX had liquidated its bitcoin holding in the previous quarter acted as an additional catalyst for the correction in crypto markets in August, the report said."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-25T08:48:24.000Z",
    "title": "Binance Is Contacting Low-Cap Crypto Projects in Bid to Boost Trading",
    "url": "https://www.coindesk.com/business/2023/08/25/binance-is-contacting-low-cap-crypto-projects-in-bid-to-boost-trading/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The crypto exchange is conducting a \"risk management initiative\" targeting some crypto projects with a relatively small market capitalization or whose tokens form lower-liquidity trading pairs."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-25T08:59:10.000Z",
    "title": "Mastercard, Binance Terminate Card Partnership in Latin America",
    "url": "https://cryptobriefing.com/mastercard-binance-terminate-card-partnership/?utm_source=feed&utm_medium=rss",
    "description": "Mastercard has ended its card partnership with Binance in Latin America as the exchange faces increasing regulatory challenges globally."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-25T08:45:20.000Z",
    "title": "\n                        Trump NFTs Surge After Tucker Carlson Interview\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/trump-nfts-surge-after-tucker-carlson-interview",
    "description": "\n                        <p dir=\"ltr\">The prices and volumes of former president Donald Trump&rsquo;s NFT collection surged after an interview with conservative media personality Tucker Carlson on social media platform X.</p>\n<p dir=\"ltr\">Trump skipped the scheduled GOP debate, instead attacking his rivals through the interview with the former Fox News host.</p>\nNFT Collection Value Soars\n<p dir=\"ltr\">According to data sourced from NFT marketplace OpenSea, the Polygon-based digital cards were selling for 0.13 ETH, which is just over $215. This represents an increase from 0.1 ETH or $150. Data also suggests that the collection had amassed over 17ETH of trading volume. This means that the floor price has jumped by nearly 25%, while the trading volume has risen to $23.5 million.</p>\n<p dir=\"ltr\">However, it is important to note that the significant jump in activity related to the NFT collection is due to two wallets snapping up the NFTs. Like other digital assets, the price of NFTs also fluctuates considerably, especially when a bigger player gets involved and can significantly move markets. For example, just this month, the price of the Ethereum NFT Profile Picture (PFP) collection DeGods registered a significant drop after a single wallet dumped around 200 NFTs on the market.</p>\nThe Trump NFT Collection\n<p dir=\"ltr\">The former president released the NFT collection last December at a price of $99 each. The collection consists of 45,000 fantasy cards featuring Trump in various avatars, similar to collectible baseball cards. As of Thursday, the collection has more than 13,000 unique holders. Those who purchased the NFT cards were automatically entered into a &ldquo;sweepstakes,&rdquo; where they stood a chance to receive certain experiences with the former president. These included a dinner in Miami, a Zoom call, or a cocktail hour at Mar-a-Lago.</p>\n<p dir=\"ltr\">The cards quickly sold out at the time of launch. Data has shown that a wallet tagged as &ldquo;6D65A7&rdquo; holds the highest number of individual Trump NFTs at 602. This is followed by another wallet, &ldquo;72F891,&rdquo; which holds around 500. Neither of these wallets has sold or listed any of the NFTs for sale.</p>\n<p dir=\"ltr\">However, interest in the NFTs has cooled since launch, and the price keeps changing each time there is news associated with Trump. This includes negative news cycles such as the recent indictment.</p>\n<p dir=\"ltr\">Melania Trump has also tried her hand at NFTs, although her actions flopped in a big way. Melania had to come out and deny reports that she had to purchase her own NFTs.&nbsp;</p>\nTrump A Major Holder Of Tokens\n<p dir=\"ltr\">Trump was also recently revealed to be a major holder of tokens. The leading Republican candidate for the presidential elections to be held next year reportedly has around $2.8 million in cryptocurrency as of August. Furthermore, he also earned nearly $5 million in licensing fees thanks to the Trump NFT collection.</p>\n<p dir=\"ltr\">This came as a surprise to many, considering he had previously held not-so-favorable views about the crypto space and digital assets in general. Trump had stated he was extremely wary of Bitcoin because it posed a threat to the United States Dollar. He even called the world&rsquo;s largest cryptocurrency a scam.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;Bitcoin just seems like a scam&hellip;I don&rsquo;t like it because it is another currency competing against the dollar. Essentially, it&rsquo;s a currency competing against the dollar. I want the dollar to be the currency of the world. That is what I have always said.&rdquo;</p>\n\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T09:08:30.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T09:06:22.000Z",
    "title": "Cardano’s AGIX Token Shines Amid Market Downturn and is Supported By Billion-Dollar Giant Nvidia – Is ADA Poised for a Massive Upswing Move?",
    "url": "https://www.crypto-news-flash.com/cardanos-agix-token-shines-amid-market-downturn-and-is-supported-by-billion-dollar-giant-nvidia-is-ada-poised-for-a-massive-upswing-move/",
    "description": "<img width=\"1280\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/cardano.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/cardano.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/cardano-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/cardano-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/cardano-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/cardano-24x14.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/cardano-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/cardano-48x27.png 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />SingularityNET&#8217;s AGIX, affiliated with Cardano, witnesses a notable 9% growth, largely driven by Nvidia&#8217;s impressive financial report and optimistic third-quarter sales forecast. Charles Hoskinson, Cardano&#8217;s brainchild, unpacks pivotal platform upgrades, SEC&#8217;s 2023 scrutiny, and the crucial role of community engagement in the Cardano ecosystem&#8217;s future trajectory. Amid the tumultuous landscape of cryptocurrency, SingularityNET&#8217;s AGIX token [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T09:00:26.000Z",
    "title": "PEPE Aside, Traders Allocating Millions To This Promising Crypto Art Marketplace",
    "url": "https://www.crypto-news-flash.com/pepe-aside-traders-allocating-millions-to-this-promising-crypto-art-marketplace/",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-128.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-128.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-128-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-128-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-128-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-128-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Pepe (PEPE) has made its mark in crypto investments, but a significant market shift is underway. Meet Domini ($DOMI), an emerging crypto with a promising art marketplace gaining traction among astute traders and investors. As the anticipation for Domini&#8217;s presale builds, traders strategically allocate millions to position themselves at the forefront of this promising venture. [...]"
  }
]