[
  {
    "source": "CryptoSlate",
    "date": "2023-10-09T18:00:03.000Z",
    "title": "This San Diego bank’s client list is a who’s-who of questionable characters in crypto and beyond",
    "url": "https://cryptoslate.com/this-san-diego-banks-client-list-is-a-whos-who-of-questionable-characters-in-crypto-and-beyond/",
    "description": "<p>A recent Protos report reveals a series of business relationships between San Diego-based Axos Bank and a string of characters who have found themselves subject to regulatory or prosecutorial ire. Axos Bank—the direct bank affiliate of Axos Financial, based in Las Vegas, Nevada—has maintained business relationships with a variety of individuals and entities who have [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/this-san-diego-banks-client-list-is-a-whos-who-of-questionable-characters-in-crypto-and-beyond/\">This San Diego bank’s client list is a who’s-who of questionable characters in crypto and beyond</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-09T18:07:17.000Z",
    "title": "Huobi & KuCoin Added to UK Warning List for Operating Without Registration",
    "url": "https://cryptobriefing.com/huobi-kucoin-added-uk-warning-list/?utm_source=feed&utm_medium=rss",
    "description": "The FCA warns UK residents to be wary of Huobi and KuCoin, which were added to its list of unregistered crypto exchanges."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-09T17:53:50.000Z",
    "title": "Unveiling the Pitfalls of AI-Generated Content: How to Spot and Overcome Them",
    "url": "https://www.cryptopolitan.com/unveiling-pitfalls-of-ai-generated-content/",
    "description": "In the era of artificial intelligence, content-generation tools have revolutionized the way we create written materials. Yet, as we delve into the world of AI-written content, it&#8217;s crucial to recognize its limitations and understand how to address them effectively. The State of AI-Generated Content in 2023 The landscape of content creation has evolved drastically with ... <a title=\"Unveiling the Pitfalls of AI-Generated Content: How to Spot and Overcome Them\" class=\"read-more\" href=\"https://www.cryptopolitan.com/unveiling-pitfalls-of-ai-generated-content/\" aria-label=\"More on Unveiling the Pitfalls of AI-Generated Content: How to Spot and Overcome Them\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-09T17:51:24.000Z",
    "title": "AI in Pet Care: Transforming the Lives of Our Furry Friends",
    "url": "https://www.cryptopolitan.com/ai-in-pet-care-transforming-the-lives/",
    "description": "In the wake of the Covid-19 pandemic, there has been an unprecedented surge in pet ownership, with millions of people embracing four-legged companions to navigate the challenges of home isolation. This shift in pet ownership trends has given rise to a burgeoning pet tech market, projected to be worth a staggering $22 billion by 2028, ... <a title=\"AI in Pet Care: Transforming the Lives of Our Furry Friends\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-in-pet-care-transforming-the-lives/\" aria-label=\"More on AI in Pet Care: Transforming the Lives of Our Furry Friends\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-09T17:42:09.000Z",
    "title": "KuCoin Price Prediction 2023-2032: Is KCS a Good Investment?",
    "url": "https://www.cryptopolitan.com/kucoin-price-prediction/",
    "description": "KuCoin Price Prediction 2023-2032 KuCoin is one of the best choices to consider when investing in cryptocurrency. However, it is insufficient to hold the KCS cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at KuCoin’s price prediction from 2023 to 2032, its expected minimum price, and what it ... <a title=\"KuCoin Price Prediction 2023-2032: Is KCS a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kucoin-price-prediction/\" aria-label=\"More on KuCoin Price Prediction 2023-2032: Is KCS a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-09T17:40:29.000Z",
    "title": "CertiK Alert reports zkFlex Finance exit scam",
    "url": "https://crypto.news/certik-alert-reports-zkflex-finance-exit-scam/",
    "description": "In an Oct. 8 post on X, Certik, a security-focused ranking platform, reported an exit scam on zkFlex Finance after charts show a 100% in the project’s value."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-09T18:00:04.000Z",
    "title": "$29,700 Could Be The Next Big Level To Claim For Bitcoin, Here’s Why",
    "url": "https://www.newsbtc.com/bitcoin-news/29700-next-big-level-claim-bitcoin-heres-why/",
    "description": "On-chain data shows the true market mean price of Bitcoin is valued at $29,700 right now, making the level of particular significance for the coin. Bitcoin True Market Mean Price Is At $29,700 Currently In a new post on X, the lead on-chain analyst at the on-chain analytics firm Glassnode, &#8220;Checkmate,&#8221; pointed out how the BTC price currently trades below the true market cost basis. The &#8220;market cost basis&#8221; refers to the average price at which the investors in the sector bought their coins. One popular way of calculating this cost basis is through the &#8220;realized cap,&#8221; which measures the total value of the cryptocurrency by assuming that the price at which each coin on the blockchain was last transferred is its true value. When this capitalization model is divided by the total number of coins in circulation, the &#8220;realized price&#8221; is obtained, which is the average cost basis of the supply. Related Reading: These Bitcoin Holders Have Bought Almost $2 Billion In Last 6 Weeks: Data However, this method has some issues, such as a chunk of the circulating Bitcoin supply being permanently inaccessible (due to wallet keys becoming lost). A lot of this inactive supply would have traded long ago, meaning its cost basis would be shallow compared to today&#8217;s prices. Thus, if included in the metric, it would skew its value away from reality. Checkmate and Ark Invest&#8217;s David Puell came up with &#8220;Cointime Economics&#8221; a while back, a new methodology that tackles the problems with the realized price. &#8220;Cointime Economics introduces a simplified framework to efficiently discount the impact of lost supply and amplify economic impacts on the truly active supply,&#8221; explains Glassnode. The chart below shows the trend in the &#8220;true market mean price&#8221; for Bitcoin, as calculated by this advanced model. Looks like the spot price of the asset is currently below this line &#124; Source: @_Checkmatey_ on X Based on this more accurate model, Bitcoin currently has a true mean price of $29,700. Therefore, the asset&#8217;s spot price is trading well below this level. The graph shows that significant breaks above this indicator have historically resulted in the cryptocurrency enjoying some sustained bullish momentum. Checkmate has also attached the &#8220;AVIV Ratio Z-Score&#8221; data in the same chart. The &#8220;AVIV Ratio&#8221; tracks the deviation from the true market mean that BTC is currently observing. Related Reading: Bitcoin Makes Another Attempt At $28,000, Can Break Happen? The Glassnode lead notes that this indicator is the most accurate measure of the market centroid for Bitcoin. At the current value, the metric is &#8220;still -0.6 standard deviations below its long-term mean,&#8221; according to the analyst. The near-term outcome of the price based on this is uncertain, but in the long term, Bitcoin could see a reversion back to its mean, thus making the current price levels potentially profitable buying points. BTC Price At the time of writing, Bitcoin is trading at around $27,500, down 3% in the last week. The value of the coin appears to have registered some drawdown today &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-09T18:05:39.000Z",
    "title": "US Bonds Crater As Bloomberg Crypto Analyst Says Bullish Signal Popping Off for Bitcoin (BTC) – Here’s His Forecast",
    "url": "https://dailyhodl.com/2023/10/09/us-bonds-crater-as-bloomberg-crypto-analyst-says-bullish-signal-popping-off-for-bitcoin-btc-heres-his-forecast/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/BTC-Can-Collapse-Fiat.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/BTC-Can-Collapse-Fiat.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/BTC-Can-Collapse-Fiat.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/BTC-Can-Collapse-Fiat.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/BTC-Can-Collapse-Fiat.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/BTC-Can-Collapse-Fiat.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/BTC-Can-Collapse-Fiat.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bloomberg crypto analyst Jamie Coutts says that Bitcoin (BTC) is flashing an unexpected bullish signal as US long bonds continue their collapse. Coutts says on the social media platform X that Bloomberg&#8217;s trend model has suddenly signaled bullishness despite a deterioration of the macro landscape. Last week, yields on 30-year Treasuries went above the 5% [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/09/us-bonds-crater-as-bloomberg-crypto-analyst-says-bullish-signal-popping-off-for-bitcoin-btc-heres-his-forecast/\">US Bonds Crater As Bloomberg Crypto Analyst Says Bullish Signal Popping Off for Bitcoin (BTC) – Here’s His Forecast</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]