[
  {
    "source": "Crypto Daily",
    "date": "2023-07-25T06:30:00.000Z",
    "title": "Federal Reserve Opens Payment Platform Amid Crypto Crackdown",
    "url": "https://cryptodaily.co.uk/2023/07/federal-reserve-opens-payment-platform-amid-crypto-crackdown",
    "description": "<p class=\"md-end-block md-p md-focus\">The United States Federal Reserve has officially launched its new instant payment system dubbed FedNow.</p>\n<p class=\"md-end-block md-p\">The launch comes as the Federal Reserve looks to modernize and streamline the United States&rsquo; payment system. Research on financial systems has been ongoing since 2021 FedNow enables instant payment between users and banks and boasts of its 24/7/365 operations. Users will have full access to their funds and also do not have to pay anything to join the service. The Federal Reserve expects the service to speed up the flow of money throughout the country.</p>\n<p class=\"md-end-block md-p\">According to the FedNow&rsquo;s own website, the initial launch will simply focus on &ldquo;core clearing and settlement capabilities&rdquo; and additional features will be launched in phases, depending on industry demands and changes in technology. As more banks and credit unions adopt the service, users and businesses can expect more benefits. As of writing, early adopters of the service include big banks like JPMorgan Chase, Wells Fargo, and BNY Mellon.</p>\n<p class=\"md-end-block md-p\">While this development is of course a net positive for everyday users, the launch of FedNow raises a glaring question, especially regarding the United States&rsquo; own financial system. There are already existing systems like Venmo, Paypal or even The Clearing House&rsquo;s Real-Time Payments (RTP) Network that enable instant payments. So the question becomes what is FedNow really for? And what comes next after FedNow? </p>\n<p class=\"md-end-block md-p\">Although the Federal Reserve has said that FedNow will not be used as a springboard to the launch of the United States&rsquo; own central bank digital currency (CBDC), this has not stopped the cryptocurrency community from speculating and worrying. If the Federal Reserve, and by extension the United States government, is serious about digital currencies, then it should also relax the current hostile environment to cryptocurrency enablked by none other than the Securities and Exchange Commission (SEC).</p>\n<p class=\"md-end-block md-p\">The SEC, at the helm of Gary Gensler, has been on a warpath against cryptocurrency platforms with its unflinching stance that all crypto assets (save for Bitcoin) are securities.</p>\n<p class=\"md-end-block md-p\">Notably, there is the recent issue of the BRICS (Brazil, Russia, India, China, South Africa) bloc developing its own CBDC patently as a rival to the U.S. dollar. The United States is currently at a crossroads and the next big move after FedNow will be crucial not just to the everyday user but the entire world&rsquo;s monetary system.</p>\n<p class=\"md-end-block md-p\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-25T06:30:18.000Z",
    "title": "Russian Ruble Falls by Over 18% in 2023, Economist Says the Currency Has ‘Stabilized’",
    "url": "https://news.bitcoin.com/russian-ruble-falls-by-over-18-in-2023-economist-says-the-currency-has-stabilized/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/g900-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Russian Ruble Falls by Over 18% in 2023, Economist Says the Currency Has &#039;Stabilized&#039;\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/g900-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/g900-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/g900-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/g900-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/g900-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/g900-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/g900.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />After the Russian currency touched a year low versus the greenback of nearly 92 units for every dollar, economist Robin Brooks said the ruble has stabilized and may eventually be lifted by rising oil prices. The Institute of International Finance Economist urged G7 countries to consider cutting the Russian oil price cap from $60 to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T06:36:42.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 How much is LTC worth? The current price of Litecoin stands at $89.1. Over the past 24 hours, it has experienced a trading volume of $1.72B and a market capitalization of $6.71B. Litecoin’s market dominance is at 0.55%. However, there has been a decrease in the LTC price by 3.5% within ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T06:36:08.000Z",
    "title": "US GAO calls for stronger interagency cooperation in crypto regulation",
    "url": "https://www.cryptopolitan.com/gao-calls-for-stronger-crypto-regulation/",
    "description": "The United States Government Accountability Office (GAO), a Congressional watchdog agency, has published a report on the legal framework for using blockchain in finance that it finished in June. Reps. Maxine Waters and Stephen Lynch, the chair and ranking member of the House Financial Services Committee, respectively, sought the 77-page report before the midterm elections. ... <a title=\"US GAO calls for stronger interagency cooperation in crypto regulation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gao-calls-for-stronger-crypto-regulation/\" aria-label=\"More on US GAO calls for stronger interagency cooperation in crypto regulation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T06:34:20.000Z",
    "title": "Connext and Alchemix Introduce xERC-20 Token Standard to Mitigate Bridge Exploit Losses",
    "url": "https://www.cryptopolitan.com/connext-and-alchemix-introduce-xerc-20-token/",
    "description": "In a bid to tackle the ongoing concerns surrounding bridge security in the decentralized finance (DeFi) space, Connext, a leading cross-chain bridging protocol, has partnered with Alchemix Finance, a prominent DeFi platform, to unveil a new token standard called &#8220;xERC-20.&#8221; This innovative standard proposed as Ethereum Improvement Proposal (EIP) 7281, aims to empower token issuers ... <a title=\"Connext and Alchemix Introduce xERC-20 Token Standard to Mitigate Bridge Exploit Losses\" class=\"read-more\" href=\"https://www.cryptopolitan.com/connext-and-alchemix-introduce-xerc-20-token/\" aria-label=\"More on Connext and Alchemix Introduce xERC-20 Token Standard to Mitigate Bridge Exploit Losses\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T06:30:43.000Z",
    "title": "Is Bitcoin Cash Relevant After All these Years?",
    "url": "https://www.cryptopolitan.com/is-bitcoin-cash-relevant/",
    "description": "In a financial world that is increasingly digitized, the discourse surrounding cryptocurrency continues to pervade our daily conversations, from casual chats to in-depth economic discussions. Amidst a crowded sea of digital currencies, there exists Bitcoin Cash (BCH). This article aims to embark on an objective exploration and seeks to address a critical question: &#8220;Is Bitcoin ... <a title=\"Is Bitcoin Cash Relevant After All these Years?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/is-bitcoin-cash-relevant/\" aria-label=\"More on Is Bitcoin Cash Relevant After All these Years?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T06:24:52.000Z",
    "title": "JP Morgan has Fallen in and Out of Love with Bitcoin Over the Years",
    "url": "https://www.cryptopolitan.com/jp-morgan-has-fallen-out-of-love-with-bitcoin/",
    "description": "In the high-stakes world of global finance, few topics generate more controversy or scrutiny than Bitcoin. This pioneering cryptocurrency, which burst onto the scene in 2009, has consistently challenged traditional perceptions of currency, value, and the role of financial institutions. One such institution, at the heart of the global financial network, is JP Morgan Chase ... <a title=\"JP Morgan has Fallen in and Out of Love with Bitcoin Over the Years\" class=\"read-more\" href=\"https://www.cryptopolitan.com/jp-morgan-has-fallen-out-of-love-with-bitcoin/\" aria-label=\"More on JP Morgan has Fallen in and Out of Love with Bitcoin Over the Years\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T06:10:49.000Z",
    "title": "Can Instagram Threads Become the Platform for Crypto Enthusiasts?",
    "url": "https://www.cryptopolitan.com/instagram-threads-platform-crypto-enthusiast/",
    "description": "In the ever-expanding digital world, social media platforms play a pivotal role in facilitating communication and exchange of ideas. One of these platforms, which is grabbing significant attention, is Instagram Threads &#8211; a venture by Meta Platforms Inc., formerly known as Facebook Inc. As the company ventures into creating a new space for public discourse, ... <a title=\"Can Instagram Threads Become the Platform for Crypto Enthusiasts?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/instagram-threads-platform-crypto-enthusiast/\" aria-label=\"More on Can Instagram Threads Become the Platform for Crypto Enthusiasts?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-25T06:36:45.000Z",
    "title": "Investors anticipate Borroe at $1 billion, BNB under pressure and MATIC firm in 2023",
    "url": "https://crypto.news/investors-anticipate-borroe-at-1-billion-bnb-under-pressure-and-matic-firm-in-2023/",
    "description": "Borroe can have a market cap of $1 billion in coming years but BNB remains under pressure. Polygon's MATIC is firm"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T06:29:42.000Z",
    "title": "XDC Continues To Shoot Up With 74% Gain – What’s Powering This Token?",
    "url": "https://www.newsbtc.com/news/xdc-continues-to-shoot-up-with-74-gain-whats-powering-this-token/",
    "description": "As XDC, the digital token for XinFin Network, exhibits a powerful display of bullish momentum, the cryptocurrency market is humming enthusiastically. XDC has increased by an incredible 74% in just one week, impressing traders and investors with its massive rise. The altcoin&#8217;s ascent over the past 30 days has been remarkable; it has seen a substantial 56% increase, solidifying its place as one of the market&#8217;s most exciting digital assets. The altcoin has demonstrated its strength by trading at a startling 100% premium over its January opening. XDC&#8217;s price at the time of writing was $0.058, up 16.6% in the last 24 hours. At cryptocurrency market tracker Coingecko, the token continues to lead the list of the top 100 coins for the week. XDC Dominates Weekly Rankings Source: Coingecko XDC Network is a blockchain platform for businesses and developers who want to build decentralized apps (dApps) on an efficient and scalable blockchain infrastructure. The platform is built on an enhanced Ethereum codebase and is compatible with the Ethereum Virtual Machine (EVM). In order to attain the target price of $1, analysts predict that the value of the XDC token will increase by a factor of about 24. This suggests a big potential for growth and offers a chance for investors looking for significant returns. XDC market cap currently at $812 million. Chart: TradingView.com XDC has previously shown significant price appreciation. From its lowest price of $0.050 in June 2021, the token&#8217;s value increased by slightly more than three times in just two months. In August 2021, XDC reached its highest recorded price of $0.18 thanks to this outstanding performance. Such a sharp price increase demonstrates the token&#8217;s intrinsic volatility and ability to provide substantial returns in a short amount of time. A total of 37,705,012,600 XDC coins are available, with a circulating supply of 13,851,401,350 and a market cap of $812 million for XDC. Strong Price Performance &#160; XDC price action in the last week. Source: CoinMarketCap This year, the token has boomed, reaching a high of $0.050 before turning erratic, with periodic upward and downward movements. A 10% increase would allow XDC to test its 2023 highs again. XDC Network is thrilled to announce that we are a Gold Sponsor of @WebX_Asia organized by @coin_post , a premier event in Japan! 🇯🇵 After the strategic partnership with @sbivc_official, this sponsorship will further enhance our presence in the Japanese market, and we can&#8217;t wait… pic.twitter.com/KnKG2mSUrf — XinFin (@XinFin_Official) July 20, 2023 Meanwhile, the blockchain project&#8217;s collaboration with the Japanese cryptocurrency trading firm SBI VC Trade to sponsor WebX 2023 coincides with the token&#8217;s price increase. Users of the XDC network anxiously anticipate an upcoming event that will reveal cutting-edge innovations, open doors to exciting possibilities, and enable interactions with influential personalities in the business. The XDC community is brimming with anticipation for the network&#8217;s bright future, and this excitement has driven the network&#8217;s price higher over the past week. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Crast.net"
  }
]