[
  {
    "source": "Decrypt",
    "date": "2023-06-20T15:17:23.000Z",
    "title": "AI-Driven Generative Art: Art That Responds to Input",
    "url": "https://decrypt.co/resources/ai-driven-generative-art-art-that-responds-to-input-2",
    "description": "Code Canvas and Art Blocks are examples of platforms built with the assistance of blockchain tools which allow users to quickly and easily mint high-quality NFTs."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-20T15:09:27.000Z",
    "title": "A Year of Growth for Grayscale: GBTC sees 96% surge",
    "url": "https://cryptoslate.com/insights/a-year-of-growth-for-grayscale-gbtc-sees-96-surge/",
    "description": "<p>Quick Take The recent announcement of BlackRock&#8217;s intention to launch a spot Exchange-Traded Fund (ETF) has stirred up debate among cryptocurrency enthusiasts. Previously in March, Grayscale had expressed apprehension regarding the transformation of GBTC into an ETF. The firm&#8217;s attempt to establish its own ETF was unsuccessful, leading to a pending decision by Washington D.C. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/a-year-of-growth-for-grayscale-gbtc-sees-96-surge/\">A Year of Growth for Grayscale: GBTC sees 96% surge</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-20T15:30:20.000Z",
    "title": "Anticipation Builds as US Central Bank Eyes Two More Rate Hikes, Targeting 5.6% by Year-End",
    "url": "https://news.bitcoin.com/anticipation-builds-as-us-central-bank-eyes-two-more-rate-hikes-targeting-5-6-by-year-end/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/ccvv-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Anticipation Builds as US Central Bank Eyes Two More Rate Hikes, Targeting 5.6% by Year-End\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/ccvv-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ccvv-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ccvv-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ccvv-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ccvv-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ccvv-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ccvv.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />After the U.S. central bank refrained from boosting interest rates last week, investors now anticipate two more hikes that may elevate the federal funds rate to 5.6% by the year&#8217;s end, climbing 50 basis points (bps) from its present level. CME&#8217;s Fedwatch tool indicated on Tuesday that market predictions imply a 25bps increase during the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T15:37:15.000Z",
    "title": "European Investment Bank embraces blockchain for climate bond",
    "url": "https://www.cryptopolitan.com/european-investment-bank-embraces-blockchain/",
    "description": "In a groundbreaking development in sustainable finance, the European Investment Bank (EIB) has launched a green bond that embraces blockchain technology, specifically engineered to foster climate action. This marks a historic first for the bank, turning towards digitization to advance its environmental agenda. This Climate Awareness Bond, worth roughly $120 million, runs on an environmentally ... <a title=\"European Investment Bank embraces blockchain for climate bond\" class=\"read-more\" href=\"https://www.cryptopolitan.com/european-investment-bank-embraces-blockchain/\" aria-label=\"More on European Investment Bank embraces blockchain for climate bond\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T15:35:45.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 While the crypto market navigated the fallout from the&#160;collapse&#160;of FTX in late 2022, Ava Labs says it dodged the bullet. Ava Labs founder and CEO Emin Gün Sirer assure its stakeholders that FTX impacts very little the companies and projects operating in the Avalanche ecosystem. The company had an account on ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T15:35:32.000Z",
    "title": "EU watchdogs demand Action: investigating the risks of AI chatbot algorithms",
    "url": "https://www.cryptopolitan.com/eu-watchdogs-demand-action-investigating-the-risks-of-ai-chatbot-algorithms/",
    "description": "Thirteen consumer advocacy organizations within the European Union (EU) have called for authorities to scrutinize the AI algorithms that power popular chatbots. Concerned about the potential risks of generative AI, the groups have contacted their respective national consumer, data protection, competition, and product safety agencies. They aim to investigate the underlying artificial intelligence systems, including ... <a title=\"EU watchdogs demand Action: investigating the risks of AI chatbot algorithms\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eu-watchdogs-demand-action-investigating-the-risks-of-ai-chatbot-algorithms/\" aria-label=\"More on EU watchdogs demand Action: investigating the risks of AI chatbot algorithms\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T15:30:44.000Z",
    "title": "Breakthroughs in the AI Space – What Surprises Are Coming Next?",
    "url": "https://www.cryptopolitan.com/breakthroughs-in-the-ai-space/",
    "description": "The world of artificial intelligence (AI) experienced a momentous weekend, marked by groundbreaking innovations and significant international discussions. From Meta&#8217;s revolutionary generative speech model to unexpected generosity from ChatGPT and Bard, and the positive application of AI in a story of justice in the Philippines, these events have captured global attention.&#160; Meta Introduces Voicebox Over ... <a title=\"Breakthroughs in the AI Space &#8211; What Surprises Are Coming Next?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/breakthroughs-in-the-ai-space/\" aria-label=\"More on Breakthroughs in the AI Space &#8211; What Surprises Are Coming Next?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T15:29:00.000Z",
    "title": "$560,000 in Bitcoin seized from Andrew Tate by Romanian authorities",
    "url": "https://www.cryptopolitan.com/560000-in-bitcoin-seized-from-andrew-tate/",
    "description": "An unexpected tremor has surged through the cryptocurrency world as Romanian authorities seize $560,000 worth of Bitcoin from the controversial British-American influencer, Andrew Tate. The seizure is part of a more extensive investigation that has Tate and three other defendants, including his brother Tristan, in the Romanian legal crosshairs. From luxurious lifestyles to house arrest ... <a title=\"$560,000 in Bitcoin seized from Andrew Tate by Romanian authorities\" class=\"read-more\" href=\"https://www.cryptopolitan.com/560000-in-bitcoin-seized-from-andrew-tate/\" aria-label=\"More on $560,000 in Bitcoin seized from Andrew Tate by Romanian authorities\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T15:14:30.000Z",
    "title": "The crypto community doesn’t like IMF’s CBDC plans",
    "url": "https://www.cryptopolitan.com/crypto-community-doesnt-like-imfs-cbdc-plans/",
    "description": "The International Monetary Fund (IMF) is facing opposition from the cryptocurrency community regarding its persistent push to advance Central Bank Digital Currencies (CBDCs). This backlash signifies a growing apprehension about the potential impact of CBDCs and the perceived encroachment on the principles of decentralization, which are fundamental to the blockchain and crypto community. IMF&#8217;s CBDC ... <a title=\"The crypto community doesn&#8217;t like IMF&#8217;s CBDC plans\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-community-doesnt-like-imfs-cbdc-plans/\" aria-label=\"More on The crypto community doesn&#8217;t like IMF&#8217;s CBDC plans\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T15:10:34.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution that recently gained popularity among Ethereum users for executing ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-20T15:17:26.000Z",
    "title": "Andrew Tate’s bitcoins frozen: Romanian prosecutors confiscate $500k in crypto",
    "url": "https://crypto.news/andrew-tates-bitcoins-frozen-romanian-prosecutors-confiscate-500k-in-crypto/",
    "description": "Accused of rape, human trafficking, and organized crime for the sexual exploitation of women in Romania, Andrew Tate has faced asset seizures in bitcoin (BTC) by prosecutors."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-20T15:30:01.000Z",
    "title": "Optimism (OP) Soars Over 6% Following Launch On BNB Chain",
    "url": "https://www.newsbtc.com/optimism-2/optimism-op-scores-over-6-a-day-following/",
    "description": "Optimism price is basking in the news of BNB Chain’s newly introduced Optimism-powered layer-2 testnet opBNB. On June 19, BNB Chain announced the launch of its opBNB testnet. The newly launched layer-2 scaling solution based on Optimism Stack will boost the Binance Chain network’s security and scalability.  Following the launch, the Optimism token has scored an over 6% price increase today, June 20, after an over 3% decline on June 19. Binance-owned Blockchain Newly Introduced Optimism-powered Layer-2 Scaling Solution The scaling solution, opBNB, will increase transaction throughput, reducing network fees. BNB Chain currently processes about 2,000 transactions per second at $0.10 per transaction. However, according to the latest announcement, opBNB would support over 4,000 transactions per second at a cost below $0.005.  Related Reading: Bullish Signal: Bitcoin Realized Profit And Loss Fall To October 2020 Levels BNB Chain noted that opBNB optimizes data accessibility, and catching layer, and adjusts the submission process algorithm to enable simultaneous operations. That would allow the network to increase the gas limit to 100 million per block from the 30 million currently allowed on Optimism. Binance described opBNB as the solution to the scalability challenge limiting the mass adoption of blockchain technology. Optimism scales transactions using Optimistic Rollups, which process data off-chain to fasten things on the Ethereum mainnet. The newly launched scaling solution is Ethereum Virtual Machine (EVM)-compatible. That means it is interoperable with Ethereum-based smart contracts, networks, and ERC-20 token standards. Furthermore, the announcement noted that the remote procedure call service layer simplifies the integration process through a user-friendly interface.  With that, developers can focus on building applications without worrying about complexities associated with layer-2 scaling. News of this development has increased Optimism (OP) sentiment, evident in the increased trading volume.  At the time of writing, the Optimism token has recorded a 24-hour increase in trading volume of over 140%. BNB Chain isn’t the only network to leverage Optimism’s scalability. Optimism is known for its excellent scaling capability.  In a previous development, World ID and World App, a grass-free crypto wallet founded by OpenAI CEO, Sam Altman, migrated to Optimism to leverage its layer-2 scaling solution. OP Coin Price Outlook Optimism’s bullish price momentum has propelled it to second place among top-gaining coins today. Optimism (OP) price has increased by 6.61% over the past 24 hours, with a seven-day price rally of 1.15%. Despite the current price pump, real-time technical analysis suggests a sell option for Optimism (OP).  The moving averages suggest a strong sell signal, while the oscillators indicate a buy signal. But BNB Chain is the third-largest blockchain in DeFi total volume locked (TVL) after Ethereum and Tron.  DefiLlama data shows a TVL of $3.35 billion and a 24-hour volume of $264 million.  Related Reading: Why Is The Bitcoin Price Up Today? The latest integration suggests more network activity and utility for Optimism, which could boost trading volume and propel the token&#8217;s price upward. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T15:33:34.000Z",
    "title": "LTC Leaves ETH in the Dust: Litecoin Surpasses Ethereum in Total Addresses with a Lead of Over 20 Million",
    "url": "https://www.crypto-news-flash.com/ltc-leaves-eth-in-the-dust-litecoin-surpasses-ethereum-in-total-addresses-with-a-lead-of-over-20-million/?utm_source=rss&utm_medium=rss&utm_campaign=ltc-leaves-eth-in-the-dust-litecoin-surpasses-ethereum-in-total-addresses-with-a-lead-of-over-20-million",
    "description": "Litecoin has surpassed Ethereum with 200.7 million total addresses, while ETH has 181 million. The Litecoin Network reached an impressive milestone by maintaining uninterrupted operation for 4,257 consecutive days, showcasing 100% uptime. According to Glassnode, Litecoin (LTC) has surpassed Ethereum (ETH) in a significant measure. Specifically, at present, LTC&#8217;s total addresses have reached 200.7 million, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T15:17:38.000Z",
    "title": "Your Burning Questions About Big Eyes Coin Answered",
    "url": "https://www.crypto-news-flash.com/your-burning-questions-about-big-eyes-coin-answered/?utm_source=rss&utm_medium=rss&utm_campaign=your-burning-questions-about-big-eyes-coin-answered",
    "description": "What Is Big Eyes Coin? Big Eyes Coin (BIG) has taken the furry, feline-loving community by storm. This ERC-20 token, built on the Ethereum blockchain, combines enhanced speed and security to provide a captivating investment opportunity. With a staggering $46 million raised during its presale, Big Eyes Coin has captured the hearts and wallets of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T15:10:48.000Z",
    "title": "Tokenization: Unlocking a $5 Trillion Opportunity Led by Bitcoin, Chainlink, Tezos, Stablecoins, and CBDCs",
    "url": "https://www.crypto-news-flash.com/tokenization-unlocking-a-5-trillion-opportunity-led-by-bitcoin-chainlink-tezos-stablecoins-and-cbdcs/?utm_source=rss&utm_medium=rss&utm_campaign=tokenization-unlocking-a-5-trillion-opportunity-led-by-bitcoin-chainlink-tezos-stablecoins-and-cbdcs",
    "description": "Bernstein&#8217;s recent research report highlights tokenization as a promising prospect, presenting a $5 trillion opportunity v in the next five years. Tokenization encompasses the process of transforming tangible assets into digital tokens on a blockchain. According to a recent research report by Bernstein, tokenization is highlighted as a promising prospect, offering a remarkable $5 trillion [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-20T15:23:00.000Z",
    "title": "Charles Hoskinson Slams Ran Neuner in Ocean Expedition Banter",
    "url": "https://coinedition.com/charles-hoskinson-slams-ran-neuner-in-ocean-expedition-banter/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Charles-Hoskinson-Responds-to-Fabio.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Charles Hoskinson Responds to Fabio\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Charles-Hoskinson-Responds-to-Fabio.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Charles-Hoskinson-Responds-to-Fabio-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Charles-Hoskinson-Responds-to-Fabio-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Charles-Hoskinson-Responds-to-Fabio-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Charles-Hoskinson-Responds-to-Fabio-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Charles-Hoskinson-Responds-to-Fabio-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cardano founder Charles Hoskinson has responded to a Twitter jab from Ran Neuner, the founder of the YouTube channel Crypto Banter. In a tweet, Neuner trolled Hoskinson for embarking on a deep ocean expedition. According to him, Cardano’s user base is now so low that they are embarking on missions to find aliens as users. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/charles-hoskinson-slams-ran-neuner-in-ocean-expedition-banter/\">Charles Hoskinson Slams Ran Neuner in Ocean Expedition Banter</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]