[
  {
    "source": "CoinDesk",
    "date": "2023-12-20T14:00:00.000Z",
    "title": "Crypto Accounting and Tax Reporting Platform TRES Raises $11M to Add New Blockchains",
    "url": "https://www.coindesk.com/business/2023/12/20/crypto-accounting-and-tax-reporting-platform-tres-raises-11m-to-add-new-blockchains/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "TRES currently services clients with combined assets worth $19 billion, helping them manage, monitor and reconcile their digital asset activity across over 100 layer-1 and layer 2-blockchain networks"
  },
  {
    "source": "Decrypt",
    "date": "2023-12-20T13:59:20.000Z",
    "title": "Ledger to Disable Blind Signing on Dapps by June 2024",
    "url": "https://decrypt.co/210393/ledger-to-disable-blind-signing-on-dapps-by-june-2024",
    "description": "The hardware wallet manufacturer stated it would reimburse victims of last week's exploit involving a malicious version of its Connect Kit library."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-20T14:00:00.000Z",
    "title": " Dubai regulator VARA sets a crypto precedent for the world to follow ",
    "url": "https://cointelegraph.com/news/dubai-regulator-vara-crypto-precedent-for-world",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvM2E1MGE0OTktZjQ2MS00ZjliLWI5NzQtNTM5ZmY1YWE0NzNjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Key executives representing the Virtual Assets Regulatory Authority (VARA) revealed Dubai’s “hands-on” approach toward crypto in a Cointelegraph interview.</p>\n                    <p><p>The Virtual Asset Regulatory Authority (VARA), the regulator overseeing cryptocurrency laws within Dubai, has moved steadily toward its goal of establishing comprehensive rules for the crypto service providers in the region. </p><p>Formed in March 2022 to oversee and develop the Web3 ecosystem in Dubai, VARA <a href=\"https://cointelegraph.com/news/dubai-releases-crypto-regulations-for-virtual-asset-services-providers\">released comprehensive crypto regulatory guidelines</a> less than a year later, in February 2023, for virtual asset service providers (VASPs).</p><p>The virtual asset guidelines include four compulsory rulebooks, seven activity-specific rulebooks that lay down the rules for operating VASPs, and one virtual asset issuance rulebook. </p><p><a href=\"https://cointelegraph.com/news/dubai-regulator-vara-crypto-precedent-for-world\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-20T13:59:11.000Z",
    "title": " How to buy Tether (USDT) ",
    "url": "https://cointelegraph.com/news/how-to-buy-tether-usdt",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYjRiNjg0NGMtYTRkMS00MTBjLThjNDgtMDQ1Y2NlYzdhYmI1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Seamlessly enter the world of crypto — find out the various ways to buy USDT and safely store it.</p>\n                    <p><p></p><p>A stablecoin is a type of cryptocurrency designed to maintain a stable value by <a href=\"https://cointelegraph.com/learn/stablecoins-101-what-are-crypto-stablecoins-and-how-do-they-work\">pegging it to a reserve asset</a> like the United States dollar. USDT is a prominent example, which is tethered to the value of $1. </p><p>The precursor to Tether, originally named “Realcoin,” was issued on <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-a-beginners-guide-to-blockchain-technology\">the Bitcoin blockchain</a> before its rebranding. In 2014, Tether launched on Bitcoin’s Omni Layer, subsequently expanding to support multiple protocols, including <a href=\"https://cointelegraph.com/learn/what-is-ethereum-a-beginners-guide-to-eth-cryptocurrency\">Ethereum</a> and Tron. </p><p><a href=\"https://cointelegraph.com/news/how-to-buy-tether-usdt\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-20T13:45:01.000Z",
    "title": "Trump NFT collection takes hit after Colorado ballot removal",
    "url": "https://cryptoslate.com/trump-nft-collection-takes-hit-after-colorado-ballot-removal/",
    "description": "<p>The Colorado Supreme Court&#8217;s removal of former U.S. President Donald Trump from the state 2024 ballot has impacted the floor prices of his NFT collections. Data from OpenSea shows that the former President’s Collection Series 1 tanked by 11% to 0.1505 ETH, or $333, following the news. The collection&#8217;s market capitalization is approximately $15 million as of [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/trump-nft-collection-takes-hit-after-colorado-ballot-removal/\">Trump NFT collection takes hit after Colorado ballot removal</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T13:55:45.000Z",
    "title": "Latest Xbox Firmware Update Addresses Baldur’s Gate 3 Crashes",
    "url": "https://www.cryptopolitan.com/latest-xbox-firmware-update-address-baldurs/",
    "description": "In a recent development, Microsoft&#8217;s Xbox support team announced that the latest Xbox firmware update includes a fix for some of the crashing issues plaguing Baldur&#8217;s Gate 3 on the Xbox platform.&#160; The highly anticipated release of Larian Studios&#8217; Baldur&#8217;s Gate 3 for Xbox earlier this month was marred by reports of crashes that resulted [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T13:52:00.000Z",
    "title": "Immutable launches Passport for seamless gaming",
    "url": "https://www.cryptopolitan.com/immutable-launches-passport-seamless-gaming/",
    "description": "Immutable, a prominent Web3 game publisher, has recently unveiled its latest innovation in the form of a cutting-edge wallet infrastructure called “Immutable Passport.” This novel login method introduces a user-friendly approach, allowing individuals to effortlessly create and recover their wallets through familiar platforms such as Google or Apple accounts, as well as conventional email addresses. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T13:40:17.000Z",
    "title": "The Best Holiday Game to Play this Christmas",
    "url": "https://www.cryptopolitan.com/the-best-holiday-game-to-play-this-christmas/",
    "description": "The holiday season brings with it a unique opportunity for gamers to engage in immersive and entertaining holiday games. A recent article from Eurogamer.net has highlighted a list of five video games that are particularly suited for this festive time. This selection of holiday games offers a diverse range of genres and gameplay styles, catering [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-20T13:40:09.000Z",
    "title": "Michael Saylor lauds the emergence of Bitcoin ETFs on Wall Street",
    "url": "https://www.cryptopolitan.com/michael-saylor-laud-bitcoin-etfs-wall-street/",
    "description": "Bitcoin bull Michael Saylor anticipates that the approval of a spot Bitcoin exchange-traded fund (ETF) could mark the most significant development on Wall Street since the early 1990s. He likens it to the creation of the S&#38;P index, highlighting its potential impact on mainstream retail and institutional investors. Michael Saylor suggests that a spot Bitcoin [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-20T13:40:47.000Z",
    "title": "MOLLARS presale ongoing, project building a decentralized store of value ecosystem",
    "url": "https://crypto.news/mollars-presale-ongoing-project-building-a-decentralized-store-of-value-ecosystem/",
    "description": "The initial coin offering for MOLLARS, a store of value token on Ethereum, is now live"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-20T14:00:08.000Z",
    "title": "MATIC Enters Correction Phase, Bleeds 10% In The Past Week ",
    "url": "https://www.newsbtc.com/news/matic-enters-correction-phase-bleeds-over-8-in-the-past-week/",
    "description": "After the market entered a shortened bleeding phase, it has since rebounded to a stable foothold in preparation for a possibly bigger rally by year’s end. However, some altcoins continued to trend downward with MATIC being one of them. According to Coingecko, the token is down almost 10% in the weekly timeframe. Although the bears have a slight chokehold on MATIC’s market, there is some on-chain news that keeps the token afloat.  Related Reading: Woo-ing Buyers: Woo Network Token 75% Rally Sparks Investor Interest Update On Polygon’s Chain Development Kit (CDK)  Polygon recently posted on their blog about the newest addition to their CDK. Gateway, a blockchain infrastructure-focused team, integrated cdk-erigon into Polygon’s CDK. According to the blog post, Erigon is a fast, high-efficiency node that will bring a better user experience for developers building on Polygon.  Need for a Public RPC infrastructure in #defi? We got you covered 😎 Our team is happy to announce that we have become the RPC provider infrastructure for Stellar @StellarOrg /Soroban @SorobanOfficial Public RPC infrastructure. @gateway_eth head of infrastructure,… pic.twitter.com/c3jEMToFoP — Gateway FM (@gateway_eth) September 28, 2023 “Erigon is known for being memory-optimized, and so is cdk-erigon. Compared to the zkNode on Polygon zkEVM (of which Polygon CDK is a fork), cdk-erigon uses 10x less disk space with +150x faster sync times on mainnet,” the Polygon team said in the blog post.  MATIC market cap currently at $7.424 billion. Chart: TradingView.com This new addition will attract more developers to the platform. It can already be seen happening, with six projects testing the new Polygon CDK with the cdk-erigon integration.  Polygon also iterated that the system will be available as an RPC node for the protocol’s zkEVM Mainnet Beta next year. Positive News Overall, But What Now? As of writing, MATIC bulls are trying to reverse the current downward trend that the token is on. However, they might need to settle for a lower, more stable price point around $0.7550. This will provide investors and traders with a stable jump-off point for higher gains before the year’s end.  From MATIC To POL But MATIC bulls should consider the current phase of the network. Last September, the Polygon dev team announced the implementation of Polygon 2.0, an upgrade that would change the network’s token from MATIC to POL. According to MATIC’s Coingecko page, the upgrade from MATIC to POL has been initiated on the Ethereum mainnet.  Related Reading: Ethereum Whales Scoop Up $230 Million In ETH In One Week – Price Hike Next? Once the upgrade is in full swing, investors and traders will migrate their MATIC holdings to POL. This will inevitably harm the price as more and more investors will try to take value out of MATIC before it goes to the bin.  For now, investors and traders should be cautious of any major decision-making as any big investing decision made now will hurt gains in the long run. Featured image from Shutterstock"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-20T13:49:05.000Z",
    "title": "XRP (XRP) Price Prediction 2024-2030: Will XRP Price Hit $1 Soon?",
    "url": "https://coinedition.com/ripple-xrp-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Ripple-XRP-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple-XRP-Price-Prediction\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Ripple-XRP-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Ripple-XRP-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Ripple-XRP-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Ripple-XRP-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bullish XRP’s price prediction ranges from $0.824 to $0.955. Analysis suggests that the XRP may also reach $1.12 this year. XRP’s bearish market price prediction for 2024 is $0.2841. As the “crypto solution for business,” Ripple promises to create a business impact by taking advantage of blockchain technology. Ripple promises that its solution is faster, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ripple-xrp-price-prediction/\">XRP (XRP) Price Prediction 2024-2030: Will XRP Price Hit $1 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]