[
  {
    "source": "CoinDesk",
    "date": "2023-08-08T11:44:06.000Z",
    "title": "AI Will Be One of the Most Important Investment Themes Over the Next Decade: Morgan Stanley",
    "url": "https://www.coindesk.com/markets/2023/08/08/ai-will-be-one-of-the-most-important-investment-themes-over-the-next-decade-morgan-stanley/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The generative-AI market rally is assumed to have started with the launch of ChatGPT late last year, the report said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-08T11:45:00.000Z",
    "title": "Bank of England will get more power in regulating stablecoins",
    "url": "https://cointelegraph.com/news/bank-of-england-more-power-in-stablecoin-regulation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/1bd10bab-0aa8-43ce-8974-5b9922abfb16.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The United Kingdom government could rebalance the power between the Bank of England and the country’s principal financial regulator, the Financial Conduct Authority.</p>\n                    <p><p>The United Kingdom government could rebalance the power between the central bank of the country, Bank of England (BoE) and the principal financial regulator, the Financial Conduct Authority (FCA), in the former’s favor. That follows from the 40-page response to the consultation process, <a href=\"https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1176540/Payments_Regulation_and_the_Systemic_Perimeter_-_Consultation_Response.pdf\" target=\"_blank\" rel=\"noopener nofollow\">published</a> by His Majesty’s Treasury on August 7. </p><p>The consultation under a headline ‘Payments Regulation and the Systemic Perimeter’ was launched by the British government in 2022 to get the market proposals on reforming the BoE payments perimeter, given the evolution of financial stability risks. </p><p>The final paper sets out some measures for regulating the so-called “systemically important stablecoins”. The main takeaway is the government’s intention to secure the co-supervision over stablecoins as a joint venture of both BoE and the FCA. First time such regime was suggested in 2022’s stablecoins consultation response document.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-law-united-kingdom-law-commission-recommends-crypto-law-reforms\"><strong><em>UK Law Commission recommends ‘distinct’ legal category for crypto</em></strong></a></p><p>However, the BoE would be given a power to prevent the FCA from taking action in relation to a stablecoin provider, and the Prudential Regulation Authority (PRA) would also get a power to keep the FCA away from a specified action, “if it were to give rise to financial stability concerns.” </p><p>As the document specifies, most respondents accepted the need for Bank primacy towards the supervision of future systemically recognised payments entities. However, some of them demanded clarity on the limitations of its power. </p><p>In July, Andrew Bailey, a BOE governor, stated that both cryptocurrencies and stablecoins fail basic tests of singleness and settlement finality, and hence should not be considered as money. Instead, he proposed to develop <a href=\"https://cointelegraph.com/news/boe-governor-trashes-crypto-stablecoins-in-favor-of-enhanced-digital-money\">“enhanced digital money.”</a></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk. What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-08T12:30:00.000Z",
    "title": "US to add $5.2 billion to its debt every day for next 10 years - Bitcoin?",
    "url": "https://cryptodaily.co.uk/2023/08/us-to-add-5-2-billion-to-its-debt-every-day-for-next-10-years-bitcoin",
    "description": "<p>According to Bank of America analyst Michael Hartnett, the US government debt is predicted to rise to $50 trillion by 2033.&nbsp;</p>\n<p>This is the astonishing and ridiculous state our financial system has got into, and the vast majority of US citizens will probably just shrug their shoulders and carry on.</p>\nAn unfair downgrade?\n<p>That the US was recently downgraded from triple A to double A+ was heavily lamented in US government and banking circles. Treasury Secretary Janet Yellen called it &ldquo;puzzling&rdquo;, &ldquo;entirely unwarranted&rdquo;, and a &ldquo;flawed assessment&rdquo;.</p>\n<p>Jamie Dimon, CEO of JP Morgan, said that the downgrade was &ldquo;ridiculous&rdquo; and that &ldquo;it doesn&rsquo;t really matter&rdquo;, and that the markets would decide rather than the Fitch rating agency.&nbsp;</p>\n<p>Both of these heads of finance were hardly going to say that Fitch was absolutely right to make the downgrade, and so their hollow protests were probably to be expected. However, many will take them at their word and wonder why Fitch made this awful decision&hellip;</p>\nOf course we can print money out of thin air, we&rsquo;re the US government\n<p>So the already impossible and insurmountable US debt figure is set to rise from the current $32.5 trillion to around $50 trillion over the next 10 years. Given that this is a figure produced by a banker, perhaps the eventual figure might even be much higher.</p>\n<p>In congress, there are those who revel in the special privilege that the US wields with the dollar as the world&rsquo;s reserve currency. Brad Sherman is a staunchly anti-crypto congressman, always using his power and influence to malign and demean Bitcoin and cryptocurrencies.&nbsp;</p>\n<p>When accusing &ldquo;crypto bros&rdquo; of printing $1 trillion from thin air during a key congressional committee, he speculated that these same people might accuse the US government of doing the same thing. He said &ldquo;perhaps we do&rdquo; and vindicated the act by saying &ldquo;we&rsquo;re the US government&rdquo;. When certain congressmen/women and senators have such a view, it is no wonder the US is in the impossible situation it is in.&nbsp;</p>\nFrom the dollar sinking ship to the Bitcoin liferaft\n<p>So, we know that the US is going to add to its debt mountain over the next 10 years at least, as it spends like a drunken sailor, injecting scandalous amounts of new currency into the system, leading to currency debasement on a massive scale and leaving its citizens to shoulder the cost.</p>\n<p>Bitcoin on the other hand has a fixed supply built into its code. As its halving approaches in April of next year and its supply is cut in half, expect a tsunami of wealth to leave the sinking ship which is the dollar and climb aboard the Bitcoin liferaft.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-08T12:00:00.000Z",
    "title": "FTX Attorneys Face Second Lawsuit for Allegedly Aiding in Fraud",
    "url": "https://cryptodaily.co.uk/2023/08/ftx-attorneys-face-second-lawsuit-for-allegedly-aiding-in-fraud",
    "description": "<p>The law firm representing FTX, Fenwick &amp; West, has been slapped with a class action lawsuit by a group of FTX customers for allegedly aiding in fraud. </p>\n<p>Fenwick &amp; West, the law firm representing the fallen crypto exchange FTX, has been sued by a group of former FTX customers. The customers accused the firm of aiding in fraud via its legal advice to the exchange, Reuters reports.</p>\nFTX Lawyers Face Class Action Lawsuit\n<p>According to the complaint lodged on August 7, Fenwick &amp; West allegedly offered service to the exchange that &ldquo;went well beyond those a law firm should and usually does provide.&rdquo; The complaint states the firm&rsquo;s services included structuring transactions to avoid regulatory attention and setting up entities that helped FTX&rsquo;s former CEO, Sam Bankman-Fried, and other exchange executives engage in fraudulent activities.</p>\n<p>The current complaint is the second to be lodged against Fenwick concerning its dealings with FTX. Previous reports state that the firm Gibson Dunn was appointed to represent Fenwick on similar issues related to the exchange, including in the criminal case against SBF and a federal class action lawsuit.</p>\n<p>According to the court filing, Fenwick acted as the primary outside legal representative for the now-bankrupt exchange and therefore had a unique insight into FTX&rsquo;s &ldquo;convoluted organizational structure, abject lack of internal controls, and dubious business practices,&rdquo; Reuters reports.</p>\n<p>The dealings between Fenwick and FTX also extend to Daniel Friedberg. Mr Friedberg was a leading regulatory attorney for the exchange and joined FTX in 2020 from Fenwick. FTX&rsquo;s new management is now suing Friedberg.</p>\nFenwick Allegedly Helps Conceal FTX Executives&rsquo; Use of Customer Fund for Speculative Investments\n<p>The complaint further alleges that Fenwick &amp; West assisted in setting up two entities used to hide exchange executives&rsquo; use of customer funds to make speculative investments and political donations.</p>\n<p>The law firm allegedly also advised on transactions that helped the exchange obtain regulatory licenses without having to apply directly to the necessary regulators.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-08T11:55:00.000Z",
    "title": "The Fate Of ARK's Bitcoin ETF: A Prolonged Wait?",
    "url": "https://cryptodaily.co.uk/2023/08/the-fate-of-ark-bitcoin-etf-a-prolonged-wait",
    "description": "<p>The US Securities and Exchange Commission (SEC) is nearing a critical crossroads concerning ARK's application for a spot Bitcoin Exchange Traded Fund (ETF). With the August 13 deadline on the horizon, the financial world watches closely for the SEC's decisive verdict.</p>\nPotential Delay Until 2024\n<p>ARK Invest&rsquo;s official Bitcoin ETF submission on May 15 kicked off the SEC's countdown clock. It was followed by another filing on June 15 which preset the deadline as August 15, by which the SEC must express its approval or disapproval.&nbsp;</p>\n<p>However, the SEC can prolong the waiting game by 240 days, pushing the final response to January 10, 2024, for ARK Invest&rsquo;s proposal and March 2024 for other applicants.</p>\n<p>Speaking on the topic, ARK Invest CEO Cathie Wood noted that there is a high probability of the SEC delaying the matter further.&nbsp;</p>\n<p>When asked about the August deadline, Wood said,&nbsp;</p>\n\n<p>\"I think you're probably right that Aug. 13 will come and go. I think the SEC, if it's going to approve a bitcoin ETF, will approve more than one at once.\"</p>\n\nA Crowded Field of Aspirants\n<p>ARK isn't alone in its quest for a spot Bitcoin ETF. Numerous organizations, including Bitwise, BlackRock, VanEck, WisdomTree, Valkyrie, First Trust Galaxy, and Fidelity Wise Origin, have entered the Bitcoin ETF fray. Grayscale also seeks to convert its Bitcoin Trust into an ETF. If the SEC greenlights any one of these applications, the call for fair and equal approvals among the other applicants will gain extra momentum.&nbsp;</p>\n<p>This wave of applications stands apart due to a \"surveillance sharing\" pact with exchanges like Nasdaq and Cboe. The agreement's goal is to exchange market trading data, customer ID info, and clearing activity details. This move aims to curb market manipulation risks and protect investor funds against unauthorized use, addressing previous SEC concerns.</p>\nSEC's Reserved Move - The Waiting Game\n<p>Observers speculate that the SEC won't budge unless compelled. The Grayscale Bitcoin Trust's lawsuit serves as inspiration on how to tackle the agency and its unbudging stance on ETFs. The court case has prompted the SEC to clarify its stance, highlighting its approval of Bitcoin futures agreements with similar monitoring provisions. This legal tussle may lead to a more transparent decision-making process.</p>\n<p>While optimism grows in the crypto community, doubts remain about the SEC's approval of a Spot Bitcoin ETF. Critics recall the SEC's decade-long streak of rejecting such applications. Nevertheless, the approval of a leveraged Bitcoin ETF and a surge in Ethereum futures ETF applications hint at a shifting regulatory environment. Bloomberg Intelligence gives a 65% chance for approval, considering the Grayscale lawsuit and potential political influences.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-08T11:45:00.000Z",
    "title": "Arbitrage of cryptocurrencies using bots. How profitable is it in 2023? Top 5 best cryptocurrency arbitrage services today.",
    "url": "https://cryptodaily.co.uk/2023/08/arbitrage-of-cryptocurrencies-using-bots-how-profitable-is-it-in-2023-top-5-best-cryptocurrency-arbitrage-services-today",
    "description": "<p>Nowadays, no one manually searches for crypto spreads anymore; everyone uses bots for cryptocurrency arbitrage. There are two types of arbitrage bots: automatic and manual.</p>\nWhat are the differences?\n<p>Automatic arbitrage bots are bots where you set limits on spreads, coins, and exchanges. The bots themselves place orders or buy cryptocurrencies. All automatic bots work through APIs. Due to this, the risk of using automatic bots is significantly higher since you are essentially granting access to your funds to a third-party application.</p>\n<p>Manual arbitrage bots are bots that provide information on spreads through separate applications, messengers, or even SMS. You still choose the limits, coins, and exchanges.</p>\n<p>Today, we will review arbitrage bots and rank them based on the following criteria:</p>\n<p>1. Security</p>\n<p>2. User reviews</p>\n<p>3. Functionality</p>\n<p>4. Prices</p>\n<p>5. Additional features</p>\n<p>We will evaluate each criterion on a 5-point scale and calculate the arithmetic mean to determine the best cryptocurrency arbitrage bot.</p>\nArbitrageScanner\n<p></p>\n<p>&nbsp;</p>\n<p>Let's start with the first-place bot - ArbitrageScanner with a rating of 4.8.</p>\n<p>This service supports 60 CEX exchanges, 40 DEX exchanges, and more than 30 blockchains! The service even supports local exchanges in Turkey, Korea, and Latin America. Let's break down why it is ranked number one for cryptocurrency arbitrage scanning.</p>\n<p>1. Security: 5/5</p>\n<p>ArbitrageScanner is a manual cryptocurrency arbitrage bot. It sends you notifications about exchange rate differences on Telegram. This bot works without requesting API access, meaning all possible risks associated with your funds are eliminated. All exchanges connected to ArbitrageScanner have been verified and are safe to use.</p>\n<p>2. User reviews: 5/5</p>\n<p>We couldn't find any significant negative reviews online. There were a couple of users who were dissatisfied that the service wasn't working, but we verified that the project's official channels mentioned technical work, updates, and expanded functionality. Users' reviews in personal blogs are positive, and reviews from news resources are also positive.</p>\n<p>3. Functionality: 5/5</p>\n<p>The scanner works with a vast number of CEX, DEX, and blockchains. It is the most accurate scanner based on our measurements, always showing you the current cryptocurrency prices on exchanges. This alone gives it a high rating, but the service's development team has also created a screener for cryptocurrency arbitrage, which we'll discuss further in the Additional Features section.</p>\n<p>&nbsp;</p>\n<p></p>\n<p>4. Prices: 4/5</p>\n<p>The minimum tariff costs $70, but we recommend paying attention to the Expert tariff at $399. It is ideal for both beginner and expert arbitrage traders. Opting for a more expensive tariff provides increased limits, allowing you to set up 30 different coins simultaneously, 15 different Telegram channels, and more. What caught our attention the most is that this tariff includes free access to the second service we mentioned earlier - the Arbitrage Screener. Additionally, you gain access to an arbitrage trader community, where experienced specialists share successful strategies, insights, and current spreads that can be profitable. The price of $399 doesn't seem too high, especially when you are offered numerous earning opportunities. There is also a free trial available.</p>\n<p>5. Additional features: 5/5</p>\n<p>Under additional features, we consider what the service offers besides its main product. ArbitrageScanner provides numerous additional functions.</p>\n<p>- Closed chat for arbitrage traders, where both the scanner team and the community share cases and hot opportunities.</p>\n<p>- Educational materials, providing training on how to use the scanner, real cases, how to find arbitrage opportunities, and how to set up the service.</p>\n<p>- Screener: This is the second product available to users with Pro and higher subscriptions. It displays all possible spreads that you set up across different exchanges and coins. This tool complements the scanner perfectly. You configure the screener to find the exchanges and coins with the largest spreads at that moment. Then, you switch to the scanner, set the settings for those exchanges and coins, and it shows you the most current spreads. Perfect for those who want to earn profits!</p>\n<p>- The website offers a free profitability calculator for arbitrage. Even if you don't have a subscription yet, you can calculate how much you can earn on arbitrage with a specific cryptocurrency.</p>\n<p>- Some users have been given access to beta testing of another product called Telegram Scanner. This tool allows you to search for all mentions of your chosen cryptocurrency or topic in all Telegram chats. It sends all mentions of your keyword to a separate chat, and with a single click, you can respond to the original messages.</p>\n<p>&nbsp;</p>\n3Commas\n<p>&nbsp;</p>\n<p></p>\n<p>&nbsp;</p>\n<p>In second place, we have 3Commas with a rating of 4.2.</p>\n<p>This is one of the most popular automatic bots at the moment, suitable for cryptocurrency arbitrage. However, it has its small downsides:</p>\n<p>1. Security: 4/5</p>\n<p>While this bot has not been associated with fund theft or hacking, we cannot give it the highest rating. It uses APIs for operation, like all automatic bots, which poses a security threat to your finances.</p>\n<p>2. User reviews: 4/5</p>\n<p>User reviews are generally good, but there are negative reviews regarding the service's performance. Some users complain about the delayed support response, but we do not consider these to be critical drawbacks of the project.</p>\n<p>3. Functionality: 4/5</p>\n<p>The service offers automatic arbitrage, but only on a single exchange. Due to the large number of users, it is very difficult to automatically earn profits using this service as there is significant competition among arbitrage traders using the same bot. There is inter-exchange arbitrage available on 16 CEX exchanges, but compared to the number supported by the first-place service in our ranking, this seems very limited. Moreover, 3Commas does not support DEX exchanges, which are now considered the new frontier for arbitrage opportunities.</p>\n<p>4. Prices: 5/5</p>\n<p>The service offers a 7-day free trial, which is much longer than its competitors. The tariff prices range from $29 to $99, which is quite competitive for the services provided.</p>\n<p>5. Additional features: 4/5</p>\n<p>This is the most interesting aspect, considering what additional features each product offers. 3Commas provides:</p>\n<p>- 5 bots for manual trading and 9 for automatic trading, but most of them are available in the highest subscription.</p>\n<p>- A demo account where you can try out your strategies.</p>\n<p>- An internal portfolio rebalancer.</p>\nBitsgap\n<p></p>\n<p>In the third place in our ranking is Bitsgap with a rating of 3.6.</p>\n<p>This is an automatic bot that supports 15 CEX exchanges.</p>\n<p>1. Security: 4/5</p>\n<p>As we mentioned before, automatic bots are not safe to use. Here, we encounter the first confirmation of this statement. Some users reported that funds went missing from their accounts. It could be malicious competition, but we cannot overlook these statements.</p>\n<p>2. User reviews: 3/5</p>\n<p>User reviews are mixed, with complaints about poor support, delayed bot performance, and some exchanges periodically not functioning. As mentioned before, there are also claims about missing funds. On the other hand, some users did not experience such issues. While we cannot recommend using this bot, we also cannot claim that it is developed by dishonest developers.</p>\n<p>3. Functionality: 4/5</p>\n<p>The functionality does not stand out among automatic arbitrage bots. It supports 15 CEX exchanges and lacks DEX exchanges. Otherwise, it duplicates or even lacks certain features compared to 3Commas.</p>\n<p>4. Prices: 5/5</p>\n<p>The minimum tariff is $23, and the maximum is $119. The difference between tariffs is minimal, and in the market, this is a relatively high price for the services provided.</p>\n<p>5. Additional features: 2/5</p>\n<p>The service offers an arbitrage profitability blog and knowledge base, and unfortunately, that's all the additional functionality it provides.</p>\nCoinrule\n<p></p>\n<p>&nbsp;</p>\n<p>In fourth place on the list of arbitrage bots is Coinrule with a rating of 3.4.</p>\n<p>This is an automatic bot for arbitrage that supports 10 CEX exchanges.</p>\n<p>1. Security: 2/5</p>\n<p>Once again, this is an automatic bot that uses API. There are also articles about users of this bot losing their funds, but we cannot vouch for the accuracy of this information. It could also be the work of competitors, but we cannot ignore these claims.</p>\n<p>2. User reviews: 3/5</p>\n<p>User reviews are mixed. Many find it challenging to work with, even for experienced arbitrage traders. There are also negative reviews about missing funds, as mentioned earlier.</p>\n<p>3. Functionality: 4/5</p>\n<p>The bot supports only 10 CEX exchanges, and configuring it requires significant effort. Its functionality does not stand out compared to other automatic bots we reviewed today.</p>\n<p>4. Prices: 5/5</p>\n<p>The price for this product is $30 - $450 per month, which is above average considering the intuitiveness of the service's management and prices for similar features among competitors.</p>\n<p>5. Additional features: 3/5</p>\n<p>- Marketplace of arbitrage strategies&nbsp;</p>\nHaasOnline\n<p></p>\n<p>In the fifth place in our ranking is HaasOnline with a rating of 2.8.</p>\n<p>It is also an automatic bot that shows spreads between four 24 exchanges.</p>\n<p>1. Security: 3/5</p>\n<p>Since it is an automatic trading service, security is at an average level. This service has not been involved in hacking or fund theft from its users. Like any other automatic bot, it also requires API access.</p>\n<p>2. User reviews: 4/5</p>\n<p>User reviews are mixed. Many share their success stories of earning with this service, but there are also users who claim to have lost their funds. Some even reported that they couldn't make their subscription profitable using this bot.</p>\n<p>3. Functionality: 2/5</p>\n<p>This bot supports only four of the most popular exchanges, resulting in high competition among arbitrage traders and users of the service. This makes finding good spreads more challenging.</p>\n<p>4. Prices: 2/5</p>\n<p>The price for this product is $9 &ndash; $149 for a month, a reasonably acceptable price for what this bot provides.</p>\n<p>5. Additional features: 3/5</p>\n<p>This service offers additional features available to users:</p>\n<p>- A demo account where you can try out your strategies.</p>\n<ul>\n<li>Cloud server (it's not safe)&nbsp;</li>\n<li>We have highlighted some arbitrage bots that we believe are the most comprehensive and reflect the cryptocurrency arbitrage market. We recommend trying out ArbitrageScanner, even if you have used other bots that are not in our top list. We believe it is truly a market leader that other services will adapt to.</li>\n</ul>\n<p>&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-08T11:41:42.000Z",
    "title": "Xsolla and Crypto.com combine for Digital Payments",
    "url": "https://cryptodaily.co.uk/2023/08/xsolla-and-crypto-com-combine-for-digital-payments",
    "description": "<p>In a groundbreaking move, video game commerce giant Xsolla has teamed up with cryptocurrency platform, Crypto.com.&nbsp;</p>\n<p>The integration of Crypto.com's checkout solution into Xsolla's Pay Station platform heralds a new era in the gaming world and is a bold move forward for Crypto.com in its quest to carve a niche in the gaming sector.&nbsp;</p>\n<p>The integration promises to offer game enthusiasts and developers a seamless way to embrace cryptocurrency payments, ensuring smoother transactions and an enriched user experience.&nbsp;</p>\n<p>As the digital realm and metaverse grow, the partnership ensures gamers have plenty of payment options at their fingertips. Eric Anziani, the COO of Crypto.com, expressed his enthusiasm, stating,&nbsp;</p>\n\n<p>&ldquo;There is significant potential in the convergence of gaming and Web3. By partnering with a global gaming leader like Xsolla and leveraging our respective assets and expertise, we are helping make that potential a reality &ndash; giving developers, publishers, and players a seamless way to engage and create value in the crypto economy.&rdquo;&nbsp;</p>\n\n<p>Xsolla's Pay Station, already a powerhouse facilitating in-game purchases across a vast expanse of over 200 regions, is set to amplify its offerings with the Crypto.com Pay integration. This move is poised to broaden horizons for game developers, allowing them to connect with a diverse audience and explore untapped markets and revenue avenues.&nbsp;</p>\n<p>Chris Hewish, the head honcho at Xsolla, noted:</p>\n\n<p>&ldquo;The gaming industry is rapidly evolving, and we must adapt to meet those changes. The integration of cryptocurrencies as a form of payment offers game developers and players an innovative payment solution that aligns with the global shift towards digital currencies. Our collaboration with Crypto.com marks a pivotal moment for the gaming industry, paving the way for a more inclusive and secure gaming ecosystem.&rdquo;&nbsp;</p>\n\n<p>On a similar note, Patrick Yoon, who oversees Crypto.com's operations in Korea, added:</p>\n\n<p>&ldquo;We are tremendously excited to take this first step with Xsolla as part of a broader collaboration initiative in Korea and on a global level. We look forward to continuing to work with Xsolla in developing and advancing payment ecosystems and digital asset adoption.&rdquo;</p>\n\n<p>This joint enterprise between Crypto exchange Crypto.com and global video game commerce company Xsolla offers much potential for further integration of crypto and gaming. The availability of crypto payments for gamers is likely to stimulate both sectors.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T11:48:32.000Z",
    "title": "XDC Price Prediction 2023-2032: Is XinFin a Good Investment?",
    "url": "https://www.cryptopolitan.com/xdc-price-prediction/",
    "description": "XDC Price Prediction 2023- 2032 Have you heard it said, &#8220;Not every utility is as resistant as $XDC. You can&#8217;t compare XDC to others.&#8221; The XDC token is the underlying utility token of the XinFin hybrid blockchain. XinFin, an EVM-compatible, Proof-of-Stake powered smart contract blockchain, is one of the platforms leading the charge on high-efficiency ... <a title=\"XDC Price Prediction 2023-2032: Is XinFin a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xdc-price-prediction/\" aria-label=\"More on XDC Price Prediction 2023-2032: Is XinFin a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T11:47:45.000Z",
    "title": "The Sandbox Price Prediction 2023-2032: Should You Hodl or Dump SAND?",
    "url": "https://www.cryptopolitan.com/the-sandbox-price-predictions/",
    "description": "The Sandbox Price Prediction 2023-2032 If you&#8217;re into crypto games, SAND will be familiar to you, and The Sandbox Price Prediction will prove helpful. The new virtual universe inspired by Metaverse gaming firm The Sandbox has opened toward NFT auctions, where several pieces have been sold, including the mega yacht. According to announcements from the ... <a title=\"The Sandbox Price Prediction 2023-2032: Should You Hodl or Dump SAND?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-sandbox-price-predictions/\" aria-label=\"More on The Sandbox Price Prediction 2023-2032: Should You Hodl or Dump SAND?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-08T12:05:24.000Z",
    "title": "Cardano whales amass $116m as on-chain volume soars ",
    "url": "https://crypto.news/cardano-whales-amass-116m-as-on-chain-volume-soars/",
    "description": "Cardano (ADA) shark and whale addresses have amassed more tokens amid the persistent downturn, accumulating $116 million worth of ADA in two months. This accumulation trend coincides with a consistent rise in on-chain volume. Santiment disclosed on Aug. 8 that&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-08T12:04:51.000Z",
    "title": "Litecoin halves miner rewards, InQubeta draws fresh investor interest",
    "url": "https://crypto.news/litecoin-halves-miner-rewards-inqubeta-draws-fresh-investor-interest/",
    "description": "Amid the Litecoin halving event, InQubeta is taking center stage in artificial intelligence (AI) sector. QUBE presale amount exceeds $2.1 million"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-08T11:59:49.000Z",
    "title": "Singapore grants payment institution license to Blockchain.com",
    "url": "https://crypto.news/singapore-grants-payment-institution-license-to-blockchain-com/",
    "description": "Blockchain.com has received a license from Singapore&#8217;s regulatory body, the Monetary Authority of Singapore (MAS). The announcement follows the previous approval that the company received in September of last year from the MAS. The new license will allow the exchange&#8230;"
  },
  {
    "source": "Kraken Blog",
    "date": "2023-08-08T11:46:16.000Z",
    "title": "Announcing Kraken’s liquidity pool for futures",
    "url": "https://blog.kraken.com/product/announcing-krakens-liquidity-pool-for-futures",
    "description": "Enhanced risk management We are always looking for ways to help our clients participate in crypto markets with greater confidence. So we are pleased to introduce our liquidity pool for futures, designed to minimize the need to unwind futures positions and improve the experience of Position Assignment System (PAS) participants. The liquidity pool provides additional [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-08T11:58:33.000Z",
    "title": "Bitcoin’s Quarterly Chart Predicts 15% Crash Before Reaching $50,000 – Is it Time to Buy BTC?",
    "url": "https://www.crypto-news-flash.com/bitcoins-quarterly-chart-predicts-15-crash-before-reaching-50000-is-it-time-to-buy-btc/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoins-quarterly-chart-predicts-15-crash-before-reaching-50000-is-it-time-to-buy-btc",
    "description": "<img width=\"1920\" height=\"1358\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/11/btc-gf40dcf48f_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/11/btc-gf40dcf48f_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/btc-gf40dcf48f_1920-300x212.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/btc-gf40dcf48f_1920-1024x724.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/btc-gf40dcf48f_1920-768x543.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/11/btc-gf40dcf48f_1920-1536x1086.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Bitcoin is said to be using 2023 to rebalance inefficiencies produced in 2022 when it moved from $25,200 to $32,853. According to analysts, the asset could record a 15 to 26 percent pullback before staging any bull run. Market data indicates that Bitcoin (BTC) currently has a bullish sentiment. However, its seven-day growth has been [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-08T11:48:01.000Z",
    "title": "SEC Rule on ARK’s Bitcoin ETF Near; BTC Surge Possible with Multiple Firms Awaiting Spot Bitcoin ETF Approval",
    "url": "https://www.crypto-news-flash.com/sec-rule-on-arks-bitcoin-etf-near-btc-surge-possible-with-multiple-firms-awaiting-spot-bitcoin-etf-approval/?utm_source=rss&utm_medium=rss&utm_campaign=sec-rule-on-arks-bitcoin-etf-near-btc-surge-possible-with-multiple-firms-awaiting-spot-bitcoin-etf-approval",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/securities-and-exchange-7232757-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/securities-and-exchange-7232757-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/securities-and-exchange-7232757-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/securities-and-exchange-7232757-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/securities-and-exchange-7232757-104x69.jpg 104w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />SEC to consider approval of Ark&#8217;s spot Bitcoin ETF ahead this week on August 13. Ark Invest chief Cathie Wood believes that the securities regulator should approve all Bitcoin ETF applications at once. The U.S. Securities and Exchange Commission (SEC) is facing a deadline of August 13 in order to either approve or disapprove Ark [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-08T11:45:00.000Z",
    "title": "Kraken Opens BRICK and MOON Trading for Reddit Community",
    "url": "https://coinedition.com/kraken-opens-brick-and-moon-trading-for-reddit-community/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/BRICK-and-MOON-trading-starts-today-on-spot-and-futures-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>US-based crypto exchange Kraken has officially announced the commencement of trading for Bricks (BRICK) and Moons (MOON) on its platforms, particularly spot and derivative markets. According to Kraken, the trading phase began on Monday, with users granted access to fund their BRICK and MOON holdings. However, the report noted that only deposits made via the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/kraken-opens-brick-and-moon-trading-for-reddit-community/\">Kraken Opens BRICK and MOON Trading for Reddit Community</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-08T11:45:50.000Z",
    "title": "Bloomberg Analyst Predicts Mass Die-Off of ‘Zombie’ Ethereum (ETH) Competitors",
    "url": "https://dailyhodl.com/2023/08/08/bloomberg-analyst-predicts-mass-die-off-of-zombie-ethereum-eth-competitors/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Predicts-Mass-Die-eth.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Predicts-Mass-Die-eth.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Predicts-Mass-Die-eth.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Predicts-Mass-Die-eth.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Predicts-Mass-Die-eth.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Predicts-Mass-Die-eth.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Predicts-Mass-Die-eth.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bloomberg Intelligence’s crypto market analyst Jamie Coutts is warning that Ethereum (ETH) competitors may soon fizzle out. Coutts tells his 5,938 X followers that ETH competitors put up abysmal second-quarter financials this year, which he says indicates these projects are likely doomed. According to Coutts, there are similarities between “zombie” companies traded on the stock [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/08/bloomberg-analyst-predicts-mass-die-off-of-zombie-ethereum-eth-competitors/\">Bloomberg Analyst Predicts Mass Die-Off of ‘Zombie’ Ethereum (ETH) Competitors</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]