[
  {
    "source": "Decrypt",
    "date": "2023-09-15T21:28:36.000Z",
    "title": "Nouns Fork: Disgruntled NFT Holders Exit With $27 Million From Treasury",
    "url": "https://decrypt.co/197400/nouns-fork-disgruntled-nft-holders-exit-27-million-from-treasury",
    "description": "The Nouns NFT collective on Ethereum, which is building open-source IP by funding creative projects, fractures after a widely supported fork."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-15T21:20:28.000Z",
    "title": "Judge Grants SEC’s Motion to Unseal Key Documents in Binance Lawsuit",
    "url": "https://decrypt.co/197396/judge-sec-unseal-key-documents-binance-lawsuit",
    "description": "The judge’s approval follows accusations that Binance US exhibited a “lack of transparency” in the SEC’s investigation."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-15T21:25:46.000Z",
    "title": "Gemini legal team accuses DCG of 'gaslighting' Genesis creditors",
    "url": "https://cointelegraph.com/news/gemini-legal-team-accuses-dcg-gaslighting-genesis-creditors",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/d3b42a6e-cd8f-41f7-8194-6a250083a2ea.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Lawyers representing Gemini Trust filed a response in bankruptcy court to Digital Currency Group's plan claiming to offer unsecured creditors a \"70–90% recovery\".</p>\n                    <p><p>Lawyers representing Gemini Trust have pushed back against a plan proposed by Digital Currency Group (DCG) for creditors of Genesis Global.</p><p>In a Sept. 15 filing in United States Bankruptcy Court for the Southern District of New York, the legal team <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysb.314889/gov.uscourts.nysb.314889.704.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">accused</a> DCG of gaslighting Genesis creditors through “contrived, misleading, and inaccurate assertions” in the recovery plan. The plan, filed in bankruptcy court on Sept. 13, <a href=\"https://cointelegraph.com/news/gemini-earn-users-recover-all-funds-dcg-remuneration\">claimed that unsecured creditors</a> could have a “70–90% recovery with a meaningful portion of the recovery in digital currencies” while Gemini Earn users could expect an “approximately 95–110%” recovery for their claims.</p><p>According to the legal team, DCG was attempting to “bait the Gemini Lenders into accepting a deal” that would allow the company to pay less than it allegedly owed. Lawyers called on the firm to “significantly improve the terms of the loans” provided to Genesis and not use <a href=\"https://cointelegraph.com/news/crypto-lender-genesis-files-for-bankruptcy\">Genesis’ bankruptcy proceedings</a> as cover for justifications in the recovery plan.</p><p>“To distract the Genesis creditors from the inconvenient facts of its facially inadequate and inequitable proposal, DCG touts proposed recovery rates that are a total mirage — misleading at best and deceptive at worst,” said the Sept. 15 filing. “Make no mistake: Gemini Lenders will not actually receive anything close in real value terms to the proposed recovery rates under the current ‘agreement in principle.’”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/8bc52ba7-0509-459b-b26c-8937da06fd99.png\"  /><figcaption style=\"text-align: center;\"><em>Sept. 15 filing in U.S. Bankruptcy Court for the Southern District of New York. Source: <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysb.314889/gov.uscourts.nysb.314889.704.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">CourtListener</a></em></figcaption></figure><p>The legal battle involved entanglements with cryptocurrency exchange Gemini and DCG over the Gemini Earn program, financed in part by Genesis. Genesis <a href=\"https://cointelegraph.com/news/breaking-crypto-lender-genesis-global-halts-withdrawals\">halted withdrawals in November 2022</a> in the wake of FTX’s collapse, citing “unprecedented market turmoil” at the time, and filed for bankruptcy in January 2023.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/digital-currency-group-genesis-reaches-agreement-with-genesis\"><strong><em>DCG reaches ‘agreement in principle’ with Genesis creditors, debtors</em></strong></a></p><p>According to court filings by Gemini, Genesis <a href=\"https://cointelegraph.com/news/gemini-considers-forbearance-as-dcg-defaults-on-630-million-payment\">owed more than $3.5 billion</a> to its top 50 creditors at the time of its Chapter 11 filing. The crypto exchange filed a claim in May aimed at recovering more than $1.1 billion in assets for roughly 232,000 Earn users, and a <a href=\"https://cointelegraph.com/news/gemini-files-lawsuit-against-digital-currency-group-barry-silbert-genesis-earn-program\">lawsuit against DCG</a> and CEO Barry Silbert in June, alleging fraud. </p><p>“Barry was not only the architect and mastermind of the DCG and Genesis fraud against creditors, he was directly and personally involved in perpetrating it,” <a href=\"https://twitter.com/cameron/status/1677327395869581316\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Gemini co-founder Cameron Winklevoss in June.</p><p>The U.S. Securities and Exchange Commission <a href=\"https://cointelegraph.com/news/gemini-and-genesis-charged-by-sec-over-unregistered-securities\">filed a civil suit</a> against Gemini and Genesis in January for allegedly selling unregistered securities through the Earn program. The two firms <a href=\"https://cointelegraph.com/news/gemini-files-to-dismiss-sec-s-lawsuit-over-its-earn-product\">filed a motion</a> to dismiss the case in May, but it was still ongoing at the time of publication.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  }
]