[
  {
    "source": "Cointelegraph",
    "date": "2023-07-18T03:43:32.000Z",
    "title": "Apple’s headset could redefine what being in the metaverse means",
    "url": "https://cointelegraph.com/news/apple-vision-pro-mixed-reality-redefine-experiences-metaverse",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/fc1f5c95-54bd-4fd3-85c8-9c77e3dcc3d8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>KPMG's Head of Metaverse Alyse Sue believes the tech included in Apple’s mixed reality headset could shift the way users interact and experience the metaverse.</p>\n                    <p><p>The release of Apple’s new mixed-reality headset, Vision Pro, could cause a seismic shift in how users will experience the metaverse, with developers potentially moving away from the absolute isolation of virtual reality.</p><p>Unlike today's virtual reality headsets, which center on full immersion, Apple’s Vision Pro — <a href=\"https://www.apple.com/newsroom/2023/06/introducing-apple-vision-pro/\" target=\"_blank\" rel=\"noopener nofollow\">unveiled</a> on June 5 — can also superimpose applications onto the real world, letting users \"interact with digital content in a way that feels like it is physically present in their space.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Apple&#39;s AR headset revealed - Apple Vision Pro <a href=\"https://t.co/UpNM7cH5yL\">pic.twitter.com/UpNM7cH5yL</a></p>&mdash; Wario64 (@Wario64) <a href=\"https://twitter.com/Wario64/status/1665786482546843648?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Speaking to Cointelegraph, KPMG’s Head of Metaverse Alyse Su believes the Vision Pro will shift developer focus away from <a href=\"https://cointelegraph.com/news/not-all-virtual-worlds-are-based-on-fictitious-designs-this-one-replicates-mars\">purely immersive virtual worlds</a>. </p><p>The headset introduces a new technology it calls \"EyeSight,\" which uses lens trickery to make the user’s facial expressions look natural to outsiders. EyeSight also allows the display to switch between a transparent and opaque view, depending on whether a user is consuming immersive content or interacting with people in the real world. </p><p>“With the traditional or other headsets, there's this barrier between people who are wearing it and people who aren't. It feels like you're in two different worlds,” she said. “Now there's very few barriers between people, so you can have relatively seamless interactions.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Apple EyeSight lets people see your eyes when you&#39;re using the headset <a href=\"https://t.co/p773ZPjwRZ\">pic.twitter.com/p773ZPjwRZ</a></p>&mdash; Dexerto (@Dexerto) <a href=\"https://twitter.com/Dexerto/status/1665788435339124737?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Su said there is also a lot of potential in its eye-tracking technology, which can be used to help create personalized experiences. </p><p>Apple’s pupil-tracking technology works by detecting the mental state of users based on data from their eye movements and the response of their pupils to stimulus. It then uses artificial intelligence to make predictions about their emotions. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I spent 10% of my life contributing to the development of the <a href=\"https://twitter.com/hashtag/VisionPro?src=hash&amp;ref_src=twsrc%5Etfw\">#VisionPro</a> while I worked at Apple as a Neurotechnology Prototyping Researcher in the Technology Development Group. It’s the longest I’ve ever worked on a single effort. I’m proud and relieved that it’s finally… <a href=\"https://t.co/vCdlmiZ5Vm\">pic.twitter.com/vCdlmiZ5Vm</a></p>&mdash; Sterling Crispin ️ (@sterlingcrispin) <a href=\"https://twitter.com/sterlingcrispin/status/1665792422914453506?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“They've incorporated a lot of neuroscience or neuro tech research into this headset. The most overlooked part is the predictive pupil dilation tracking technology, which is based on their years of neurological research,” said Su. </p><p>Su predicted that the Vision Pro will steer developers towards utilizing “emerging fields such as neuroscience and generative AI to create more personalized and predictive experiences.”</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/TX9qSaGXFyg\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Peter Xing, the founder of blockchain-based project Transhuman Coin also praised the headset’s design for “integrating with the natural way we interact as humans” and pointed to its unique eye-tracking capabilities as one of the bigger leaps forward for the metaverse. </p><blockquote>“By detecting pupil dilations, the headset is acting as a proto-brain-computer interface to pick up when a user expects something to be selected to pre-empt what they’re thinking.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/animoca-still-bullish-on-blockchain-games-awaits-license-for-metaverse-fund\"><strong><em>Animoca still bullish on blockchain games, awaits license for metaverse fund</em></strong></a></p><p>When asked if the Vision Pro could put a spring back into the step of a struggling metaverse industry — which has seen almost all of the blockchain-based virtual worlds <a href=\"https://cointelegraph.com/news/top-metaverse-property-investments-suffer-massive-losses-report\">suffer losses of more than 90%</a> in their native tokens — Xing wasn’t overly hopeful, at least not in the short-term. </p><p>He explained that it’s highly unlikely that Apple would encourage decentralized approaches that could threaten its “lucrative walled garden.” </p><p>While he, and many others, noted the distinct lack of a gaming focus in the product release, Xing believes the recent Apple’s partnership between Disney and Marvel could see a wellspring of games and other interactive experiences brought into the fold. </p><p>Xing believes this is exactly what the metaverse needs to go from the “gamer-centric world” to the mainstream. </p><p><strong><em>AI Eye: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-travel-booking-bad-3-weird-uses-chatgpt-crypto-plugins/\"><strong><em>AI travel booking hilariously bad, 3 weird uses for ChatGPT, crypto plugins</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T04:06:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-18T04:02:57.000Z",
    "title": "LINK Price Prediction: Chainlink Rallies Over 7% As The Bulls Aim $8.8",
    "url": "https://www.newsbtc.com/analysis/link/link-price-prediction-chainlink-to-8-8/",
    "description": "Chainlink’s LINK price is gaining pace above $7.00. The price could rise further if it clears the $7.35 and $7.50 resistance levels. Chainlink token price is showing positive signs and rising from $6.50 against the US dollar. The price is trading above the $7.00 level and the 100 simple moving average (4 hours). There is a major bullish trend line forming with support near $6.65 on the 4-hour chart of the LINK/USD pair (data source from Kraken). The price could gain bullish momentum above the $7.35 resistance zone. Chainlink (LINK) Price Eyes More Gains After a short-term downside correction, LINK price found support near the $6.45 level against the US Dollar. A low was formed near $6.458 and the price started a fresh increase, unlike Bitcoin and Ethereum. There was a clear move above the $6.65 and $6.90 resistance levels. The price climbed above the 50% Fib retracement level of the downward move from the $7.36 swing high to the $6.458 low. LINK price is now trading above the $7.00 level and the 100 simple moving average (4 hours). There is also a major bullish trend line forming with support near $6.65 on the 4-hour chart of the LINK/USD pair. The pair is now facing resistance near the 76.4% Fib retracement level of the downward move from the $7.36 swing high to the $6.458 low. Source: LINKUSD on TradingView.com The first major resistance is near the $7.35 zone. A clear break above $7.35 may possibly start a fresh increase toward the $7.50 and $7.85 levels. The next major resistance is near the $8.00 level, above which the price could revisit $8.80. Dips Supported? If Chainlink’s price fails to climb above the $7.35 resistance level, there could be a downside correction. Initial support on the downside is near the $6.90 level. The next major support is near the $6.65 level and the trend line zone, below which the price might test the $6.45 level. Any more losses could lead the price toward the $6.00 level in the near term. Technical Indicators 4 hours MACD – The MACD for LINK/USD is gaining momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for LINK/USD is now above the 50 level. Major Support Levels – $6.90 and $6.65. Major Resistance Levels – $7.35 and $8.00."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-18T03:49:20.000Z",
    "title": "Ethereum Price Indicators Suggest A Strong Case For More Downsides",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-downsides-1900/",
    "description": "Ethereum price corrected further lower below the $1,900 level against the US Dollar. ETH is showing bearish signs and might decline further toward $1,825. Ethereum extended its decline and tested the $1,875 level. The price is trading below $1,930 and the 100-hourly Simple Moving Average. There is a connecting bearish trend line forming with resistance near $1,910 on the hourly chart of ETH/USD (data feed via Kraken). The pair could decline further if it stays below the $1,910 and $1,940 resistance levels. Ethereum Price Could Extend Losses Ethereum’s price made a fresh attempt to start a decent increase above the $1,950 resistance. However, ETH struggled to gain strength for a move above $1,950. A high was formed near $1,943 and the price reacted to the downside. There was a break below the $1,900 support zone. A new weekly low is formed near $1,875 and the price is now attempting a fresh increase. It broke the $1,890 and $1,900 levels. There was a move above the 50% Fib retracement level recent decline from the $1,943 swing high to the $1,875 low. Ether is now trading below $1,930 and the 100-hourly Simple Moving Average. On the upside, immediate resistance is near the $1,910 level. There is also a connecting bearish trend line forming with resistance near $1,910 on the hourly chart of ETH/USD. The trend line is near the 61.8% Fib retracement level recent decline from the $1,943 swing high to the $1,875 low. Source: ETHUSD on TradingView.com The first major resistance is near the $1,950 zone, above which the price could rise toward the $1,985 resistance zone. The next major resistance is near the $2,030 level. Any more gains could send Ether toward the $2,120 resistance or even $2,200. More Losses in ETH? If Ethereum fails to clear the $1,910 resistance, it could start a fresh decline. Initial support on the downside is near the $1,890 level. The first major support is near the $1,875 level, below which the price could extend its decline. The next major support is near the $1,825 support level. Any more losses could send Ether toward the $1,780 support level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,875 Major Resistance Level – $1,910"
  }
]