[
  {
    "source": "Decrypt",
    "date": "2023-09-01T14:58:23.000Z",
    "title": "Cambridge Updates Bitcoin Mining Index to Reveal True Power Consumption",
    "url": "https://decrypt.co/154593/cambridge-updates-bitcoin-mining-index-reveal-true-power-consumption",
    "description": "Experts say there’s still room for improvement, but that Cambridge’s new model is a big step forward."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-01T15:00:18.000Z",
    "title": "Robinhood strikes deal with U.S. Marshal Service to buy back Sam Bankman-Fried’s seized shares",
    "url": "https://cryptoslate.com/robinhood-strikes-deal-with-u-s-marshal-service-to-buy-back-sam-bankman-frieds-seized-shares/",
    "description": "<p>Robinhood&#8216;s proposed deal to repurchase shares seized from Sam Bankman-Fried by the U.S. Marshal Service (USMS) has been approved by a federal court in the Southern District of New York. As a result, Robinhood will be allowed to buy back shares seized from Bankman-Fried&#8217;s Emergent Fidelity Technologies for $605.7 million, according to a statement released [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/robinhood-strikes-deal-with-u-s-marshal-service-to-buy-back-sam-bankman-frieds-seized-shares/\">Robinhood strikes deal with U.S. Marshal Service to buy back Sam Bankman-Fried&#8217;s seized shares</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-01T15:06:54.000Z",
    "title": "Robinhood repurchases $605 million worth of shares from Sam Bankman-Fried’s Emergent Fidelity Technologies",
    "url": "https://www.cryptopolitan.com/robinhood-repurchases-605-million-worth-of-shares-emergent-fidelity-technologies/",
    "description": "Robinhood has successfully repurchased $605 million worth of its shares from Sam Bankman-Fried&#8217;s Emergent Fidelity Technologies. The share repurchase agreement received approval from the U.S. District Court for the Southern District of New York on August 28, according to a filing with the U.S. Securities and Exchange Commission (SEC) dated August 30. The share buyback ... <a title=\"Robinhood repurchases $605 million worth of shares from Sam Bankman-Fried&#8217;s Emergent Fidelity Technologies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/robinhood-repurchases-605-million-worth-of-shares-emergent-fidelity-technologies/\" aria-label=\"More on Robinhood repurchases $605 million worth of shares from Sam Bankman-Fried&#8217;s Emergent Fidelity Technologies\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-01T15:02:12.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-01T15:00:48.000Z",
    "title": "Bitcoin Plunges To $26,000 As Miners Sell Big",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-plunges-to-26000-as-miners-sell-big/",
    "description": "Bitcoin has plunged towards the $26,000 level as on-chain data shows the Bitcoin mines have been participating in a selloff. Bitcoin Miner To Exchange Flow Has Spiked During The Past Day As pointed out by an analyst in a CryptoQuant post, the miners have been showing signs of selling recently. The relevant indicator here is the &#8220;miner to exchange flow,&#8221; which keeps track of the total amount of Bitcoin that miners are depositing to exchanges. Generally, these chain validators only make such transactions when they intend to sell, so the indicator&#8217;s value observing a spike can be a sign of a selloff. The below chart shows the trend in the 7-day moving average (MA) BTC miner to exchange flow over the past couple of weeks: Looks like the 7-day MA value of the metric has been quite high in recent days &#124; Source: CryptoQuant As displayed in the graph, the 7-day MA Bitcoin miner to exchange flow has seen a huge spike during the past day. The quant has also highlighted the previous instances of high values of the indicator that occurred in the past two weeks. Related Reading: Bitcoin Sentiment Returns To Neutral, Will Traders Embrace Greed Next? It would appear that the BTC price has generally registered a drawdown whenever the miners make large deposits to these platforms. With the latest spike in the metric, too, the cryptocurrency has taken a plunge, as its price has now returned back to the $26,000 level, completely erasing the recovery that the Grayscale rally had brought. It&#8217;s never a certainty that the deposits that these holders are making are indeed for selling, but given the timing of the price drawdown, it would appear likely that the miners were looking to sell after all. In the chart, the analyst has also attached the data for a few more metrics. First, there are the &#8220;miner inflow&#8221; and &#8220;miner outflow&#8221; indicators, which, as their name suggests, measure the amount of Bitcoin that the miners are transferring into and out of their wallets, respectively. Related Reading: Ethereum Traders Capitulate As Rally Slows Down: Why This Is Good From the graph, it&#8217;s visible that the BTC miner outflow spiked during the crash, which makes sense as the miners had made some transfers from their wallets toward exchanges. The miner inflow, however, had also registered high values at the same time, meaning that fresh coins had entered back into the wallets of these chain validators. This would suggest that some of the miners may have used the opportunity of the crash to expand their holdings. The &#8220;miner reserve,&#8221; the other metric of interest here, measures the total amount of Bitcoin that this cohort is carrying in its wallets right now and this indicator&#8217;s data would confirm that the holdings of the miners have actually gone up during the price drop. So, while some Bitcoin miners may have contributed to the selling pressure, others have more than made up for it by accumulating more of the cryptocurrency. BTC Price As mentioned before, Bitcoin has now seen a complete retrace of the returns from the latest rally, bringing the asset back to the $26,000 level it had previously been consolidating at. BTC has gone down during the past day &#124; Source: BTCUSD on TradingView Featured image from Becca on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-01T15:06:40.000Z",
    "title": "Polkadot’s DePIN: Earning Rewards While Improving Traffic Data",
    "url": "https://www.crypto-news-flash.com/polkadots-depin-earning-rewards-while-improving-traffic-data/",
    "description": "<img width=\"1200\" height=\"600\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/Polkadot-1200x600-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/Polkadot-1200x600-1.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/Polkadot-1200x600-1-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/Polkadot-1200x600-1-1024x512.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/Polkadot-1200x600-1-768x384.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Promising Layer-1 platform Peaq, currently connected to Polkadot, is on a mission to transform the mobility industry.  2blox is collaborating with peaq to innovate crowd-sourcing mobility data.  Peaq, a layer-1 platform connected to the Polkadot network is on a mission to the backbone for the Economy of Things (EoT) and the DePINs and dApps that [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-01T15:00:34.000Z",
    "title": "This New Kava (KAVA) Challenger Promises to Reward Early Investors With An Easy 100x ROI",
    "url": "https://www.crypto-news-flash.com/this-new-kava-kava-challenger-promises-to-reward-early-investors-with-an-easy-100x-roi/",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-4.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-4-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-4-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />This KAVA rival, Anarchy (ANA), has been giving investors hope with its price potential, as experts believe the token can deliver 100x profits this year. Clearly, Kava (KAVA) is thinking along the same lines, as the KAVA token price has picked up over the past two months. The KAVA price prediction is looking good, but [...]"
  }
]