[
  {
    "source": "CryptoSlate",
    "date": "2023-07-31T23:00:54.000Z",
    "title": "German privacy watchdog has been investigating Worldcoin since November 2022",
    "url": "https://cryptoslate.com/german-privacy-watchdog-has-been-investigating-worldcoin-since-november-2022/",
    "description": "<p>One of Germany&#8217;s top privacy regulators began investigating Worldcoin&#8217;s data collection practices in November 2022, and the probe is still ongoing, Reuters reported on July 31. The Bavarian State Office for Data Protection Supervision President Michael Will told the newswire that the regulator had concerns over the project&#8217;s aim to process &#8220;sensitive data at a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/german-privacy-watchdog-has-been-investigating-worldcoin-since-november-2022/\">German privacy watchdog has been investigating Worldcoin since November 2022</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-31T22:48:00.000Z",
    "title": "Crypto Influencer Reveals Surge in $XRP Accounts Amid Debate on Data Authenticity",
    "url": "https://www.cryptoglobe.com/latest/2023/07/crypto-influencer-reveals-surge-in-xrp-accounts-amid-debate-on-data-authenticity/",
    "description": "A popular XRP influencer, Lewis Jackson, has recently announced a significant upswing in the creation of $XRP accounts, saying that the e number of accounts associated with the XRP token exceeded 3.2 million by July 25, 2023. With daily averages suggesting an influx of around 1,166 new accounts, the numbers suggest significant interest for the […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-31T23:00:31.000Z",
    "title": "Explore El Salvador: Gofaizen & Sherle Launches New Crypto License Service",
    "url": "https://news.bitcoin.com/explore-el-salvador-gofaizen-sherle-launches-new-crypto-license-service/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-1-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-1-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-1-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-1-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-1-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-1-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-1-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-1.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Tallinn, July 31 &#8211; Gofaizen and Sherle, the leading Estonian crypto and fintech consultancy, proudly announces the launch of its latest product in El Salvador. The innovative service offers crypto companies and startup owners worldwide a comprehensive and streamlined solution for obtaining a crypto license in El Salvador. The newly introduced service features [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T23:07:36.000Z",
    "title": "Does AI Endanger White-Collar Jobs? Yes, Says a Recent Pew Study",
    "url": "https://www.cryptopolitan.com/ai-endanger-white-collar-jobs-pew-study/",
    "description": "Artificial Intelligence (AI) is rapidly advancing and has the potential to revolutionize the job market, raising concerns about its impact on the American workforce and in particular, white-collar jobs. According to a Pew Research Center study, approximately 1 in 5 American workers have jobs with &#8220;high exposure&#8221; to AI, with uncertain consequences for their employment ... <a title=\"Does AI Endanger White-Collar Jobs? Yes, Says a Recent Pew Study\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-endanger-white-collar-jobs-pew-study/\" aria-label=\"More on Does AI Endanger White-Collar Jobs? Yes, Says a Recent Pew Study\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T22:54:41.000Z",
    "title": "Filecoin Price Prediction 2023-2032: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2023-2032 How much is Filecoin (FIL) worth? Today&#8217;s Filecoin price is $4.24 USD, with a 24-hour trading volume of $101,148,403. Filecoin is down 0.66% in the last 24 hours. The current CoinMarketCap ranking is #30, with a live market cap of $1,931,939,927. It has a circulating supply of 438,146,575 FIL coins, and ... <a title=\"Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/filecoin-price-prediction/\" aria-label=\"More on Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-31T23:00:45.000Z",
    "title": "Litecoin Sharks Buy More Than 200,000 LTC Ahead Of Wednesday’s Halving",
    "url": "https://www.newsbtc.com/analysis/ltc/litecoin-sharks-buy-more-200000-ltc/",
    "description": "Over the last few months, Litecoin has emerged as one of the top trending cryptocurrencies due to its halving event happening in August. As this event drew closer, crypto investors began filling up their LTC bags in preparation for what is expected to be a very bullish event. And now, with less than two days left to go before the halving, sharks have made remarkable moves to position themselves for possible upside. Litecoin Sharks Load Up Their Bags A report shared by the on-chain tracking platform Santiment revealed how Litecoin investors are currently looking at the digital asset. The chart showed an impressive accumulation trend from dolphin and shark wallets, which have increased their holdings significantly in the last month. Related Reading: Dogecoin Falls While Others Rally, Is It Decoupling From The Market? Santiment’s report shows that these wallets holding between $9,500 and $950,000 worth of LTC have added over 200,00 coins to their balances since June 14. On this date, the total holdings of these wallets were sitting just slightly below 18 million. However, in the next two weeks, their balances grew above 18.1 million coins. LTC sharks and dolphins buy over 200,000 coins &#124; Source: Santiment There has also been a semi-constant uptrend among these investors. Although there were dips here and there in their holdings, they remained committed to the accumulation over this last two weeks, each time buying more coins than they sold. What Is Driving The LTC Accumulation? The current accumulation from the dolphin and shark wallets are not isolated and just like the whale acquisitions, they are being driven by the same thing. The Litecoin halving is expected to take place on Wednesday and since this event has been historically bullish, it has triggered active participation from investors looking to capitalize on it. If the LTC halving plays out as expected, then it is possible that the price of the altcoin will climb above $100 once more. This would put the majority of the LTC accumulated by the dolphin and shark addresses over the last two weeks back in profit territory. Related Reading: Cardano (ADA) Price Remains Muted Despite Significant Milestones, Why? However, the days leading up to the event haven’t been as bullish as expected. Even though LTC’s price is still trading above $90, it has seen only single-digit daily gains over this time. Naturally, with less than two days to go, there should have already been some rapid increases for the cryptocurrency but there has been none. This current trend suggests that the halving may already be priced into LTC’s price, especially given the fact that the crypto bear market has continued. At the time of writing, LTC is changing hands at a price of $93.80, down 0.98%, according to data from Coinmarketcap. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]