[
  {
    "source": "CoinDesk",
    "date": "2023-09-19T21:49:18.000Z",
    "title": "Crypto Custodian Prime Trust Warns It May Lay Off 62 Employees, Nevada Records Show",
    "url": "https://www.coindesk.com/business/2023/09/19/crypto-custodian-prime-trust-warns-it-may-lay-off-62-employees-nevada-records-show/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The company filed for bankruptcy in August."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-19T22:00:50.000Z",
    "title": "Microbt Plans to Launch Next-Gen Bitcoin Mining Machine With 1X Efficiency Rating",
    "url": "https://news.bitcoin.com/microbt-plans-to-launch-next-gen-bitcoin-mining-machine-with-1x-efficiency-rating/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/hashshhdjjdfkk-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/hashshhdjjdfkk-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/hashshhdjjdfkk-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/hashshhdjjdfkk-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/hashshhdjjdfkk-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/hashshhdjjdfkk-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/hashshhdjjdfkk-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/hashshhdjjdfkk.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On September 19, 2023, Microbt, the manufacturer of bitcoin (BTC) application-specific integrated circuit (ASIC) mining rigs, revealed its intentions to introduce an innovative mining machine with an efficiency rating of 1X joules per terahash (J/T). This announcement from Microbt closely follows Canaan&#x2019;s recent release of the A1466I, which also claims an efficiency rating of 1X [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-19T21:45:31.000Z",
    "title": "OKX joins forces with Solana Mobile to integrate app on Saga Web3 smartphone",
    "url": "https://www.cryptopolitan.com/okx-joins-forces-with-solana-mobile-to-integrate-app-on-saga-web3-smartphone/",
    "description": "Crypto exchange OKX has announced a strategic partnership with Solana Mobile. The collaboration will see OKX&#8217;s app become one of the first exchange applications available on Solana&#8217;s Web3 smartphone, Saga. Unlocking the web3 ecosystem for everyday users The partnership aims to provide Saga users with seamless access to OKX&#8217;s suite of next-generation products, thereby expanding ... <a title=\"OKX joins forces with Solana Mobile to integrate app on Saga Web3 smartphone\" class=\"read-more\" href=\"https://www.cryptopolitan.com/okx-joins-forces-with-solana-mobile-to-integrate-app-on-saga-web3-smartphone/\" aria-label=\"More on OKX joins forces with Solana Mobile to integrate app on Saga Web3 smartphone\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-19T22:00:41.000Z",
    "title": "Stellar To Release Protocol 20 Testnet Upgrade, Will XLM Rally?",
    "url": "https://www.newsbtc.com/news/stellar/stellar-to-release-protocol-20-testnet-upgrade-will-xlm-rally/",
    "description": "On September 20, Stellar, a blockchain platform designed to facilitate fast and low-cost cross-border transactions using its native currency, XLM, will release the testnet upgrade of Protocol 20. With this launch, the protocol prepares for the eventual mainnet activation of the Soroban smart contracts platform. Stellar Prepares For Protocol 20 And Smart Contracts According to a document on September 18, the testnet upgrade aims to release candidate versions of Stellar Core and Horizon. Stellar is a blockchain network and relies on a network of nodes for transaction validation and to ensure the network is secure. Validators running are kept in sync using the Stellar Core since it acts as the backbone of the entire network, safeguarding the integrity of the blockchain.  Related Reading: Arbitrum: What’s In Store For ARB Token After Unlock? Stellar Horizon is an interface that simplifies interaction between applications and developers with the mainnet through APIs. By eliminating the complexities of interacting with the blockchain, Horizon makes it easier for users to deploy applications.  Once the stable version is released, Validators will vote on the day when tested upgrades are integrated into the mainnet. The blockchain developer has acknowledged that the Protocol 20 upgrade will bring about new settings, which will require more discussion and adjustments through voting. The Stellar Network will provide a timeline for implementing these changes before rolling them out on the mainnet. Soroban And The $100 Million Incentive Stellar describes Soroban as a smart contracts platform designed for “scale and sensibility” and “integrates with and works alongside the existing Stellar blockchain.” The portal is currently being tested in Stellar’s testnet, Futurenet.  Stellar claims that some of the network’s core features, such as multi-core scaling and an optimized fee model, make their smart contracts superior since all the “pesky serialization loops” have been eliminated. Unlike Ethereum layer-2 platforms like Arbitrum or Polygon, which operate separately, Soroban will fully integrate with Stellar and remain open source.  Related Reading: XEC Token Spikes Over 17% In The Last Week, Can It Sustain Rally? The Stellar Development Foundation rolled out a $100 million Adoption Fund to incentivize Soroban adoption. This program, they explained, is an “umbrella for many programs that support all levels of Soroban adoption, some of which have launched and some of which have yet to launch.” XLM prices are firm and have been one of the top-performing assets in the past three months. To illustrate, the coin surged from $0.08 in June and more than doubled, reaching $0.18 in late July. However, the coin has since retraced, dumping by around 40%. However, the uptrend remains looking at the candlestick arrangement in the daily chart. Whether this upgrade will support XLM is yet to be determined. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-19T22:01:22.000Z",
    "title": "Parents of Sam Bankman-Fried Sued by FTX Estate Over Allegedly Siphoning Funds From Crypto Exchange: Report",
    "url": "https://dailyhodl.com/2023/09/19/parents-of-sam-bankman-fried-sued-by-ftx-estate-over-allegedly-siphoning-funds-from-crypto-exchange-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/ints-very-clear-ftx.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/ints-very-clear-ftx.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/ints-very-clear-ftx.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/ints-very-clear-ftx.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/ints-very-clear-ftx.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/ints-very-clear-ftx.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/ints-very-clear-ftx.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The parental guardians of former FTX CEO Sam Bankman-Fried are reportedly being sued by the crypto exchange&#8217;s bankruptcy estate for allegedly misappropriating funds. According to a new article from the Financial Times, Joseph Bankman and Barbara Fried are being sued by the FTX estate over allegedly siphoning funds from the now-bankrupt exchange. Says prosecutors, &#8220;As early [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/19/parents-of-sam-bankman-fried-sued-by-ftx-estate-over-allegedly-siphoning-funds-from-crypto-exchange-report/\">Parents of Sam Bankman-Fried Sued by FTX Estate Over Allegedly Siphoning Funds From Crypto Exchange: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]