[
  {
    "source": "CoinDesk",
    "date": "2023-06-28T07:53:08.000Z",
    "title": "‘End the Extortion:’ BlockFi Creditors File to Liquidate Estate",
    "url": "https://www.coindesk.com/policy/2023/06/28/end-the-extortion-blockfi-creditors-file-to-liquidate-estate/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Creditors accuse CEO Zac Prince of defrauding customers and the company of “mischief” in delaying a wind-up."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-28T07:50:00.000Z",
    "title": "Sony Network Communications Invests $3.5M in Singapore Web3 Company Startale Labs",
    "url": "https://www.coindesk.com/web3/2023/06/28/sony-network-communications-invests-35-million-in-singapore-web3-company-startale-labs/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Sony previously worked with Startale Labs to organize a web3 incubator."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-28T07:50:00.000Z",
    "title": "Sony Network invests in Japanese Web3 startup to spur mass adoption",
    "url": "https://cointelegraph.com/news/sony-invests-in-japanese-web3-startup",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/0a91aa39-ebc0-40ae-b9b4-56590deb1426.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The deal includes an investment of $3.5 million, a Sony executive moving to Startale Labs and collaboration on new Web3 tools for mass adoption.  </p>\n                    <p><p>Sony continues to make its mark in the emerging technologies space with its recent announcement of a new investment in building a global infrastructure to support Web3. </p><p>On June 28, Sony Network Communications — a subsidiary of Sony — and Japanese Web3 infrastructure tech company Startale Labs revealed a new business collaboration and a $3.5 million investment to build a foundation for the widespread adoption of Web3. </p><p>The partnership will push Startale’s development of Web3 services and products, including its mission to create all-in-one solutions for Web3 development and focus on bridging real-world assets with the Web3 ecosystem.</p><p>Sota Watanabe, the CEO of Startale Labs, told Cointelegraph that partnering with Sony allows a new Web3 startup like itself to “learn and leverage” many things. Commenting on its all-in-one solution, he said:</p><blockquote>“Developers and users need to understand blockchain tech stacks when interacting with Web3. We want to provide smooth experiences for general users and this tool will allow them to interact with the space without knowing it.”</blockquote><p>Along with the investment, the president and representative director for Sony Network Communications, Jun Watanabe, was appointed as director of Startale Labs. Previously the two companies successfully co-hosted a Web3 Incubation Program.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/japanese-and-singaporean-regulators-join-forces-on-crypto-pilot-project\"><strong><em>Japanese and Singaporean regulators join forces on crypto pilot project</em></strong></a></p><p>Watanabe is also the co-founder of the Astar Network, a parachain operating on the Polkadot ecosystem, of which Startale Labs has been a part of the core team. Astar recently launched <a href=\"https://cointelegraph.com/news/astar-network-to-launch-smart-contracts-that-support-two-virtual-machines\">smart contracts supporting two virtual machines</a> which allowed the creation of WASM or EVM projects within the network.</p><p>Sony Network Communications is known as a powerful provider of fiber optic internet services. However, other domains and branches of the Sony company have been involved in other Web3 initiatives including nonfungible tokens (NFTs). </p><p>In March of 2023, Sony Interactive Entertainment, the video game giant behind the PlayStation brand, filed a patent that will allow <a href=\"https://cointelegraph.com/news/sony-eyes-nft-transfers-across-multiple-game-platforms-reveals-patent\">users to transfer and use NFTs</a> across multiple gaming platforms. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/biticulture-fine-art-on-solana-ai-music-podcast-book-reviews/\"><strong><em>BitCulture: Fine art on Solana, AI music, podcast + book reviews</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-28T08:00:59.000Z",
    "title": "FTX pauses sale of stake in AI firm Anthropic, once purchased for $500m",
    "url": "https://cryptoslate.com/ftx-pauses-sale-of-stake-in-ai-firm-anthropic-once-purchased-for-500m/",
    "description": "<p>FTX has suspended a planned sale of its stake in the artificial intelligence firm Anthropic, according to a Bloomberg report on June 27. The sale could have raised &#8220;nine figures&#8221; FTX&#8217;s stake in Anthropic was expected to sell for &#8220;nine figures,&#8221; based on secondary reports cited by Bloomberg. FTX and Alameda invested $500 million in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ftx-pauses-sale-of-stake-in-ai-firm-anthropic-once-purchased-for-500m/\">FTX pauses sale of stake in AI firm Anthropic, once purchased for $500m</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-28T07:52:00.000Z",
    "title": "Fidelity Takes On BlackRock, Readies Its Own Bitcoin ETF Filing",
    "url": "https://cryptodaily.co.uk/2023/06/fidelity-takes-on-blackrock-readies-its-own-bitcoin-etf-filing",
    "description": "<p>Major asset manager Fidelity is preparing to submit its own application for a spot bitcoin exchange-traded fund (ETF), joining other big money asset managers such as BlackRock.&nbsp;</p>\n<p>BlackRock had recently submitted its own spot bitcoin exchange-traded fund on the 15th of June, sparking considerable interest from other asset managers.&nbsp;</p>\nFidelity Preparing Bitcoin ETF Filing As Race Heats Up&nbsp;\n<p>With its spot bitcoin exchange-traded fund, Fidelity will join a growing list of institutions that are competing to be the first to introduce and get approval for a spot bitcoin exchange-traded fund. The filing sees Fidelity follow BlackRock, the world&rsquo;s largest asset manager, in filing for an ETF. According to reports, Fidelity&rsquo;s application could be filed as soon as this week and would be Fidelity&rsquo;s second attempt at launching a spot bitcoin ETF. Fidelity also filed an application in 2022 but failed to get approval from the United States Securities and Exchange Commission (SEC).&nbsp;</p>\n<p>Over the past couple of weeks, several asset managers, such as Invesco (IVS.N), WisdomTree (WT.N), Bitwise, VacEck, and the already mentioned BlackRock, have filed applications with the Securities and Exchange Commission for a spot Bitcoin ETF. As a result of the applications, the price of Bitcoin (BTC) has also seen a considerable increase, rising to a one-year high of over $31,000 on the 23rd of June.&nbsp;</p>\n<p>Fidelity is a prominent player in the financial space, with over $11 trillion in assets under management. Additionally, it has been involved with the crypto ecosystem since 2018, operating trading and institutional custody services. It has also offered fund products to its European clientele since February 2022 through Fidelity International.</p>\nA Game-Changing Development&nbsp;\n<p>According to market experts, the potential launch of a spot bitcoin exchange-traded fund could be a game-changing development, giving investors exposure to the crypto market without requiring them to acquire or hold the underlying asset. BlackRock&rsquo;s filing for an ETF has aroused considerable interest in bitcoin ETFs once again, given the firm&rsquo;s significance, size, and standing. According to senior market analyst at Oanda, Edward Moya, there is considerable optimism in the markets at present.&nbsp;</p>\n\n<p>&ldquo;There&rsquo;s a lot of optimism here that you&rsquo;re going to get a bitcoin ETF. If that does get done, it could open the door for much more institutional money and probably some high-net-worth retail traders to get back into crypto.&rdquo;</p>\n\nWill The SEC Change Its Stance?&nbsp;\n<p>The Securities and Exchange Commission has allowed Futures-based bitcoin ETFs since October 2021. These track the price of bitcoin futures contracts. However, when it comes to spot bitcoin ETFs, the Securities and Exchange Commission has rejected several applications. Spot bitcoin ETFs are publicly traded investment vehicles that track the price of Bitcoin, stating that it had concerns that the underlying markets could be manipulated.&nbsp;</p>\n<p>However, many feel that BlackRock applying for a spot bitcoin ETF could be a game changer because the asset manager files for ETFs only when it knows it can get them approved. The filing has also helped to reverse the negative perception of Bitcoin and the larger cryptocurrency markets to some degree. According to Alex Adelman from the crypto rewards fund Lolli, the recent spot ETF filings could act as a vote of confidence for the larger crypto ecosystem.&nbsp;</p>\n\n<p>&ldquo;Institutions like BlackRock and Fidelity provide the expertise and custodial services top retailers rely on to serve global consumers.&rdquo;</p>\n\n<p>The crypto markets have been rattled by a series of adverse events and shutdowns, the most prominent being the collapse of FTX, which authorities alleged was running a multi-billion dollar fraud. More recently, the Securities and Exchange Commission sued Binance and Coinbase, alleging that both violated several rules, an accusation both entities deny.&nbsp;</p>\n<p>The SEC itself has come under legal troubles, with Grayscale Investments suing the regulator over its rejection of Grayscale&rsquo;s application to convert its flagship Grayscale Bitcoin Trust into an ETF. The case hinges on the fact that the Securities and Exchange Commission having previously approved certain surveillance agreements to prevent fraud in bitcoin futures-based ETFs. Grayscale has argued that the same should apply to its spot fund.&nbsp;</p>\nBlackRock&rsquo;s Filing&nbsp;\n<p>BlackRock filed its spot bitcoin ETF application on the 15th of June, 2023. According to the filing by the Nasdaq stock exchange with the Securities and Exchange Commission, Coinbase Custody Trust Company will be the custodian of the fund&rsquo;s Bitcoin holdings, while the Bank of New York Mellon will be the custodian of the fund&rsquo;s fiat currency. If approved, BlackRock&rsquo;s ETF will be the first crypto spot ETF in the United States of America.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-28T08:00:16.000Z",
    "title": "Shanghai Clearing House Introduces Support for Digital Yuan Settlements",
    "url": "https://news.bitcoin.com/shanghai-clearing-house-introduces-support-for-digital-yuan-settlements/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2160379567-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Shanghai Clearing House Introduces Support for Digital Yuan Settlements\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2160379567-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2160379567-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2160379567-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2160379567-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2160379567-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2160379567-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2160379567.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Shanghai Clearing House, Asia&#8217;s first counterparty clearing institution, announced support for payments made with the digital yuan Monday. According to reports, the move will allow companies to settle transactions for commodities in bulk, promoting the digital yuan, the Chinese central bank digital currency (CBDC), in international markets. Shanghai Clearing House to Support Digital Yuan [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T08:04:35.000Z",
    "title": "The integration of virtual reality technology in online crypto casinos",
    "url": "https://www.cryptopolitan.com/the-integration-of-virtual-reality-technology-in-online-crypto-casinos/",
    "description": "As technological advancements continue to reshape the crypto gambling industry, the incorporation of virtual reality technology introduces a whole new level of immersion and excitement. By blending the virtual and real worlds, VR offers an unparalleled gambling experience that transports players into stunning 3D environments, replicating the atmosphere and ambiance of physical casinos. With its ... <a title=\"The integration of virtual reality technology in online crypto casinos\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-integration-of-virtual-reality-technology-in-online-crypto-casinos/\" aria-label=\"More on The integration of virtual reality technology in online crypto casinos\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T08:00:00.000Z",
    "title": "DigiToads (TOADS) and MetaBlaze ($MBLZ) announce their NFT Drops after Gaining Attention with Huge Blockbuster Presales",
    "url": "https://www.cryptopolitan.com/digitoads-toads-and-metablaze-mblz-announce-their-nft-drops-after-gaining-attention-with-huge-blockbuster-presales/",
    "description": "Non-fungible tokens (NFTs) have emerged as the latest trend, capturing the imagination of both investors and collectors in this dynamic cryptocurrency world. DigiToads (TOADS) and MetaBlaze (MBLZ) are at the forefront of this digital revolution. These two projects recently announced their highly anticipated NFT drops. With their blockbuster presale performances, these projects have garnered significant ... <a title=\"DigiToads (TOADS) and MetaBlaze ($MBLZ) announce their NFT Drops after Gaining Attention with Huge Blockbuster Presales\" class=\"read-more\" href=\"https://www.cryptopolitan.com/digitoads-toads-and-metablaze-mblz-announce-their-nft-drops-after-gaining-attention-with-huge-blockbuster-presales/\" aria-label=\"More on DigiToads (TOADS) and MetaBlaze ($MBLZ) announce their NFT Drops after Gaining Attention with Huge Blockbuster Presales\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T07:56:12.000Z",
    "title": "Bitcoin’s Rise Fuels Excitement for Pepe Coin and Caged Beasts Coin",
    "url": "https://www.cryptopolitan.com/bitcoins-rise-fuels-excitement-for-pepe-coin-and-caged-beasts-coin/",
    "description": "Bitcoin, the leading cryptocurrency, has recently reached an impressive 1-year peak, capturing the attention of investors and enthusiasts worldwide. This surge in Bitcoin&#8217;s value has also ignited excitement around other digital assets, particularly meme coins like Caged Beasts Coin (BEASTS) and Pepe Coin.&#160; In this analysis, we will delve into the similarities and differences between ... <a title=\"Bitcoin&#8217;s Rise Fuels Excitement for Pepe Coin and Caged Beasts Coin\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoins-rise-fuels-excitement-for-pepe-coin-and-caged-beasts-coin/\" aria-label=\"More on Bitcoin&#8217;s Rise Fuels Excitement for Pepe Coin and Caged Beasts Coin\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T07:43:38.000Z",
    "title": "ApeCoin & Kava Lag But Uwerx Presale Takes The Lead",
    "url": "https://www.cryptopolitan.com/apecoin-kava-lag-but-uwerx-presale-takes-the-lead/",
    "description": "Uwerx stands out amidst the competitive crypto market, leaving ApeCoin (APE) and Kava (KAVA) in its wake. With its visionary approach, blockchain infrastructure, and focus on empowering freelancers, Uwerx has become a magnet for investors and crypto enthusiasts seeking innovative opportunities. This article will explore the remarkable journey of Uwerx, highlighting its key features, presale ... <a title=\"ApeCoin &#38; Kava Lag But Uwerx Presale Takes The Lead\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-kava-lag-but-uwerx-presale-takes-the-lead/\" aria-label=\"More on ApeCoin &#38; Kava Lag But Uwerx Presale Takes The Lead\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-28T08:00:42.000Z",
    "title": "UK Law Commission Wants The Crypto And Blockchain Tech To Thrive",
    "url": "https://nulltx.com/uk-law-commission-wants-the-crypto-and-blockchain-tech-to-thrive/",
    "description": "The UK Law Commission has emphasized the importance of developing laws to regulate crypto assets in order to establish the country as a global center for cryptocurrencies and non-fungible tokens (NFTs). In their statement released on Wednesday, June 28, the independent panel highlighted that these long-awaited recommendations aim to create a comprehensive legal framework for [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T08:02:08.000Z",
    "title": "Software Giant SAP Unveils Stellar-Based ‘Digital Currency Hub’ Pilot for Cross-Border Payments System Using USDC",
    "url": "https://www.crypto-news-flash.com/software-giant-sap-unveils-stellar-based-digital-currency-hub-pilot-for-cross-border-payments-system-using-usdc/?utm_source=rss&utm_medium=rss&utm_campaign=software-giant-sap-unveils-stellar-based-digital-currency-hub-pilot-for-cross-border-payments-system-using-usdc",
    "description": "SAP says that customers now have the opportunity to experience receiving USDC, a cryptocurrency operating on the Ethereum network. USDC is the fifth-largest digital asset, boasting a market capitalization of $28.3 billion.  SAP, the prominent software giant from Germany, has recently revealed its utilization of the U.S. Dollar Coin (USDC) for conducting tests in cross-border [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T08:01:09.000Z",
    "title": "Polygon Powers Razer’s zVentures Web3 Incubator: Revolutionizing Blockchain Gaming Development",
    "url": "https://www.crypto-news-flash.com/polygon-powers-razers-zventures-web3-incubator-revolutionizing-blockchain-gaming-development/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-powers-razers-zventures-web3-incubator-revolutionizing-blockchain-gaming-development",
    "description": "Razer&#8217;s zVentures Web3 Incubator (ZW3I) collaborates with gaming studios to pioneer blockchain-based games. Projects like Shrapnel and Nyan Heroes showcase the innovative use of blockchain technology in gaming. Global gaming lifestyle brand Razer has embarked on a groundbreaking journey by launching the zVentures Web3 Incubator (ZW3I) with a mission to revolutionize the gaming industry. In [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T08:00:38.000Z",
    "title": "The Future is Here: Utilizing Cryptocurrency",
    "url": "https://www.crypto-news-flash.com/the-future-is-here-utilizing-cryptocurrency/?utm_source=rss&utm_medium=rss&utm_campaign=the-future-is-here-utilizing-cryptocurrency",
    "description": "Cryptocurrency is the future of money, and it’s already here. With its decentralized rates, cryptocurrency has been gaining more traction as a feasible form of payment in current years. Not only does it offer a safe way to transact virtually without utilizing traditional banking methods, but it also presents participants with unparalleled control over their [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T08:00:12.000Z",
    "title": "Despite Bearish Market Conditions, InQubeta (QUBE) and Polygon (MATIC) Attract A Massive Afflux of New Investors",
    "url": "https://www.crypto-news-flash.com/despite-bearish-market-conditions-inqubeta-qube-and-polygon-matic-attract-a-massive-afflux-of-new-investors/?utm_source=rss&utm_medium=rss&utm_campaign=despite-bearish-market-conditions-inqubeta-qube-and-polygon-matic-attract-a-massive-afflux-of-new-investors",
    "description": "The cryptocurrency market has recently experienced a significant downturn due to regulatory concerns and negative market sentiment. Many coins have seen double-digit declines as investors seek safer options. However, amidst this bearish market, two tokens have attracted a massive influx of new investors: InQubeta (QUBE) and Polygon (MATIC).  These tokens present compelling opportunities for investors [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-28T07:50:00.000Z",
    "title": "Binance BNB Sheds Over $10 Billion This Month Amid Regulatory Pressure",
    "url": "https://coinedition.com/binance-bnb-sheds-over-10-billion-this-month-amid-regulatory-pressure/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance BNB Sheds Over $10 Billion\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Binance-BNB-Sheds-Over-10-Billion-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent development, Binance&#8217;s native crypto, BNB, has encountered a series of setbacks, shedding a staggering $10 billion market share since June 5. This steep decline can be attributed to the U.S. Securities and Exchange Commission&#8217;s (SEC) lawsuit against Binance, accusing the exchange of offering an unregistered security. Unfortunately, the regulatory troubles do not [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-bnb-sheds-over-10-billion-this-month-amid-regulatory-pressure/\">Binance BNB Sheds Over $10 Billion This Month Amid Regulatory Pressure</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]