[
  {
    "source": "CoinDesk",
    "date": "2023-12-07T16:55:02.000Z",
    "title": "Jack Dorsey's Block Bitkey Bitcoin Wallet Comes to Market in More Than 95 Countries",
    "url": "https://www.coindesk.com/tech/2023/12/07/jack-dorseys-block-bitkey-bitcoin-wallet-comes-to-market-in-more-than-95-countries/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Jack Dorsey's company's new self-custody wallet consists of an app, hardware device and recovery tools."
  },
  {
    "source": "CoinDesk",
    "date": "2023-12-07T16:45:00.000Z",
    "title": "Crypto for Advisors: On-Chain Investment Tools and Vehicles",
    "url": "https://www.coindesk.com/business/2023/12/07/crypto-for-advisors-onchain-investment-tools-and-vehicles/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "What are on-chain index products and how do they work? In today’s Crypto for Advisor newsletter Jordan Tonani from Index Coop takes us through the topic."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-07T17:01:08.000Z",
    "title": "Gamers Can Now Livestream to Twitter via Streamlabs",
    "url": "https://decrypt.co/208972/gamers-can-now-livestream-twitter-streamlabs",
    "description": "Streamlabs’ new X feature allows gamers to go live on Twitter from a phone or computer."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-07T17:01:00.000Z",
    "title": "Montenegro Set to Extradite Terra Co-Founder Do Kwon to US: Report",
    "url": "https://decrypt.co/208983/montenegro-extradite-terra-co-founder-do-kwon-us",
    "description": "The Terraform Labs co-founder has been caught in a jurisdictional tug-of-war between the U.S. and his native South Korea."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-12-07T16:49:16.000Z",
    "title": "Sui Joins DeFi Leaders, Topping $100M in Bridged USDC",
    "url": "https://www.cryptoglobe.com/latest/2023/12/sui-joins-defi-leaders-topping-100m-in-bridged-usdc/",
    "description": "GRAND CAYMAN, Cayman Islands, December 7th, 2023, Chainwire Only seven months from the network’s launch, Sui is bridging more USDC liquidity than multiple native chains. Sui, the groundbreaking Layer 1 blockchain created by the technology experts who led Meta’s Diem blockchain initiative and created the Move smart contract language, continues its explosive ascent in decentralized […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-07T16:50:48.000Z",
    "title": "Top 3 Altcoins You Need to Keep an Eye On for Major Gains",
    "url": "https://cryptodaily.co.uk/2023/12/top-3-altcoins-you-need-to-keep-an-eye-on-for-major-gains",
    "description": "Discover the top three altcoins poised for significant gains in the cryptocurrency market. Stay ahead of the curve with our expert analysis on these promising digital assets that should be on every investor's radar."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-07T16:43:34.000Z",
    "title": "WSJ: Montenegro mulling Do Kwon’s extradition to the U.S.",
    "url": "https://crypto.news/wsj-montenegro-mulls-do-kwons-extradition-to-the-u-s/",
    "description": "The Terraform Labs founder could be moved to the U.S. instead of South Korea to stand trial over a multi-billion ecosystem collapse involving LUNA and UST."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-07T17:00:19.000Z",
    "title": "Crypto Pundit Reveals Why Bitcoin Is Worth As Much As $17 Million",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-worth-17-million/",
    "description": "A crypto pundit and Bitcoin maximalist, Mark Harvey, has explained why he believes the foremost cryptocurrency Bitcoin, is far off from its true potential. According to him, the crypto token could be worth close to $17 million in the future.  Why One Bitcoin Could Worth $17 Million In a post shared on his X (formerly Twitter) platform, Harvey made a strong case for Bitcoin on why it could on why a price even greater than $17 million is likely. He referred to Bitcoin’s use case as a store of value and how it could further chop into the market share of other asset classes. He noted Bitcoin’s “tremendous upside” despite being a relative newcomer. Related Reading: Crypto Analyst Predicts Dogecoin Price Pump Of Epic Proportions To $0.7, Here’s When Bitcoin is said to have 0.1% of the $871 trillion which are invested in global assets. Other global assets that hold a substantial market share include gold and silver, bonds, equities, real estate, and fiat money. Harvey believes that Bitcoin’s price could rally significantly as the foremost cryptocurrency becomes the most preferred option for people to preserve their money. Source: X Harvey stated that the monetary premium of those global assets highlights how much they are used as a store of value. The crypto pundit asserts that Bitcoin has the potential to capture the monetary premiums of other asset classes, which would see its price rise to $17 million with a market cap of $356.7 trillion.  Source: X In his opinion, this is very likely because Bitcoin is a “superior form of property.” If it does happen, the crypto token could also end up capturing 41% of the $871 trillion in global assets. Harvey also provided a more probable scenario as to Bitcoin’s future price. He noted that the crypto token could still rise to as high as $415,000 per token if it captures 1% of global assets. Source: X Is BTC Superior To Other Asset Classes? Harvey labeled Bitcoin as a “superior form of property,” and there is evidence to back up this assertion. As highlighted by the Director of Global Macro at Fidelity Investments, Jurrien Timmer, Bitcoin stands out in comparison to other asset classes.  Related Reading: Bitcoin Pushes Into Extreme Greed, What You Should Expect From Here Source: Fidelity Investments According to data from Fidelity, the flagship cryptocurrency provided the best risk-reward with a 58% return from 2020 to this year. In terms of drawdowns and rallies, Bitcoin also stood out with an 84% gain from its 2-year low. Meanwhile, a recent report by Glassnode noted that Bitcoin continues to lead as one of the best-performing global assets, with a gain of over 140% year to date (YTD). Specifically, Bitcoin has more than doubled in relation to Gold.  BTC price remains above $43,000 &#124; Source: BTCUSD on Tradingview.com Featured image from Coin Culture, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-07T16:42:00.000Z",
    "title": "RATS Team Outlines Findings on Token’s Unusual Volume Spike on Gate.io",
    "url": "https://coinedition.com/rats-team-outlines-findings-on-tokens-unusual-volume-spike-on-gate-io/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/12/Gate.io-1-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The team behind BRC-20 memecoin RATS has shared their observations regarding a suspicious spike in the token’s trade volume on the crypto exchange Gate.io, which raised speculation and increased FUD around the project.   In a post shared on its official X page, the memecoin’s team alleges that many factors contributed to the spike on the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/rats-team-outlines-findings-on-tokens-unusual-volume-spike-on-gate-io/\">RATS Team Outlines Findings on Token’s Unusual Volume Spike on Gate.io</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]