[
  {
    "source": "Cointelegraph",
    "date": "2023-09-27T19:51:11.000Z",
    "title": "Bitcoin price holds steady as S&P 500 plunges to 110-day low",
    "url": "https://cointelegraph.com/news/bitcoin-price-holds-steady-as-s-p-500-plunges-to-110-day-low",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/fc307d25-4efc-4bee-b89e-7d35408df1d3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The S&P 500 dropped to a 110-day low as the market digests what “higher for longer” means for stocks. Will Bitcoin begin to chart its own path?</p>\n                    <p><p>On Sept. 20, the Federal Reserve delivered a message that reverberated through financial markets: interest rates are expected to remain at their highest level in over two decades, and possibly for longer than most market participants’ expectations. This attitude comes against the backdrop of stubbornly high inflation, with the core inflation rate hovering at 4.2%, well above the central bank's 2% target, and unemployment at record lows. </p><p>As investors grapple with this new reality, a pressing question arises: Will the S&amp;P 500 and Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) continue to underperform in the face of a tighter monetary policy?</p><p>The impact of the Fed's decision was swift and severe. The S&amp;P 500 plunged to its lowest level in 110 days, signaling growing unease among investors. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/cd4fb430-95da-442b-8268-bb3fd6fa2754.png\"  /><figcaption style=\"text-align: center;\"><em>S&amp;P 500 index (blue, right) vs. U.S. 10-year Treasury yield (orange, left)</em></figcaption></figure><p>Notably, the 10-year Treasury yield surged to levels not seen since October 2007. This movement reflects the market's belief that rates will continue to climb, or, at the very least, that inflation will eventually catch up with the current 4.55% yield. In either case, anxiety is mounting over the Fed's ability to sustain these elevated interest rates without destabilizing the economy.</p><h2>Bitcoin does not necessarily follow traditional markets</h2><p>One intriguing development amidst this financial turbulence is the apparent disconnect between the S&amp;P 500 and cryptocurrencies, particularly Bitcoin. Over the past five months, the 30-day correlation between the two assets presented no clear trend. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/5ece37eb-7bd2-4915-b5cc-975927684799.png\"  /><figcaption style=\"text-align: center;\"><em>30-day rolling correlation: S&amp;P 500 futures vs. Bitcoin/USD. Source: TradingView</em></figcaption></figure><p>Such divergence suggests that either Bitcoin has anticipated the stock market correction, or external factors are at play. One plausible explanation for this decoupling is the hype surrounding the possible introduction of a <a href=\"https://cointelegraph.com/news/sec-pushes-deadline-ark-21shares-spot-bitcoin-etf\">spot Bitcoin ETF</a> and <a href=\"https://cointelegraph.com/news/gensler-testimony-crypto-enforcement-actions-due-to-noncompliance\">regulatory concerns</a> that have hindered the upside potential of cryptocurrencies. Meanwhile, the S&amp;P 500 has benefited from robust 2nd-quarter earnings reports, though it's essential to remember that those numbers reflect the situation from 3 months prior.</p><p>As the Fed holds firm on its commitment to high-interest rates, the financial landscape is entering uncharted territory. While some may interpret the central bank's stance as necessary to combat inflationary pressures, others worry that keeping rates elevated could burden families and businesses, particularly as existing loans come due and must be refinanced at significantly higher rates.</p><h2>A decoupling could favor Bitcoin price </h2><p>Several factors could lead to the decoupling of cryptocurrencies from traditional markets, such as the S&amp;P 500. If the government encounters difficulties in issuing longer-term debt, it can raise concerns. The failure to issue long-term bonds may indicate fiscal instability, which incentivizes investors to seek hedges against potential economic downturns. In such cases, alternative assets like gold and Bitcoin might become attractive options.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-price-26k-monthly-3-billion-btc-options-expiry\">Will Bitcoin price hold $26K ahead of monthly $3B BTC options expiry?</a></em></strong></p><p>Even with a strong dollar, inflation can force the U.S Treasury to <a href=\"https://cointelegraph.com/news/bitcoin-investors-federal-reserve-100-billion-loss\">raise the debt limit </a>which leads to currency devaluation over time. This risk remains relevant as investors seek to safeguard their wealth in assets less susceptible to inflation. </p><p>Furthermore, the state of the housing market plays a pivotal role. Should the housing market continue to deteriorate, it could negatively impact the broader economy and the S&amp;P 500. The housing market's interconnectedness with the banking sector and the potential for consumer credit deterioration could trigger a flight to assets with scarcity and hedging capabilities.</p><p>There's also the potential for political instability, globally or even during the U.S. elections in 2024. This could introduce uncertainty and impact financial markets. In some countries there is a growing fear of capital controls and historical instances of international financial embargoes highlight the risk of governments imposing such controls, further driving investors towards cryptocurrencies.</p><p>Ultimately, unlike traditional stocks and bonds, cryptocurrencies are not tethered to corporate earnings, growth or yield above inflation. Instead, they march to their own drumbeat, influenced by factors like regulatory changes, resilience to attacks, and predictable monetary policy. Thus, Bitcoin could vastly outperform the S&amp;P 500 without the need of any of the scenarios discussed above.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-27T19:50:20.000Z",
    "title": "Terraform Labs’ defense team says extraditing Do Kwon to the U.S. for SEC testimony is ‘impossible’",
    "url": "https://cryptoslate.com/terraform-labs-defense-says-extraditing-do-kwon-to-the-u-s-for-sec-testimony-is-impossible/",
    "description": "<p>The legal defense for Terraform Labs submitted a court filing that aims to show that its former CEO, Do Kwon, cannot be extradited to the United States. In a Sept. 27 filing, the defense&#8217;s legal team noted that the U.S. Securities and Exchange Commission (SEC) intends to depose Kwon to the U.S. prior to Oct. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/terraform-labs-defense-says-extraditing-do-kwon-to-the-u-s-for-sec-testimony-is-impossible/\">Terraform Labs&#8217; defense team says extraditing Do Kwon to the U.S. for SEC testimony is &#8216;impossible&#8217;</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-09-27T20:03:06.000Z",
    "title": "Kraken to Launch Stock Trading in 2024: Bloomberg",
    "url": "https://cryptobriefing.com/kraken-launch-stock-trading-2024/?utm_source=feed&utm_medium=rss",
    "description": "Bloomberg reports Kraken plans to launch a stock trading service by 2024 through its new division Kraken Securities."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-27T19:51:26.000Z",
    "title": "Xsolla Announces Acquisition of AcceleratXR, A Multi-Player Platform For Games",
    "url": "https://cryptodaily.co.uk/2023/09/xsolla-announces-acquisition-of-acceleratxr-a-multi-player-platform-for-games",
    "description": "Xsolla, a global video game commerce company, announces its strategic acquisition of AcceleratXR, a provider of in-game server backend technology designed for live service games and software."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-27T19:54:24.000Z",
    "title": "Veteran iGaming Team Launch Crypto Casino Portal",
    "url": "https://cryptodaily.co.uk/2023/09/veteran-igaming-team-launch-crypto-casino-portal",
    "description": "In the ever-evolving world of cryptocurrency and online gambling, CryptoCasinos.Casino emerges as a game-changer, providing a comprehensive platform for crypto casino enthusiasts to make informed decisions."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-27T20:00:35.000Z",
    "title": "Monetary Transfers Readily Displace Inscriptions on Bitcoin, Glassnode Reveals",
    "url": "https://news.bitcoin.com/monetary-transfers-readily-displace-inscriptions-on-bitcoin-glassnode-reveals/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/btcblock-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Monetary Transfers Readily Displace Inscriptions on Bitcoin, Glassnode Reveals\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/btcblock-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btcblock-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btcblock-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btcblock-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btcblock-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btcblock-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/btcblock.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Ordinal inscriptions have quickly consumed Bitcoin&#x2019;s available block space since their debut last year, a study by blockchain analytics firm Glassnode found. These text and image files act as &#x201C;packing filler,&#x201D; filling any remaining space in blocks after higher-value transactions are added, the study showed. Bitcoin&#x2019;s Block Space: Monetary Transfers Overpower Inscriptions Though there&#x2019;s been [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T20:07:28.000Z",
    "title": "Reimagining The Future of Travel With AI",
    "url": "https://www.cryptopolitan.com/reimagining-the-future-of-travel-with-ai/",
    "description": "The travel industry is forecasted to grow at an average of 5.8% a year through 2032. The widespread adoption of emerging technologies in the sector could be one key to unlocking this potential and ultimately reshaping the travel experience for people around the world. Digital Technology is a Big of the Travel Industry With existing ... <a title=\"Reimagining The Future of Travel With AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/reimagining-the-future-of-travel-with-ai/\" aria-label=\"More on Reimagining The Future of Travel With AI\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T19:45:26.000Z",
    "title": "Chainlink expands cross-chain capabilities to Base network",
    "url": "https://www.cryptopolitan.com/chainlink-expands-cross-chain-capabilities-to-base-network/",
    "description": "Chainlink, the renowned blockchain oracle platform, has extended its Cross-Chain Interoperability Protocol (CCIP) to Base, an Ethereum layer-2 network incubated by Coinbase. According to an official announcement, this integration aims to facilitate seamless communication between various blockchains and traditional Web2 applications, such as SWIFT&#8217;s payment system. The CCIP protocol allows for the development of applications ... <a title=\"Chainlink expands cross-chain capabilities to Base network\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-expands-cross-chain-capabilities-to-base-network/\" aria-label=\"More on Chainlink expands cross-chain capabilities to Base network\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-27T20:00:55.000Z",
    "title": "LINKing The Dots: Why Chainlink Could Be The Altcoin To Watch, Top Trader Says",
    "url": "https://www.newsbtc.com/news/why-chainlink-could-be-the-altcoin-to-watch/",
    "description": "Chainlink (LINK), the decentralized oracle network, has been making waves in the cryptocurrency space recently. Renowned crypto analyst Altcoin Sherpa, known for his insightful market predictions on the social media platform X, has voiced strong support for Chainlink, highlighting its promising fundamentals.  With a current price of $7.45 on CoinGecko, LINK has been steadily gaining traction, posting a 0.2% gain in the past 24 hours and a 9.1% increase over the last seven days. Related Reading: Solana Bulls Struggle To Break $21 Barrier – What Lies Ahead? Sherpa&#8217;s Vote Of Confidence On Chainlink Altcoin Sherpa&#8217;s LINK endorsement carries significant weight in the crypto community. He believes that Chainlink is poised for exceptional performance in the next bull cycle, emphasizing its resilience during the crypto market&#8217;s ups and downs.  In his own words: &#8220;LINK: Still one of the few coins that I would consider just buying a bag of and letting it sit for the next six months [plus]. I think this is going to be a very strong one for the next cycle. Core infrastructure for a ton of projects with few competitors.&#8221; LINK market cap hits $4.3 billion today. Chart: TradingView.com LINK’s Steady Price Growth Chainlink&#8217;s recent price surge has caught the attention of investors and analysts alike. Over the past two weeks, LINK&#8217;s price has climbed from a low of $6.53 to a peak of $7.30. This impressive rally has left many wondering about the driving factors behind it. One significant factor contributing to LINK&#8217;s recent upswing is the dynamics of its availability on exchanges. Santiment, a prominent on-chain analytics company, has noted that historically, whenever a substantial amount of LINK is transferred to exchanges, it triggers positive price movements. This suggests that investors are actively seeking to acquire and hold LINK, anticipating future gains. There are a total of 81 fresh wallets created on Sept 15 started withdrawing $LINK from #Binance on Sept 18. And these wallets have withdrawn a total of 4.7M $LINK ($31.58M) from #Binance so far. Details: https://t.co/hSdkoncNgZhttps://t.co/AzUM8VleQQ pic.twitter.com/4IxdSHtv6C — Lookonchain (@lookonchain) September 22, 2023 Growing Chainlink Ecosystem Another noteworthy development is the surge in the creation of new Chainlink addresses. A recent tweet from Lookonchain revealed that the number of newly established Chainlink addresses has reached 81. This indicates a growing interest in the Chainlink ecosystem, with more participants joining the network. Such expansion often bodes well for the long-term viability and adoption of a cryptocurrency. Related Reading: Cardano $0.24 Support Test: Can ADA Price Reverse Its Downward Trend? Chainlink&#8217;s strong fundamentals and the support it has garnered from prominent analysts like Altcoin Sherpa make it a cryptocurrency to watch closely. With its recent price rally, increasing interest from investors, and pivotal role as core infrastructure for various projects, Chainlink seems well-positioned to thrive in the next crypto bull cycle. LINK&#8217;s performance will undoubtedly be a topic of keen interest among investors and enthusiasts alike. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-27T20:00:07.000Z",
    "title": "Six Ethereum-Based Altcoins and Two Low-Cap Crypto Assets Flashing Bullish On-Chain Signal: Santiment",
    "url": "https://dailyhodl.com/2023/09/27/six-ethereum-based-altcoins-and-two-low-cap-crypto-assets-flashing-bullish-on-chain-signal-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/six-two-low-assets.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/six-two-low-assets.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/six-two-low-assets.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/six-two-low-assets.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/six-two-low-assets.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/six-two-low-assets.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/six-two-low-assets.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analytics firm Santiment says that the prices of eight altcoins are showing signs of moving higher. Santiment says that the supplies of the Ethereum (ETH)-based native tokens of decentralized exchanges SushiSwap (SUSHI) and Injective Protocol (INJ), decentralized finance platform CurveDAO (CRV) and cross-chain protocol Biconomy (BICO) are falling on exchanges as the assets are [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/27/six-ethereum-based-altcoins-and-two-low-cap-crypto-assets-flashing-bullish-on-chain-signal-santiment/\">Six Ethereum-Based Altcoins and Two Low-Cap Crypto Assets Flashing Bullish On-Chain Signal: Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-27T19:55:14.000Z",
    "title": "Fidelity Executive Says Ethereum Investment Thesis Could Be Easier for Institutions To Grasp Than Bitcoin – Here’s Why",
    "url": "https://dailyhodl.com/2023/09/27/fidelity-executive-says-ethereum-investment-thesis-could-be-easier-for-institutions-to-grasp-than-bitcoin-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/Bitcoin-Ethereum-ar-gearing.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/Bitcoin-Ethereum-ar-gearing.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/Bitcoin-Ethereum-ar-gearing.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/Bitcoin-Ethereum-ar-gearing.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/Bitcoin-Ethereum-ar-gearing.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/Bitcoin-Ethereum-ar-gearing.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/Bitcoin-Ethereum-ar-gearing.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An executive from financial services giant Fidelity says that the investment thesis centered around Ethereum (ETH) may be easier for institutions to understand compared to Bitcoin (BTC). In a new interview on the Bankless YouTube channel, Fidelity’s director of research Chris Kuiper says that the firm’s Ethereum investment thesis could be an easier concept for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/27/fidelity-executive-says-ethereum-investment-thesis-could-be-easier-for-institutions-to-grasp-than-bitcoin-heres-why/\">Fidelity Executive Says Ethereum Investment Thesis Could Be Easier for Institutions To Grasp Than Bitcoin – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]