[
  {
    "source": "Decrypt",
    "date": "2023-10-27T14:57:20.000Z",
    "title": "What Is Lido Finance, Ethereum's Largest Liquid Staking Project?",
    "url": "https://decrypt.co/resources/what-is-lido-finance-ethereums-largest-liquid-staking-project",
    "description": "Lido Finance has long held the lion’s share of the liquid staking market on Ethereum, but what is it and how does it work?"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-27T14:43:00.000Z",
    "title": "Fintech, DeFi, GameFi, and more: Web3 startups kick off Cointelegraph Accelerator second cohort",
    "url": "http://cointelegraph.com/news/fintech-defi-gamefi-and-more-web3-startups-kick-off-cointelegraph-accelerator-second-cohort",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/31107cac9931d1f015f05b51808bcf87.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sixteen startups selected from over 1000 applications will present their projects to a global audience.</p>\n                    <p><p>Cointelegraph Accelerator, a startup booster that leverages Cointelegraph’s capabilities as a media and strategic partner, announced its second cohort launching in October 2023 for up-and-coming Web3 startups.</p><p>Selected from over 1000 startup applications, the 16 participants of the second cohort of the <a href=\"https://cointelegraph.com/accelerate/\">Cointelegraph Accelerator program</a> represent a wide array of Web3 verticals, including <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a>, fintech, wallets, entertainment, social, and GameFi.</p><p>By joining Cointelegraph’s accelerator program, Web3 startups will get marketing strategy expertise, access to Cointelegraph media products, and mentorship programs with industry experts on key start-up development topics, including token design, fundraising, legal frameworks, liquidity management, security, etc. The participants will also benefit from access to Cointelegraph’s broad network of investors, foundations, infrastructure partners, and other industry leaders.</p><p>The current cohort of the Cointelegraph Accelerator program consists of 16 Web3 startups focused on bringing innovation to the biggest sectors in the blockchain space. Find out more about them below:</p><h2>DeFi and trading</h2><p>In a world where traditional and decentralized finance coexist, bridging the gap between them is crucial. The latest Cointelegraph Accelerator participants focused on DeFi services are pioneering solutions to enhance accessibility, transparency, and efficiency, thus redefining trading and personal finance management for mainstream users.</p><p><a href=\"https://changex.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Changex</a> is a personal finance mobile app that aims to bring traditional finance users to Web3 by combining centralized and decentralized finance on a single screen. As an all-in-one <a href=\"https://cointelegraph.com/news/web3s-swiss-army-knife-of-personal-finance-changex-joins-cointelegraph-accelerator\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/web3s-swiss-army-knife-of-personal-finance-changex-joins-cointelegraph-accelerator/amp\">self-custody wallet solution</a>, Changex offers crypto swapping, buying, selling, and staking. The platform has 2,500 monthly active users (MAU) with over $3 million in staked assets.</p><p><a href=\"https://cryptorobotics.co/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">CryptoRobotics</a> is a crypto trading platform with advanced tools aimed at bringing the crypto community together. Users can utilize the signals and trading strategies coming directly from professional traders and analysts, who, in return, can earn investor rebates for providing their strategies. The platform leverages trading robots powered by smart algorithms with risk management systems to enable automated trading. The team reached over $1 billion in trading volume in 2022 with over 50,000 registered users.</p><p><a href=\"https://www.clip.finance/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Clip Finance</a> is a DeFi protocol that aggregates and benefits from the investment strategies available to the mainstream audience and other protocols. Users can deposit their stablecoins with a single click and get yield from a pool of various DeFi protocols, including Aave, Thena, Stargate, and Biswap. The platform aims to simplify the creation of risk-analyzed yield portfolios and is currently preparing for the main launch based on feedback from the private beta phase.</p><p><a href=\"https://myrenegade.net/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Renegade</a> is bridging the gap between traditional banking and cryptocurrencies. The user-friendly platform offers both a full IBAN account and a Visa card, allowing users to pay in top cryptocurrencies like BTC and ETH effortlessly. A central product element is the noncustodial wallet, ensuring users maintain full control over their crypto assets. After a promising beta test with 2,500 users, the company is gearing up for an open market launch in Q4 2023.</p><p><a href=\"https://www.mc2.fi/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">MC² Finance</a> is a noncustodial, cross-chain token strategy platform. It aims to democratize access to on-chain crypto wealth management through easy-to-use tools and access to aggregated crypto portfolio strategies with a user-friendly UI. The European-based MC² Finance team aims to launch its mainnet after hosting over a thousand users during the platform’s testnet.</p><p><a href=\"https://nolus.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Nolus</a> is a semi-permissioned, blockchain-powered platform that bridges lenders and borrowers in a DeFi money market. With its DeFi Lease, borrowers can secure 3x leveraged yield-generating capital. Inspired by traditional leasing, where one pays a fraction upfront and gains ownership after repayment, Nolus' approach cuts down the DeFi sector's high overcollateralization standards, which boosts capital efficiency and offers borrowers better loan terms.</p><p><a href=\"https://www.velvet.capital/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Velvet Capital</a> is a DeFi platform on the BNB Chain that helps create and manage on-chain funds and structured products. Asset managers can create portfolios of digital assets and mint synthetic tokens representing them. Users can invest in tokenized portfolios and earn yield from lending, staking, capital gains, or providing liquidity. The company offers a Web3 app for regular users and “DeFi-as-a-Service” (with SDK and APIs) for institutional clients. The platform has a live MVP with over 550 active investors.</p><p><a href=\"https://wzone.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">WhiteList Zone</a> is a marketplace where crypto investors and enthusiasts can buy “front-row seats” for upcoming Web3 projects. Its mission is to democratize the market of early Web3 investments in the most efficient and accessible way. Users can buy and trade whitelists, which grant exclusive rights to participate in launch events such as <a href=\"https://cointelegraph.com/learn/initial-dex-offering-ido\">initial DEX offerings (IDOs)</a>. The platform hosts over 50 projects and over 7,000 whitelist submissions, attracting nearly 4,000 users.</p><h2>Data storage and digital assets</h2><p>Data sovereignty and security are paramount in the digital age. By offering decentralized data storage and robust digital asset management solutions, these projects ensure a seamless transition toward digital ownership and secure data management.</p><p><a href=\"https://ghostdrive.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">GhostDrive</a> is a Web3 native data storage platform and user application on the <a href=\"https://cointelegraph.com/learn/what-is-the-interplanetary-file-system-ipfs-how-does-it-work\">InterPlanetary File System (IPFS)</a> and <a href=\"https://cointelegraph.com/learn/what-is-filecoin-the-leading-decentralized-storage-network\">Filecoin</a>, a decentralized alternative to Google Drive where users can store, share, and access data. Users can join by logging in with MetaMask or the traditional email and password combination and start storing data in a decentralized cloud securely.</p><p><a href=\"https://www.ngrave.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">NGRAVE</a> is the first complete solution for full control of digital assets, focusing on self-custody, maximum security, and ease of use. The <a href=\"https://cointelegraph.com/news/how-to-use-a-crypto-hardware-wallet\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/how-to-use-a-crypto-hardware-wallet/amp\">hardware wallet</a>, Ngrave Zero, is the world’s only financial product featuring a secure OS with the highest security certification: EAL7, developed with world-renowned cryptography and security experts. The company also offers its users a stainless steel encrypted backup for their keys and a mobile app to track their digital assets.</p><h2>SocialFi and Marketing tech</h2><p>The conventional social media landscape often overlooks fair revenue distribution and user control. However, innovative platforms are being developed to merge social interactions with financial incentives, creating a more equitable social media ecosystem for both content creators and consumers.</p><p><a href=\"https://www.popsocial.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Pop Social</a> is an AI-powered social gateway to Web3. The platform explores a new approach to social media where users create and share their content, interact with each other, and get rewards with native Pop Tokens for active engagement with the app. AI algorithms are used in the content creation features and in the process of generating individual post feeds. Pop Social has already reached over 250,000 downloads on the App Store and Google Play Store and has over 40,000 daily active users.</p><p><a href=\"https://readon.me/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">ReadON</a> is a social app with a Web3 sharing economy where content is owned by creators, and part of the ad revenue is distributed back to them. Creators earn tokens for sharing, users earn tokens for reading, and advertisers buy and burn tokens to place ads and access users' interests targeting data. The app has reached over 510,000 user registrations and app downloads, 45,000 daily active users, and over 563,000 content pieces.</p><p><a href=\"https://gamiworld.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">GAMI</a> is a Web3-focused venture builder that hosts a variety of products tailored to the blockchain industry. Gami’s flagship product is <a href=\"https://midle.io/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Midle</a>, an all-in-one marketing platform that helps optimize user acquisition and community engagement, working with 100+ partners from the Web3 space. Midle has already reached over 22,000 unique users who have completed over 400,000 quests.</p><h2>EdTech and HRTech</h2><p>Exclusivity and a lack of verified talent pools hinder the growth of the Web3 domain. Some projects, however, are working on democratizing access to Web3 solutions and education, bridging the gap between academic institutions and the blockchain industry, and facilitating continuous innovation.</p><p><a href=\"https://talentre.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Talentre</a> is a Web3 talent platform where users have access to blockchain education courses, events, certifications, and a traceable tokenized achievement system. At the same time, Web3 companies and projects get access to a verified talent pool. More than 50 universities have already partnered with Talentre, and the platform has reached over 170,000 registered wallets and over 50 business clients, including Circle, BNB Chain, Solana, and many others.</p><h2>Entertainment</h2><p>Monetization and user engagement are pressing challenges in the entertainment sector. By embedding blockchain technology in streaming and gaming platforms, these innovative projects are crafting a rewarding and engaging entertainment ecosystem for modern audiences.</p><p><a href=\"https://imaginereplay.org/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Replay</a> has developed a blockchain-powered streaming service called <a href=\"https://rewarded.tv/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">RewardedTV</a> that empowers viewers and creators to take control of their video streaming experience. RewardedTV uses blockchain tech <a href=\"https://cointelegraph.com/news/how-web3-can-prevent-hollywood-strikes-replay-joins-cointelegraph-accelerator\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/how-web3-can-prevent-hollywood-strikes-replay-joins-cointelegraph-accelerator/amp\">to reward viewers</a> with digital tokens and collectibles to drive engagement. The platform has over 100,000 registered users, and more than 4,000 videos-on-demand (VOD) live TV channel options, with more partnered streaming apps on the way.</p><p><a href=\"https://www.fan-ton.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Fanton</a> is a Web3 fantasy football game <a href=\"https://cointelegraph.com/press-releases/telegram-and-tons-triple-play-fantons-web3-fantasy-soccer-game-hits-55k-mau\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/press-releases/telegram-and-tons-triple-play-fantons-web3-fantasy-soccer-game-hits-55k-mau/amp\">playable on Telegram</a> and integrated with The Open Network (TON) blockchain. Similar to traditional fantasy sports games, which comprise a $25 billion market, the game allows players to create their dream team with NFT cards of soccer superstars and earn points based on the players’ real-life performances. The product has had a successful launch reaching more than 11,000 registered users to date.</p>\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-27T15:04:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-27T14:58:40.000Z",
    "title": "Regulators Introduce Five Guiding Principles for Machine Learning-Enabled Medical Devices",
    "url": "https://www.cryptopolitan.com/five-guiding-principles-for-machine-learning/",
    "description": "In a move to streamline the regulatory process for Machine Learning-Enabled Medical Devices (MLMDs), regulators have introduced five guiding principles. These principles are designed to alleviate the regulatory reassessment burden on manufacturers when they make certain updates or changes to their devices. The five guiding principles Derived from the 10 principles of Good Machine Learning ... <a title=\"Regulators Introduce Five Guiding Principles for Machine Learning-Enabled Medical Devices\" class=\"read-more\" href=\"https://www.cryptopolitan.com/five-guiding-principles-for-machine-learning/\" aria-label=\"More on Regulators Introduce Five Guiding Principles for Machine Learning-Enabled Medical Devices\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-27T14:58:16.000Z",
    "title": "Crypto Regulations in Spain: Commitment to Ensure Safe Investments",
    "url": "https://www.cryptopolitan.com/crypto-regulations-in-spain-commitment-safe/",
    "description": "The Spanish government has adopted a notably cautious stance in its approach to cryptocurrencies. This cautiousness is rooted in a commitment to safeguarding the rights of investors and consumers, a priority that has gained significance following the prevalence of financial and securities fraud during the economic recession. In Spain, cryptocurrencies are not legally recognized as ... <a title=\"Crypto Regulations in Spain: Commitment to Ensure Safe Investments\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-regulations-in-spain-commitment-safe/\" aria-label=\"More on Crypto Regulations in Spain: Commitment to Ensure Safe Investments\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-27T15:09:08.000Z",
    "title": "Neo, Floki and Injective lead top gainers in the last 24 hours",
    "url": "https://crypto.news/neo-floki-and-injective-lead-top-gainers-in-the-last-24-hours/",
    "description": "Following a Bitcoin price surge over $35,000, a number of other assets have taken on a bullish momentum."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-27T15:06:50.000Z",
    "title": "Elon Musk has big plans for crypto: analyst",
    "url": "https://crypto.news/elon-musk-has-big-plans-for-crypto-analyst/",
    "description": "According to popular crypto analyst CryptosRUs, Tesla and Twitter CEO Elon Musk could have major initiatives involving cryptocurrencies coming in 2024."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-27T14:54:45.000Z",
    "title": "How to safeguard assets if your crypto exchange is in trouble",
    "url": "https://crypto.news/how-to-safeguard-assets-if-your-crypto-exchange-is-in-trouble/",
    "description": "Discover how to protect your crypto and recognize the early signs of a potential exchange collapse in this essential guide."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-27T14:48:16.000Z",
    "title": "X employees have one year to replace their bank, according to announcement",
    "url": "https://crypto.news/x-employees-have-one-year-to-replace-their-bank-according-to-all-hands-call-announcement/",
    "description": "In the all-hands call on Oct. 26, Elon Musk shares his vision for X becoming a central hub for financial matters."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-27T14:45:08.000Z",
    "title": "Floki up 13% as devs launch RWA platform",
    "url": "https://crypto.news/floki-up-13-as-devs-launch-rwa-platform/",
    "description": "Memecoin Floki Inu saw considerable gains within a week ahead of a real-world asset (RWA) platform release built by the project’s developers and a new native asset dubbed TOKEN."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-27T15:00:26.000Z",
    "title": "XRP Price To Go Parabolic, Here’s When",
    "url": "https://www.newsbtc.com/all/xrp-price-to-go-parabolic-heres-when/",
    "description": "On Wednesday, October 25, a prominent cryptocurrency analyst Dark Defender revealed that the price of XRP will go parabolic in the future, highlighting how it is going to happen and when it is expected to happen.  Crypto Analyst&#8217;s XRP Price Projection The XRP analyst recently took to X (formerly Twitter) to share his predictions and optimism on the XRP price going parabolic and how it is going to happen. In the Dark Defender X post, there are two crucial support levels and three resistance levels for the digital asset, which include $0.52 and $0.46 for the support levels, while the resistance levels are $0.66, $1.88, and $5.85.  According to him, the XRP price could be on its way to surpass the $1 mark if it manages to break through the $0.66 resistance level. And when this happens, the next resistance level will be $1.88.  The analyst&#8217;s recent projection presents a 210.64% price surge if the XRP price breaks through the $1.88 resistance level, which will see the cryptocurrency potentially heading toward the coveted $6 mark. Related Reading: XRP Price Set To Surge Amid Heightened Whale Accumulation One interesting thing about the analyst projections is the fact that his projections are based on an examination of the XRP&#8217;s weekly market trajectory over the past two years. According to the chart posted by Dark Defender, the trends that were evident prior to the July surge seem to be resurfacing, suggesting a potential bullish run for XRP between 2024 and 2025. So far, the XRP analyst is not the only one who believes in a potential price for XRP. Several other experts have shown increased credence about the XRP&#8217;s potential price surge this year. In September, Wells Fargo manager Shannon Thorp predicted the price of XRP could go as high as $500, presenting a bullish concept for the cryptocurrency. Another prominent figure in the crypto space who has expressed his optimism about the XRP price potential is CryptoInsight, drawing comparisons to the Bitcoin fractal from 2017. This is because the question that has been swelling among the crypto community is whether XRP will mirror the 2017 Bitcoin fractal in the coming weeks. Leaving the result open-ended, he speculated that there is a possibility that XRP will outperform following a five-year period of consolidation. According to CryptoInsight, this is because most of the cryptocurrencies now basically began their bull market after surpassing their previous peak, but the XRP seems to have plummeted due to the SEC&#8217;s lawsuit on Ripple being dropped.  However, a recent rally has shown a significant 13% surge in the price of XRP over the past week, with a trading volume of $2.3 billion. The cryptocurrency is currently trading at $0.55 as of the time of writing. Related Reading: XRP Price Prediction – Bulls Could Take Advantage Of Price Dip To Restart Rally With XRP&#8217;s recent growth, the cryptocurrency seems to have surpassed some of the leading altcoins in the crypto market, such as Solana (SOL) and Chainlink (LINK). Featured image from AltcoinsBOX, chart by Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-27T15:02:10.000Z",
    "title": "Expert Pepecoin Price Prediction Reveals What to Expect as the Year Ends. To HODL or To Jump the Ship?",
    "url": "https://www.crypto-news-flash.com/expert-pepecoin-price-prediction-reveals-what-to-expect-as-the-year-ends-to-hodl-or-to-jump-the-ship/?utm_source=rss&utm_medium=rss&utm_campaign=expert-pepecoin-price-prediction-reveals-what-to-expect-as-the-year-ends-to-hodl-or-to-jump-the-ship",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-110.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-110.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-110-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The year is fast running out, and the activities in the crypto market are at a record high. This newly-found pace is thanks to the rising buying pressure as we anticipate the first spot Bitcoin ETF approval by the SEC, an optimism that has seen the Bitcoin price hit an impressive rally. With attention now [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-27T15:00:57.000Z",
    "title": "Solana Labs Unleashes Incubator Powerhouse to Propel Blockchain Startups to Stardom",
    "url": "https://www.crypto-news-flash.com/solana-labs-unleashes-incubator-powerhouse-to-propel-blockchain-startups-to-stardom/?utm_source=rss&utm_medium=rss&utm_campaign=solana-labs-unleashes-incubator-powerhouse-to-propel-blockchain-startups-to-stardom",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T093129.445.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T093129.445.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T093129.445-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Solana Labs announces the Incubator Program to address some of the common challenges faced by developers building on the network.  So far, the team has not disclosed the amount committed to the Incubator Program. Solana Labs has launched an interesting initiative to enable startups interested in building on its network to access engineering and go-to-market [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-27T14:57:00.000Z",
    "title": "ETH’s Breakout Chances Hindered by Supply Wall, Says Analyst",
    "url": "https://coinedition.com/eths-breakout-chances-hindered-by-supply-wall-says-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Community-Warns-Against-Sending-Funds-to-BEN.eth-in-LOYAL-Pre-Sale.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Community Warns Against Sending Funds to BEN.eth in $LOYAL Pre-Sale\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Community-Warns-Against-Sending-Funds-to-BEN.eth-in-LOYAL-Pre-Sale.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Community-Warns-Against-Sending-Funds-to-BEN.eth-in-LOYAL-Pre-Sale-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Community-Warns-Against-Sending-Funds-to-BEN.eth-in-LOYAL-Pre-Sale-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Community-Warns-Against-Sending-Funds-to-BEN.eth-in-LOYAL-Pre-Sale-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Community-Warns-Against-Sending-Funds-to-BEN.eth-in-LOYAL-Pre-Sale-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Community-Warns-Against-Sending-Funds-to-BEN.eth-in-LOYAL-Pre-Sale-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency trader and analyst Ali revealed in an X post yesterday that there is currently a large supply wall hindering the chances of an Ethereum (ETH) breakout. According to the post, there is a supply wall of around 33 million ETH at $1,960. The leading altcoin suffered slightly over the past 24 hours of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/eths-breakout-chances-hindered-by-supply-wall-says-analyst/\">ETH’s Breakout Chances Hindered by Supply Wall, Says Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]