[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T02:08:01.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.1033, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 2.15% decrease. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T01:53:23.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 How much is LTC worth? The current price of Litecoin stands at $64.8. Over the past 24 hours, it has experienced a trading volume of $1.72B and a market capitalization of $6.71B. Litecoin’s market dominance is at 0.55%. However, there has been a decrease in the LTC price by 2.93% within ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T02:00:49.000Z",
    "title": "Is Binance Really Selling Bitcoin To Prop The Price Of BNB?",
    "url": "https://www.newsbtc.com/analysis/btc/binance-bitcoin-bnb/",
    "description": "Crypto exchange Binance has had a tough few months in terms of market news and pressure from regulatory bodies. Just a few days ago, Binance lost another payment processing partner after Checkout.com terminated its contract with the crypto exchange. And now, another rumor that appears to be spreading is that Binance is selling Bitcoin on the spot market to sustain the price of its native token, BNB. Is Binance Really Selling Its Bitcoin To Buy BNB? The rumor originated from a post made by @WhaleChart on X (formerly Twitter), claiming that Binance is allegedly selling Bitcoin on the spot market to support the price of its own token, BNB.  Related Reading: Shiba Inu Community Leaves Shibarium Launch Troubles Behind As Wallet Count Crossed 10 Million BREAKING: Binance is allegedly selling Bitcoin to support the price of their own token BNB — Whale (@WhaleChart) August 22, 2023 This rumor seems to be gaining ground since the tweet first went live, especially as the price of BNB continues to struggle in the market. This is because as one of the biggest holders of both Bitcoin and BNB, Binance is in a unique position to manipulate the market if it wanted.  However, this remains only a rumor as there are currently no signs the crypto exchange is manipulating the price for short-term gains in BNB.  Additionally, data from Coinmarketcap shows that the prices of both cryptocurrencies have been falling together in the past week, with Bitcoin also down by 11.20% in a 7-day timeframe. This will not be the first time such allegations are being brought against the exchange. Binance has faced similar claims in the past, with crypto analyst JW claiming Binance was selling Bitcoin to prop up the price of BNB in June of this year.  Token price falls in tandem with BTC &#124; Source: BNBUSD on Tradingview.com Binance CEO Changpeng Zhao (CZ), however, denied the allegations, dismissing them as an attempt to spread fear, uncertainty, and doubt (FUD).  4. Binance have not sold BTC or BNB. We even still have a bag of FTT. It is amazing they can know exactly who sold based on just a price chart involving millions of traders. FUD. 🤷‍♂️ pic.twitter.com/M3MUH2bFRE — CZ 🔶 Binance (@cz_binance) June 13, 2023 Whether or not the theories are true, Binance has surely been under intense scrutiny, but it continues to stand strong as the biggest exchange in the world.  BNB and other cryptocurrencies that rely on the BEP20 and BEP2 token standards are very dependent on Binance, as news surrounding the exchange has led to price pumps and dumps in the past. But there has been no solid evidence that the exchange has been manipulating the prices of any of these tokens. Related Reading: Gemini Hits Back At SEC Lawsuit With Dismissal Filing The price of BNB has seen a drastic reduction in the past few days as the entire market goes through corrections signaled by BTC falling by more than 8% in a couple of minutes last week. As a result, BNB has seen its price drop to $209.44, a reduction of 12.33% in the past few days.  To combat a further price drop, the BNB Chain had to manually liquidate a $200 million position on the Venus DEFI protocol, which would have been liquidated after BNB dropped below $220. At the time of writing, BNB is the fourth biggest crypto with a market cap of $32.2 billion. Featured image from Unsplash, chart from Tradingview.com"
  }
]