[
  {
    "source": "Decrypt",
    "date": "2023-12-26T22:01:02.000Z",
    "title": "Microsoft Slips Standalone Copilot AI App Into Android Store",
    "url": "https://decrypt.co/210918/microsoft-slips-standalone-copilot-app-for-android-into-google-app-store",
    "description": "As a late Christmas gift to generative AI fans, the Redmond-based tech giant released a free mobile app to rival popular paid options."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-26T21:51:00.000Z",
    "title": " Women who kicked ass in crypto in 2023 ",
    "url": "https://cointelegraph.com/news/women-kicked-ass-in-crypto-2023",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNzM4YjNhOWUtOTFjMi00Mjc4LThkMzgtNjFhMGZjNTQzNGI1LkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>One of the crypto industry’s core philosophies is decentralization led by the community, no matter your background, and crypto may be the golden ticket for women to hop on the tech train. </p>\n                    <p><p>In the past few years, the crypto industry has expanded dramatically, with many branches sprouting from this ever-growing wisdom tree. Although the industry has matured, the crypto market is still young and an ideal playground for any entrepreneurship mindset. </p><p>Fortunately, <a href=\"https://cointelegraph.com/news/singaporean-women-outperforming-men-in-crypto-trades-survey-reveals\">women have taken the opportunity</a> to leap into the crypto gold rush, and their efforts are already bearing fruit with notable contributions and successes in the crypto industry.</p><p>Crypto has many sectors, but its core functionality comes from the fusion of tech and finance. Both sectors have been typically male-<a href=\"https://www2.deloitte.com/xe/en/insights/industry/financial-services/gender-diversity-in-global-financial-services.html\" target=\"_blank\" rel=\"noopener nofollow\">dominated</a>, but more women are getting into the crypto industry as investors, founders or part of the workforce. </p><p><a href=\"https://cointelegraph.com/news/women-kicked-ass-in-crypto-2023\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-12-26T21:43:36.000Z",
    "title": "Cardano to continue trading sideways before large move: analyst",
    "url": "https://crypto.news/cardano-to-continue-trading-sideways-before-large-move-analyst/",
    "description": "A crypto analyst from the More Crypto Online YouTube channel said Cardano is stuck in a trading range and could continue moving sideways."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-26T22:00:58.000Z",
    "title": "The Crypto Bulls Are Back: Digital Asset Inflows Cross $103 Million In One Week",
    "url": "https://www.newsbtc.com/crypto/crypto-asset-inflows-103-million/",
    "description": "Inflows into crypto investment funds have resumed after a brief hiatus two weeks ago, as evidenced by CoinShares&#8217;s latest analysis. According to James Butterfill, Head of Research at CoinShares, digital assets saw a net inflow of $103 million last week, as the wider crypto industry went through a few days of bullish sentiment. This is particularly exciting, as it signaled a change from the net outflows in digital asset investment funds witnessed two weeks ago.  Crypto Fund Inflows Surge To $103 Million Crypto asset investment funds witnessed a minor net outflow of $16 million two weeks ago, bringing an end to 11 consecutive weeks of inflows since September. However, according to a social media post by Butterfill, these investment funds attracted a $103 million net inflow last week. As expected, Bitcoin, again, led the charge, attracting 85% of the total inflow. Bitcoin saw an inflow of $87 million last week, bringing its total net inflow this year to $1.758 billion.  Related Reading: Harmony To See Redemption? Analyst Predicts Meteoric 650% Rise For ONE Token Ethereum led the altcoin market with a net inflow of $7.9 million, bringing its total net inflow this year to $23 million. Solana followed suit with a $6 million net inflow. At the time of writing, Solana’s total inflow this year stands at $162 million, reflecting the better sentiment Solana has seen with institutional investors this year.  On the other hand, Litecoin and Avalanche investment products were the only ones registering a net outflow during the week, with $0.4 million and $2.6 million respectively. In terms of geographical location, Germany had the most inflows with $41.6 million, Canada with $25.8 million, USA with $20.4 million, and Switzerland with $15 million. On the other hand, Sweden had a net outflow of $8.7 million.  Total assets under management now stand at $52 billion, representing 31% of the entire crypto market cap of $1.65 trillion. Most of this is traded in the United States, with US-based investment funds holding $37.8 billion worth of assets under management. US$103m inflows in digital assets last week, no report on Monday. Merry Christmas! pic.twitter.com/xAVzCrPPkQ — James Butterfill (@jbutterfill) December 23, 2023 Total market cap rises above $1.6 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com State Of The Market Investment in digital asset funds is largely tied to the sentiment among the spot market prices. As a result, the net inflows last week were a mirror of the price surge led by Bitcoin, with the crypto crossing over $44,000 multiple times during the week. Bitcoin has since corrected and is now trading at $42,390. Related Reading: Crypto Analyst Predicts XRP Price Will Hit $1.33 ‘Pretty Fast’ Ethereum&#8217;s lead in the altcoin market has been overshadowed by Solana since October. The crypto is up by 53% in a 7-day timeframe, hitting a yearly high of $124.92 on Christmas day. At the time of writing, Solana is trading at $114.   Featured image from Business Insider, chart from Tradingview.com"
  }
]