[
  {
    "source": "Decrypt",
    "date": "2023-09-19T22:58:31.000Z",
    "title": "Bitcoin Gets Its Own Take on Social App Friend.tech",
    "url": "https://decrypt.co/197867/bitcoin-alpha-social-token-friend-tech",
    "description": "Alpha uses a hybrid blockchain architecture with Bitcoin, Polygon and Trustless Computers, leveraging Optimistic rollups for a new decentralized social network. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-19T22:59:23.000Z",
    "title": "How Bitcoin miners can survive a hostile market",
    "url": "https://cointelegraph.com/news/bitcoin-miners-survive-hostile-market",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/9bdd89ef-da87-46d6-abc7-e243ecaf6d6e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin mining is becoming harder — which means miners will have to spend more to receive fewer rewards. But there are still ways to be profitable.</p>\n                    <p><p>Only seven months remain before the next Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) halving in April 2024. It happens approximately every four years and is a deflationary process that cuts the production of new coins by 50%.</p><p>Bitcoin's halving is one of the most high-profile events for crypto investors, and has historically led to an <a href=\"https://cointelegraph.com/news/the-economics-of-bitcoin-halving-understanding-the-effects-on-price-and-market-sentiment\">increase</a> in Bitcoin's price. However, its impact on the mining industry is a more complex issue. It reduces block rewards,  one of the primary revenue streams for miners. The 2024 halving will reduce it from 6.25 BTC to 3.125 BTC. That’s why miners must adapt their strategies to compensate for the reduced rewards resulting from the halving. </p><p>Let’s explore the strategies and alternative income sources that may help Bitcoin miners amid hostile market conditions.</p><h2>Changing mindsets</h2><p>Bitcoin mining involves a competitive process where miners vie for block rewards. This competition is driven by Bitcoin's block time, which averages around 10 minutes per block on the protocol level. Whether the network's computing power is relatively low at 1 kH/s or surges to a massive 200 million TH/s, the same block rewards must be distributed among miners.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/etf-revolution-bitcoin-cryptocurrencies\"><strong><em>An ETF will bring a revolution for Bitcoin and other cryptocurrencies</em></strong></a></p><p>This competitive environment encourages miners to prioritize energy efficiency and the use of cost-effective hardware. With each halving event, where block rewards are cut by 50%, this trend towards efficiency gains momentum. As the cost of producing a single BTC is set to approximately double shortly after the next halving, miners will need to explore ways to optimize their profitability and focus on these three critical factors.</p><h2>Bitcoin miners’ survival rests on these three whales</h2><p>The first and most important “whale” is the cost of electricity. Even a modest fluctuation of 1 cent per kilowatt-hour (kWh) can <a href=\"https://www.benzinga.com/markets/cryptocurrency/23/09/34382133/jpmorgan-drops-bitcoin-mining-cost-estimate-halving-event-could-impact-miners-profits\" target=\"_blank\" rel=\"noopener nofollow\">lead</a> to a substantial $3,800 variance in the production cost of BTC, according to JPMorgan. To bolster their post-halving profitability, miners are exploring sophisticated contracts and contemplating relocation to countries or regions where electricity prices are lower. They even consider power generation from stranded gas options. I believe that it's crucial for miners to secure electricity rates at or below 5 cents/kWh to maintain profitability beyond April 2024.</p><p>The second major factor demanding miners' attention is the efficiency of their equipment. For instance, daily BTC mining costs can be <a href=\"https://theminermag.com/data/overview/\" target=\"_blank\" rel=\"noopener nofollow\">slashed</a> by more than 63% when upgrading from a rig with a 60 J/TH efficiency rating to one with a 22 J/TH rating. Miners boasting hardware efficiency and benefiting from lower electricity costs will be the most profitable. They are the ones most likely to weather significant market events like the upcoming halving.</p><p>Additionally, I suggest miners employ the third strategy that involves accumulating excess capital in mined BTC during profitable periods. This reserve can serve as a buffer against the impact of reduced block rewards post-halving. When the post-halving rally occurs, miners can capitalize on their reserves by selling mined assets at a higher profit margin, helping to offset the losses.</p><p>While strategies such as securing lower electricity rates, adopting more energy-efficient mining equipment, and utilizing reserve capital can mitigate the adverse effects, the 2024 halving will bring substantial pressure on miners. It can lead to the potential closure of numerous mining operations. Thus, miners will also need to explore alternative revenue streams. One promising opportunity for miners lies in projects like Bitcoin Ordinals.</p><h2>Other ways</h2><p>Bitcoin Ordinals have recently garnered significant attention by <a href=\"https://cointelegraph.com/news/bitcoin-miners-raked-millions-in-fees-q2-amid-ordinals\">driving</a> transaction fees within the Bitcoin network to new highs. Ordinal “inscriptions,” the metadata attached to each satoshi, is a unique asset created directly on the Bitcoin blockchain, similar to a nonfungible token (NFT). To obtain one, users typically engage with the platform or protocol responsible for Ordinals.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/10-years-later-no-bitcoin-etf\"><strong><em>10 years later, still no Bitcoin ETF — but who cares?</em></strong></a></p><p>As the number of inscriptions rises, <a href=\"https://cointelegraph.com/news/bitcoin-ordinals-inscription-still-making-majority-btc-transactions\">surpassing</a> 25.5 million as of today, so does the revenue generated from transactions, exceeding a total of $53 million in fees, to be precise. This trend suggests that alternative income streams for miners may gain prominence in the long term. </p><p>We see Ordinals shifting the profitability equation for miners, increasing user demand for creating inscriptions, initiating processing transactions on the Bitcoin network, and incentivizing miners to include their transactions in the next block.</p><p>We can certainly expect more developments on top of the Bitcoin network that will enable miners to adapt more effectively to the post-halving landscape. As we move closer to the halving event, miners must prioritize the aforementioned strategies to optimize their profitability and stay open to new alternatives on the horizon.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Didar Bekbauov</strong> is the CEO of Bitcoin mining company Xive, which he co-founded in 2019. He previously served as a managing partner at Hive Mining. He holds an undergraduate degree from Kzak-British Technical University and a master's degree in financial management from the United Kingdom’s Robert Gordon University. He also acts as a mentor at the Founder Institute startup accelerator program in Houston, Texas.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-19T23:04:14.000Z",
    "title": "France and Germany’s expansion strategy for the EU",
    "url": "https://www.cryptopolitan.com/france-germany-expansion-strategy-for-the-eu/",
    "description": "As the tides of change sweep over Europe, with its geopolitical complexities and challenges, France and Germany have risen to take the lead. They&#8217;re at the forefront, presenting transformative strategies to reshape the EU, particularly in light of its anticipated expansion. And while their intentions might seem grand, it&#8217;s imperative we dig beneath the surface ... <a title=\"France and Germany’s expansion strategy for the EU\" class=\"read-more\" href=\"https://www.cryptopolitan.com/france-germany-expansion-strategy-for-the-eu/\" aria-label=\"More on France and Germany’s expansion strategy for the EU\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-19T22:51:38.000Z",
    "title": "CZ Zhao defends Binance.US amidst SEC’s ‘Ceffu’ controversy",
    "url": "https://www.cryptopolitan.com/cz-zhao-defends-binance-us/",
    "description": "Tensions are rising in the Securities and Exchange Commission (SEC) and crypto exchange Binance. The Allegations is that Binance.US, a subsidiary of the global entity, exposed customers to potential foreign business risks through a supposedly affiliated custody unit. Binance&#8217;s charismatic CEO, Changpeng “CZ” Zhao, doesn&#8217;t mince words. Responding to the claims, he fervently clarified that ... <a title=\"CZ Zhao defends Binance.US amidst SEC&#8217;s &#8216;Ceffu&#8217; controversy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cz-zhao-defends-binance-us/\" aria-label=\"More on CZ Zhao defends Binance.US amidst SEC&#8217;s &#8216;Ceffu&#8217; controversy\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-19T23:00:10.000Z",
    "title": "This New Development Could Stop The Optimism (OP) Price Dead In Its Tracks",
    "url": "https://www.newsbtc.com/analysis/optimism/optimism-op-price/",
    "description": "Optimism (OP) looks to be on a good recovery path so far in the month of September. This is thanks to the increasing positive user sentiment around the Ethereum Layer 2 network. However, the most recent development on the network could pose a threat to this recovery trend. Optimism Announces Third Airdrop After completing two rounds of airdrops already this year, the Optimism network has moved on to its third airdrop. This time around, the network is looking to reward loyal Optimism users who have delegated their OP to be used to participate in governance on the network. Related Reading: How Much Will Dogecoin Trade At If It Attains The Market Cap Of Bitcoin Or Ethereum? In its announcement, the team revealed that the latest iteration of its airdrop reward system would see 19 million OP tokens distributed to 31,000 unique addresses on the network. The airdrop distribution began on Monday, September 18, with the tokens being sent directly to the wallets of eligible users. The requirement was to have delegated OP tokens between January 20 to July 20 to receive the airdrop. To sweeten the pot, the airdrop applies a 2x multiplier to those who had delegated their tokens to individuals who were active voters. As for those who were ineligible to receive the latest round of airdrops, the team assured the community that more would be coming as 19% of the total OP token supply is dedicated to airdrops. What’s next? Eligible addresses are in the process of receiving OP for Airdrop #3. 🚨 There is no need to claim this airdrop. Do not interact with any site asking you to do so. 🚨 If you missed out, don&#8217;t worry—19% of the total initial supply of OP is dedicated to airdrops. — Optimism (✨🔴_🔴✨) (@optimismFND) September 18, 2023 Will This Affect OP Price? The value of the total OP tokens being distributed in the third airdrop comes out to around $26 million. This means that $26 million worth of tokens are making their way into the open market. Only half of the participants selling their allocation could see a $13 million selling pressure on the price of the digital asset. Now, if there is not enough demand to suck up this new supply, then the sellers will win and the OP price will drop drastically. This is already being manifested in Optimism’s performance in the last day which is already moving into the red with 0.24% losses. As more users receive and access their tokens, the selling pressure could climb rapidly. Related Reading: Ethereum Surges Ahead Of Bitcoin In Active Addresses, What Does This Mean? However, given that users are being rewarded for holding and delegating their tokens, it could spark an urge to hold onto the OP tokens among those who receive them in an effort to qualify for future airdrops. In such a case, the OP price will hold firmly and shake off any bear pressure. OP is already seeing increased interest which has translated to a 40% increase in its daily trading volume, according to data from CoinMarketCap. Its price is also holding tentatively at $1.40 as investors wait for the market to react. OP price recovers from crash &#124; Source: OPUSDT on Tradingview.com Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from CoinChapter, chart from TradingView.com"
  }
]