[
  {
    "source": "CoinDesk",
    "date": "2023-06-02T01:42:21.000Z",
    "title": "First Mover Asia: Bitcoin Has Reached 'a General Accumulation Phase': Analyst",
    "url": "https://www.coindesk.com/markets/2023/06/02/first-mover-asia-bitcoin-has-reached-a-general-accumulation-phase-analyst/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "ALSO: BTC-20 tokens are pushing toward a $500 million market cap, and data from Glassnode shows that they have been a boon for miners."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-02T01:46:08.000Z",
    "title": "OpenAI CTO's Twitter account hacked, shilling 'scam' airdrop, community warns",
    "url": "https://cointelegraph.com/news/open-ai-cto-twitter-hacked-promoting-scam-airdrop",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-04/cb8b2445-558e-4e6c-a5d0-d1315798a441.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Crypto Twitter has warned others not to click on the latest link posted on OpenAI CTO Mura Murati's Twitter account, which promises a free airdrop.</p>\n                    <p><p>Crypto Twitter has been flooded with warnings from users, after the Twitter account of Mita Murati, the chief technology officer of artificial intelligence firm OpenAI, was seemingly hacked —  promoting a \"scam\" cryptocurrency airdrop.</p><p>On June 2, Murati's account tweeted what appears to be a phishing link promising an airdrop of a purported ERC-20 token OPENAI named after the firm that created ChatGPT. </p><p>Murati has 126,200 followers on Twitter and has a verified account on the platform. The post has been viewed 79,600 times and has been retweeted 83 times at the time of writing. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/c4a1436a-b4ba-46da-be6b-b033ebad996b.png\"  /><figcaption style=\"text-align: center;\"><em>Murati's tweet promotes the airdrop of an ERC-20 token and links to what appears to be a phishing website. Source: Twitter</em></figcaption></figure><p>The tweet's author has also restricted who could reply to the tweet so others are unable to easily warn the link is a scam.</p><p>Some Twitter users theorize that Murati was a victim of a SIM-swapping attack.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We don&#39;t know what&#39;s going on yet (SIM attack?)<br><br>But NO WAY this is really Mira. This is a scam. <a href=\"https://t.co/zlp4SsR41l\">https://t.co/zlp4SsR41l</a></p>&mdash; Mark Jeffrey (@markjeffrey) <a href=\"https://twitter.com/markjeffrey/status/1664439967958044672?ref_src=twsrc%5Etfw\">June 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-02T01:55:00.000Z",
    "title": "Polygon Brings In Deutsche Telekom As Node Validator",
    "url": "https://cryptodaily.co.uk/2023/06/polygon-brings-in-deutsche-telekom-as-node-validator",
    "description": "<p class=\"md-end-block md-p md-focus\">Germany's Deutsche Telekom has joined Polygon as a validator, signaling its support for the Ethereum layer-2 scaling protocol and expanding its involvement in the blockchain technology space. Deutsche Telekom aims to explore new revenue streams and enhance network security through its participation as a validator.</p>\n<p class=\"md-end-block md-p\">The company's subsidiary, Deutsche Telekom MMS, will operate as a validator for Polygon, contributing to the security, governance, and decentralization of the platform. As a validator, Deutsche Telekom will run a full node, produce blocks, validate transactions, and participate in the consensus process. This move strengthens the overall integrity and interoperability of the Ethereum ecosystem.</p>\n<p class=\"md-end-block md-p\">Dirk R&ouml;der, Head of the Blockchain Solutions Center at Deutsche Telekom, views the collaboration with Polygon as a significant milestone for the company's aspiration to become a key player in Web3 infrastructure. Deutsche Telekom aims to serve institutional clients as a reliable enterprise-grade staking provider and leverage the existing infrastructure to monetize the native token of the underlying blockchain network. This strategic move allows Deutsche Telekom to tap into the growing potential of blockchain technology and establish a foothold in the evolving digital economy.</p>\n<p class=\"md-end-block md-p\">The involvement of mainstream telecommunications companies like Deutsche Telekom in the Web3 space can contribute to the greater decentralization of proof-of-stake blockchains. R&ouml;der emphasizes the importance of having a diverse and reliable validator set in a decentralized ecosystem. Other telecommunications companies are also exploring opportunities in this domain, fostering a more robust network infrastructure for blockchain platforms.</p>\n<p class=\"md-end-block md-p\">Michael Blank, CEO of Polygon Labs, believes that collaborations between blockchain projects and mainstream businesses like Deutsche Telekom can pave the way for wider adoption of blockchain technology across various industries. The partnership not only strengthens Polygon's network security and governance but also showcases the practical applications of blockchain beyond cryptocurrencies.</p>\n<p class=\"md-end-block md-p\">Polygon's blockchain ecosystem offers a suite of protocols for developers to access major scaling solutions, including zero-knowledge rollups, sidechains, app-specific chains, and data availability protocols. As a validator, Deutsche Telekom MMS will contribute to the security and decentralization of Polygon's proof-of-stake sidechain and Supernets app-chains. Currently, Polygon's PoS chain hosts numerous decentralized applications, processing millions of daily transactions and locking over $1.2 billion in Total Value Locked.</p>\n<p class=\"md-end-block md-p\">Deutsche Telekom's participation as a validator on Polygon demonstrates the increasing recognition of the potential of blockchain technology by established companies in the telecommunications industry. This collaboration strengthens Polygon's network infrastructure while bridging the gap between traditional businesses and the blockchain ecosystem.</p>\n<p class=\"md-end-block md-p\">The partnership between Deutsche Telekom and Polygon highlights the continued growth and integration of blockchain technology into mainstream operations. Such collaborations between traditional industry firms and blockchain companies advance the possibilities for transformative applications and advancements in the digital landscape, merging new horizons to expand the use case and adoption of blockchain technologies beyond crypto.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  }
]