[
  {
    "source": "CoinDesk",
    "date": "2024-03-26T12:12:20.000Z",
    "title": "Soaring U.S. Debt Means Potential for Liz-Truss-Style Market Shock, CBO Warns",
    "url": "https://www.coindesk.com/markets/2024/03/26/soaring-us-debt-means-potential-for-liz-truss-style-market-shock-cbo-warns/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin and gold may already be pricing in a crisis scenario. Both recently set new record highs amid an elevated interest-rates environment worldwide."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-26T12:30:08.000Z",
    "title": "TradingView Integrates the TRON Network and Joins HackaTRON Season 6 as an Official Partner",
    "url": "https://cryptoslate.com/tradingview-integrates-the-tron-network-and-joins-hackatron-season-6-as-an-official-partner/",
    "description": "<p>London, United Kingdom, March 26, 2024 – TradingView has become an official partner for HackaTRON Season 6, hosted by TRON DAO, BitTorrent Chain, HTX DAO, and JustLend DAO. This year&#8217;s competition is illuminated by the expertise of Maksim Shymanovich and Alexey Telnov from TradingView, set to judge the projects competing for a prize pool of [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/tradingview-integrates-the-tron-network-and-joins-hackatron-season-6-as-an-official-partner/\">TradingView Integrates the TRON Network and Joins HackaTRON Season 6 as an Official Partner</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-26T12:20:03.000Z",
    "title": "SEC reveals why Ripple should be fined for $2 billion",
    "url": "https://cryptoslate.com/sec-reveals-why-ripple-should-be-fined-for-2-billion/",
    "description": "<p>The US Securities and Exchange Commission (SEC) has detailed the rationale behind its insistence that crypto company Ripple should be fined roughly $2 billion in a March 25 court filing. Ripple&#8217;s top brass, including CEO Brad Garlinghouse and CLO Stuart Alderoty, had previously hinted at the SEC&#8217;s forthcoming move. They said that redacted versions of [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/sec-reveals-why-ripple-should-be-fined-for-2-billion/\">SEC reveals why Ripple should be fined for $2 billion</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-26T12:23:13.000Z",
    "title": "Flare Time Series Oracle Is Evolving To Support More Sophisticated Web3 dApps",
    "url": "https://cryptodaily.co.uk/2024/03/flare-time-series-oracle-is-evolving-to-support-more-sophisticated-web3-dapps",
    "description": "If its recently announced governance proposal comes to pass, the popular Flare Time Series Oracle will become even faster and more reliable, providing support for more data types and laying the groundwork for a newer generation of more sophisticated decentralized applications."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-26T12:17:06.000Z",
    "title": "Ethical AI in Information Retrieval Takes Center Stage at ECIR 2024",
    "url": "https://www.cryptopolitan.com/ai-in-information-retrieval-at-ecir-2024/",
    "description": "The 46th European Conference on Information Retrieval (ECIR 2024) is poised to kick-start discussions that could shape the future of artificial intelligence (AI) in information services. With over 400 global researchers in attendance, including representatives from industry giants like Google, Spotify, and Amazon, the conference aims to delve into the crucial realm of ethical information [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-26T12:35:04.000Z",
    "title": "Will Bitcoin’s success bring its doom?",
    "url": "https://crypto.news/will-bitcoins-success-bring-its-doom/",
    "description": "As the fourth Bitcoin (BTC) halving gets closer, some experts believe the event could lead to centralization risk, threatening the blockchain network. Once every four years, the block reward for Bitcoin miners is cut in half to help the asset&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-26T12:21:51.000Z",
    "title": "EU’s ESMA edges closer to crypto regulations with latest MiCA report; seeks public feedback",
    "url": "https://crypto.news/eus-esma-edges-closer-to-crypto-regulations-with-latest-mica-report-seeks-public-feedback/",
    "description": "The European Securities and Markets Authority (ESMA) has moved to the final phase of establishing a regulated environment for crypto assets in the EU with the publication of its latest report on the Markets in Crypto Assets (MiCA) regulation.&#160; The&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-26T12:19:37.000Z",
    "title": "South Korean police nab fraudsters in $4.1m crypto scam",
    "url": "https://crypto.news/south-korean-police-nab-fraudsters-in-4-1m-crypto-scam/",
    "description": "South Korean police apprehended a pair of fraudsters who stole 5.5 billion won ($4.1 million) from a senior man under the guise of profitable crypto investments. The Haeundae Police Station in Busan, South Korea, caught two people in their 20s&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-26T12:17:12.000Z",
    "title": "Binance joins Global Travel Rule Alliance to comply with FATF",
    "url": "https://crypto.news/binance-joins-global-travel-rule-alliance-to-comply-with-fatf/",
    "description": "Crypto exchange Binance has joined the Global Travel Rule alliance to combat financial crimes like money laundering and terrorist financing. In a blog announcement on Mar. 26, Binance disclosed its membership in the Global Travel Rule (GTR) Alliance, aimed at&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-26T12:30:17.000Z",
    "title": "Crypto Outflows Reach New Record High, Will The Bitcoin Decline Continue?",
    "url": "https://www.newsbtc.com/crypto/crypto-outflows-bitcoin-decline/",
    "description": "Crypto investment products have finally registered a week of outflows after seven weeks of consecutive strong inflows and two weeks of breaking records after records. In fact, data has shown that these investment products have now set a new record for the most outflows in a week, extending the run of record creation. According to data from CoinShares, investors pulled out $942 million from crypto investment products last week to wipe $10 billion off total assets under management (AuM). Interestingly, a larger part of this outflow came from Bitcoin, as Spot Bitcoin ETFs in the US registered outflows every day.  Crypto Outflows Reach New Record High CoinShares&#8217; weekly report on digital investment funds has revealed crypto investment products have been witnessing an influx of money for the past two months. Consequently, these products registered a seven-week run of inflows totaling $12.3 billion. Bitcoin, the largest cryptocurrency, received most of these inflows, which helped push its price to a new all-time high. Related Reading: 7 Days Of Crypto: Key Events That You Should Keep An Eye On This Week However, last week told a different tale for Bitcoin&#8217;s investment products, as Spot Bitcoin ETFs in the US registered a weak $1.1 billion in inflows which was unable to offset Grayscale’s significant $2 billion outflows. As a result, Bitcoin investment products witnessed outflows of $904 million throughout last week. Short Bitcoin products also witnessed minor outflows of $3.7 million. The negative sentiment flowed to other investment products such as Ethereum, Solana, Cardano, and multi-asset products witnessed outflows of $34.2 million, $5.6 million, $3.7 million, and $7.3 million, respectively. On the other hand, Litecoin, XRP, and Polkadot saw an increase in their respective inflows of $2 million, $1.2 million, and $5 million. Lastly, the total trading volume fell to $28 billion, two-thirds of the prior week.  In terms of region, the USA had the most outflows of $860 million. Sweden and Switzerland followed with $36.9 million and $25.2 million respectively. According to CoinShares, the reversal into a poor sentiment was largely due to hesitancy from investors. What’s Next For Bitcoin? Interestingly, last week&#8217;s outflow from Spot Bitcoin ETFs coincided with a drastic drop in the price of Bitcoin with the cryptocurrency falling to as low as $61,370. This shows how much influence these funds now have over the price of Bitcoin. Last week&#8217;s actions show investors seem to be hitting pause on their enthusiasm for spot bitcoin ETFs. Whether that pause lasts for weeks or longer remains to be seen. Related Reading: Why Is The Price Of LUNC And USTC Up Today? However, sentiment can shift quickly in the cryptocurrency market and recent price action shows the industry might be returning to bullish mode. According to data from BitMEX Research, Spot Bitcoin ETFs registered a day of net inflows yesterday. Net inflow recorded was $15.7 million, the lowest inflow day since January 26. Bulls have now taken over to push the price of Bitcoin by 5.38% in the past 24 hours. At the time of writing, Bitcoin is trading at $70,676 and could reach $73,000 again very soon. BTC price drops from $71,000 &#124; Source: BTCUSD on Tradingview.com Featured image from Atlantic Council, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-26T12:20:19.000Z",
    "title": "Buying IOTA Made Easy for 160+ Countries: Bloom Wallet Now Supports Direct Purchase via Transak",
    "url": "https://www.crypto-news-flash.com/buying-iota-made-easy-for-160-countries-bloom-wallet-now-supports-direct-purchase-via-transak/?utm_source=rss&utm_medium=rss&utm_campaign=buying-iota-made-easy-for-160-countries-bloom-wallet-now-supports-direct-purchase-via-transak",
    "description": "<img width=\"1572\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-logo-with-translucent-world-map-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"IOTA-logo-with-translucent-world-map-background.\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-logo-with-translucent-world-map-background.jpg 1572w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-logo-with-translucent-world-map-background-300x229.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-logo-with-translucent-world-map-background-1024x782.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-logo-with-translucent-world-map-background-768x586.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-logo-with-translucent-world-map-background-1536x1173.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-logo-with-translucent-world-map-background-150x115.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-logo-with-translucent-world-map-background-450x344.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/IOTA-logo-with-translucent-world-map-background-1200x916.jpg 1200w\" sizes=\"(max-width: 1572px) 100vw, 1572px\" />Bloom&#8217;s integration with Transak enables users to easily purchase IOTA from their wallets, enhancing accessibility and utility. With the increasing demand for seamless fiat-to-crypto onboarding options, Bloom&#8217;s collaboration with Transak allows users from 170 countries to easily buy cryptocurrency through its desktop wallet. In the latest development, the Bloom wallet has announced its integration with [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-26T12:21:00.000Z",
    "title": "Worldcoin (WLD) Jumps Over 9% with New Custody Feature Launch",
    "url": "https://coinedition.com/worldcoin-wld-jumps-over-9-with-new-custody-feature-launch/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/09/WORLDCOIN-3-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>With the launch of its Personal Custody feature, Worldcoin (WLD) has seen a notable increase in value, surging to a seven-day high in the last 24 hours. During the rally, WLD’s price swayed between an intra-day high and low of $8.35 and $9.45, respectively. At press time, the bullish momentum was still in control of [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/worldcoin-wld-jumps-over-9-with-new-custody-feature-launch/\">Worldcoin (WLD) Jumps Over 9% with New Custody Feature Launch</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]