[
  {
    "source": "Cointelegraph",
    "date": "2023-07-16T02:12:46.000Z",
    "title": "SEC could be waiting ‘years’ to file appeal in Ripple case: Brad Garlinghouse",
    "url": "https://cointelegraph.com/news/sec-file-appeal-ripple-case-brad-garlinghouse",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/1c52cdcd-4fbc-403c-9d95-d530630494e9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to Ripple CEO Brad Garlinghouse, the filing of an appeal by the SEC would “only further” solidify Judge Torres decision that XRP is not a security.</p>\n                    <p><p>Ripple CEO Brad Garlinghouse believes the United States Securities and Exchange Commission (SEC) will face a prolonged process before having the chance to appeal Judge’s Torres favorable ruling in the case against Ripple. </p><p>On July 13, Judge Torres ruled partially in <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">favor of Ripple Labs</a> in a case brought forth by the Securities and Exchange Commission in 2020, ruling that the XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) token is not a security, in regard to retail sales on digital asset exchanges. </p><p>However, Torres ruled that XRP is a security when sold to institutional investors, as it met the conditions set in the Howey Test. </p><p>In an <a href=\"https://www.youtube.com/watch?v=xXh6bxKBkZ8\" target=\"_blank\" rel=\"noopener nofollow\">interview</a> with Bloomberg on July 15, Garlinghouse stated that the institutional sales were \"the smallest piece\" of the lawsuit, and if the SEC were to file an appeal against retail sales, it would “only further” solidify the decision that Judge Torres made. </p><p>Garlinghouse noted that it could be a while before the SEC can file an appeal.</p><blockquote>“As a matter of law, the law of the land right now is that XRP is not a security. Until there is an opportunity for the SEC to file an appeal, which would take years, frankly we are very optimistic.”</blockquote><p>Garlinghouse emphasized that this is the “first time” the SEC has lost a \"crypto case.\" He believes that it is because the SEC has “been a bully” and gone after “weak players” who weren’t able to “mount a proper defense.”</p><p>He also noted that <a href=\"https://cointelegraph.com/news/ripple-xrp-price-market-cap-jumps-sec-ruling\">when the case against Ripple</a> was first filed, a lot of the crypto exchanges in the U.S. had the attitude of waiting to “see what happens,” due to uncertainty.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/xrp-holders-celebrate-ripple-win-victory-sec-case\"><strong><em>XRP ruling a ‘watershed moment,’ but we’re not out of the woods yet — Lawyers</em></strong></a></p><p>This is because the SEC “sowed” confusion in the market, according to Garlinghouse.</p><p>“They knew there was confusion, and they actually did things that they knew would increase confusion” he stated.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We said in Dec 2020 that we were on the right side of the law, and will be on the right side of history. Thankful to everyone who helped us get to today’s decision – one that is for all crypto innovation in the US. More to come.</p>&mdash; Brad Garlinghouse (@bgarlinghouse) <a href=\"https://twitter.com/bgarlinghouse/status/1679520607837253639?ref_src=twsrc%5Etfw\">July 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>He stated that this “confusion” actually masquerades as “power” to the SEC, but has prevented innovation from happening in the U.S.</p><p>“The SEC has been trying to put power and politics over what is really just sound policy and providing clear rules of the road” he stated, adding:</p><blockquote>\"Such that entrepreneurs and investors can participate in this amazing new market around crypto and blockchain technologies.”</blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/xrp-is-not-a-security-celsius-ceo-arrested-on-criminal-charges-hodlers-digest-july-9-15/\"><strong><em>XRP is not a security, Celsius CEO arrested on criminal charges, and more: Hodler’s Digest, July 9-15</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]