[
  {
    "source": "Cointelegraph",
    "date": "2023-06-02T02:16:30.000Z",
    "title": "Nike NFTs to make their way into EA Sports games and its millions of fans",
    "url": "https://cointelegraph.com/news/nike-nft-swoosh-ea-sports-games",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/8336e61e-dbd3-4af4-a818-84abffc940fe.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Nike’s “virtual creations” will be integrated into EA Sports games in the coming months.</p>\n                    <p><p>In a major step towards mainstream gamer adoption for crypto, Nike’s nonfungible token (NFT) platform .Swoosh will soon be integrated with EA Sports games, potentially allowing Nike's virtual footwear and apparel to appear in games.</p><p>In a June 1 <a href=\"https://about.nike.com/en/newsroom/releases/nike-virtual-studios-dot-swoosh-ea-sports-partnership\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, Nike said that its “virtual creations” — its way of saying NFTs — will start being incorporated into EA Sports games in the coming months, though neither Nike or Electronic Arts (EA) has revealed which game titles will include Nike’s virtual goods. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">And that does it for the launch of the OF1 Collection. <br><br>Thank you to all of the 50K+ .SWOOSH members who participated. <br><br>We&#39;ll be back tomorrow with a recap of all things OF1. <br><br>Oh, and we have a special announcement coming at 8am PDT. <br><br>Until tomorrow .SWOOSH fam </p>&mdash; .SWOOSH (@dotSWOOSH) <a href=\"https://twitter.com/dotSWOOSH/status/1664165129657913351?ref_src=twsrc%5Etfw\">June 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>EA Sports games include FIFA — which was awarded the title of “most popular game” in 2022 — as well as Madden NFL series and the NBA Live series, all of which attract millions of gamers. It’s expected that Nike NFTs will be customizable wearable add-ons that players can purchase and alter their character avatars in-game. </p><p>\"This partnership will allow us to unlock some incredible new experiences for our .SWOOSH community and the massive EA SPORTS fan base,\" said Ron Faris, general manager of Nike Virtual Studios. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">EA SPORTS  <a href=\"https://twitter.com/dotSWOOSH?ref_src=twsrc%5Etfw\">@dotSWOOSH</a><a href=\"https://t.co/hNxxdaMgRL\">https://t.co/hNxxdaMgRL</a> <a href=\"https://t.co/NH8vp0fWoQ\">pic.twitter.com/NH8vp0fWoQ</a></p>&mdash; EA SPORTS (@EASPORTS) <a href=\"https://twitter.com/EASPORTS/status/1664287614784897028?ref_src=twsrc%5Etfw\">June 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Nike first <a href=\"https://cointelegraph.com/news/nike-unveils-nft-platform-nifty-newsletter-nov-9-15\">unveiled its .swoosh NFT platform</a> in November 2022, but didn’t release an NFT collection until the beginning of 2023. </p><p>It was on May 15 when .Swoosh released its first NFT collection, a line of virtual shoes called Our Force 1, a not-so-subtle nod to the brand’s iconic Air Force One line of sneakers. At the time of publication, more than 97,000 of the sneaker NFTs have been sold to just under 53,000 addresses, according to data from <a href=\"https://polygonscan.com/token/0x851d5fa26636df46b6196879582324c311556b46\" target=\"_blank\" rel=\"noopener nofollow\">Polygonscan</a>.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/nft-collections-take-massive-price-hit-in-2023-nifty-newsletter-may-24-30\"><strong><em>NFT collections take massive price hit in 2023: Nifty Newsletter, May 24–30</em></strong></a></p><p>In December 2021, <a href=\"https://cointelegraph.com/news/just-did-it-nike-enters-the-metaverse-game-following-rtfkt-acquisition\">Nike entered the Metaverse</a> through the acquisition of virtual sneakers and collectibles brand RTFKT. It also launched the virtual world Nikeland.</p><p>While .Swoosh uses similar tools and technologies to RTFKT and Nikeland, all three are individual projects for the company.</p><p><a href=\"https://cointelegraph.com/magazine/rich-rekt-rich-again-nft-creator-trevor-jones-right-royal-nfts/\"><strong><em>NFT Creator: Top 10 crypto artist Trevor Jones on being rich, rekt and rich again</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-02T02:16:00.000Z",
    "title": "Bitcoin ($BTC) and Ethereum ($ETH) Investment Products Lose AUM in May, But Some Asset Managers Thrive",
    "url": "https://www.cryptoglobe.com/latest/2023/06/bitcoin-btc-and-ethereum-eth-investment-products-lose-aum-in-may-but-some-asset-managers-thrive/",
    "description": "May was the first month of 2023 that saw a decline in the assets under management (AUM) of both Bitcoin ($BTC) and Ethereum ($ETH) investment products, which dropped 10.3% and 4.42% respectively, resulting in values of $21.7 billion and $7.50 billion. Other digital assets and mixed asset baskets followed suit, declining 12.04% to $958 million […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T02:31:03.000Z",
    "title": "Making Passive Income In Crypto: Ethereum and Avalanche’s Liquid Staking vs. Caged Beasts’ Referral System",
    "url": "https://www.cryptopolitan.com/making-passive-income-in-crypto-ethereum-and-avalanches-liquid-staking-vs-caged-beasts-referral-system/",
    "description": "Are you looking for ways to make passive income in crypto? This article should be of some help to you as we discuss liquid staking and referral systems, two popular ways to make passive income. In this article, we’ll discuss Ethereum and Avalanche’s liquid staking processes, as well as introduce Caged Beasts&#8217; (BEASTS) referral system. ... <a title=\"Making Passive Income In Crypto: Ethereum and Avalanche’s Liquid Staking vs. Caged Beasts’ Referral System\" class=\"read-more\" href=\"https://www.cryptopolitan.com/making-passive-income-in-crypto-ethereum-and-avalanches-liquid-staking-vs-caged-beasts-referral-system/\" aria-label=\"More on Making Passive Income In Crypto: Ethereum and Avalanche’s Liquid Staking vs. Caged Beasts’ Referral System\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-02T02:35:24.000Z",
    "title": "Bitcoin Price Faces Confluence of Bearish Factors And Could Decline Heavily",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-confluence-27500/",
    "description": "Bitcoin price is consolidating above the $26,500 support. BTC could decline heavily if there is a clear move below the $26,500 support. Bitcoin is still struggling to stay above the $26,500 support zone. The price is trading below $27,250 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance near $27,220 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could correct higher, but upsides might be contained above the $27,500 resistance. Bitcoin Price Holds Support Bitcoin price remained in a bearish zone below the $27,500 resistance zone. BTC failed to recover and started another decline below $27,000. There was a spike below the $26,550 support zone but the bulls were active near $26,500. A low is formed near $26,500 and the price is now consolidating losses. It is testing the 23.6% Fib retracement level of the main drop from the $28,450 swing high to the $26,500 low. Bitcoin price is now trading below $27,250 and the 100 hourly Simple moving average. There is also a key bearish trend line forming with resistance near $27,220 on the hourly chart of the BTC/USD pair. Immediate resistance on the upside is near the $27,000 level and the trend line. The next major resistance is near the $27,500 level and the 100 hourly Simple moving average. It is close to the 50% Fib retracement level of the main drop from the $28,450 swing high to the $26,500 low. Source: BTCUSD on TradingView.com An upside break and close above $27,500 could start a decent increase toward $28,000. Any more gains above the $28,000 resistance zone might send the price toward the $28,500 resistance zone or even $29,200. More Losses in BTC? If Bitcoin’s price fails to clear the $27,200 resistance, it could continue to move down. Immediate support on the downside is near the $26,560 level. The next major support is near the $26,500 zone, below which the price might start a strong decline. In the stated case, the price could drop toward the $25,500 support in the coming sessions. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is below the 50 level. Major Support Levels – $26,550, followed by $26,500. Major Resistance Levels – $27,200, $27,400, and $27,500."
  }
]