[
  {
    "source": "CoinDesk",
    "date": "2023-12-05T16:55:45.000Z",
    "title": "BlackRock, Bitwise File Updated Applications for Spot Bitcoin ETF",
    "url": "https://www.coindesk.com/business/2023/12/05/blackrock-bitwise-file-updated-application-for-spot-bitcoin-etf/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Asset manager BlackRock and crypto investment firm Bitwise both filed amended S1 forms with the Securities and Exchange Commission (SEC) on Monday, answering further questions likely asked by the regulator in earlier conversations."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-05T17:05:43.000Z",
    "title": "Best in Show? Solana's BONK Joins Dogecoin and SHIB as Top Dog Coins",
    "url": "https://decrypt.co/208668/best-show-solana-bonk-joins-dogecoin-shib-top-dog-coins",
    "description": "Capping off a month of historic gains, the BONK token amassed a market cap large enough to dethrone Elon Musk-themed coin FLOKI."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-05T17:01:02.000Z",
    "title": "Helium Mobile Service That Lets Users Earn Crypto Expands Across US",
    "url": "https://decrypt.co/208666/helium-mobile-service-lets-users-earn-crypto-expands-across-us",
    "description": "Helium Mobile, powered by a decentralized network of 5G antennas through crypto token incentives on Solana, is rolling out nationwide."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-05T17:05:13.000Z",
    "title": "Swiss city Lugano to accept Bitcoin, Tether for tax payments",
    "url": "https://cryptoslate.com/swiss-city-lugano-to-accept-bitcoin-tether-for-tax-payments/",
    "description": "<p>Lugano, Switzerland, has broadened its tax and community fee payment options to include the option to pay in cryptocurrencies, including Bitcoin (BTC) and Tether&#8217;s USDT stablecoin, according to a Dec. 5 statement. The transactions will be facilitated by Bitcoin Suisse, a Swiss crypto gateway provider, that would enable citizens and institutions to settle invoices issued [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/swiss-city-lugano-to-accept-bitcoin-tether-for-tax-payments/\">Swiss city Lugano to accept Bitcoin, Tether for tax payments</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-05T17:00:11.000Z",
    "title": "Hashdex predicts spot Bitcoin ETFs trading timeline",
    "url": "https://www.cryptopolitan.com/hashdex-bitcoin-etfs-trading-timeline/",
    "description": "Hashdex, a prominent player among the 13 asset managers competing for the approval of a Bitcoin exchange-traded fund (ETF) spot in the United States, has set its sights on the second quarter of 2024 for the potential launch of the first spot Bitcoin ETF in the country. In addition to this, the company anticipates the ... <a title=\"Hashdex predicts spot Bitcoin ETFs trading timeline\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hashdex-bitcoin-etfs-trading-timeline/\" aria-label=\"More on Hashdex predicts spot Bitcoin ETFs trading timeline\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-05T16:59:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-05T16:49:48.000Z",
    "title": "Block Race Codes Guide: Unlocking Free Crystals for Ultimate Parkour Success",
    "url": "https://www.cryptopolitan.com/block-race-codes-guide-unlock-free-crystals/",
    "description": "Roblox enthusiasts diving into the adrenaline-fueled world of Block Race are in for a treat with exclusive codes that unlock valuable in-game items. This guide offers a concise walkthrough on how to redeem Block Race codes, what rewards to expect, and where to find the latest codes. As the game continues to evolve, players can ... <a title=\"Block Race Codes Guide: Unlocking Free Crystals for Ultimate Parkour Success\" class=\"read-more\" href=\"https://www.cryptopolitan.com/block-race-codes-guide-unlock-free-crystals/\" aria-label=\"More on Block Race Codes Guide: Unlocking Free Crystals for Ultimate Parkour Success\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-05T16:49:43.000Z",
    "title": "Spanish national nabbed for aiding sanctions evasion via crypto",
    "url": "https://www.cryptopolitan.com/spanish-national-aiding-sanctions-evasion/",
    "description": "Alejandro Cao de Bens found himself in Spanish custody last Friday after Interpol alerted local authorities about his possible presence in the country. The US issued an arrest warrant for Cao de Bens in 2022, accusing him of collaborating with a US citizen to provide cryptocurrency and blockchain services to North Korea, a violation of ... <a title=\"Spanish national nabbed for aiding sanctions evasion via crypto\" class=\"read-more\" href=\"https://www.cryptopolitan.com/spanish-national-aiding-sanctions-evasion/\" aria-label=\"More on Spanish national nabbed for aiding sanctions evasion via crypto\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-05T17:02:20.000Z",
    "title": "Analyst believes Dogecoin is ‘about to go crazy’",
    "url": "https://crypto.news/analyst-believes-dogecoin-is-about-to-go-crazy/",
    "description": "The analyst believes Dogecoin is set to break out imminently based on data showing increased investor interest and holders in a profitable position."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-05T16:55:48.000Z",
    "title": "Crypto AI token OLAS up 65% over last seven days",
    "url": "https://crypto.news/crypto-ai-token-olas-up-65-over-last-seven-days/",
    "description": "OLAS recorded gains of over 65% within a week, likely spurred by general news surrounding artificial intelligence and hype for AI-themed cryptocurrencies."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-05T16:46:37.000Z",
    "title": "Pando joins U.S. spot Bitcoin ETF race with newest filing",
    "url": "https://crypto.news/pando-joins-u-s-spot-bitcoin-etf-race-with-newest-filing/",
    "description": "In a Dec. 5 post from Bloomberg Intelligence analyst James Seyffart, Swiss asset manager Pando was announced as an official entrant into the competition for a US spot Bitcoin ETF, filing a 19b-4 through the Chicago Board Options Exchange."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-05T17:00:43.000Z",
    "title": "Bitcoin Rises To $41,000: How Much Profit Has Microstrategy Made On Its BTC Bet?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-microstrategy-btc-bet/",
    "description": "MicroStrategy has become one of the top gainers of the recent Bitcoin bullish trend, and the analytics provider has secured billions in gains after disregarding naysayers to make a long-running bet on Bitcoin. MicroStrategy Massive Bitcoin Bet Hits Gold Leading provider of enterprise analytics and mobility software, MicroStrategy is riding the early wave of the anticipated Bitcoin bull run. The analytics provider has seen the profit on its billion-dollar BTC bet rise to $2 billion following Bitcoin’s rise from below $38,000 during the weekend to over $41,000 this week.  Related Reading: Shiba Inu Open Interest Falls Behind General Crypto Market, What This Means For Price According to Simply Bitcoin, an X (formerly Twitter) handle, Michael Saylor, the former CEO and Executive Chairman of MicroStrategy has revealed approximately 174,530 BTC in the company’s BTC portfolio. This makes the business intelligence company presently the largest corporate Bitcoin holder globally.  Around late November, Saylor announced that the company had purchased another $593.3 million worth of Bitcoin at an average price of $36,785 per BTC. Due to Bitcoin skyrocketing to $41,000 highs this week, the company has made profits of $11,460 per Bitcoin with an average price of $30,252 on its massive Bitcoin stash. Not only has the company gained massively from its large-scale Bitcoin investment, but MicroStrategy’s stocks (MSTR) went up by 8.2% following its purchase in November. MSTR shares were trading over 4% higher on Monday and its present market cap has hit $8.18 billion. The shares are up by 6.74% at the time of writing and with Bitcoin still maintaining its positive sentiment, there may be additional gains in the future.  BTC bulls maintain control on price &#124; Source: BTCUSD on Tradingview.com Bitcoin Claims 10th Spot In Global Asset Market Cap Following its spike to $41,000, Bitcoin’s rank in the top global assets market capitalization went up significantly, surpassing the formidable Berkshire Hathaway, an American multinational conglomerate, led by billionaire investor Warren Buffet.  According to Companies Market Cap data, Berkshire Hathaway’s market cap at the time of writing is approximately $776.75 billion and down by 0.11%. In contrast, Bitcoin’s market cap is up by 0.43% and has surged to $816.30 billion.  Related Reading: Ethereum Turns Deflationary With Over 106,000 ETH Burned In A Single Month The cryptocurrency is a few billion away from surpassing Meta Platforms (Facebook), which has a market cap of $822.40 billion and is ranked at the 9th position on the top asset market cap list. Bitcoin presently ranks as the 10th top asset by market cap in the world. The cryptocurrency has seen its price spike triggered by a myriad of factors including the potential approval of Spot Bitcoin ETFs, the hopeful sentiment surrounding US rate hikes by the Federal Reserve, and the upcoming Bitcoin halving in 2024. Featured image from CryptoBriefing, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-05T17:02:00.000Z",
    "title": "India Unveils AML and CFT Rules Applicable to Overseas Exchanges",
    "url": "https://coinedition.com/india-unveils-aml-and-cft-rules-applicable-to-overseas-exchanges/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Indias_Crypto_Community_to_Swell_to_156_Million_Users_in_2023.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"India Unveils AML and CFT Rules\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Indias_Crypto_Community_to_Swell_to_156_Million_Users_in_2023.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Indias_Crypto_Community_to_Swell_to_156_Million_Users_in_2023-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Indias_Crypto_Community_to_Swell_to_156_Million_Users_in_2023-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Indias_Crypto_Community_to_Swell_to_156_Million_Users_in_2023-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Indias_Crypto_Community_to_Swell_to_156_Million_Users_in_2023-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Indias_Crypto_Community_to_Swell_to_156_Million_Users_in_2023-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Indian government, under the Ministry of Finance, has tackled the regulation of overseas crypto exchange platforms and Virtual Digital Assets (VDAs) catering to Indian users. Per a disclosure from the government dated December 4, the Anti-Money Laundering (AML) and Countering of Financial Terrorism (CFT) guidelines are now enforceable on offshore exchanges serving the Indian [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/india-unveils-aml-and-cft-rules-applicable-to-overseas-exchanges/\">India Unveils AML and CFT Rules Applicable to Overseas Exchanges</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]