[
  {
    "source": "Cointelegraph",
    "date": "2023-11-01T02:15:20.000Z",
    "title": "Oyster Protocol founder gets 4 years jail for $5.5M tax evasion",
    "url": "http://cointelegraph.com/news/oyster-protocol-founder-jailed-crypto-tax-evasion",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/e3689b2f-b1ee-4d36-8910-3e8624d9c25c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>31-year-old Oyster Protocol founder Amir Bruno Elmaani — aka “Bruno Block” — has been sentenced to four years imprisonment for tax evasion.</p>\n                    <p><p>Amir Bruno Elmaani, the 31-year-old founder of the now-defunct cryptocurrency scheme Oyster Protocol has been handed the maximum sentence of four years in prison for tax evasion.</p><p>The United States Attorney’s Office <a href=\"https://www.justice.gov/usao-sdny/pr/cryptocurrency-founder-bruno-block-sentenced-four-years-prison\" target=\"_blank\" rel=\"noopener nofollow\">said</a> on Oct. 31 that Elmaani — also known by the alias “Bruno Block” — was sentenced to prison following his April 6 guilty <a href=\"https://www.justice.gov/usao-sdny/pr/cryptocurrency-founder-bruno-block-pleads-guilty-tax-crimes\" target=\"_blank\" rel=\"noopener nofollow\">plea</a> where he admitted to secretly minting and selling Pearl tokens while not paying income tax on a swathe of profits from the project.</p><p>Elmaani admitted that he caused tax losses of over $5.5 million. </p><p>“Amir Elmaani violated the duty he owed to pay taxes on millions of dollars of cryptocurrency profits, and he also violated the trust of investors in the cryptocurrency he founded,” said District Attorney Damian Williams in relation to the sentencing. </p><p>Between September and October 2017, Elmaani promoted a cryptocurrency called Pearl (PRL), marketed as a way for investors to purchase data on a blockchain-based data storage platform called Oyster Protocol. </p><p>However, under the nose of the Oyster Protocol’s team and investors, Elmaani secretly minted a mass of new PRL tokens and dumped them on the market for his own personal gain in October 2018.</p><p>“On or about October 29, 2018, I used the smart contract to mint new PRL, without telling anyone, including others who worked on the Oyster Protocol project. I then sold these newly minted PRL on a digital trading platform,” Elmaani admitted in his plea agreement. </p><p>“I was aware that the counterparties who were buying these newly-minted PRL likely were not aware of my reopening of the smart contract and did not know that I had just substantially increased the total supply of PRL,” he added. </p><p>Despite raking in millions of dollars from the exit scheme, Elmaani filed a tax return in 2017 claiming he had only earned a total of $15,000 from a patent design business and reported zero income to the tax authorities in 2018. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/low-income-oyster-protocol-founder-allegedly-has-10m-yacht-full-of-gold-bars\"><strong><em>'Low income' Oyster Protocol founder allegedly has $10M yacht full of gold bars</em></strong></a></p><p><a href=\"https://cointelegraph.com/news/low-income-oyster-protocol-founder-allegedly-has-10m-yacht-full-of-gold-bars\"><strong><em></em></strong></a>The court found that in 2018, Elmaani spent more than $10 million on multiple yachts, $1.6 million at a carbon-fiber composite company, hundreds of thousands of dollars at home improvement stores and more than $700,000 to purchase two homes. </p><p>One home was purchased through a shell company, the other was under the names of two of Elmaani’s associates. He also “dealt substantially” in precious metals and <a href=\"https://cointelegraph.com/news/low-income-oyster-protocol-founder-allegedly-has-10m-yacht-full-of-gold-bars\">kept gold bars in a safe on one of the yachts</a> he owned.</p><p>“In truth, Elmaani did not report or pay tax on any of his cryptocurrency proceeds. At various points, Elmaani used friends and family as nominees to receive cryptocurrency proceeds and transfer them or U.S. currency to his own accounts,” the DoJ said. </p><p>In addition to his four-year prison sentence, Elmaani was sentenced to one year of supervised release and was ordered to pay $5.5 million in restitution.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethereum-restaking-blockchain-dangerous/\"><strong><em>Ethereum restaking — Blockchain innovation or dangerous house of cards?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]