[
  {
    "source": "BTCManager",
    "date": "2024-01-29T21:36:39.000Z",
    "title": "Trust Wallet discloses Jan. 17 third-party breach",
    "url": "https://crypto.news/trust-wallet-discloses-jan-17-third-party-breach/",
    "description": "Hackers attacked a Binance-backed Trust Wallet on Jan. 17 but failed to compromise any meaningful customer data thanks to the provider’s quick reaction."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-29T21:21:19.000Z",
    "title": "Google ends five-year ban on crypto ads, as Bitcoin ETF ads pop up",
    "url": "https://crypto.news/google-ends-five-year-ban-on-crypto-ads-as-bitcoin-etf-ads-pop-up/",
    "description": "BlackRock and VanEck have started advertising campaigns for its spot Bitcoin ETFs on Google, as its previously announced ad policy update took place today. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-29T21:30:11.000Z",
    "title": "Renowned Crypto Expert Reveals Top 3 Altcoins Ready To Breakout In February 2024",
    "url": "https://www.newsbtc.com/altcoin/crypto-altcoins-february-2024/",
    "description": "A prominent crypto analyst and Bitcoin enthusiast, Michael Van de Poppe, has shared insights on the future trajectory of several altcoins in the space. The crypto analyst’s predictions highlight crucial moments for investors as they watch out for opportune times to buy and sell cryptocurrencies in this dynamic market.  Altcoins Set To Rise In 2024 Following the approval of Spot Bitcoin ETFs, Bitcoin experienced a substantial surge, rallying to overcome the $45,000 price mark. During this bullish momentum, the prices of several altcoins, including Ethereum (ETH) and Solana (SOL), also witnessed significant increases.  Related Reading: Crypto Analyst Says February Will Be A Bullish Month For Bitcoin, Here’s Why In a recent X (formerly Twitter) post, Poppe revealed major altcoins to buy or sell in 2024. The crypto analyst shared a chart illustrating the historical price movements and corrections of Solana, Polygon (MATIC) and Chainlink (LINK).  Poppe revealed that Solana’s consolidation phase appears to have ended after it experienced a major decline from its 2023 peak of over $123 to $95.81 at the time of writing. His analysis suggests that Solana is poised for a higher time frame support test at $80 and is anticipated to surge to new highs, potentially reaching $140.  Subsequently, the crypto analyst presented a historical performance chart of MATIC, the native token of Polygon. Noting that the cryptocurrency has maintained higher time frame support levels with established liquidity, Poppe predicts an upcoming upward movement despite MATIC’s recent underperformance.  He forecasts that MATIC’s next rally could propel its price to a range between $1.25 and $1.50. As of now, the price of MATIC is trading at $0.789, reflecting a 2.39% decline in the past 24 hours, according to CoinMarketCap.  The Bitcoin enthusiast also anticipates a substantial price increase for Chainlink’s native token, LINK. The crypto analyst revealed that the cryptocurrency has consistently held crucial price levels and is positioned for an upward momentum towards $25. At the time of writing, the price of LINK stands at $14.65, representing a 0.12% increase in the last 24 hours.  Underperforming Crypto In 2024 In his X post, Poppe unveiled a roster of altcoins that has been struggling to surge and maintain crucial resistance levels. The crypto analyst pointed out that Ethereum’s recent slow growth has adversely impacted many altcoins, causing them to experience further declines.  Related Reading: Bitcoin Whales Increase Their Holdings By $3 Billion – Is A Price Surge Imminent? He mentioned Synthetix (SNX), which is currently depreciating primarily due to Ethereum’s lagging performance. Additionally, there is Arbitrum (ARB) and Polkadot (DOT), which Poppe predicts would have a significant price increase in the future.  The Bitcoin enthusiast stated that if ARB can return to a price level of around $1.40 and $1.60, it could open up new entries into a more sustainable position. Subsequently, Poppe predicts a rise in the price of Polkadot to $15 despite its current price trading at $6.80.  The crypto analyst revealed that DOT is currently showcasing a “great weekly candle”, and its previous price corrections present a great opportunity for investors in the ongoing bull market.  Total market cap at $1.57 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com Featured image from Busha, chart from Tradingview.com"
  }
]