[
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T03:56:37.000Z",
    "title": "Vietnam Welcomes Nvidia’s Investment in AI Chips, Paving the Way for Semiconductor Advancements",
    "url": "https://www.cryptopolitan.com/vietnam-nvidias-investment-in-ai-chips/",
    "description": "Vietnam is gearing up to position itself at the forefront of the semiconductor and AI industries. Minister of Planning and Investment Nguyen Chi Dung, on December 11, extended an invitation to Nvidia, a leading US chip giant, to invest in the country&#8217;s semiconductor and AI projects. With an emphasis on collaboration and development, this move [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-13T04:00:28.000Z",
    "title": "Is Trader Joe (JOE) A Hidden Gem Poised to Outperform Uniswap (UNI)?",
    "url": "https://www.newsbtc.com/news/defi/trader-joe-gem-outperform-uniswap/",
    "description": "In decentralized finance (DeFi) and trading, Uniswap has long reigned as a dominant force. However, a recent analysis by Lark Davis, a Bitcoin (BTC) investor, seems to suggest Trader Joe, a decentralized exchange (DEX) on Avalanche&#8211;a highly scalable blockchain and Ethereum&#8217;s competitor, could eventually emerge as a formidable competitor, even overtaking Uniswap. Is Trader Joe Undervalued Relative To Uniswap? In a post on X on December 12, Davis noted a discrepancy in the relative valuation between JOE and UNI, which serve as governance tokens of Uniswap and Trader Joe. Specifically, the investors noted that Trader Joe&#8217;s handles around $300 million daily trading volume on Avalanche alone. On the other hand, Uniswap processes approximately $1.6 billion in daily volume across the Ethereum mainnet and Arbitrum, the largest layer-2 platform by total value locked (TVL) by Ethereum. Related Reading: Bitcoin Speed Bump: A Week’s Surge Crumbles In Just 20 Minutes Davis further noted that despite this &#8220;small&#8221; difference in trading volume, Trader Joe&#8217;s has a market capitalization of only $238 million. Meanwhile, Uniswap has a market cap of $3.6 billion, according to CoinMarketCap data.  Even with relatively narrow average trading volume, the huge difference in market capitalization suggests that JOE is significantly undervalued relative to UNI. Accordingly, this gap will likely be narrowed in the future, with JOE appreciating versus UNI, possibly benefiting holders. JOE Yields Versus UNI&#8217;s Governance: Which Token Has An Edge? Davis also pointed out JOE&#8217;s potential, saying the token rewards holders with USDC yields. This is different from UNI, where holders can vote on proposals and nothing else. In the investor&#8217;s preview, besides the undervaluation, this feature could further enhance JOE&#8217;s appeal, even contributing to its upside potential.  Related Reading: Crypto Analyst Predicts Cardano Price Will Rise 6000% To $33, Here’s The Timeline As the crypto market recovers, Avalanche might also present additional advantages to traders and, therefore, Trader Joe. The modern blockchain is scalable and has relatively low fees regardless of network activity. With crypto prices expanding, Ethereum gas fees have been rising in tandem, discouraging mainnet transfers. This has rerouted activity to layer-2s like Arbitrum and competing platforms, including Avalanche.  When writing on December 12, DeFiLlama data shows that Trader Joe has a TVL of $149 million, of which most assets are tied to Avalanche. Only $1 million is on Ethereum. JOE has been on an uptrend, rising 170% from October 2023 lows. The token is cooling off, looking at price action on the daily chart. Feature image from Canva, chart from TradingView"
  }
]