[
  {
    "source": "BTCManager",
    "date": "2024-01-19T11:22:09.000Z",
    "title": "Direxion submits five leveraged spot Bitcoin ETF applications",
    "url": "https://crypto.news/direxion-submits-five-leveraged-spot-bitcoin-etf-applications/",
    "description": "Financial products provider Direxion has filed to register five Bitcoin (BTC) ETFs. Bloomberg analyst James Seyffart reported that on Jan. 18, Direxion filed to register five leveraged Bitcoin ETFs with the U.S. Securities and Exchange Commission (SEC). Direxion&#8217;s documents show&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-19T11:30:24.000Z",
    "title": "Why Did The Bitcoin Price Fall Below $41,000?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-fall-below-41000/",
    "description": "Bitcoin dropped below $41,000 in the last 24 hours before making a recovery to rise above that level once again. This has become the current reality of the flagship crypto token’s price, which has continued to decline since the Spot Bitcoin ETFs were approved. This is surprising considering that these funds were projected to help boost Bitcoin’s price upon launch.  Why Bitcoin’s Price Could Be Dipping Bloomberg analyst James Seyffart provided insight into what could be the reason for Bitcoin’s declining price as he revealed that Grayscale’s GBTC has experienced an outflow of $2.2 billion since its conversion to a Spot Bitcoin ETF. Crypto analytics platform Arkham Intelligence also revealed that Grayscale had moved 9000 BTC from their wallets to Coinbase, suggesting an imminent sale.  Related Reading: Crypto Analyst Predicts XRP Price Will Surge 800% To Reach $5 In The Next 90 Days A sell pressure of such magnitude would no doubt affect Bitcoin’s price, and that seems to be a plausible explanation for why Bitcoin’s price has declined as of late. The CEO of Jan3 and Bitcoiner, Samson Mow, also echoed similar sentiments as he mentioned that the GBTC sell pressure was pushing prices down.  However, Mow believes that this trend “won’t be a long drawn out process,” as he predicts that many of GBTC’s investors won’t be able to offload their stocks because the “tax hit is too big.” JP Morgan will, however, beg to differ as a research report by the bank estimates that up to $3 billion could exit from the GBTC fund with many investors looking to take profit.  Crypto analyst Ash Crypto also recently elaborated on how profit-taking is one of the reasons that GBTC is seeing this significant amount of outflows. He explained that a lot of GBTC investors bought shares in the fund when it was trading at a 40% discount from Bitcoin, and now they are exiting their positions since that discount is now at 0%.  BTC bulls make a play for control &#124; Source: BTCUSD on Tradingview.com Spot Bitcoin ETFs Are Actually Living Up To Hype While Grayscale’s GBTC continues to bleed, other Spot ETFs look to be living up to the hype, with there being an impressive demand for these funds. Nate Geraci, the President of the ETF Store, revealed that two (IBIT and FBTC) out of the nine Spot ETFs (excluding GBTC) already hit $1 billion in assets under management (AUM) just after five trading days.  Related Reading: $245 Million Whale Wakes Up To Threaten XRP Price Recovery Specifically, BlackRock’s IBIT (iShares Bitcoin Trust) was the first to achieve this milestone in just four trading days. Commenting on how impressive this was, Bloomberg analyst Eric Balchunas noted that only two other ETFs ($GLD and $BITO) had done this before now, and none of those funds faced such competition as IBIT did on launch day.   The demand for Spot ETFs is evidently there, seeing that two spot Bitcoin ETFs have already achieved a record that was held by only two other ETFs before now. Featured image from Yahoo Finance, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-19T11:29:52.000Z",
    "title": "ChainGPT facilitates the launch of the GT Protocol, bringing AI-powered auto-trading to crypto",
    "url": "https://www.crypto-news-flash.com/chaingpt-facilitates-the-launch-of-the-gt-protocol-bringing-ai-powered-auto-trading-to-crypto/?utm_source=rss&utm_medium=rss&utm_campaign=chaingpt-facilitates-the-launch-of-the-gt-protocol-bringing-ai-powered-auto-trading-to-crypto",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-19T142437.706.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-19T142437.706.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-19T142437.706-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-19T142437.706-150x84.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-19T142437.706-450x253.png 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Dover, DE, USA and Malaga, Sapin, January 19, 2024 — ChainGPT, the AI-powered Web3 infrastructure providing a diverse suite of tools and services, launches the GT Protocol through its IDO (initial DEX offering) launchpad, ChainGPT Pad. The protocol’s app grants access to CeFi, DeFi, and NFTs within a non-custodial setting, providing secure and transparent asset [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-19T11:27:59.000Z",
    "title": "Crypto’s Next Big Thing: BlackRock’s Bitcoin ETF Soars to $1 Billion in Just One Week",
    "url": "https://www.crypto-news-flash.com/cryptos-next-big-thing-blackrocks-bitcoin-etf-soars-to-1-billion-in-just-one-week/?utm_source=rss&utm_medium=rss&utm_campaign=cryptos-next-big-thing-blackrocks-bitcoin-etf-soars-to-1-billion-in-just-one-week",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BlackRock\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />BlackRock&#8217;s iShares Bitcoin Trust (IBIT) ETF reached $1 billion in assets in its first week, showing strong investor interest. Bitcoin&#8217;s price dropped by 11% since ETF approval, possibly due to investors cashing out after the hype. The historic arrival of Bitcoin exchange-traded funds (ETFs) on Wall Street, spearheaded by financial giant BlackRock, has sparked a [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-19T11:37:21.000Z",
    "title": "How Did Spot Bitcoin ETFs Perform on Day 5?",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/how-did-spot-bitcoin-etfs-perform-on-day-5/",
    "description": "<p>Spot Bitcoin ETFs finished their fifth day of trading with a combined trading value of $13.7 billion. With $1.9 billion worth of funds having changed hands on Thursday.  Online data shows that spot Bitcoin ETF issuers added a net of $440 million worth of Bitcoin to their holdings. Let&#8217;s explore more about this important news. [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/how-did-spot-bitcoin-etfs-perform-on-day-5/\">How Did Spot Bitcoin ETFs Perform on Day 5?</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-19T11:20:30.000Z",
    "title": "Top 7 Arbitrum Coins for the Bull Market – Part 2",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-7-arbitrum-coins-for-the-bull-market-part-2/",
    "description": "<p>With Arbitrum increasing parabolically to a new ATH. It&#8217;s time to explore the top 7 promising projects in its ecosystem. But first, let&#8217;s take a look at why Arbitrum is boosting its ecosystem. Introduction Ethereum has faced challenges due to its increasing popularity, leading to heightened transaction costs and network congestion. While some advocate for [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-7-arbitrum-coins-for-the-bull-market-part-2/\">Top 7 Arbitrum Coins for the Bull Market &#8211; Part 2</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-19T11:10:00.000Z",
    "title": "Grayscale Dumping Bitcoin Holdings? Here’s Why",
    "url": "https://coinedition.com/grayscale-dumping-bitcoin-holdings-heres-why/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/OPPORTUNITIES-AROUND-GBTC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Grayscale Dumping Bitcoin Holdings? Here’s Why\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/OPPORTUNITIES-AROUND-GBTC.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/OPPORTUNITIES-AROUND-GBTC-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/OPPORTUNITIES-AROUND-GBTC-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/OPPORTUNITIES-AROUND-GBTC-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/OPPORTUNITIES-AROUND-GBTC-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/OPPORTUNITIES-AROUND-GBTC-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto influencer and trader known as Ash Crypto shared his perspective on the reasons behind Grayscale “dumping” Bitcoin.&#160; The trader believes that before the spot Bitcoin exchange-traded fund (ETF) approval, the Grayscale Bitcoin Trust (GBTC) used to redeem its shares by providing investors with equivalent value in USD.&#160; Grayscale did so without selling the Bitcoin [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/grayscale-dumping-bitcoin-holdings-heres-why/\">Grayscale Dumping Bitcoin Holdings? Here’s Why</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]