[
  {
    "source": "Decrypt",
    "date": "2023-07-08T18:42:40.000Z",
    "title": "This Week in Coins: Solana Surges as Bitcoin and Ethereum Rally Rebound",
    "url": "https://decrypt.co/147783/this-week-in-coins-solana-surges-bitcoin-ethereum-rebound",
    "description": "Bitcoin hit a one-year high this week before settling back down by Saturday."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-08T18:52:12.000Z",
    "title": "Circle, Tether freeze over half of the $126M assets stolen from Multichain breach",
    "url": "https://cryptoslate.com/circle-tether-freeze-over-half-of-the-126m-assets-stolen-from-multichain-breach/",
    "description": "<p>Circle and Tether have blacklisted five addresses containing $67.5 million worth of assets stolen from Multichain on July 7. USD Coin (USDC) issuer Circle froze three accounts holding $65 million worth of stolen assets, including 63 million USDC, PeckShield tweeted. Tether, which issues USDT stablecoin, froze another two accounts containing 2.53 million USDT, Fantom Foundation [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/circle-tether-freeze-over-half-of-the-126m-assets-stolen-from-multichain-breach/\">Circle, Tether freeze over half of the $126M assets stolen from Multichain breach</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-08T19:00:00.000Z",
    "title": "XRP’s Regulatory Hurdles Will Not Stifle InQubeta (QUBE) and Cardano (ADA) as Growth Surges",
    "url": "https://cryptodaily.co.uk/2023/07/xrps-regulatory-hurdles-will-not-stifle-inqubeta-qube-and-cardano-ada-as-growth-surges",
    "description": "<p class=\"s5\">The crypto market has recently experienced a bearish trend that has concerned many investors. This downturn can largely be attributed to the SEC lawsuits against major exchanges such as Binance and Coinbase, which have caused significant uncertainty.</p>\n<p class=\"s5\">Additionally, the classification of several tokens as securities has raised concerns about the future of established cryptocurrencies. However, despite these challenges, both InQubeta (QUBE) and Cardano (ADA) have defied the odds and continued their upward growth trajectory. Let's take a closer look at these two tokens and explore their features and growth potential.</p>\nInQubeta (QUBE): Dominating the AI Crypto Sector\n<p class=\"s5\">InQubeta (QUBE) has garnered significant attention for its advancements in the AI crypto sector. Here are some notable features that make QUBE a promising investment:</p>\n<p class=\"s5\">1. AI Integration: InQubeta harnesses the power of artificial intelligence within its blockchain ecosystem. This integration allows for enhanced automation, data analysis, and decision-making processes, positioning QUBE at the forefront of innovation in the AI space.</p>\n<p class=\"s5\">2. Diverse Utility: QUBE serves as a utility token within the InQubeta ecosystem, providing access to a wide range of AI-based services and products. These include AI-powered investment strategies, predictive analytics, and personalized recommendations, creating value for token holders.</p>\n<p class=\"s5\">3. Strong Community Support: InQubeta has built a vibrant community of supporters and contributors who actively participate in the project's development. The community's collective knowledge and expertise contribute to the ecosystem's ongoing growth and success.</p>\nDon't Miss the InQubeta Presale\n<p class=\"s5\">Investors should not overlook the ongoing InQubeta (QUBE) presale, as it presents an excellent opportunity to get involved in this promising project. Here are some essential details about the presale:</p>\n<p class=\"s5\">- Successful Presale: The InQubeta presale has already raised over $850,000 within a few weeks of its launch, highlighting the strong interest in the project.</p>\n<p class=\"s5\">- Multiple Payment Options: The presale accepts various payment systems, including popular cryptocurrencies like BTC, USDT, ETH, BNB, and more. This flexibility ensures accessibility and convenience for a wide range of investors.</p>\n<p class=\"s5\">- Inclusive Entry Fee: The presale welcomes participants with a minimum entry fee of $50, making it an inclusive opportunity and promoting decentralized token distribution.</p>\n<p class=\"s5\">- Growth Potential: Experts have predicted that InQubeta (QUBE) has the potential to increase its value by up to 50 times before the end of 2023, making it an enticing investment option for long-term gains.</p>\n<p></p>\nCardano (ADA): A Must-Have in Every Investor's Portfolio\n<p class=\"s5\">Cardano (ADA) is a top cryptocurrency offering unique features and robust fundamentals. Here are some reasons why ADA should be considered a valuable addition to any investor's portfolio:</p>\n<p class=\"s5\">1. Proof-of-Stake (PoS) Protocol: Cardano operates on a PoS consensus mechanism, which ensures scalability, energy efficiency, and security. This approach sets Cardano apart from other cryptocurrencies and positions it for long-term success.</p>\n<p class=\"s5\">2. Smart Contract Capabilities: Cardano is actively developing its smart contract capabilities, which will enable the creation and execution of decentralized applications (dApps) on its blockchain. This positions ADA to compete with established smart contract platforms.</p>\n<p class=\"s5\">3. Robust Ecosystem: Cardano has fostered a vibrant ecosystem with numerous projects, partnerships, and community initiatives. This ecosystem offers a fertile ground for innovation and collaboration, increasing the potential for growth and adoption of ADA.</p>\nConclusion\n<p class=\"s5\">Despite the regulatory challenges faced by the crypto market, both InQubeta (QUBE) and Cardano (ADA) have demonstrated resilience and continued their growth trajectory. InQubeta'sdominance in the AI crypto sector, its promising features, and its ongoing presale success position it as an attractive investment option. Cardano's solid fundamentals and active ecosystem make ADA a valuable addition to any investor's portfolio. As the crypto market evolves, these tokens showcase their potential for long-term gains and underline the importance of diversification in the ever-changing landscape of cryptocurrencies.</p>\n<p class=\"s10\">Visit InQubeta Presale</p>\n<p class=\"s14\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-08T19:00:00.000Z",
    "title": "Cardano (ADA) Price Prediction: ADA’s Team Responds to SEC's Claims of Unregistered Security",
    "url": "https://cryptodaily.co.uk/2023/07/cardano-ada-price-prediction-adas-team-responds-to-secs-claims-of-unregistered-security",
    "description": "<p>Cardano (ADA) and Uwerx are making headlines with significant updates in the ever-evolving realm of cryptocurrencies. Cardano (ADA)'s team responds to the SEC's allegations of being unregistered security, shedding light on their regulatory compliance efforts. </p>\n<p>Meanwhile, Uwerx's presale is nearing its sell-out, captivating investors with its innovative platform for freelancers. </p>\n<p>This article delves into the latest developments and examines the potential price prediction for Cardano (ADA), offering insights into the dynamic and promising opportunities Uwerx presents. Stay informed and discover the exciting prospects that await in the crypto world.</p>\nCardano (ADA): Empowering the Future of Blockchain Technology\n<p>Cardano (ADA) is a testament to successfully implementing a power-efficient Proof-of-Stake (PoS) consensus mechanism, positioning itself among the most extensive networks to achieve this remarkable feat. </p>\n<p>By leveraging intelligent contracts and the Cardano (ADA) token, the platform empowers users to actively engage in network operations, fostering a society prioritizing security, transparency, and fairness.</p>\n<p>Priced at $0.3537, Cardano (ADA) presents an enticing opportunity for investors and enthusiasts alike. In-depth analysis and diligent market observation suggest a projected value of $0.90 by Q2 2024, highlighting the platform's potential for growth and its undeniable appeal in innovative blockchain technology. </p>\n<p>As Cardano (ADA) continues to advance, it remains a compelling force driving transformation within the industry. Stay tuned to witness the ongoing evolution of Cardano (ADA) as it forges ahead, revolutionizing the blockchain landscape and redefining the possibilities of decentralized technology.</p>\nUwerx (WERX): Redefining Freelancing with Cutting-Edge Solutions\n<p>Uwerx is making waves in the freelance industry by introducing a revolutionary platform that leverages blockchain technology to empower freelancers and clients. With its focus on innovation, transparency, and user-centric features, Uwerx is poised to disrupt traditional freelance platforms and create a more efficient and rewarding ecosystem.</p>\n<p>To ensure the long-term stability of the project, Uwerx has implemented a groundbreaking token lock mechanism. The team's tokens will remain locked for an impressive nine months, demonstrating their commitment to the project's success. Also, WERX tokens will be on a 25-year liquidity lock starting after the presale.</p>\n<p>Uwerx has strongly emphasized security, subjecting its intelligent contracts to thorough audits by renowned firms such as SolidProof and InterFi Network. These audits provide an extra layer of assurance to users.</p>\n<p>With its listing on CoinSniper and upcoming listing on Uniswap by August 1st, Uwerx is expanding its reach and enhancing liquidity for WERX tokens. These listings will offer increased trading opportunities, further bolstering the token's value and market accessibility.</p>\n<p>A key differentiator for Uwerx is its transaction fee of just 1%. This fee reduction positions Uwerx as a cost-effective alternative to industry giants like Upwork and Fiverr, who charge 10-20%, enabling freelancers to retain more earnings and fostering greater participation on the platform.</p>\n<p>The introduction of the Uwerx Vault adds an exciting dimension to the platform. Freelancers can securely store their WERX tokens in the vault, taking advantage of staking opportunities and earning rewards based on platform variables. </p>\nUwerx (WERX): Continuous Community Growth\n<p>This week, a clickable prototype will be launched during the presale, featuring registration pages for both freelancers and clients. Furthermore, the upcoming week will witness the introduction of the Uwerx Vault feature, alongside a poll to determine the test airdrop's date.</p>\n<p>The recent launch of the Alpha platform showcases Uwerx's commitment to delivering a robust user interface and a long last experience for users. This initial version includes signing up, logging in, job creation, talent sourcing, and activity monitoring. The team is actively working toward the Beta version, which will introduce additional enhancements and further streamline the platform's capabilities.</p>\n<p>The success of Uwerx's presale has been astounding, with each stage surpassing expectations. In Stage 5, the presale allows investors to secure WERX tokens for $0.047725 per token, with an additional 15% bonus on every purchase. The overwhelming response underscores the market's confidence in Uwerx's vision and potential. </p>\n<p>The price is set to rise to $0.05245 on Monday, July 10th at 18:00 UTC.</p>\n<p>After the presale concludes on July 31st, token holders can look forward to a 6-week vesting period. Tokens will be gradually distributed during this period according to a predetermined schedule, ensuring a balanced and controlled release.</p>\n<p>Seize the chance to join this extraordinary adventure and contribute to shaping the future of freelance work. Uwerx values your invaluable feedback, so don't hesitate to share it at feedback@uwerx.network and let us know what you think.</p>\nStay ahead of the Uwerx presale by using the links below:\n<p>Presale: invest.uwerx.network</p>\n<p>Telegram: https://t.me/uwerx_network</p>\n<p>Twitter: https://twitter.com/uwerx_network</p>\n<p>Website: https://www.uwerx.network/</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-08T19:00:00.000Z",
    "title": "Bitcoin Price Analysis:  Slowed by 30142 Technicals - 9 July 2023",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-price-analysis-slowed-by-30142-technicals-9-july-2023",
    "description": "<p>BTC/USD Bears Slowed by 30142:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 9 July 2023</p>\n<p>Bitcoin (BTC/USD) continued to suffer from bearish sentiment early in the Asian session as the pair failed to sustain a break of the 30407 level, representing the 38.2% retracement of the recent depreciating range from 31525.10 to 29715.87.&nbsp; Selling activity reversed around the 30148.60 area, representing a test of the 23.6% retracement of the same depreciating range.&nbsp; Earlier selling pressure recently intensified around the 31142.38 area and this increases the risk of another test of the 29427 area, representing the 38.2% retracement of the broader appreciating range from 26165.98 to 31443.67.&nbsp; &nbsp;Below that area, the 28604.83 level represents the 50% retracement of that appreciating range.&nbsp; Additional upside price objectives include the 31737, 32125, and 33569 areas.&nbsp; Stops are cited above additional upside price objectives around the 31674, 32043, 34531, and 34658 areas.</p>\n<p>Following recent selling pressure, areas of potential technical support and buying pressure include the 29427, 28886, 28804, 28182, 28096, and 27306 areas.&nbsp; &nbsp;Technicians are closely watching to see how much technical support develops around the 28095.44 area, representing the 23.6% retracement of the historical depreciating range from 69000 to 15460.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bullishly indicating above the 100-bar MA (4-hourly)&nbsp;and&nbsp;above the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;100-bar MA&nbsp;(4-hourly) at 30422.49 and the&nbsp;50-bar MA&nbsp;(Hourly) at 30234.43.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bearishly below MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-08T18:56:22.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-08T18:55:12.000Z",
    "title": "How to Take Advantage of Ethereum Flippening Bitcoin in the Next Bullrun",
    "url": "https://www.cryptopolitan.com/ethereum-flippening-bitcoin-next-bullrun/",
    "description": "The cryptocurrency market is filled with excitement and speculation as investors and enthusiasts eagerly await the next bull run. Within this context, the concept of &#8220;Flippening&#8221; has garnered significant attention. The Flippening refers to the hypothetical event in which Ethereum (ETH) surpasses Bitcoin (BTC) as the largest cryptocurrency by market capitalization. Ethereum and Bitcoin have ... <a title=\"How to Take Advantage of Ethereum Flippening Bitcoin in the Next Bullrun\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-flippening-bitcoin-next-bullrun/\" aria-label=\"More on How to Take Advantage of Ethereum Flippening Bitcoin in the Next Bullrun\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-08T18:50:23.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-08T18:41:32.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-08T19:00:21.000Z",
    "title": "Pikamoon is The Only GameFi Token Than Can Give Investors 10,000% This Year. Even Sandbox Can’t Compete",
    "url": "https://www.crypto-news-flash.com/pikamoon-is-the-only-gamefi-token-than-can-give-investors-10000-this-year-even-sandbox-cant-compete/?utm_source=rss&utm_medium=rss&utm_campaign=pikamoon-is-the-only-gamefi-token-than-can-give-investors-10000-this-year-even-sandbox-cant-compete",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-08T212111.167.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-08T212111.167.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-08T212111.167-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto market has been transformed by the rise of GameFi tokens. One project that played a crucial role in this transformative era is Sandbox (SAND). Although it initially displayed potential throughout 2021, it has faced challenges in consistently providing satisfactory investment returns. In 2023, there is major buzz surrounding a new GameFi token that [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-08T18:45:12.000Z",
    "title": "Losses From Crypto Hacks Now Total Over $30,000,000,000 Across More Than 1,100 Exploits: Security Firm SlowMist",
    "url": "https://dailyhodl.com/2023/07/08/losses-from-crypto-hacks-now-total-over-30000000000-across-more-than-1100-exploits-security-firm-slowmist/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/losses-from-hacks-across.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/losses-from-hacks-across.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/losses-from-hacks-across.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/losses-from-hacks-across.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/losses-from-hacks-across.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/losses-from-hacks-across.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/losses-from-hacks-across.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Total losses from crypto hacks have now shattered $30 billion, according to the blockchain security firm SlowMist. The firm notes that the gigantic figure was amassed across 1,101 different hacks dating back to January 2012. Says SlowMist, &#8220;In light of these staggering numbers, it&#8217;s abundantly clear that projects and users alike need to place a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/08/losses-from-crypto-hacks-now-total-over-30000000000-across-more-than-1100-exploits-security-firm-slowmist/\">Losses From Crypto Hacks Now Total Over $30,000,000,000 Across More Than 1,100 Exploits: Security Firm SlowMist</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]