[
  {
    "source": "CoinDesk",
    "date": "2023-08-30T21:43:15.000Z",
    "title": "Gemini Opposes Genesis Bankruptcy Plan: 'Woefully Light on Specifics'",
    "url": "https://www.coindesk.com/policy/2023/08/30/gemini-opposes-genesis-bankruptcy-plan-woefully-light-on-specifics/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Attorneys for crypto exchange Gemini argued that a proposed resolution for Genesis' bankruptcy doesn't have enough detail or provide any assurances for some if its largest debtors in a new filing Wednesday."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-30T22:00:52.000Z",
    "title": "The Pentagon Is Accelerating AI and Autonomous Technology",
    "url": "https://decrypt.co/154373/the-pentagon-is-accelerating-ai-and-autonomous-technology",
    "description": "America’s military leaders are racing to deploy thousands of autonomous weapons and an AI-powered air monitoring system for Washington D.C."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-30T21:54:08.000Z",
    "title": "Vivek Ramaswamy Says Grayscale Win ‘Clears Path’ for Bitcoin Innovation in America",
    "url": "https://decrypt.co/154372/vivek-ramaswamy-grayscale-bitcoin-crypto-innovation",
    "description": "Vivek is one of many Republicans who suspect the SEC is out to kill crypto."
  },
  {
    "source": "BTCManager",
    "date": "2023-08-30T22:00:05.000Z",
    "title": "Grayscale’s Bitcoin ETF optimism bolsters crypto market sentiment",
    "url": "https://crypto.news/grayscales-bitcoin-etf-optimism-bolsters-crypto-market-sentiment/",
    "description": "Grayscale's legal victory against the SEC renews optimism for a US Bitcoin ETF, boosting trading, investor sentiment, and overall financial markets"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-30T21:43:09.000Z",
    "title": "Arkham: Robinhood is fifth-largest Ethereum holder",
    "url": "https://crypto.news/arkham-robinhood-is-fifth-largest-ethereum-holder/",
    "description": "Arkham Intelligence has identified Robinhood as the fifth largest holder of Ether, with $2.54 billion"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-30T22:00:21.000Z",
    "title": "New Bull Run For Bitcoin If It Breaks This Level, Expert Addresses Elephant In The Room",
    "url": "https://www.newsbtc.com/bitcoin-news/new-bull-run-for-bitcoin-if-it-breaks-this-level-expert-addresses-elephant-in-the-room/",
    "description": "The Bitcoin price is on the move as bulls take over the market and reclaim previously lost territory. While the rally signals potential, BTC still needs to overcome significant resistance at higher levels.   Related Reading: Bitcoin Insider Trading Suspicions Take Root Following Grayscale Win, What’s Happening? As of this writing, Bitcoin (BTC) trades at $27,300 with a 5% profit in the last 24 hours. In the previous seven days, BTC recorded similar profits as other cryptocurrencies in the top 10 see gains for the first time in over two weeks. $30,000 Are The $12,000, A Bitcoin Bull Run In The Making According to Bloomberg Intelligence’s Mike McGlone, the current Bitcoin price action is akin to that display before the 2020 bull run. At that time, macroeconomic forces influenced the crypto market as BTC prepared for a Halving event. The cryptocurrency also struggled to reclaim a critical level of around $12,000. McGlone believes that $30,000 is similar to that level and that breaching it would open the door for further gains, but are the conditions given for such an event? NewsBTC has reported that the biggest catalyzer for a Bitcoin bull run lies with the US Securities Exchange Commission (SEC). The cryptocurrency might have a massive capital inflow if the regulator approves a spot BTC Exchange Traded Fund (ETF). Yesterday, asset manager Grayscale scored a victory against the Commission, and a US judge ruled in favor of the company in their Bitcoin ETF lawsuit. The expert commented the following on this development and how it can pave the way for a BTC rally: The inevitable approval of Bitcoin exchange traded funds in the US is moving closer, but the elephant in the room for all risk assets remains – the Fed is still tightening (…). Sustaining back above $30,000 would indicate a reversal upwards akin to a similar pattern around $12,000 in 2H20. Of course, McGlone doubts the cryptocurrency can push above $30,000 in the short term. Despite the similarities between the current price action and 2020, there are two significant obstacles: the Fed’s monetary policy and the low liquidity in the financial markets. As a result of these conditions, the chart below shows the BTC price trending to the downside, with volatility moving in the opposite direction. The expert believes this dynamic potentially sets the stage for Bitcoin to drop into the $12,000 region. Related Reading: Renowned Economist Explains Why Grayscale’s Win Is Not Good For Bitcoin Price While these factors remain, Bitcoin will likely move sideways around its current levels, but the cryptocurrency will keep its bullish structure even if this scenario plays out. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-30T22:01:43.000Z",
    "title": "Bloomberg Experts Say There’s a 75% Chance of Bitcoin ETF Launch This Year, ‘Done Deal’ for 2024",
    "url": "https://dailyhodl.com/2023/08/30/bloomberg-experts-say-theres-a-75-chance-of-bitcoin-etf-launch-this-year-done-deal-for-2024/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-btc-Move-After.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-btc-Move-After.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-btc-Move-After.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-btc-Move-After.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-btc-Move-After.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-btc-Move-After.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Bitcoin-btc-Move-After.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bloomberg analysts say it&#8217;s highly likely a Bitcoin (BTC) exchange-traded fund (ETF) will launch by the end of the year, and a near-guarantee by the end of 2024. According to Bloomberg ETF experts James Seyffart and Eric Balchunas, there’s a 75% chance that a spot market BTC ETF will launch by the end of 2023 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/30/bloomberg-experts-say-theres-a-75-chance-of-bitcoin-etf-launch-this-year-done-deal-for-2024/\">Bloomberg Experts Say There’s a 75% Chance of Bitcoin ETF Launch This Year, ‘Done Deal’ for 2024</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]