[
  {
    "source": "CoinDesk",
    "date": "2023-05-31T16:00:04.000Z",
    "title": "EU Formally Signs New Crypto Licensing, Money Laundering Rules Into Law",
    "url": "https://www.coindesk.com/policy/2023/05/31/eu-formally-signs-new-crypto-licensing-money-laundering-rules-into-law/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The MiCA law is set to make the bloc the first major jurisdiction with tailored crypto regulations."
  },
  {
    "source": "CoinDesk",
    "date": "2023-05-31T16:00:00.000Z",
    "title": "Washington Ignored Crypto for Now. That’s Good for Bitcoin.",
    "url": "https://www.coindesk.com/business/2023/05/31/washington-ignored-crypto-for-now-thats-good-for-bitcoin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A huge tax on BTC miners didn’t make it into a deal to resolve the battle, and a separate provision might actually (unintentionally) help them."
  },
  {
    "source": "CoinDesk",
    "date": "2023-05-31T16:00:00.000Z",
    "title": "Sell Crypto Volatility in May, and Go Away?",
    "url": "https://www.coindesk.com/markets/2023/05/31/sell-crypto-volatility-in-may-and-go-away/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The recent calm in bitcoin (BTC) and ether (ETH) should not lull market participants into a false sense of security."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-31T16:05:31.000Z",
    "title": "Binance delists privacy coins for European users amid layoff rumors",
    "url": "https://cryptoslate.com/binance-delists-privacy-coins-for-european-users-amid-layoff-rumors/",
    "description": "<p>Binance said it would delist privacy coins for users in unnamed jurisdictions from June 26, according to an emailed statement to CryptoSlate. &#8220;As part of Binance’s ongoing compliance processes, we have reached out to affected users, to notify them that they will no longer be able to purchase or trade privacy tokens on our platform [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-delists-privacy-coins-for-european-users-amid-layoff-rumors/\">Binance delists privacy coins for European users amid layoff rumors</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-31T15:48:43.000Z",
    "title": "Bitcoin miner balance soars to highs not seen since November 2022",
    "url": "https://cryptoslate.com/insights/bitcoin-miner-balance-soars-to-highs-not-seen-since-november-2022/",
    "description": "<p>Explore the intriguing data behind Glassnode's miner percent mined supply spent metric and how it pertains to the health of the Bitcoin mining industry. With the miner balance reaching 737,000 Bitcoin - a high not seen since November 2022 - and the overall miner balance totaling over 1.8 million Bitcoin, it's clear miners are retaining more Bitcoin in their treasuries. But what's causing this shift in miner behavior, and how does it connect to the surge in Inscriptions and BRC-20 tokens? Uncover the key factors driving this change...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-miner-balance-soars-to-highs-not-seen-since-november-2022/\">Bitcoin miner balance soars to highs not seen since November 2022</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-05-31T15:55:00.000Z",
    "title": "Asset Management Led by ATPBot Innovation: A Letter to Investors",
    "url": "https://www.cryptoglobe.com/latest/2023/05/asset-management-led-by-atpbot-innovation-a-letter-to-investors/",
    "description": "Disclaimer: This article is sponsored content and is for informational purposes only. It does not constitute financial advice. Cryptocurrency trading involves significant risk of loss and is not suitable for all investors. The views expressed in this article are those of the sponsor and do not necessarily reflect those of CryptoGlobe. We advise all readers […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-31T15:41:18.000Z",
    "title": "Ex-Coinbase Manager Agrees to Settle SEC Insider Trading Charges",
    "url": "https://cryptodaily.co.uk/2023/05/ex-coinbase-manager-agrees-to-settle-sec-insider-trading-charges",
    "description": "<p>The SEC announced that former Coinbase product manager Ishan Wahi and his brother agreed to settle charges against them that they engaged in insider trading. </p>\n<p>On Tuesday, the US Securities and Exchange Commission (SEC) announced that Ishan Wahi, a former Coinbase Global product manager, and his brother, Nikhil Wahi, agreed to settle charges that they engaged in insider trading relating to at least nine crypto asset securities.</p>\nWahi Brothers Agree to Settle Civil Charges\n<p>The securities watchdog said the Wahi brothers agreed to settle civil charges that they engaged in a scheme to trade ahead of multiple announcements relating to at least nine crypto asset securities, which would be made available on Coinbase&rsquo;s platform.</p>\n<p>Ishan Wahi was arrested in 2022 and charged with insider trading after it emerged that he was feeding his brother Nikhil, and another individual, with information about crypto assets to be listed on Coinbase.</p>\n<p>Authorities investigating the matter said Wahi&rsquo;s brother and a fellow conspirator, Sameer Ramani, made over $1 million between June 2021 and April 2022 with the information provided by Ishan Wahi.</p>\n<p>Ishan Wahi was sentenced to two years in prison after pleading guilty to charges of conspiracy to commit wire fraud.</p>\n<p>Nikhil Wahi was sentenced to 10 months in prison in January and was ordered to pay a fine of $892,500 after pleading guilty to one count of conspiracy to commit wire fraud.</p>\nSEC Argues Digital Assets Should Fall Under Its Oversight\n<p>The SEC has grown increasingly active in policy in the crypto industry, filing numerous lawsuits against several major crypto-related firms since the start of 2023. Reuters reports that in the lawsuits, the agency has argued that many digital assets are securities and fall under its oversight, including the case against the Wahi brothers.</p>\n<p>During pleading to the criminal charges, Ishan Wahi stated that he did not believe any of the tokens in question were securities.</p>\n<p>Coinbase is not a party to the SEC allegations against the Wahi brothers, but the firm filed an amicus brief supporting the Wahi brother&rsquo;s motion to dismiss the SEC&rsquo;s case.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-31T15:45:02.000Z",
    "title": "Biggest Movers: SHIB Nears 6-Month Low, Whilst LTC Drops by 4% on Wednesday",
    "url": "https://news.bitcoin.com/biggest-movers-shib-nears-6-month-low-whilst-ltc-drops-by-4-on-wednesday/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2169647233-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2169647233-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2169647233-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2169647233-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2169647233-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2169647233-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2169647233-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2169647233.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Shiba inu moved closer to a six-month low on Wednesday, as sentiment in cryptocurrency markets shifted bearish. Litecoin was another notable token to fall, slipping by over 4% today. The global market cap is currently down by over 2% at the time of writing. Shiba Inu (SHIB) Shiba inu (SHIB) fell below a key support [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T16:01:39.000Z",
    "title": "Lucrative Rise Predicted For Uwerx (WERX), While Avalanche (AVAX) and Klaytn (KLAY) Show Good Run",
    "url": "https://www.cryptopolitan.com/lucrative-rise-predicted-for-uwerx-werx-while-avalanche-avax-and-klaytn-klay-show-good-run/",
    "description": "Presently, there are 12,988 coins, as seen on CoinGecko. These are the total number of available coins investors can choose to invest in. But, despite these numbers, only a few, like Avalanche (AVAX) and Klaytn (KLAY), show a good run.&#160; Unfortunately, these two tokens might not be able to provide investors with huge profits, which ... <a title=\"Lucrative Rise Predicted For Uwerx (WERX), While Avalanche (AVAX) and Klaytn (KLAY) Show Good Run\" class=\"read-more\" href=\"https://www.cryptopolitan.com/lucrative-rise-predicted-for-uwerx-werx-while-avalanche-avax-and-klaytn-klay-show-good-run/\" aria-label=\"More on Lucrative Rise Predicted For Uwerx (WERX), While Avalanche (AVAX) and Klaytn (KLAY) Show Good Run\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T15:57:09.000Z",
    "title": "Crypto Marvels: Exploring Big Eyes Coin, Shiba Inu, & PepeCoin For Potential Amid ADA Vs ETH Debate",
    "url": "https://www.cryptopolitan.com/crypto-marvels-exploring-big-eyes-coin-shiba-inu-pepecoin-for-potential-amid-ada-vs-eth-debate/",
    "description": "Unleashing unique potential and distinctive features, Big Eyes Coin (BIG), Shiba Inu (SHIB), and PepeCoin (PEPE) have captured the imagination of investors and crypto enthusiasts. As the world of cryptocurrencies expands, these three meme coins have emerged as notable players, garnering attention for their individual charms and promising prospects.&#160; In this article, we look into ... <a title=\"Crypto Marvels: Exploring Big Eyes Coin, Shiba Inu, &#38; PepeCoin For Potential Amid ADA Vs ETH Debate\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-marvels-exploring-big-eyes-coin-shiba-inu-pepecoin-for-potential-amid-ada-vs-eth-debate/\" aria-label=\"More on Crypto Marvels: Exploring Big Eyes Coin, Shiba Inu, &#38; PepeCoin For Potential Amid ADA Vs ETH Debate\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T15:56:55.000Z",
    "title": "Unleashing The Power Of Meme Tokens: A Look At How Dogecoin, DogeMiyagi, And Avalanche Perform In The Crypto Market",
    "url": "https://www.cryptopolitan.com/unleashing-the-power-of-meme-tokens-a-look-at-how-dogecoin-dogemiyagi-and-avalanche-perform-in-the-crypto-market/",
    "description": "In the ever-evolving landscape of cryptocurrency, a new breed of tokens has emerged, harnessing the power of memes to captivate investors and reshape the industry. This article delves into the world of meme tokens, exploring the performance of three notable contenders: Dogecoin (DOGE), DogeMiyagi (MIYAGI), and Avalanche (AVAX). These tokens have brought a fresh wave ... <a title=\"Unleashing The Power Of Meme Tokens: A Look At How Dogecoin, DogeMiyagi, And Avalanche Perform In The Crypto Market\" class=\"read-more\" href=\"https://www.cryptopolitan.com/unleashing-the-power-of-meme-tokens-a-look-at-how-dogecoin-dogemiyagi-and-avalanche-perform-in-the-crypto-market/\" aria-label=\"More on Unleashing The Power Of Meme Tokens: A Look At How Dogecoin, DogeMiyagi, And Avalanche Perform In The Crypto Market\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T15:51:00.000Z",
    "title": "Blockchain gaming market set to soar, reaching $301.53 billion by 2023",
    "url": "https://www.cryptopolitan.com/blockchain-gaming-market-set-to-soar-reaching-301-53-billion-by-2023/",
    "description": "The global gaming market is poised for remarkable growth in the next seven years, with a projected market cap of $301.53 billion by 2030, according to a report by Grand View Research. The report, titled &#8220;Blockchain In Gaming Market Size,&#8221; highlights the shift from traditional gaming to blockchain-based alternatives as the driving force behind this ... <a title=\"Blockchain gaming market set to soar, reaching $301.53 billion by 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockchain-gaming-market-set-to-soar-reaching-301-53-billion-by-2023/\" aria-label=\"More on Blockchain gaming market set to soar, reaching $301.53 billion by 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T15:49:49.000Z",
    "title": "Analysts Believe InQubeta (QUBE) and Aave (AAVE) are the Latest Must-Have Cryptos for the Long-Term Investor Looking Beyond 2023",
    "url": "https://www.cryptopolitan.com/analysts-believe-inqubeta-qube-and-aave-aave-are-the-latest-must-have-cryptos-for-the-long-term-investor-looking-beyond-2023/",
    "description": "Many cryptocurrency analysts are picking InQubeta (QUBE) and Aave (AAVE) as the top altcoins for long-term investors looking beyond 2023. Both tokens are expected to enjoy substantial growth this year with InQubeta prices scheduled to increase 4x during its presale and Aave already seeing significant price increases. However, it’s the potential of long-term profits as ... <a title=\"Analysts Believe InQubeta (QUBE) and Aave (AAVE) are the Latest Must-Have Cryptos for the Long-Term Investor Looking Beyond 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/analysts-believe-inqubeta-qube-and-aave-aave-are-the-latest-must-have-cryptos-for-the-long-term-investor-looking-beyond-2023/\" aria-label=\"More on Analysts Believe InQubeta (QUBE) and Aave (AAVE) are the Latest Must-Have Cryptos for the Long-Term Investor Looking Beyond 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T15:48:28.000Z",
    "title": "Ethereum whales dump all holdings: A potential delay in the bull market?",
    "url": "https://www.cryptopolitan.com/ethereum-whales-dump-all-holdings-bear-run/",
    "description": "The Ethereum (ETH) market is facing big problems, as new data show that major investors are selling off their holdings. According to data from blockchain analytics, the number of Ethereum accounts with 1,000 or more coins has dropped to its lowest level in 10 months. This low was seen in November 2022, when the number ... <a title=\"Ethereum whales dump all holdings: A potential delay in the bull market?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-whales-dump-all-holdings-bear-run/\" aria-label=\"More on Ethereum whales dump all holdings: A potential delay in the bull market?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T15:48:15.000Z",
    "title": "Memecoin picks for June 2023 : Shiba Inu, Floki Inu and DigToads",
    "url": "https://www.cryptopolitan.com/memecoin-picks-for-june-2023-shiba-inu-floki-inu-and-digtoads/",
    "description": "June is right around the corner &#38; it could mean another month of rallies and downturns for crypto holders and traders depending on the coin at stake. Memecoins also have a significant role amid all this upheaval.&#160; Dogecoin had a long run as the only notable project. It is now facing several rivals and potential ... <a title=\"Memecoin picks for June 2023 : Shiba Inu, Floki Inu and DigToads\" class=\"read-more\" href=\"https://www.cryptopolitan.com/memecoin-picks-for-june-2023-shiba-inu-floki-inu-and-digtoads/\" aria-label=\"More on Memecoin picks for June 2023 : Shiba Inu, Floki Inu and DigToads\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T15:55:34.000Z",
    "title": "Beijing government publishes web3 white paper",
    "url": "https://crypto.news/beijing-government-publishes-web3-white-paper/",
    "description": "Beijing's municipal government has introduced the \"Web3 Innovation and Development White Paper\" at the Zhongguancun Forum."
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-31T16:00:43.000Z",
    "title": "Car Rental Owner Arrested In Bali For Accepting Crypto Payments",
    "url": "https://www.newsbtc.com/crypto/car-rental-owner-arrested-in-bali-for-accepting-crypto-payments/",
    "description": "Bali police have arrested a car rental owner in the state for accepting payments in crypto assets. The arrest came after the state government warned against using cryptocurrencies as payment options for any transaction. Bali Police Worked Undercover To Arrest Car Rental Business Owner While working undercover as customers, Bali police agents arrested an individual identified as TS (33) on May 29 in Jimbaran, Badung, in Bali, Indonesia. The Bali Police’s Cyber Unit started its investigations following increasing reports of people using crypto assets for transactions in the state. These include businesses like car rentals, cafes, hotels, property agencies, and others. Related Reading: Bullish Case For Litecoin Grows Stronger As LTC Halving Draws Close Chief of the Crime Investigation Unit Nanang Prihasmoko spoke to CNN Indonesia about the arrest. The unit chief stated that the police contacted the suspect as a potential renter by secretly infiltrating a car rental group on the Telegram app. The police then requested TS&#8217;s crypto wallet address for rental payment and set a physical meeting to conclude all arrangements.  Finally, the police arrested the car rental owner at the point of the meeting. Prihasmoko revealed that TS had started accepting crypto payments from foreigners on the island three months ago.  And following his arrest, the police seized some of the suspect’s assets, including his mobile phone used for crypto transactions. They also seized an Indodax account, a Pajero Sport vehicle, his ATM card, a Telegram account, and Telegram screenshots. According to Nanang, using any other currency for payments or financial obligations except the Indonesian rupiah violates Indonesian law. Offenders of such law could face one-year imprisonment and a penalty fine of IDR 200 million. Bali Warned Against Using Crypto For Payments The government of Bali has previously warned against the use of cryptocurrencies for payments in the region. In a statement by Bali Governor Wayan Koster, the ban on crypto payments cuts across different areas such as shopping, accommodations, restaurants, rentals, and other activities. Related Reading: Here Are The Top 3 Chinese Coins To Buy As China Leads The Bull Run The governor mentioned that anyone caught in the act would be strictly punished and the penalty could even include a forceful closure of the offenders&#8217; businesses in the state. Furthermore, Governor Koster extended the warning against crypto use to tourists and other foreigners within the island state. He said the state has zero tolerance for violating laws and improper actions from tourists. According to the governor, foreigners violating Balian laws could face deportation,  sanctions, or penalty fines. Indonesia only encourages the use of its local currency, the Indonesian rupiah. It is the only legal tender permitted for conducting transactions in the country. Featured image from Pixabay and chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T15:43:35.000Z",
    "title": "IOTA Founder David Sonstebo Invests Big in SPYCE.5 to Accelerate Enterprise Adoption in Billion-Dollar Market",
    "url": "https://www.crypto-news-flash.com/iota-founder-david-sonstebo-invests-big-in-spyce-5-to-accelerate-enterprise-adoption-in-billion-dollar-market/?utm_source=rss&utm_medium=rss&utm_campaign=iota-founder-david-sonstebo-invests-big-in-spyce-5-to-accelerate-enterprise-adoption-in-billion-dollar-market",
    "description": "<p>IOTA founder invests in SPYCE.5 as part of the efforts to accelerate blockchain adoption. The asset has surged by 6.9 percent in the last seven days.  Blockchain and Web3 infrastructure provider SPYCE.5 has disclosed to have received a huge investment from IOTA co-founder David Sonstebo.  We are excited to announce that IOTA co-founder David Sønstebø [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/iota-founder-david-sonstebo-invests-big-in-spyce-5-to-accelerate-enterprise-adoption-in-billion-dollar-market/\">IOTA Founder David Sonstebo Invests Big in SPYCE.5 to Accelerate Enterprise Adoption in Billion-Dollar Market</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]