[
  {
    "source": "Cryptopolitan",
    "date": "2023-12-09T09:36:29.000Z",
    "title": "LEGO Fortnite: How to Build your First Village Fast? ",
    "url": "https://www.cryptopolitan.com/lego-fortnite-village-build/",
    "description": "Discover the secret to building LEGO Fortnite villages, with step-by-step instructions on crafting Village Squares and leveling up for epic gameplay advantages."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-09T09:33:53.000Z",
    "title": "Paxos Shows November Transparency Report for PYUSD",
    "url": "https://www.cryptopolitan.com/paxos-november-transparency-report-for-pyusd/",
    "description": "In a move towards fostering transparency, Paxos has recently published its November transparency report for PYUSD, presenting unaudited data as of December 1. The report discloses key metrics, shedding light on the state of PYUSD, a stablecoin pegged to the US Dollar. Notably, the total outstanding tokens stand at approximately $156,753,068, indicating a marginal decrease ... <a title=\"Paxos Shows November Transparency Report for PYUSD\" class=\"read-more\" href=\"https://www.cryptopolitan.com/paxos-november-transparency-report-for-pyusd/\" aria-label=\"More on Paxos Shows November Transparency Report for PYUSD\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-09T09:21:08.000Z",
    "title": "El Salvador’s crypto adoption falls short of expectations",
    "url": "https://www.cryptopolitan.com/el-salvadors-crypto-adoption-falls-short/",
    "description": "El Salvador, the pioneering nation that made history by adopting cryptocurrency as legal tender, is facing a surprising challenge: a lack of widespread crypto adoption among its population. Despite the government&#8217;s continuous efforts to promote cryptocurrencies, a recent report reveals that less than 2% of the country&#8217;s population owns crypto assets. El Salvador&#8217;s crypto enthusiasm ... <a title=\"El Salvador&#8217;s crypto adoption falls short of expectations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/el-salvadors-crypto-adoption-falls-short/\" aria-label=\"More on El Salvador&#8217;s crypto adoption falls short of expectations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-09T09:13:36.000Z",
    "title": "Bitcoin achieves record Total Value Locked (TVL) and surges in NFT volumes",
    "url": "https://www.cryptopolitan.com/bitcoin-achieves-record-total-value-locked/",
    "description": "In a recent data revelation, Bitcoin has broken records by achieving an unprecedented Total Value Locked (TVL) of approximately $315 million, signaling its continued dominance in the cryptocurrency space. Furthermore, the network has witnessed a remarkable surge in Non-Fungible Token (NFT) volume, a sector previously unrelated to Bitcoin&#8217;s core functionality. This article explores these groundbreaking ... <a title=\"Bitcoin achieves record Total Value Locked (TVL) and surges in NFT volumes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-achieves-record-total-value-locked/\" aria-label=\"More on Bitcoin achieves record Total Value Locked (TVL) and surges in NFT volumes\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-09T09:12:09.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 How much is Bitcoin (BTC) worth? Today, the price of Bitcoin stands at $43,945, with a trading volume over the past 24 hours reaching $25.7 billion. Its market capitalization is $858 billion, and it currently commands 54% of the market share. Over the last 24 hours, the BTC price has experienced ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-12-09T09:32:47.000Z",
    "title": "Hype Builds as SEC Postpones Decision, Paving the Way for Potential Mass Approval of Bitcoin ETFs; Synthetix and Pullix Anticipate Significant Profits",
    "url": "https://nulltx.com/hype-builds-as-sec-postpones-decision-paving-the-way-for-potential-mass-approval-of-bitcoin-etfs-synthetix-and-pullix-anticipate-significant-profits/",
    "description": "The US Securities and Exchange Commission (SEC) recently postponed its decision regarding Bitcoin ETFs. While many are skeptical about the SEC&#8217;s stance, others believe this would give way for mass approval. Meanwhile, Synthetix and Pullix are looking to benefit from the launch. The DeFi coins are hoping to see more [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-09T09:20:30.000Z",
    "title": "The BONK Bomb: Solana Meme Coin Gets Extra 200% Boost To Its 7,000% Value Appreciation",
    "url": "https://www.newsbtc.com/news/the-bonk-bomb-solana-meme-coin-gets-extra-200-boost-to-its-7000-value-appreciation/",
    "description": "The price of some digital assets has reached an all-time high due to the recent growth in the bitcoin market. The unprecedented upswing in the cryptocurrency market has not only been good to tokens of decentralized protocols, but also meme coins like Bonk Inu (BONK). Today marked a new high for the token as its price increased by more than 200% in the weekly timeframe. Solana&#8217;s meme coin Bonk has been on a tremendous bull run for quite some time, with a price increase of over 7,000%, indicating the strengthening of the Solana ecosystem. Related Reading: Ethereum Price Soars To Over $2,300 – Is $3,000 Next? BONK Surges: A Crypto Standout November saw a sharp 1,000 surge in BONK&#8217;s value, making it one of the most profitable assets in the cryptocurrency market to date. The general upward trend in the cryptocurrency market in the first part of the month is partially the reason for this growth. Source: TradingView / BONKUSDT The BONK price has consistently produced large bullish candles since breaking out of the bearish trend it had been in since the start of the year. The majority of meme currencies are not moving very much, but BONK is experiencing high trade frequencies that are causing many bull runs. Even though there was a slight decline in price, the bulls&#8217; overwhelming domination kept the price above the gains. Considering that the volume has now turned to its advantage, the uptrend should last until the end of the month. Based on the technical indications, there is no sign that the bullish momentum will abate anytime soon. At the moment, BONK is experiencing a strong positive trend, with its price hitting an exponential high of $0.0000152. Interestingly, the prior high at $0.0000100 has become a level of support. BONKUSD currently trading at $0.00001360 territory on the daily chart: TradingView.com The 89th position on the Relative Strength Index (RSI) indicates an overbought zone. Extended green histograms on the Moving Average Convergence Divergence (MACD) indicate a strong bullish trend. BONK&#8217;s Ascent Faces Resistance Challenges BONK will encounter early resistance near its new all-time high of $0.0000133299 if it continues to rise. Above that, the extended Fib -0.236 level at $0.0000156963 and Fib -0.382 at $0.0000171293 are targets for higher moves. Volume is still high, indicating that people are still interested in BONK as it rises. BONK seven-day price action. Source: Coingecko Meanwhile, some fortunate Solana ecosystem participants stand to gain greatly from the skyrocketing price of the meme coin. Solana gave away $10 worth of BONK tokens when it released its Saga smartphone back in April. Those tokens are now worth over $11,500 because BONK is now over 1,000 times the price since then. Related Reading: This BRC-20 Token Just Breached $1 Billion Market Cap With 180% Rally Today – Details For those who are still holding onto their BONK airdrops, this has already been a transformative experience. Even in the wildest meme coin theories, gains of over a thousand percent are practically unheard of. Furthermore, given the continued growth of the cryptocurrency industry overall, it is possible that Solana and the meme coin community will continue to surprise us in the future given the persistent enthusiasm and risk-taking behavior. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-09T09:33:24.000Z",
    "title": "While Litecoin (LTC) and TRON (TRX) Grow, This Third Crypto Prepares to Triple Its Value",
    "url": "https://www.crypto-news-flash.com/while-litecoin-ltc-and-tron-trx-grow-this-third-crypto-prepares-to-triple-its-value/?utm_source=rss&utm_medium=rss&utm_campaign=while-litecoin-ltc-and-tron-trx-grow-this-third-crypto-prepares-to-triple-its-value",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-60.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-60.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-60-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-60-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />It’s been an interesting week for investors. Crypto giants such as Litecoin (LTC) and TRON (TRX) have witnessed a price rally due to the crypto market uptrend. However, smaller Litecoin addresses dumped their entire holdings. Furthermore, the British FCA included Poloniex, a crypto exchange owned by TRON (TRX) founder Justin Sun, in its warning list. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-09T09:32:31.000Z",
    "title": "Chainlink (LINK) Roars Back to Life: $20 Target in Sight, On-Chain Metrics Strong",
    "url": "https://www.crypto-news-flash.com/chainlink-link-roars-back-to-life-20-target-in-sight-on-chain-metrics-strong/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-link-roars-back-to-life-20-target-in-sight-on-chain-metrics-strong",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/chainlink-qe.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/chainlink-qe.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/chainlink-qe-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/chainlink-qe-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Chainlink (LINK) shows promising growth, up 3% to $16 and a target of $20, driven by trading volume that has increased by 50%. Chainlink Staking v0.2 reached its maximum capacity quickly, with 19 million LINK staked in 7 hours, reflecting strong community engagement. The Chainlink cryptocurrency, known by its token LINK, is rising as a [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-09T09:32:39.000Z",
    "title": "SEC’s Investor Alert on Crypto Asset Securities Impacts Crypto Community",
    "url": "https://coinedition.com/secs-investor-alert-on-crypto-asset-securities-impacts-crypto-community/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Ripple-CLO-to-SEC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple CLO to SEC: Common Interest Is Not Same as Common Enterprise\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Ripple-CLO-to-SEC.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CLO-to-SEC-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CLO-to-SEC-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CLO-to-SEC-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CLO-to-SEC-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CLO-to-SEC-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Prominent voices from the crypto space came forward questioning the US Securities and Exchange Commission’s (SEC) caution against crypto asset securities. Thinking Crypto Podcast Founder and Host Tony Edward censured the regulator, reflecting on their non-comprehensive crypto norms. In a recent tweet, Edward shared a significant question on the clear definition of “Crypto Asset Securities.” [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/secs-investor-alert-on-crypto-asset-securities-impacts-crypto-community/\">SEC’s Investor Alert on Crypto Asset Securities Impacts Crypto Community</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]