[
  {
    "source": "Cointelegraph",
    "date": "2023-09-20T05:57:00.000Z",
    "title": "Former Deutsche Bank exec pleads guilty over ‘R3 Crypto Fund’ scheme",
    "url": "https://cointelegraph.com/news/ex-deutsche-bank-banker-pleads-guilty-r3-crypto-fund-scheme",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/74b1b238-c1c8-4a43-89d3-dbc044beb784.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Rashawn Russell faces up to 30 years in prison for his role in the fraudulent cryptocurrency trading scheme. </p>\n                    <p><p>A former Deutsche Bank investment banker, who was charged earlier this year in relation to a fraudulent cryptocurrency trading scheme, has pleaded guilty to investment fraud — and could face up to 30 years in prison.</p><p>According to a Sept. 19 <a href=\"https://www.justice.gov/usao-edny/pr/former-investment-banker-and-registered-broker-pleads-guilty-cryptocurrency-investment\" target=\"_blank\" rel=\"noopener nofollow\">statement</a> from the Department of Justice, 27-year-old Rashawn Russell pleaded guilty to participating in a scheme where he operated a fraudulent crypto investment fund dubbed the “R3 Crypto Fund.”</p><p>Between Nov. 2020 and Aug. 2022, Russell defrauded 29 investors out of $1.5 million by leveraging his reputation as an investment banker and licensed financial broker to promise that he would be able to generate guaranteed, outsized returns on a series of crypto investments.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">CRYPTO CRIMES CONTINUED: Former Deutsche Bank investment banker Rashawn Russell, who had denied defrauding investors in a <a href=\"https://twitter.com/hashtag/cryptocurrency?src=hash&amp;ref_src=twsrc%5Etfw\">#cryptocurrency</a> fraud, today pled guilty in # EDNY. He was indicted in April &amp; accused of duping investors by promising “guaranteed returns.” <a href=\"https://t.co/Da0gYrbqqV\">pic.twitter.com/Da0gYrbqqV</a></p>&mdash; Inner City Press (@innercitypress) <a href=\"https://twitter.com/innercitypress/status/1704248644445036698?ref_src=twsrc%5Etfw\">September 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On multiple occasions, Russell lied to investors about their investments and fabricated multiple documents that displayed false information concerning their returns, according to the DOJ. </p><p>The prosecution <a href=\"https://www.justice.gov/usao-edny/pr/former-investment-banker-and-registered-broker-charged-operating-cryptocurrency\" target=\"_blank\" rel=\"noopener nofollow\">found</a> that Russell sent altered images of his bank balance to his investors. Another time, when an investor sought to cash in on one of their crypto investments, Russell never sent the money and instead sent his victim a fabricated money transfer confirmation.</p><p>According to prosecutors, most of the $1.5 million obtained from his victims was never used to invest in crypto assets. Instead, the funds were misappropriated by Russell and were used “for his personal benefit, to gamble, and to repay earlier investors,” in the scheme. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/onecoin-lawyer-laundered-proceeds-scam-denied-new-trial\"><strong><em>Lawyer who laundered $400M from OneCoin scam denied new trial: Report</em></strong></a></p><p>In addition to his investment scheme, Russell also pleaded guilty for his role in a separate identity-theft scheme where he fraudulently obtained credit cards and other devices using false information. </p><p>The DOJ said Russell obtained these identity documents with the intention of using them to undertake illegal and unauthorized transactions.</p><p>Upon sentences, he faces up to 30 years in prison for his crimes — with United States Magistrate Judge Sanket J. Bulsara ruling that he will be required to pay more than $1.5 million in restitution.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-20T05:45:24.000Z",
    "title": "Celsius creditors flag renewed phishing attacks ahead of bankruptcy plan",
    "url": "https://cointelegraph.com/news/crypto-lender-celsius-network-phishing-attacks-surge-ahead-bankruptcy-plan",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/cf9c2d3f-e33f-47e0-a1ce-713fe510a2ee.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Creditors of crypto lender Celsius Network have reported receiving a new flood of phishing emails, likely resulting from two data breaches last year.</p>\n                    <p><p>Creditors from bankrupt crypto lender Celsius Network are again being targeted in a new wave of phishing attacks as the crypto lender’s bankruptcy proceedings enters its final stages.</p><p>Reports on social media over the past week have shown an increase in phishing attacks from scammers impersonating Stretto, the bankruptcy services platform for crypto lender Celsius and its creditors. </p><p>One user <a href=\"https://twitter.com/21blacky/status/1703664979960873169\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> receiving three phishing emails claiming to be from Celsius on Sept. 18. </p><p>Others reported receiving fake emails with malicious links attempting to impersonate Stretto, the claims agent handling the bankruptcy case. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Beware of scam email (I received this phishing email -&gt; the scam link shown is &quot;case-stretto. com&quot;, not &quot;<a href=\"https://t.co/ZGKIKrPjl1\">https://t.co/ZGKIKrPjl1</a>&quot;) <a href=\"https://t.co/JV7yUQ6X5e\">https://t.co/JV7yUQ6X5e</a></p>&mdash; Better World (@Scam_is_sinful) <a href=\"https://twitter.com/Scam_is_sinful/status/1703673058085716245?ref_src=twsrc%5Etfw\">September 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The fake website, which drops an ‘s’ from the genuine URL, pops up a connect wallet prompt which when connected allows the scammers to drain the crypto asset contents. </p><p>One analyst and business manager said that phishing attacks were likely to increase as the Celsius bankruptcy proceedings approach its final stages. He advised taking precautions and double-checking links.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I expect phishing attempts to only increase as the celsius ch.11 approaches what appears to be the final stages. Creditors will be eager to make any final last-minute changes or confirm any  alleged distributions. Be extremely cautious, links are bad, and take precautions.</p>&mdash; Keith (@ChazzonKe) <a href=\"https://twitter.com/ChazzonKe/status/1703845270922932344?ref_src=twsrc%5Etfw\">September 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In mid-August Celsius was authorized to start <a href=\"https://cointelegraph.com/news/celsius-customers-vote-settlement-plan-with-fahrenheit-after-judge-gives-okay\">sending out ballots</a> to its customers for a vote on a proposed settlement plan. Scammers are using this to ramp up phishing attacks around the voting deadline. </p><p>According to Simon Dixon, CEO and co-founder of the online investment platform BnkToTheFuture, the final date for voting was Sept. 18 with the report scheduled for Sept. 20, and a confirmation hearing slated for Sept. 29. </p><p>Celsius intends to seek final court approval of its restructuring plan on Oct. 2. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The <a href=\"https://twitter.com/BankToTheFuture?ref_src=twsrc%5Etfw\">@BankToTheFuture</a> Investment Banking team have been working on some models to help <a href=\"https://twitter.com/hashtag/Celsius?src=hash&amp;ref_src=twsrc%5Etfw\">#Celsius</a> Creditors vote on the disclosure statement that I’ll share on YouTube soon. For now our team has put together a timetable of important events leading up to plan conformation.  <a href=\"https://t.co/3dQduMAofP\">pic.twitter.com/3dQduMAofP</a></p>&mdash; Simon Dixon (@SimonDixonTwitt) <a href=\"https://twitter.com/SimonDixonTwitt/status/1679064454560980994?ref_src=twsrc%5Etfw\">July 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/celsius-settles-litigation-core-scientific\"><strong><em>Celsius and Core Scientific propose $45M settlement for litigation</em></strong></a></p><p>The phishing attacks appear to stem from previous data breaches, including a Celsius Network email <a href=\"https://cointelegraph.com/news/email-server-breach-sees-celsians-targeted-by-phishing-attacks\">server breach</a> in April 2021 that resulted in user details being leaked, which led to malicious emails to those users.</p><p>The embattled crypto lender revealed more of its customer data had been leaked in another third-party <a href=\"https://cointelegraph.com/news/phishing-risks-escalate-as-celsius-confirms-client-emails-leaked\">data breach</a> in July 2022 which led to another wave of phishing attacks.</p><p>Customers of the crypto lender have been waiting to be made whole ever since Celsius halted withdrawals in June 2022 after the collapse of the Terra/Luna ecosystem. The crypto lender filed for bankruptcy the following month.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-og-simon-dixon-bankruptcies-elon-musk-crypto-twitter-hall-of-flame/\">Simon Dixon on bankruptcies, Celsius and Elon Musk: Crypto Twitter Hall of Flame</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-20T05:52:40.000Z",
    "title": "ABB Enhances Educational Robotics Portfolio with IRB 1090, Empowering Future Workforce",
    "url": "https://www.cryptopolitan.com/abb-educational-robotics-portfolio-irb-1090/",
    "description": "In a significant move to revolutionize educational robotics and empower the future workforce, ABB, a global leader in industrial automation and robotics, has introduced the IRB 1090, an innovative educational robot. Authenticated by the prestigious education institute STEM.org, the IRB 1090 is set to play a pivotal role in ABB&#8217;s broader education initiatives, offering a ... <a title=\"ABB Enhances Educational Robotics Portfolio with IRB 1090, Empowering Future Workforce\" class=\"read-more\" href=\"https://www.cryptopolitan.com/abb-educational-robotics-portfolio-irb-1090/\" aria-label=\"More on ABB Enhances Educational Robotics Portfolio with IRB 1090, Empowering Future Workforce\">Read more</a>"
  }
]