[
  {
    "source": "NewsBTC",
    "date": "2024-03-19T01:00:15.000Z",
    "title": "Is Ripple Behind The XRP Price Crash? Massive Selling Spree Sparks Concern",
    "url": "https://www.newsbtc.com/analysis/xrp/ripple-behind-xrp-price-crash/",
    "description": "Ripple’s occasional sale of XRP tokens has always been pinpointed as one reason for XRP’s tepid price action. Once again, the crypto firm’s recent offloading of a significant amount of XRP has raised concerns about its negative effect on the crypto token.  Ripple Offloads 240 Million XRP On-chain data shows that Ripple transferred a total of 240 million XRP tokens to an unknown address in two separate transactions. The first transaction occurred on March 5, when it sent 100 million XRP to the address in question. Then, on March 13, the Ripple wallet again transferred 140 million XRP to this address.  Related Reading: Bernstein Analysts Convinced Bitcoin Is Headed For $150,000, Here’s Why These transactions have raised eyebrows, and members of the XRP community are contemplating whether these sales might have been the reason XRP’s price crashed recently. Notably, the crypto token rose to as high as $0.74 on March 11 before seeing a sharp correction.  It is worth mentioning that XRP’s price crashed on March 5, the day the first transaction was carried out. Data from CoinMarketCap shows that the crypto token, which was trading as high as $0.65 on the day, dropped to as low as $0.55 on the same day. However, it remains uncertain whether or not Ripple’s action was directly responsible for this price dip. Meanwhile, XRP’s price was pretty stable on the day the second transaction occurred, although it was still declining from its weekly high of $0.7, recorded on March 11. The impact of Ripple’s XRP sales on the market continues to be heavily debated among those in the XRP community.  Pro-XRP crypto YouTuber Jerry Hall previously claimed that Ripple was suppressing XRP’s price with its monthly sales. However, there has also been a report that Ripple’s sale doesn’t impact prices on crypto exchanges.  If Not Ripple, Then Who? Ripple’s price action defies logic, especially considering that the token’s fundamentals and technical analysis suggest it is well primed for a parabolic move. That is why talks about possible market manipulation continue to persist. It is also understandable that all fingers instantly point to Ripple since they are the largest XRP holders.  Related Reading: Crypto Analyst Predicts Further Upside For Shiba Inu, Here’s The Target However, if Ripple is indeed not responsible for XRP’s stagnant price action, then there needs to be another explanation for why XRP has continued to underperform. Although the crypto token has continued to rank in the top 10 largest crypto tokens by market cap, it is worth mentioning that it is one of few tokens that has a negative year-to-date (YTD) gain.  At the time of writing, XRP is trading at around $0.61, up in the last 24 hours according to data from CoinMarketCap.  Token price at $0.6 &#124; Source: XRPUSDT on Tradingview.com Featured image from BitIRA, chart from Tradingview.com"
  }
]