[
  {
    "source": "NewsBTC",
    "date": "2023-11-08T04:07:24.000Z",
    "title": "Ethereum Price Bullish Momentum Fades But ETH Bulls Still In Control",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-bullish-momentum-fades-1920/",
    "description": "Ethereum price is still struggling to clear the $1,920 resistance against the US dollar. ETH is moving lower but downsides might be limited below $1,850. Ethereum is still struggling to clear the $1,920 level. The price is trading above $1,860 and the 100-hourly Simple Moving Average. There was a break above a connecting bearish trend line with resistance near $1,880 on the hourly chart of ETH/USD (data feed via Kraken). The pair could rise once again unless there is a close below the $1,850 support zone. Ethereum Price Stuck In Range Ethereum remained stable above the $1,850 support zone. ETH made another attempt to gain bullish momentum above the $1,880 resistance, like Bitcoin. There was a break above a connecting bearish trend line with resistance near $1,880 on the hourly chart of ETH/USD. However, the pair again failed to clear the $1,920 resistance zone. A high is formed near $1,907 and the price is moving lower. There was a drop below the $1,885 level. The price even tested the 50% Fib retracement level of the recent increase from the $1,851 swing low to the $1,907 high. Ethereum is now trading above $1,860 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $1,900 level. The first major resistance sits at $1,920. To start a fresh increase, the bulls need to clear the $1,920 resistance. Source: ETHUSD on TradingView.com In the stated case, the price could rally toward the $2,000 resistance. The next key resistance is near $2,050, above which the price could accelerate higher toward the $2,120 level. Are Dips Limited in ETH? If Ethereum fails to clear the $1,900 resistance, it could continue to move down. Initial support on the downside is near the $1,880 level. The next key support is $1,870 or the 100 hourly SMA. The 61.8% Fib retracement level of the recent increase from the $1,851 swing low to the $1,907 high is also at $1,870. The main support sits at $1,850. A downside break below the $1,850 support might send Ether further lower. In the stated case, the price could drop toward the $1,780 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,870 Major Resistance Level – $1,920"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-08T04:00:48.000Z",
    "title": "Coinbase Driving Solana Bull Run: Will SOL 2X To $80?",
    "url": "https://www.newsbtc.com/news/solana/coinbase-driving-solana-bull-run-will-sol-2x-to-80/",
    "description": "Solana (SOL) is one of the top performers, looking at price action in the weekly chart. According to Kaiko, SOL&#8217;s net buying, measured via cumulative volume delta (CVD), has been led by Coinbase, one of the most active cryptocurrency exchanges in the past few trading weeks. To illustrate, since October 18, the blockchain analytics platform notes that 2.2 million SOL have been purchased, an indicator of rising demand as the broader crypto market thaws. Coinbase Leading The Solana Buying Wave At over 2.2 million SOL purchased, Coinbase leads the wave of buying pressure. However, closely behind, Binance, the world&#8217;s largest cryptocurrency by client count, follows. There are around 2 million SOL bought through Binance from October 18, highlighting the role of the exchange in funneling liquidity to SOL. Even so, specific drivers forcing users to opt for Coinbase over Binance couldn&#8217;t be laid out.  Related Reading: Dogecoin Climbs Above $0.075 To 3-Month High, But Metrics Show It’s Far From Done While at it, there is rising demand for SOL on Kraken. Even so, demand for SOL has been fizzling on Bybit, Upbit, and OKX over the same period. It couldn&#8217;t be ascertained why the trajectory on these exchanges has been trending lower. However, what&#8217;s clear is that all of these exchanges allow derivatives trading of multiple assets, including SOL. When writing on November 7, SOL is a top-10 coin by market cap. Perched at seventh in the leaderboard, Solana has flipped Cardano, Dogecoin, and Tron, cementing its position considering the over $7 billion gap between the seventh and eighth projects in the market cap ranking.  The CVD measures the difference between buying and selling volume over a period. The tool can be used to identify trends. When rising, the uptrend might continue while a falling CVD points otherwise. SOL Trending At New 2023 Highs: Will The Uptrend Continue? At spot levels, SOL is also changing hands at around $43, trending at around 2023 highs after breaking above the resistance level at $32 in late October. The uptrend could continue, considering the surging interest Solana continues to garner. This may push the coin 2X to $80, a critical resistance, looking at the candlestick arrangement in the weekly chart.  This demand is primarily because of improving investor confidence and Solana Labs&#8217; decision to roll out new features and strike strategic partnerships, pulling more capital to SOL. Rising CVD could suggest that institutions might be eying SOL, aiming to ride the uptrend. Related Reading: Self-Authentication System Of Shiba Inu Has Technical Issues, Developer Reveals On November 6, the FTX estate transferred 750,000 SOL to Binance and Kraken. Although it couldn&#8217;t be verified that they sold, SOL prices retraced from recent highs. FTX, the defunct crypto exchange, controlled over $1.1 billion worth of SOL, and the estate manager has been gradually selling the coin and other crypto assets to repay creditors. Feature image from Canva, chart from TradingView"
  }
]