[
  {
    "source": "CoinDesk",
    "date": "2024-03-28T13:52:32.000Z",
    "title": "Dogecoin Bets Jump to $2B as Price Reaches Highest Level Since 2021",
    "url": "https://www.coindesk.com/markets/2024/03/28/dogecoin-bets-jump-to-2b-as-price-reaches-highest-level-since-2021/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "DOGE prices tend to move on speculation about the token's use on X, the Elon Musk-owned social media giant."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-28T14:04:48.000Z",
    "title": "Protocol Village: Degen Community, Syndicate Launch 'Degen Chain'",
    "url": "https://www.coindesk.com/tech/2024/03/27/protocol-village/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of March 28-April 3."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-28T13:57:49.000Z",
    "title": "Ethereum L2s face bottlenecks as ‘BlobScriptions’ drive fees up by over 10,000%",
    "url": "https://cryptoslate.com/ethereums-blob-faces-bottlenecks-as-blobscriptions-drive-fees-up-by-over-10000/",
    "description": "<p>Ethereum&#8217;s blobs transaction fees witnessed an unprecedented surge yesterday with the debut of &#8220;BlobScriptions.&#8221; Blobs represent a novel transaction type that alleviates layer-2 fees on the Ethereum network and was introduced through the Dencun upgrade. Since its inception, the minimum gas price for a Blob to secure inclusion in an Ethereum block has stood at [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ethereums-blob-faces-bottlenecks-as-blobscriptions-drive-fees-up-by-over-10000/\">Ethereum L2s face bottlenecks as &#8216;BlobScriptions&#8217; drive fees up by over 10,000%</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-28T13:57:07.000Z",
    "title": "The Reasons Behind BLD’s 200%+ Growth Prediction",
    "url": "https://cryptodaily.co.uk/2024/03/the-reasons-behind-blds-200-growth-prediction",
    "description": "Since the turn of the year, the cryptocurrency market has witnessed massive growth in value as all major currencies witnessed 50%+ in gains – Bitcoin leading the way with a 52% gain in 2024."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-28T14:03:58.000Z",
    "title": "Solana’s stellar performance shakes up the Altcoin market",
    "url": "https://www.cryptopolitan.com/solanas-performance-shake-the-altcoin-market/",
    "description": "The surge by Solana (SOL) has been accompanied by more than 850% over the past year, yielding much better rewards. Six months ago, CRO was trading at around $21; after spearheading this more recent bull run, CRO has now captured a price of over $200, which leaves its competitors like Ethereum, Cardano, and Chainlink with [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-28T14:00:00.000Z",
    "title": "Trader Makes $3M In 3 Days, Galaxy Fox Presale Soars Past $5.5M",
    "url": "https://www.cryptopolitan.com/trader-makes-3m-in-3-days-galaxy-fox-presale-soars-past-5-5m/",
    "description": "Two recent developments have made the crypto headlines recently. One is the trader who made&#160; $3 million by trading various meme coins. The other is the presale performance of the best upcoming ICO, Galaxy Fox. Let’s unravel these stories in this article. Meme Coin Mania Continues: A Trader&#8217;s Dream Run Remember the saying, &#8220;Go big [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-28T13:44:50.000Z",
    "title": "Federal Reserve gets more reasons to hold off on interest rate cuts",
    "url": "https://www.cryptopolitan.com/fed-gets-more-reasons-to-hold-off-rate-cuts/",
    "description": "The scenario with the Federal Reserve and interest rates is becoming akin to a suspense thriller where the hero, against all odds, refuses to throw in the towel. The latest updates from the Federal Reserve’s camp reveal a cautious stance towards the idea of slashing interest rates from their towering 23-year summit. Christopher Waller, a [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-28T14:00:39.000Z",
    "title": "Dogecoin Soars 17% To Break $0.21 As Volume Explodes",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-11-break-0-21-volume-explodes/",
    "description": "Dogecoin has jumped 17% in the past 24 hours to break past the $0.21 barrier as on-chain data shows a significant increase in volume for the memecoin. Dogecoin Beats Market With 17% Rally In The Last Day Most of the top cryptocurrencies have seen flat returns in the last 24 hours, but Dogecoin has gone its own way as the original meme coin has enjoyed a strong rally. Related Reading: Bitcoin “Liquid Inventory Ratio” Hits All-Time Low, What It Means The below chart shows what the asset&#8217;s performance has looked like during the last few days: The price of the coin appears to have sharply soared over the past day &#124; Source: DOGEUSD on TradingView In this latest rally, Dogecoin has surged more than 17% in the last 24 hours and has cleared the $0.21 level. Among the top 100 cryptocurrencies by market cap, only Bitcoin Cash (BCH) has registered comparable profits in the same period. DOGE still beats BCH in the 1-week timeframe, however, as the memecoin has managed returns of more than 40% in this period, while the Bitcoin hard-fork has seen 33%. The reason behind these two assets in particular seeing a strong performance may lie in the fact that Coinbase plans to add futures products for them starting the 1st of April. Litecoin (LTC) is also set to see a listing on the same day, but its performance has been much weaker than the other two. In terms of market cap, Dogecoin is currently the eighth-largest coin in the sector, as the table below shows: Looks like the market cap of the memecoin is just under $31 billion at the moment &#124; Source: CoinMarketCap From the table, it&#8217;s apparent that the gap to USD Coin (USDC) in seventh isn&#8217;t too much right now, so if Dogecoin can keep up its surge, it&#8217;s possible that it may be able to flip the stablecoin. DOGE Transaction Volume Has Observed A Sharp Increase Recently Something that would confirm that widespread speculation around Dogecoin is ripe for a rally currently would be its Transaction Volume. As a user on X pointed out using data from the on-chain analytics firm Santiment, DOGE&#8217;s Transaction Volume has shot up recently. The &#8220;Transaction Volume&#8221; keeps track of the total amount of tokens (in USD) for a given cryptocurrency that has observed some movement on the blockchain in the past 24 hours. When the value of this metric is high, it means that the users are transacting large amounts on the network right now. Such a trend implies the trading interest around the asset is high currently. On the other hand, low values of the indicator can be a sign that the general interest in the cryptocurrency, both as an asset and a network, is low at the moment. Related Reading: Bitcoin Coinbase Premium Returns To Neutral: Buying Push Already Over? Now, here is a chart that shows the trend in the Dogecoin Transaction Volume over the past year: The metric seems to have gone up in recent days &#124; Source: @trader_kamikaze on X As is visible in the chart, the Dogecoin Transaction Volume has experienced quite a boost recently, and what has accompanied this rise has been the latest rally. A rising volume can often be a positive sign for the sustainability of any rally, as it means that interest in the asset is going up, and thus, more fuel is potentially coming in. Something to keep in mind, though, is that selling and buying alike affect this indicator, so a mass selloff would also register as a spike in the metric. Thus, while high volumes are usually a requirement for rallies to continue (as without interest, the run can easily die down), they alone can&#8217;t predict a further rise, as the nature of this activity can be hard to ascertain. Featured image from Kanchanara on Unsplash.com, Santiment.net, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-28T14:00:02.000Z",
    "title": "Investors Flee Potential Downtrend On Ethereum Amid SEC Scrutiny To Chase High Returns On Milei Moneda",
    "url": "https://www.crypto-news-flash.com/investors-flee-potential-downtrend-on-ethereum-amid-sec-scrutiny-to-chase-high-returns-on-milei-moneda/?utm_source=rss&utm_medium=rss&utm_campaign=investors-flee-potential-downtrend-on-ethereum-amid-sec-scrutiny-to-chase-high-returns-on-milei-moneda",
    "description": "<img width=\"1200\" height=\"796\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/gettyimages-98950824-612x612-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/gettyimages-98950824-612x612-1.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/gettyimages-98950824-612x612-1-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/gettyimages-98950824-612x612-1-768x509.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/gettyimages-98950824-612x612-1-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/gettyimages-98950824-612x612-1-450x299.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Investors are preparing for a bullish period for Ethereum. A potential pump brings investors to Milei Moneda. The US Securities and Exchange Commission takes interest in Ethereum (ETH) as the deadline for the approval of eight Ethereum ETF applications looms near. Meanwhile, Milei Moneda’s ($MEDA) presale attracts investors with the possibility of huge gains.  How [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-28T13:59:19.000Z",
    "title": "VeChain’s Growing Adoption Triggers Optimism: VET Price Targets 100% Increase",
    "url": "https://www.crypto-news-flash.com/vechains-growing-adoption-triggers-optimism-vet-price-targets-100-increase/?utm_source=rss&utm_medium=rss&utm_campaign=vechains-growing-adoption-triggers-optimism-vet-price-targets-100-increase",
    "description": "<img width=\"1200\" height=\"588\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/vechain-VET.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/vechain-VET.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/vechain-VET-300x147.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/vechain-VET-768x376.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/vechain-VET-150x74.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/vechain-VET-450x221.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />VeChain has been tipped for a 100% explosive run that could see the asset breaching its all-time high of $0.2.  Another analyst has observed the formation of a cloning pattern, putting VET in line to hit $1.6.  The groundbreaking initiatives of VeChain (VET) unlocking new use cases across a variety of fields could spearhead an [...]"
  }
]