[
  {
    "source": "Decrypt",
    "date": "2024-04-05T21:42:57.000Z",
    "title": "'Nyan Heroes' Tops 100K Players on Epic Games, Reveals Solana NFT Rewards",
    "url": "https://decrypt.co/225055/nyan-heroes-100k-players-epic-games-solana-nft-rewards",
    "description": "With just days remaining in the pre-alpha demo test, Nyan Heroes is tempting players with Solana NFT rewards to climb the leaderboards."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-05T22:01:03.000Z",
    "title": " Advocacy groups warn of ‘adverse repercussions’ for crypto in case against Tornado Cash co-founder ",
    "url": "https://cointelegraph.com/news/blockchain-association-amicus-brief-tornado-cash",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvNDA1N2U5OTMtN2RhZS00MjcyLWIwM2ItMDkwNzM4YmY4ZjM3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Blockchain Association, Coin Center and DeFi Education Fund supported a motion for the U.S. government to dismiss charges against Roman Storm.</p>\n                    <p><p>Representatives of three United States-based cryptocurrency advocacy organizations have filed amicus briefs in support of a motion to dismiss the charges against Tornado Cash co-founder Roman Storm.</p><p>In April 5 filings in U.S. District Court for the Southern District of New York, the Blockchain Association, Coin Center and DeFi Education Fund <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.604938/gov.uscourts.nysd.604938.39.0_1.pdf\" target=\"_blank\" rel=\"noopener nofollow\">argued</a> that Tornado Cash did not have control of the funds or messages users sent through the cryptocurrency mixer. The advocacy groups separately claimed that the three felony counts Roman faces should be dismissed, citing First Amendment issues regarding the Tornado Cash co-founder allegedly violating sanctions and the U.S. government “misunderstand[ing] the basic relationship between smart contract protocols and their developers” regarding allegations of money laundering.</p><p>“Adoption of the government’s legal theory would not only have adverse repercussions for the digital asset industry but also raise serious concerns regarding fintech more generally,” <a href=\"https://theblockchainassociation.org/blockchainassociation-files-amicus-brief-in-dojs-case-against-tornado-cash-developers/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Blockchain Association Head of Legal Marisa Coppel. “We urge the court to hold the government up to its burden and dismiss the unfounded charges, safeguarding both the defendants’ rights and the integrity of the burgeoning digital asset sector.”</p><p><a href=\"https://cointelegraph.com/news/blockchain-association-amicus-brief-tornado-cash\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-05T21:43:22.000Z",
    "title": " Massive SOL liquidation by FTX estate nets nearly $2B ",
    "url": "https://cointelegraph.com/news/massive-sol-liquidation-by-ftx-estate-nets-nearly-2-billion",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvZWQ3ZWEwYzUtYmM1Yi00OTcxLWE3ZjMtOWVjNTAyOWY0ZDc0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Galaxy Trading, Pantera Capital, and Neptune Digital Assets have acquired nearly two-thirds of FTX’s stake in SOL.</p>\n                    <p><p>The FTX estate unloaded over half of its Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) tokens at a 63% discount from current prices, <a href=\"https://www.bloomberg.com/news/articles/2024-04-05/ftx-s-solana-sale-galaxy-pantera-buy-tokens-at-64-sol\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to a Bloomberg report on April 5. SOL tokens represent the majority of the bankrupt exchange’s assets.</p><p>The sale received interest from asset managers and venture capitalists, including Galaxy Trading and Pantera Capital, people familiar with the matter told Bloomberg. </p><p>The bankrupt exchange sold between 25 million and 30 million locked-up SOL coins at $64 a token, generating around $1.9 billion for FTX creditors. FTX was an early investor in Solana. Its 41 million SOL tokens are subject to a four-year vesting schedule, meaning they cannot be traded in the market until the deadline passes.</p><p><a href=\"https://cointelegraph.com/news/massive-sol-liquidation-by-ftx-estate-nets-nearly-2-billion\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-05T22:08:58.000Z",
    "title": "Ellipsis Labs secures $20 million in Series A funding",
    "url": "https://www.cryptopolitan.com/ellipsis-labs-20-million-series-a-funding/",
    "description": "Cryptocurrency developer Ellipsis Labs has finalized a Series A funding round, securing $20 million. According to its post on X (formerly Twitter), the investment round was led by Paradigm with additional support from Electric Capital. Other participants include Ethereum Foundation’s Justin Drake and Mike Neuder, Solana co-founder Anatoly Yakovenko, EigenLayer’s Sreeram Kannan, and a few [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-05T21:45:38.000Z",
    "title": "Binance threatens full restrictions on unverified sub-account holders",
    "url": "https://www.cryptopolitan.com/binance-restrictions-sub-accounts-holders/",
    "description": "Cryptocurrency exchange Binance has announced measures that will be taken against users with accounts on its Exchange Link program. According to the announcement, Binance has mandated users of sub-accounts to ensure prompt completion of their mandatory Know Your Customer (KYC). The exchange noted that only users who have complied with the directive will be allowed [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-05T22:00:04.000Z",
    "title": "FTX Estate Offloads $1.9 Billion Worth Of Locked Solana (SOL) Tokens In Sale",
    "url": "https://www.newsbtc.com/news/solana/ftx-estate-offloads-1-9-billion-worth-of-locked-solana-sol-tokens-in-sale/",
    "description": "In a significant development, FTX bankruptcy trustees have reportedly sold about two-thirds of a $2.6 billion stash of Solana (SOL) at a &#8220;deeply discounted price.&#8221;  Industry figures such as Galaxy Trading and Pantera Capital were among the investors involved in the deal, according to people familiar with the matter, as reported by Bloomberg. SOL Tokens&#8217; Four-Year Journey Per the report, the FTX estate was able to sell between 25 million and 30 million locked-up Solana coins at $64 each, generating up to $1.9 billion in proceeds for the estate.  Under Mike Novogratz&#8217;s Galaxy Digital, Galaxy Trading managed to raise approximately $620 million for a fund established to purchase SOL from the FTX estate. According to the report, investors in the vehicle will be subject to a 1% management fee, and the investment will offer a yield through staking. Related Reading: Dogecoin Deflates: What’s Behind The 20% Price Drop Amidst Memecoin Mania? It is worth noting that the 41 million Solana tokens sold by the FTX estate are locked according to a pre-agreed vesting period, preventing them from being available for trading on the market.  According to Bloomberg, these tokens will gradually become available for sale over the course of four years, which could significantly impact SOL&#8217;s price action. However, as the tokens remain locked, SOL&#8217;s 739% year-to-date (YTD) uptrend remains intact, and the possibility for further gains remains in the cards. Solana Sale Garners Interest From Prominent Figures FTX co-founder Sam Bankman-Fried, convicted of fraud and sentenced to 25 years in prison, was a major supporter of SOL.  As previously reported, Bankman-Fried has actively engaged with guards at the Metropolitan Detention Center, where he is currently incarcerated. He offers investment advice and recommends SOL as a potential opportunity, demonstrating his bullish sentiment on the protocol.  The token, which operates on the Solana blockchain, constituted a significant portion of the digital assets stranded on the collapsed exchange, creating shockwaves throughout the crypto markets.  In addition to Galaxy Digital, Bloomberg notes that selling SOL tokens has attracted the attention of Pantera Capital. This $5.2 billion asset manager has reportedly raised capital for a special fund to acquire up to $250 million of SOL from the FTX estate.  Vancouver-based Neptune Digital Assets Corp. also announced the purchase of 26,964 SOL tokens for $1.7 million on March 27. However, FTX creditors are concerned they will be under-compensated in the SOL sale process.  Creditors Dispute FTX Bankruptcy Ruling In January, the judge overseeing the bankruptcy case ruled that the amount of each claim should be based on what the customer or creditor was owed on the day FTX filed for bankruptcy. At that time, SOL was trading at about $16, well below its current market price. As the price of SOL rallied in recent months, this discrepancy became a point of contention for some creditors. One creditor, Sunil Kavuri, expressed during Bankman-Fried&#8217;s final sentencing hearing that the SOL coins are &#8220;our property.&#8221;  Related Reading: Crypto Analyst Predicts ADA Price Crash To $0.34, Why Is Cardano Founder Bullish? Another creditor, whose name was redacted in court documents, stated in a written statement that the FTX estate is &#8220;giving away money for free to hedge funds.&#8221; In a recent interview, Bankman-Fried claimed the following regarding clients&#8217; growing concerns about underpayment:  I&#8217;ve heard and seen the despair, frustration, and sense of betrayal from thousands of customers; they deserve to be paid in full, at current price. That could and should have happened in November 2022, and it could and should happen today. It&#8217;s excruciating to see them waiting, day after day.  Currently, the price of SOL stands at $175, reflecting a decrease of up to 6.7% within the last 24 hours and over 7% over the past week. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-04-05T22:04:47.000Z",
    "title": "$90,000,000,000,000 Transfer of Wealth Is Underway – Along With ‘Debt After Death’ Tidal Wave: Report",
    "url": "https://dailyhodl.com/2024/04/05/90000000000000-transfer-of-wealth-is-underway-along-with-debt-after-death-tidal-wave-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/04/trillion-dollars-wealth.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/04/trillion-dollars-wealth.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/04/trillion-dollars-wealth.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/04/trillion-dollars-wealth.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/04/trillion-dollars-wealth.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/04/trillion-dollars-wealth.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/04/trillion-dollars-wealth.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An estimated $90 trillion transfer of wealth is now underway as baby boomers begin to give assets to their children – and a new survey shows a massive transfer of debt is happening at the same time. A whopping 46% of Americans expect to pass on some form of debt when they pass away, according [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/04/05/90000000000000-transfer-of-wealth-is-underway-along-with-debt-after-death-tidal-wave-report/\">$90,000,000,000,000 Transfer of Wealth Is Underway – Along With &#8216;Debt After Death&#8217; Tidal Wave: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-04-05T22:01:52.000Z",
    "title": "First ‘Bitcoin Diploma’ Recipients Graduate From El Salvador’s New BTC Education Program",
    "url": "https://dailyhodl.com/2024/04/05/first-bitcoin-diploma-recipients-graduate-from-el-salvadors-groundbreaking-btc-education-program/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-institutional-grade-asset.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-institutional-grade-asset.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-institutional-grade-asset.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-institutional-grade-asset.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-institutional-grade-asset.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-institutional-grade-asset.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/09/bitcoin-institutional-grade-asset.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>El Salvador is handing out the first-ever batch of “Bitcoin Diplomas” as students graduate from the nation’s cutting-edge Bitcoin (BTC) education program. According to El Salvador’s Mi Primer Bitcoin, earlier this week, students completed a 10-week-long educational program, which teaches children the history and technology behind the top crypto asset by market cap for free. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/04/05/first-bitcoin-diploma-recipients-graduate-from-el-salvadors-groundbreaking-btc-education-program/\">First ‘Bitcoin Diploma’ Recipients Graduate From El Salvador’s New BTC Education Program</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]