[
  {
    "source": "Decrypt",
    "date": "2023-08-21T18:17:52.000Z",
    "title": "Market Is Sleeping on These AI Investments, Says Ark",
    "url": "https://decrypt.co/153202/market-is-sleeping-on-these-ai-investments-says-ark",
    "description": "Cathie Wood's investment firm urges caution before looking to mega cap tech giants for AI exposure. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T18:20:17.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Some European users have reported difficulties withdrawing funds from crypto exchange Binance. Meanwhile, new decentralized social media app friend.tech has become a central talking point among the crypto community and the aforementioned Binance is considering legal action against former partner Checkout.com.</p><h3>Binance limits European withdrawals over payment processing issues</h3><p>Cryptocurrency exchange Binance has reportedly <a href=\"https://cointelegraph.com/news/binance-limits-withdrawals-in-europe\">limited withdrawals for certain European users</a> due to issues related to Single Euro Pays Area (SEPA) transfers. </p><p>A Binance customer support representative wrote on Twitter/X that euro withdrawals via SEPA were suspended. However, the post was later deleted, with Binance telling Cointelegraph that: “The SEPA deposit and withdrawal service will continue until 25 September as originally communicated” and that the “Customer Support message was sent in error.” </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/d0e32309-fe56-4cdf-8708-64d5fee03dab.png\"  /></figure><p>In a separate message to Cointelegraph, a Binance spokesperson said: “Some users may occasionally be asked for more information as part of routine compliance checks, which could lead to early closure of their accounts.”</p><p>The confusion stemmed from Binance users in Europe claiming to have withdrawal issues. One user, in particular, claimed to have bought a large amount of euros on Binance but was unable to withdraw the fiat funds due to the closure of their Paysafe account. </p><p>Paysafe was Binance’s euro banking partner — it announced in June it would <a href=\"https://cointelegraph.com/news/binance-loses-support-of-euro-banking-partner\">no longer support the crypto exchange</a> beginning in September. </p><h3>friend.tech generates $1M fees, critics warn it won't last</h3><p>Friend.tech, a new decentralized social media app, has rapidly become one of the hottest new things in crypto, though some users are concerned its model <a href=\"https://cointelegraph.com/news/friendtech-social-media-app-how-long-will-it-last\">won’t stand the test of time</a>. </p><p>The social media app, built on Base, has already garnered over 64,000 new users and more than 24,000 ETH in trading volume since its beta version launch on Aug. 11. </p><p><a href=\"https://defillama.com/fees\" target=\"_blank\" rel=\"noopener nofollow\">According </a>to data from DefiLlama, friend.tech has <a href=\"https://cointelegraph.com/news/friendtech-generates-over-1m-fees-surpassing-uniswap-bitcoin-networks\">generated $1.42 million in fees</a> in the last 24 hours and $4.2 million since its public launch.</p><p>At the time of publication, the total revenue for the project stands at $1.88 million, and it has witnessed over 724,000 <a href=\"https://dune.com/austin_adams/friendstech-dashboard\" target=\"_blank\" rel=\"noopener nofollow\">transactions</a> from more than 64,500 unique traders.</p><p>However, some friend.tech observers have warned it’s getting too hot too quickly.</p><p>Speaking to Cointelegraph, one crypto commentator, Yazan believes the app has between six and eight weeks before both share prices and general activity begin to nosedive.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Let me tell you one thing.<br><br>Something isn’t right about <a href=\"https://twitter.com/friendtech?ref_src=twsrc%5Etfw\">@friendtech</a>.<br><br> Creators making money from a group chat that doesn’t even work when you can’t even reply directly to people?<br><br> The way pricing works is ridiculous and can be easily taken advantage of.<br><br> Pumps and dumps. <a href=\"https://t.co/TJqcktEM6P\">pic.twitter.com/TJqcktEM6P</a></p>&mdash; Yazan (@YazanXBT) <a href=\"https://twitter.com/YazanXBT/status/1693086023058694222?ref_src=twsrc%5Etfw\">August 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Another crypto user, pseudonymous Web3 marketer Legendary, said it could draw parallels to BitClout — a predecessor DeSo app from 2021. </p><p>“I think the platform will collapse as BitClout did. We are in a bear market, and there’s nothing to do. Everyone jumps on an opportunity to make money, but I think the platform will be done within the next weeks to months,” he wrote.</p><p>That being said, some also see the app as having more room to grow, contrasting the naysayers.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Wanted to write down my thesis around <a href=\"https://twitter.com/friendtech?ref_src=twsrc%5Etfw\">@friendtech</a> and why I think it could keep growing &amp; bring some much needed adoption to the first iterations of Web3 Social<br><br>since I faded the tg bots growth, I promised myself to be more proactive when potential new Metas pop up<br><br></p>&mdash; dragos (@DrgStefanescu) <a href=\"https://twitter.com/DrgStefanescu/status/1692572444651929895?ref_src=twsrc%5Etfw\">August 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Binance considers legal action against Checkout.com</h3><p>Crypto exchange Binance told Cointelegraph on Aug. 18 that it is <a href=\"https://cointelegraph.com/news/binance-considers-legal-action-against-checkoutcom-partnership-ends\">considering legal action</a> against its former partner and payment provider Checkout.com. The potential legal dispute came roughly one week after Checkout.com reportedly ended its business relationship with Binance over possible regulatory actions.</p><p>“We do not agree with Checkout’s purported basis for termination and are considering our options for legal action,” a Binance spokesperson told Cointelegraph. </p><p>The business fallout has already impacted Binance. Earlier this week, the company confirmed that it is <a href=\"https://cointelegraph.com/news/binance-connect-shutting-down-august-16\">shutting down Binance Connect</a>, a regulated fiat-to-crypto payment platform, due to “changing market and user needs.\" Binance Connect launched in March 2022 as Bifinity. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today we charged Binance Holdings Ltd. (Binance); U.S.-based affiliate, BAM Trading Services Inc., which, together with Binance, operates <a href=\"https://t.co/swcxioZKVP\">https://t.co/swcxioZKVP</a>; and their founder, Changpeng Zhao, with a variety of securities law violations.<a href=\"https://t.co/H1wgGgR5ir\">https://t.co/H1wgGgR5ir</a> <a href=\"https://t.co/IWTb7Et86H\">pic.twitter.com/IWTb7Et86H</a></p>&mdash; U.S. Securities and Exchange Commission (@SECGov) <a href=\"https://twitter.com/SECGov/status/1665779371108335618?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Binance faces myriad regulatory challenges, culminating in a Securities and Exchange Commission lawsuit against the exchange and its CEO, Changpeng Zhao.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T18:13:58.000Z",
    "title": "Price analysis 8/21: SPX, DXY, BTC, ETH, BNB, XRP, ADA, DOGE, SOL, DOT",
    "url": "https://cointelegraph.com/news/price-analysis-8-21-spx-dxy-btc-eth-bnb-xrp-ada-doge-sol-dot",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/b9aa2266-fb78-4a06-a295-3e4dda3b7052.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin and select altcoins are starting to recover, but selling at the top of each price breakout suggests that bears remain in control.</p>\n                    <p><p>After the sharp fall on Aug. 17, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) remained stuck inside a tight range over the weekend. This suggests indecision between the bulls and the bears about the next directional move. </p><p>After the latest fall, about 88% of Bitcoin held by Short-term Holders (STHs), owning Bitcoin for 155 days or less, has <a href=\"https://cointelegraph.com/news/bitcoin-speculators-underwater-btc-bags-research\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-speculators-underwater-btc-bags-research/amp\">plunged into loss</a>, according to Glassnode’s weekly newsletter, “The Week On-Chain.” Glassnode warns that the STH cohort is “increasingly price sensitive.”</p><p>In comparison, the long-term holders have neither panicked nor gone on a shopping spree during the current fall.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/0c7bcc96-1449-4c53-ad5e-52ba8924d313.png\"><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>Traders are likely to keep a close watch on the United States Federal Reserve Chairman Jerome Powell’s speech at the annual Jackson Hole Economic Symposium on Aug. 25. If Powell does not spring a negative surprise, then the event may turn out to be bullish for risky assets. History suggests that U.S. stocks generally rise in the week after Jackson Hole.</p><p>What are the important support and resistance levels to watch for in Bitcoin and altcoins? Let’s analyze the charts to find out.</p><h2>S&P 500 Index price analysis</h2><p>The S&P 500 Index (SPX) is correcting in an uptrend. Typically pullbacks are a buying opportunity in an uptrend but it is prudent to wait for the correction to end before resuming the purchases.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2765d87a-4a28-4056-8783-268a3e5cf72c.png\"><figcaption style=\"text-align: center;\"><em>SPX daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=TVC%3ASPX\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The price has reached the breakout level of 4,307, which is an important level to keep an eye on. The moving averages are on the verge of a bearish crossover and the relative strength index (RSI) is in the negative territory, indicating that bears are trying to seize control.</p><p>A bounce off the current level is again likely to face selling at the moving averages. If the price turns down from the moving averages, the index will be at risk of forming a bearish head and shoulders pattern.</p><p>On the contrary, a rally above the moving average will indicate that the corrective phase may be over.</p><h2>U.S. dollar index price analysis</h2><p>The U.S. dollar index (DXY) recovered to the downtrend line where the bears are posing a strong challenge. However, the index has not lost ground, indicating that the bulls have kept up the buying pressure.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/5d8d9867-e4e0-4771-abb5-ca9418c33d85.png\"><figcaption style=\"text-align: center;\"><em>DXY daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=TVC%3ADXY\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If buyers propel the index above the downtrend line, it will suggest that the bears are losing their grip. The index could then resume its recovery and reach the stiff overhead resistance at 106. This level is again likely to attract strong selling by the bears.</p><p>The moving averages are the important support to watch out for on the downside. The bears will have to sink the price below the 50-day simple moving average (102) to signal a comeback. That could open the doors for a retest of the strong support near 101. </p><h2>Bitcoin price analysis</h2><p>Bitcoin has been consolidating inside a large range between $24,800 and $31,000 for the past several weeks. Inside a range, traders buy the dips to the support and sell near the overhead resistance. In between, trading may be random and volatile.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/d12a3b6a-b025-4426-b535-aa95165c5a07.png\"><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The moving averages have turned down and the RSI is in the oversold territory, indicating that bears are firmly in control. Sellers will try to build upon their advantage by yanking the price below $24,800 but the bulls are unlikely to give up easily.</p><p>The buyers will try to start a recovery from the support, which is likely to pick up momentum above $26,833. The BTC/USDT pair may then rise to the 20-day EMA ($28,098), signaling that the range-bound action remains intact.</p><h2>Ether price analysis</h2><p>Ether’s (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) bounce is struggling to rise above $1,700, indicating that the bears have not given up and are selling on minor rallies. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/e9b02290-fd8c-4de6-aa89-fe951a408b54.png\"><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AETHUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>A shallow bounce usually indicates a lack of urgency among the bulls to buy. That increases the risk of a breakdown below the support. If the price turns down and slips below $1,626, it will suggest that bears remain in command. The ETH/USDT pair may then retest the intraday low of $1,550 made on Aug. 17.</p><p>Contrarily, if the price turns up from the current level and rises above $1,700, it will suggest the start of a stronger recovery. The first stop may be the 20-day EMA ($1,777) but if this level is crossed, the pair may reach the 50-day SMA ($1,852).</p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/binance-coin-price-index\">BNB</a>) tumbled below the vital support at $220 on Aug. 17 and the bears have managed to defend the level since then. This suggests that the bears are trying to flip the $220 level into resistance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/59d245bd-9976-4f01-93ce-2e391985aeb7.png\"><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABNBUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The price crashed below the immediate support at $212 on Aug. 21, indicating the resumption of the downtrend. The BNB/USDT pair could first plummet to the pattern target of $196 and eventually to the next major support at $183.</p><p>Time is running out for the bulls. If they want to salvage the situation, they will have to quickly drive and sustain the price above $220. The pair could then rise to the 20-day EMA ($230), which may again act as a stiff barrier.</p><h2>XRP price analysis</h2><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/xrp-price-index\">XRP</a>) bounced off the strong support at $0.41 on Aug. 17 and reached the overhead resistance at $0.56 on Aug. 20.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2b778ffc-cfa0-40a6-b10e-3235b1776763.png\"><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AXRPUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears are trying to stall the relief rally near $0.56, indicating that the sentiment remains negative and traders are selling on every minor rise. If the price turns down and skids below $0.48, it will suggest that the XRP/USDT pair may swing between $0.41 and $0.56 for a few days.</p><p>The downsloping 20-day EMA ($0.59) and the RSI near the oversold zone signal that bears have the edge. The first sign of strength will be a break and close above the 20-day EMA. That will indicate that the bearish pressure may be reducing.</p><h2>Cardano price analysis </h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) snapped back from the crucial support at $0.24 on Aug. 17 but the relief rally is facing resistance at the overhead resistance near $0.28. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/fd0529c6-ce66-4f7a-be4c-58292c95fa98.png\"><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AADAUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The downsloping 20-day EMA ($0.28) and the RSI in the negative area suggest that bears have the upper hand. If the price slips below $0.26, it will indicate that the ADA/USDT pair may oscillate inside the tight range between $0.28 and $0.24 for a while longer.</p><p>Generally, a tight consolidation near a strong support is a negative sign and it may result in a breakdown. If the $0.24 support gives way, the pair may plunge to $0.22 and then to $0.20. If buyers want to prevent the decline, they will have to quickly thrust the price above the moving averages.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-limits-withdrawals-in-europe\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-limits-withdrawals-in-europe/amp\"><em>Binance limits withdrawals in Europe, cites payment processor issues</em></a></p><h2>Dogecoin price analysis</h2><p>The bulls have managed to keep Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) above the essential support at $0.06 for the past few days but they have failed to start a strong bounce.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/80cab0ee-3e3b-42ab-9010-3d6b3cbf927f.png\"><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOGEUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The shallow bounce suggests a negative sentiment where the bulls are not buying aggressively. This may have encouraged the bears to seize control and they have pulled the price to the strong support at $0.06.</p><p>If the price breaks below $0.06, the DOGE/USDT pair could nosedive toward the next solid support near $0.05. Alternatively, if the price turns up from the current level, it will indicate that lower levels are attracting buyers. The pair may then climb to the moving averages. A break above the 50-day SMA ($0.07) could start a sustained recovery.</p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) bulls are facing stiff resistance from the bears near the overhead resistance at $22.30. This suggests that the bears are trying to flip the $22.30 level into resistance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/36249e8d-9ce0-4f02-87fe-7d621f74695d.png\"><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ASOLUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The moving averages have completed a bearish crossover and the RSI is in the negative zone, indicating that bears have the edge. The SOL/USDT pair could retest the support at $20. If this level gives way, the pair may start a deeper correction to $18 and subsequently to $15.60.</p><p>If the bulls want to make a comeback, they will have to kick the price above the moving averages. It is going to be a tough ask but if they manage to do it, the pair may rally to the overhead resistance zone between $26 and $27.12.</p><h2>Polkadot price analysis</h2><p>Polkadot (<a href=\"https://cointelegraph.com/polkadot-price-index\">DOT</a>) formed a Doji candlestick pattern on Aug. 19 and 20, indicating that the buying pressure has been reducing.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/230f2da0-7570-4aab-a405-5e1e5b66b5a4.png\"><figcaption style=\"text-align: center;\"><em>DOT/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AMATICUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If the price continues lower and breaks below $4.36, it will suggest that bears are trying to gain the upper hand. The DOT/USDT pair could then retest the pivotal support at $4.22. If this level caves in, the selling may accelerate and the pair could start the next leg of the downtrend.</p><p>Conversely, if the price turns up and breaks above $4.56, it will suggest that bulls are making a comeback. The pair could then rally to the 20-day EMA ($4.79), which is again likely to behave as a roadblock.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T18:35:09.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices to consider when investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T18:22:54.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 As we venture into 2023 to 2032, the next decade promises to be a critical period for Aptos as it strives to establish itself as a significant blockchain platform. The rapidly changing market dynamics, technological advancements, and evolving adoption trends will undoubtedly shape Aptos&#8217;s path. Against this backdrop, investors and stakeholders ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T18:16:01.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-21T18:23:00.000Z",
    "title": "XRP Maxis Predict Bullish Run, Community Unshaken by SEC Appeal",
    "url": "https://coinedition.com/xrp-maxis-predict-bullish-run-community-unshaken-by-sec-appeal/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/xrp01.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/xrp01.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/xrp01-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/xrp01-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/xrp01-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/xrp01-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/xrp01-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/xrp01-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/xrp01-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/xrp01-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/xrp01-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/xrp01-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/xrp01-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/xrp01-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/xrp01-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/xrp01-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/xrp01-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Amidst prevailing fears of a continued crypto market decline, XRP maxis believe the token might be getting closer to its next pump. XRP, which is the native token of Ripple network, and the subject of the ongoing SEC v Ripple legal tussle, surged over the weekend, despite major cryptocurrencies declining. According to a crypto Youtuber, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-maxis-predict-bullish-run-community-unshaken-by-sec-appeal/\">XRP Maxis Predict Bullish Run, Community Unshaken by SEC Appeal</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]