[
  {
    "source": "Cointelegraph",
    "date": "2023-06-04T13:01:00.000Z",
    "title": "Cryptocurrency markets’ low volatility: A curse or an opportunity?",
    "url": "https://cointelegraph.com/news/cryptocurrency-markets-low-volatility-a-curse-or-an-opportunity",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/75654e2e-789c-4a17-89d8-accdfd063074.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The cryptocurrency market has been experiencing low volatility for the past two months, but does that mean investors should just sit and wait?</p>\n                    <p><p>Cryptocurrency markets are well-known for their volatility, where large price swings help investors create or lose fortunes. Yet there are often periods of relative stability where the tight price action bores some while being an opportunity for others.</p><p>Since the beginning of the year, Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price has soared by over 60%, climbing from around $18,000 to over $27,000 at publishing time. However, the cryptocurrency has been stuck in a narrow range for the past two months, fluctuating between $26,000 and $29,000. It has occasionally attempted to break out above $30,000 but also faced some dips to $25,500.</p><p>According to CCData, Bitcoin’s volatility has dropped to 48.2% this year from 62.8% last year and from 79% in 2021. The cryptocurrency’s average daily change so far this year has been steady, with gains of 1.68% and losses of 1.93%.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">/1 Latest CCData insights reveal <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> volatility has dipped to 48.2% in 2023, from 62.8% in 2022 &amp; 79.0% in 2021. <br><br>Its 2023 trading range also shows more stability, with an average 1.68% increase &amp; a 1.93% decrease. <a href=\"https://t.co/y0zBMA3kpU\">pic.twitter.com/y0zBMA3kpU</a></p>&mdash; CCData (@CCData_io) <a href=\"https://twitter.com/CCData_io/status/1661008078962323456?ref_src=twsrc%5Etfw\">May 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Investors have a number of options at their disposal to generate more during periods of low volatility, including simply lending their tokens out via decentralized finance (DeFi) protocols or through centralized exchanges. Other alternatives include staking and advanced strategies using derivatives like options and futures.</p><p>Given the highly volatile nature of the cryptocurrency sector, this tight trend is interesting. Similarly stable periods in the past have been followed by significant price movements, either to the upside or the downside, but stability doesn’t mean there aren’t strategies that can help boost investors’ returns.</p><h2>Crypto traders are expecting low volatility</h2><p>While the most often-used strategy during these periods is to just hodl tokens while waiting for green candles, there are numerous strategies that can be used during sideways markets, including some market-neutral approaches that allow investors to take advantage of these periods, especially if they suspect when they might end.</p><p>Speaking to Cointelegraph, David Duong, head of institutional research at Coinbase, noted that the tight price action in the cryptocurrency space was partly driven by a sharp United States dollar retracement, with many traders sitting on the sidelines “waiting for a clear trend to emerge.”</p><p>Duong added that “many digital assets are still trading within well-defined ranges,” stating:</p><blockquote>“If we look at the options space, we have seen implied volatility soften to some of the weakest levels in recent memory. For example, the 1M ATM 30D [one-month at-the-money 30-day] implied volatility for both Bitcoin and Ether are now near 41% as of May 30, almost 10 volume points lower than they were one month ago.”</blockquote><p>The Coinbase executive’s statement points to low market expectations of significant price swings for both Bitcoin and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). Duong reiterated Coinbase’s stance that it’s “constructive on Bitcoin and the wider crypto market over the next six to 12 months, based on our Fed and macro views.”</p><p>Ahmed Ismail, CEO and founder of crypto liquidity aggregator Fluid, told Cointelegraph that during these periods,<a href=\"https://cointelegraph.com/news/pro-traders-know-it-s-time-to-range-trade-when-this-classic-pattern-shows-up\"> range trading</a> is a “particularly attractive strategy” that aims to “take advantage of price oscillations, and tight price action can provide more precise entry and exit points for range traders.”</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/europe-s-right-wing-political-groups-find-cause-in-crypto\">Europe’s right-wing political groups find cause in crypto</a></em></strong></p><p>Ismail added that flat price action tends to “recede periods of extreme price moves triggered by big events” and noted traders are eyeing multiple potential catalysts, which include the potential collapse of regional U.S. banks and the Federal Reserve’s upcoming decision on short-term interest rates.</p><p>Becky Sarwate, head of communications and brand at cryptocurrency exchange CEX.io, pointed out that periods of “stablecoin-like activity can invite a reflective period for traders to reevaluate their approach or consider alternative pathways through the ecosystem.”</p><p>Sarwate added that Bitcoin has similarly consolidated and saw its volatility drop in January 2023 before breaking out, although she warned traders “should always be cautious to chase the memory of historical events,” concluding:</p><blockquote>“While it can be tempting to look for familiar patterns, it’s important to remember that market conditions are always in flux and can not be relied upon to replicate.”</blockquote><p>Konstantin Horejsi, chief product officer at cryptocurrency exchange Blocktrade, said that such tight price action affects short-term trading activity, but told Cointelegraph that those who “believe in the long-term value proposition of digital assets” are still holding onto them or adding via dollar-cost averaging strategies.</p><p>While traders expecting lower volatility may have an impact on trading volumes, it doesn’t necessarily mean things aren’t happening as there are numerous strategies that can be used during these periods.</p><h2>Managing risk during sideways markets</h2><p>When asked what strategies can be used to manage risk during periods in which the market keeps moving sideways, CEX.io’s Sarwate said that price consolidations and bear markets “can become timely moments to revisit and potentially rebalance one’s crypto portfolio.”</p><p>To Sarwate, these periods of relative stability can “provide the breathing room necessary to make tactical decisions.” Traditional and liquid staking opportunities CEX.io’s market research team has been tracking, she added, have led to increased network participation that’s “measurable across a breadth of wallet denominations” as staking services can “offer intuitive on-ramps for participants looking to explore the digital economy.”</p><p>Tools like stop orders may lose their effectiveness during these periods, Sarwate said, while liquidity shortages “can risk leaving some actions unfulfilled.” As such, it’s important to have a<a href=\"https://cointelegraph.com/learn/how-to-trade-cryptocurrencies-the-ultimate-beginners-guide\"> firm grasp on resistance and support levels</a>, she stated.</p><p>Ismail said that it’s important to calibrate risk by “determining what portion of your portfolio you wish to allocate to crypto for the long term” and suggested the best strategy was to just keep accumulating:</p><blockquote>“The best strategy for an average crypto investor is to dollar-cost average, or DCA, over time. Instead of trying to time the market by predicting the price moves, build up a solid position in your preferred crypto by regularly investing a fixed sum regardless of current market conditions.”</blockquote><p>Increasing cash allocations, he said, could also be viable. More sophisticated traders can nevertheless find opportunities in options even when prices are stagnant, Ismail added, noting that “only a small percentage of options traders make money.”</p><p>Managing risk is “an ongoing process” so investors should “regularly evaluate and adjust” their risk management strategies while reviewing their portfolios as market conditions change.</p><p>Speaking to Cointelegraph, a spokesperson for leading stablecoin issuer Tether said that during periods of tight price action, risk management can “involve diversification across different assets, employing stop-loss orders and monitoring market indicators for potential shifts.”</p><p>Managing risk is clearly a priority when markets give investors some time to breathe, but as the dust settles, it may be hard to tell if and when things are going to become more volatile again.</p><h2>Potential breakout indicators</h2><p>The Tether spokesperson said that investors should look for indicators such as “increased trading volume, volatility expansion or significant news or events that may precede a breakout from tight price action not only in the crypto market but also in the traditional financial markets.”</p><p>Ismail corroborated that volume is something to keep an eye on, as “increasing trading volume suggests market participants are becoming more active, which tends to accompany price movements.” Technical analysis such as chart patterns, he added, could also provide clues on a potential breakout.</p><p>Looking at potential signs of a breakout, Sarwate dug deeper, pointing out that on-chain anomalies can often attract attention during these periods. Outsized spikes in key variables or heightened activity could “read as gesturing towards a pending action,” she said, adding:</p><blockquote>“Traders will often have a unique combination of metrics, or a specific trend they monitor that signals to them when something’s moving in the water. However, any such hunches should be rigorously investigated and ideally cross-referenced as much as possible to ensure their validity before committing to a course of action.”</blockquote><p>While traders rely on these metrics to help them attempt to time the market — something many have warned against — they may also use the time they have to wait to capitalize on their holdings.</p><h2>Using market-neutral strategies</h2><p>Market neutral strategies, or those that aim to generate returns while minimizing exposure to overall market movements in a bid to reduce the impact of volatility, can be considered during these periods, according to Tether.</p><p>These strategies can be as simple as staying on the sidelines holding onto<a href=\"https://cointelegraph.com/learn/stablecoins-101-what-are-crypto-stablecoins-and-how-do-they-work\"> stablecoins</a> and generating revenue by lending them, or they can be rather complex. More advanced strategies involve, for example, selling covered calls, which according to Fluid’s Ismail can be “really beneficial during periods of tight price action.”</p><p>Alexia Theodorou, lead product manager at Kraken Futures, told Cointelegraph that crypto derivatives can be used to “navigate both bear and sideways markets,” with short-selling allowing investors to use falling prices to their advantage, potentially also creating hedging strategies for their positions.</p><p>Theodorou said that if a trader, for example, holds BTC, they can use it as collateral on a short futures position. This short position will gain if the price of the underlying BTC price drops, effectively protecting the trader from the falling price. Theodorou added:</p><blockquote>“Similarly, traders can develop positions consisting of a combination of long and short contracts in assets with similar rates of return — a correlation coefficient — to mitigate exposure to market fluctuations and periods of high volatility. Called a market neutral strategy, the aim is to generate returns regardless of overall market direction.”</blockquote><p>Crypto derivatives, she said, are ultimately a tool that encourages better price discovery and helps “lead to more efficient and liquid marketplaces.” </p><p>Options strategies can offer investors similar market-neutral strategies. Covered call options, for example, see the owner of an underlying asset sell call options to collect premiums while limiting their downside. The call option gives the buyer to right to buy the asset within a certain period. As the seller of the call holds the underlying asset, if the option is exercised, they sell their assets at a predetermined price.</p><p>These covered call strategies, Ismail said, are “actually used as part of a risk management approach during such a time, but they may not be ideal if there are breakout expectations.”</p><p>However, he added that there are other suggestions out there:</p><blockquote>“Other strategies that investors can use include Bull Call Spreads, Short Iron Condors and Short Iron Butterflies. But for these strategies to work, a trader must have a solid understanding of options trading and the associated risks.”</blockquote><p>A solid understanding is an understatement, as often even experienced market participants fail to see every possibility. Market-neutral strategies, nevertheless, are attractive, and their options are growing in the space.</p><p>Indeed, in July 2022, for example, Coinbase published a<a href=\"https://medium.com/@coinbaseblog/quantitative-crypto-insight-a-systematic-crypto-trading-strategy-using-perpetual-futures-64583286e686\" target=\"_blank\" rel=\"noopener nofollow\"> blog post</a> showing how<a href=\"https://cointelegraph.com/explained/what-are-perpetual-futures-contracts-in-cryptocurrency\"> perpetual futures contracts</a> could be used to “achieve a high return on investment” by taking advantage of “positively skewed funding rates” in the market.</p><p>While these strategies can be attractive during periods of low volatility, there are inherent risks associated with them. Coinbase’s blog post mentions the use of perpetual contracts on FTX, a platform that has since collapsed. Other risks include a potential surge in volatility, risks associated with a platform getting hacked and regulatory risks.</p><p>Investors looking for added returns are encouraged to do as much research as possible when exploring their options. Another option to consider is an added return a boost in security practices that helps keep tokens away from hackers.</p><h2>What happens after Bitcoin trades like a stablecoin?</h2><p>Asked about his potential outlook for Bitcoin and the wider cryptocurrency market over the next six months, Ismail noted that the market is “searching for its next price catalyst,” as market conditions show “investors are accumulating BTC at lower levels.”</p><p>He speculated that as market sentiment shifts, there’s an increased likelihood of a significant price movement, especially taking into account the halving event in the first half of next year. Ismail added:</p><blockquote>“With Bitcoin remaining the main driving force behind the industry, the movement of the largest crypto will determine the fate of altcoins and the broad market.”</blockquote><p>Sarwate said there is a “palpable optimism in the crypto space” despite the increased regulatory scrutiny. This year has been a “steady stream of inspiring technological breakthroughs and discoveries that are reinvigorating the digital asset space,” she said.</p><p>She noted that when it comes to Ethereum, thriving layer-2 ecosystems are improving its functionality, while the recent<a href=\"https://cointelegraph.com/news/ethereum-s-shapella-hard-fork-executed-on-mainnet\"> Shapella upgrade</a> enabled staking withdrawals in just “one in a series of success improvements that are setting off waves of positivity within the community.”</p><p>As for Bitcoin, Sarwate pointed out that<a href=\"https://cointelegraph.com/explained/what-are-bitcoin-ordinals\"> Ordinals</a> inscriptions are “kicking up a lot of dust as individual satoshis have taken center stage in the NFT debate.” On top of that, Bitcoin’s next halving event is occurring next year, she said, which is helping generate and restructure debates about its future.</p><p>So, what does all of this mean for long-term investors? According to Ismail, a lot of those with a strong conviction may “end up puking their positions after holding through 70% to 80% drawdowns.” While he said it’s important to take profits, investors should avoid panic selling and always have an exit strategy.</p><p>The market cycles need to be kept in mind, he said, adding:</p><blockquote>“While in bull markets, it may feel as if the market will only go up and that this time is different, but once the bear markets hit, prices may fall 90%. Both market states are not permanent.”</blockquote><p>Some long-term investors understand this and view tight-range trading periods as “an opportunity to add to their positions at discounted prices.” Per Ismail, the key is not to use leverage and survive these “boring times.”</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/increasing-number-of-divorce-proceedings-involve-crypto\">Increasing number of divorce proceedings involve crypto</a></em></strong></p><p>Horejsi seemingly concurs, stating that those who have survived one or two bear markets already know “where to set limits and have probably set them long ago.”</p><blockquote>“Also, most long-termers didn’t go all-in with leverage but have some more conservative investments, too, so the immediate need to liquidate isn’t that strong.”</blockquote><p>As regulatory clarity improves and cryptocurrency adoption grows, he said, he feels safe to say that crypto is “here to stay.” For those who do believe that it is here to stay, waiting out less-volatile periods may be the way to go, whether they choose to accumulate more or not.</p><p>If they opt to lend, take advantage of market-neutral strategies or simply hodl in cold storage, their choices are to be based on individual risk appetites. Surviving bear markets is what helps investors benefit from bull markets, after all, so whatever helps get through the red candles and avoids losses is seemingly an option.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-04T13:04:51.000Z",
    "title": "Kenyan court declares Meta as the primary employer in its lawsuit",
    "url": "https://www.cryptopolitan.com/kenyan-court-meta-employer-content-lawsuit/",
    "description": "A recent ruling by a Kenyan court has declared that Meta, the parent company of Facebook, is the primary employer of content moderators involved in a lawsuit against the social media giant and its content review partner in Africa, Sama. The lawsuit, filed in March of this year by 184 moderators, alleged unlawful dismissal and ... <a title=\"Kenyan court declares Meta as the primary employer in its lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kenyan-court-meta-employer-content-lawsuit/\" aria-label=\"More on Kenyan court declares Meta as the primary employer in its lawsuit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-04T12:47:32.000Z",
    "title": "YouTube reverses its election misinformation policy",
    "url": "https://www.cryptopolitan.com/youtube-reverse-election-policy/",
    "description": "YouTube, a major online platform, has announced its decision to reverse its rules surrounding election denialism, allowing previously prohibited false claims about the 2020 U.S. election and past presidential elections. The company’s policy shift, effective immediately, marks a significant departure from its previous stance on combating misinformation during the electoral process. Axios initially reported on ... <a title=\"YouTube reverses its election misinformation policy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/youtube-reverse-election-policy/\" aria-label=\"More on YouTube reverses its election misinformation policy\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-04T13:00:00.000Z",
    "title": "InQubeta gains traction in presale, surpassing stacks and tezos",
    "url": "https://crypto.news/inqubeta-gains-traction-in-presale-surpassing-stacks-and-tezos/",
    "description": "InQubeta (QUBE) has gained more popularity in crypto when compared to its competitors, stacks (STX) and tezos (XTZ)"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-04T13:03:03.000Z",
    "title": "Tron (TRX) Sees 10% Price Surge Following Bittorrent Bridge Launch",
    "url": "https://www.newsbtc.com/analysis/trx/tron-trx-sees-10-price-surge-following-bittorrent-bridge-launch/",
    "description": "Tron (TRX), the native cryptocurrency of the Tron blockchain, witnessed a substantial increase over the weekend. The token spiked by 10% yesterday, buoyed by recent developments within its ecosystem.  However, at the time of writing, it has experienced a slight correction, but all signs show that this could be a bullish signal.  Tron Spike Due To Bittorent Bridge Launch  The reason behind this latest surge can be attributed to the recent launch of the BitTorrent Bridge platform, which now allows users to seamlessly transfer their TRX tokens between the Tron blockchain and Ethereum. Justin Sun, the founder of Tron, confirmed this development on the morning of June 2. The BitTorrent Bridge serves as a decentralized system that facilitates token interoperability across different blockchain networks. Developed by the Tron organization under the leadership of Justin Sun, this platform strengthens the collaborative efforts between BitTorrent and Tron. A notable instance of their collaboration is the BitTorrent Live streaming service, which was launched in 2019 and operates in conjunction with Tron&#8217;s system. Related Reading: Quant Hype Spikes As Price Surges 15% – Is This A Top Signal? The integration between TRON and Ethereum through the BitTorrent Bridge opens up new possibilities for TRX users while enhancing the interoperability between these prominent blockchains. This breakthrough expands Tron&#8217;s presence within the Ethereum ecosystem and has the potential to drive greater adoption of TRX among Ethereum users. It is important to note that TRX initially existed as an ERC-20 token on the Ethereum network before being migrated to the TRON main network in mid-2018. Since then, Tron has grown into one of the biggest blockchains and currently processes 40% of USDT transactions.  Related Reading: XRP Climbs 12% As Crypto Celebrates 11-Year Milestone Tron Price Analysis  Analyzing Tron&#8217;s current price performance, the coin is currently trading at $0.0805. Moreover, Tron has the potential to maintain its position above the moving averages. If the resistance level of $0.085 is breached, it could serve as a catalyst for a bullish trend, potentially leading to further price gains. The market sentiment appears optimistic as buyers continue to demonstrate a strong commitment. Based on the daily chart analysis, another upward movement in the market price is possible. Therefore, if Tron surpasses the channel&#8217;s upper boundary, it could further reinforce the market and reach resistance levels of $0.095, $0.100, and $0.105, respectively. Conversely, there is a chance of a downward correction, with the support level of $0.082 being a potential target. However, if sellers gain momentum, traders should anticipate a further decline towards support levels of $0.075, $0.070, and $0.065, respectively. Additionally, the Relative Strength Index (14), a technical indicator, is currently situated in the overbought region, indicating the possibility of the bullish trend continuing. Tron&#8217;s price against Bitcoin maintains its position above the 9-day and 21-day moving averages, indicating a potential move towards the resistance level of 330 SAT. However, this resistance level is anticipated to be convincingly surpassed, leading to a market price that closes above it. -Featured image from Invezz, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-04T12:59:00.000Z",
    "title": "Elliptic Boosts Risk Detection With ChatGPT Integration In Crypto Operations",
    "url": "https://coinedition.com/elliptic-boosts-risk-detection-with-chatgpt-integration-in-crypto-operations/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Solana-Price-Soars-on-ChatGPT-Integration-AI-Tokens-Next-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Elliptic Boosts Risk Detection With ChatGPT Integration In Crypto Operations\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Solana-Price-Soars-on-ChatGPT-Integration-AI-Tokens-Next-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Solana-Price-Soars-on-ChatGPT-Integration-AI-Tokens-Next-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Solana-Price-Soars-on-ChatGPT-Integration-AI-Tokens-Next-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Solana-Price-Soars-on-ChatGPT-Integration-AI-Tokens-Next-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Solana-Price-Soars-on-ChatGPT-Integration-AI-Tokens-Next-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Solana-Price-Soars-on-ChatGPT-Integration-AI-Tokens-Next.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Elliptic integrates ChatGPT to enhance crypto threat detection &#038; improve efficiency in risk identification. Cryptocurrency firms report mixed outcomes after implementing ChatGPT in their operations. Solana Labs plans to enable direct interaction with the Solana network using ChatGPT. In an effort to enhance its capability of detecting cryptocurrency threats, Elliptic, a firm specializing in risk [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/elliptic-boosts-risk-detection-with-chatgpt-integration-in-crypto-operations/\">Elliptic Boosts Risk Detection With ChatGPT Integration In Crypto Operations</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]