[
  {
    "source": "Cointelegraph",
    "date": "2023-09-15T21:00:00.000Z",
    "title": "Crypto Biz: PayPal rolls out crypto ramps, Franklin Templeton joins BTC ETF race, and more",
    "url": "https://cointelegraph.com/news/crypto-biz-paypal-rolls-out-crypto-ramps-franklin-templeton-joins-btc-etf-race-and-more",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/c2aa25d1-940a-4ed9-972c-6fb62039c974.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This week’s Crypto Biz looks at PayPal’s crypto gateway, Franklin Templeton’s BTC ETF filing, Coinbase’s Lightning Network integration, and Meta’s plans for a new AI model.</p>\n                    <p><p>Without aggressive marketing tactics, fintech giant PayPal is quietly and consistently venturing deeper into the crypto space, rolling out features and building key partnerships to advance its digital assets strategy.</p><p>This week, PayPal unveiled new on-ramps and off-ramps for cryptocurrencies for its clients in the United States — a noteworthy step for the country, particularly as many crypto firms struggle with supporting fiat-crypto conversions since the United States Securities and Exchange Commission began its controversial crackdown on the industry. </p><p>Also deepening ties with the crypto ecosystem is the traditional asset manager firm Franklin Templeton. The company filed for a spot Bitcoin (BTC) exchange-traded fund (ETF) in the U.S., joining a long list of major investment firms seeking approval for a Bitcoin investment product, including names such as BlackRock, Fidelity and WisdomTree, among many others. </p><p>With new participants joining the digital assets world daily, it’s evident that crypto is becoming more mainstream, even in the face of a long bearish market.</p><p>This week’s Crypto Biz looks at PayPal’s crypto gateway, Franklin Templeton’s BTC ETF filing, Coinbase’s Lightning Network integration, and Meta’s plans for a new AI model.</p><h2>PayPal enables US users to sell cryptocurrency via MetaMask wallet</h2><p>PayPal continues <a href=\"https://cointelegraph.com/news/paypal-enables-users-to-sell-crypto-via-metamask\">expanding its digital asset services</a>, integrating new methods to sell cryptocurrencies like Bitcoin. The payments giant introduced on Sept. 11 new on- and off-ramps for Web3 payments, allowing users in the U.S. to convert their crypto to U.S. dollars directly from their wallets into their PayPal balance. The off-ramp feature is available to wallets, decentralized applications and nonfungible token marketplaces and is live on MetaMask. The latest rollout came shortly after PayPal partnered with hardware wallet firm Ledger to provide a new on-ramp integration in August 2023, allowing verified users in the U.S. to buy Bitcoin, Ether (ETH), Bitcoin Cash (BCH) and Litecoin (LTC) directly on a Ledger hardware wallet.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/1ee2147a-d5f8-4e15-a4f7-0756c6450b36.png\"  /><figcaption style=\"text-align: center;\"><em>Promotional video for PayPal's on- and off-ramps. Source: YouTube</em></figcaption></figure><h2>Franklin Templeton files for spot Bitcoin ETF</h2><p>Asset manager Franklin Templeton applied with the U.S. SEC on Sept. 12 to <a href=\"https://cointelegraph.com/news/franklin-templeton-files-bitcoin-spot-etf\">launch a spot Bitcoin ETF</a>. The S-1 registration statement comes after the SEC delayed decisions on spot ETF applications from WisdomTree, Valkyrie, Fidelity, VanEck, Bitwise and Invesco on Aug. 31 and a court ruling on Aug. 29 that the SEC must consider Grayscale’s application to convert its BTC futures ETF into a spot ETF. According to the application, the fund would be structured as a trust. Coinbase would custody the BTC, and Bank of New York Mellon would be the cash custodian and administrator. Franklin Templeton has $1.5 trillion in assets under management.</p><h2>Meta is building an AI model to rival OpenAI’s most powerful system</h2><p>Social media giant Meta is <a href=\"https://cointelegraph.com/news/meta-building-ai-model-rivals-open-ai\">developing a new artificial intelligence (AI) model</a> that will rival OpenAI’s most advanced version. According to sources from The Wall Street Journal, the new model will be “several times” more powerful than its Llama 2 model, which Meta released earlier this year. Llama was trained on 70 billion parameters, and while OpenAI hasn’t released its parameters for GPT-4, they’re estimated to be around 1.5 trillion. Meta’s new system will be open-source, allowing other companies to build AI tools to produce high-level text, analysis and other types of output with it. The company has also been building the data centers necessary to create such a high-level system while acquiring more of Nvidia’s H100 semiconductor chips.</p><h2>Coinbase to integrate Bitcoin Lightning Network: CEO Brian Armstrong</h2><p>Crypto exchange Coinbase has <a href=\"https://cointelegraph.com/news/coinbase-bitcoin-lightning-network-integration-brian-armstrong\">confirmed its decision to integrate</a> layer-2 payment protocol Lightning Network (LN) as users seek faster and cheaper Bitcoin transactions. Until recently, major crypto exchanges, including Coinbase and Binance, had no intent to adopt the layer-2 solution, as many community members argued that LN integration offered fewer incentives for exchanges’ income. Brian Armstrong, CEO of Coinbase, asked the crypto community to be patient during the integration process. LN was created to help solve Bitcoin’s scalability problem and to compete against projects promising faster and cheaper transactions. The decision comes a month after Viktor Bunin, a protocol specialist at Coinbase, started investigating the feasibility of LN integration.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We’re looking into how to best add Lightning. It’s non-trivial, but I think worth doing. I’m all for payments taking off in Bitcoin.<br><br>Not sure why you think we’re ignoring Bitcoin - we’ve onboarded more people to Bitcoin than probably any company in the world.<br><br>Let’s build it… <a href=\"https://t.co/9dFGYd6XZt\">https://t.co/9dFGYd6XZt</a></p>&mdash; Brian Armstrong ️ (@brian_armstrong) <a href=\"https://twitter.com/brian_armstrong/status/1686596515765362688?ref_src=twsrc%5Etfw\">August 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><em>Crypto Biz is your weekly pulse on the business behind blockchain and crypto, delivered directly to your inbox every Thursday.</em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-15T20:50:01.000Z",
    "title": "Sam Bankman-Fried blames friends, colleagues, and lawyers in unreleased document cache",
    "url": "https://cryptoslate.com/sam-bankman-fried-blames-friends-colleagues-and-lawyers-in-unreleased-document-cache/",
    "description": "<p>In a series of unpublished documents recently uncovered by The New York Times, Former FTX CEO Sam Bankman-Fried extensively criticized colleagues and associates, expressing his views on the demise of FTX. Some 250 pages of documents, not publicly available, were initially handed to social media influencer Tiffany Fong by Bankman-Fried during his period of house [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sam-bankman-fried-blames-friends-colleagues-and-lawyers-in-unreleased-document-cache/\">Sam Bankman-Fried blames friends, colleagues, and lawyers in unreleased document cache</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-15T21:01:30.000Z",
    "title": "Circle and NEAR Foundation team up to expand USDC stablecoin",
    "url": "https://www.cryptopolitan.com/circle-and-near-foundation-team-up/",
    "description": "The recent partnership between Circle, the issuer of the USDC stablecoin, and the NEAR Foundation offers a compelling snapshot of the rapidly evolving crypto landscape. By introducing native USDC stablecoins on the NEAR blockchain, this alliance effectively ushers in a new era of financial flexibility. This development expands USDC&#8217;s availability across thirteen blockchain ecosystems, fostering ... <a title=\"Circle and NEAR Foundation team up to expand USDC stablecoin\" class=\"read-more\" href=\"https://www.cryptopolitan.com/circle-and-near-foundation-team-up/\" aria-label=\"More on Circle and NEAR Foundation team up to expand USDC stablecoin\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-15T21:00:42.000Z",
    "title": "Bitcoin’s Next Move: Crypto Analyst Predicts $45,000 Price Ahead Of Halving",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoins-next-move-crypto-analyst-predicts/",
    "description": "Crypto Michael, a cryptocurrency analyst in the crypto space, has recently shared some insights on the possible market trend of the Bitcoin (BTC) price before the halving commences. These insights were shared in a video uploaded on the analyst&#8217;s YouTube channel. Signs Of A Potential Bull Run According to the recent revelations by Crypto Michael, Bitcoin might be on the brink of a new bull run. In his video, which has garnered over 2,000 views on YouTube, the analyst suggests that the cryptocurrency shows considerable resilience and potential for a surge. Related Reading: Bitcoin Begins Rally As Franklin Templeton Joins Race For BTC Spot ETF This optimism stems from various indicators and patterns observed in Bitcoin&#8217;s price action. It&#8217;s not just Bitcoin&#8217;s impending rise that Crypto Michael has highlighted. The analyst also mentions that the altcoin market is warming up for a possible upward trend. The expert believes the significance of this parallel bullish movement for altcoins cannot be underestimated. It is worth noting that a comprehensive bull market, including both Bitcoin and its altcoin counterparts, could mean significant gains for diversified crypto portfolios. $45,000 Ahead Of The Bitcoin Halving? Diving deeper into his analysis, Crypto Michael predicts a potential Bitcoin price of $45,000 before the much-anticipated halving event next year. A halving is crucial in the Bitcoin network, where miners&#8217; rewards for adding new blocks to the blockchain are cut in half. This event typically decreases supply and can significantly influence Bitcoin&#8217;s price. Historically, the crypto market has experienced bullish trends before and after halvings. This cyclical behavior has been observed in the past two halvings, with price surges leading up to and following the event. However, the current market dynamics have left investors in a speculative state, pondering if history will repeat itself. Particularly, Bitcoin has shown a bearish trend over the past month, down by nearly 10%. The asset plunged from its high of $30,000 in late July to as low as trading just above $25,000 on Monday. However, Bitcoin&#8217;s price can be seen to show signs of recovery in the past few weeks. The asset trades above $26,000 at the time of writing, with a price of $26,338 and a market cap of $513 billion today. Notably, Bitcoin&#8217;s market cap is currently up by more than $10 billion compared to its recent market cap value of below $500 billion, seen earlier this month. Related Reading: JPMorgan Adjusts Bitcoin’s Production Cost: What This Means For BTC And Its Miners? It is worth noting that while its market cap and price have surged over the past two weeks, the asset&#8217;s trading has trended in the opposite direction. Particularly, Bitcoin&#8217;s daily trading volume has plunged from the $18 billion seen earlier this month to as low as $10 billion, in the last 24 hours. Featured image from iStock, Chart from TradingView"
  }
]