[
  {
    "source": "Bitcoin.com",
    "date": "2023-09-20T02:30:04.000Z",
    "title": "Fraud Investigation of Crypto Exchange JPEX Triggers Trading Halt, Arrests, Increased Regulatory Scrutiny",
    "url": "https://news.bitcoin.com/fraud-investigation-of-crypto-exchange-jpex-triggers-trading-halt-arrests-increased-regulatory-scrutiny/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/jpex-shuts-down-trading-and-arrests-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Fraud Investigation Into Crypto Exchange JPEX Results in Trading Halt and Arrests\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/jpex-shuts-down-trading-and-arrests-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jpex-shuts-down-trading-and-arrests-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jpex-shuts-down-trading-and-arrests-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jpex-shuts-down-trading-and-arrests-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jpex-shuts-down-trading-and-arrests-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jpex-shuts-down-trading-and-arrests-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jpex-shuts-down-trading-and-arrests.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A fraud investigation of cryptocurrency exchange JPEX in Hong Kong has led to the shutdown of some trading activities on the platform, the arrest of multiple people, and increased regulatory scrutiny of the entire crypto sector. “This incident highlights the importance that when investors want to invest in virtual assets, then they must invest on [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-20T02:38:03.000Z",
    "title": "Bitcoin Price Close Above $27,500 Could Spark Larger Degree Rally",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-larger-rally-27500/",
    "description": "Bitcoin price is eyeing a key upside break above the $27,500 resistance. BTC could rally further toward $28,200 if there is a close above $27,500. Bitcoin is showing positive signs and facing hurdles near $27,500. The price is trading above $26,850 and the 100 hourly Simple moving average. There is a major bullish trend line forming with support near $26,800 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could rally further if there is a clear move above the $27,500 resistance. Bitcoin Price Eyes More Upsides Bitcoin price started another increase above the $26,800 resistance zone. BTC remained well-bid and even settled above the $27,000 pivot level. However, the bears are still active near the $27,500 zone. A high is formed near $27,494 and the price is now consolidating gains. It is trading just below the 23.6% Fib retracement level of the upward move from the $26,657 swing low to the $27,494 high. Bitcoin is now trading above $26,850 and the 100 hourly Simple moving average. There is also a major bullish trend line forming with support near $26,800 on the hourly chart of the BTC/USD pair. Source: BTCUSD on TradingView.com It is consolidating gains and might eye a fresh increase. Immediate resistance on the upside is near the $27,450 level. The first major resistance is near the $27,500 zone, above which the price could start another rally. The next key resistance could be near the $28,200 level. A clear move above the $28,200 resistance could send the price toward the $29,500 resistance. In the stated case, the price could even test the $30,000 level in the coming days. Are Dips Limited In BTC? If Bitcoin fails to start a fresh increase above the $27,500 resistance, it could start a downside correction. Immediate support on the downside is near the $27,050 level. The next major support is near the $26,800 level and the trend line. It is close to the 76.4% Fib retracement level of the upward move from the $26,657 swing low to the $27,494 high. A downside break and close below the $26,800 level might send the price toward the next support at $26,200. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $27,050, followed by $26,800. Major Resistance Levels – $27,450, $27,500, and $28,200."
  }
]