[
  {
    "source": "CryptoGlobe",
    "date": "2024-01-27T08:52:15.000Z",
    "title": "Coinbase Stock (NASDAQ: COIN) Upgraded by Oppenheimer Amidst Crypto Market Recovery",
    "url": "https://www.cryptoglobe.com/latest/2024/01/coinbase-stock-nasdaq-coin-upgraded-by-oppenheimer-amidst-crypto-market-recovery/",
    "description": "On Friday, Coinbase (NASDAQ: COIN) shares rose following an upgrade by investment bank Oppenheimer. The firm shifted its rating from “perform” to “outperform,” setting a new price target of $160 per share. This upgrade reflects a positive outlook on Coinbase’s future, despite recent challenges in the crypto market. According to an article by Helene Braun […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-27T08:54:02.000Z",
    "title": "Ava Labs Unveils Vryx: A Leap Towards Unprecedented Scalability for Avalanche",
    "url": "https://www.cryptopolitan.com/ava-labs-vryx-scalability-avalanche/",
    "description": "Ava Labs has unveiled its ambitious scaling solution, Vryx, marking a significant stride towards achieving an astounding 100,000 transactions per second (TPS) on the Avalanche blockchain. This innovative approach, detailed in a recent research post, is not just a testament to Ava Labs&#8217; commitment to scalability but also a potential game-changer in the blockchain arena. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-27T08:53:42.000Z",
    "title": "Yield Protocol to Cease Operations: Urges Users to Close Positions",
    "url": "https://www.cryptopolitan.com/yield-protocol-cease-operation-user-position/",
    "description": "Yield Protocol, once a prominent player in the fixed-rate lending market, has issued a critical advisory to its users, signaling the end of an era. The protocol, known for its innovative approach to fixed-rate lending, has officially announced that it will cease operations. &#160;As the platform prepares to wind down its services, users are strongly [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-27T08:52:39.000Z",
    "title": "BNB Greenfield Network Braces for Hulunbeier Hard Fork: A Leap Forward",
    "url": "https://www.cryptopolitan.com/bnb-greenfield-network-hulunbeier-hard-fork/",
    "description": "The BNB Greenfield Network, a cornerstone in the blockchain arena, is on the verge of a significant evolution with the impending Hulunbeier hard fork. This upgrade is set to roll out in two critical phases: the initial testnet hard fork scheduled for February 1 corresponding to block height 4,849,568, followed by the mainnet hard fork [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-27T08:51:56.000Z",
    "title": "Magic Eden Gears Up for Multi-Chain Wallet Launch",
    "url": "https://www.cryptopolitan.com/magic-eden-gear-up-multi-chain-wallet-launch/",
    "description": "In an exciting development that&#8217;s set to redefine the dynamics of the NFT marketplace, Magic Eden is on the brink of introducing a multi-chain wallet. Slated for release on January 29, this innovative wallet promises to be a game-changer in the realm of digital assets. A teaser video, coupled with intriguing text, has set the [&#8230;]"
  }
]