[
  {
    "source": "Decrypt",
    "date": "2023-11-20T15:00:54.000Z",
    "title": "A Bunch of Games Are Migrating to Aptos via READYgg",
    "url": "https://decrypt.co/206673/a-bunch-of-mobile-and-casual-games-are-about-to-launch-on-aptos",
    "description": "Aptos Labs and READYgg are teaming up to help “Web2” games embrace blockchain via NFTs and NFT loyalty models."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-20T15:03:43.000Z",
    "title": "ARK, 21Shares update spot Bitcoin ETF application as next SEC deadline looms",
    "url": "http://cointelegraph.com/news/cathie-wood-ark-spot-bitcoin-etf-amend",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/7af33720-0dcf-4f6f-9983-7fd9caff3160.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The latest update is the third amendment to the Bitcoin ETF prospectus by ARK and 21Shares after the firms first filed for a spot Bitcoin ETF in April 2023.</p>\n                    <p><p>ARK Investment Management, a major cryptocurrency investment firm founded by Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) advocate <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/cathie-wood%5D\">Cathie Wood</a>, isn’t giving up on its efforts to launch a spot Bitcoin exchange-traded fund (ETF) in the United States.</p><p>ARK Invest, on Nov. 20, <a href=\"https://www.sec.gov/Archives/edgar/data/1869699/000119312523280262/d549524ds1a.htm\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> another amended prospectus for its spot Bitcoin ETF product developed in collaboration with the European digital asset manager 21Shares.</p><p>Once approved, the ARK and 21Shares’ Bitcoin ETF, named the ARK 21Shares Bitcoin ETF, will be trading on the BZX Exchange by the Chicago Board Options Exchange (CBOE) under the ticker symbol ARKB, the updated filing reads.</p><p>The latest update is the third amendment to the Bitcoin ETF prospectus by ARK and 21Shares after the firms first <a href=\"https://cointelegraph.com/news/third-time-s-the-charm-ark-and-21shares-again-file-with-sec-for-bitcoin-etf\">filed for a spot Bitcoin ETF</a> in April 2023. ARK previously <a href=\"https://cointelegraph.com/news/ark-invest-amended-bitcoin-etf-filing-sign-future-approval\">amended its form S-1 registration statement</a> for its spot Bitcoin ETF in October, which was interpreted by experts as a “good sign” of progress.</p><p>In September 2023, the <a href=\"https://cointelegraph.com/news/sec-pushes-deadline-ark-21shares-spot-bitcoin-etf\">SEC again delayed its expected decision</a> on ARK’s spot Bitcoin ETF application. The next deadline for the SEC’s decision has been set for Jan. 11, 2024.</p><p>According to Bloomberg ETF analyst Eric Balchunas, the latest filing includes many updates, including numerous risk disclosures designed to satisfy corporate finance requirements.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/wisdomtree-amends-spot-bitcoin-etf\"><strong><em>WisdomTree amends S-1 form spot Bitcoin ETF filing as crypto awaits SEC decisions</em></strong></a></p><p>“One interesting thing is they are sticking to in-kind creations redemptions — albeit in a hybrid model — to minimize tax and spread issues,” Balchunas <a href=\"https://x.com/EricBalchunas/status/1726588765714661448?s=20\" target=\"_blank\" rel=\"noopener nofollow\">noted</a>. “Semi-shocker to be honest, but in a good way,” the ETF observer added, stating:</p><blockquote>“The more updates to these documents the better, shows them getting these bad boys in shape for SEC approval.”</blockquote><p>Bloomberg ETF watcher James Seyffart also <a href=\"https://x.com/JSeyff/status/1726589648666042406?s=20\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> that the latest filing likely reflects that things are moving with the SEC conversations.</p><p>While ARK has been actively amending its S-1 spot Bitcoin ETF application, some spot Bitcoin ETF filers haven’t amended their filings yet. <a href=\"https://x.com/JSeyff/status/1724469793422508533?s=20\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to Steyfart’s data as of mid-November, Franklin Templeton and Global X were the only two firms out of 12 spot Bitcoin ETF filers that haven't amended their S-1 filings.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-20T15:02:37.000Z",
    "title": "Tether freezes $225M USDT linked to romance scammers amid DOJ investigation",
    "url": "http://cointelegraph.com/news/tether-freezes-usdt-scammers-doj-investigation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/e965dbfd-fc72-440d-8283-a83a007534a6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The stablecoin issuer reported the illicit funds had been used by a Southeast Asia-based crime syndicate responsible for a “pig butchering” romance scam.</p>\n                    <p><p>Stablecoin issuer Tether froze roughly $225 million worth of USDT tokens as part of an investigation into a Southeast Asia human trafficking syndicate launched by the United States Department of Justice (DOJ). </p><p>In a Nov. 20 announcement, Tether <a href=\"https://tether.to/en/following-investigations-by-tether-okx-and-the-us-department-of-justice-tether-voluntarily-freezes-225m-in-stolen-usdt-linked-to-international-crime-syndicate/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it had worked with the DOJ and crypto exchange OKX to freeze $225 million USDT in “external self-custodied wallets.” The firm reported the illicit funds had been used by a crime syndicate responsible for a “pig butchering” romance scam — a technique in which bad actors attempt to develop an online relationship with unsuspecting individuals, often convincing them to invest in legitimate businesses before conning them. </p><p>According to Tether, the freezing of the USDT followed a “months-long investigative effort” into the location of the funds between the firm, OKX, DOJ, and U.S. law enforcement agencies. The stablecoin issuer said it would work with U.S. authorities to unfreeze any “lawful” wallets that may have been seized as part of the effort.</p><p>“Through proactive engagement with global law enforcement agencies and our commitment to transparency, Tether aims to set a new standard for safety within the crypto space,” said Tether CEO Paolo Ardoino. “Our recent collaboration with the Department of Justice underscores our dedication to fostering a secure environment. We believe in leveraging technology and relationships, such as our collaboration with OKX, to proactively address illicit activities and uphold the highest standards of integrity in the industry.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Impressive work by <a href=\"https://twitter.com/Tether_to?ref_src=twsrc%5Etfw\">@Tether_to</a> and <a href=\"https://twitter.com/okx?ref_src=twsrc%5Etfw\">@okx</a> teams, alongside with Law Enforcement to stop bad guys <a href=\"https://t.co/P0U8ydP91x\">https://t.co/P0U8ydP91x</a></p>&mdash; Paolo Ardoino  (@paoloardoino) <a href=\"https://twitter.com/paoloardoino/status/1726599790589530142?ref_src=twsrc%5Etfw\">November 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Tether has previously worked with global law enforcement agencies to freeze assets allegedly linked to criminal syndicates, such as when the firm coordinated with Israel’s National Bureau for Counter Terror Financing to <a href=\"https://cointelegraph.com/news/tether-freezes-terrorist-linked-usdt-ukraine-israel\">freeze roughly $873,000 worth of USDT</a> used for funding terrorist activities in Israel and Ukraine. The latest $225-million freeze appeared to be the largest in Tether’s history.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/circle-tether-freezes-over-65m-in-assets-transferred-from-multichain\"><strong><em>Circle, Tether freezes over $65M in assets transferred from Multichain</em></strong></a></p><p>Unlike many cryptocurrencies like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), which has the ability to be held outside the control of anyone but the individual with the private keys, stablecoins like USDT are more likely to be issued by a single authority. As a result, the issuers sometimes have the capability of freezing funds and <a href=\"https://cointelegraph.com/news/tether-says-it-would-not-freeze-sanctioned-tornado-cash-addresses-unless-instructed-by-law-enforcement\">halting transactions in response</a> to requests from law enforcement.</p><p>However, crypto moving through exchanges is sometimes subject to the same treatment. In August 2022, Binance <a href=\"https://cointelegraph.com/news/binance-froze-1m-corporate-account-due-to-law-enforcement-request\">said it had restricted account access</a> to $1 million in crypto for a Tezos tool contributor following a request from authorities and similarly <a href=\"https://cointelegraph.com/news/binance-freezes-hamas-linked-accounts-israeli-request\">froze accounts linked to Hamas</a> militants in October 2023 in response to Israeli law enforcement.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/us-enforcement-agencies-turning-up-heat-crypto-related-crime/\"><strong><em>US enforcement agencies are turning up the heat on crypto-related crime</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-20T14:42:43.000Z",
    "title": "Tether Freezes Record $225M Tied to Human Trafficking Group",
    "url": "https://cryptobriefing.com/tether-freezes-225m-human-trafficking-group/?utm_source=feed&utm_medium=rss",
    "description": "Tether collaborates with DOJ to freeze $225M tied to a human trafficking syndicate, its largest freeze ever."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-20T15:00:37.000Z",
    "title": "De.Fi Sold Out $5M Round: OKX, Binance & Coinbase Directors among Investors (The Sale is Still Open)",
    "url": "https://cryptodaily.co.uk/2023/11/defi-sold-out-5m-round-okx-binance-coinbase-directors-among-investors-the-sale-is-still-open",
    "description": "De.Fi Sold Out $5M Round: OKX, Binance & Coinbase Directors among Investors (The Sale is Still Open)"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-20T14:46:51.000Z",
    "title": "Are Cardano (ADA) and Litecoin (LTC) Pre-Christmas Gains Against Bitcoin a Hint of Higher Rallies?",
    "url": "https://cryptodaily.co.uk/2023/11/are-cardano-ada-and-litecoin-ltc-pre-christmas-gains-against-bitcoin-a-hint-of-higher-rallies",
    "description": "Discover the rising momentum of Cardano (ADA) and Litecoin (LTC) as they challenge Bitcoin's dominance before Christmas. Our analysis examines their latest market trends and strategic moves, assessing whether ADA and LTC have the potential to surge to new highs. Get expert insights into the festive crypto rally and navigate the thrilling possibilities in the fast-paced world of digital currencies."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-20T15:03:44.000Z",
    "title": "Bloomberg analysts estimate spot Bitcoin ETF market to hit $100b",
    "url": "https://crypto.news/bloomberg-analysts-estimate-spot-bitcoin-etf-market-to-hit-100b/",
    "description": "Sources close to Mike Novogratz's Galaxy Digital say the firm already held a call with hundreds of investment firms about allocating to Bitcoin."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-20T15:00:09.000Z",
    "title": "Sam Altman’s Worldcoin Token Makes Headlines With 24% Surge Amid OpenAI Drama",
    "url": "https://www.newsbtc.com/news/sam-altmans-worldcoin-token-makes-headlines-with-24-surge-amid-openai-drama/",
    "description": "The narrative around Sam Altman and OpenAI seems to have had a major impact on the value of WLD, the token that Worldcoin, a cryptocurrency that Altman co-founded, is issuing. As the drama surrounding Sam Altman&#8217;s dismissal from OpenAI and possible reinstatement continues to captivate the crypto space, the Worldcoin digital token has been one of the most unpredictable in the cryptocurrency market as of late. As of today, the trading price of Worldcoin (WLD) has reached $2.43, indicating that the cryptocurrency has made a strong recovery. In comparison to the previous 24 hours, this is a significant gain of 19%, with an impressive 24% rally in the last week, data from crypto price aggregator Coingecko shows. Worldcoin&#8217;s Unpredictable Market Behavior Amid Altman&#8217;s Controversy From a high of $2.50 on November 16, WLD started to weaken as digital asset markets backpedaled the next day, with Altman&#8217;s dismissal only making the decline worse. In the hours following his departure, the token dipped to $1.85 according to statistics compiled by CoinGecko. Source: Coingecko As artificial intelligence (AI) develops at a rapid pace, Worldcoin is working on a digital identity network that will collect retina scans to verify users&#8217; identities. Related Reading: Kaspa Binance Listing Sparks Frenzy: 50% Price Surge Captures Investors’ Interest The project&#8217;s orbs collect users&#8217; retina scans, and in return, they give users WLD tokens as a compensation for giving their biometric data. Events at OpenAI, which Altman acted as a go-between for Worldcoin and, by extension, WLD, continue to impact WLD price, even though the two projects are unrelated. With a market value of approximately $280 million, the token holds the 160th position in the crypto market, as reported by CoinGecko on Monday. Total crypto market cap is currently at $1.3 trillion. Chart: TradingView.com The surge in the token&#8217;s value is intricately linked to the news surrounding Altman and the uncertainties arising from his removal at OpenAI, according to Richard Galvin, co-founder at Digital Asset Capital Management. Altman As The Face Of Worldcoin: Impact On Investor Appeal As events unfolded, the token experienced a rebound, gaining momentum as it became evident that there was no significant negative event fueling the board&#8217;s decision. Digital asset platform VDX&#8217;s head of research in Hong Kong, Greta Yuan, predicted that WLD will experience additional volatility in the coming weeks. Altman is the face of Worldcoin, so depending on how this drama plays out in the next few days, the token may fluctuate, but its appeal to investors will not diminish, Yuan said. Related Reading: Unleashing The Bull: The Astonishing 400% Rise Of An AI Crypto – Details Meanwhile, even though OpenAI&#8217;s stock dropped to $2.04 over the weekend after the announcement of Altman&#8217;s resignation as chief executive, the company&#8217;s efforts to reassign his role as CEO helped propel the stock back up. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Business Wire"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-20T14:46:10.000Z",
    "title": "Shiba Inu’s Shibarium Unveils Game-Changing Feature Empowering Validators",
    "url": "https://www.crypto-news-flash.com/shiba-inus-shibarium-unveils-game-changing-feature-empowering-validators/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-shibarium-unveils-game-changing-feature-empowering-validators",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-54.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-54.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-54-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-54-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Shibarium is reported to have released a &#8220;donate&#8221; feature to enable users to support validators financially. Experts believe that the Shibarium platform is growing exponentially, and could set Shiba Inu up to hit $0.01.  Shibarium has in its latest report integrated a new &#8220;donate&#8221; feature to its platform. Over the years, non-profit validators have gone [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-20T14:57:35.000Z",
    "title": "Tether Freezes $225M in Stolen USDT Linked to Crime Syndicate",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/tether-freezes-225m-in-stolen-usdt-linked-to-crime-syndicate/",
    "description": "<p>This incident prompts a closer examination of similar cases involving Tether and other stablecoin issuers like Circle. Tether, which operates on various blockchains, including Ethereum and Tron, plays a crucial role in the crypto market. However, this pegging to fiat currencies doesn&#8217;t exempt stablecoins from the risks associated with the broader crypto ecosystem. Including theft [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/tether-freezes-225m-in-stolen-usdt-linked-to-crime-syndicate/\">Tether Freezes $225M in Stolen USDT Linked to Crime Syndicate</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-20T15:00:00.000Z",
    "title": "dYdX Faces Backlash for Risk Management Failures Amid $9M Hack",
    "url": "https://coinedition.com/dydx-faces-backlash-for-risk-management-failures-amid-9m-hack/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Bullish-on-dYdX.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"dYdX Faces Backlash for Risk Management Failures Amid $9M Hack\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Bullish-on-dYdX.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Bullish-on-dYdX-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Bullish-on-dYdX-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Bullish-on-dYdX-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Bullish-on-dYdX-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Bullish-on-dYdX-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>dYdX Faces Backlash for Risk Management Failures Amid $9M Hack</p>\n<p>The post <a href=\"https://coinedition.com/dydx-faces-backlash-for-risk-management-failures-amid-9m-hack/\">dYdX Faces Backlash for Risk Management Failures Amid $9M Hack</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]