[
  {
    "source": "CoinDesk",
    "date": "2023-06-27T09:00:00.000Z",
    "title": "Avalanche-Backed Web3 Gaming Studio Pixion Games Closes $5.5M Seed Round",
    "url": "https://www.coindesk.com/web3/2023/06/27/avalanche-backed-web3-gaming-studio-pixion-games-closes-55m-seed-round/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The funds will go towards building out Fableborne, the studio’s flagship Web3 game."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-27T08:45:00.000Z",
    "title": "New FTX Management Team Recovers $7 Billion In Liquid Assets",
    "url": "https://cryptodaily.co.uk/2023/06/new-ftx-management-team-recovers-7-billion-in-liquid-assets",
    "description": "<p>In what is being called substantial progress in asset recovery, the new FTX management has recovered $7 billion in liquid assets.&nbsp;</p>\n<p>The recovery comes against the backdrop of a new investigative report that has been released by the now-collapsed cryptocurrency exchange.&nbsp;</p>\n$7 Billion In Liquid Assets Recovered&nbsp;\n<p>The FTX collapse was one of the most controversial developments in the cryptocurrency industry, having rocked the entire ecosystem. The exchange was once the blue-eyed boy of the industry but was eventually exposed as one of the biggest fraudulent operations in the industry when it filed for Chapter 11 bankruptcy last year. However, there has been significant progress since then, with the new FTX management announcing the recovery of $7 billion in liquid assets, calling the development &ldquo;substantial progress&rdquo; in asset recovery.&nbsp;</p>\n<p>The new FTX management also published an investigative report, with the new CEO laying bare the reality of the exchange.&nbsp;</p>\nThe FTX Report&nbsp;\n<p>According to the report, the Sam Bankman-Fried-led crypto conglomerate made several false statements to banks about accounts related to the use of trading firm Alameda Research&rsquo;s accounts for customer transactions. This was after the banks in question raised several queries about Alameda Trading&rsquo;s wire transfers and started rejecting them. The report documented a specific instance where a bank representative asked if an Alameda Research account that received customer deposits would be used to settle trades for the FTX exchange. In response, the report alleges that a senior FTX executive directed an Alameda employee to lie and state that customers occasionally end up confusing FTX and Alameda but that all incoming and outgoing wire transfers were used to settle Alameda trades.&nbsp;</p>\n<p>The report also alleged that FTX created a new entity called North Dimension Inc. which was falsely advertised as a crypto trading firm with an average monthly trading volume of $10 million and 2000 counterparties. However, in reality, North Dimension Inc. was a shell company that FTX utilized to receive customer deposits and fund withdrawals. When an attorney discovered this, the company ended up firing the attorney. John Ray III, the CEO and Chief Restructuring Officer of FTX entities, stated,&nbsp;</p>\n\n<p>&ldquo;From the inception of the FTX.com exchange, the FTX Group commingled customer deposits and corporate funds and misused them with abandon at the direction and by the design of previous senior executives.&rdquo;</p>\n\nA Web Of Lies&nbsp;\n<p>The complicated relationship between FTX and Alameda Research was the primary reason behind the unraveling of the Sam Bankman-Fried-led crypto empire. According to the report, the former CEO of Alameda Research, Caroline Ellison, in private notes written in March 2022, estimated that FTX.com alone had a cash deficit of over $10 billion. According to Ray, the report is in line with the new management&rsquo;s objective of greater transparency. He further added that FTX&rsquo;s reputation as a customer-focused entity was a mirage, stating,&nbsp;</p>\n\n<p>&ldquo;The release of this report furthers our stated objective of transparency. The image that the FTX group sought to portray as the customer-focused leader of the digital age was a mirage. We will continue to report our analysis and findings as our work progresses and remain committed to recovering as much value as possible for creditors.&rdquo;&nbsp;</p>\n\n<p>Subsequent reports are expected to be released at regular intervals, with later reports bringing in further revelations about FTX and its day-to-day operations.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T09:02:18.000Z",
    "title": "Bank of England’s fight against inflation will land UK into recession, economists say",
    "url": "https://www.cryptopolitan.com/bank-of-england-threatens-uk-into-recession/",
    "description": "The Bank of England (BOE), by the end of the year, will throw the U.K. into a recession as it continues to battle the worst inflation faced by any Group of Seven economies, according to a warning from Bloomberg Economics. Notably, despite the BOE&#8217;s efforts, making 13 straight interest-rate increases since the end of 2021, ... <a title=\"Bank of England&#8217;s fight against inflation will land UK into recession, economists say\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bank-of-england-threatens-uk-into-recession/\" aria-label=\"More on Bank of England&#8217;s fight against inflation will land UK into recession, economists say\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T08:47:34.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T09:00:08.000Z",
    "title": "Discover how DigiToads (TOADS) stands out among Chainlink (LINK) and Floki (FLOKI) with unique staking rewards",
    "url": "https://www.crypto-news-flash.com/discover-how-digitoads-toads-stands-out-among-chainlink-link-and-floki-floki-with-unique-staking-rewards/?utm_source=rss&utm_medium=rss&utm_campaign=discover-how-digitoads-toads-stands-out-among-chainlink-link-and-floki-floki-with-unique-staking-rewards",
    "description": "People have different reasons for choosing a cryptocurrency. Some assign high value to growth potential, others to security and even staking. Staking is when you lock crypto tokens to support a blockchain&#8217;s operations for a certain period in exchange for rewards. If you are someone who is looking for an option that has promising staking [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T08:58:57.000Z",
    "title": "SwissOne Capital Launches SISO Fund to Foster Massive Adoption for Shimmer and IOTA Ecosystems",
    "url": "https://www.crypto-news-flash.com/swissone-capital-launches-siso-fund-to-foster-massive-adoption-for-shimmer-and-iota-ecosystems/?utm_source=rss&utm_medium=rss&utm_campaign=swissone-capital-launches-siso-fund-to-foster-massive-adoption-for-shimmer-and-iota-ecosystems",
    "description": "Tangle Ecosystem Association and SwissOne launch a FUND to educate and support developers of the IOTA and Shimmer network. The Fund would be registered in Luxembourg as a close-ended limited partnership according to the report.  Tangle Ecosystem Association (“TEA), one of the backbones of IOTA that provide constant support for builders utilizing the IOTA Technology, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T08:52:37.000Z",
    "title": "Dogecoin Lawsuit Drama: Dogecoin Investors Fight Back Against Elon Musk’s Lawyers’ ‘Dirty Tactics",
    "url": "https://www.crypto-news-flash.com/dogecoin-lawsuit-drama-dogecoin-investors-fight-back-against-elon-musks-lawyers-dirty-tactics/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-lawsuit-drama-dogecoin-investors-fight-back-against-elon-musks-lawyers-dirty-tactics",
    "description": "Lawyers representing Dogecoin investors suing Elon Musk seek disqualification of Musk&#8217;s attorneys, accusing them of misconduct and oppressive tactics in the case. The investors point to a letter from Musk&#8217;s lawyer, Alex Spiro, as evidence of &#8220;dirty tactics,&#8221; and call for the dismissal of Spiro and other lawyers from the Quinn Emanuel firm representing Musk. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T08:50:17.000Z",
    "title": "Emerging Strong: Golteum (GLTM) Poised To Rise Among Crypto Titans Solana (SOL) and Near Protocol (NEAR)",
    "url": "https://www.crypto-news-flash.com/emerging-strong-golteum-gltm-poised-to-rise-among-crypto-titans-solana-sol-and-near-protocol-near/?utm_source=rss&utm_medium=rss&utm_campaign=emerging-strong-golteum-gltm-poised-to-rise-among-crypto-titans-solana-sol-and-near-protocol-near",
    "description": "Golteum (GLTM), an innovative multi-assets Web3 platform that offers precious metals-backed NFTs, is positioned to soar alongside established cryptocurrency heavyweights such as Solana (SOL) and Near Protocol (NEAR). As Golteum expands its vision to revolutionize the precious metals industry through Web3 accessibility and asset-backed NFTs, it aims to cement its place among the top players [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-27T08:47:00.000Z",
    "title": "Increased Network Activity Could Lead To An XRP Rally: Analyst",
    "url": "https://coinedition.com/increased-network-activity-could-lead-to-an-xrp-rally-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/03.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Analyst Predicts XRP May Rise Amidst Increased Network Activity\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/03.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/03-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/03-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/03-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/03-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/03-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/03-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/03-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/03-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/03-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/03-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/03-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/03-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/03-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/03-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/03-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A well-known crypto trader and analyst, Ali, shared a post on Twitter yesterday wherein he speculated whether the price of Ripple (XRP) could rise in the next few days. The analyst based this belief off of the fact that in the last three instances the price of XRP jumped after there was an increase in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/increased-network-activity-could-lead-to-an-xrp-rally-analyst/\">Increased Network Activity Could Lead To An XRP Rally: Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]