[
  {
    "source": "Decrypt",
    "date": "2023-09-05T10:53:24.000Z",
    "title": "Sorare Launches AR-Equipped 3D Digital Football Player Cards",
    "url": "https://decrypt.co/154975/sorare-launches-ar-equipped-3d-digital-football-player-cards",
    "description": "The launch of Sorare's upgraded collectibles comes alongside a global scavenger hunt offering the winner a “once-in-a-lifetime” trip."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-05T10:13:58.000Z",
    "title": "South Korean Banking Giant Partners With BitGo, Opens Doors To Crypto",
    "url": "https://decrypt.co/154970/south-korean-banking-giant-partners-with-bitgo-opens-doors-to-crypto",
    "description": "KEB Hana Bank’s partnership with the crypto custodian ties one of the largest financial groups in the country to the digital asset space."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T10:52:04.000Z",
    "title": "Why is Bitcoin price stuck?",
    "url": "https://cointelegraph.com/news/why-is-bitcoin-price-stuck",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/afc8ec08-4768-417a-a371-a46442344ea8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price has been stuck below key reclaim levels this month, and market participants are warning that downside may come as a result.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has been stuck in a slow decline in September, with neither bulls nor bears able to spark a clear trend.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/831e8735-4de5-4dcd-a3be-dcce0dfd8c1b.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><h2>Bitcoin trendline offers chance for \"bargain-buying\"</h2><p>BTC price performance has failed to impress so far this month, and BTC/USD is on the way to forming classic September losses, data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> shows.</p><p>Large-volume investors are staying on the sidelines, with the area around $26,000 already an all-too-familiar home for Bitcoin in 2023.</p><p>Current spot price is <a href=\"https://cointelegraph.com/news/bitcoin-price-holds-200-day-trendline-btc-bottom\">surrounded by trendlines</a>, which analysts argue are helping to restrict volatility. Bitcoin lost some as support in August as it dropped over 10%, chief among these being the 200-week moving average (MA).</p><p>Commenting on a chart of levels to watch, popular trader and analyst noted the significance of the 200-week MA in bear markets.</p><p>“For most of Bitcoin's history, the 200-week MA (blue in the above chart) has acted as a generational bottoming out region,” he wrote in his <a href=\"https://newsletter.rektcapital.co/bitcoin-preparing-for-september/\" target=\"_blank\" rel=\"noopener nofollow\">latest newsletter</a>. </p><p>Rekt Capital noted that the current four-year price cycle is treating the trendline differently to before.</p><p>“In March 2020, BTC experienced downside wicking below the 200-week MA but still maintaing the 200-week MA as support. In this cycle however things have been different: BTC formed an Accumulation Area below the 200-week MA,” he continued.</p><blockquote>“And even though BTC recently flipped the 200-week MA into new resistance, as if suggesting that price could stay below this key MA in the coming weeks, the principle remains the same that this MA will represent bargain-buying opportunities for those investing in BTC for the long run.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/9089889a-d4e4-4e3d-91e4-6da7865aab42.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day chart with 200-week MA. Source: TradingView</em></figcaption></figure><p>The 200-week MA stood at $27,680 as of Sep. 5 — around $2,000 above spot price.</p><h2>Dollar strength challenges macro calm</h2><p>With the United States on holiday on Sep. 4, there was less chance for a significant trend change in crypto markets over the weekend.</p><p>That could change on Sep. 5 as Wall Street returns, but for the time being, “out-of-hours” BTC price action is characterizing the landscape.</p><p>The U.S. dollar index (DXY), known to inversely impact BTC price movements in times of volatility of its own, is meanwhile <a href=\"https://cointelegraph.com/news/bitcoin-new-volatility-btc-price-4-day-high\">building on an uptrend</a> in place since mid-July.</p><p>Up 0.5% on the day, DXY is challenging a recent local high from late May.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/e5576ea3-b79b-42e5-b965-544adce0a734.png\"  /><figcaption style=\"text-align: center;\"><em>U.S. dollar index (DXY) 1-day chart. Source: TradingView</em></figcaption></figure><p>“Resistance is now support,” popular trader TraderSZ <a href=\"https://twitter.com/trader1sz/status/1698617688090644609/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">told</a> X subscribers about dollar strength on monthly timeframes.</p><p>Continuing, TraderSZ warned that Bitcoin may suffer as a result — with even a return to a CME futures gap near $20,000 a possibility.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">If correct on <a href=\"https://twitter.com/search?q=%24DXY&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$DXY</a> idea, then I see no reason why we can’t fill that <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> gap easily and it would just be a move back into the range<br><br>Looking at the chart, it’s breaking down. <a href=\"https://t.co/pmq0Erb5Xt\">https://t.co/pmq0Erb5Xt</a> <a href=\"https://t.co/hOHWOwwV1y\">pic.twitter.com/hOHWOwwV1y</a></p>&mdash; TraderSZ (@trader1sz) <a href=\"https://twitter.com/trader1sz/status/1698627632219181329?ref_src=twsrc%5Etfw\">September 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Supply and demand keep BTC price range intact</h2><p>Closer to home, supply and demand zones are of interest to popular trader Skew, with a potential dip limited in scope to above $25,000.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/weekly-close-btc-price-double-top-5-things-bitcoin-this-week\">Weekly close risks BTC price ‘double top’ — 5 things to know in Bitcoin this week</a></em></strong></p><p><a href=\"https://twitter.com/52kskew/status/1698671950946763179/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">Acknowledging</a> that “not much has changed” intraday, Skew uploaded charts to X showing the likely boundaries of future price moves.</p><p>To go much higher, Bitcoin bulls would need to reclaim a 12-hour range low at $26,200, he said on the day, “else price grinds towards 12H Demand again &amp; lower.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/20408497-4ada-4e1d-824f-76c4847e43c0.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Skew/X</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-05T11:00:56.000Z",
    "title": "Short-term bitcoin holders retreat, reshaping market balance towards long-term investors",
    "url": "https://cryptoslate.com/insights/short-term-bitcoin-holders-retreat-reshaping-market-balance-towards-long-term-investors/",
    "description": "<p>Quick Take Bitcoin&#8217;s landscape has recently seen a significant shift. Short-term holders, defined as entities holding Bitcoin for less than 155 days, have once again succumbed to selling pressure, with approximately 20,000 BTC being sent to exchanges at a loss. This trend marks the fourth largest exodus of short-term holders this year, exemplifying their increasing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/short-term-bitcoin-holders-retreat-reshaping-market-balance-towards-long-term-investors/\">Short-term bitcoin holders retreat, reshaping market balance towards long-term investors</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-05T10:30:25.000Z",
    "title": "Regulated exchanges hesitate on crypto exposure despite growing demand – report",
    "url": "https://cryptoslate.com/regulated-exchanges-hesitate-on-crypto-exposure-despite-growing-demand-report/",
    "description": "<p>According to a report published Sept. 5 by the World Federation of Exchanges, regulated stock exchanges remain reluctant to offer unregulated cryptocurrency products despite increasing investor demand. The report is based on a survey of 29 regulated stock exchanges that are members of the WFE, including Nasdaq and CME Group. It found growing interest in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/regulated-exchanges-hesitate-on-crypto-exposure-despite-growing-demand-report/\">Regulated exchanges hesitate on crypto exposure despite growing demand &#8211; report</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T11:03:00.000Z",
    "title": "Dogecoin community rallies behind Elon Musk and X in battle against ADL ",
    "url": "https://www.cryptopolitan.com/dogecoin-community-rallies-behind-elon-musk/",
    "description": "The Dogecoin community stands firmly behind tech entrepreneur Elon Musk and the newly rebranded X (formerly Twitter) in their ongoing battle against the Anti-Defamation League (ADL) over free speech issues. The controversy revolves around allegations that ADL&#8217;s actions have negatively impacted advertising revenue on the platform, prompting Musk to consider a defamation lawsuit against the ... <a title=\"Dogecoin community rallies behind Elon Musk and X in battle against ADL \" class=\"read-more\" href=\"https://www.cryptopolitan.com/dogecoin-community-rallies-behind-elon-musk/\" aria-label=\"More on Dogecoin community rallies behind Elon Musk and X in battle against ADL \">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T10:45:59.000Z",
    "title": "Casio collaborates with Polygon Labs to launch virtual G-SHOCK NFTs on Polygon",
    "url": "https://www.cryptopolitan.com/casio-collaborate-with-polygon-to-launch-nft/",
    "description": "The Japanese electronics giant Casio is making waves in non-fungible tokens (NFTs) by partnering with Ethereum scaling developer Polygon Labs. The collaboration aims to introduce Casio&#8217;s iconic G-SHOCK watches into the NFT space on Polygon&#8217;s blockchain protocols. The project starts with releasing an NFT-based collection of community access passes. The NFT collection debut Starting September ... <a title=\"Casio collaborates with Polygon Labs to launch virtual G-SHOCK NFTs on Polygon\" class=\"read-more\" href=\"https://www.cryptopolitan.com/casio-collaborate-with-polygon-to-launch-nft/\" aria-label=\"More on Casio collaborates with Polygon Labs to launch virtual G-SHOCK NFTs on Polygon\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T10:24:29.000Z",
    "title": "Artificial Intelligence Could Replace Referees Within 30 Years, According to Expert Predictions",
    "url": "https://www.cryptopolitan.com/ai-could-replace-referees-according-to-expert-predictions/",
    "description": "In a bold prediction, experts in the field of sports analytics suggest that referees could potentially be replaced by artificial intelligence (AI) within the next three decades. While AI has already made its mark in officiating through technologies like VAR (Video Assistant Referee) and goalline technology, its role is expected to expand in the future ... <a title=\"Artificial Intelligence Could Replace Referees Within 30 Years, According to Expert Predictions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-could-replace-referees-according-to-expert-predictions/\" aria-label=\"More on Artificial Intelligence Could Replace Referees Within 30 Years, According to Expert Predictions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T10:21:11.000Z",
    "title": "Reserve Bank of Australia maintains interest rate at 4.1% while inflation remains elevated",
    "url": "https://www.cryptopolitan.com/australia-maintains-interest-rate/",
    "description": "The Reserve Bank of Australia (RBA) has maintained its interest rate at 4.1 percent for the third consecutive month. However, they have indicated that additional rate hikes might be necessary to keep inflation in check. This decision keeps the cash rate at its highest level since April 2012 and marks the fourth pause in the ... <a title=\"Reserve Bank of Australia maintains interest rate at 4.1% while inflation remains elevated\" class=\"read-more\" href=\"https://www.cryptopolitan.com/australia-maintains-interest-rate/\" aria-label=\"More on Reserve Bank of Australia maintains interest rate at 4.1% while inflation remains elevated\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T10:09:38.000Z",
    "title": "New AI-Generated COVID Drug Enters Phase I Clinical Trials and Shows Effectiveness Against All Variants",
    "url": "https://www.cryptopolitan.com/ai-drug-enter-trial-and-shows-effectiveness/",
    "description": "The intersection of artificial intelligence (AI) and healthcare has birthed a groundbreaking development in drug discovery. Insilico Medicine, a pioneering AI-driven biotech company with offices in Hong Kong and New York City, has unveiled a novel AI-designed drug targeting COVID-19. This significant leap has now entered Phase I clinical trials. This oral drug, distinct from ... <a title=\"New AI-Generated COVID Drug Enters Phase I Clinical Trials and Shows Effectiveness Against All Variants\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-drug-enter-trial-and-shows-effectiveness/\" aria-label=\"More on New AI-Generated COVID Drug Enters Phase I Clinical Trials and Shows Effectiveness Against All Variants\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-05T11:06:01.000Z",
    "title": "Casio to unveil G-SHOCK NFT collection on Polygon",
    "url": "https://crypto.news/casio-to-unveil-g-shock-nft-collection-on-polygon/",
    "description": "Casio is teaming up with Polygon Labs to unveil its virtual G-SHOCK watch on Polygon's protocols, starting with an NFT community access pass series."
  },
  {
    "source": "BTCManager",
    "date": "2023-09-05T11:01:21.000Z",
    "title": "Ethereum exchange deposits surge while staked ETH hits ATH",
    "url": "https://crypto.news/ethereum-exchange-deposits-surge-while-staked-eth-hits-ath/",
    "description": "Ethereum (ETH) sees market uncertainty as exchange deposits recently surged to a one-month high. Staked ETH on the Ethereum 2.0 deposit contract hit an all-time high. According to Glassnode, the value recently reached a one-month high, clocking in at 2,145.&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-05T10:41:11.000Z",
    "title": "Harvard scholar calls for prompt taxation of metaverse earnings",
    "url": "https://crypto.news/harvard-scholar-calls-for-prompt-taxation-of-metaverse-earnings/",
    "description": "A Harvard scholar argues that the authorities should swiftly introduce taxation on Metaverse earnings to potentially enhance governmental revenue streams."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-05T11:00:20.000Z",
    "title": "Can Ripple Control The XRP Price? Crypto Analysts Weigh In",
    "url": "https://www.newsbtc.com/analysis/xrp/ripple-control-xrp-price/",
    "description": "The XRP token has attracted much attention, especially because of Ripple’s ongoing legal battle with the US Securities and Exchange Commission (SEC). This has led to speculations on whether Ripple is able to control the XRP price or not. So crypto analysts have chimed in to share their opinions. No Ripple Effect On XRP? Pro-XRP influencer Crypto Eri stated in a tweet that she doesn’t rely on the “efforts of Ripple” to increase XRP’s value. She suggested that the crypto company hasn’t done much to grow the token as it accounts for a “single digit impact on volume.”  Related Reading: Pro-XRP Legal Expert Takes The Spotlight With Daring Ripple Vs SEC Settlement Theory Unlike DAI, I don’t rely on the efforts of Ripple to build up the price of XRP. Never have, never will. Especially with accounting for single digit impact on volume. It’s surprising after surviving the SEC attack, anyone would subscribe to this reliance. https://t.co/XG2bA6qsva — 🌸Crypto Eri 🪝Carpe Diem (@sentosumosaba) September 4, 2023 There is a common belief that token issuers should be able to control and drive up the price of their tokens, whether through their marketing efforts, a deflationary mechanism, or simply increasing the use cases of their tokens to send a bullish signal to the crypto community. In Ripple’s case, Eri believes holders shouldn’t rely on the company, especially after “surviving” the SEC attack. While her stance is unclear, many may argue that Ripple’s effort in its case against the SEC shows its commitment to building the ecosystem and promoting mass adoption of its token. Eri’s tweet came in reply to another pro-XRP influencer, Digital Asset Investor, who tweeted about why he was bullish on XRP. In contrast to Eri’s view, this influencer believes that Ripple’s efforts will greatly affect XRP’s value as Ripple promises to disrupt the global financial system, so he is bullish on the token. &#160; Some would think these were things said by influencers to hype XRP. They were actually said by Ripple. This is why I&#8217;m here. I believe them.🏆🏆🏆In It To Win It!🏆🏆🏆 -XRP Could Help In A Systemic Risk Situation In another financial crisis -XRP will be like a supranational… — Digital Asset Investor.XRP (@digitalassetbuy) September 2, 2023 Has Ripple Had Any Effect On XRP? It is worth mentioning that the XRP price experienced significant gains on the back of Judge Analisa Torres’ ruling in favor of Ripple. The token surged over 23% within hours of the decision and rose to as high as $0.9 due to the ruling.  Furthermore, XRP became the fourth-largest token by market cap following the decision (although it has dropped to 5th since then). However, there is no denying the potential for Ripple to go head-to-head with the foremost cryptocurrencies such as Bitcoin and Ethereum. Related Reading: New Job Listing Indicates What Ripple Is Focusing On Next Interestingly, there was a significant increase in daily transactions conducted on the XRP ledger, with more transactions conducted on the blockchain at the beginning of last month than leading blockchains Ethereum and Bitcoin.  Ripple has also not rested on its efforts to develop the XRP ecosystem despite the SEC’s lawsuit against it. The crypto company is looking to expand into the tokenized assets industry by enabling trading of these asset classes on the XRP Ledger.  There are also plans to release an upgrade for the XRP Ledger, with a notable amendment being the introduction of a novel automated market maker (AMM). This update could see XRPL become a major player in the DeFi space and increase XRP’s utility, which could trigger an increase in its value.  Token price stalls at $0.50 &#124; Source: XRPUSD on Tradingview.com Featured image from CoinMarketCap, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-05T11:00:51.000Z",
    "title": "Chainlink (LINK) and Hedera (HBAR) See Price Corrections Amid Profit-Taking; Pomerdoge (POMD) Marches Ahead With Bullish Run",
    "url": "https://www.crypto-news-flash.com/chainlink-link-and-hedera-hbar-see-price-corrections-amid-profit-taking-pomerdoge-pomd-marches-ahead-with-bullish-run/",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T112733.216.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T112733.216.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T112733.216-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T112733.216-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto market continues to capture attention, with Chainlink (LINK) and Hedera (HBAR) experiencing price corrections driven by profit-taking. On the other hand, Pomerdoge (POMD), an emerging hybrid token with immense growth potential, continues its bullish charge. In this article, we will provide insight into the factors driving this current market behavior. Further, we will [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-05T10:40:24.000Z",
    "title": "JP Morgan’s Bold Prediction: Bitcoin ETF Bonanza Looms After Grayscale’s Legal Win",
    "url": "https://www.crypto-news-flash.com/jp-morgans-bold-prediction-bitcoin-etf-bonanza-looms-after-grayscales-legal-win/",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Mateusz_Szymanski-JP-Morgan.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"JpMorgan\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Mateusz_Szymanski-JP-Morgan.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Mateusz_Szymanski-JP-Morgan-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Mateusz_Szymanski-JP-Morgan-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Mateusz_Szymanski-JP-Morgan-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />JPMorgan predicts that the US Securities and Exchange Commission would likely approve a spot Bitcoin ETF unless it reconsiders its Bitcoin futures ETF approval.  The analysts also argue that the approval of a spot Bitcoin ETF would have no substantial impact on the price as speculated.  The US Securities and Exchange Commission&#8217;s decision to approve [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-05T10:25:51.000Z",
    "title": "Ripple’s XRP Shifts Focus: Is It Paving the Way for Stablecoins on DEXs?",
    "url": "https://www.crypto-news-flash.com/ripples-xrp-shifts-focus-is-it-paving-the-way-for-stablecoins-on-dexs/",
    "description": "<img width=\"1280\" height=\"783\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN-300x184.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN-1024x626.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COIN-768x470.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Ripple is shifting its focus away from positioning XRP as a global reserve currency and instead aims to integrate stablecoins and decentralized exchanges into its On-Demand Liquidity (ODL) services. Although DEXs are not part of ODL as of now, ripple is working on it to facilitate trading against automated market makers (AMMs). As we know, [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-05T10:26:35.000Z",
    "title": "What’s the Next Wave of Crypto Innovations?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/whats-the-next-wave-of-crypto-innovations/",
    "description": "<p>From Scaling tech, better wallets, PWAs, account abstraction, seamless interoperability, and compressed NFTs. Also, identity, yield-bearing stablecoins, social dApps, privacy, DePIN, resource networks, RWAs, and Web3 gaming. Let&#8217;s discover how these crypto innovations can boost the industry. Blockchain&#8217;s Innovations Are Coming  Blockchain has been heralded as one of the revolutionary technologies of the 21st century, one poised [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/whats-the-next-wave-of-crypto-innovations/\">What’s the Next Wave of Crypto Innovations?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-05T10:47:46.000Z",
    "title": "Casio Partners with Polygon Launching Virtual G-SHOCK Project",
    "url": "https://coinedition.com/casio-partners-with-polygon-launching-virtual-g-shock-project/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/POLYGON-5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"POLYGON-5\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/POLYGON-5.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/POLYGON-5-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/POLYGON-5-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/POLYGON-5-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/POLYGON-5-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/POLYGON-5-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Japanese electronics multinational Casio recently announced the launch of its virtual G-SHOCK project, as part of its 40th anniversary celebration, in collaboration with Polygon Labs. In a press release, Casio revealed that 15,000 limited–edition G-SHOCK creator pass non-fungible tokens (NFTs) would be distributed to customers via Polygon, from September 23, 2023. Reportedly, the NFT passes [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/casio-partners-with-polygon-launching-virtual-g-shock-project/\">Casio Partners with Polygon Launching Virtual G-SHOCK Project</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]