[
  {
    "source": "Decrypt",
    "date": "2023-07-06T12:23:58.000Z",
    "title": "Decentralized Twitter Rival Bluesky Announces $8M Fundraise, Paid Services",
    "url": "https://decrypt.co/147495/decentralized-twitter-rival-bluesky-announces-8m-fundraise-paid-services",
    "description": "Twitter competitor Bluesky has announced a $8 million seed round and introduced its first paid service. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-06T12:29:00.000Z",
    "title": "Animoca still bullish on blockchain games, awaits license for metaverse fund ",
    "url": "https://cointelegraph.com/news/animoca-still-bullish-on-blockchain-games-awaits-license-for-metaverse-fund",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/b54ff04a-edd7-4fb0-99a6-2a4df41b13e0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Animoca Brands co-founder Yat Siu expects a number of its blockchain gaming investments to come to market by the end of 2023. </p>\n                    <p><p>Blockchain-based games have been a hot topic in the cryptocurrency space over the past two years, accounting for considerable growth and daily activity on a number of protocols despite prolonged bear market conditions.</p><p>Market research estimates that Web3 gaming<a href=\"https://mpost.io/metaverse-fundraising-report-for-2022-trends-in-nft-gaming-infrastructure-ai/\" target=\"_blank\" rel=\"noopener nofollow\"> pulled in</a> around $4.5 billion in funding in 2022 as asset managers, investment funds and venture capitalists look to cash in on the burgeoning sector.</p><p>In an exclusive interview with Cointelegraph, Animoca Brands co-founder Yat Siu highlighted the firm’s renewed optimism in the blockchain gaming sector and gave an update on its <a href=\"https://cointelegraph.com/news/animoca-creates-billion-dollar-metaverse-fund-for-developers\">anticipated metaverse fund</a> which grabbed headlines in late 2022.</p><h2>Metaverse fund awaiting license</h2><p>Animoca Brands originally earmarked up to $2 billion for a <a href=\"https://cointelegraph.com/news/animoca-creates-billion-dollar-metaverse-fund-for-developers\">proposed</a> metaverse fund in November 2022 which intends to invest in a variety of mid to late-stage startups building metaverse products and experiences. </p><p>The company was forced to scale back on its original investment target as per reports in 2023, reducing the amount to $1 billion in January. Reports citing unnamed sources in March then indicated that the fund would be further reduced to $800 million due to volatility affecting the cryptocurrency space.</p><p><a href=\"https://cointelegraph.com/news/nft-games-are-only-scratching-the-surface-of-what-s-possible-animoca-s-yat-siu\"><strong><em>Related: NFT games are ‘only scratching the surface’ of what's possible — Animoca’s Yat Siu</em></strong></a></p><p>When queried about the current state of the proposed metaverse fund, Siu told Cointelegraph that the firm was still awaiting a license before it can begin to put its money to work.</p><blockquote>“That’s the gating factor. But Animoca has made many investments this year and we are over 450 portfolio companies today. That doesn't come from sitting back and being passive.”</blockquote><p>Siu added that Animoca continues to invest in a variety of early stage startups through its venture arm while the majority of investments still come directly from the company’s balance sheet.</p><h3>Upcoming ‘AAA' blockchain games on the horizon</h3><p>While licensing remains a hurdle for Animoca’s Metaverse fund, Siu expects a number of ‘AAA’ titles in which the company has invested in to hit the market by the end of 2023 or early next year.</p><blockquote>“That’s one of the reasons we’re so bullish about the segment, hopefully at least one of them will work out.”</blockquote><p>Siu added that the quality of titles that Animoca is backing is sound and that blockchain-based games don’t necessarily need to have immediate breakout success to be sustainable, stating, “Most importantly, all these games are built on open protocol systems, like Ethereum or Polygon, meaning they're on chain, which allows third parties to do some pretty cool stuff.”</p><p>Animoca’s co-founder sees a generation of AAA-level blockchain games coming out by the end of 2024, highlighting the shift in focus, capital and talent from mainstream gaming to the sector.</p><p>“They're built by people who know how to make games whereas maybe three years ago, a lot of games came out built by excited blockchain guys, but who knew very little about what it takes to make a game,” he said.</p><h3>Blockchain games need to do business in the biggest markets</h3><p>Another factor that has ramped up the development and quality of upcoming blockchain games and those in beta has been the advent of scaling protocols like Polygon and technological advances like zero-knowledge proofs.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Immutable  <a href=\"https://twitter.com/0xPolygon?ref_src=twsrc%5Etfw\">@0xPolygon</a> <br><br>We are joining forces in an industry-defining partnership to accelerate the development and adoption of web3 gaming. The future of gaming begins today with the announcement of the Immutable zkEVM, powered by Polygon.<a href=\"https://t.co/7FEyidsydV\">https://t.co/7FEyidsydV</a> <a href=\"https://t.co/IkhbWrLIaq\">pic.twitter.com/IkhbWrLIaq</a></p>&mdash; Immutable (@Immutable) <a href=\"https://twitter.com/Immutable/status/1637877711346753536?ref_src=twsrc%5Etfw\">March 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Siu highlighted the likes of layer-2 platform Immutable which has made use of zkEVM to reduce costs and improve transaction speeds of NFT generation for blockchain games. The infrastructure alone has made a difference, but Siu added that choosing the right chain also has a massive role to play in the success of a title. </p><blockquote>“Because it's a blockchain game, you need to do business in the biggest market there is and that happens to be Ethereum.”</blockquote><p>Siu added that early blockchain games were hamstrung by game design that held onto “Web2 thinking” which was focused on monopolizing network effects of Web2. Siu said bootstrapping to decentralized protocols like Ethereum had an upside and a downside: “The more you open up your network effects. And the more inclusive you become, actually, the more value you end up generating, but there is a loss of control when you do that.”</p><p>He also admitted that taking a potential AAA, first-person shooter completely on-chain would be “really hard.” Adopting a hybrid on-chain approach might be better suited as the industry moves towards truly decentralized games.</p><p><a href=\"https://cointelegraph.com/magazine/2023-is-a-make-or-break-year-for-blockchain-gaming-play-to-own/\"><strong><em>Magazine: 2023 is a make-or-break year for blockchain gaming: Play-to-own</em></strong></a></p><p>“Provenance, skins and certain things that don't requireall the time and data is probably a good starting point,” he said.</p><p>Siu said that the established culture of gaming around the world could allow for gaming firms to design and implement blockchain elements as audiences continue to come to grips with Web3 functionality:</p><blockquote>“There's interfaces that we can design that are familiar to the gamer, and essentially introduce the whole experience of crypto and Web3, which comes also with financial literacy onboarding.”</blockquote><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-06T12:20:51.000Z",
    "title": "Namibia passes bill to regulate crypto and digital assets",
    "url": "https://cointelegraph.com/news/crypto-namibia-passes-bill-to-regulate-crypto-and-virtual-assets",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/f6d4dbaa-0449-41fc-96d7-b8963b1ba681.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The legislation aims to establish a framework for licensing and regulating virtual asset service providers.</p>\n                    <p><p>Namibia has joined other African nations in embracing cryptocurrencies and <a href=\"https://cointelegraph.com/learn/crypto-regulations-in-nigeria\">digital assets</a> by approving a bill in the National Assembly. The bill, which passed Namibia’s lower house of parliament on June 22, aims to regulate digital assets, cryptocurrencies and digital asset service providers in the country.</p><p>The purpose of the <a href=\"https://www.parliament.na/b12-2023-virtual-assets-bill/\" target=\"_blank\" rel=\"noopener nofollow\">legislation</a> is to establish a framework for licensing and regulating virtual asset service providers. It also aims to designate a regulatory authority responsible for supervising these providers and their activities. </p><p>The main objectives include ensuring consumer protection, preventing market abuse, mitigating the risks of money laundering, financing terrorism and proliferation activities associated with <a href=\"https://cointelegraph.com/learn/asset-tokenization\">virtual asset markets</a>. The law also covers incidental matters related to these objectives.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/4243405a-fb6b-4139-89ff-68f1ca61bdb2.JPG\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of Namibia's Virtual Assets Bill.  Source: Parliament of the Republic of Namibia</em></figcaption></figure><p>According to local media <a href=\"https://www.namibian.com.na/parliament-approves-law-to-regulate-cryptocurrency/?ref=mariblock.com\" target=\"_blank\" rel=\"noopener nofollow\">reports</a>, the bill is now awaiting official publication before it can be put into effect. Iipumbu Shiimi, Namibia's Minister of Finance and Public Enterprises, reportedly mentioned the establishment of a regulatory body to supervise and grant licenses to virtual asset service providers in Namibia. </p><p>Non-compliant providers could reportedly face penalties of up to $671,572 (10 million Namibian dollars) in fines, a 10-year prison term, or both. However, it's important to note that the Bank of Namibia maintains its position that cryptocurrencies do not hold legal tender status in the country.</p><p>Kazembire Zemburuka, the Bank of Namibia's director of strategic communications and international relations, stated the Bank of Namibia's position, the reports said, indicating that once the associated risks of innovations like virtual assets are better managed, the bank will assess and make a decision regarding their acceptance within the financial system.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-exchange-licences-south-africa-by-year-end\"><strong><em>South Africa to mandate crypto exchange licenses by end of 2023: Report</em></strong></a></p><p>In 2017, the Bank of Namibia announced that it was <a href=\"https://cointelegraph.com/news/bank-of-namibia-rejects-bitcoin-exchanges-on-basis-of-50-year-old-law\">strongly against the use of cryptocurrencies</a> as a method of payment for goods and services. It stated that virtual currency exchanges have no place in the African country, under its decades-old law. It further affirmed that cryptocurrencies were without legal tender status in the country. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-senegal-why-how-african-country-using-btc/\"><strong><em>Bitcoin in Senegal: Why is this African country using BTC?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-06T12:37:15.000Z",
    "title": "Bitcoin Exchange Supply Continues To Slip, Holders Not Interested In Selling?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-exchange-supply-slip-holders-interested-selling/",
    "description": "On-chain data shows that the Bitcoin exchange supply has only continued to decline despite the recent rally that the asset has observed. Bitcoin Exchange Supply Continues To Register Net Decline According to data from the on-chain analytics firm Glassnode, exchanges have continued to see withdrawals recently. The indicator of interest here is the &#8220;exchange balance,&#8221; which measures the total amount of Bitcoin that&#8217;s currently sitting in the wallets of all centralized exchanges. When the value of this metric goes up, it means that the investors are depositing a net number of coins to these platforms currently. As one of the main reasons why holders may transfer their BTC to exchanges is for selling-related purposes, this kind of trend can have short-term bearish consequences for the price. On the other hand, decreasing values of the indicator imply a net amount of the supply is leaving from the exchanges. Such a trend, when prolonged, can be a sign that the investors are accumulating at the moment. Naturally, this could be constructive for the cryptocurrency&#8217;s price. Now, here is a chart that shows the trend in the Bitcoin exchange balance over the last few years: The value of the metric seems to have been going downhill in recent days &#124; Source: Glassnode on Twitter As displayed in the above graph, the Bitcoin exchange balance had been in an overall uptrend during 2018 and 2019, but with the COVID crash in March 2020, a shift happened in the market and the indicator started moving in a downward trajectory. There was a break in this trend during the 2021 bull run, as the metric mostly moved sideways, with some increases coming near the top of the rallies. This deviation in the trend was possibly a result of investors depositing to take advantage of the profit-taking opportunity. Related Reading: 75% Of Bitcoin Supply Now In Profit, Will A Drop Happen Here? With the end of the bull market and the transition toward a bearish period, though, the indicator resumed its decline. Events like the 3AC Collapse and the FTX Crash saw the exchange balance dropping especially hard, as these platforms going down made investors more wary of keeping their coins in centralized custody. With the start of the Bitcoin rally this year, however, the metric once again started moving sideways as demand for selling returned. In the leadup to the local top in April, exchanges were receiving net deposits as their supply outright registered an increase. Interestingly, while investors were looking to sell during the price surge back then, the latest uplift in the price above the $30,000 level has actually seen the exchange balance only decline further. This trend of net withdrawals can be a sign that there isn&#8217;t much appetite for selling in the market currently, at least when compared to the demand for taking coins to self-custody. Related Reading: Solana Registers 20% Rise In Past Week, But Can SOL Keep This Up? With the latest drawdown, the Bitcoin exchange balance has dropped to 2.26 million BTC, which is the lowest the indicator has been since way back in March 2018. BTC Price At the time of writing, Bitcoin is trading around $30,700, up 1% in the last week. Looks like the asset has gone stale recently &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T12:30:59.000Z",
    "title": "Solana News Flash: Can SOL Price and Tradecurve 10X in 2023?",
    "url": "https://www.crypto-news-flash.com/solana-news-flash-can-sol-price-and-tradecurve-10x-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=solana-news-flash-can-sol-price-and-tradecurve-10x-in-2023",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-06T134103.344.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-06T134103.344.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-06T134103.344-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-06T134103.344-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Solana has taken a big hit after being classified as a security by the SEC. Its value quickly plummeted to $13.81 and many investors sold their holdings. However, Solana is now recovering. Its price has bounced back to $18.44 and experts now believe that Solana could reach $20 during the first week of June.  But [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T12:30:30.000Z",
    "title": "Best DeFi Coins of 2023 | Top DeFi Projects and Altcoins Guide",
    "url": "https://www.crypto-news-flash.com/best-defi-coins-of-2023-top-defi-projects-and-altcoins-guide/?utm_source=rss&utm_medium=rss&utm_campaign=best-defi-coins-of-2023-top-defi-projects-and-altcoins-guide",
    "description": "<img width=\"512\" height=\"287\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-06T141831.433.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-06T141831.433.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-06T141831.433-300x168.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />This article provides an extensive overview of the top DeFi coins, consolidating information from several sources. This summary can act as a stepping stone to gain a comprehensive understanding and find answers to important questions about the best new defi coins before conducting further independent research on the top DeFi coins. This article equips readers [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T12:22:05.000Z",
    "title": "Golteum (GLTM) Revolutionary Features Challenges Uniswap (UNI) and Cosmos (ATOM)",
    "url": "https://www.crypto-news-flash.com/golteum-gltm-revolutionary-features-challenges-uniswap-uni-and-cosmos-atom/?utm_source=rss&utm_medium=rss&utm_campaign=golteum-gltm-revolutionary-features-challenges-uniswap-uni-and-cosmos-atom",
    "description": "<img width=\"512\" height=\"268\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-06T152040.622.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-06T152040.622.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-06T152040.622-300x157.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-06T152040.622-351x185.png 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The decentralized finance (DeFi) market isn’t ready for what is coming. Uniswap (UNI) and Cosmos (ATOM) have long been recognized as leaders in their respective domains.  Golteum (GLTM) is entering the fray with various revolutionary features, positioning itself as a formidable competitor to these two cryptocurrency projects. In this article, we will discuss the game-changing [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T12:20:43.000Z",
    "title": "IOTA Patent Reveals Innovative Approach for Collecting Road Use Charges with Digital Currency",
    "url": "https://www.crypto-news-flash.com/iota-patent-reveals-innovative-approach-for-collecting-road-use-charges-with-digital-currency/?utm_source=rss&utm_medium=rss&utm_campaign=iota-patent-reveals-innovative-approach-for-collecting-road-use-charges-with-digital-currency",
    "description": "<img width=\"1000\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-IOTA-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-IOTA-2.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-IOTA-2-300x203.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-IOTA-2-768x518.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-IOTA-2-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />A new patent has mentioned how Distributed Ledger Technology (DLT) like IOTA can be used to facilitate road-user charging (RUC) collection. It also mentions some methods to transfer digital currencies collected to facility owners&#8217; digital wallets. Several research reports have unveiled some challenges faced by transportation organizations in the implementation of road-user charging (RUC) systems. [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-06T12:24:31.000Z",
    "title": "ETH Could Experience Downtrend After Its Short-Term Bullish Event",
    "url": "https://coinedition.com/eth-could-experience-downtrend-after-its-short-term-bullish-event/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/064.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/064.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/064-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/064-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/064-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/064-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/064-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/064-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/064-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/064-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/064-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/064-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/064-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/064-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/064-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/064-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/064-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The blockchain tracking platform Whale Alert informed the crypto community that 25,264 ETH, valued at approximately $48,302,924, was transferred from an unknown wallet to Coinbase. The crypto whale tracking platform also observed another whale movement where 30,000 ETH was transferred from an anonymous wallet to OKEX. There is a possibility that these whale transfers could [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/eth-could-experience-downtrend-after-its-short-term-bullish-event/\">ETH Could Experience Downtrend After Its Short-Term Bullish Event</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]