[
  {
    "source": "CryptoGlobe",
    "date": "2023-05-29T22:52:58.000Z",
    "title": "Ethereum ICO Participant Resurfaces and Transfers 8,000 $ETH After it Appreciated Nearly 600,000%",
    "url": "https://www.cryptoglobe.com/latest/2023/05/ethereum-ico-participant-resurfaces-and-transfers-8000-eth-after-it-appreciated-nearly-600000/",
    "description": "A dormant cryptocurrency whale that participated in Ethereum’s initial coin offering (ICO) back in 2015 has sprung back to life. The whale purchased 8,000 $ETH, equivalent to nearly $15 million at the time of writing, during the ICO. According to blockchain monitoring service Lookonchain, the reactivation process started with a cautious initial transaction, involving a […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T23:04:56.000Z",
    "title": "Avalanche price analysis: AVAX moves past $14 support but stays bearish",
    "url": "https://www.cryptopolitan.com/avalanche-price-analysis-2023-05-29/",
    "description": "Avalanche price analysis shows a continued bearish trend in place, despite a slight uptrend occurring over the past 24 hours to take price past the $14 support. Earlier, AVAX price dipped down to as low as $13.77 which was followed by a slight recovery to move back to earlier levels. Avalanche has largely been in ... <a title=\"Avalanche price analysis: AVAX moves past $14 support but stays bearish\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-analysis-2023-05-29/\" aria-label=\"More on Avalanche price analysis: AVAX moves past $14 support but stays bearish\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-29T22:40:18.000Z",
    "title": "Russia shifts focus to regulating private crypto trading platforms, abandoning national exchange plans",
    "url": "https://www.cryptopolitan.com/russia-shifts-focus-to-regulating-crypto-trading-platforms/",
    "description": "Russian lawmakers have decided to halt the development of a state-level cryptocurrency trading platform. However, this decision reverses the government&#8217;s previous plan to create a state-owned crypto exchange to bolster tax revenue. According to the local newspaper Izvestia, the Ministry of Finance opposed the idea of a national exchange and argued in favor of prioritizing ... <a title=\"Russia shifts focus to regulating private crypto trading platforms, abandoning national exchange plans\" class=\"read-more\" href=\"https://www.cryptopolitan.com/russia-shifts-focus-to-regulating-crypto-trading-platforms/\" aria-label=\"More on Russia shifts focus to regulating private crypto trading platforms, abandoning national exchange plans\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-29T23:00:44.000Z",
    "title": "Here Are The Top 3 Chinese Coins To Buy As China Leads The Bull Run",
    "url": "https://www.newsbtc.com/altcoin/here-are-the-top-3-chinese-coins-to-buy-as-china-leads-the-bull-run/",
    "description": "As June 1 draws closer and the Hong Kong and Chinese investors look forward to legally trading cryptocurrencies once more, the market has already turned bullish. So far, Chinese coins have led the pack when it comes to gains, so here are three of the most popular Chinese tokens likely to rally if the bullish trend continues. Neo (NEO) Neo (NEO) has long been a favorite of Chinese investors and is often fondly referred to as the “Chinese Ethereum.” The cryptocurrency is one of the leading coins from the region so it is no surprise to see that it has moved back into the spotlight as retail traders are set to begin trading cryptocurrencies in Hong Kong on June 1. Related Reading: Bullish Case For Litecoin Grows Stronger As LTC Halving Draws Close The past week has already been profitable for its investors with 13.95% gains already recorded on the weekly chart. In the past day as well, the digital asset has seen gains of 3.34%, but there is still a lot of ground to cover before trading goes live. So NEO could present as a good choice for investors looking to take advantage of the new bull rally being led by Chinese investors. NEO price recovers above $11 &#124; Source: NEOUSD on TradingView.com Conflux (CFX) Conflux (CFX) is one of the top Chinese coins for investors to keep an eye on during this time. Conflux is a blockchain company based in China and its native token CFX has seen much success this year. However, the drawdown in the price of the coin in the last month has not deterred investors and as the Chinese narrative gains ground, the token has grown as well. Just like NEO, the last week has been a good one for CFX whose price has risen 9.96% to bring its price above $0.32 once more. The coin’s trading volume also crossed $117 million in a 24-hour period, indicating that investors are always investing in this token ahead of the anticipated June 1 date. VeChain (VET) VeChain (VET) is one of the oldest blockchains in the space which was founded in 2015, the same year as Ethereum. And although VeChain hasn’t grown as much as Ethereum, it hasn’t been stagnant either and has become one of the foremost Chinese coins, making it a perfect candidate for those looking to take advantage of the present narrative. Related Reading: Elon Musk Reveals Reason Behind Dogecoin Investment, But Why Is DOGE Down? Although VET hasn’t performed as well as the others on this list, it is up nonetheless with 5.58% gains in the last week. It is also seeing a modest upside of 1.67% on the 24-hour chart, but the promise of more gains remains vast as the last two days leading up to June 1 could see these coins heat up very fast. If the trend continues, then VET could be looking at breaking the $0.03 resistance before the week is over. China And Crypto China banned cryptocurrencies in 2021 when the price of Bitcoin had rallied to $60,000. This move triggered a crash in the market, from which Bitcoin recovered not too long after, but it left Chinese investors unable to adequately participate in a market that they had previously dominated. That is, until now that Hong Kong has made a move. Related Reading: When Is A Token Coming For Coinbase’s Base L2? Here’s What The Roadmap Says The country passed a new law that would allow crypto exchanges to offer services to investors, making it possible for them to participate in the market once more. This gives investors in China an avenue to trade cryptocurrencies without being worried about breaking the law. It is set to go into effect on June 1, less than three days from now. As this date draws closer, a study by Forex Suggest has shown that Hong Kong is the most crypto-ready country in the world. However, it remains to see how this event will play out in the crypto market. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from Blokt, chart from TradingView.com"
  }
]