[
  {
    "source": "Crypto Daily",
    "date": "2023-10-12T05:24:54.000Z",
    "title": "SEC Garners Support in Its Ongoing Lawsuit Against Coinbase",
    "url": "https://cryptodaily.co.uk/2023/10/sec-garners-support-in-its-ongoing-lawsuit-against-coinbase",
    "description": "Amid its ongoing lawsuit against crypto exchange Coinbase, support for the SEC is gaining traction."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-12T05:15:48.000Z",
    "title": "New PS5 Model Unveiled: Compact Design, Enhanced Storage, and More",
    "url": "https://www.cryptopolitan.com/new-ps5-model-unveiled/",
    "description": "Discover Sony's latest PS5 model, featuring compact design, expanded storage, and diverse pricing options. Get the scoop on its global release and upcoming games, plus accessories and customization choices for the ultimate gaming experience."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-12T05:14:29.000Z",
    "title": "Innovative Approach Emerges for AI Regulation: The Role of Regulatory Sandboxes",
    "url": "https://www.cryptopolitan.com/ai-regulation-in-regulatory-sandboxes/",
    "description": "In the dynamic realm of Artificial Intelligence (AI), there&#8217;s an ongoing conversation within policy and regulatory circles. The conversation is fueled by the rapid advancements in AI technology, particularly the emergence of generative and all-purpose AI systems, exemplified by ChatGPT. These advancements intensify concerns about comprehensive regulation&#8217;s need to address potential risks and ensure responsible ... <a title=\"Innovative Approach Emerges for AI Regulation: The Role of Regulatory Sandboxes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-regulation-in-regulatory-sandboxes/\" aria-label=\"More on Innovative Approach Emerges for AI Regulation: The Role of Regulatory Sandboxes\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-12T05:28:12.000Z",
    "title": "ADA Price Hints At Potential Correction, Buy The Dip?",
    "url": "https://www.newsbtc.com/analysis/ada/ada-price-hints-correction-0-245/",
    "description": "Cardano’s price started a fresh decline below $0.250. ADA is testing important support at $0.2450 and might start a recovery wave. ADA price started a fresh decline below the $0.255 and $0.250 levels against the US dollar. The price is trading below $0.250 and the 100 simple moving average (4 hours). There is a key declining channel forming with resistance near $0.2480 on the 4-hour chart of the ADA/USD pair (data source from Kraken). The pair must stay above the $0.2420 support to start a fresh increase in the near term. Cardano’s ADA Price Revisits Support After a steady increase, Cardano failed to clear the $0.2650 resistance zone. The price formed a short-term top at $0.2668 and recently started a fresh decline, like Bitcoin and Ethereum. There was a drop below the $0.255 support level. Besides, there was a break below a key bullish trend line with support near $0.259 on the 4-hour chart of the ADA/USD pair. The pair even declined below the $0.250 support and the 100 simple moving average (4 hours). A low is formed near $0.2450 and the price is now consolidating losses. Cardano is now trading below $0.250 and the 100 simple moving average (4 hours). On the upside, immediate resistance is near the $0.248 zone. There is also a key declining channel forming with resistance near $0.2480 on the 4-hour chart of the ADA/USD pair. The first resistance is near $0.250 or the 23.6% Fib retracement level of the downward move from the $0.2668 swing high to the $0.2450 low. Source: ADAUSD on TradingView.com The next key resistance might be $0.2560 and the 50% Fib retracement level of the downward move from the $0.2668 swing high to the $0.2450 low. If there is a close above the $0.256 resistance, the price could start a decent increase. In the stated case, the price could rise toward the $0.285 resistance zone. More Losses in ADA? If Cardano’s price fails to climb above the $0.250 resistance level, it could continue to move down. Immediate support on the downside is near the $0.245 level. The next major support is near the $0.242 level. A downside break below the $0.242 level could open the doors for a sharp fresh decline toward $0.220. The next major support is near the $0.200 level. Technical Indicators 4 hours MACD – The MACD for ADA/USD is losing momentum in the bearish zone. 4 hours RSI (Relative Strength Index) – The RSI for ADA/USD is now below the 50 level. Major Support Levels – $0.245, $0.242, and $0.220. Major Resistance Levels – $0.250, $0.255, and $0.285."
  }
]