[
  {
    "source": "CoinDesk",
    "date": "2023-08-23T09:54:40.000Z",
    "title": "FBI Says North Korean Hackers May Try to Sell $40M of Bitcoin",
    "url": "https://www.coindesk.com/business/2023/08/23/fbi-says-north-korean-hackers-may-try-to-sell-40m-of-bitcoin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "North Korean hackers look set to try to sell more than $40 million of stolen bitcoin (BTC), the Federal Bureau of Investigation (FBI) said."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-23T09:50:40.000Z",
    "title": "Australian Central Bank Says Key Management Still a Challenge for Users in CBDC Pilot",
    "url": "https://decrypt.co/153445/australian-central-bank-says-key-management-still-challenge-users-cbdc-pilot",
    "description": "\"For end users of tokenized assets, which include stablecoins and the pilot CBDC, key management remains a practical challenge,\" read the report."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-23T09:52:49.000Z",
    "title": "How to put words into a Bitcoin address? Here’s how vanity addresses work",
    "url": "https://cointelegraph.com/news/how-vanity-addresses-work",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/d5544d34-251f-4c83-9c15-11ada253ced2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A Bitcoin vanity address is your signature on the blockchain canvas — a custom touch in the realm of digital finance.</p>\n                    <p><p>Have you ever wondered whether a Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) address — or a string of 26–35 alphanumeric characters — can happen to have human-readable words instead of random letters?</p><p>You’ve probably heard of the <a href=\"https://cointelegraph.com/learn/what-is-the-lightning-network-in-bitcoin-and-how-does-it-work\">Lightning Network</a>, which allows you to <a href=\"https://cointelegraph.com/news/microstrategy-s-saylor-fuses-work-email-address-with-bitcoin-lightning\">create a fancy BTC address</a> that looks like an email or a web domain. But there’s also a way of creating Bitcoin addresses containing human-readable words on the original <a href=\"https://cointelegraph.com/news/btc_101_the_beginner_s_guide_to_understanding_bitcoin\">Bitcoin blockchain</a>. Such addresses are known as vanity Bitcoin addresses.</p><h2>What is a vanity Bitcoin address?</h2><p>A vanity Bitcoin address is a personalized BTC address that contains a specific pattern or word in a part of its total 26-35 character string of letters and numbers. Unlike a usual Bitcoin address — which is made of random characters — a vanity Bitcoin address allows users to customize their addresses or even send a specific message just within the address.</p><p>The term “vanity address” comes from the plain meaning of the word “vanity,” which is used to express inflated pride in oneself or one’s appearance. In line with the direct meaning, vanity addresses are used by those who want to stand out and give their wallet address a unique identity.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/b06ac34f-0e89-4057-bed5-bd587bae2ef9.jpg\"  /></figure><p>Vanity Bitcoin addresses became popular a few years after the anonymous Bitcoin creator <a href=\"https://cointelegraph.com/learn/the-history-of-bitcoin-when-did-bitcoin-start\">Satoshi Nakamoto launched the cryptocurrency</a> back in 2009. The first vanity address generator, called “VanityGen,” was <a href=\"https://github.com/kangaderoo/vanitygen\" target=\"_blank\" rel=\"noopener nofollow\">released</a> as an open-source platform on GitHub in 2012. One of the first references to vanity addresses on Bitcointalk.org — a major crypto forum created by Nakamoto — <a href=\"https://bitcointalk.org/index.php?topic=151607.0\" target=\"_blank\" rel=\"noopener nofollow\">goes</a> back to 2013.</p><p>According to Trezor’s Bitcoin analyst Josef Tetek, Nakamoto didn’t use vanity addresses: “He disappeared from the public before vanity addresses became popular,” Tetek told Cointelegraph, referring to <a href=\"https://cointelegraph.com/news/today-marks-the-10-year-anniversary-of-satoshi-nakamoto-s-final-message\">Nakamoto’s vanishing in 2011</a>.</p><p>Besides the Bitcoin blockchain, <a href=\"https://cointelegraph.com/news/almost-1m-in-crypto-stolen-from-vanity-address-exploit\">vanity addresses are also available</a> on other networks, including the Ethereum blockchain. Unlike Bitcoin vanity addresses, which allow users to choose among 26–35 alphanumeric characters, Ethereum vanity addresses only feature hexadecimal numbers, as Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) addresses can only include letters “A” through “F” and numbers zero through nine.</p><p>According to the ETH Optimism vanity address generator, creating an Ethereum vanity address starting with “0xFad69” would <a href=\"https://cointool.app/vanityAddressGenerator/op\" target=\"_blank\" rel=\"noopener nofollow\">take</a> up to five minutes.</p><h2>How to create a Bitcoin vanity address?</h2><p>There are two ways of creating a vanity BTC address: manually and using specialized vanity address generator services. The first method relies on software and requires some computing power and coding skills to run programs to find Bitcoin addresses starting with a specific word combination.</p><p>Many Bitcoin experts like Trezor’s Tetek agree that the first method is the most secure way of creating a vanity Bitcoin address, as this method allows users to keep their seed phrase private. Being the only owner of a <a href=\"https://cointelegraph.com/explained/what-is-a-seed-phrase-and-why-is-it-important\">private key or a seed phrase</a> enables the user to be the sole holder of the funds associated with the address.</p><p>The manual method requires installing vanity address-generating software like VanityGen, which is available on the <a href=\"https://cointelegraph.com/learn/what-is-github\">cloud-based software website GitHub</a>. Running such software requires certain computing power specs, with larger sequences of symbols demanding more time to create a vanity address.</p><p>Various sources estimate that generating a vanity address containing a five-symbol word takes about one hour using a regular personal computer, while larger sequences like seven symbols could take up to three months. More sophisticated setups involving powerful graphic cards or even application-specific integrated circuit (ASIC) chips can significantly reduce the time needed to generate a vanity address.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/e5217108-91b0-441e-8837-2908a0ee89f7.jpg\"  /></figure><p>The second method of creating a vanity address is more straightforward but less secure as it relies on delegating the address search to third-party services, also known as “vanity address miners.”</p><p>Reliance on Bitcoin vanity services is associated with major risks, as miners can potentially take over the address and its assets at any time. That is because such miners are the first to receive the private key before passing it to the customer. The private key is <a href=\"https://cointelegraph.com/news/what-happens-if-you-lose-or-break-your-hardware-crypto-wallet\">generated at the moment of creating a Bitcoin</a> address and cannot be changed afterward.</p><p>The vanity generation service is often offered via websites like Vanitygen.net, allowing users to simply order a certain desired word or sequence to be searched with computing power bought online. Such services often allow users to order a sequence of letters up to eight symbols. Once generated, the private key for the vanity address is sent to the customer’s email in exchange for the agreed price.</p><p>For example, generating a Bitcoin vanity address starting with “1Satoshi…” would cost around 0.0217 BTC, worth around $600 at the time of writing. Larger sequences like “1Nakamoto…” would require at least 0.11 BTC, or as much as $3,250.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/549261b1-a490-4d32-964b-40ed233d7e86.jpg\"  /></figure><p>It’s important to note that not all letters and numbers can be included in a vanity Bitcoin address, just like a normal BTC address. Some letters, like the uppercase letter for “O,” the uppercase letter for “I,” the lowercase letter for “L,” and the number “0,” are excluded from the set of 26–35 alphanumeric characters available in all Bitcoin addresses. The exclusions aim to help users avoid confusion when sending funds on the Bitcoin blockchain.</p><h2>The risks of using a Bitcoin vanity address</h2><p>A decision on whether or not to use a Bitcoin vanity address ultimately depends on the reasons for having such an address in the first place, taking into account all possible risks. Some cryptocurrency exchanges like BitMEX have experimented with vanity addresses using the native Segregated Witness (SegWit) address format Bech32 with the “bc1qmex…” prefix.</p><p>A spokesperson for BitMEX told Cointelegraph that most vanity addresses are used for marketing or considered “a bit of fun.”</p><p>“Bitcoin vanity addresses were quite popular on BitcoinTalk circa 2011, when many solicited donations to their personal vanity address, for example, 1Name,” the BitMEX’s representative noted, adding:</p><blockquote>“In the days before structured proof of reserves systems, the exchange-wide use of vanity addresses gave a way for users to informally sum up the reserves of an exchange.”</blockquote><p>The firm also attempted to use vanity addresses to make it harder for attackers to scam users since BitMEX only gave vanity addresses to users. However, one should not rely on vanity addresses as a security mechanism, as more advanced attackers could manage to copy the vanity address format, the representative noted.</p><p>BitMEX’s spokesperson says vanity addresses are best suited for advanced users: “The main weakness for individual users is reduced privacy. In general, we would advise users not to reuse addresses at all,” adding that newer BitMEX customer addresses no longer feature a vanity prefix.</p><p>Trezor’s Bitcoin expert Tetek strongly advised against using vanity addresses because such addresses — even if generated in a secure manner — promote address reuse, which is a bad practice in terms of privacy. He said:</p><blockquote>“If a Bitcoin address is used more than once, other people can easily track the receiving and spending habits of a person. It is, therefore, also easier to identify the owner of the address.”</blockquote><p>Besides privacy and asset safety risks, vanity BTC addresses are also associated with security vulnerabilities. In 2022, <a href=\"https://cointelegraph.com/news/profanity-tool-vulnerability-drains-3-3m-despite-1inch-warning\">hackers managed to steal $3.3 million</a> in crypto through a vulnerability in Ethereum vanity address-generating tool Profanity. Additionally, in March 2023, attackers also used hacked vanity addresses to <a href=\"https://cointelegraph.com/news/profanity-tool-vulnerability-drains-3-3m-despite-1inch-warning\">steal $500,000 worth of tokens </a>from layer-2 scaling solution Arbitrum’s airdrop.</p><h2>The future of Bitcoin vanity addresses</h2><p>Despite Bitcoin vanity addresses becoming much less popular since 2011, there is no evidence that such addresses have not been used in recent years.</p><p>One report recently <a href=\"https://theins.ru/news/263521\" target=\"_blank\" rel=\"noopener nofollow\">described</a> the use of a Bitcoin vanity address containing swearing words apparently directed toward Russia’s President Vladimir Putin. The address has <a href=\"https://www.blockchain.com/explorer/addresses/btc/1PutinHuj28G1Bc1WvFb9WxEKAKUDPUNEg\" target=\"_blank\" rel=\"noopener nofollow\">transacted</a> a total of 0.29 BTC ($7,595) in 67 transactions between 2018 and 2020, turning its balance to zero.</p><p>One of its last recorded transactions <a href=\"https://explorer.btc.com/btc/transaction/982a5ea5121a8c1e40503a36f17fd73bac21e1cc75a49bfb27d641b157ca2c2d\" target=\"_blank\" rel=\"noopener nofollow\">included</a> a 0.0004 BTC ($10) transaction to the public Bitcoin address of famous Bitcoin critic Warren Buffet, who was <a href=\"https://twitter.com/justinsuntron/status/1225415845641363457?s=20\" target=\"_blank\" rel=\"noopener nofollow\">given</a> a BTC address and a gift from Tron founder Justin Sun.</p><p>Moreover, challenges and considerations persist. For instance, the security risks linked to vanity address generators must be addressed, prompting the development of more secure and user-friendly tools. Vanity address creation could become more streamlined and available to a wider audience, not just those with coding expertise, as blockchain systems develop and incorporate new features.</p><p>However, the privacy issues raised by the reuse of addresses will remain a crucial consideration. Therefore, users who want personalized addresses must balance the advantages of uniqueness against possible privacy breaches.</p><p>While it’s important to understand that Bitcoin vanity addresses are quite risky and expensive, such addresses apparently unlock some new and maybe weird use cases of the cryptocurrency. With that in mind, it’s up to Bitcoin users whether the future of Bitcoin vanity addresses is bright or not.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-23T10:00:02.000Z",
    "title": "Bitcoin put options see highest demand since March",
    "url": "https://cryptoslate.com/insights/bitcoin-put-options-see-highest-demand-since-march/",
    "description": "<p>Quick Take Looking at the Options 25 Delta Skew on Deribit, the skew, a measure of the relative richness of put versus call options expressed in Implied Volatility (IV), shows a significant uptick in the demand for Bitcoin put options and is presently at its highest level since the SVB collapse in March. This skew, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-put-options-see-highest-demand-since-march/\">Bitcoin put options see highest demand since March</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-23T10:00:50.000Z",
    "title": "\n                        BlockFi Pushes Back On FTX And Three Arrows Capital Repayment\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/blockfi-pushes-back-on-ftx-and-three-arrows-capital-repayment",
    "description": "\n                        <p dir=\"ltr\">Bankrupt crypto lender BlockFi is reportedly trying to block attempts by FTX and Three Arrows Capital (also bankrupt) to retrieve millions of dollars to pay back their creditors.&nbsp;</p>\n<p dir=\"ltr\">BlockFi has claimed that, by its estimates, legal battles with FTX and Three Arrows Capital could cost its customers up to $1 billion.&nbsp;</p>\nBlockFi Looks To Stop FTX And 3AC Repayment&nbsp;\n<p dir=\"ltr\">BlockFi claimed in a 21st August filing at the New Jersey bankruptcy court that its own creditors must not be pushed to the back of the line because FTX&rsquo;s creditors were harmed thanks to the exchange allegedly misappropriating the $5 billion that BlockFi had initially lent it. In an attempt to safeguard the interest of its creditors, BlockFi has stated it will actively look to block attempts by FTX and Three Arrows Capital to claw back billions to pay off their own creditors. The crypto lender argued that its bankruptcy directly resulted from the fraud perpetrated by FTX and 3AC. BlockFi stated in its filing,&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;FTX seeks to recover on over $5 billion of claims filed against the BlockFi estates at the direct expense of the ultimate victims of FTX&rsquo;s fraud: BlockFi&rsquo;s clients and other legitimate creditors. To prevent further injustice to the creditors of BlockFi&rsquo;s estates, the Court should disallow the FTX Claims under the doctrine of unclean hands.&rdquo;</p>\n\n<p dir=\"ltr\">FTX had also given $400 million to BlockFi in June 2022 in an attempt to remedy the situation. This was in addition to purchasing BlockFi equity pursuant to a loan agreement, the filing added. However, BlockFi has stated that this was not a standard loan agreement. Instead, the crypto lender has stated that it was an unsecured, 5-year term which was also well below market rates. It further added that repayments were not due until the firm would supposedly mature.&nbsp;</p>\n<p dir=\"ltr\">BlockFi called FTX&rsquo;s investment a gamble, one that BlockFi&rsquo;s creditors should not be held liable for. BlockFi stated in its argument,&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;Just because FTX&rsquo;s fraudulent actions caused FTX&rsquo;s bet to fail does not mean BlockFi&rsquo;s creditors are now somehow liable to refund the purchase price.&rdquo;</p>\n\nBlockFi Owes Billions To Creditors&nbsp;\n<p dir=\"ltr\">Several estimates have shown that BlockFi reportedly owes up to $10 billion to over 100,000 creditors. This figure includes $1 billion to three of its largest creditors and $220 million to bankrupt crypto hedge fund Three Arrows Capital. Three Arrows Capital&rsquo;s creditors have reportedly expressed considerable frustration with the slow pace of bankruptcy proceedings.&nbsp;</p>\n<p dir=\"ltr\">BlockFi has argued that Three Arrows Capital, like FTX, was not entitled to repayment and claimed that the crypto hedge fund used fraudulent means to borrow the funds. Three Arrows Capital had previously taken loans from BlockFi, on which it subsequently defaulted. This led to the foreclosure on the collateral, leading to what liquidators have described as a $220 million preferential payment to BlockFi.&nbsp;</p>\n<p dir=\"ltr\">BlockFi&rsquo;s creditors have also accused the company of ignoring several warnings and red flags when dealing with FTX and its sister concern Alameda Research, just months prior to the FTX collapse. The creditors claimed that the CEO of BlockFi ignored advice from BlockFi&rsquo;s risk management team, which had stated that Alameda Research&rsquo;s balance sheet primarily consisted of FTX&rsquo;s own FTT token. However, the CEO dismissed such concerns and urged the risk management team to get comfortable with Alameda Research being a borrower similar to Three Arrows Capital.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;As early as August 2021, BlockFi&rsquo;s risk management team was advised that Alameda&rsquo;s balance sheet was largely comprised of &lsquo;~7bb unlocked FTT and 11bb total including locked tokens based on unaudited financials. This set off alarms at BlockFi. Mr. Prince dismissed the concerns, urging the risk team to learn to &lsquo;get comfortable [with Alameda] being a three arrows size borrower, just with FTT and other collateral types instead of GBTC shares.&rdquo;</p>\n\n<p dir=\"ltr\">However, BlockFi&rsquo;s creditors settled with the company last month on moving ahead with a repayment plan. BlockFi collapsed just weeks after FTX, filing for Chapter 11 bankruptcy on the 28th of November.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T09:55:00.000Z",
    "title": "Singapore’s inflation decreases to 3.8%, lowest point in over year",
    "url": "https://www.cryptopolitan.com/singapores-inflation-decreases/",
    "description": "Singapore experienced a further decrease in core inflation, dropping to 3.8 percent year-on-year in July, which marks the lowest point over a year. The decrease from June&#8217;s 4.2 percent can be attributed to a reduced rise in food expenses and a decline in electricity and gas charges. The Ministry of Trade and Industry (MTI) and ... <a title=\"Singapore&#8217;s inflation decreases to 3.8%, lowest point in over year\" class=\"read-more\" href=\"https://www.cryptopolitan.com/singapores-inflation-decreases/\" aria-label=\"More on Singapore&#8217;s inflation decreases to 3.8%, lowest point in over year\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T09:46:44.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $20.76 with a 24-hour trading volume of $618,897,839. Solana is down 3.33% in the last 24 hours. The current CoinMarketCap ranking is #9, with a live market cap of $9,473,881,101. It has a circulating supply of 418,890,490 SOL coins, and the maximum supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T09:40:29.000Z",
    "title": "Navigating HR Challenges with AI-Driven Transformation for Workplace Wellness and Efficiency",
    "url": "https://www.cryptopolitan.com/hr-challenges-with-ai-driven-transformation/",
    "description": "In an era characterized by disruptions, surging resignation rates, and mounting employee expectations, HR professionals are grappling with unprecedented stress levels. With global employee stress reaching record highs for two consecutive years, HR teams are feeling the brunt of the impact. The convergence of the Great Resignation phenomenon and the ongoing workplace transformation has left ... <a title=\"Navigating HR Challenges with AI-Driven Transformation for Workplace Wellness and Efficiency\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hr-challenges-with-ai-driven-transformation/\" aria-label=\"More on Navigating HR Challenges with AI-Driven Transformation for Workplace Wellness and Efficiency\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-23T10:08:09.000Z",
    "title": "OpenSea former exec imprisoned for NFT insider trading",
    "url": "https://crypto.news/opensea-former-exec-imprisoned-for-nft-insider-trading/",
    "description": "A former head of product at NFT marketplace giant OpenSea has been sentenced to prison and will forfeit the Ethereum (ETH) he gained from his insider trading activities.  In May, Nathanial &#8216;Nate&#8217; Chastain was convicted of fraud and money laundering.&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T10:00:14.000Z",
    "title": "Beating Dogecoin (DOGE) and BNB: VC Spectra’s (SPCT) 900% Presale Gain Awaits!",
    "url": "https://www.crypto-news-flash.com/beating-dogecoin-doge-and-bnb-vc-spectras-spct-900-presale-gain-awaits/?utm_source=rss&utm_medium=rss&utm_campaign=beating-dogecoin-doge-and-bnb-vc-spectras-spct-900-presale-gain-awaits",
    "description": "<img width=\"512\" height=\"301\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-105.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-105.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-105-300x176.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />With the SEC rampaging the crypto market, Dogecoin (DOGE) and BNB (BNB) have been placed under legal scrutiny. This has raised questions about their future. On another note, VC Spectra (SPCT), a new crypto investment token, has lightened the market&#8217;s mood with its 900% price surge. VC Spectra (SPCT) has attained half of its forecasted [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-23T10:04:21.000Z",
    "title": "Top Coins From Our Team – Part 1",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-coins-from-our-team-part-1/",
    "description": "<p>We recently shared a series of articles on the top coins held by our CEO. And we observed that a lot of our readers had a real interest in knowing about our preferences. So, we’ve decided to share a couple of coins held by some of our team members. As we’d like to point out, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-coins-from-our-team-part-1/\">Top Coins From Our Team &#8211; Part 1</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]