[
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T01:45:25.000Z",
    "title": "Binance used ‘tortured’ interpretation of law in bid to toss suit, says SEC",
    "url": "http://cointelegraph.com/news/binance-tortured-law-interpretation-suit-dismissal-sec",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/2153eae1-3658-4177-ace9-f34aa48e98fc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The SEC derided Binance’s request to have the regulator’s suit thrown out, claiming the crypto exchange hasn’t correctly applied the law.</p>\n                    <p><p>Binance’s arguments used in its motion to dismiss a lawsuit from the United States securities regulator relies on an incorrect legal analysis and have no basis in law, the regulator has argued.</p><p>In a Nov. 7 court <a href=\"https://www.courtlistener.com/docket/67474542/172/securities-and-exchange-commission-v-binance-holdings-limited/\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> the SEC rebuffed Binance’s earlier <a href=\"https://cointelegraph.com/news/binance-ceo-chanpgeng-zhao-asks-court-dismiss-sec-lawsuit\">bid to toss the regulator’s suit</a> saying no court has adopted Binance’s “tortured interpretation of the law.”</p><p>The <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">SEC sued Binance</a> in June alleging it, Binance.US and its founder Changpeng “CZ” Zhao sold unregistered securities and failed to register as an exchange in the United States. </p><p>Binance argued the SEC failed to introduce crypto guidelines, misinterpreted securities laws and applied them to crypto and called the suit an overstep of its authority.</p><p>In its latest rebuttal, the SEC claimed Binance “never complied” with federal securities laws which was “a deliberate choice.”</p><blockquote>“Binance’s Chief Compliance Officer crudely but succinctly summed up this case when he admitted that Binance was ‘operating as a fking unlicensed securities exchange in the USA bro.’ He was right.”</blockquote><p>It added Binance’s arguments that compared crypto to “supermarket items like oranges [...] are absurd” and claimed the crypto exchange’s crypto sales are investment contracts under the <a href=\"https://cointelegraph.com/news/what-are-the-howey-test-and-its-implications-for-cryptocurrency\">Howey test</a>.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-inspector-general-says-prohibition-crypto-ownership-hinders-agency-hiring\"><strong><em>SEC Inspector General says prohibition on crypto ownership hinders agency hiring</em></strong></a></p><p>The regulator reiterated its claims the BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) initial coin offering violated securities laws and Binance USD (BUSD) along with the yield-bearing staking, Vault and Earn programs are investment contracts.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/94f17261-2c64-40ba-9f03-52f10270c92f.png\"  /><figcaption style=\"text-align: center;\"><em>Highlighted excerpt of the SEC’s arguments claiming Binance sold unregistered securities from unregistered exchanges in the U.S. Source: CourtListener</em></figcaption></figure><p>It also rebuffed Binance’s argument that the suit violated the major questions doctrine — a 2022 U.S. Supreme Court ruling saying Congress doesn’t delegate authority to agencies, which other crypto firms have cited in their aim to push back on the SEC’s claimed authority.</p><p>The SEC claimed granting Binance’s dismissal request would “dismantle decades of foundational precedent upon which the nation’s securities laws operate” and in its place would be a “rigid framework” that upends the “broad, flexible regime” of the current laws.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/cuba-bitcoin-revolution-adoption-embargo/\"><strong><em>The truth behind Cuba’s Bitcoin revolution — An on-the-ground report</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-09T01:45:12.000Z",
    "title": "SEC’s first window to approve all 12 spot Bitcoin ETFs starts today",
    "url": "http://cointelegraph.com/news/bitcoin-etf-approval-window-sec-bloomberg-analysts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/e51e0fd1-629c-4ca2-b0ec-3e7513242e67.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>There’s an eight day window between Nov. 9 and Nov. 17 where all 12 spot Bitcoin ETF filings could be approved by the SEC, according to Bloomberg ETF analysts James Seyffart and Eric Balchunas.</p>\n                    <p><p>The United States Securities and Exchange Commission could approve all 12 of the pending spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange traded fund (ETF) applications within the next eight days. </p><p>Bloomberg ETF analysts James Seyffart and Eric Balchunas wrote that starting from Nov. 9 the SEC has a “window” to approve all 12 spot Bitcoin ETF filings — including <a href=\"https://cointelegraph.com/news/grayscale-new-spot-bitcoin-etf-nyse\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/grayscale-new-spot-bitcoin-etf-nyse/amp\">Grayscale’s conversion of its GBTC</a> trust product — in the days leading up to Nov. 17, but stressed this was only a possibility. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">New Research note from me today. We still believe 90% chance by Jan 10 for spot <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&ref_src=twsrc%5Etfw\">#Bitcoin</a> ETF approvals. But if it comes earlier we are entering a window where a wave of approval orders for all the current applicants *COULD* occur <a href=\"https://t.co/u6dBva1ytD\">pic.twitter.com/u6dBva1ytD</a></p>— James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1722321412218638632?ref_src=twsrc%5Etfw\">November 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“Delay orders were issued by the SEC for BlackRock, Bitwise, VanEck, WisdomTree, Invesco, Fidelity & Valkyrie at the same time,” Seyffart wrote in a Nov. 8 post on X (formerly Twitter). </p><blockquote>“If the agency wants to allow all 12 filers to launch — as we believe — this is the first available window since Grayscale's court victory was affirmed.”</blockquote><p>The reason for this brief window is that <a href=\"https://cointelegraph.com/news/sec-punts-ark21shares-spot-bitcoin-etf-opens-proposal-comments\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-punts-ark21shares-spot-bitcoin-etf-opens-proposal-comments/amp\">when the SEC extended the deadline</a> for a number of the pending spot Bitcoin ETF filings, it selected Nov. 8 as the last day of the comment period.</p><p>From Nov. 17, the comment period for 3 filings, including Global X Bitcoin Trust, Hashdex Bitcoin ETF and Franklin Bitcoin ETF would recommence, meaning that they wouldn’t be approved or denied until after Nov. 23 at the earliest.</p><p>While the window for accepting all 12 filings ends on Nov. 17, Seyffart added that the SEC could technically make a decision on nine of the twelve applications anytime before Jan. 10.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/3ea04fb2-8f02-4801-98e5-1ceb1510df63.png\"><figcaption style=\"text-align: center;\"><em>Nine of the pending spot Bitcoin ETF applications could technically be approved anytime before Jan. 10. Source: James Seyffart</em></figcaption></figure><p>While the approval of a spot Bitcoin ETF is in no way guaranteed, both Seyffart and Balchunas predict a 90% chance of an approval sometime before Jan. 10 next year.</p><h3>Grayscale in talks with SEC over GBTC conversion</h3><p>While market pundits eagerly await the SEC’s decision, crypto asset manager Grayscale has reportedly initiated discussions with the regulator concerning its application to convert its trust product GBTC into a spot Bitcoin ETF, according to a Nov. 9 <a href=\"https://www.coindesk.com/policy/2023/11/08/us-sec-said-to-open-talks-with-grayscale-on-spot-bitcoin-etf-push/?utm_medium=referral&utm_source=rss&utm_campaign=headlines\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from CoinDesk. </p><p>According to sources familiar with the matter, Grayscale has been in contact with both the SEC's Division of Trading and Markets and the Division of Corporation Finance since <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/grayscale-wins-sec-lawsuit/amp\">winning its court battle</a> with the regulator on Aug. 29.</p><p>As the perceived odds of a Bitcoin ETF being approved have increased, so too has optimism in the crypto market, with the price of Bitcoin gaining more than 30% in the last 3 months. Bitcoin’s outsized rally has buoyed price activity in other major assets as well. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-hype-blockchain-games-yat-siu\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/spot-bitcoin-etf-hype-blockchain-games-yat-siu/amp\"><strong><em>Spot Bitcoin ETF hype reignited zest for blockchain games: Yat Siu</em></strong></a></p><p>In the past month, Solana (SOL) gained a <a href=\"https://cointelegraph.com/news/solana-sol-price-gains-october-firedancer-testnet-goes-live\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/solana-sol-price-gains-october-firedancer-testnet-goes-live/amp\">staggering 93% amid scaling improvements</a>, while Ripple (XRP) and Ether (ETH) grew 36% and 20% respectively.</p><p>While many within the industry are <a href=\"https://cointelegraph.com/news/galaxy-digital-soaring-bitcoin-price-increase-after-etf-launch\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/galaxy-digital-soaring-bitcoin-price-increase-after-etf-launch/amp\">confident an approval will kickstart</a> the next bull market, <a href=\"https://cointelegraph.com/news/spot-etf-bitcoin-rally-may-not-sustain-analysts\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/spot-etf-bitcoin-rally-may-not-sustain-analysts/amp\">other analysts aren’t convinced</a> that the rally has staying power.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a> </p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-09T02:00:00.000Z",
    "title": "Massive Shiba Inu Whale Moves over 4 Trillion $SHIB as Token Burns Rise",
    "url": "https://www.cryptoglobe.com/latest/2023/11/massive-shiba-inu-whale-moves-over-4-trillion-shib-as-token-burns-rise/",
    "description": "A massive Shiba Inu ($SHIB) whale has moved over 4.4 trillion tokens of the meme-inspired cryptocurrency to a wallet whose ownership hasn’t yet been identified, with the transaction being worth more than $35 million. The Shiba Inu whale’s transaction was first spotted by whale monitoring service Whale Alert, which noted on the microblogging platform X […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-09T02:00:56.000Z",
    "title": "Bitcoin Dominates: Overtakes Ethereum In 24H NFT Sales Volume For The First Time",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-dominates-overtakes-ethereum-in-24h-nft-sales-volume-for-the-first-time/",
    "description": "In a turn of events within the non-fungible token (NFT) market, Bitcoin (BTC) has achieved a significant milestone by surpassing Ethereum (ETH) in 24-hour NFT sales volume. This marks the first time that Bitcoin has outperformed Ethereum in this aspect. BTC’s NFT Breakthrough Bitcoin&#8217;s recent achievement of surpassing Ethereum in 24-hour NFT sales volume signals a changing trend and growing interest in the NFT market.  While Ethereum has long been recognized as the dominant blockchain for NFTs, Bitcoin&#8217;s entrance into the space demonstrates its increasing relevance and appeal to NFT enthusiasts and collectors. The data highlights that Bitcoin accounted for $17,291,694 in NFT sales, with 575 buyers participating. On the other hand, Ethereum recorded $26,689,252 in total sales, with 11,225 buyers.  Despite Ethereum maintaining a higher total sales figure, the relatively lower wash percentage of Bitcoin suggests a potentially healthier and more organic market activity. However, when it comes to volatility, data from Deribit, the leading crypto derivatives exchange, shows that the spread between ETH and BTC volatility, commonly referred to as the ETH DVOL vs. BTC DVOL spread, has narrowed significantly since October 23rd from -11.6 to just -0.6. This shift indicates a change in investor sentiment and increased attention towards Ethereum and altcoins. Related Reading: Dogecoin In Tight Zone: Why A Rally Will Happen If DOGE Clears $0.076 In light of this development, Ethereum has outperformed Bitcoin over the past fourteen days. ETH has seen significant price movement, gaining over 2% in the last 24 hours, 6% in the last seven days, and 4% in the last fourteen days, bringing its current price to $1,899. Meanwhile, Bitcoin has exhibited a slowdown in its upward momentum and is currently consolidating above $35,400. It has seen a 2% increase in the past 24 hours, 3% in the past seven days, and 1% in the fourteen-day timeframe. However, it is important to note that BTC has gained more than 82% year-to-date, while ETH has only increased by 30% during the same period, according to CoinGecko data.  Nasdaq 100 Correlation With Bitcoin Plummets According to recent Kaiko data, BTC has witnessed a significant decline in its correlation with traditional assets throughout the year. One notable development is the diminishing correlation between Bitcoin and the Nasdaq 100 index.  Over the past year, Bitcoin&#8217;s 60-day correlation with the Nasdaq 100 has substantially declined, plunging from over 70% in September 2022 to approximately 19% as of last week.  Bitcoin&#8217;s negative correlation with the US dollar, which ranged from 40% to 50%, has also weakened. Currently, the correlation is around 11%, signifying a reduced tendency for Bitcoin&#8217;s value to move in the opposite direction of the US dollar. Related Reading: Ethereum Failed Transactions: You Won’t Believe How Much Users Have Lost While Bitcoin&#8217;s correlation with gold has seen some upward momentum since August, the average correlation throughout the year has remained relatively low at 12%.  This suggests that the relationship between Bitcoin and gold has been modest regarding price movements and indicates a potential divergence in investment characteristics between the two assets. Featured image from Shutterstock, chart from TradingView.com "
  }
]