[
  {
    "source": "Decrypt",
    "date": "2023-10-17T21:27:15.000Z",
    "title": "Crypties 2023 Nominees Revealed: Vote for Crypto's Top Projects and Creators",
    "url": "https://decrypt.co/202019/crypties-2023-nominees-revealed-vote-crypto-top-projects-creators",
    "description": "Claim your free Crypties voting pass and cast your ballot to help choose this year’s most exciting crypto and emerging tech creators."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-17T21:28:42.000Z",
    "title": "Pro-crypto lawmaker stays interim US House Speaker as frontrunner loses first round of voting",
    "url": "https://cointelegraph.com/news/pro-crypto-lawmaker-house-speaker-following-vote",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/3b4b2f82-cc92-45de-978e-4975aef873a4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ohio Representative Jim Jordan, the Republican Party's nominee for Speaker, won the support of 200 of his colleagues in an Oct. 17 vote — below the 217 needed to hold the position.</p>\n                    <p><p>North Carolina Representative Patrick McHenry, chair of the United States House Financial Services Committee and crypto proponent in Congress, is still temporarily in the third most powerful role in government after one of his Republican colleagues failed to secure enough votes.</p><p>In a vote <a href=\"https://live.house.gov/\" target=\"_blank\" rel=\"noopener nofollow\">conducted</a> with members of the U.S. House of Representatives on Oct. 17, no candidate for Speaker won a majority of votes needed to secure the position. Ohio Representative Jim Jordan, the Republican Party's nominee for Speaker, obtained 200 votes — short of the 217 needed to win. </p><p>All 212 Democratic members of the House voted for Minority Leader Hakeem Jeffries, with other votes by Republican lawmakers going to Representatives Steve Scalise, Kevin McCarthy, Tom Emmer, Tom Cole, Thomas Massie and Mike Garcia, as well as former New York Rep. Lee Zeldin. According to House rules, a Speaker need not be a member of Congress. </p><p>Rep. McHenry, who has been serving as interim Speaker since Republican members <a href=\"https://cointelegraph.com/news/rep-patrick-mchenry-interim-house-speaker-mccarthy-oust\">voted to oust McCarthy</a> on Oct. 4, currently lacks the authority to move legislation forward in the House, with the exception of the Speaker vote. For the first time in U.S. history, half of the legislative branch of the federal government was largely paralyzed, <a href=\"https://cointelegraph.com/news/crypto-advocates-next-us-house-speaker\">making it impossible</a> to move forward with crypto-related bills. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/015c1cab-ce0b-46bf-bf50-c0d17cb92b04.png\"  /><figcaption style=\"text-align: center;\"><em>Rep. Patrick McHenry addressing the U.S. House of Representatives on Oct. 17. <a href=\"https://live.house.gov/\" target=\"_blank\" rel=\"noopener nofollow\">Source</a></em></figcaption></figure><p>Many pro-crypto users on social media have <a href=\"https://twitter.com/hosseeb/status/1712833665799958616\" target=\"_blank\" rel=\"noopener nofollow\">called</a> on lawmakers to make McHenry the next Speaker — an outcome which would also require nearly all Republicans in the House to unite behind one candidate. Behind U.S. President Joe Biden and Vice President Kamala Harris, the Speaker of the House is second in the country's presidential line of succession. However, some experts have reportedly <a href=\"https://www.nytimes.com/2023/10/04/us/politics/patrick-mchenry-interim-speaker.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the line of succession does not apply to an interim Speaker like McHenry.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-us-government-largest-bitcoin-hodlers-5b-in-btc-report\"><strong><em>US government among largest Bitcoin hodlers with over $5B in BTC: Report</em></strong></a></p><p>At the time of publication, it was unclear when McHenry planned to call for a second vote. Many have criticized Jordan for repeating falsehoods surrounding the results of the 2020 presidential election in favor of former President Donald Trump, but he remains the leading candidate with a Republican majority in the House and Democrats united behind Jeffries. </p><p>McHenry led the House Financial Services Committee as lawmakers <a href=\"https://cointelegraph.com/news/first-major-success-in-us-congress-for-two-crypto-bills-law-decoded-24-31-july\">voted in favor of crypto bills</a> including the Financial Innovation and Technology for the 21st Century Act, the Blockchain Regulatory Certainty Act, the Clarity for Payment Stablecoins Act and the Keep Your Coins Act. The pieces of legislation are expected to head to the House floor for a full vote, but the current situation with the Speaker makes that unlikely in the near future.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/opinion-republican-crypto-maxis-democrat-anti-crypto-army-mchenry-warren/\"><strong><em>Opinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T21:39:08.000Z",
    "title": "China and Russia’s alliance: Strategic partnership or risky bet?",
    "url": "https://www.cryptopolitan.com/china-russia-alliance-strategic-or-risky-bet/",
    "description": "The dynamic interplay between two of the world&#8217;s superpowers, China and Russia, has left many pondering the ramifications of their growing partnership. While at a glance it may appear that this alliance is rock-solid, a closer inspection reveals several layers of complexity and nuance. Strengthened Bonds Amid Global Strains Upon Vladimir Putin&#8217;s most recent visit ... <a title=\"China and Russia&#8217;s alliance: Strategic partnership or risky bet?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-russia-alliance-strategic-or-risky-bet/\" aria-label=\"More on China and Russia&#8217;s alliance: Strategic partnership or risky bet?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T21:22:42.000Z",
    "title": "SBF triumphs over Nasha Singh in tense cross-examination",
    "url": "https://www.cryptopolitan.com/sbf-triumphs-nasha-singh-cross-examination/",
    "description": "The courtroom was electric as Sam Bankman-Fried&#8217;s (commonly known as SBF) defense team executed a masterful cross-examination against Nishad Singh, a key prosecution witness. This showdown underscored the complexities surrounding campaign finance and the lines between personal choice and corporate interference. Drawing Shadows Over Singh’s Integrity In a whirlwind of revelations, Singh, a former close ... <a title=\"SBF triumphs over Nasha Singh in tense cross-examination\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sbf-triumphs-nasha-singh-cross-examination/\" aria-label=\"More on SBF triumphs over Nasha Singh in tense cross-examination\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T21:11:18.000Z",
    "title": "SBF’s lawyer counters claims on FTX’s expenditure",
    "url": "https://www.cryptopolitan.com/sbf-lawyer-counters-claims-ftxs-expenditure/",
    "description": "It was a high-tension environment as SBF&#8217;s defense vehemently contested allegations about his supposedly reckless spending at the now-defunct FTX crypto exchange. In a courtroom drama filled with sharp exchanges and unexpected revelations, former FTX executive Nishad Singh found himself on the receiving end of pointed cross-examination by Mark Cohen, SBF&#8217;s lead defense attorney. Cohen&#8217;s ... <a title=\"SBF&#8217;s lawyer counters claims on FTX&#8217;s expenditure\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sbf-lawyer-counters-claims-ftxs-expenditure/\" aria-label=\"More on SBF&#8217;s lawyer counters claims on FTX&#8217;s expenditure\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-17T21:16:04.000Z",
    "title": "Reddit shuts down blockchain-based Community Points service",
    "url": "https://crypto.news/reddit-shuts-down-blockchain-based-community-points-service/",
    "description": "Reddit has decided to discontinue its blockchain-based Community Points reward system, citing scalability challenges and regulatory concerns."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-17T21:11:26.000Z",
    "title": "SBF trial day 10: Judge Kaplan hints at early November conclusion",
    "url": "https://crypto.news/sbf-trial-day-10-judge-kaplan-hints-at-early-november-conclusion/",
    "description": "United States v Sam Bankman-Fried reopened on Oct. 17 with further testimony from Nishad Singh, former Alameda and FTX's chief developer, who says he felt intimidated by the defendant and disagreed with large spending decisions funded with customer crypto."
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-17T21:35:00.000Z",
    "title": "European Market Watchdog Advises Crypto Firms To Prepare For Rules",
    "url": "https://coinedition.com/european-market-watchdog-advises-crypto-firms-to-prepare-for-rules/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Smart-Money-Investor-Prepares-To-Utilize-Altcoin-Market-Downturn.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SNX, RPL, MNT, TON, and GMX: What&#039;s Driving the Sell-Off?\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Smart-Money-Investor-Prepares-To-Utilize-Altcoin-Market-Downturn.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Smart-Money-Investor-Prepares-To-Utilize-Altcoin-Market-Downturn-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Smart-Money-Investor-Prepares-To-Utilize-Altcoin-Market-Downturn-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>On October 17, Bloomberg reported that the European Securities and Markets Authority has urged crypto firms and national regulators to be prepared for the new European Union&#8217;s new industry regulations instead of depending on an extended transitional period. Moreover, the Authority emphasized the importance for digital asset companies to promptly seek authorization from national regulatory [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/european-market-watchdog-advises-crypto-firms-to-prepare-for-rules/\">European Market Watchdog Advises Crypto Firms To Prepare For Rules</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]