[
  {
    "source": "CryptoSlate",
    "date": "2023-09-27T08:00:49.000Z",
    "title": "Anxiety triggers massive Bitcoin sell-off among short-term holders",
    "url": "https://cryptoslate.com/insights/anxiety-triggers-massive-bitcoin-sell-off-among-short-term-holders/",
    "description": "<p>Quick Take Despite Bitcoin&#8217;s resilience, maintaining a value above $26,000, a wave of panic selling is washing over the short-term holders. Particularly, those who have held their positions for less than 155 days, are appearing to succumb to market fear and capitulation. Demonstrably, they have offloaded in excess of 15,000 Bitcoin at a loss in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/anxiety-triggers-massive-bitcoin-sell-off-among-short-term-holders/\">Anxiety triggers massive Bitcoin sell-off among short-term holders</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-27T07:45:55.000Z",
    "title": "Celsius seeks final approval for $45 million Core Scientific Bitcoin mining site",
    "url": "https://cryptoslate.com/celsius-cfo-seeks-final-approval-for-45-million-core-scientific-bitcoin-mining-site/",
    "description": "<p>Celsius Network LLC and its affiliated debtors in bankruptcy court have filed a motion seeking approval of a settlement agreement with Core Scientific Operating Company related to litigation between the two companies. In a declaration filed supporting the motion, Celsius&#8217; interim Chief Executive Officer, Chief Restructuring Officer, and Chief Financial Officer, Christopher Ferraro, stated that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/celsius-cfo-seeks-final-approval-for-45-million-core-scientific-bitcoin-mining-site/\">Celsius seeks final approval for $45 million Core Scientific Bitcoin mining site</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-27T08:06:48.000Z",
    "title": "Bankrupt Crypto Lender BlockFi Gets Approval To Repay Users",
    "url": "https://cryptodaily.co.uk/2023/09/bankrupt-crypto-lender-blockfi-gets-approval-to-repay-users",
    "description": "The bankrupt crypto lender BlockFi is set to begin repaying its customers after it received approval to begin the repayment process for customers as part of its amended liquidation plan."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-27T07:57:36.000Z",
    "title": "Binance Academy Sees 62% Rise in Traffic Inside Education Data",
    "url": "https://cryptodaily.co.uk/2023/09/binance-academy-sees-62-rise-in-traffic-inside-education-data",
    "description": "Binance Academy's 2023 user data unveils a significant shift in crypto education interest."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T07:55:49.000Z",
    "title": "BlockFi’s path to repayment: A glimmer of hope for creditors",
    "url": "https://www.cryptopolitan.com/blockfis-path-to-repayment-a-glimmer-of-hope/",
    "description": "In a landmark decision that has sent ripples through the cryptocurrency community, BlockFi, previously hailed as a leading figure in the crypto lending arena, has secured the much-anticipated approval from a United States Bankruptcy Court in New Jersey for its proposed liquidation plan.&#160; This pivotal approval not only underscores the challenges faced by crypto enterprises ... <a title=\"BlockFi&#8217;s path to repayment: A glimmer of hope for creditors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockfis-path-to-repayment-a-glimmer-of-hope/\" aria-label=\"More on BlockFi&#8217;s path to repayment: A glimmer of hope for creditors\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T07:50:18.000Z",
    "title": "Canada Takes Significant Steps in AI Legislation",
    "url": "https://www.cryptopolitan.com/canada-takes-steps-in-ai-legislation/",
    "description": "In recent developments, Canada has revealed a forward-looking legislative framework to consolidate its artificial intelligence (AI) leadership. Industry Minister François-Philippe Champagne recently announced the nation&#8217;s AI landscape, addressing its potential and challenges. This article dissects the critical aspects of Canada&#8217;s AI legislation, shedding light on the key amendments and their potential impact on the country&#8217;s ... <a title=\"Canada Takes Significant Steps in AI Legislation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/canada-takes-steps-in-ai-legislation/\" aria-label=\"More on Canada Takes Significant Steps in AI Legislation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T07:46:25.000Z",
    "title": "Blockchain Gaming and Metaverse Report: August 2023 Highlights",
    "url": "https://www.cryptopolitan.com/gaming-and-metaverse-report-august-2023/",
    "description": "Blockchain gaming and the metaverse continue to evolve, with significant developments and trends emerging in August 2023. This report provides key insights into the state of the Web3 gaming world, highlighting notable statistics, partnerships, NFT releases, metaverse dynamics, investments, and more. Blockchain gaming activity soars Blockchain gaming maintained its stronghold in the Web3 sector in ... <a title=\"Blockchain Gaming and Metaverse Report: August 2023 Highlights\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gaming-and-metaverse-report-august-2023/\" aria-label=\"More on Blockchain Gaming and Metaverse Report: August 2023 Highlights\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-27T07:40:21.000Z",
    "title": "Ramp partners with MetaMask to enhance web3",
    "url": "https://crypto.news/ramp-partners-with-metamask-to-enhance-web3/",
    "description": "Ramp has partnered with MetaMask to integrate its on-ramp services on the wallet’s mobile app"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-27T08:00:15.000Z",
    "title": "Early Rejection Of 21Shares Spot Bitcoin ETF Sparks Concerns",
    "url": "https://www.newsbtc.com/bitcoin-news/21shares-spot-bitcoin-etf/",
    "description": "The US Securities and Exchange Commission’s (SEC) early delay of the ARK 21Shares Spot Bitcoin ETF application has raised concerns in the crypto community about what this move might mean for the potential launch of any Spot Bitcoin ETF this year. No Spot Bitcoin ETF This Year? In a tweet shared on his X (formerly Twitter) platform, Bloomberg Analyst James Seyffart questioned the SEC’s latest decision and whether or not it “may put the hammer down for any hopes of an ETF approval this year.” He further quizzed whether this means we could see an imminent delay on some other Spot Bitcoin ETF applications with a deadline in October. Related Reading: Upcoming Optimism Unlock Threatens To Drag OP Below $1 On September 26, the SEC extended the time to decide on Cathie Wood’s ARK Invest ETF application until January 10, 2024 ( the final deadline). However, it is worrisome that the Commission had until November 11 (about 46 days to go) before making this decision but chose to do it this early. The SEC has usually made such a decision just days (and not weeks) before the deadline.  Seyfarrt showed less optimism in a subsequent tweet when he stated, “Its so over. Everybody can pack up and go home now.” signaling that he had probably lost hopes of a Spot Bitcoin ETF being launched this year.  Its so over. Everybody can pack up and go home now. https://t.co/wBsTHXCuEs — James Seyffart (@JSeyff) September 26, 2023 His statements are more significant considering that he, alongside another Bloomberg analyst, Eric Balchunas, had increased the likelihood of a Spot Bitcoin ETF launching this year to 75% following Grayscale’s victory against the SEC in August. Amidst all these delays, the SEC is yet to make a statement regarding the Grayscale’s application as the court had ordered the Commission to review the application again. Many expect the Commission to appeal the decision, with the deadline for an appeal coming in October.  Plausible Reasons For The SEC’s Early Delay Many in the crypto community, including Seyffart, had two major theories on why the SEC decided early on the ARK 21Shares Spot Bitcoin ETF application. One, they attributed it to the potential government shutdown that is looming.  The SEC is expected to be affected if the US government services were to shut down on October 1. The Commission will have to furlough 90% of its workforce and suspend most of its activities. However, it seems far-fetched considering that November 11 still seems far off, and government activities will have resumed by then. Related Reading: BULLISH: Bloomberg Analyst Points Out Two Key Bitcoin Metrics Demonstrating Historic Strength The second major theory was that the letter that Congress sent to the SEC Chair Gary Gensler might have struck the wrong nerves, prompting the Commission to make such a decision.  In the letter, the congressmen urged the Commission to approve the pending Spot Bitcoin ETFs following the court’s decision in the Grayscale case, stating that the “SEC’s current posture is untenable moving forward.” BTC price still holding $26,000 despite spot ETF delay &#124; Source: BTCUSD on Tradingview.com Featured image from Unsplash, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-27T07:58:54.000Z",
    "title": "Stellar $XLM and Avalanche $AVAX Tumble as Borroe.Finance Presale Soars",
    "url": "https://www.crypto-news-flash.com/stellar-xlm-and-avalanche-avax-tumble-as-borroe-finance-presale-soars/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-xlm-and-avalanche-avax-tumble-as-borroe-finance-presale-soars",
    "description": "<img width=\"512\" height=\"340\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-155.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-155.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-155-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-155-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The recent market slump has taken a serious toll on many top altcoins. Avalanche is celebrating a new EVM, but $AVAX keeps tumbling. Likewise, Stellar ($XLM) is celebrating the upcoming launch of Soroban smart contracts on its network. But $XLM remains in the deep red. Now, all eyes turn to Borroe.Finance ($ROE) as its fame [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-27T07:58:54.000Z",
    "title": "IOTA: ShimmerEVM to Be Released Tomorrow as Ecosystem Development and Adoption Rise – Will the Bulls Drive SMR Price to New Heights?",
    "url": "https://www.crypto-news-flash.com/iota-shimmerevm-to-be-released-tomorrow-as-ecosystem-development-and-adoption-rise-will-the-bulls-drive-smr-price-to-new-heights/?utm_source=rss&utm_medium=rss&utm_campaign=iota-shimmerevm-to-be-released-tomorrow-as-ecosystem-development-and-adoption-rise-will-the-bulls-drive-smr-price-to-new-heights",
    "description": "<img width=\"981\" height=\"552\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/IOTA_Shimmer_5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"IOTA\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/IOTA_Shimmer_5.jpg 981w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/IOTA_Shimmer_5-300x169.jpg 300w\" sizes=\"(max-width: 981px) 100vw, 981px\" />The imminent launch of ShimmerEVM is a testament to IOTA&#8217;s burgeoning ecosystem and its anticipated ripple effects on the SMR token price. ShimmerEVM&#8217;s innovative architecture augments blockchain applications, signaling a robust platform for future development. The cryptocurrency landscape is buzzing with anticipation as Shimmer recently elucidated via its Twitter account, &#8220;@shimmernet,&#8221; about the advent of [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-27T08:01:45.000Z",
    "title": "I AM 100% SURE These 4 Altcoins Will SURVIVE & Thrive",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/i-am-100-sure-these-4-altcoins-will-survive-thrive/",
    "description": "<p>The bear market is still going on. As it is, September is the worst month for crypto since the beginning of the bear. Since 2013, only two September saw green numbers. The way things look, we actually may see a green September.  But, this also means that the following months may even look better. If you [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/i-am-100-sure-these-4-altcoins-will-survive-thrive/\">I AM 100% SURE These 4 Altcoins Will SURVIVE &#038; Thrive</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]