[
  {
    "source": "NewsBTC",
    "date": "2024-03-16T03:00:13.000Z",
    "title": "Bitcoin FOMO: Over 533,330 Addresses Bought Above $70,180",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-fomo-533330-addresses-bought-70180/",
    "description": "On-chain data suggests more than 533,330 addresses FOMO&#8217;d into Bitcoin above $70,180. Following the latest plunge, these investors would all be in losses. Over 500K Bitcoin Addresses Have A Cost Basis Between $70,180 &#38; $71,340 As pointed out by analyst Ali in a post on X, many investors have bought at the recently high price levels. Below is the chart shared by the analyst that shows how the distribution of the BTC supply looks right now across the various price ranges. How the BTC cost basis distribution looks like for the price ranges near the current one &#124; Source: @ali_charts on X The data is from the market intelligence platform IntoTheBlock, which has used on-chain data to determine the average acquisition price for any given address based on when its coins moved into its balance. Related Reading: Bitcoin To $53,200? Why History Says It’s Possible In the chart, the size of the dots represents the amount of coins that have their cost basis inside the corresponding range. It would appear that the $64,743 and $66,700 range is below the current price that hosts the cost basis of a significant amount of addresses. More particularly, 382,000 addresses acquired 275,450 BTC at these levels. As the Bitcoin spot price is currently trading above this range, all these investors would naturally be carrying some profits. Generally, investors are sensitive to retests of their cost basis, as such retests can potentially flip their profit-loss status. For holders who were in profit before the retest, the dip may appear as an opportunity to buy more. The emerging reaction can be significant when many hands share their cost basis inside the same narrow range. If this retest occurs from above, the asset could feel some support as these investors rush to accumulate more. Since the $64,743 to $66,700 range is dense with investors and is situated below the current spot price of the cryptocurrency, it could act as a major support center. &#8220;Monitoring this level closely is crucial, as losing it could shift the focus to the next significant demand zone between $60,760 and $62,790, safeguarded by 797,500 addresses with over 298,000 BTC,&#8221; notes Ali. Related Reading: Bitcoin Miners Brace For Impact As Difficulty Reaches Unprecedented Levels In terms of the levels above, the $70,180 to $71,340 range particularly stands out, as 533,330 addresses bought a total of almost 433,000 BTC. A lot of these new buyers would be those FOMO&#8217;ing into the asset after seeing it explore new all-time highs. This large block, however, may serve as a point of resistance for the cryptocurrency. These fresh hands might sell just as quickly as they bought in when a retest of their cost basis happens since they may be willing to just exit at their break-even, fearing more drops in the near future. BTC Price Bitcoin has seen a sharp correction during the past day, following which its spot price is now trading around the $67,900 level. BTC made a brief visit under the $66,000 level during this correction &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, IntoTheBlock.com, chart from TradingView.com"
  }
]