[
  {
    "source": "CoinDesk",
    "date": "2023-08-03T07:09:50.000Z",
    "title": "Hashkey Wins Hong Kong's First Crypto Exchange License to Serve Retail Customers ",
    "url": "https://www.coindesk.com/policy/2023/08/03/hashkey-wins-hong-kongs-first-crypto-exchange-license-to-serve-retail-customers/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Hong Kong's first license to a cryptocurrency exchange to serve retail customers has gone to Hashkey Exchange."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-03T07:19:07.000Z",
    "title": "Ripple CTO Clarifies Misconceptions Surrounding XRPL Memos for Banks and Governments",
    "url": "https://www.cryptoglobe.com/latest/2023/08/ripple-cto-clarifies-misconceptions-surrounding-xrpl-memos-for-banks-and-governments/",
    "description": "In a recent Twitter exchange, Ripple’s Chief Technology Officer (CTO), David Schwartz, addressed concerns raised by an XRP community member about the potential misuse of memos on the XRP Ledger (XRPL), particularly in transactions involving banks and governments. The conversation was initiated by XRP fan “Mr. Intuitive”, who expressed apprehension about the XRPL feature that […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-03T07:10:00.000Z",
    "title": "US Department Of Justice Mulling Fraud Charges Against Binance",
    "url": "https://cryptodaily.co.uk/2023/08/us-department-of-justice-mulling-fraud-charges-against-binance",
    "description": "<p>In a nightmare scenario, a report has claimed that United States Department of Justice officials are contemplating bringing fraud charges against Binance, the world&rsquo;s largest cryptocurrency exchange.</p>\n<p>The Department of Justice has concerns about potential market instability and consumer fallout of such action.</p>\nDOJ Sets Its Sights On Binance\n<p>According to the report, while officials are mulling action, they are also concerned about the drastic domino effect it could have on the larger crypto market, leading to considerable market instability. According to sources familiar with the matter, Department of Justice officials are concerned that action against Binance could trigger a bank run similar to the one seen with bankrupt exchange FTX. The bank run in the wake of the FTX situation caused thousands of customers to lose their funds, triggering panic in the crypto markets.</p>\n<p>Reacting to the news, the crypto markets came under some selling pressure, with Bitcoin (BTC) and Ethereum (ETH) witnessing drops. BNB also saw a drop of over 3% following the reports but has since recovered, rising by 2%.</p>\nA Compromise?\n<p>Given the concerns surrounding action against Binance, the Department of Justice is contemplating compromise options such as non-deferred prosecution agreements and large fines. According to sources, such action would minimize harm to consumers while still holding the exchange accountable for its actions. Reports of the Department of Justice contemplating action against Binance gathered steam after the United States Securities and Exchange Commission (SEC) sued the cryptocurrency exchange and its billionaire founder Changpeng Zhao.</p>\n<p>The Securities and Exchange Commission brought 13 charges against the exchange, which included operating as an unregulated securities exchange in the United States and commingling investor funds. It has also charged Binance with misleading customers by using a secret market-making firm called Sigma Chain and manipulating trades on Binance&rsquo;s US platform. Additionally, the United States Commodity Futures Trading Commission (CFTC) has also brought similar charges against the exchange.</p>\nA Potential Black Swan\n<p>According to the Q1 2023 crypto industry report, FTX held a 5% market share of the spot crypto trading volumes across the top ten crypto exchanges. The exchange&rsquo;s collapse decimated the crypto markets, with Bitcoin dropping by almost 25% in 2 days. Data from the Block has revealed that in July 2023, Binance held a market share of 47% in spot crypto trading activity. Given that Binance holds a far more dominant position than FTX did, the ramifications for the market in the event of Binance meeting the same fate as FTX would be catastrophic.</p>\n<p>FTX collapsed largely due to a bank run due to fears about its balance sheet&rsquo;s strength, which were well-founded in the end as FTX eventually had to halt withdrawals. This is because the exchange did not have enough assets to process withdrawal requests. But is the concern surrounding Binance legitimate? Binance has stated on a number of occasions that it is possible to verify that the exchange holds its user assets in a 1:1 ratio apart from its reserves.</p>\n<p>According to its website, the exchange claims that the ratio of bits Bitcoin holdings with respect to customer net balances stands at around 104%. This means that as things stand, even if the Department of Justice brought fraud charges against Binance, the exchange would be able to fulfill all withdrawal requests without any issues. Despite the developments, Changpeng Zhao remained defiant, highlighting the fact that Binance Coin (BNB) was the fourth largest cryptocurrency by market capitalization.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-03T07:30:08.000Z",
    "title": "Sam Bankman-Fried Seeks to Avoid Jail, Denies Witness Tampering in FTX Case",
    "url": "https://news.bitcoin.com/sam-bankman-fried-seeks-to-avoid-jail-denies-witness-tampering-in-ftx-case/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Sam Bankman-Fried Seeks to Avoid Jail, Denies Witness Tampering in FTX Case\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Founder of bankrupt crypto exchange FTX, Sam Bankman-Fried (SBF), has sought to avoid being jailed, denying prosecutors’ accusations of witness tampering that followed an interview he gave for the New York Times. The indicted crypto mogul also argued that revoking his bond would violate his right to free speech. Bankman-Fried Says He Never Tried to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T07:23:29.000Z",
    "title": "UK Stocks Catching up with Nvidia’s Success in the AI Boom",
    "url": "https://www.cryptopolitan.com/uk-stocks-success-the-ai-boom/",
    "description": "The AI boom is in full swing, with Nvidia and other US AI stocks experiencing significant growth in 2023. While UK stocks may not be as renowned for their exposure to artificial intelligence, there are some hidden gems worth exploring on the London bourse. Investors recently took notice of RC365, a small player with AI ... <a title=\"UK Stocks Catching up with Nvidia&#8217;s Success in the AI Boom\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-stocks-success-the-ai-boom/\" aria-label=\"More on UK Stocks Catching up with Nvidia&#8217;s Success in the AI Boom\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-03T07:25:07.000Z",
    "title": "Kaspa (KAS) Takes Off With 23% Burst – What’s Fueling The Thrust?",
    "url": "https://www.newsbtc.com/all/kaspa-takes-off-with-23-burst/",
    "description": "Kaspa continues to captivate the blockchain sphere with its interesting nature as a Directed Acyclic Graph (DAG)-based proof-of-work (PoW) platform. Emerging onto the scene precisely when the blockchain realm was searching for an Ethereum (ETH) alternative, Kaspa&#8217;s protocol arrived as a timely solution. This came after Ethereum&#8217;s transition from proof-of-work to a proof-of-stake (PoS) framework the previous year. A DAG-based PoW is a variation of the traditional proof-of-work consensus mechanism used in blockchain systems. In a typical blockchain PoW system, miners compete to solve complex mathematical puzzles in order to add new blocks to the blockchain. This process requires significant computational power and energy consumption. Related Reading: Curve DAO (CRV) Price Recovery Post-Exploit: What Would Be A Realistic Scenario? The native coin of the Kaspa ecosystem, KAS, has recently generated significant attention. Its performance has been notably impressive, even in a challenging bear market. Currently priced at $0.04792611, according to CoinGecko data, KAS has exhibited a 17.3% surge in the last 24 hours. Over the past seven days, KAS has demonstrated an impressive climb of 23.3%. Source: Coingecko Driving Forces Behind KAS Coin&#8217;s Remarkable Growth Kaspa&#8217;s recent surge in prominence can be attributed to a strategic move that has set the stage for its remarkable growth trajectory. The blockchain platform has successfully concluded a crowdfund endeavor with a clear objective: securing a prestigious Tier-1 Exchange listing for its native token, KAS. ✅The Tier-1 Exchange Crowdfund for #Kaspa has been successfully completed, thanks to your immense support! More details coming soon. 👨🏽‍💻The $KAS browser wallet crowdfund is still live. Let&#8217;s keep the momentum going! Let&#8217;s continue to shape the future of finance.… pic.twitter.com/8Oda5yivFA — Kaspa (@KaspaCurrency) August 2, 2023 The crowdfund, which reached its conclusion on Aug. 2, aimed to amass a substantial sum of $30,000, drawing contributions in USDT and KAS tokens. Insights into this crowdfund achievement, provided through an update via reliable sources, promise to be unveiled shortly. The anticipation surrounding these forthcoming details suggests a direct correlation between this significant milestone and the recent surge in KAS&#8217;s valuation.  An astute Twitter user even pointed out an intriguing phenomenon: many traders appear to be divesting their Bitcoin holdings to acquire KAS tokens. Folks are literally selling $BTC to buy $KAS. Mission achieved. — Dr Martin Hiesboeck (@MHiesboeck) August 2, 2023 Diverse Investor Engagement Fuels Kaspa&#8217;s Rise A July Medium blog post by Kaspa shines a light on the purposeful allocation of funds raised through this ambitious campaign. The primary objective of the amassed funds is to fulfill the listing fee requirements established by a centralized exchange (CEX) set to list the KAS token. The CEX will judiciously utilize this substantial capital to orchestrate an extensive and impactful advertising campaign. KASUSDT trading at $0.046 on the daily chart: TradingView.com While the loyal native community has undeniably been a cornerstone of Kaspa&#8217;s growth, the entry of investors from diverse protocols, including Ethereum, has significantly fortified the project&#8217;s standing on a broader spectrum. As noted in a recent report, this influx of interest has magnified Kaspa&#8217;s allure, establishing it as an attractive proposition for a wider audience. Related Reading: Binance Coin (BNB) Price Gears Up For A 10% Upswing – Here’s How In a distinct departure from its competitors, Kaspa has distinguished itself through its remarkable capacity to process an impressive 100 blocks per second. This exceptional throughput rate introduces a level of efficiency that renders it exceptionally suited for enterprise adoption. This technical prowess demonstrates Kaspa&#8217;s commitment to scalability and opens doors to a myriad of real-world applications. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Pexels"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-03T07:18:51.000Z",
    "title": "Defying China’s Crypto Ban: Binance Users Trade $90 Billion in Crypto, Raises Questions on Real Ban Status",
    "url": "https://www.crypto-news-flash.com/defying-chinas-crypto-ban-binance-users-trade-90-billion-in-crypto-raises-questions-on-real-ban-status/?utm_source=rss&utm_medium=rss&utm_campaign=defying-chinas-crypto-ban-binance-users-trade-90-billion-in-crypto-raises-questions-on-real-ban-status",
    "description": "<img width=\"512\" height=\"301\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T143158.617.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T143158.617.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T143158.617-300x176.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Binance has been accused of assisting Chinese nationals to evade restrictions despite the crypto ban in the region. Users reportedly trade $90 billion in crypto-related assets on the exchange in a month.  In 2021, China banned financial institutions from facilitating crypto transactions. The country also banned all domestic crypto miners and outlawed the asset class [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-03T07:16:51.000Z",
    "title": "Solana Price Analysis: Bullish Pennant Pattern Signals a Potential Surge Beyond $30, DigiToads (TOADS) presale on the road to $7M",
    "url": "https://www.crypto-news-flash.com/solana-price-analysis-bullish-pennant-pattern-signals-a-potential-surge-beyond-30-digitoads-toads-presale-on-the-road-to-7m/?utm_source=rss&utm_medium=rss&utm_campaign=solana-price-analysis-bullish-pennant-pattern-signals-a-potential-surge-beyond-30-digitoads-toads-presale-on-the-road-to-7m",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T093129.445.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T093129.445.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T093129.445-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Larry Fink has been orange-pilled, more layer two scaling solutions including Coinbase’s very own Base are deployed on Ethereum (ETH), and major traditional equities approach ATHs. Bullish sentiment reigns supreme, and new DeFi projects are absolutely exploding in value. Everything points to the breakout of a fresh bull run as early as Q1 2024, and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-03T07:12:43.000Z",
    "title": "DOJ Contemplates Fraud Charges Against Binance But Concerned About a Possible ‘Bankrun’ Exchange CEO Responds to FUD – Is Crypto Headed to Ruins?",
    "url": "https://www.crypto-news-flash.com/doj-contemplates-fraud-charges-against-binance-but-concerned-about-a-possible-bankrun-exchange-ceo-responds-to-fud-is-crypto-headed-to-ruins/?utm_source=rss&utm_medium=rss&utm_campaign=doj-contemplates-fraud-charges-against-binance-but-concerned-about-a-possible-bankrun-exchange-ceo-responds-to-fud-is-crypto-headed-to-ruins",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/justice-7540197_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/justice-7540197_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/justice-7540197_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/justice-7540197_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/justice-7540197_1920-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />The U.S. Department of Justice is considering fraud charges against Binance, but officials are concerned about the potential impact on consumers and the broader cryptocurrency industry. Prosecutors are exploring alternative actions, such as fines or deferred agreements, to hold Binance accountable for alleged criminal behavior while minimizing harm to consumers. The View from Offshore: A [...]"
  }
]