[
  {
    "source": "Decrypt",
    "date": "2023-10-10T14:41:35.000Z",
    "title": "The Trial of Sam Bankman-Fried: Live Blog, Latest News and Insights",
    "url": "https://decrypt.co/199892/trial-sam-bankman-fried-live-blog-latest-news-insights",
    "description": "FTX founder Sam Bankman-Fried faces seven criminal charges related to the dramatic collapse of his crypto empire. Here's the latest on his trial."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-10T14:44:00.000Z",
    "title": "The new Cointelegraph Research Terminal, home to critical crypto data reports",
    "url": "https://cointelegraph.com/news/new-cointelegraph-research-terminal-critical-crypto-data-reports",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/b6a48f67-88ee-4a0e-9ea8-17c89a93e828.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cointelegraph’s new Research Terminal offers a slick new look and more features to help retail and institutional investors navigate the crypto space.</p>\n                    <p><p>In a rapidly changing blockchain and cryptocurrency landscape, staying informed is crucial. Cointelegraph has launched its new Research Terminal — an all-in-one destination for comprehensive crypto insights, detailed reports and extensive data. </p><p>The revamped terminal offers an improved user experience with a user-friendly interface, making it effortless to explore our wealth of content, whether on a desktop or mobile device. </p><p class=\"post-content__accent post-content__accent_small\"><a href=\"http://research.cointelegraph.com\"><em>Check out the new Cointelegraph Research Terminal here</em></a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/d177a736-2552-48ef-b354-9cd799390aa7.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">The updated Cointelegraph Research Terminal covers the crypto ecosystem like never before.</figcaption></figure><h2>Cointelegraph Research is still committed to free public reports</h2><p>An important part of the mission at Cointelegraph and Cointelegraph Research is to provide the most up-to-date information on the ever-changing blockchain industry and cryptocurrency landscape. This remains the driving force behind the terminal, and Cointelegraph Research will always have free public reports supported by partners interested in spreading the blockchain revolution. </p><p>For those seeking more in-depth or topical reports, there are two professional tiers: Pro and Premium. Pro lets users access Pro Weekly Articles and Monthly Investor Insights reports. The Premium plan includes everything in Pro, unlimited database access and extra features, such as a personalized one-on-one monthly call with one of our in-house analysts. Custom enterprise solutions are also available upon agreement.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/cddd48cb-0735-46bd-b2fe-ec2f23cb5934.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">Cointelegraph’s new Research Terminal introduces three new subscription tiers.</figcaption></figure><h2>Features of the terminal include:</h2><h3>Articles</h3><p>One of the primary changes is introducing an articles section that delves into multiple aspects of the crypto industry. These articles analyze the multifaceted blockchain sector, existing issues within the industry and its key players. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/69655f93-8835-49c9-a1da-4668f6e9c953.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">The new “Articles” section on Cointelegraph’s Research Terminal.</figcaption></figure><p>Cointelegraph covers all the breaking news in the blockchain industry each day. Now, Cointelegraph Research Terminal articles offer a more in-depth view with reference data and informative charts. The section includes free articles, as well as Pro subscription-level publications and education on major topics of interest, providing a detailed analysis of all things blockchain research.</p><h3>Reports</h3><p>For those seeking detailed, high-level analysis and research, the reports section has a lot to offer. Dive into extensive reports covering all aspects of the digital asset industry, ranging from venture capital flows and blockchain infrastructure to Web3 and metaverse trends. Readers interested in the most up-to-date analysis and forecasts will be pleased with Cointelegraph Research’s monthly Investor Insights reports, featuring thorough reviews of the industry’s current state, an analysis of the newest trends in multiple market sectors and a forecast for the month ahead.</p><p class=\"post-content__accent post-content__accent_small\"><a href=\"https://research.cointelegraph.com/reports/the-hitchhikers-guide-to-the-metaverse\"><em>See the latest report, The Hitchhiker’s Guide to the Metaverse, here</em></a></p><p>To further enrich your experience, Cointelegraph Research has partnered with some of the most respected names in the industry. Access reports from esteemed authors like bitsCrunch, Delphi Digital and TradingView to gain unique perspectives and unparalleled insights into the world of crypto.</p><h3>Databases</h3><p>Another key part of the terminal is the updated format for accessing Cointelegraph Research databases. From now on, all existing and future databases are available as part of the Premium subscription package. Users won’t have to limit themselves to specific scopes of data, with full access available to all databases instead.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/b05fb20e-4b54-48e7-a2a9-72da135dfc8e.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">Cointelegraph Research offers a broad selection of databases to keep users up-to-date on all the latest industry moves.</figcaption></figure><h3>Pitchroom</h3><p>Even with a Free subscription level, users can monitor venture capital opportunities and keep up-to-date with the most recent developments in crypto. </p><p>The knowledge gained could be the difference-maker in your crypto endeavors. Take the first step today by visiting Cointelegraph’s new Research Terminal, registering for a free subscription and joining our community of forward-thinkers shaping the future of money. The crypto world is brimming with opportunities, and Cointelegraph Research is glad to share our knowledge to assist you on your path.</p><h2>The Cointelegraph Research team</h2><p>Cointelegraph’s Research department comprises some of the best talents in the blockchain industry. Bringing together academic rigor and filtered through practical, hard-won experience, the researchers on the team are committed to providing the most accurate, insightful content available on the market.</p><p>With decades of combined experience in traditional finance, business, engineering, technology and research, the <a href=\"https://research.cointelegraph.com/\">Cointelegraph Research team</a> is perfectly positioned to put its combined talents to proper use. </p><p class=\"post-content__disclaimer\">The opinions expressed in this article are for general informational purposes only and are not intended to provide specific advice or recommendations for any individual or on any specific security or investment product.\n</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-10T14:45:28.000Z",
    "title": "Paul Tudor Jones concerned over U.S. stocks amid geopolitical tensions",
    "url": "https://cryptoslate.com/paul-tudor-jones-concerned-over-stocks-amid-geopolitical-tensions/",
    "description": "<p>Paul Tudor Jones, the billionaire hedge fund manager and founder of Tudor Investment Corporation, has voiced significant concerns about the current state of the stock market. In an interview with CNBC’s Squawk Box, Jones drew attention to escalating geopolitical risks and a deteriorating US fiscal position: “It’s a really challenging time to want to be [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/paul-tudor-jones-concerned-over-stocks-amid-geopolitical-tensions/\">Paul Tudor Jones concerned over U.S. stocks amid geopolitical tensions</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-10T15:06:53.000Z",
    "title": "NFL Alumni Association unveils new project to help retired players",
    "url": "https://www.cryptopolitan.com/nfl-alumni-association-retired-players/",
    "description": "The NFL Alumni Association has entered into a partnership with Aventus, a firm operating on the Polkadot parachain, to open up new revenue streams for retired NFL players, including the creation of NFT collectibles for fans. This collaboration aims to leverage the name, image, and likeness of retired players who choose to participate in the ... <a title=\"NFL Alumni Association unveils new project to help retired players\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nfl-alumni-association-retired-players/\" aria-label=\"More on NFL Alumni Association unveils new project to help retired players\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-10T15:00:34.000Z",
    "title": "Malaysia Prioritizes AI Education to Meet Industry Demands",
    "url": "https://www.cryptopolitan.com/malaysia-prioritizes-ai-education-demands/",
    "description": "In a recent address, Prime Minister Datuk Seri Anwar Ibrahim underscored the imperative of bolstering the nation’s capabilities in Artificial Intelligence (AI), particularly within tertiary education. The Prime Minister&#8217;s call to action stems from a recognition of Malaysia&#8217;s perceived lag in the rapidly advancing field of AI, a critical domain that intertwines with various industry ... <a title=\"Malaysia Prioritizes AI Education to Meet Industry Demands\" class=\"read-more\" href=\"https://www.cryptopolitan.com/malaysia-prioritizes-ai-education-demands/\" aria-label=\"More on Malaysia Prioritizes AI Education to Meet Industry Demands\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-10T14:57:10.000Z",
    "title": "Unity CEO John Riccitiello steps down amid runtime fee controversy",
    "url": "https://www.cryptopolitan.com/unity-ceo-steps-down-runtime-fee-controversy/",
    "description": "In a surprising turn of events, Unity CEO John Riccitiello has announced his retirement, leaving the game engine firm with immediate effect. This move comes on the heels of Unity’s recent controversy surrounding its plans to introduce an install-based “runtime fee” that had riled up game developers. Riccitiello, who is 65 years old, will not ... <a title=\"Unity CEO John Riccitiello steps down amid runtime fee controversy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/unity-ceo-steps-down-runtime-fee-controversy/\" aria-label=\"More on Unity CEO John Riccitiello steps down amid runtime fee controversy\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-10T14:46:05.000Z",
    "title": "Ethereum Layer-2 networks dominate Q3 transactions",
    "url": "https://www.cryptopolitan.com/ethereum-layer-2-networks-q3-transactions/",
    "description": "Ethereum’s Layer-2 networks took center stage in the third quarter, accounting for 61% of all transactions, according to the latest State of Ethereum report by Messari. The surge in Layer-2 activity was attributed to the explosive launch of Base, a platform that briefly surpassed Ethereum’s mainnet in transaction volume. Additionally, the unexpected popularity of the ... <a title=\"Ethereum Layer-2 networks dominate Q3 transactions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-layer-2-networks-q3-transactions/\" aria-label=\"More on Ethereum Layer-2 networks dominate Q3 transactions\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-10T15:04:12.000Z",
    "title": "Report: Cyprus to impose stricter compliance requirements on crypto business",
    "url": "https://crypto.news/report-cyprus-to-impose-stricter-compliance-requirements-on-crypto-business/",
    "description": "Cyprus wants to align with international standards set by the Financial Action Task Force."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-10T15:01:07.000Z",
    "title": "Nigeria’s Central Bank confident about local CBDC eNaira",
    "url": "https://crypto.news/nigerias-central-bank-confident-about-local-cbdc-enaira/",
    "description": "The Central Bank of Nigeria expressed the local CBDC, the eNaira, stating it's not a threat to the nation's financial stability."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-10T14:57:07.000Z",
    "title": "Layer-2 transactions accounted for over 60% of all Ethereum activity in Q3",
    "url": "https://crypto.news/layer-2-transactions-accounted-for-over-60-of-all-ethereum-activity-in-q3/",
    "description": "As more layer-2 solutions emerge, Ethereum is losing its dominance as the main network for on-chain activities."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-10T15:00:47.000Z",
    "title": "Here’s Why The Ethereum Price Fell Toward $1,500",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-price-fell-1500/",
    "description": "The price of Ethereum has experienced a notable decline following a major Ether sale this week. The unexpected decrease has left the crypto community anxious about the stability of the world’s second-largest cryptocurrency and the long-term effects of the decline.  Ethereum Price Drops After Large-Scale Ether Swap On Monday, October 9, the price of Ethereum declined following an extensive Ether swap by the Ethereum Foundation, a non-profit community-run organization dedicated to enabling better human coordination.  Related Reading: These Bullish Factors Prove XRP Price Rally Is Not Over Yet The Ether transaction which took place on Uniswap, a decentralized crypto exchange platform, saw the ETH price drop 5% from its daily high of $1,635 to a local low of $1,553 before recovering once more. According to Arkham data, the Ethereum Foundation swapped approximately 1,700 ETH worth $2.7 million to a single wallet address which contained almost $400,000 worth of cryptocurrencies and was titled ‘Grant Provider’ by Etherscan. The specific intentions behind the large-scale swap have not been disclosed by the Ethereum Foundation. However, the Ethereum Foundation, an organization that holds a considerable influential position, regularly swaps large amounts of tokens to fund its operations.  Presently, Ethereum is trading at a price value of 1589.36 after recovering from the initial decline. The steep decline has left the crypto community worried about the health of the cryptocurrency and whether the price of Ethereum would recover.  ETH price recovers after 5% decline &#124; Source: ETHUSD on Tradingview.com ETH Whales Dump $8.5 Billion The Ethereum Foundation has not been the only large wallet to sell in recent times as other ETH whales have taken advantage of the altcoin’s price. According to crypto analyst Ali Charts on X, ETH whales dumped a whopping $8.5 billion worth of tokens. Related Reading: Crypto Analyst Presents Data To Prove That XRP Is Deflationary This large selling started in February this year and has continued into October. As a result, the whale selling has seen over 5 million ETH sold and redistributed over this 8-month period. The analyst also points out that “this selling trend continues with no current indication of a shift towards #ETH accumulation yet.” ETH whales dump 5 million tokens &#124; Source: X Compared to its all-time high of $4891.70 in 2021, the price of ETH has dropped by more than half and has been struggling to reclaim the $2,000 mark. However, this could present a unique buying opportunity for investors who could see the price decline as ETH being on discount.  Nevertheless, Ethereum continues to hold its position as the second-largest cryptocurrency in the market with a market cap of $191.5 billion at the time of writing. Over the last day, the altcoin has also seen some recovery, rising to $1,593 as bulls gear up to retest the $1,600 resistance. Featured image from Techopedia, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-10T15:00:29.000Z",
    "title": "ETH20 Presale: Offering A Throwback To April 2014’s Ethereum For Just $0.1 And Stake-To-Earn Incentives.",
    "url": "https://www.crypto-news-flash.com/eth20-presale-offering-a-throwback-to-april-2014s-ethereum-for-just-0-1-and-stake-to-earn-incentives/?utm_source=rss&utm_medium=rss&utm_campaign=eth20-presale-offering-a-throwback-to-april-2014s-ethereum-for-just-0-1-and-stake-to-earn-incentives",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-35.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-35.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-35-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the dynamic world of cryptocurrency, Ethereum has long cemented its position as the second-largest crypto leader with an impressive market cap of $200B. Known for its robust credibility and &#8216;blue-chip&#8217; status, Ethereum seemed a promising investment till it hit saturation. Today, the dream of making multifold returns from Ethereum in 2023 seems far-fetched, especially [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-10T14:47:27.000Z",
    "title": "Uniswap Expands its Reach: Now Live on Polkadot via Moonbeam Network",
    "url": "https://www.crypto-news-flash.com/uniswap-expands-its-reach-now-live-on-polkadot-via-moonbeam-network/?utm_source=rss&utm_medium=rss&utm_campaign=uniswap-expands-its-reach-now-live-on-polkadot-via-moonbeam-network",
    "description": "As highlighted in a recent announcement, the UniSwap has gone live on the MoonBeam network.  The new development is poised to serve both the MoonBeam and the Uniswap community. According to a recent announcement shared by the MoonBeam network, UniSwap is now live on MoonBeam. It can be accessed easily using Okutrade’s feature-rich frontend for [...]"
  }
]