[
  {
    "source": "Bitcoin.com",
    "date": "2023-11-09T04:30:21.000Z",
    "title": "Biden Administration Seeks More Tools to Combat Illicit Crypto Use, Says Treasury Official",
    "url": "https://news.bitcoin.com/biden-administration-seeks-more-tools-to-combat-illicit-crypto-use-says-treasury-official/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/treasury-official-crypto-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biden Administration Seeks More Tools to Combat Illicit Crypto Use, Says Treasury Official\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/treasury-official-crypto-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/treasury-official-crypto-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/treasury-official-crypto-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/treasury-official-crypto-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/treasury-official-crypto-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/treasury-official-crypto-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/treasury-official-crypto.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />United States Deputy Secretary of the Treasury Wally Adeyemo says the Biden administration is seeking more tools to combat the illicit use of crypto. &#8220;We’re going to work with Congress to get more tools,&#8221; he stressed, advising the crypto industry to &#8220;make sure that you’re protecting yourselves from being in a position where people are [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-09T04:12:43.000Z",
    "title": "Ethereum Price Primed To Test $2,000, These Could Be The Factors To Watch",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-primed-2000/",
    "description": "Ethereum price is moving higher above the $1,900 resistance against the US dollar. ETH could accelerate higher toward $2,000 or even $2,120 in the coming sessions. Ethereum is showing positive signs above the $1,900 level. The price is trading above $1,880 and the 100-hourly Simple Moving Average. There is a connecting bullish trend line forming with support near $1,905 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move higher toward the $2,000 barrier in the near term. Ethereum Price Looks Set To Rally Ethereum is forming a base above the $1,850 support zone. ETH remained in a bullish zone and slowly moved higher above the $1,880 resistance, like Bitcoin. There was also a move above the $1,920 resistance. The price traded to a new multi-week high at $1,925 and is currently consolidating gains. The current price action is positive above the 23.6% Fib retracement level of the recent wave from the $1,852 swing low to the $1,925 high. Ethereum is trading above $1,880 and the 100-hourly Simple Moving Average. There is also a connecting bullish trend line forming with support near $1,905 on the hourly chart of ETH/USD. Source: ETHUSD on TradingView.com On the upside, the price is facing resistance near the $1,925 level. The next major resistance sits at $1,950, above which the price could accelerate higher. In the stated case, the price could rally toward the $2,000 resistance. The next key resistance is near $2,050, above which the price could aim for a move toward the $2,120 level. Are Dips Supported in ETH? If Ethereum fails to clear the $1,925 resistance, it could start a downside correction. Initial support on the downside is near the $1,905 level and the trend line. The next key support is $1,880 or the 100 hourly SMA or the 61.8% Fib retracement level of the recent wave from the $1,852 swing low to the $1,925 high. The main support sits at $1,850. A downside break below the $1,850 support might spark bearish moves. In the stated case, Ether could drop toward the $1,780 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,880 Major Resistance Level – $1,950"
  }
]