[
  {
    "source": "CoinDesk",
    "date": "2023-08-29T10:00:00.000Z",
    "title": "Yearn Finance Voters to Wintermute: Drop Dead",
    "url": "https://www.coindesk.com/business/2023/08/29/yearn-finance-voters-to-wintermute-drop-dead/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "One of the biggest market makers in crypto is having trouble getting nearly free money out of Yearn Finance."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-29T10:07:27.000Z",
    "title": "DoJ wants to bar SBF’s expert witnesses from testifying in court ",
    "url": "https://cointelegraph.com/news/doj-bars-sbf-s-expert-witnesses",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/cace5980-539d-43cd-bb9c-04c432620bc3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In a new motion submitted to New York courts, the U.S. Department of Justice wants to exclude all of Sam Bankman Fried’s expert witnesses from testifying on the case. </p>\n                    <p><p>The United States Department of Justice (DOJ) filed a <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590939/gov.uscourts.nysd.590939.236.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">motion</a> on Aug. 28 to have all seven of the expert witnesses for Sam Bankman Fried banned from testifying in court. </p><p>In the motion, the DOJ claims SBF’s proposed experts and their accompanying disclosures “suffer from an array of deficiencies” which it believes warrant being barred from the trial. </p><p>It continued to say that some of the disclosures “fail at the most basic level” to portray the opinions of the expert and most fail to provide a basis for the opinions, which is a requirement of the Federal Rule of Criminal Procedure 16. </p><p>“Where the defendant does disclose the expert’s opinions, the opinions are inappropriate subjects for expert testimony, lack a reliable methodology or basis in facts and data, or are irrelevant, unfairly prejudicial, and confusing to the jury.”</p><p>Additionally, it argues that the legal conclusions from the proposed experts would invade the purview of both the court and jury. The DOJ asked the court to exercise its “gatekeeping authority” to prevent such expert testimonies. </p><p>At the moment, the seven proposed witnesses are Lawrence Akka, Thomas Bishop, Brian Kim, Joseph Pimbley, Bradley Smith, Peter Vinella and Andrew Di Wu, all professionals in the legal field. </p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-29T10:00:06.000Z",
    "title": "Bitcoin mining revenue just edges past year-long average",
    "url": "https://cryptoslate.com/insights/bitcoin-mining-revenue-just-edges-past-year-long-average/",
    "description": "<p>Quick Take Bitcoin miner revenue currently stands at approximately $25.5 million, marginally surpassing the 365-day Simple Moving Average (SMA) of $22.5 million. This financial situation draws noteworthy similarities to the pattern seen in 2019 during the previous bear market when the revenue eventually dipped below the 365 SMA, prompting speculations about potential parallels in trends. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-mining-revenue-just-edges-past-year-long-average/\">Bitcoin mining revenue just edges past year-long average</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-29T09:46:32.000Z",
    "title": "Pantera Capital Sheds Light on Bitcoin’s Upcoming Halving and Its Potential Market Impact",
    "url": "https://www.cryptoglobe.com/latest/2023/08/pantera-capital-sheds-light-on-bitcoins-upcoming-halving-and-its-potential-market-impact/",
    "description": "In the latest issue of Pantera Capital’s “Blockchain Letter,” the crypto-focused investment firm examined the intricacies of Bitcoin’s upcoming halving event, which is expected in April 2024. Authored by Dan Morehead, Paul Veradittakit, Matt Stephenson, and Andrew Harris, the newsletter provided a comprehensive look at the mechanics and potential market impact of this significant event […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-29T10:00:00.000Z",
    "title": "\n                        SEC Charges LA-Based Impact Theory Over Unregistered Securities\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/sec-charges-la-based-impact-theory-over-unregistered-securities",
    "description": "\n                        <p class=\"MsoNormal\" style=\"line-height: 150%;\">The US SEC charged Impact Theory with the &ldquo;unregistered offering of crypto asset securities.&rdquo; The LA-based entertainment company has paid a $6 million settlement following the charges. </p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">On Monday, the SEC announced charging the LA-based Impact Theory with an unregistered securities offering. The agency claims Impact&rsquo;s 2021 NFT launch falls under an unregistered securities offering.</p>\nSEC: Impact Theory&rsquo;s NFT Launch Is an Investment Contract\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">In a press release, the SEC claimed the company conducted &ldquo;an unregistered offering of crypto asset securities in the form of purported non-fungible tokens (NFTs).&rdquo; According to the SEC, Impact Theory raised approximately $30 million from hundreds of investors through its 2021 offering.</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The securities agency claims that from October to December 2021, Impact offered and sold three tiers of NFTs, known as Founder&rsquo;s Key, which the company called &ldquo;Legendary,&rdquo; &ldquo;Heroic,&rdquo; and &ldquo;Relentless.&rdquo; The press release explains Impact Theory &ldquo;encouraged potential investors to view the purchase of a Founder&rsquo;s Key as an investment into the business, stating that investors would profit from their purchases if Impact Theory were successful in its efforts.&rdquo; The company allegedly stated that it was &ldquo;trying to build the next Disney,&rdquo; and if successful, would deliver &ldquo;tremendous value&rdquo; to Founder&rsquo;s Key purchasers.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The SEC&rsquo;s order, therefore, found that Impact&rsquo;s NFT sales to investors were investment contracts and, thus, securities. The securities agency established that Impact Theory violated federal securities laws by offering and selling these NFTs to the public without the necessary registration.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Antonia Apps, Director of the SEC&rsquo;s New York Regional Office, said: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;Absent a valid exemption, offerings of securities, in whatever form, must be registered.&rdquo;</p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Adding,</p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;Without registration, investors of all types are deprived of the protections afforded them by the robust disclosures and other safeguards long provided by our securities laws.&rdquo; </p>\n\n&nbsp;Impact Theory Settles with the SEC\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Impact Theory agreed to a cease-and-desist order in a settlement agreement, finding it violated the Securities Act of 1913. Without admitting or denying the agency&rsquo;s findings, Impact Theory also agreed to pay $6.1 million in &ldquo;disgorgement, prejudgement interest, and a civil penalty.&rdquo;&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The company further agreed to destroy all Founder&rsquo;s Keys in its possession or control, publish a notice of the SEC&rsquo;s order on its website and all social media channels, and eliminate royalties that it might receive from future secondary market sales involving the NFTs. The SEC&rsquo;s order also established a &ldquo;Fair Fund&rdquo; to return funds investors paid to buy the Founder&rsquo;s Keys.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The order against Impact Theory is the first NFT enforcement action the SEC has brought. In a statement, SEC Commissioners Hester Peirce and Mark Uyeda disagreed with the SEC&rsquo;s claims. </p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">They said: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;We dissented in part because we disagreed with the application of the&nbsp;Howey&nbsp;analysis. Regardless of what one thinks of the&nbsp;Howey&nbsp;analysis, this matter raises larger questions with which the Commission should grapple before bringing additional NFT cases.&rdquo; </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The Commissioners added: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;We understand why the Commission was concerned about this NFT sale. Even though we believe strongly that adults should be able to spend their money as they choose, we share our colleagues&rsquo; worry about the type of hype that entices people to spend almost $30 million for NFTs seemingly without having a clear idea about how they will use, enjoy, or profit from them. </p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">This legitimate concern, however, is not a sufficient basis to pull the matter into our jurisdiction. The handful of company and purchaser statements cited by the order are not the kinds of promises that form an investment contract. We do not routinely bring enforcement actions against people that sell watches, paintings, or collectibles along with vague promises to build the brand and thus increase the resale value of those tangible items.&rdquo; </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&nbsp;Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T10:07:47.000Z",
    "title": "UK shop price inflation drops owing to decreased food costs pressure",
    "url": "https://www.cryptopolitan.com/uk-shop-price-inflation-drops/",
    "description": "The shop price inflation in the UK dropped to its lowest level in nearly a year in August. A decrease primarily influenced this decline in the pressure on food costs. According to data from the British Retail Consortium (BRC) released on Tuesday, the yearly inflation rate slowed to 6.9% in August. That was a notable ... <a title=\"UK shop price inflation drops owing to decreased food costs pressure\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-shop-price-inflation-drops/\" aria-label=\"More on UK shop price inflation drops owing to decreased food costs pressure\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T10:04:17.000Z",
    "title": "Solana-based automation startup Clockwork announces shutdown",
    "url": "https://www.cryptopolitan.com/solana-based-automation-startup-clockwork-announces-shutdown/",
    "description": "Clockwork, a Solana-based smart contract automation project, announced its decision to shut down by the end of October, citing &#8220;limited commercial upside.&#8221; The startup, which had raised $4 million in a seed round last August, will cease active development and turn off its nodes on both devnet and mainnet. The news comes as a setback ... <a title=\"Solana-based automation startup Clockwork announces shutdown\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-based-automation-startup-clockwork-announces-shutdown/\" aria-label=\"More on Solana-based automation startup Clockwork announces shutdown\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-29T09:44:07.000Z",
    "title": "Shiba Inu Price Analysis: Bearish Pattern Puts Heavy Load On SHIB Advance",
    "url": "https://www.newsbtc.com/news/shiba-inu-price-analysis-bearish-pattern-stirs-worries-of-a-0-000007-dip/",
    "description": "The price of Shiba Inu (SHIB) has experienced a downward trend over the past several days. This corrective phase, marked by declining trading volumes, is shedding light on a potential weakening in bearish momentum. Interestingly, this price action aligns with the emergence of a triangle pattern, a technical phenomenon that often holds significant implications for market trends. In technical analysis, a triangle pattern refers to a chart pattern formed when the price moves within converging trendlines, creating a triangular shape. This pattern indicates a period of consolidation and indecision in the market, as buyers and sellers reach an equilibrium.  Typically, this pattern is associated with a temporary pause in the prevailing trend, and it often precedes a significant breakout or breakdown. Shiba Inu Bearish Pennant Formation According to a recent price analysis, this triangular sideways movement for SHIB comes on the heels of a substantial price drop, raising suspicions of a bearish pennant pattern taking shape. Related Reading: MATIC Social Sentiment Slides To Negative Territory – What’s The Impact On Price? A bearish pennant is characterized by a brief consolidation period following a sharp decline in price. During this time, the bearish momentum takes a breather, potentially prolonging the correction trendline. SHIB price action in the last seven days. Source: Coingecko A closer examination of the daily chart reveals a notable rejection from the lower trendline of the pattern. This rejection hints at the possibility of a bullish upswing within the confines of the pattern, suggesting that the SHIB price might be gearing up for a potential reversal. As of the latest data, the current SHIB price stands at $0.00000814 according to CoinGecko, indicating a 2.1% rally over the past 24 hours. In the span of seven days, SHIB has managed to accrue gains of 3.4%. These numbers, against the backdrop of recent market turbulence, hint at a certain level of resilience within the SHIB token. Implications Of Significant Token Movements Ali Martinez, a respected crypto trading chart analyst, has drawn attention to a startling development that could impact SHIB&#8217;s trajectory. In a post on X, Martinez noted an extraordinary movement: approximately 2 trillion SHIB tokens were rapidly withdrawn from established crypto exchange wallets within the preceding week. This revelation has set off ripples of speculation and discourse within the digital asset community. #ShibaInu &#124; A staggering 2 trillion $SHIB tokens have been pulled from known #crypto exchange wallets just this past week. pic.twitter.com/MiWMNUp7jY — Ali (@ali_charts) August 27, 2023 The swift movement of such a significant number of tokens raises questions about the potential implications for SHIB&#8217;s position within the broader crypto market. As market participants grapple with the ramifications of this withdrawal, it remains to be seen how this bold maneuver might shape SHIB&#8217;s future price action and overall market sentiment. SHIB market cap currently at $4.7 billion. Chart: TradingView.com Related Reading: OnlyFans Parent Company Buys $20 Million Worth of Ethereum – A Boost To ETH Price? With potential bullish signals emerging within this pattern and the intriguing withdrawal of tokens, the coming days could hold decisive clues about SHIB&#8217;s direction in a rapidly changing market environment. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Adobe Stock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-29T10:00:57.000Z",
    "title": "Why Are Investors Pouring Millions In Pomerdoge (POMD) While Solana (SOL) And Dogecoin (DOGE) Face Drought",
    "url": "https://www.crypto-news-flash.com/why-are-investors-pouring-millions-in-pomerdoge-pomd-while-solana-sol-and-dogecoin-doge-face-drought/",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-153.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-153.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-153-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-153-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As the crypto market has boomed, investment options have also increased. Therefore, it requires crypto investors to thoroughly research the market before putting money into any project. In 2023, Pomerdoge emerged as the most profitable project. Moreover, even investors of Dogecoin (DOGE) and Solana (SOL) have been shifting their sides to join this new project [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-29T09:47:35.000Z",
    "title": "Bitcoin (BTC) Price Prediction Amid Recent Plunge: The Place of BTCX",
    "url": "https://www.crypto-news-flash.com/bitcoin-btc-price-prediction-amid-recent-plunge-the-place-of-btcx/",
    "description": "<img width=\"960\" height=\"640\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BTCX.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BTCX.png 960w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BTCX-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BTCX-768x512.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BTCX-104x69.png 104w\" sizes=\"(max-width: 960px) 100vw, 960px\" />Despite the appeal of Bitcoin and Ethereum, the BTCX protocol has emerged to right their wrongs. The token is still in its infancy and combines deflationary features and utility. In the world of finance and investments, few assets have captured the imagination and attention of investors like Bitcoin (BTC). Since its inception in 2009, Bitcoin [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-29T09:45:47.000Z",
    "title": "BlackRock Doesn’t Need to Buy Bitcoin; They Just Mine Bitcoin as a Major Shareholder in 4 of the 5 Largest BTC Mining Companies in the World: Riot, Marathon, Cipher, Hut 8, and TeraWulf",
    "url": "https://www.crypto-news-flash.com/blackrock-doesnt-need-to-buy-bitcoin-they-just-mine-bitcoin-as-a-major-shareholder-in-4-of-the-5-largest-btc-mining-companies-in-the-world-riot-marathon-cipher-hut-8-and-terawulf/",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />BlackRock is a major shareholder in Riot, Marathon, Cipher, and Hut 8, four of the five largest Bitcoin mining companies by market cap. The investment giant has steadily increased its holdings in these mining companies, despite the Bitcoin mining industry facing challenges. In a tweet that has garnered significant attention within the cryptocurrency community, independent [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-29T10:01:32.000Z",
    "title": "Insane Potential Bitcoin Ordinals | 700% Up",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/insane-potential-bitcoin-ordinals-700-up/",
    "description": "<p>700% up. Yes. Since June,2023, $CNCL is up 700%. But it is also down 67% from its all-time high of $494.  Does this ordinals drop create an early opportunity for us again? Does this leading BRC-20 project really hold insane potential for the coming bull run? Bitcoin ETFs, and the new $3 billion Bitcoin wallet. A [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/insane-potential-bitcoin-ordinals-700-up/\">Insane Potential Bitcoin Ordinals | 700% Up</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-29T10:06:15.000Z",
    "title": "Binance Re-evaluates Services, Plans for a ‘Full Exit’ from Russia",
    "url": "https://coinedition.com/binance-re-evaluates-services-plans-for-a-full-exit-from-russia/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Binance-in-BIG-TROUBLE.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Binance-in-BIG-TROUBLE.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Binance-in-BIG-TROUBLE-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Binance-in-BIG-TROUBLE-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Binance-in-BIG-TROUBLE-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Binance-in-BIG-TROUBLE-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Binance-in-BIG-TROUBLE-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to a recent report dated August 28, the prominent crypto exchange Binance has been reassessing its services in Russia in light of the regulatory challenges. The Wall Street Journal revealed that the exchange is considering revolutionary changes including the possibility of a “full withdrawal” from the Russian crypto market. Binance’s move came following the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-re-evaluates-services-plans-for-a-full-exit-from-russia/\">Binance Re-evaluates Services, Plans for a ‘Full Exit’ from Russia</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]