[
  {
    "source": "Cointelegraph",
    "date": "2023-06-22T03:39:25.000Z",
    "title": "Starknet moves closer to EVM compatibility with upcoming ‘Kakarot’ testnet",
    "url": "https://cointelegraph.com/news/starknet-evm-compatibility-scalability-zk-evm-kakarot-testnet",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/1e984171-619f-44f8-b3dd-c9c2f251c481.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>With fresh funding under its belt, a new zkEVM is set to go to testnet in August, allowing developers to write in any EVM-compatible language on Starknet.</p>\n                    <p><p>Starknet, a zero knowledge layer-2 scaling solution for Ethereum is one step closer to becoming fully Ethereum Virtual Machine (EVM) compatible pending an August testnet launch of Kakarot, a new zkEVM.</p><p>On June 3, the Kakarot team announced it had received new backing from Ethereum cofounder Vitalik Buterin, Ledger co-founder Nicholas Bacca and Starkware. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We have powered up and entered Super Saiyan mode⚡. Kakarot Labs has officially been incorporated and closed a pre-seed round with top-tier investors.<br><br>Let’s unpack our vision, current standing, and the exciting future ahead.  <a href=\"https://t.co/VI8QRdPLfw\">pic.twitter.com/VI8QRdPLfw</a></p>&mdash; Kakarot zkEVM (@KakarotZkEvm) <a href=\"https://twitter.com/KakarotZkEvm/status/1664571575637626882?ref_src=twsrc%5Etfw\">June 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In an interview with Cointelegraph, Kakarot CEO and Co-Founder Elias Tazartes explained that while Starknet stands as a leading Zero Knowledge roll-up in the Ethereum ecosystem, it's not EVM compatible, so there’s “kind of a barrier to entry.” </p><p>Starknet is used by developers to scale decentralized applications, transactions and computation on Ethereum, but uses its own native language Cairo. According to Starknet, the use of Cairo makes it easier and faster to develop, review and maintain new code. </p><p>The downside is that it isn’t EVM compatible, which could dissuade some developers. </p><blockquote>“The greatest impact that Kakarot can have is to make Starknet EVM compatible.”</blockquote><p>“Kakarot right now is like a Solidity or any language engine. Eventually you will be able to put that engine within Starknet to make it EVM compatible.”</p><p>At present, Starknet runs its own custom smart contract Virtual Machine dubbed “Cairo VM” that leverages its native coding language Cairo. This means that Starknet doesn’t have direct EVM compatibility out of the box, something that could prove to be a significant hurdle for overall rollup performance. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e6fb7a4b-747a-4d7f-a6be-f5752fa733ae.jpg\"  /><figcaption style=\"text-align: center;\"><em>Kakarot co-founder Elias Tazartes.</em></figcaption></figure><p>“Some teams really need to be able to use Solidity. For example, if someone wrote a DEX or an AMM for the Ethereum ecosystem and now has 60,000 lines of code already audited, ready to go, but it’s only on EVM chains.” </p><p>If these developers wanted to start using Starknet they would have to hire a whole new dev team, write in, audit the code again and maintain two code bases, becoming what Tazartes describes as “prohibitively expensive.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/more-tps-less-gas-ethereum-layer-2-starknet-outlines-performance-upgrades\"><strong><em>More TPS, less gas: Ethereum L2 Starknet outlines performance upgrades</em></strong></a></p><p>According to Tazartes, the idea for the zkEVM was first floated during a Starkware conference in July 2022. By October, the development team was able to together for a week during a hacker house event in Lisbon, Portugal to get cracking on the new zkEVM. </p><p>Two months and 20 days later in December, the coding for the project was complete, arriving at a fully functional execution layer — all of which was achieved without any venture funding. </p><p>Notably, Tazartes said that Ethereum cofounder Vitalik Buteirn later invested in Kakarot due to his enthusiasm toward a multiple-zkEVM approach to building out the Ethereum ecosystem. </p><blockquote>“For Vitalik, the more zkEVMs the better, because as long as you have a wide diversity of architecture and diversity of approaches…then this is really good for the space as a whole.” </blockquote><p>Tazartes shared that the testnet version of Kakarot will be launched for public use in August this year. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\"><strong><em>Tornado Cash 2.0 — The race to build safe and legal coin mixers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-22T04:00:10.000Z",
    "title": "MATIC Price Prediction: Polygon Signals Recovery To $0.75",
    "url": "https://www.newsbtc.com/analysis/matic-analysis/matic-price-prediction-polygon-0-75/",
    "description": "MATIC price is recovering from the $0.55 support zone. Polygon might rise further toward the $0.725 and $0.750 resistance levels. MATIC price is attempting a recovery wave above the $0.60 resistance against the US dollar. The price is trading above $0.64 and the 100 simple moving average (4 hours). There was a break above a key bearish trend line with resistance near $0.605 on the 4-hour chart of the MATIC/USD pair (data source from Kraken). The pair could continue to rise if it clears the $0.725 resistance zone. Polygon’s MATIC Price Attempts Recovery In the past few days, Polygon’s price saw a major decline from well above $0.80. MATIC declined below the $0.750 support to move into a bearish zone. A low is formed near $0.5432 and the price is now attempting a fresh increase, similar to Bitcoin and Ethereum. The price was able to climb above $0.60. Besides, there was a break above a key bearish trend line with resistance near $0.605 on the 4-hour chart of the MATIC/USD pair. It broke the 23.6% Fib retracement level of the downward move from the $0.9067 swing high to the $0.5432 low. MATIC price is now trading above $0.64 and the 100 simple moving average (4 hours). It is now facing resistance near the $0.725 level. If there is an upside break above the $0.725 resistance level or the 50% Fib retracement level of the downward move from the $0.9067 swing high to the $0.5432 low, the price could continue to recover. The next major resistance is near $0.78. Source: MATICUSD on TradingView.com A clear move above the $0.78 resistance could start a steady increase. In the stated case, the price could even attempt a move toward the $0.80 level or $0.82. Fresh Decline in MATIC? If MATIC’s price fails to rise above the $0.725 resistance level, it could start a fresh decline. Immediate support on the downside is near the $0.65 level. The main support is near the $0.625 level. A downside break below the $0.625 level could open the doors for a fresh decline toward $0.60. The next major support is near the $0.55 level. Technical Indicators 4 hours MACD – The MACD for MATIC/USD is gaining momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for MATIC/USD is now above the 50 level. Major Support Levels – $0.65 and $0.625. Major Resistance Levels – $0.725, $0.75, and $0.78."
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-22T03:40:37.000Z",
    "title": "Stepping Into the Web 3.0 Arena – It’s Easier Than You Think",
    "url": "https://dailyhodl.com/2023/06/21/stepping-into-the-web-3-0-arena-its-easier-than-you-think/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/project-suffers-network-outage.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/project-suffers-network-outage.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/project-suffers-network-outage.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/project-suffers-network-outage.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/project-suffers-network-outage.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/project-suffers-network-outage.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/project-suffers-network-outage.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The word &#8216;Web 3.0&#8217; can spark a strange kind of fear. It&#8217;s tangled up in technical words that sound complicated and exclusive, as though it&#8217;s a club for tech wizards only – a place where the rest of us, who don&#8217;t speak the language of algorithms or blockchain, wouldn&#8217;t dare to tread. The reality is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/21/stepping-into-the-web-3-0-arena-its-easier-than-you-think/\">Stepping Into the Web 3.0 Arena – It’s Easier Than You Think</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]