[
  {
    "source": "CryptoSlate",
    "date": "2023-12-27T12:00:20.000Z",
    "title": "Bitcoin dip sees short-term holders send $2 billion to exchanges",
    "url": "https://cryptoslate.com/insights/bitcoin-dip-sees-short-term-holders-send-2-billion-to-exchanges/",
    "description": "<p>Quick Take Bitcoin&#8217;s recent dip below $42,000 prompted a swift response from short-term holders (STHs), who are investors that have held onto their BTC for less than 155 days. These STHs typically react quickly and aggressively to price changes, often making prompt decisions to buy or sell based on recent market movements. This 3% drop [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-dip-sees-short-term-holders-send-2-billion-to-exchanges/\">Bitcoin dip sees short-term holders send $2 billion to exchanges</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-27T11:57:52.000Z",
    "title": "Bitcoin dominance breaks trend - time for altcoins?",
    "url": "https://cryptodaily.co.uk/2023/12/bitcoin-dominance-breaks-trend-time-for-altcoins",
    "description": "Bitcoin dominance has broken an upward trend that it has respected since late November of 2022. Could this herald the start of a surge for altcoins?"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-27T12:00:17.000Z",
    "title": "LBank Labs’ Strategic Expansion into Morocco’s Casablanca Finance City: A Visionary Move with Enhanced Employee Benefits and Global Partnerships",
    "url": "https://news.bitcoin.com/lbank-labs-strategic-expansion-into-moroccos-casablanca-finance-city-a-visionary-move-with-enhanced-employee-benefits-and-global-partnerships/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/unnamed-2023-12-27t150050-060-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/unnamed-2023-12-27t150050-060-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/unnamed-2023-12-27t150050-060-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/unnamed-2023-12-27t150050-060-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/unnamed-2023-12-27t150050-060-1536x864.jpg 1536w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/unnamed-2023-12-27t150050-060-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/unnamed-2023-12-27t150050-060-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/unnamed-2023-12-27t150050-060-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/unnamed-2023-12-27t150050-060-1520x855.jpg 1520w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/unnamed-2023-12-27t150050-060-1280x720.jpg 1280w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/unnamed-2023-12-27t150050-060.jpg 1600w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. In the challenging global financial climate of 2023, LBank Labs, a $100 million fund and Fund of Funds, has made a strategic move by establishing its presence in Morocco. This decision, led by El Bachir Essamari and robustly supported by the leadership team, represents a significant step forward. Culminating in the prestigious Casablanca [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T12:08:57.000Z",
    "title": "This cryptocurrency is the most searched on Google; no, it’s not Solana (SOL) or Shiba Inu (SHIB)",
    "url": "https://www.cryptopolitan.com/this-cryptocurrency-is-the-most-searched-on-google-no-its-not-solana-sol-or-shiba-inu-shib/",
    "description": "Retik Finance (RETIK) has taken the cryptocurrency market by storm, becoming the most searched crypto token ahead of seasoned market players like Solana (SOL) and Shiba Inu (SHIB). A high ranking on Google search usually corresponds with high volume inflows, and this is evident in Retik’s recent performance.The DeFi sensation, which was launched two weeks [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T11:59:46.000Z",
    "title": "SEC’s in-kind redemption rules raise concerns for crypto ETFs",
    "url": "https://www.cryptopolitan.com/secs-in-kind-redemption-rules-raise-concerns/",
    "description": "In a significant development within the cryptocurrency market, concerns are mounting over the potential impact of the U.S. Securities and Exchange Commission&#8217;s (SEC) rules regarding in-kind redemptions on the burgeoning crypto exchange-traded funds (ETFs).&#160; Prominent figures in finance and crypto have voiced their apprehensions, highlighting the potential consequences of the SEC&#8217;s decision to insist on [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T11:51:28.000Z",
    "title": "South Korea enforces crypto asset disclosure for public officials in 2024",
    "url": "https://www.cryptopolitan.com/south-korea-enforces-crypto-asset-disclosure/",
    "description": "In a significant move to enhance transparency and accountability, South Korea&#8216;s Ministry of Personnel Management has announced that high-ranking public officials must disclose their cryptocurrency holdings starting next year.&#160; This development follows the passing of two bills in May, making crypto assets part of the annual disclosure requirement for elected and high-ranking government officials. Crypto [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-27T11:41:41.000Z",
    "title": "Apple iPhone Design Executive Joins Jony Ive and Sam Altman for AI Hardware Project",
    "url": "https://www.cryptopolitan.com/apple-joins-jony-ive-and-sam-altman-for-ai/",
    "description": "In a significant development, Tang Tan, an executive responsible for iPhone design at Apple Inc., is poised to join forces with design luminary Jony Ive, founder of the design studio LoveFrom, and OpenAI CEO Sam Altman. Their collaboration is set to revolutionize the world of AI hardware, with a particular focus on innovative devices for [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-27T11:51:51.000Z",
    "title": "Hong Kong to limit investors in purchasing stablecoins",
    "url": "https://crypto.news/hong-kong-to-limit-investors-in-purchasing-stablecoins/",
    "description": "Hong Kong authorities have proposed accepting and regulating fiat-pegged stablecoins (FRS). According to the document, the Financial Services and the Treasury Bureau (FSTB) and the Hong Kong Monetary Authority (HKMA) will allow retail investors to purchase stablecoins, but note that&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-27T12:00:28.000Z",
    "title": "Crypto Trading Firm Expects Bitcoin To Crash To $36,000, Here’s Why",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-to-crash-to-36000/",
    "description": "A recent market update by the trading firm QCP Capital has provided insights into how Bitcoin’s price would react if a Spot Bitcoin ETF gets approved in January. The firm predicts that there could be a major retracement before any move to the upside. Bitcoin Could Retrace To $36,000 QCP Capital predicts that Bitcoin could retrace to around $36,000 before an uptrend resumes. At the same time, they expect Bitcoin to face a topside resistance between the $45,000 and $48,500 region. These projections are based on what they expect to happen if the Securities and Exchange Commission (SEC) approves Spot Bitcoin ETFs in January. Related Reading: Harmony To See Redemption? Analyst Predicts Meteoric 650% Rise For ONE Token QCP Capital is of the opinion that the actual demand for these investment funds might fall short of market expectations at the beginning. If so, it set things up for the classic ‘sell the news’ scenario, which would cause Bitcoin’s price to dump. The trading firm had previously opined that Bitcoin could hit its all-time high of $69,000 if these Spot Bitcoin ETFs saw enough capital upon launching. Then, they also warned that approval could end up being a sell-the-news event if inflows into these funds were below par. Now, they seem to be suggesting that the latter is likely to happen. However, they don’t expect that Bitcoin will stay down for too long as they are confident that Bitcoin’s recent resurgence will continue at some point. They estimate that this will likely happen after a few weeks, especially as traders position for a strong rally ahead of the next big thing &#8211; the Bitcoin Halving. This event is projected as what will spark the next bull run. BTC price at $43,278 &#124; Source: BTCUSD on Tradingview.com All Attention Will Turn To Ethereum Ethereum might be the next big play once the pending Spot Bitcoin ETFs are approved. QCP Capital foresees the market’s anticipation, quickly turning to the Ethereum Spot ETFs. Just like with the Spot Bitcoin ETFs, a number of asset managers have also filed to launch a fund that offers direct exposure to Ethereum. Related Reading: Crypto Analyst Predicts XRP Price Will Hit $1.33 ‘Pretty Fast’ In anticipation of a potential approval of the Ethereum Spot ETFs, some crypto investors could move their capital from BTC to ETH ahead of an expected rally in Ethereum’s price. The trading firm stated that they are “leaning against very strong support in the ETHBTC cross at the 0.051 level.” QCP Capital, however, believes that any approval of an Ethereum Spot ETF is still “many months away.” In the meantime, they expect that Ethereum’s price will notable rallies based on such speculations. This could be something similar to what happened with Bitcoin, as the flagship cryptocurrency enjoyed significant rallies on the back of the Spot BTC approval rumors. Featured image from Freepik, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-27T12:07:43.000Z",
    "title": "Optimism’s OP Stack Gains Popularity in Web3 Gaming – What’s Next for OP Token?",
    "url": "https://www.crypto-news-flash.com/optimisms-op-stack-gains-popularity-in-web3-gaming-whats-next-for-op-token/?utm_source=rss&utm_medium=rss&utm_campaign=optimisms-op-stack-gains-popularity-in-web3-gaming-whats-next-for-op-token",
    "description": "<img width=\"1280\" height=\"864\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/11/game-controller-1532747_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Gaming Ripple\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/11/game-controller-1532747_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2020/11/game-controller-1532747_1280-300x203.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/11/game-controller-1532747_1280-1024x691.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/11/game-controller-1532747_1280-768x518.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/11/game-controller-1532747_1280-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2020/11/game-controller-1532747_1280-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/11/game-controller-1532747_1280-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/11/game-controller-1532747_1280-48x32.jpg 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />In a tumultuous year for the crypto market, Optimism (OP) has emerged as a robust Layer 2 (L2) solution, showing resilience and gaining significant traction. The Web3 gaming sector, marked by the entry of 76 new gaming-focused networks, remains attractive, and Optimism is poised to capitalize on this momentum. In a year defined by crypto [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-27T12:07:43.000Z",
    "title": "Ordinals Tokens Now Trade on PancakeSwap",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/ordinals-tokens-now-trade-on-pancakeswap/",
    "description": "<p>The introduction of three new ordinal&#8217;s token pairs marks a significant expansion of trading opportunities on the Binance Smart Chain (BNB). Let&#8217;s explore how this latest addition opens up avenues for users looking to engage in seamless transactions within the Ordinals ecosystem. Explore Ordinals Trading: New Pairs on PancakeSwap PancakeSwap, a decentralized exchange (DEX) built [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/ordinals-tokens-now-trade-on-pancakeswap/\">Ordinals Tokens Now Trade on PancakeSwap</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]