[
  {
    "source": "Cointelegraph",
    "date": "2024-01-17T05:10:46.000Z",
    "title": " Vitalik Buterin says L2s using Celestia are validiums, not genuine rollups ",
    "url": "https://cointelegraph.com/news/l2s-using-celestia-are-validiums-not-rollups-says-buterin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNzY1NzA1MGItZWIyMi00N2E3LWFjYzUtYzU0MmY4NjY2MjIzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Ethereum co-founder has sparked a debate on whether validiums are in the same category as layer 2 rollups.</p>\n                    <p><p>Ethereum co-founder Vitalik Buterin has sparked discussion on how various layer 2 scaling solutions are classified, claiming that the blockchain’s validiums are not genuine rollup solutions.</p><p>On Jan. 16, Buterin agreed with a comment posted to X (Twitter) by Daniel Wang, the founder of the Ethereum rollup solution Taiko, who said if an Ethereum rollup uses another data chain for data availability — such as the modular blockchain <a href=\"https://cointelegraph.com/news/crypto-traders-remain-bullish-on-celestia-tia-even-after-480-rally-here-s-why\">Celestia</a> — then it’s an Ethereum validium.</p><p>“This is correct,” Buterin replied. “The core of being a rollup is the unconditional security guarantee: you can get your assets out even if everyone else colludes against you.”</p><p><a href=\"https://cointelegraph.com/news/l2s-using-celestia-are-validiums-not-rollups-says-buterin\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-17T05:30:27.000Z",
    "title": "The ETF showdown: Bitcoin’s store of value vs Ethereum’s technological utility",
    "url": "https://cryptoslate.com/the-etf-showdown-bitcoins-store-of-value-vs-ethereums-technological-utility/",
    "description": "<p>Over the last few months, the crypto internet has been dominated by the Bitcoin ETF talk. And for a good reason. At a $835.7 billion market cap, the pioneering crypto makes up 49% of the total crypto market, consisting of tens of thousands of tokens. In Bitcoin’s 15-year life cycle, an exchange-traded fund (ETF) represents [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/the-etf-showdown-bitcoins-store-of-value-vs-ethereums-technological-utility/\">The ETF showdown: Bitcoin&#8217;s store of value vs Ethereum&#8217;s technological utility</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-17T05:30:52.000Z",
    "title": "Morgan Creek Capital CEO Skeptical About Near-Term SEC Approval for Spot Ethereum ETF",
    "url": "https://www.cryptoglobe.com/latest/2024/01/morgan-creek-ceo-skeptical-about-near-term-sec-approval-for-spot-ethereum-etf/",
    "description": "Mark Yusko, the founder, CEO, and CIO of Morgan Creek Capital, recently shared his insights with Cointelegraph about the recently approved (by the U.S. SEC) spot Bitcoin ETFs and their potential impact on the cryptocurrency market. Bitcoin ETFs and Market Dynamics Yusko expressed a critical view of the approval of spot Bitcoin ETFs, suggesting that […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T05:25:00.000Z",
    "title": "Canberra Takes Bold Steps to Tackle Higher-Risk AI",
    "url": "https://www.cryptopolitan.com/canberra-steps-to-tackle-higher-risk-ai/",
    "description": "In a significant move to address the evolving landscape of artificial intelligence, Canberra has taken a decisive step by releasing its interim response to the Safe and Responsible AI in Australia discussion paper, which was unveiled in June the previous year.&#160; The Australian government, led by Ed Husic, the Minister for Science and Industry, is [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-17T05:22:33.000Z",
    "title": "Ethereum Price Grinds Higher, Is This The Start Bulls Were Waiting For?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-grinds-higher-2620/",
    "description": "Ethereum price is attempting a fresh increase above the $2,550 level. ETH could continue to move up unless there is a drop below the $2,525 support. Ethereum is attempting a fresh increase above the $2,520 level. The price is trading above $2,520 and the 100-hourly Simple Moving Average. There is a connecting bullish trend line forming with support at $2,540 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move up if it clears the $2,600 and $2,620 resistance levels. Ethereum Price Holds Support Ethereum price remained well-supported above the $2,450 level. ETH outperformed Bitcoin and started a fresh increase above the $2,500 resistance zone. There was a move above the $2,550 resistance and the 100-hourly Simple Moving Average. The price even broke the $2,600 level before the bears appeared. A high is formed near $2,614 and the price is now correcting gains. There was a minor move below the 23.6% Fib retracement level of the upward move from the $2,471 swing low to the $2,614 high. Ethereum is still trading above $2,520 and the 100-hourly Simple Moving Average. There is also a connecting bullish trend line forming with support at $2,540 on the hourly chart of ETH/USD. It is close to the 50% Fib retracement level of the upward move from the $2,471 swing low to the $2,614 high. On the upside, the price is facing resistance near the $2,600 level. The next major resistance is now near $2,620. A clear move above the $2,620 level might start a decent increase. In the stated case, the price could rise toward the $2,665 level. Source: ETHUSD on TradingView.com The main breakout zone is now forming near the $2,710 zone. A close above the $2,710 resistance could start another major increase. The next key resistance is near $2,780. Any more gains might send the price toward the $2,880 zone. Fresh Decline in ETH? If Ethereum fails to clear the $2,620 resistance, it could start another decline. Initial support on the downside is near the $2,550 level and the trend line. The next key support could be the $2,500 zone. A downside break below the $2,500 support might send the price further lower. In the stated case, Ether could test the $2,450 support. Any more losses might send the price toward the $2,350 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $2,540 Major Resistance Level – $2,620"
  }
]