[
  {
    "source": "CoinDesk",
    "date": "2023-07-18T16:13:34.000Z",
    "title": "Crypto VC Firm Polychain Capital Raises $200M for Fourth Fund: Fortune",
    "url": "https://www.coindesk.com/business/2023/07/18/crypto-vc-firm-polychain-capital-raises-200m-for-fourth-fund-fortune/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "he crypto-focused firm has also cut three members of its research and development staff."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T16:38:00.000Z",
    "title": "Ripple’s XRP ruling threatens Celsius’ fate, counsel says",
    "url": "https://www.cryptopolitan.com/ripples-xrp-ruling-threatens-celsius-fate/",
    "description": "In a recent development in the crypto world, a significant legal ruling regarding the status of Ripple-linked XRP tokens as securities has caused ripples of concern among various stakeholders. However, the landmark judgment is unlikely to have a major impact on the wind-up plans of bankrupt crypto lender Celsius, as its counsel clarified before a ... <a title=\"Ripple&#8217;s XRP ruling threatens Celsius&#8217; fate, counsel says\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripples-xrp-ruling-threatens-celsius-fate/\" aria-label=\"More on Ripple&#8217;s XRP ruling threatens Celsius&#8217; fate, counsel says\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T16:34:55.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the series of delisting fuelled by the ongoing United States SEC crackdown on major crypto platforms. Basically, it&#8217;s crypto winter in the summer as it stands. How do Cardano Price Prediction analysts steer in this turbulent crypto weather? ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T16:33:17.000Z",
    "title": "A Comparative Analysis of Ripple (XRP), VC Spectra (SPCT), and Monero (XMR) – What You Need to Know in July 2023",
    "url": "https://www.cryptopolitan.com/a-comparative-analysis-of-ripple-xrp-vc-spectra-spct-and-monero-xmr-what-you-need-to-know-in-july-2023/",
    "description": "Amidst the crypto market&#8217;s fluctuations, investors remain attentive to various cryptocurrencies, seeking profitable prospects. Ripple (XRP) recently emerged victorious in the courtroom battle against the SEC. Meanwhile, Monero (XMR) retains its position as the leading privacy-focused token. However, a fresh contender takes the spotlight, offering investors maximized turns. With its unique proposition, VC Spectra (SPCT) ... <a title=\"A Comparative Analysis of Ripple (XRP), VC Spectra (SPCT), and Monero (XMR) – What You Need to Know in July 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/a-comparative-analysis-of-ripple-xrp-vc-spectra-spct-and-monero-xmr-what-you-need-to-know-in-july-2023/\" aria-label=\"More on A Comparative Analysis of Ripple (XRP), VC Spectra (SPCT), and Monero (XMR) – What You Need to Know in July 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T16:31:23.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-18T16:30:23.000Z",
    "title": "Litecoin Whales Deposit Big To Exchanges, Bearish Sign?",
    "url": "https://www.newsbtc.com/news/litecoin/litecoin-whales-deposit-big-to-exchanges-bearish-sign/",
    "description": "Data shows that Litecoin whales have deposited a large amount of the asset to exchanges during the past day, a sign that may be bearish for LTC. Litecoin Whales Have Made Significant Exchange Inflows In 24 Hours According to data from the cryptocurrency transaction tracker service Whale Alert, several large transfers have taken place on the LTC blockchain during the past day. In total, there have been four such transactions, with the largest of them involving the movement of 500,000 LTC (around $46 million at the time the transfer went through). While the other three interestingly all saw the same number of tokens moving on the network: 78,760 LTC (the USD price fluctuated between each of these transactions, but on average, the stacks were worth $7.2 million at the time of movement). As all these transactions are so large, it&#8217;s possible that whale entities were behind them. The whales are generally influential beings in the market, as they hold very large amounts in their wallets. Thus, their movements are usually something to look out for, as they may precede volatility in the price. Naturally, how the price may be influenced by these humongous investors&#8217; transfers depends on what exactly they wanted to achieve with said transactions. Here are some additional details regarding the largest of today&#8217;s transfers, which may help shed some light on the context surrounding it: Looks like this LTC transfer required a negligible fee to go through &#124; Source: Whale Alert As you can see above, the sending address in the case of this Litecoin transfer was an unknown wallet, meaning that it was unattached to any known centralized platform. Such addresses are usually investors&#8217; personal wallets. The receiving address, on the other hand, was connected to a centralized platform: the cryptocurrency exchange Binance. Transfers like this where coins move from self-custodial wallets to exchanges are called &#8220;exchange inflows.&#8221; Usually, one of the major reasons why holders may deposit their coins to exchanges is for selling-related purposes, so exchange inflows can have bearish effects on the price. Related Reading: Bitcoin Miners Selling Again, Will Price Crash Again? It&#8217;s possible that the whale here also made this deposit with a similar intention. Naturally, if it&#8217;s truly the case, the price could feel visible negative effects from it, considering the scale of the transaction. As for the other three transactions that were all of the exact same scale, two of these transfers were inflows similar to this one, while the remaining one was an outflow. Two of these transfers (both inflows) shared the same sending and receiving addresses, making it likely that the same whale might have been behind the deposits. The outflow&#8217;s receiving address doesn&#8217;t match any of the transactions from today, so it&#8217;s unknown if it&#8217;s related to them. However, it involves the exact same number of coins as the two inflows, so it raises suspicion that the same whale entity may have been behind it after all. Related Reading: Stablecoin Exchange Deposits Remain Low, What Does It Mean For Bitcoin? In any case, one reality continues to stand: there were total net inflows of $53.2 million in the last 24 hours, which can act as a source of significant selling pressure in the market for the cryptocurrency. LTC Price At the time of writing, Litecoin is trading around $91, down 6% in the last week. LTC has slipped down recently &#124; Source: LTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-18T16:35:19.000Z",
    "title": "Last Chance – Seize the Final Presale of MOOKY Before It Rockets Off on Uniswap, July 24, 2023",
    "url": "https://dailyhodl.com/2023/07/18/last-chance-seize-the-final-presale-of-mooky-before-it-rockets-off-on-uniswap-july-24-2023/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/06/Mooky.io-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>MOOKY, the groundbreaking memecoin poised to redefine the crypto landscape, is gearing up to make its grand debut in July 2023. With an array of exciting features such as CEX listings, NFT integration and an extensive marketing campaign, MOOKY is set to establish itself as the leading memecoin of the year. As the final stage [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/18/last-chance-seize-the-final-presale-of-mooky-before-it-rockets-off-on-uniswap-july-24-2023/\">Last Chance – Seize the Final Presale of MOOKY Before It Rockets Off on Uniswap, July 24, 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]