[
  {
    "source": "Cointelegraph",
    "date": "2024-01-27T02:17:03.000Z",
    "title": " Bitcoin ETFs are wrapped in ‘thin layer’ of indirect regulations — CFTC chair ",
    "url": "https://cointelegraph.com/news/bitcoin-etfs-indirect-regulations-cftc-chair",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZDQ1ZTNiNjMtMmZjZC00ZWFjLTgyZDYtMjU1NTY3MDMyZjJkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>CFTC chair Rostin Behnam declared that regulating the cash market for digital assets has \"never been more critical,\" following the approval of spot Bitcoin ETFs.</p>\n                    <p><p>The chair of the Commodities Futures and Trading Commission (CFTC), Rostin Behnam, believes there is a risk of retail and institutional investors misinterpreting the recent approval of spot Bitcoin exchange-traded funds (ETFs) as firm regulations in place for Bitcoin and other cryptocurrencies in general.</p><p>In a keynote <a href=\"https://www.cftc.gov/PressRoom/SpeechesTestimony/opabehnam41\" target=\"_blank\" rel=\"noopener nofollow\">speech</a> on Jan. 26, Behnam clarified there is a potential for investors to misconstrue the legal certainty established for spot Bitcoin ETFs by the United States Securities and Exchange Commission's (SEC) recent decision to approve 11 applications on January 10.</p><p>While the approval now allows investors to expose themselves to Bitcoin without directly holding the asset itself, supervised by an SEC-regulated stock exchange, he argued there is no regulatory oversight for the cash market of digital assets, such as a crypto exchange.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-etfs-indirect-regulations-cftc-chair\">Read more</a></p></p>\n                \n            "
  }
]