[
  {
    "source": "CoinDesk",
    "date": "2023-06-01T17:50:53.000Z",
    "title": "Bitcoin Miners Gain Support From Texas With Two Bills Passed, One Halted",
    "url": "https://www.coindesk.com/policy/2023/06/01/bitcoin-miners-gain-support-from-texas-with-two-bills-passed-one-halted/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Two bills that will seem to embrace mining have been sent to the governor, whereas one that would adversely affect miners was stopped at committee."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T17:46:12.000Z",
    "title": "Hong Kong-based First Digital Group launches redeemable USD-backed stablecoin",
    "url": "https://cointelegraph.com/news/hong-kong-based-first-digital-group-launches-redeemable-usd-backed-stablecoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/dee2cab6-1988-40f9-9ca2-942254048ed0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Hong Kong trust company says the new FDUSD combines the stability of the U.S. dollar with the reliability of Asian regulation. </p>\n                    <p><p>First Digital Group, a Hong Kong-based qualified custodian and trust company, announced the launch of its First Digital USD (FDUSD) United States dollar-pegged stablecoin on June 1. The new stablecoin is programmable and described as being capable of executing contracts, escrow services and insurance without intermediaries. It will operate on the BNB Smart Chain.</p><p>FDUSD is being issued by First Digital Labs, a subsidiary of digital asset custodian First Digital Trust, which is regulated under the Hong Kong Trustee Ordinance. Under the law, FDUSD will be backed one-for-one with U.S. dollar reserves or highly liquid, high-quality assets held in regulated Asian financial institutions that cannot be commingled with other First Digital assets. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">First Digital, a Hong Kong licensed trust company, launches a new USD pegged stablecoin (FDUSD), on <a href=\"https://twitter.com/hashtag/BNB?src=hash&amp;ref_src=twsrc%5Etfw\">#BNB</a> Smart Chain.</p>&mdash; CZ  Binance (@cz_binance) <a href=\"https://twitter.com/cz_binance/status/1664135832863752199?ref_src=twsrc%5Etfw\">June 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>First Digital CEO Vincent Chok <a href=\"https://www.prnewswire.com/news-releases/first-digital-group-is-propelling-digital-asset-innovation-with-the-launch-of-its-new-stablecoin-fdusd-bridging-stability-with-innovation-to-revolutionise-the-existing-global-financial-landscape-301839437.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a statement: </p><blockquote>“First Digital is fully committed to regulatory compliance to set a new standard for legitimacy in the space.\"</blockquote><p>In addition, the company promised “to ensure full compliance with current and future applicable laws and regulations,” and “participate in the shaping of their evolution, including the shaping of any regulatory regimes that FDUSD and/or First Digital may fall under in the foreseeable future.”</p><p>The stablecoin <a href=\"https://cointelegraph.com/news/do-you-have-the-right-to-redeem-your-stablecoin\">will be redeemable</a> for U.S. dollars.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/first-digital-trust-announces-2-15m-funding-for-asian-digital-payments-service\">First Digital Trust announces $2.15M funding for Asian digital payments service</a></em></strong></p><p>The launch of the FDUSD <a href=\"https://cointelegraph.com/news/hong-kong-crypto-exchanges-to-serve-retail-in-june\">coincides with the first day</a> of retail cryptocurrency trading in Hong Kong under new regulatory guidelines that <a href=\"https://cointelegraph.com/news/crypto-firms-hong-kong-licenses-june-retail-opening\">have led to a rapid uptick</a> of crypto-related activity in the administrative region, with several companies applying to open trading platforms.</p><p>In addition, the Hong Kong Monetary Authority <a href=\"https://cointelegraph.com/magazine/ripple-visa-hong-kong-cbdc-pilot-huobi-token-allegations-asia-express/\">launched an e-HKD central bank digital currency</a> pilot project in May with the participation of 16 companies from the financial payment and technology sectors.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\">Unstablecoins: Depegging, bank runs and other risks loom</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-01T17:35:23.000Z",
    "title": "Bitcoin investors seek downside protection amid rising macro uncertainties",
    "url": "https://cryptoslate.com/insights/bitcoin-investors-seek-downside-protection-amid-rising-macro-uncertainties/",
    "description": "<p>In this Alpha insight, we uncover the growing demand for downside protection on Bitcoin, as Swissblock reveals some intriguing data. With the put-to-call ratio signaling a shift in investor sentiment, we explore the macro factors sparking this uncertainty. From the debt ceiling standoff to bearish China data and looming rate hikes, something significant is driving these changes... Learn what experts believe will happen next by subscribing to Alpha.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-investors-seek-downside-protection-amid-rising-macro-uncertainties/\">Bitcoin investors seek downside protection amid rising macro uncertainties</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-01T18:00:00.000Z",
    "title": "IoTeX DAO votes in proposal to share gas fees with dApps and bolster its ecosystem",
    "url": "https://cryptodaily.co.uk/2023/06/iotex-dao-votes-in-proposal-to-share-gas-fees-with-dapps-and-bolster-its-ecosystem",
    "description": "<p>In the rapidly evolving Web3 space, the success of any blockchain platform hinges on the creativity and ingenuity of its dApp creators. Recognizing developers' pivotal role in driving adoption, the IoTeX community has voted massively in favor of IoTeX's Improvement Proposal 15 (IIP-15) for Sharing of Gas-Fee with dApps (SGD).</p>\n<p>With its groundbreaking IIP-15, IoTeX aims to unlock a new era of high-level innovation, engagement, and sustainable growth. By sharing a portion of transaction gas fees with dApp developers, IoTeX sets the stage for an ecosystem where creativity thrives, users are captivated, and developers are incentivized like never before.</p>\n<p>The IoTeX community has passed the groundbreaking IIP-15 with 98.5% in favor, and 1.5% against the proposal. A total of 224 wallets participated with nearly 157.4 million IOTX staked. The IoTeX Foundation will distribute 224 Soulbound Tokens (SBTs) to reward those who participated in the IIP-15 DAO governance vote.</p>\n<p>Becoming the DePIN leader</p>\n\n<p>&ldquo;The significance of IIP-15 cannot be overstated,&rdquo; said IoTeX CEO and Co-Founder Raullen Chai. &ldquo;For IoTeX, it represents another step toward becoming the leader within the burgeoning Decentralized Physical Infrastructure Networks (DePIN) space. It also represents a paradigm shift in how blockchain platforms value and compensate their development community.&rdquo;</p>\n<p>&ldquo;By proposing the revenue-sharing mechanism through SGD, IoTeX opens the doors for community members to actively participate in shaping the platform's future and fostering a vibrant ecosystem,&rdquo; Chai said.</p>\n\n<p>Striking a fair balance</p>\n<p>As users interact with dApps on the IoTeX blockchain, a portion of the transaction gas fees is automatically accrued in the SGD treasury. The proposal recommends that 30% of the gas fees be reallocated to the SGD treasury to strike a fair balance and incentivize sustainable growth. At the same time, the remaining portion continues to contribute to the Proof-of-Stake (PoS) rewarding pool. The actual ratio may be subject to adjustment through governance voting.</p>\n<p>DApp owners can withdraw their accumulated revenue by initiating a claim action. The SGD treasury verifies the eligibility criteria, including transaction volume and time deployed on the chain, through the SGD registry.</p>\n<p>Once the criteria are met, the treasury issues the corresponding rewards. To maintain the integrity and quality of the ecosystem, the IoTeX Foundation implements a review process, approving dApps based on their performance and adherence to guidelines.</p>\n<p>Transparency and efficiency</p>\n<p>The SGD initiative comprises two main components to ensure transparency and efficient management: the SGD Treasury and the SGD Registry. The treasury module handles gas fee distribution, accounting, and the SGD rewards claims process.</p>\n<p>The registry consists of a system contract and an indexer. dApp owners utilize the system contract to register their dApp contracts and reward addresses, while the indexer keeps track of SGD contract addresses, owners, and the number of contract calls.</p>\n<p>Implementing this fee-sharing model requires careful consideration to prevent potential abuses. To address this concern, the IoTeX Foundation has set eligibility criteria to qualify for revenue sharing.</p>\n<p>DApps must have completed at least 100,000 IoTeX Layer 1 blockchain transactions, have been deployed and running smoothly for at least one month, and receive approval from the IoTeX Foundation.</p>\n<p>The Foundation reserves the right to disapprove dApps involved in spam transactions or illegitimate activities, thereby safeguarding the integrity of the SGD program and protecting users' interests.</p>\n<p>Driving innovation</p>\n<p>Implementing the SGD feature will be part of an upcoming hard fork, ensuring backward compatibility with existing applications and infrastructure. With this forward-thinking proposal, IoTeX joins a growing movement for blockchain platforms to actively reward their dApp creators, driving a virtuous cycle of innovation, user engagement, and overall ecosystem growth.</p>\n<p>As IoTeX continues to expand its reach and influence, IIP-15 solidifies its position as a trailblazer in blockchain technology. Through this revenue-sharing model, IoTeX sets the stage for a new dApp development era that rewards creativity, nurtures innovation, and fosters a new and exciting design space for Web3 applications.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>\n\n<p>&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-01T17:11:25.000Z",
    "title": "Avalanche reaches 1 Million Monthly Active Users",
    "url": "https://cryptodaily.co.uk/2023/06/avalanche-reaches-1-million-monthly-active-users",
    "description": "<p>In an impressive milestone for the Avalanche (AVAX) ecosystem, the platform has successfully surpassed the coveted one million monthly active users (MAUs) mark.&nbsp;</p>\n<p>Avalanche's achievement not only solidifies its position as a major player in the rapidly evolving crypto landscape but also signifies the growing popularity and adoption of its innovative blockchain technology.</p>\nAvalanche's Meteoric Rise\n<p>Since its arrival on the scene, Avalanche has revolutionised the blockchain industry by addressing the scalability and speed limitations that have plagued other platforms. With a strong emphasis on decentralisation, scaling, and incredibly fast finality, Avalanche has managed to capture the attention of users and developers alike.</p>\nScalability\n<p>One of the primary factors propelling Avalanche's success is its ability to handle a massive number of transactions per second (TPS). By utilising a unique consensus protocol called Avalanche Consensus, the platform achieves impressive TPS rates, ensuring smooth and efficient operation even during peak network activity.</p>\nInteroperability&nbsp;\n<p>Avalanche's interoperability capabilities have played a vital role in its growth. The platform enables seamless communication and asset transfers between different blockchains, unlocking cross-chain liquidity and expanding its potential use cases. This flexibility has garnered significant interest from developers and users looking for a comprehensive blockchain solution.</p>\nUser-Friendly&nbsp;\n<p>Avalanche has prioritised user experience, making it accessible and intuitive for both crypto veterans and newcomers. The platform's user-friendly interfaces, robust development tools, and extensive documentation have lowered entry barriers, attracting a diverse user base and driving widespread adoption. However, a big issue still to be solved is the high cost of becoming a validator. Until this cost is lowered dramatically, smaller projects are being priced out.&nbsp;</p>\nThe Path Ahead\n<p>With Avalanche crossing the one million MAU milestone, the platform's trajectory looks promising. Avalanche continues to foster innovation through ongoing partnerships, collaborations, and development initiatives. If the platform can resolve its issues of high costs if will climb to the next million users in a far shorter time scale.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-01T17:30:36.000Z",
    "title": "Billionaire Investor Bill Ackman Insists JPMorgan Boss Jamie Dimon Should Run in the 2024 US Presidential Race",
    "url": "https://news.bitcoin.com/billionaire-investor-bill-ackman-insists-jpmorgan-boss-jamie-dimon-should-run-in-the-2024-us-presidential-race/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/dimon-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Billionaire Investor Bill Ackman Insists JPMorgan Boss Jamie Dimon Should Run in the 2024 US Presidential Race\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/dimon-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/dimon-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/dimon-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/dimon-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/dimon-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/dimon-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/dimon.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Billionaire investor and Pershing Square Capital Management CEO, Bill Ackman, has asserted that JPMorgan Chase&#8217;s chief executive, Jamie Dimon, should enter the 2024 United States presidential race. Ackman claims that the current president Joe Biden is “extremely weak and in cognitive decline,” and argues that Dimon could defeat both Biden and Trump in the general [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T18:03:02.000Z",
    "title": "How To Respond Confidently to A Wells Notice: Implications and Course of Action",
    "url": "https://www.cryptopolitan.com/response-to-a-wells-notice-implications/",
    "description": "In the dynamic and fast-paced world of cryptocurrencies, adhering to regulatory compliance is of paramount importance. A key element in this compliance landscape is the &#8220;Wells Notice,&#8221; a critical component of the U.S. Securities and Exchange Commission&#8217;s (SEC) enforcement process. As a participant in the cryptocurrency market, understanding the concept of a Wells Notice, its ... <a title=\"How To Respond Confidently to A Wells Notice: Implications and Course of Action\" class=\"read-more\" href=\"https://www.cryptopolitan.com/response-to-a-wells-notice-implications/\" aria-label=\"More on How To Respond Confidently to A Wells Notice: Implications and Course of Action\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T18:02:56.000Z",
    "title": "Gate.io addresses insolvency rumors amid multichain issues",
    "url": "https://www.cryptopolitan.com/gate-io-insolvency-rumors-multichain-issues/",
    "description": "Gate.io, a prominent cryptocurrency exchange, has responded to rumors circulating about its alleged insolvency, emphasizing that its operations are functioning well. The company also revealed its intention to establish a related trading platform named Gate.HK in Hong Kong. Gate.io clears insolvency rumors Speculation regarding Gate.io’s financial stability arose in the wake of events associated with ... <a title=\"Gate.io addresses insolvency rumors amid multichain issues\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gate-io-insolvency-rumors-multichain-issues/\" aria-label=\"More on Gate.io addresses insolvency rumors amid multichain issues\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T17:58:24.000Z",
    "title": "The easiest way to earn CAKE, by far!",
    "url": "https://www.cryptopolitan.com/the-easiest-way-to-earn-cake-by-far/",
    "description": "Pancake (CAKE)&#160; has been made more accessible to investors in the following ways. The entity has introduced Pancake Protectors. Pancake Protectors, powered by the PvP GameFi protocol Mobox, immerses players in thrilling missions where the strategic placement of hero towers is vital.&#160; The addition of CAKE, PancakeSwap&#8217;s native token, distinguishes this edition. This integration enables ... <a title=\"The easiest way to earn CAKE, by far!\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-easiest-way-to-earn-cake-by-far/\" aria-label=\"More on The easiest way to earn CAKE, by far!\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T17:47:18.000Z",
    "title": "How Does Quantum Computing Impact Crypto Mining In a Distinctively More Powerful Manner",
    "url": "https://www.cryptopolitan.com/quantum-computing-impact-crypto-mining/",
    "description": "In an era underscored by relentless technological evolution, our digital society sits at the precipice of two pioneering advancements: quantum computing and cryptocurrency mining. These emergent technologies, while distinct, share a unique interplay with potential ramifications that could redefine the fabric of our digital economy. This guide will delve into the intricate lattice of quantum ... <a title=\"How Does Quantum Computing Impact Crypto Mining In a Distinctively More Powerful Manner\" class=\"read-more\" href=\"https://www.cryptopolitan.com/quantum-computing-impact-crypto-mining/\" aria-label=\"More on How Does Quantum Computing Impact Crypto Mining In a Distinctively More Powerful Manner\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T17:38:08.000Z",
    "title": "What Is The Marshall Islands DAO Act and Is It Legit?",
    "url": "https://www.cryptopolitan.com/what-is-the-marshall-islands-dao-act/",
    "description": "The digital era, characterized by technological advancements and the digitalization of various economic sectors, has seen the birth and growth of a unique type of organization known as Decentralized Autonomous Organizations (DAOs). This transformation has particularly gained momentum with the blockchain revolution, spawning novel forms of governance and organization. This article aims to delve into ... <a title=\"What Is The Marshall Islands DAO Act and Is It Legit?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/what-is-the-marshall-islands-dao-act/\" aria-label=\"More on What Is The Marshall Islands DAO Act and Is It Legit?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T17:30:58.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the runoff on the FTX cryptocurrency exchange and the failed attempt of a takeover by Binance. The entire fiasco started after Binance’s CZ expressed doubts about the integrity of Almeda research, a trading affiliate of FTX. The tweet ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T17:30:11.000Z",
    "title": "30 Questions and Answers About Layer-2 Blockchain",
    "url": "https://www.cryptopolitan.com/30-questions-and-answers-layer-2-blockchain/",
    "description": "Blockchain technology, the foundation for cryptocurrencies like Bitcoin and Ethereum, has been heralded for its potential to revolutionize industries from finance to supply chain management. As its applications have expanded, so have the challenges, particularly around scalability, transaction fees, and speed. Layer-2 solutions represent a vital evolution in blockchain technology, enabling it to meet growing ... <a title=\"30 Questions and Answers About Layer-2 Blockchain\" class=\"read-more\" href=\"https://www.cryptopolitan.com/30-questions-and-answers-layer-2-blockchain/\" aria-label=\"More on 30 Questions and Answers About Layer-2 Blockchain\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T17:27:44.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos has been among the hardest hit in 2022 and any sort of risk-on rally taking place in the broader crypto sector will show a more impressive upward trajectory for Cronos in the near term. Non-profit making companies are expected to grow revenue every year, and at a good clip. That&#8217;s ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T17:25:06.000Z",
    "title": "Olive-oil manufacturer makes history with on-chain bond issuance on Obligate",
    "url": "https://www.cryptopolitan.com/olive-oil-manufacturer-makes-history-with-on-chain-bond-issuance-on-obligate/",
    "description": "Lamar Olive Oil, a French company in the sustainable-agriculture industry, has achieved a significant milestone by issuing an on-chain bond using Obligate, a decentralized finance (DeFi) platform. This groundbreaking move marks the first bond issuance denominated in Membrane Finance&#8217;s EUROe, the only EU-regulated crypto stablecoin. Credora, Obligate&#8217;s credit rating partner, conducted the credit evaluation and ... <a title=\"Olive-oil manufacturer makes history with on-chain bond issuance on Obligate\" class=\"read-more\" href=\"https://www.cryptopolitan.com/olive-oil-manufacturer-makes-history-with-on-chain-bond-issuance-on-obligate/\" aria-label=\"More on Olive-oil manufacturer makes history with on-chain bond issuance on Obligate\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T17:24:06.000Z",
    "title": "How does Canada Compare With China in the Interplay Between Cybercrime and Cryptocurrency?",
    "url": "https://www.cryptopolitan.com/canada-vs-china-cybercrime-cryptocurrency/",
    "description": "Cybercrime has emerged as a formidable challenge in the digital age, and its intricate connection with cryptocurrencies has added a layer of complexity to the global security landscape. This Cryptopolitan guide dissects the realms of cybercrime and cryptocurrency in two prominent nations: Canada and China. Through a meticulous examination of their cybercrime landscapes, cryptocurrency adoption ... <a title=\"How does Canada Compare With China in the Interplay Between Cybercrime and Cryptocurrency?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/canada-vs-china-cybercrime-cryptocurrency/\" aria-label=\"More on How does Canada Compare With China in the Interplay Between Cybercrime and Cryptocurrency?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-01T18:02:11.000Z",
    "title": "PEPE in the green despite market-wide dips",
    "url": "https://crypto.news/pepe-in-the-green-despite-market-wide-dips/",
    "description": "While the cryptocurrency market experiences turbulence and widespread dips, meme coin,PEPE stands out as one of the price gainers in the last 24 hours."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-01T17:53:35.000Z",
    "title": "EU study proposes default security status for crypto assets, legal recognition for DeFi",
    "url": "https://crypto.news/eu-study-proposes-default-security-status-for-crypto-assets-legal-recognition-for-defi/",
    "description": "A European Parliament-commissioned study proposes all crypto assets be treated as securities by default and calls for decentralized finance (DeFi) organizations to receive legal status."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T18:00:42.000Z",
    "title": "Will Shiba Inu Eliminate More Zeros in June with Shibarium Launch, Creating More Millionaires? Here’s What’s Next for SHIB",
    "url": "https://www.crypto-news-flash.com/will-shiba-inu-eliminate-more-zeros-in-june-with-shibarium-launch-creating-more-millionaires-heres-whats-next-for-shib/?utm_source=rss&utm_medium=rss&utm_campaign=will-shiba-inu-eliminate-more-zeros-in-june-with-shibarium-launch-creating-more-millionaires-heres-whats-next-for-shib",
    "description": "<p>Shibarium mainnet launch could be announced in either Q2 or Q3 according to Lucie. However, this is not guaranteed as the launch may be delayed if any fault is found. The long-awaited mainnet launch of Shibarium is fast approaching as the SHIB army is expecting a bull run. According to LucieSHIB, content marketing specialist at Shiba [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/will-shiba-inu-eliminate-more-zeros-in-june-with-shibarium-launch-creating-more-millionaires-heres-whats-next-for-shib/\">Will Shiba Inu Eliminate More Zeros in June with Shibarium Launch, Creating More Millionaires? Here&#8217;s What&#8217;s Next for SHIB</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T17:56:24.000Z",
    "title": "China to lift crypto ban potentially, Tradecurve price skyrockets",
    "url": "https://www.crypto-news-flash.com/china-to-lift-crypto-ban-potentially-tradecurve-price-skyrockets/?utm_source=rss&utm_medium=rss&utm_campaign=china-to-lift-crypto-ban-potentially-tradecurve-price-skyrockets",
    "description": "<p>China has had a complicated relationship with cryptocurrencies in the past, as it has concurrently banned them and has impacted the crypto market in a negative way. The recent signs are suggesting that China&#8217;s hardline stance on cryptocurrencies might shift, and the ban might be lifted.  If the ban does indeed get lifted, cryptocurrencies in [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/china-to-lift-crypto-ban-potentially-tradecurve-price-skyrockets/\">China to lift crypto ban potentially, Tradecurve price skyrockets</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-01T18:05:23.000Z",
    "title": "Billionaire Mike Novogratz Says One Massive Catalyst Will Send Crypto Off to the Races",
    "url": "https://dailyhodl.com/2023/06/01/billionaire-mike-novogratz-says-one-massive-catalyst-will-send-crypto-off-to-the-races/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/12/altcoin-mirroring-patterns.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/12/altcoin-mirroring-patterns.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/12/altcoin-mirroring-patterns.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/12/altcoin-mirroring-patterns.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/12/altcoin-mirroring-patterns.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/12/altcoin-mirroring-patterns.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/12/altcoin-mirroring-patterns.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Galaxy Digital CEO and founder Mike Novogratz believes that one catalyst could send digital assets soaring within months. In a new interview with CNBC, the billionaire predicts that the Federal Reserve will start cutting interest rates in October, after having raised them since last March to lower inflation. Novogratz says the Fed’s rate-cutting will likely [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/01/billionaire-mike-novogratz-says-one-massive-catalyst-will-send-crypto-off-to-the-races/\">Billionaire Mike Novogratz Says One Massive Catalyst Will Send Crypto Off to the Races</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]