[
  {
    "source": "CoinDesk",
    "date": "2023-08-04T20:31:20.000Z",
    "title": "America’s Credit Rating Helps Make Case for Bitcoin",
    "url": "https://www.coindesk.com/consensus-magazine/2023/08/04/americas-credit-rating-helps-make-case-for-bitcoin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Fitch’s downgrade of U.S. debt this week is a warning to American policymakers and r underscores why Bitcoin and other open monetary systems matter."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-04T20:31:45.000Z",
    "title": "Mech Shooter 'MetalCore' Is 'Titanfall' Meets 'Destiny' With an NFT Twist",
    "url": "https://decrypt.co/151380/mech-shooter-metalcore-titanfall-meets-destiny-nft-twist",
    "description": "PREVIEW: Ever wanted to own a mech? Immutable zkEVM game MetalCore will let you do just that, and the early playtest shows serious promise."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T20:30:00.000Z",
    "title": "Curve-Vyper exploit: The whole story so far",
    "url": "https://cointelegraph.com/news/curve-vyper-exploit-whole-story-so-far",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/14d92d7e-3ac6-4899-8215-10f1abe36651.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Curve Finance pools were targeted by hackers in a reentrancy attack on July 30, spreading shockwaves across the DeFi ecosystem. Cointelegraph compiled the week's events.</p>\n                    <p><p>The decentralized finance (DeFi) ecosystem has experienced a challenging week after a seismic security incident led to over $61 million being stolen from Curve Finance's pools, leaving broader contagious risks facing several protocols.</p><p>This attack exposed vulnerabilities across DeFi projects and sparked efforts to recover stolen funds over the past few days. </p><p>As the community navigates the aftermath of this exploit, Cointelegraph compiled the week's events, presenting a timeline of what happened since the hack on July 30. </p><h3>The Hack: Curve Finance pools are exploited for over $61 million due to reentrancy vulnerability</h3><p>Several stable pools on Curve Finance using the Vyper programming language were exploited on July 30, with losses reaching over $61 million (total losses were <a href=\"https://cointelegraph.com/news/curve-finance-pools-exploited-over-24-reentrancy-vulnerability\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/curve-finance-pools-exploited-over-24-reentrancy-vulnerability/amp\">initially estimated at $47 million</a>). The vulnerability was found on Vyper's versions 0.2.15, 0.2.16 and 0.3.0.</p><p>Several DeFi projects were affected by the attack. Decentralized exchange Ellipsis reported that a small number of stable pools with BNB were exploited using an old Vyper compiler. Alchemix’s alETH-ETH also witnessed $13.6 million of outflows due to the attack, along with $11.4 million exploited on JPEGd’s pETH-ETH pool, and $1.6 million in Metronome’s sETH-ETH pool. Curve Finance CEO Michael Egorov also <a href=\"https://t.me/lobsters_chat/442667\" target=\"_blank\" rel=\"noopener nofollow\">confirmed</a> that 32 million Curve DAO (CRV) tokens worth over $22 million had been drained from the swap pool.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/077f7115-d011-473f-aa23-f7cc896ae936.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Curve's Michael Egorov confirmed the theft of 32 million Curve DAO tokens on July 30. Source: Telegram/LobsterDAO. </em></figcaption></figure><p>The BNB Smart Chain <a href=\"https://cointelegraph.com/news/vyper-copycat-exploit-on-bsc-bnb-smart-chain-curve\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/vyper-copycat-exploit-on-bsc-bnb-smart-chain-curve/amp\">was also a victim of copycat attacks</a> due to the same vulnerability, with around $73,000 worth of cryptocurrencies on BSC across three exploits being stolen.</p><p>Since news of the exploit broke, white hat and black hat hackers have been duking it out on-chain attempting to disrupt each other's exploit attempts or efforts to recover funds. </p><p>Preliminary investigations found that some versions of the Vyper compiler did not correctly implement the reentrancy guard, which prevents multiple functions from being executed at the same time by locking a contract. </p><h3>The Impact: Vyper vulnerability exposes DeFi ecosystem to stress tests; CRV price plummets</h3><p>The security incident <a href=\"https://cointelegraph.com/news/vyper-vulnerability-exposes-defi-ecosystem-stress-tests\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/vyper-vulnerability-exposes-defi-ecosystem-stress-tests/amp\">exposed DeFi protocols to a stress test </a>in the following days, raising concerns about the impact of the exploit on the crypto ecosystem — in particular, because the vulnerability could place all pools with <a href=\"https://cointelegraph.com/news/what-is-wrapped-ethereum-weth-and-how-does-it-work\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/what-is-wrapped-ethereum-weth-and-how-does-it-work/amp\">wrapped Ether (WETH)</a> at risk of attack.</p><p>Vyper is a contract programming language designed for the Ethereum Virtual Machine (EVM). It is considered one of the most widely used Web3 programming languages, meaning the bug in three of its versions could threaten several other protocols.</p><p>The exploit also <a href=\"https://cointelegraph.com/news/ethereum-million-dollar-mev-block-reward-amid-curve-finance-exploit\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ethereum-million-dollar-mev-block-reward-amid-curve-finance-exploit/amp\">led to one of the largest ever</a> maximal extractable value (MEV) reward blocks of 584.05 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). According to Ethereum core developer “eric.eth,” the bot noticed an incoming hack in the mempool, reproduced the tx [transaction] and frontrunned it. “To do so they pay the block producer a lot of ETH to be front of the line,” he explained. MEV bots can see pending liquidation transactions and front-run them to buy the liquidated assets first at a discount.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today has produced some of the largest MEV reward blocks in Ethereum’s history. <br><br>Slot 6,992,273: 584 ETH<br>Slot 6,993,342: 345 ETH<br>Slot 6,992,050: 247 ETH<br>Slot 6,993,346: 51 ETH</p>— eric.eth (@econoar) <a href=\"https://twitter.com/econoar/status/1685778343697018881?ref_src=twsrc%5Etfw\">July 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Curve's CEO scurries to pay collateralized loans</h3><p>Threats elsewhere could also cause ripple effects across DeFi. Curve Finance founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2022/michael-egorov\">Michael Egorov</a> had around $100 million in loans backed by 47% of the circulating supply of the protocol's native token Curve DAO (CRV). </p><p>However, the CRV price dropped nearly 30% following the hack, falling to a low of $0.48 amid fears that Egorov's collateralized loans would be liquidated.</p><p>To reduce his debt position, Egorov <a href=\"https://cointelegraph.com/news/curve-liquidation-risk-poses-systemic-threat-to-defi-even-as-founder-scurries-to-repay-loans\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/curve-liquidation-risk-poses-systemic-threat-to-defi-even-as-founder-scurries-to-repay-loans/amp\">sold 39.25 million CRV tokens</a> to several notable DeFi investors, including Justin Sun, Machi Big Brother and DWF Labs, for a total of $15.8 million. The buyers purchased CRV at $0.40 per token, a 25% discount to the market price at the time. In addition, he made partial payments on two loans on Aave and Frax Finance.</p><h3>CEX price feed prevents Curve price from collapsing</h3><p>The CRV token price collapsed on the DeFi market due to the significant draining of several pools; however, it was eventually saved by the centralized exchange price feed. The CRV price hit $0.086 on decentralized exchanges but traded at $0.60 on centralized exchanges (CEXs), preventing the token’s price from collapsing to zero. </p><p>The ironic incident drew the attention of Binance CEO Changpeng Zhao, who chuckled at the fact that, in the end, it was a CEX price feed that saved the DeFi protocol.</p><p>Also reacting to an uncertain environment, Curve's native stablecoin, crvUSD, briefly <a href=\"https://cointelegraph.com/news/curve-crvusd-depegs-market-reacts-shock-events\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/curve-crvusd-depegs-market-reacts-shock-events/amp\">depegged on Aug. 3</a>. The algorithmic stablecoin fell by as much as 0.35% before regaining its peg to the United States dollar. Recently launched, crvUSD uses a mechanism for maintaining its peg called the PegKeeper algorithm, which ensures that the crvUSD value is properly backed by collateral while balancing supply and demand.</p><h3>DeFi community: Ethical hacker retrieves $5.4M for Curve Finance amid exploit</h3><p>During the crisis, the DeFi community stood by Curve Finance. On July 31, a white hat hacker <a href=\"https://cointelegraph.com/news/white-hat-returns-5-million-curve-finance-hack\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/white-hat-returns-5-million-curve-finance-hack/amp\">managed to retrieve around 2,879 Ether</a> worth around $5.4 million from an exploiter and returned it to Curve Finance. Hours later, another ethical hacker seized almost 3,000 ETH and returned them to Curve's deployer address.</p><p>Amid fears of liquidation surrounding Egorov's loans, Jun Du, the co-founder of Huobi, <a href=\"https://cointelegraph.com/news/curve-huobi-s-jun-du-acquires-10-million-crv-tokens-to-support-curve\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/curve-huobi-s-jun-du-acquires-10-million-crv-tokens-to-support-curve/amp\">purchased 10 million CRV</a> for $4 million from Curve's CEO. Additionally, Aave Chan founder Marc Zeller <a href=\"https://cointelegraph.com/news/curve-aave-chan-founder-proposes-buying-2-m-crv-from-curve-founder\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/curve-aave-chan-founder-proposes-buying-2-m-crv-from-curve-founder/amp\">proposed the Aave Treasury buy $2 million</a> worth of CRV tokens from the protocol. According to the proposal, the acquisition would signal that DeFi players support the health of the ecosystem. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">What about crvUSD? How does its price react to shock events, does it depeg?<br><br>Events of recent days felt similar to SVB/USDC situation in some sense. However, crvUSD had just a 0.35% dip, and currently 0.1% from the peg <a href=\"https://t.co/HaMfbkiFSR\">pic.twitter.com/HaMfbkiFSR</a></p>— Curve Finance (@CurveFinance) <a href=\"https://twitter.com/CurveFinance/status/1687053161863811073?ref_src=twsrc%5Etfw\">August 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Cross-chain lending platform Abracadabra Money also <a href=\"https://cointelegraph.com/news/abracadabra-hike-loan-interest-rate-by-200-curve-risk\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/abracadabra-hike-loan-interest-rate-by-200-curve-risk/amp\">proposed increasing the interest rate</a> on its outstanding loans to manage risks associated with its exposure to CRV. </p><h3>The return of funds: Curve, Metronome and Alchemix offering 10% bug bounty; hacker takes it</h3><p>On Aug. 3, Curve, Metronome and Alchemix jointly announced an initiative to recover stolen funds from the recent exploits of Curve’s pools. The protocols offered a 10% bounty of the seized funds as a reward, urging those responsible for the exploit to step forward and return the remaining 90%, which would bring the bounty close to $7 million.</p><p>The offer came with a guarantee of no further legal actions or involvement of law enforcement. “We want to resolve this in a civilized manner,\" the protocols wrote to the hacker.</p><p>In less than 24 hours, on Aug. 4, the original attacker for the multi-million-dollar exploit apparently accepted the bounty offer and began returning funds stolen a few days earlier. They sent back 4,820.55 Alchemix ETH (alETH), worth approximately $8,889,118, to the Alchemix Finance team, as well as 1 ETH, approximately $1,844, to the Curve Finance team. </p><p>The attacker also posted a message that seems to have been directed at the Alchemix and Curve teams, claiming they would return the funds, but only because they didn’t want to “ruin” the projects involved and not because the attacker was caught.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/585b8792-82d7-4913-857b-1b4ae8deab3b.png\"><figcaption style=\"text-align: center;\"><em>Message sent by the exploiter to the protocols on Aug. 4. Source: Etherscan.</em></figcaption></figure><p>A total of $8.9 million worth of cryptocurrency has been returned at the time of writing, equal to roughly 15% of the total amount drained. </p><p class=\"post-content__disclaimer\"><em>Additional reporting by Amaka Nwaokocha, Ezra Reguerra, Martin Young, Nivesh Rustgi, Prashant Jha, Tom Blackstone, and Zhiyuan Sun.</em></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T20:30:00.000Z",
    "title": "Coinbase earnings show the company is now much more than just an exchange",
    "url": "https://cointelegraph.com/news/coinbase-earnings-show-the-company-is-now-much-more-than-just-an-exchange",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/655c2a25-f187-4b7a-9e88-4602cd95fa9b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Coinbase earnings report shows that services and subscriptions are the exchanges’ core revenue streams. Is this a positive or a negative? </p>\n                    <p><p>Coinbase, a leading U.S. cryptocurrency exchange, shared its 2Q results on August 3. Despite showing a net loss, some positives emerged, like a 13% cut in operating expenses from the last quarter and a 3% boost in its cash reserves to $5.5 billion. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/76848f7d-ea3b-4047-af21-c852a5e8fe69.png\"  /><figcaption style=\"text-align: center;\"><em>Coinbase key financial metrics, USD million. Source: Coinbase</em></figcaption></figure><p>However, the exchange took a hit with a $97 million net loss, worse than its previous quarter, and saw a 32% drop in its adjusted EBITDA to $194 million in 2Q.</p><h2>Services and USDC stablecoin impact growth </h2><p>One downside was the 7% fall in subscription and service revenue from 1Q. The letter to shareholders revealed that a 28% decrease in the <a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a> stablecoin market cap partly caused this. Since <a href=\"https://cointelegraph.com/explained/what-is-usd-coin-usdc-fiat-backed-stablecoin-explained\">Coinbase holds a stake in Circle</a>, the USDC's issuer, they gain from the interest rate offered by the stablecoin reserves. </p><p>Additionally, customer fiat balances deposited at the exchange serve as another revenue source. But despite these, Coinbase's interest income fell by 16% from the last quarter to $201 million in 2Q.</p><p>Even so, the numbers suggest that Coinbase has successfully lessened its dependence on trading fees. Subscription and service revenues matched trading revenues in the first half of 2023, a shift more noticeable when you consider transaction costs consume about 15% of its revenues. This suggests that Coinbase has transitioned from a trading firm to a service broker, prioritizing recurring revenues.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/45bbede7-4495-4293-8d1f-536ce9fa759c.png\"  /><figcaption style=\"text-align: center;\"><em>Coinbase shares, USD (blue, right) vs. Crypto total cap, USD (orange left). Source: TradingView</em></figcaption></figure><p>Looking at Coinbase's (COIN) share price, there isn't a clear sign of this shift in focus throughout 2023. This suggests that either investors still firmly believe that trading fees will remain the key income driver for the company, or they simply haven't been crunching the numbers as diligently as they should.</p><p>It's impossible to accurately predict what direction the cryptocurrency market will take in the next few years, but one can certainly assess Coinbase's potential to ramp up its services and subscription revenues, independent of how trading fees pan out. There are several notable events on the horizon that could significantly cut the exchange’s reliance on trading.</p><h2>Events on the horizon that could significantly cut the exchange’s reliance on trading</h2><p>The first is that Tether, the largest stablecoin by market cap, is eventually sued by DOJ and loses its banking partnerships. If the company issuing Tether were to be <a href=\"https://cointelegraph.com/news/tether-strikes-at-wsj-over-stale-allegations-of-faked-documents-for-bank-accounts\">sued by the Department of Justice (DOJ)</a> and consequently lose its banking partnerships, it could suffer a considerable loss in market cap. This scenario could create a massive opportunity for USDC to swoop in and fill the void. Because Coinbase enjoys revenue from Circle, the issuer of USDC, such a shakeup could potentially multiply Coinbase's service revenue by up to four times.</p><p>Second, Binance could be effectively shut down by regulators. Despite its stance as the reigning champion of cryptocurrency exchanges in terms of trading volume, Binance has been <a href=\"https://cointelegraph.com/news/us-doj-concerned-binance-run-prosecutors-fraud-charges\">attracting attention from regulators</a> worldwide, and not the good kind. If regulatory pressures were to effectively shut down Binance, this could pave the way for Coinbase to seize a substantial increase in market share. The knock-on effect would likely be a significant boost in service revenues for Coinbase.</p><p>Third, is the potential launch of Bitcoin spot ETFs in the United States because this could be a game-changer for Coinbase. The company has already entered into <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-filing-coinbase-surveillance-partner\">surveillance-sharing agreements with ETF issuers</a>, and it's ready to provide custody services. This new avenue would create an additional source of revenue for Coinbase.</p><p>Lastly, it's important to remember that while Coinbase's current focus is on cryptocurrency trading and custody services, the company has plans to diversify and expand its product offerings. For instance, it's planning to launch a margin trading platform and a cryptocurrency lending platform. These new products and services have the potential to generate significant revenue from services and subscriptions.</p><h2>The plan is being executed, but only time will tell if it is a winning strategy</h2><p>The crypto landscape's volatility clouds judgment on whether Coinbase's <a href=\"https://cointelegraph.com/news/coinbase-eyes-long-term-growth-of-subscription-revenue-nfts-still-a-focus\">pivot to non-trading revenues</a> is the right call. But signs are showing that Coinbase is agile and adaptive, slashing expenses and fortifying its cash chest. They've managed to match subscription revenues with trading revenues, a clear indicator of this adaptability.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinbase-to-file-order-seeking-dismissal-of-sec-lawsuit\"><strong><em>Coinbase to file order seeking dismissal of SEC lawsuit</em></strong></a></p><p>The billion-dollar question, however, is whether the investors will acknowledge and reward this shift in revenue generation. Currently, it seems that investors aren't paying adequate attention to Coinbase's strategic revamp but if some of the scenarios mentioned before come to life, they could be in for a pleasant surprise. It's a dynamic space, and this crypto giant seems to be playing its cards strategically.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T20:25:00.000Z",
    "title": "CRV exposure risk throws a curveball at the DeFi ecosystem: Finance Redefined",
    "url": "https://cointelegraph.com/news/crv-exposure-risk-throws-a-curveball-at-the-defi-ecosystem-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/2a97b282-8685-4233-adce-189c2d5e7fbf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Most DeFi tokens traded in the red on weekly charts due to the chaos caused by the Curve Finance exploit.</p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>The $47 million Curve Finance exploit on July 30 had a domino effect on the DeFi ecosystem, mainly due to the $100 million loan taken out by the Curve founder against the platform’s native Curve DAO (CRV) token. Several lending protocols have rushed in with new governance proposals to minimize CRV exposure risks as the token price fluctuates. On Aug. 3, the native stablecoin of the ecosystem crvUSD depegged due to market conditions. </p><p>Being considered the backbone of the DeFi ecosystem, the Curve exploit could trigger a severe crisis. </p><p>The Curve crisis also had a negative impact on the price of the DeFi tokens, with a majority trading in the red on the weekly charts.</p><h2>Curve Finance pools exploited by over $47 million due to reentrancy vulnerability</h2><p>Several stable pools on Curve Finance using Vyper were exploited on July 30, with losses reaching over $47 million. According to Vyper, its 0.2.15, 0.2.16 and 0.3.0 versions are vulnerable to malfunctioning reentrancy locks. </p><p>“The investigation is ongoing but any project relying on these versions should immediately reach out to us,” Vyper wrote on X (formerly Twitter). Based on an analysis of affected contracts by security firm Ancilia, 136 contracts used Vyper 0.2.15 with reentrant protection, 98 used Vyper 0.2.16 and 226 used Vyper 0.3.0.</p><p><a href=\"https://cointelegraph.com/news/curve-finance-pools-exploited-over-24-reentrancy-vulnerability\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/curve-finance-pools-exploited-over-24-reentrancy-vulnerability/amp\"><strong>Continue reading</strong></a></p><h2>CEX price feed prevents Curve price from collapsing amid $100 million vulnerability</h2><p>The CRV price collapsed on the DeFi market due to the significant draining of several pools; however, it was eventually saved by the centralized exchange price feed. CRV hit $0.086 on decentralized exchanges but traded at $0.60 on centralized exchanges (CEXs), preventing the token’s price from collapsing to zero.</p><p>Curve pools use Chainlink’s oracle system, which incorporates several price feeds, including centralized exchanges. If not for the CEX price feed, Curve Finance would have collapsed. This ironic incident drew the attention of Binance CEO Changpeng Zhao, who said that, in the end, it was a CEX price feed that saved the DeFi protocol.</p><p><a href=\"https://cointelegraph.com/news/cex-price-feed-curve-price-collapse-100m-vulnerability\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cex-price-feed-curve-price-collapse-100m-vulnerability/amp\"><strong>Continue reading</strong></a></p><h2>Curve Finance founder’s $100 million debt could trigger a DeFi implosion: Report</h2><p>While Curve Finance is still weathering the <a href=\"https://cointelegraph.com/news/curve-finance-pools-exploited-over-24-reentrancy-vulnerability\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/curve-finance-pools-exploited-over-24-reentrancy-vulnerability/amp\">aftermath of its recent $47 million hack</a>, another issue concerning holders of the DeFi protocol’s token has surfaced on the internet, sparking theories about how a massive dump could potentially happen. </p><p>On Aug. 1, crypto research firm Delphi Digital published an X thread detailing the loans taken out by Curve Finance founder Michael Egorov that are backed by 47% of the circulating supply of CRV. According to the research firm, Egorov holds around $100 million in loans across various lending protocols backed by 427.5 million CRV.</p><p><a href=\"https://cointelegraph.com/news/curve-finance-founder-100-million-debt-could-trigger-defi-implosion\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/curve-finance-founder-100-million-debt-could-trigger-defi-implosion/amp\"><strong>Continue reading</strong></a></p><h2>Curve’s crvUSD depegs as market reacts to shock events</h2><p>Curve Finance’s native stablecoin, crvUSD, briefly depegged on Aug. 3, reacting to an uncertain environment surrounding the protocol after its recent exploit. On the day, the stablecoin fell by as much as 0.35% before regaining its peg to the United States dollar.</p><p>Curve’s crvUSD uses a mechanism for maintaining its peg called the PegKeeper algorithm, which manages the interest rate and liquidation ratio based on the stablecoin supply and demand to maintain its value. In other words, it ensures that the crvUSD value is properly backed by collateral while balancing supply and demand.</p><p><a href=\"https://cointelegraph.com/news/curve-crvusd-depegs-market-reacts-shock-events\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/curve-crvusd-depegs-market-reacts-shock-events/amp\"><strong>Continue reading</strong></a></p><h2>DeFi market overview</h2><p>DeFi’s total market value saw a bearish decline in the past week. Data from <a href=\"https://pro.cointelegraph.com/users/sign_in?\">Cointelegraph Markets Pro</a> and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bad week, with most tokens trading in the red. The total value locked into DeFi protocols remained below $50 billion.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/a878dea7-b36c-46e0-9b0b-551687538d62.png\"></figure><p>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T20:13:35.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting the Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Coinbase's chief legal officer says the United States Securities and Exchange Commission has overstepped its boundaries in suing the exchange — this came shortly after the company revealed it would file an order to dismiss the SEC's lawsuit. Meanwhile, the Bank of Canada (BoC) reported a decline in the ownership of Bitcoin and cryptocurrencies in the country in 2022, as neither market conditions nor regulations sided in favor of Canadian crypto investors, according to a BoC study. </p><h2>Coinbase lawyers allege SEC \"violated due process\"</h2><p>The Securities and Exchange Commision has <a href=\"https://cointelegraph.com/news/sec-violated-due-process-coinbase-chief-legal-officer-motion-dismiss-lawsuit\">“violated due process”</a> in suing Coinbase, according to the exchange’s legal counsel. </p><p>In an Aug. 4 filing with a New York District Court, Coinbase said the SEC “abused its discretion, and abandoned its own earlier interpretations of securities laws” in going after the exchange. The legal team said the <a href=\"https://cointelegraph.com/learn/the-sec-vs-ripple-lawsuit-everything-you-need-to-know\">SEC v. Ripple</a> case demonstrates that the securities regulator overstepped its boundaries after a judge ruled that XRP largely doesn’t qualify as a security. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, <a href=\"https://twitter.com/coinbase?ref_src=twsrc%5Etfw\">@coinbase</a> filed our brief asking the Court to dismiss the SEC’s case against us. Our core argument is simple — we do not offer &quot;investment contracts&quot; as that term has been construed by decades of Supreme Court and other binding precedent. 1/3 <a href=\"https://t.co/r2EkDgkEuc\">https://t.co/r2EkDgkEuc</a></p>&mdash; paulgrewal.eth (@iampaulgrewal) <a href=\"https://twitter.com/iampaulgrewal/status/1687435194247303168?ref_src=twsrc%5Etfw\">August 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The SEC sued Coinbase on June 6, roughly three months after the crypto exchange received a Wells notice from the securities regulator. The SEC is also pursuing legal actions against Binance and Hex founder Richard Heart. </p><p>Crypto winter has been rough on Coinbase, but there are signs that the exchange is returning to stability. On Aug. 3, <a href=\"https://cointelegraph.com/news/coinbase-q2-profits-blackrock-custody-institution\">Coinbase reported</a> better-than-expected second-quarter revenues and a much smaller loss than previous quarters. </p><h3>Canadian crypto ownership declines amid tight regulations, falling prices</h3><p>The Bank of Canada (BoC) reported a decline in the ownership of Bitcoin and cryptocurrencies in the country in 2022, as neither market conditions nor regulations acted in favor of Canadian crypto investors, according to a BoC study published on July 26.</p><p>The study includes data from the annual Bitcoin Omnibus Survey conducted by the Canadian central bank, which showed a relapse from the massive crypto adoption witnessed in 2021.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/6f82d695-8541-4039-9db0-d0ed23207cae.png\"  /></figure><p>The above graph shows that Bitcoin ownership in Canada declined to 9% by August 2022. However, BTC adoption saw a slight uptick to 10% by the end of the year, and the drop in Bitcoin ownership does not imply that investors were spreading out their investments into other cryptocurrencies. The report read:</p><blockquote>“Investors did not appear to shift out of Bitcoin and into other cryptoassets, as we observe decreased ownership of altcoins.”</blockquote><p>The biggest motivation for Canadians interested in Bitcoin is as an investment, according to over one-third of the 4,996 respondents in the Bank of Canada’s 2022 survey.</p><p>Most Canadians acquired their crypto holdings through mobile and web apps. Bitcoin and crypto mining became the third-most-popular method of accumulating tokens for the second consecutive year.</p><h3>Coinbase to file order seeking dismissal of SEC lawsuit</h3><p>Coinbase is planning file an order <a href=\"https://cointelegraph.com/news/coinbase-to-file-order-seeking-dismissal-of-sec-lawsuit\">seeking dismissal of the lawsuit</a> by the Securities and Exchange Commission on Aug. 4.</p><p>On its Aug. 3 <a href=\"https://cointelegraph.com/news/coinbase-q2-profits-blackrock-custody-institution\">second-quarter 2023 earnings</a> call, Coinbase chief legal officer Paul Grewal expressed confidence the exchange would win the court case brought by the regulator.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">“For most people, Friday’s just the day before the weekend. But after this Friday, the neighborhood’ll never be the same.” <a href=\"https://t.co/0z0q8kZ9Tl\">https://t.co/0z0q8kZ9Tl</a></p>&mdash; paulgrewal.eth (@iampaulgrewal) <a href=\"https://twitter.com/iampaulgrewal/status/1687266550267670528?ref_src=twsrc%5Etfw\">August 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<blockquote>“Tomorrow [...] We will be moving the court for an order dismissing the case in its entirety.”</blockquote><p>The revelation comes as the exchnage posted $663 million in net revenue for the second quarter of 2023.</p><p>Interestingly, the exchange’s non-trading revenue surpassed its trading revenue in the quarter, with $335.4 million of net revenue coming from subscriptions and services compared to $327 million in transaction revenue.</p><p>Coinbase CEO Brian Armstrong said on an Aug. 3 earnings call that it was focused on the non-trading parts of the business over the next three to five years, naming scalability, regulatory clarity and driving crypto utility as focus areas.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-04T20:30:31.000Z",
    "title": "DOJ Demands Revocation of Bankman-Fried’s Bail, Wants Him Confined in Metropolitan Detention Center for Trial",
    "url": "https://news.bitcoin.com/doj-demands-revocation-of-bankman-frieds-bail-wants-him-confined-in-metropolitan-detention-center-for-trial/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbfjail-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"DOJ Demands Revocation of Bankman-Fried&#039;s Bail, Wants Him Confined in Metropolitan Detention Center for Trial\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbfjail-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbfjail-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbfjail-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbfjail-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbfjail-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbfjail-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbfjail.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />After accusations against the disgraced FTX co-founder, Sam Bankman-Fried, for allegedly meddling with a witness by providing the New York Times with excerpts from former Alameda Research CEO Caroline Ellison&#8217;s private journal, the legal team representing Bankman-Fried countered by insisting that he was merely exercising his First Amendment right to free speech. The U.S. government, [&#8230;]"
  }
]