[
  {
    "source": "Decrypt",
    "date": "2024-01-23T11:15:07.000Z",
    "title": "SEC: Fake Bitcoin ETF Announcement Caused by SIM Swap Attack",
    "url": "https://decrypt.co/213848/sec-fake-bitcoin-etf-announcement-caused-by-sim-swap-attack",
    "description": "Two-factor authentiation on the SEC's Twitter account had been disabled since July 2023, the regulator revealed."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-23T11:17:44.000Z",
    "title": " Trump ‘will never allow’ CBDC, gives ‘full credit’ to Vivek Ramaswamy ",
    "url": "https://cointelegraph.com/news/donald-trump-vivek-ramaswamy-never-allow-cbdc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNmE4ZjE5YzctODYwMi00YTgyLWIzZDMtOTJiZDc3ZjRmNmIyLkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The presidential candidates acknowledges the importance of the issue and credits Vivek Ramaswamy for bringing it to his attention. </p>\n                    <p><p>A former President of the United States and a current presidential candidate, Donald Trump, has once again mentioned the topic of central bank digital currencies (CBDCs), “giving full credit” to Vivek Ramaswamy, who has dropped out of the Republican presidential primaries a week ago. </p><p>During the rally in Laconia, New Hampshire, on Jan. 22, Trump <a href=\"https://www.youtube.com/watch?v=SRLBZZ6sVck\" target=\"_blank\" rel=\"noopener nofollow\">told</a> the audience that Ramaswamy, the only presidential candidate with a <a href=\"https://cointelegraph.com/news/vivek-ramaswamy-unveils-cryptocurrency-policy-platform-criticizing-mixer-sanctions\">crypto framework in his program</a>, asked him to raise once again the question of tackling the potential CBDC in the U.S. After a brief confession that he didn’t like Ramaswamy until he defeated him, Trump repeated his recent claim that he would never allow the CBDC. </p><p>The first time <a href=\"https://cointelegraph.com/news/donald-trump-former-president-vows-never-allow-cbdc-in-us\">Trump mentioned the CBDC</a> was during a campaign speech in Portsmouth, another city in New Hampshire, on Jan. 17. Back then, he said, “I will never allow the creation of a central bank digital currency,” explaining that such a currency would give a federal government “the absolute control” over citizens’ money. </p><p><a href=\"https://cointelegraph.com/news/donald-trump-vivek-ramaswamy-never-allow-cbdc\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-23T11:15:28.000Z",
    "title": "Could Binance be on the verge of taking back its lead from CME in futures markets?",
    "url": "https://cryptoslate.com/insights/could-binance-be-on-the-verge-of-taking-back-its-lead-from-cme-in-futures-markets/",
    "description": "<p>Quick Take The futures open interest market has witnessed a seismic shift, with CME rising to prominence, outpacing Binance to hit a 30% dominance. This ascension was propelled by the lead-up to the spot Bitcoin ETF, which saw a high of 136,000 Bitcoin allocated in CME on Jan. 10, which decreased to 112,000 Bitcoin by [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/could-binance-be-on-the-verge-of-taking-back-its-lead-from-cme-in-futures-markets/\">Could Binance be on the verge of taking back its lead from CME in futures markets?</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-23T11:30:09.000Z",
    "title": "US Senator Elizabeth Warren Comments Digital Assets Are Used to Evade Economic Sanctions",
    "url": "https://news.bitcoin.com/us-senator-elizabeth-warren-comments-digital-assets-are-used-to-evade-economic-sanctions/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/a18cd55e-edd0-493c-8b3b-fc211e6a19d9-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Senator Elizabeth Warren Comments Digital Assets Are Used to Evade Economic Sanctions\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/a18cd55e-edd0-493c-8b3b-fc211e6a19d9-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/a18cd55e-edd0-493c-8b3b-fc211e6a19d9-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/a18cd55e-edd0-493c-8b3b-fc211e6a19d9-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/a18cd55e-edd0-493c-8b3b-fc211e6a19d9-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/a18cd55e-edd0-493c-8b3b-fc211e6a19d9-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/a18cd55e-edd0-493c-8b3b-fc211e6a19d9-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/a18cd55e-edd0-493c-8b3b-fc211e6a19d9.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />U.S. Senator Elizabeth Warren criticized the illegal use of cryptocurrency assets by bad actors. Commenting on a report issued by the U.S. Government Accountability Office (GAO), Warren declared that &#8220;rogue nations are using crypto to dodge sanctions and undermine our national security,&#8221; calling to establish increased money laundering rules on these assets. U.S. Senator Elizabeth [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T11:36:47.000Z",
    "title": "Unlocking the Potential of Generative AI: A Roadmap for Organizations in 2024",
    "url": "https://www.cryptopolitan.com/unlocking-the-potential-of-generative-ai-3/",
    "description": "In the ever-evolving landscape of technology, the advent of Generative AI has ushered in a new era of possibilities for developers. This technology, when harnessed effectively, can empower developers to write code swiftly, innovate more profoundly, and concentrate on value-added tasks. This transformation is not a mere doubling of productivity; it&#8217;s an exponential acceleration of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T11:22:48.000Z",
    "title": "AIMS South Africa and Google DeepMind Launch AI for Science Master’s Program",
    "url": "https://www.cryptopolitan.com/aims-south-africa-and-google-deepmind-launch-ai-for-science-masters-program/",
    "description": "Google DeepMind has initiated a comprehensive scholarship program for African students. This initiative, encompassing 40 scholarships annually for four years starting September 2023, aims to foster a more inclusive AI community by supporting underrepresented groups. This effort highlights the growing recognition of the need for diverse perspectives in the rapidly evolving domain of AI. The [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-23T11:21:44.000Z",
    "title": "XRP investors flocking to new cryptocurrency",
    "url": "https://crypto.news/xrp-investors-flocking-to-new-cryptocurrency/",
    "description": "As altcoins like XRP fall, investors are exploring alternatives, including Rebel Satoshi (RBLZ), a meme coin"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-23T11:21:09.000Z",
    "title": "Trump bashes CBDCs again, cites pro-crypto candidate",
    "url": "https://crypto.news/trump-bashes-cbdcs-again-cites-pro-crypto-candidate/",
    "description": "Trump argues that a CBDC could threaten freedom by giving the federal government absolute control over citizens' money"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-23T11:30:03.000Z",
    "title": "Bitcoin Price Drops Sub $39,000 – 3 Key Reasons",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-drops-sub-39000-key-reasons/",
    "description": "The Bitcoin price has plummeted below the $39,000 mark, the lowest level since December 2. This significant drop can be attributed to three main factors that have collectively contributed to the current market sentiment and price action. #1 Selling Pressure From Grayscale’s GBTC Outflows The market has been heavily influenced by the continuous outflows from the Grayscale Bitcoin Trust (GBTC). Bloomberg analyst James Seyffart commented on the severity of the situation, stating, “Woof. BAD day for Bitcoin ETFs overall in the Cointucky Derby. GBTC saw over $640 million flow out today. Outflows aren&#8217;t slowing &#8212; they&#8217;re picking up. This is the largest outflow yet for GBTC. Total out so far is $3.45 Billion.” Nevertheless, the volume on the Bitcoin ETFs remained very strong, surpassing $2 billion, with GBTC accounting for over half of this volume. The total volume for the first seven trading days approached $19 billion. Interestingly, while GBTC experienced significant outflows, the broader spot Bitcoin ETF landscape paints a different picture. Excluding Grayscale, the nine new ETFs have collectively amassed 95,000 Bitcoin ($3.8 billion), in stark contrast to the 65,000 Bitcoin ($2.9 billion) that flowed out of GBTC. Related Reading: Bitcoin Expected To Mirror Historical Trends: Glassnode Sets $120K Price Prediction For 2024 22,000 BTC have been from selling from the FTX Estate, meaning not flowing into others. While the cessation of this supply overhang is generally positive for the market, it remains crucial to monitor whether the outflows from Grayscale persist or intensify, even after the conclusion of the FTX-related sell-offs. #2 Futures And Options Markets Cool Down A significant contributor to Bitcoin&#8217;s price movement below $39,500 is the cooling of activity in the futures and options markets. Notably, the open interest in CME Bitcoin futures experienced a sharp decline, shedding over $1.64 billion following the approval of spot BTC ETFs, indicating a reduction in market leverage and speculative interest. Crypto analyst Skew provided a nuanced analysis of the market dynamics, particularly focusing on the interplay between Bitcoin&#8217;s perpetual futures (perps) and the spot market. Skew noted, “Nothing too conclusive yet in perps market other than shorts becoming the dominant position in the market currently. Perp premiums often occurring during periods of spot limit selling into price. Spot premiums notably when perps push price into areas of limit bids on spot exchanges.&#8221; This observation points to a shift towards bearish sentiment in the perps market, with short positions taking precedence. The analyst also highlighted the current market&#8217;s lack of volatility and urgency, attributing it to decreased open interest and a focus on spot market flows. Related Reading: Bitcoin Price “Mad Heavy,” Why A Detour To $30,000 Might Be Imminent Further shedding light on the market sentiment, options analytics platform Greeks.live added insights into the options market, particularly the behavior of Bitcoin&#8217;s implied volatility (IV) and the volatility risk premium (VRP). They noted, “Bitcoin fell below the $40,000 as short-term IVs recovered. Overall VRP has risen, and the Skew curve is skewed towards put options.” This shift towards put options signifies an increase in market participants hedging or betting on further downside, thus contributing to the bearish sentiment. However, Greeks.live also pointed out that despite the bearish forces and the presence of panic orders, the overall market is still witnessing a balanced game between bulls and bears. #3 Sentiment Shift &#8211; Calls For $35,000 Get Louder The third pivotal factor influencing Bitcoin&#8217;s price drop below $39,500 is a notable shift in market sentiment, emphasizing the need for a correction after a prolonged bullish period. Charles Edwards, the founder of Capriole Investments, articulated the market&#8217;s current state, highlighting the abnormality of the recent price trends and forecasting an inevitable return to volatility. Edwards stated, “We&#8217;re still not here yet. This pullback is very overdue and lower is healthier.” He pointed out the rarity of the current market conditions, noting, “It’s now been over 232 days since Bitcoin had a 25%+ drawdown in the prior 12 months. The last time this happened was more than a decade ago, in 2011! The current low downside volatility period is NOT normal. These dips usually occur every 2-3 months. Volatility will return.” The recent price correction, although perceived as a healthy and overdue adjustment by analysts, has nevertheless instilled a sense of panic among traders and investors. The market&#8217;s sentiment has taken a negative turn, especially as Bitcoin experiences a -20% dip, a movement partly attributed to the overhang of Grayscale&#8217;s supply. The once robust bullish optimism has waned, giving way to louder calls for a further decline to $35,000 or even lower. This shift in sentiment is quantitatively reflected in the Bitcoin Fear &#38; Greed Index, which has moved to a neutral position of 50, marking a significant departure from the extreme greed observed during the uptrend. At press time, BTC traded at $39,219. Featured image from iStock, chart from TradingView.com"
  }
]