[
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T05:49:33.000Z",
    "title": "Naver Corp unveils South Korea's answer to ChatGPT and generative AI",
    "url": "https://cointelegraph.com/news/naver-corp-unveils-south-korea-chatbot-generative-ai-tool-like-chatgpt",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/990ef88f-09c4-41d2-a7c0-b8574a9430ec.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>South Korean internet giant Naver Corp. has released CLOVA X, a Korean language chatbot similar to ChatGPT that can have conversations and summarize text.</p>\n                    <p><p>South Korean tech company Naver Corp has unveiled its answer to OpenAI’s ChatGPT — named CLOVA X — its newest generative AI chatbot which is aimed at Korean-language users. </p><p>On Aug. 24, South Korean news outlet Yonhap <a href=\"https://en.yna.co.kr/view/AEN20230824004100320\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that Naver released its upgraded hyperscale artificial intelligence model HyperCLOVA X.</p><p>HyperCLOVA X is the firm's flagship AI model built using supercomputing and data analysis capabilities and powers Naver's various AI services including the new CLOVA X chatbot.</p><p>The new Korean language chatbot is similar to ChatGPT but leverages Naver’s expertise in Korean language and culture. Just like its English-language counterparts from Google, OpenAI, Microsoft and Anthropic, it can have conversations, summarize text, and generate stories.</p><p>In addition to the Korean chatbot, Naver also announced CUE, a generative AI search service that is also powered by HyperCLOVA X.</p><p>In a Seoul press conference on Aug. 24, Naver CEO Choi Soo-yeon said the firm has applied its technologies and experiences from various sectors including web search and online shopping to support the technological competitiveness of our generative AI model HyperCLOVA X.</p><p>\"Naver is ready to face the new change opened by generative AI,\" added Choi.</p><p>The firm stated that CLOVA X beta testing will begin on Aug. 24 and the CUE: search tool will be launched in September. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/96fbaa95-375b-432b-89e2-ea0229a0b422.jpg\"  /><figcaption style=\"text-align: center;\">ClovaX landing page. Source: clova-x.naver.com</figcaption></figure><p>Moreover, Naver has invested heavily in AI, spending $754 million over five years, and is opening a large new data center with 600,000 servers to hyperscale its AI efforts.</p><p>According to Choi, the firm is looking to develop localized AI applications for countries with political sensitivities in the Middle East. It also plans to target non-English speaking countries and regions such as Japan and Southeast Asia.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/7-game-changing-uses-of-chatgpt\"><strong><em>7 game-changing uses of ChatGPT</em></strong></a></p><p>The AI hype train is gathering momentum and companies such as Naver and Nvidia are cashing in. On Aug. 24, Cointelegraph <a href=\"https://cointelegraph.com/news/nvidia-q2-earnings-report-revenue-soars-beating-analyst-expectations\">reported</a> that Nvidia smashed Q2 revenue expectations with a whopping $13.5 billion in revenue for the period. </p><p>“Companies worldwide are transitioning from general-purpose to accelerated computing and generative AI,” said Nvidia founder and CEO Jensen Huang.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/how-to-prevent-ai-from-annihilating-humanity-using-blockchain/\"><strong><em>How to prevent AI from ‘annihilating humanity’ using blockchain</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-08-24T06:00:00.000Z",
    "title": "Hedera, THORChain, and InQubeta demand spikes despite shaky market conditions",
    "url": "https://crypto.news/hedera-thorchain-and-inqubeta-demand-spikes-despite-shaky-market-conditions/",
    "description": "Hedera (HBAR), THORChain (RUNE), and, notably, InQubeta's QUBE are popular as more investors explore their core propositions"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-24T05:57:37.000Z",
    "title": "Tron Price Prediction: TRX Outperforms Bitcoin and Could Rally To $0.082",
    "url": "https://www.newsbtc.com/analysis/trx/tron-price-prediction-trx-outperforms-bitcoin-0-082/",
    "description": "Tron price is rising and trading above $0.0760 against the US Dollar. TRX is outperforming Bitcoin and could rally further toward the $0.0820 resistance. Tron is moving higher from the $0.0720 support zone against the US dollar. The price is trading above $0.0760 and the 100 simple moving average (4 hours). There is a key bullish trend line forming with support near $0.0762 on the 4-hour chart of the TRX/USD pair (data source from Kraken). The pair could continue to climb higher toward $0.080 and $0.0820. Tron Price Starts Fresh Increase This past week, Tron’s price saw a sharp decline below the $0.0760 support against the US Dollar, similar to Bitcoin and Ethereum. TRX tested the $0.0715 zone where the bulls took a stand. A low was formed near $0.0713 and the price started a fresh increase. There was a decent increase above the $0.0740 and $0.0750 resistance levels. It even outperformed Bitcoin in the past couple of sessions and broke the $0.0760 resistance. There was a move above the 76.4% Fib retracement level of the downward move from the $0.0775 swing high to the $0.0713 low. TRX is now trading above $0.0760 and the 100 simple moving average (4 hours). There is also a key bullish trend line forming with support near $0.0762 on the 4-hour chart of the TRX/USD pair. On the upside, an initial resistance is near the $0.0790 zone. The first major resistance is near $0.080, above which the price could rise toward the $0.0820 resistance or the 1.618 Fib extension level of the downward move from the $0.0775 swing high to the $0.0713 low. Source: TRXUSD on TradingView.com A close above the $0.0820 resistance might send TRX further higher. The next major resistance is near the $0.0850 level, above which the bulls are likely to aim a larger increase toward the key $0.0900 zone in the coming days. Are Dips Limited in TRX? If TRX price fails to clear the $0.080 resistance, it could start a downside correction. Initial support on the downside is near the $0.0760 zone and the trend line. The first major support is near the $0.0745 level, below which the price could accelerate lower. The next major support is $0.0715. Technical Indicators 4 hours MACD – The MACD for TRX/USD is gaining momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for TRX/USD is currently above the 50 level. Major Support Levels – $0.0760, $0.0745, and $0.0715. Major Resistance Levels – $0.0790, $0.0800, and $0.0820."
  }
]