[
  {
    "source": "Cointelegraph",
    "date": "2023-05-26T17:13:42.000Z",
    "title": "Twitter’s $42K API access plan could harm crypto research",
    "url": "https://cointelegraph.com/news/twitter-s-42k-api-access-plan-could-harm-crypto-research",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/23e4293d-427b-493d-9a1f-fe56bdd6ea17.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Twitter emailed researchers to let them know they’ll either have to delete their data or pay $42,000 to keep using the platform's API. </p>\n                    <p><p>Researchers using Twitter’s formerly free Decahose data service will soon be required to pay a fee of $42,000 per month to continue using the service and retain their data.</p><p>Decahose, a streaming service that gives scientists unfettered access to around 10% of all tweets in real-time, has been a <a href=\"https://scholar.google.com/scholar?hl=en&amp;as_sdt=0%2C5&amp;q=twitter+decahose&amp;btnG=\" target=\"_blank\" rel=\"noopener nofollow\">mainstay</a> for academic research on myriad topics, including emergency response, law enforcement-related activities, political misinformation, and extremism.</p><p>Earlier this year, due to Elon Musk’s purchase of the company, Twitter <a href=\"https://www.wired.com/story/twitter-data-api-prices-out-nearly-everyone/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> it would begin charging for access to its numerous APIs with fees ranging from $100 to $42,000 per month. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">For Academia, we are looking at new ways to continue serving this community. In the meantime Free, Basic and Enterprise tiers are available for academics. Stay tuned to <a href=\"https://twitter.com/TwitterDev?ref_src=twsrc%5Etfw\">@TwitterDev</a> to learn more.</p>&mdash; Twitter Dev (@TwitterDev) <a href=\"https://twitter.com/TwitterDev/status/1641222788911624192?ref_src=twsrc%5Etfw\">March 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Academics and universities using the Decahose service would be required to pay the “enterprise” fee of $42,000 per month under the new rules and the amount of data available would <a href=\"https://www.wired.com/story/twitter-data-api-prices-out-nearly-everyone/\" target=\"_blank\" rel=\"noopener nofollow\">reportedly</a> drop from 10% of the total live tweets to 0.3%. </p><p>According to a report from British publication <em>i </em>news, researchers were recently sent an email <a href=\"https://inews.co.uk/news/twitter-researchers-delete-data-unless-pay-2364535\" target=\"_blank\" rel=\"noopener nofollow\">explaining</a> that they could either start paying for their access or delete any data they’ve obtained: </p><blockquote>“Researchers who don’t sign the new contract ‘will need to expunge all Twitter data stored and cached in your systems.’ Researchers will be required to post screenshots ‘that showcase evidence of removal.’ They have been given 30 days after their agreement expires to complete the process.”</blockquote><p>The timing of this change is noteworthy, as it comes mere days after Musk joined Florida Governor Ron DeSantis in <a href=\"https://cointelegraph.com/news/ron-desantis-protect-bitcoin-us-presidential-bid\">announcing the latter’s bid for the White House</a> in the 2024 U.S. presidential election. </p><p>If executed as planned, the impending change to Decahose access could stifle global research efforts to study election misinformation and social manipulation ahead of the 2024 election as it occurs on what’s been <a href=\"https://www.brookings.edu/blog/techtank/2021/09/27/how-tech-platforms-fuel-u-s-political-polarization-and-what-government-can-do-about-it/\" target=\"_blank\" rel=\"noopener nofollow\">described</a> as one of the world's most politically-active social media platforms. </p><p>Beyond misinformation research, the pricing changes would also limit academia’s ability to study internet-related crimes such as human trafficking and financial scams. Furthermore, Decahose has <a href=\"https://developer.twitter.com/en/docs/twitter-api/tweets/volume-streams/introduction\" target=\"_blank\" rel=\"noopener nofollow\">served</a> as one of the internet’s largest repositories of human sentiment — a data source that drives insights and predictions on nearly every society-related research topic imaginable. </p><p><strong><em>Related: </em><a href=\"https://cointelegraph.com/news/elon-musk-threatens-microsoft-with-suit-claims-ai-trained-on-twitter-data\"><em>Elon Musk threatens Microsoft with lawsuit, claims AI trained on Twitter data</em></a></strong></p><p>Much of the data used to <a href=\"https://www.researchgate.net/publication/357367394_Investigation_of_the_causality_between_Twitter_comments_and_altcoin_cryptocurrency_market_by_sentiment_analysis_during_the_COVID-19_pandemic_Ripple_example\" target=\"_blank\" rel=\"noopener nofollow\">study</a> cryptocurrency sentiment, for example, comes from Twitter and Reddit data silos. By limiting access to this data, Twitter is potentially hindering both ongoing research and forestalling new efforts. </p><p>One explanation for the pricing increase could involve Musk’s ongoing efforts to ensure technology companies aren’t using Twitter’s data to train their AI systems.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-26T17:22:43.000Z",
    "title": "PSYOP creator Ben.eth vows to refund victims after Steve Aoki hack leads to $170k in losses",
    "url": "https://cryptoslate.com/psyop-creator-ben-eth-vows-to-refund-victims-after-steve-aoki-hack-leads-to-170k-in-losses/",
    "description": "<p>Ben.eth, the founder of $PSYOP, promised to refund everyone who lost their Ethereum to a phishing scam that he quote-tweeted to his followers. He asked victims to reach out via email and confirm they had their funds stolen. Steve Aoki hacked On-chain sleuth Zachxbt tweeted on May 26 that hackers had compromised Steve Aoki&#8217;s Twitter [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/psyop-creator-ben-eth-vows-to-refund-victims-after-steve-aoki-hack-leads-to-170k-in-losses/\">PSYOP creator Ben.eth vows to refund victims after Steve Aoki hack leads to $170k in losses</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T17:31:08.000Z",
    "title": "Hooked Protocol price analysis: HOOK/USD bullish momentum maintains above $1.42 with target for bulls",
    "url": "https://www.cryptopolitan.com/hooked-protocol-price-analysis-2023-05-26/",
    "description": "Hooked Protocol&#8217;s price analysis shows rising signs as the market shows massive upside potential. The price has increased, reaching above the $1.42 level, and could soon break out of the key resistance levels to surge even higher if the bullish momentum continues. The bulls have regained their control of the HOOK market, which will change ... <a title=\"Hooked Protocol price analysis: HOOK/USD bullish momentum maintains above $1.42 with target for bulls\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hooked-protocol-price-analysis-2023-05-26/\" aria-label=\"More on Hooked Protocol price analysis: HOOK/USD bullish momentum maintains above $1.42 with target for bulls\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T17:26:18.000Z",
    "title": "We asked GPT-4: What’s CZ’s ideal career if not Binance CEO?",
    "url": "https://www.cryptopolitan.com/gpt-4-cz-ideal-career-if-not-binance-ceo/",
    "description": "Leading the renowned cryptocurrency exchange Binance, Changpeng Zhao, affectionately known as CZ, is an international figurehead in the world of digital currency. The fusion of his entrepreneurial spirit, his innovative approach, and his deep-rooted knowledge of technology have elevated him to one of the most respected positions in the industry. Yet, what if the helm ... <a title=\"We asked GPT-4: What&#8217;s CZ&#8217;s ideal career if not Binance CEO?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gpt-4-cz-ideal-career-if-not-binance-ceo/\" aria-label=\"More on We asked GPT-4: What&#8217;s CZ&#8217;s ideal career if not Binance CEO?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T17:13:34.000Z",
    "title": "Binance Coin price analysis: BNB increases value to $307.1",
    "url": "https://www.cryptopolitan.com/binance-coin-price-analysis-2023-05-26/",
    "description": "Binance Coin price analysis indicates a prevailing bullish trend, suggesting a sustained and potentially increased positive momentum in the market. The current conditions favor the bulls, who are expected to maintain their dominance and potentially exert even greater control over the market in the near future. Additionally, Binance Coin has witnessed a notable surge in ... <a title=\"Binance Coin price analysis: BNB increases value to $307.1\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-analysis-2023-05-26/\" aria-label=\"More on Binance Coin price analysis: BNB increases value to $307.1\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-26T17:30:08.000Z",
    "title": "Toncoin (TON) Continues Downward Trend As Bears Maintain Control",
    "url": "https://www.newsbtc.com/altcoin/toncoin-ton-continues-downward-trend-as-bears-maintain-control/",
    "description": "Toncoin (TON) has experienced a negative price decline, resulting in a bearish sentiment among investors of the altcoin. TON has been exhibiting a bearish strength on a monthly timeframe, based on data from CoinMarketCap.  Within the last 30-Day trading session, the asset is down by 15,67%, indicating a high bearish strength with low buying pressure. Related Reading: Bitcoin Bearish Signal: NUPL Finds Rejection At Long-Term Resistance As of the time of writing, the asset is experiencing a decline in value, as it’s down today by 2.76%. This downward trend has resulted in the asset, TON, reaching a low point of $1.91.  The decrease in value reflects a temporary setback in the market, indicating a decrease in investor confidence. It also detects a shift in the supply and demand dynamics surrounding the asset. Toncoin (TON) Bears Maintained Their Positions Toncoin (TON) witnessed a sharp price decline on May 23, from $2.03 to its present value of $1.89. This price decline represents a loss of 6.89%. This decline reflects the dominance of bearish sentiment in the market, which shows a lack of investor confidence and a shift in the supply and demand dynamics. According to the market sentiment indicator, the current market sentiment is bearish, while the Fear &#38; Greed index value is a neutral 49. Notably, a Fear &#38; Greed index value below 50 points to an increase in bearish momentum. Conversely, an important resistance level is noted at $2.080, representing a significant hurdle for potential upward movement.  Toncoin trades below the 50-day and 200-day Simple Moving Average (SMA). The SMAs formed a Death Cross in the TON market on May 21, 2023.  This confirms the bearish sentiment present in the market, indicating a potential sell signal and further price decline. The Relative Strength Index (RSI) momentum oscillator value is 40.98 and points downwards. RSI is a popular indicator showing whether a cryptocurrency is oversold or overbought.  Related Reading: Bitcoin Hangs At $26,200: Why This Is A Crucial Support Level If TON RSI drops below 30, it may ignite high selling pressure and further price decline. TON Demand Index and Bollinger Bands Signals Bearish Activities The TON/USDT trading pair demand index is at -0.449, suggesting relatively weak demand for the asset in the market. Note that a demand index below zero is generally considered a lack of buying pressure. It also indicates that the selling pressure outweighs the buying interest. In addition, the asset is heading toward the lower part of the Bollinger Bands indicator. This suggests an increase in selling pressure and high bearish momentum. Featured image from Pixabay and chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T17:25:51.000Z",
    "title": "How The Payment Sphere Continues to Adapt",
    "url": "https://www.crypto-news-flash.com/how-the-payment-sphere-continues-to-adapt/?utm_source=rss&utm_medium=rss&utm_campaign=how-the-payment-sphere-continues-to-adapt",
    "description": "<p>Massive changes to payment methods When we consider all the payment options available today, it seems hard to believe that as recently as the 1990s, the only realistic choices were cash or check. If someone wanted to buy something on the never-never, there was the option of using a credit card. However, the debit card [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/how-the-payment-sphere-continues-to-adapt/\">How The Payment Sphere Continues to Adapt</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]