[
  {
    "source": "Decrypt",
    "date": "2023-06-14T16:44:14.000Z",
    "title": "'NFTs Can't Scale' in Current Form, Say Superduper Co-founders",
    "url": "https://decrypt.co/144579/nfts-cant-scale-current-format-say-superduper-founders",
    "description": "At this year’s NFC, the Superduper founders stressed that getting NFTs to mass adoption won’t be easy. "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-14T17:06:01.000Z",
    "title": "Blockchain Australia says banking restrictions will have ‘costly side effects’",
    "url": "https://cryptoslate.com/blockchain-australia-says-banking-restrictions-will-have-costly-side-effects/",
    "description": "<p>Industry group Blockchain Australia believes that placing &#8220;blanket restrictions&#8221; on the crypto industry in the Oceanic country could potentially result in &#8220;costly side effects.&#8221; The trade body made the statement in response to the Commonwealth Bank of Australia&#8217;s recent decision to restrict payments to crypto exchanges and place a monthly limit on all crypto-related transactions. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/blockchain-australia-says-banking-restrictions-will-have-costly-side-effects/\">Blockchain Australia says banking restrictions will have ‘costly side effects’</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-14T17:00:09.000Z",
    "title": "Binance vs. Coinbase: Analyzing asset withdrawals in the wake of SEC lawsuits",
    "url": "https://cryptoslate.com/binance-vs-coinbase-analyzing-asset-withdrawals-in-the-wake-of-sec-lawsuits/",
    "description": "<p>The SEC&#8217;s lawsuits against Binance and Coinbase created a discernable shift in the market, leading to significant changes in the exchanges&#8217; asset balances. The lawsuits, filed on June 5 and June 6, accuse Binance and Coinbase of a variety of securities law violations. These legal encounters have created a domino effect in the legal sphere [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-vs-coinbase-analyzing-asset-withdrawals-in-the-wake-of-sec-lawsuits/\">Binance vs. Coinbase: Analyzing asset withdrawals in the wake of SEC lawsuits</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-14T17:00:00.000Z",
    "title": "Celebrating the 12 winners of the 2023 CryptoDaily™ Awards",
    "url": "https://cryptodaily.co.uk/2023/06/celebrating-the-12-winners-of-the-2023-cryptodaily-awards",
    "description": "<p>CryptoDaily&trade;&nbsp;is thrilled to announce the winners of our annual international award for daring Web3 builders and popularizers. Between May 22nd and June 5th, the expert jury reviewed dozens of stars that were shining in the industry throughout the past year, recognizing honorees across 4 categories: Entrepreneurship, Development, Design, and Marketing &amp; PR.</p>\n<p>Driven by the genuine belief that the community should acknowledge its heroes, we established&nbsp;CryptoDaily&trade; Awards in 2022 to reward the most outstanding talents based on their merits. They all contributed to the Web3 ecosystem in many ways, from significantly improving its infrastructure and user experience to amplifying the Web3 business sector and promoting decentralized applications to the mass population.</p>\n<p>While the main goal of CryptoDaily&trade; Awards remained the same, we brought a couple of novelties to the evaluation process. So, before we proceed with disclosing this year&rsquo;s results, let us first introduce you to the changes made. &nbsp;</p>\nPanel of Judges\n<p>To highlight the Web3&rsquo;s best and brightest minds of 2023, we invited the Fantastic Four team of subject matter judges, each contributing to the long-term trends in their own focus area throughout a year. We have thoughtfully chosen the jury members among 20 candidates for each category, paying special attention to their in-depth knowledge of the industry, multi-faceted activity, and remarkable individual achievements.</p>\n<p>Some of them have promoted dozens of new millionaire businesses for the Web3 and blockchain era. Others have traversed the severe crypto market turmoil of 2022 with honor, and still others have proved that they were rightly praised by the previous&nbsp;CryptoDaily&trade; Awards.</p>\nSo let us dive straight into the list without further ado.\n<p></p>\nEntrepreneurship\n<p>Jo&atilde;o Fouad, a disruptive entrepreneur specializing in Web3, finance, investments, and the startup ecosystem; an international speaker and entrepreneurial mentor; CEO and founder of Highline Venture Builder.</p>\n<p></p>\nDevelopment\n<p>Kirill Arutyunov, a professional software engineer and developer with over 10 years of experience in Web3, fintech, and edtech; a seasoned entrepreneur and C-level executive; CTO of M&uuml;nzen.</p>\n<p></p>\nDesign\n<p>Valery Lebedenko, an internationally acclaimed UX/UI designer for Web3, crypto and blockchain&nbsp;projects; an expert blogger, columnist, and judge at Web3 hackathons; the 2022 CryptoDaily&trade; Awards winner.</p>\n<p></p>\nMarketing &amp; PR\n<p>Mike Ermolaev, a recognized crypto journalist and PR specialist; author of the signature series &ldquo;Crypto Opinion with Mike Ermolaev&rdquo; for Benzinga.com; market analyst for Cointelegraph Brazil; founder of Outset PR agency.</p>\n<p></p>\nHonorable Jury&rsquo;s Member\n<p>Cal Evans,&nbsp;a Managing Associate of Gresham International - the world&rsquo;s largest Digital Asset only legal service and law firm; headliner of several large events alongside people such as Gary Vee and Nick Spanos.</p>\nRenewed Methodology\n<p>This year, the focus of the award was slightly shifted towards showcasing Web3's famous personalities and rising superstars who stood out with brilliant results and dynamic development. Our jury leveraged their professional outlook to make decisions, following a numerical and quantitative methodology with specific weighting given to:</p>\n<ul class=\"lst-kix_i1vygxemccds-0 start\">\n<li>Evidence of leading the development and delivery of cutting-edge Web3 projects;</li>\n<li>Evidence of engagement with the business to drive Web3 adoption;</li>\n<li>Evidence of skill set growth and personal accomplishments;</li>\n<li>Evidence of exceptional leadership and excellence in the field;</li>\n<li>Evidence of results implemented because of the honoree's work;</li>\n<li>Demonstrable enthusiasm for and creativity in Web3.</li>\n</ul>\n<p>All judges had two weeks to carefully evaluate more than 50 most ambitious Web3 innovators in their respective categories. Adhering strongly to the award&rsquo;s criteria, each jury member finally came up with two winners, presenting them as:</p>\n<ul class=\"lst-kix_vwxb9fh82j84-0 start\">\n<li>Jury&rsquo;s choice&nbsp;&ndash; unrivaled gainers whose individual performance is the most worthy by all criteria;</li>\n<li>Jury&rsquo;s runner-up pick&nbsp;&ndash; those who were one step away from the Jury&rsquo;s choice but couldn't outperform the winners. &nbsp; &nbsp;</li>\n</ul>\n<p>In order to prolong the pleasure, CryptoDaily&trade; decided not to depart from participation in the assessment of nominees. The judges had final say, but we gave an opportunity to enjoy the celebration to our 4 personal favorites, rewarding them with a very special honorable mention&nbsp;&ndash; the prestiges title from CryptoDaily&trade; editorial board.</p>\nWinners\n<p>And now, when all the formalities are met, it&rsquo;s time to pull back the curtain &ndash; we are ready to reveal the official results of the 2023 from CryptoDaily&trade; editorial board.</p>\nEntrepreneurship\nJury&rsquo;s choice &ndash; Drew Beechler, CEO and founder of Holder\n<p></p>\n<p>Drew Beechler&nbsp;has won the Jury&rsquo;s choice prize due to the launch of Holder, a revolutional CRM and marketing automation platform, in April 2022. The company helps NFT projects and Web3 businesses to align their products with customer needs and engage with their audiences in a more meaningful way. Before starting Holder, Beechler, a career brand and marketing leader with a huge love for decentralized tech, startups, and data-driven marketing, has helped to co-found 30+ B2B SaaS startups in 7 years as the CEO of the High Alpha venture capital firm with over $200 million in AUM. &nbsp;</p>\nJury&rsquo;s runner-up pick &ndash; Daniel Rose, CEO and co-founder of Doshi\n<p></p>\n<p>The Jury&rsquo;s runner-up pick title goes to Daniel Rose&nbsp;who is a passionate company builder holding leadership roles in strategy and product development, data-driven experimentation, and operations. As the CEO of Doshi, a crypto wallet designed for teenagers, Daniel combines his commercial skills in technology and gamification with a purpose-led mission to establish greater financial confidence for next-gen investors, making learning about Web3 and blockchain easy, engaging, and relevant. Before he started Doshi, Rose was a full-time crypto trader and worked as an innovation consultant for IKEA and King Games.</p>\nCryptoDaily&trade; honorable mention &ndash; Andr&eacute;s Soltermann, co-founder of Grizzly.fi\n<p></p>\n<p>We decided to assign our honorable mention to Andr&eacute;s Soltermann, the long-term crypto enthusiast and the frontman of Grizzly.fi, a sensational startup that aims to create the DeFi 2.0 platform and revolutionize token launches. Soltermann is an early adopter of DeFi, fueled by the desire to make it accessible for everyone. At Grizzly.fi, Andr&eacute;s is responsible for the innovations and technical developments that brought his project to the list of top hits on Product Hunt. Apart from that, Soltermann contributes to the governance of $DCHF, a decentralized stablecoin pegged to the Swiss Franc and backed by Bitcoin and Ethereum.</p>\nDevelopment\nJury&rsquo;s choice &ndash; Magomed Aliev, chief developer and founder of the Gravix&nbsp;derivatives exchange\n<p></p>\n<p>Magomed Aliev&nbsp;was awarded with the Jury&rsquo;s choice prize as a Web3 engineer and TVM developer. A graduate of the elite Higher School of Economics specializing in machine learning and data science, Aliev has since become one of the foundational developers of the Venom Bridge&nbsp;and the Octus Bridge. He made major contributions to all key ecosystem applications in the Venom and Everscale networks, including DEXs, scanners, Venom Stake, portfolio analyzers, and Snipa.finance. Additionally, Magomed developed Locklift, the contract writing framework used to write all Venom applications.</p>\nJury&rsquo;s runner-up pick &ndash; Illia Polosukhin, cutting-edge software engineer, co-founder of NEAR Protocol\n<p></p>\n<p>The Jury&rsquo;s runner-up pick title was given to Illia Polosukhin, the co-founder of NEAR Protocol&nbsp;that is currently evolving from a L1 blockchain for creating smart contracts to the full-fledged Blockchain Operating System (BOS) for Web3. This revolution is powered by Pagoda, a vertical in the NEAR ecosystem formerly known as Near Inc. With BOS, Polosukhin&rsquo;s goal is to build an open web world where developers can easily create new experiences, while end users can control their assets, data, content, and power of governance. Illia has also been engaged in sharing his wealth of knowledge as the speaker of numerous Web3 and blockchain conferences.</p>\nCryptoDaily&trade;&nbsp;honorable mention &ndash; Anton Bukov, forward-thinking blockchain developer and engineer, co-founder of 1inch Network\n<p></p>\n<p>The CryptoDaily&trade; honorable mention goes to Anton Bukov&nbsp;who elevates the potential of 1inch Network, the platform ensuring the most lucrative, fastest and protected DeFi operations. Due to his efforts, the company recorded a notable growth across its protocols, with the total number of users approaching 2.6 million. For 7 years in blockchain development, Bukov has achieved strong C++ skills, working deep with a network stack of protocols, algorithms, compilers, disassemblers, and profilers. Today Anton is actively exploring DeFi, GameFi, NFTs, P2E, the metaverse, and consensus problem solutions for crypto projects.</p>\nDesign\nJury&rsquo;s choice &ndash; Rahul Singh Bhadoriya, a Web3 designer collaborating with multiple trending projects\n<p></p>\n<p>An ex-design project manager at Polygon, Rahul Singh Bhadoriya&nbsp;is this year&rsquo;s Jury&rsquo;s choice winner. As a self-taught designer, Rahul also dedicated himself to supporting other self-learning designers by sharing his knowledge at subject matter conferences and showcasing his work on his personal website and social media. Bhadoriya was Polygon&rsquo;s brand identity and experience designer from May 2022 to February 2023, expanding the attractiveness of the blockchain ecosystem with top-notch UX and UI. Since then, he has been engaged in building several Web3 projects such as Wagmipedia, Notific, Superteam, and Makerdock. &nbsp; &nbsp;</p>\nJury&rsquo;s runner-up pick &ndash; Patrick N. Lewis, head of design at Floor\n<p></p>\n<p>Welcome Patrick N. Lewis&nbsp;as the Jury&rsquo;s runner-up pick honoree. As the lead designer for the ground-breaking Floor&nbsp;app, his mission is to create a more equitable future for Web3 and make NFTs easy-to-understand. Lewis is also the founding designer of LinksDAO, a Web3-oriented project building the world&rsquo;s best golf club. Earlier in his career, Patrick acted as the first design hire and second employee at Button where he participated in developing products, design systems, and identity. His portfolio features commerce products for Uber, Amazon, and dozens of the world&rsquo;s top companies.</p>\nCrypto Daily&rsquo;s honorable mention &ndash; Rob Sven&scaron;ek, product designer at Sismo\n<p></p>\n<p>Our next honorable mention is for Rob Sven&scaron;ek, Web3 product designer from Ljubljana. With his &ldquo;strategic and pragmatic, yet playful and expressive&rdquo; approach to design, Sven&scaron;ek is currently creating functional and aesthetic relevant UX/UI solutions that bring value to Sismo, a breakthrough communication protocol enabling users to aggregate and selectively disclose personal data to applications. Prior to that, Rob was the lead product designer at Niftify, a buzzing no-code NFT store builder for businesses. His works are visually strong, with great emphasis put on usability and character.</p>\nMarketing &amp; PR\nJury&rsquo;s choice &ndash; Serge Baloyan, founder of X10 marketing agency\n<p></p>\n<p>The Jury&rsquo;s choice fell on Serge Baloyan&nbsp;who&rsquo;s standing at the helm of X10 Agency, one of the most reputable and influential crypto and NFT marketing service providers in the industry. He has garnered significant attention over the past year due to catering over 150 projects as a recognized expert in his field. Baloyan's insightful predictions and deep industry knowledge enable him to participate in global conferences as a keynote speaker, popularizing the future of blockchain and demonstrating his commitment to innovation that has already made a lasting impact in the crypto world.</p>\nJury&rsquo;s runner-up pick &ndash;&nbsp;Nicola Da Dalto, digital marketing manager at Exclusible\n<p></p>\n<p>Meet Nicola Da Dalto, awarded with the Jury&rsquo;s runner-up pick title. The Web3 projects Nicola works with have become the latest talk of the town in the NFT and Metaverse sector due to his creative marketing approach. As of today, Da Dalto is responsible for the management and implementation of digital marketing strategies at Exclusible, a one-stop platform and marketing agency that helps both individuals and businesses to successfully navigate the world of digital assets. Nicola is also recognized for his role as CMO and co-founder of Cryptoverse, a Web3 agency that brings brands to the Metaverse.</p>\nCryptoDaily&trade; honorable mention &ndash; Maria Isabel F&eacute;lix de Matos, head of marketing on blockchain projects\n<p></p>\n<p>The last but not least honorable mention from CryptoDaily&trade; goes to Maria Isabel F&eacute;lix de Matos&nbsp;who has been the head of community at the WYTLAND gaming &amp; AI studio since December 2022. Thanks to her efforts, the company has built a reputation for being accessible and responsive and has earned the trust and loyalty of its community members. Maria keeps onboarding users to the possibilities of Web3 for the travel industry, while also representing WYTLAND in the metaverse. As a result-driven marketer, she believes in the power of storytelling and defines her biggest value as being empathic.</p>\nLooking Forward to the 2024 CryptoDaily&trade; Awards\n<p>We would like to express a sincere gratitude to our expert judges whose participation has made the 2023 CryptoDaily&trade; Awards possible. And of course, a heartfelt thank you to all of the talented builders who keep shaping our common future. We believe that each honoree should be incredibly proud of what they&rsquo;ve accomplished and will continue to demonstrate exciting performance throughout their professional journeys.</p>\n<p>We can&rsquo;t wait to celebrate another wave of trailblazers through the next Crypto Daily Awards, from entrepreneurs and developers whose careers in Web3 are resounding success to designers and marketers with outside-the-box thinking.</p>\n<p>Let&rsquo;s do it again in 2024 and see who will earn a standing ovation!</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-14T17:00:12.000Z",
    "title": "Crypto Market Bleeds As SEC Pressures Mount, Is It Time To Buy?",
    "url": "https://www.newsbtc.com/crypto/crypto-market-bleeds-as-sec-pressures-mount-is-it-time-to-buy/",
    "description": "The crypto market seems to have reached a critical turning point where prices are suffering because of regulatory pressure across the space. This ranges from the United States Securities and Exchanges Commission (SEC) suing Binance and Coinbase exchanges, as well as the Ripple case heating up. These factors led to a sharp plunge in prices, which could present a unique opportunity to get into the market. Crypto Market Bleeds Red The days following the heightened regulatory scrutiny have not been easy on the crypto market. As such, most of the digital assets in the space are now nursing massive losses. One example is Bitcoin, which is currently the market leader. Related Reading: SUI Defies Bear Market With 15% Rally, Is A Return To $1 Imminent? Bitcoin lost its footing above the $26,000 which had been serving as support for the bulls. However, the sellers maintain control of the market and this sell pressure has continuously mounted over the last week, making any form of recovery impossible. BTC is now back in the $25,000 territory after falling 2.30% in the last week. The second-largest cryptocurrency by market cap Ethereum has also followed the same trend and is performing even worse than Bitcoin on the weekly chart where it is seeing 6.07% losses. This decline has brought its price below the $1,750 support as bulls scramble to hold on. BNB has been the only token of the top 10 performing reasonably well with 5.12% gains. However, this recovery has sparked questions about whether Binance is dumping its BTC to prop up the price of BNB after it went into freewill following the SEC lawsuit. Others such as XRP, DOGE, TRX, ADA, and MATIC are all nursing losses over the last week as well, with ADA and MATIC performing especially badly with double-digit losses on their 7-day charts. Is It Time To Buy The Blood? ‘Contrarian investing’ is a school of thought that suggests that the best time to get into an asset is when its price is falling and investors are scared to get into the market. This is explained by the popular investing saying that says “Buy when there is blood in the streets.” Total market cap still holding steady above $1 trillion &#124; Source: Crypto Total Market Cap on TradingView.com Given the current market trend, most assets in the space are in the red, and contrarian investing would suggest that this is the best time to start investing in the market. It is further solidified by the fact that the Crypto Fear &#38; Greed Index is moving back into the Fear territory, meaning fewer investors are willing to put money into the market right now. Related Reading: Bitcoin Miner Inflows To Exchanges Reach 2021 Levels As Bear Trend Persists If this does happen to be a local bottom, it would be a good point to buy cryptocurrencies as another bull rally from here could see Bitcoin reach as high as $35,000. This would mean a 50% increase for investors from here. As for the crypto market, it is still holding above the $1 trillion mark at this point, showing there is still some strength on the part of the buyers. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T17:00:22.000Z",
    "title": "Conflux (CFX) Retraces After 39% Gains In Seven Days, But Uwerx (WERX) Keeps Surging",
    "url": "https://www.crypto-news-flash.com/conflux-cfx-retraces-after-39-gains-in-seven-days-but-uwerx-werx-keeps-surging/?utm_source=rss&utm_medium=rss&utm_campaign=conflux-cfx-retraces-after-39-gains-in-seven-days-but-uwerx-werx-keeps-surging",
    "description": "Conflux (CFX) recently experienced a retracement after an impressive seven-day surge that resulted in a remarkable 39% gain. However, amidst this retraction, another cryptocurrency, Uwerx, defies expectations and surges forward. This article delves into the contrasting trajectories of these two digital assets, shedding light on the factors driving their movements and offering insights into potential [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T16:58:48.000Z",
    "title": "IOTA’s Biggest Builders Form BUILD.5, an Enterprise-Ready Web2 and Web3 Integration Platform for Seamless Innovation in Billion-Dollar Market",
    "url": "https://www.crypto-news-flash.com/iotas-biggest-builders-form-build-5-an-enterprise-ready-web2-and-web3-integration-platform-for-seamless-innovation-in-billion-dollar-market/?utm_source=rss&utm_medium=rss&utm_campaign=iotas-biggest-builders-form-build-5-an-enterprise-ready-web2-and-web3-integration-platform-for-seamless-innovation-in-billion-dollar-market",
    "description": "IOTA&#8217;s biggest builders have collaborated to create BUILD.5, a platform that facilitates the seamless transition from Web2 to Web3 for businesses. The native $BUILD token helps in addressing governance matters. The BUILD.5 platform, built on the IOTA L1 networks, offers a secure, scalable, and interoperable infrastructure for the next generation of applications. In the latest [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T16:48:12.000Z",
    "title": "ByBit Integrates ClearLoop to Provide Improved Infrastructure for Institutional Clients",
    "url": "https://www.crypto-news-flash.com/bybit-integrates-clearloop-to-provide-improved-infrastructure-for-institutional-clients/?utm_source=rss&utm_medium=rss&utm_campaign=bybit-integrates-clearloop-to-provide-improved-infrastructure-for-institutional-clients",
    "description": "ByBit is advancing its offerings to service institutional investors. One of its latest moves is the integration of Cooper&#8217;s ClearLoop network. ByBit, one of the fastest-growing cryptocurrency derivatives platforms, has successfully completed its integration of Cooper&#8217;s ClearLoop network. According to a Press Release shared with Crypto-News Flash, the integration provides clients with an off-exchange settlement [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-14T17:03:00.000Z",
    "title": "Crypto Analyst Presents Cardano (ADA) From a Long-Term Perspective",
    "url": "https://coinedition.com/crypto-analyst-presents-cardano-ada-from-a-long-term-perspective/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/CARDANO-5-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/CARDANO-5-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-5-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/CARDANO-5.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>According to Dan Gambardello, founder of Crypto Capital Venture, there is something in store for Cardano (ADA). However, he notes users need to zoom out on the Cardano chart and consider the total value locked (TVL) to uncover the potential of ADA. Gambardello explained his view using screenshots of the weekly chart on TradingView and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-analyst-presents-cardano-ada-from-a-long-term-perspective/\">Crypto Analyst Presents Cardano (ADA) From a Long-Term Perspective</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-14T16:55:48.000Z",
    "title": "Former SEC Official Says Binance Anticipating Criminal Prosecution After Hiring ‘All-Star’ Lawyer",
    "url": "https://dailyhodl.com/2023/06/14/former-sec-official-says-binance-anticipating-criminal-prosecution-after-hiring-all-star-lawyer/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/binance-criminal-lawyer-hiring.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/binance-criminal-lawyer-hiring.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/binance-criminal-lawyer-hiring.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/binance-criminal-lawyer-hiring.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/binance-criminal-lawyer-hiring.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/binance-criminal-lawyer-hiring.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/binance-criminal-lawyer-hiring.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A former high-ranking official of the U.S. Securities and Exchange Commission (SEC) thinks top global crypto exchange Binance is &#8220;clearly preparing&#8221; for criminal prosecution in the United States. John Reed Stark, who founded the SEC’s Office of Internet Enforcement and spent 11 years as its chief, points to the fact that Binance added George Canellos, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/14/former-sec-official-says-binance-anticipating-criminal-prosecution-after-hiring-all-star-lawyer/\">Former SEC Official Says Binance Anticipating Criminal Prosecution After Hiring ‘All-Star’ Lawyer</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]