[
  {
    "source": "Cointelegraph",
    "date": "2024-02-01T10:30:00.000Z",
    "title": " FCC Chair proposes outlawing AI robocalls ",
    "url": "https://cointelegraph.com/news/fcc-chair-proposes-outlawing-ai-robocalls",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZjIwYTRiNDMtZGEzMy00MmIzLTk0ZmYtMmNlMjc4ZTJhYmNlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The proposal by Chairwoman Jessica Rosenworcel aims to prohibit robocall scams under the Telephone Consumer Protection Act (TCPA), a 1991 law regulating automated political and marketing calls made without the receivers’ consent.</p>\n                    <p><p>The Federal Communications Commission (FCC) Chairwoman Jessica Rosenworcel has made a proposal considering calls featuring AI-generated voices as illegal, subject to the regulations and penalties outlined in the Telephone Consumer Protection Act (TCPA) in a Jan. 31 announcement. </p><p>The <a href=\"https://docs.fcc.gov/public/attachments/DOC-400212A1.pdf\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a> by the FCC Chairwoman follows a false message <a href=\"https://cointelegraph.com/news/ai-artificial-intelligence-deepfakes-fool-voters-politicians-2024-us-presidential-elections\">generated using artificial intelligence (AI) to imitate President Joe Biden’s voice</a>, advising New Hampshire residents against voting in the state’s primary election.</p><p>The automated messages featuring President Joe Biden's voice were generated to meddle in the 2024 presidential election. However, the state’s attorney general’s office denounced the calls as misinformation. </p><p><a href=\"https://cointelegraph.com/news/fcc-chair-proposes-outlawing-ai-robocalls\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-01T10:15:00.000Z",
    "title": " Bitcoin mining firm Core Scientific mined $812M worth of BTC in 2023 ",
    "url": "https://cointelegraph.com/news/bitcoin-miner-corescintific-812-m-worth-btc-2023",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNzAzMGZkMDMtNmNmZi00ODM2LWI1YjctOTk3NzY4ZDc2OTlhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Core Scientific, which filed its Chapter 11 bankruptcy plan in June 2023, emerged from bankruptcy on Jan. 27 and relisted its stock on the Nasdaq.</p>\n                    <p><p data-ct-non-breakable=\"true\">Core Scientific became North America’s largest publicly listed crypto mining company in 2023 after mining 19,274 Bitcoin worth $812 million.</p><p>In an X post on Jan. 31, the Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) mining giant revealed that it mined 13,762 Bitcoin across its data centers in the United States states of Georgia, Kentucky, North Carolina, North Dakota and Texas, while its customers and clients mined a total of 5,512 BTC in 2023, making it the largest Bitcoin miner in North America. The firm operates approximately 209,000 owned and co-located Bitcoin miners, with a total energized hash rate of 23.2 exahashes per second at its data centers in 2023.</p><p data-ct-non-breakable=\"true\">Bitcoin mining has grown into a commercial business model, given the rise in BTC prices over the years. Many private and public firms are mining BTC using hundreds of mining machines across multiple data centers.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-miner-corescintific-812-m-worth-btc-2023\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-01T10:37:34.000Z",
    "title": "The Impact of AI on SEO and Content Creation",
    "url": "https://www.cryptopolitan.com/the-impact-of-ai-on-seo-and-content-creation/",
    "description": "In a rapidly evolving digital landscape, Search Engine Optimization (SEO) remains a cornerstone of online visibility. However, the advent of Artificial Intelligence (AI) is ushering in a new era for SEO, prompting a reevaluation of content creation strategies. While some traditional SEO tactics still apply, AI-enabled marketing is transforming the way businesses approach SEO and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-01T10:27:53.000Z",
    "title": "Mastercard Unveils Groundbreaking Generative AI Model to Enhance Fraud Detection",
    "url": "https://www.cryptopolitan.com/mastercard-unveils-ai-for-fraud-detection/",
    "description": "Mastercard, a global leader in payment solutions, has unveiled a revolutionary generative artificial intelligence (AI) model aimed at bolstering fraud detection capabilities across its extensive network of banks. The newly launched &#8220;Decision Intelligence Pro&#8221; feature is poised to redefine the way financial institutions assess and combat suspicious transactions in real-time, potentially leading to a significant [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-01T10:26:47.000Z",
    "title": "Beyond Research: Here’s Why Singapore is Winning the AI Race",
    "url": "https://www.cryptopolitan.com/heres-why-singapore-is-winning-the-ai-race/",
    "description": "Singapore is playing a different game from other countries vying for the leading position in AI technology developments, and it wouldn’t be totally wrong to assume that the city-state is currently winning. Testbeds, Not Labs While many countries invest heavily in AI research and development, Singapore actively pursues practical, real-world uses of the technology in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-01T10:13:06.000Z",
    "title": "Kakao Healthcare Unveils Revolutionary AI-Based Blood Glucose Management App, PASTA",
    "url": "https://www.cryptopolitan.com/kakao-unveil-ai-blood-glucose-management-app/",
    "description": "In a landmark development for digital healthcare, Kakao Healthcare has introduced its inaugural service, &#8220;PASTA,&#8221; an advanced AI-powered mobile application for blood glucose management. Launched in Seongnam, Gyeonggi Province, at the Kakao Pangyo Agit, this innovative app significantly stride in the company&#8217;s mission to transform diabetes care. PASTA, an acronym for Personalized, Accessible, Supportive, Tech-enabled, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-01T10:30:50.000Z",
    "title": "Bitcoin Set For Weekend Rally Amid New Banking Crisis: Arthur Hayes",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-weekend-rally-new-banking-crisis-arthur-hayes/",
    "description": "Arthur Hayes, the founder of BitMEX, has offered an in-depth analysis of the current financial landscape and its potential impact on Bitcoin, especially in light of the recent challenges faced by New York Community Bancorp (NYCB) and the broader banking sector. Hayes&#8217;s analysis draws on the complex interplay between macroeconomic policies, banking sector health, and the cryptocurrency market. His comments are particularly insightful given the recent developments with NYCB. The bank&#8217;s stock plummeted by 46% due to an unexpected loss and a substantial dividend cut, which was primarily attributed to a tenfold increase in loan loss reserves, far exceeding estimates. This incident raised red flags about the stability and exposure of US regional banks, particularly in the real estate sector, which is known to be cyclically sensitive and vulnerable to economic downturns. The stock market reacted negatively to these developments, with regional US bank stocks also declining due to NYCB&#8217;s performance. Weekend Rally Ahead For Bitcoin? Hayes explicitly stated, “Jaypow [Jerome Powell] and Bad Burl Yellen [Janet Yellen] will be printing money very soon. NYCB annc a &#8216;surprise&#8217; loss driven by loan loss reserves rising 10x vs. estimates. Guess the banks ain&#8217;t fixed.” This comment underscores the persisting fragility of the banking sector, still reeling from the shocks of the 2023 banking crisis. He added, “10-yr and 2-yr yields plunged, signaling the market expects some sort of renewed bankster bailout to fix the rot.” Related Reading: Why “Overbought” Bitcoin Could Trigger A 107% Rally Furthermore, Hayes highlighted the impending conclusion of the Federal Reserve&#8217;s Bank Term Funding Program (BTFP), which was introduced in response to the 2023 banking crisis. The BTFP was a critical instrument in providing liquidity to banks, allowing them to use a wider range of collateral for borrowing. Hayes anticipates market turbulence leading to the Fed possibly reinstating the BTFP or introducing similar measures. In a recent statement, he noted, “If my forecast is correct, the market will bankrupt a few banks within that period, forcing the Fed into cutting rates and announcing the resumption of the BTFP.” This scenario, he argues, would create a liquidity injection that could buoy cryptocurrencies like Bitcoin​​. Related Reading: Billionaire Tim Draper’s Forecast: Bitcoin To Hit $250,000 By 2025 In his latest post on X, Hayes drew parallels to the cryptocurrency&#8217;s performance during the March 2023 banking crisis. He predicts a similar trajectory, suggesting a brief dip followed by a significant rally: Expect BTC to swoon a bit, but if NYCB and a few others dump into the weekend, expect a new bailout right quick. Then BTC off to the races just like March &#8217;23 price action. [&#8230;] I think it might be time to get back on the train fam. Maybe after a few US banks bite the dust this weekend. During the March crisis, Bitcoin’s value jumped over 40%, a reaction attributed to its perceived role as a digital gold or a safe-haven asset amid financial instability​​. On a longer time horizon and with the Great Financial Crisis from 2008 in mind, he further argued, “What did the Fed and Treasury do last time US property prices plunged and bankrupted banks globally? Money Printer Go Brrrr. BTC = $1 million. Yachtzee.” At press time, BTC traded at $42,232. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-01T10:19:48.000Z",
    "title": "Stellar’s Smart Contracts Debut: Protocol 20 Upgrade Set for Feb. 20",
    "url": "https://www.crypto-news-flash.com/stellars-smart-contracts-debut-protocol-20-upgrade-set-for-feb-20/?utm_source=rss&utm_medium=rss&utm_campaign=stellars-smart-contracts-debut-protocol-20-upgrade-set-for-feb-20",
    "description": "<img width=\"2400\" height=\"1300\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Stellar.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Stellar.jpg 2400w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Stellar-300x163.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Stellar-1200x650.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Stellar-768x416.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Stellar-1536x832.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Stellar-2048x1109.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Stellar-150x81.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Stellar-450x244.jpg 450w\" sizes=\"(max-width: 2400px) 100vw, 2400px\" />Stellar has teased February 20 as the date to activate its smart contract Soroban upgrade. With the upgrade, the protocol will seek to give close competition to Ethereum as a DeFi hub. The Stellar Development Foundation (SDF) has announced in a post on X that the Protocol 20 upgrade, billed to introduce smart contracts to [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-01T10:15:07.000Z",
    "title": "Analyst Michaël van de Poppe Forecasts 90% Rally for Top-20 Ethereum-Based Altcoin, Updates Outlook on Bitcoin",
    "url": "https://dailyhodl.com/2024/02/01/analyst-michael-van-de-poppe-forecasts-90-rally-for-top-20-ethereum-based-altcoin-updates-outlook-on-bitcoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/Poppe-Forecasts-90-Rally.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/Poppe-Forecasts-90-Rally.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2024/01/Poppe-Forecasts-90-Rally.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/Poppe-Forecasts-90-Rally.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/Poppe-Forecasts-90-Rally.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/Poppe-Forecasts-90-Rally.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2024/01/Poppe-Forecasts-90-Rally.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed cryptocurrency analyst and trader believes that one top 20 altcoin project is primed to move another leg up. Michaël van de Poppe tells his 692,300 followers on the social media platform X that the decentralized oracle network Chainlink (LINK) could increase about 90% from its current value. “Chainlink is still stuck in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/01/analyst-michael-van-de-poppe-forecasts-90-rally-for-top-20-ethereum-based-altcoin-updates-outlook-on-bitcoin/\">Analyst Michaël van de Poppe Forecasts 90% Rally for Top-20 Ethereum-Based Altcoin, Updates Outlook on Bitcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]