[
  {
    "source": "Decrypt",
    "date": "2024-02-12T23:50:51.000Z",
    "title": "Pixels Founder: Why PIXEL Token Launch Feels Like 'Day One' for Ronin Game",
    "url": "https://decrypt.co/videos/interviews/E9zZ9yHc/pixels-founder-why-pixel-token-launch-feels-like-day-one-for-ronin-game",
    "description": "Luke Barwikowski, founder of farming game Pixels on Ronin, joins Decrypt Culture Editor Andrew Hayward to discuss the incoming launch of the PIXEL token and why he sees it as such a turning point for the rising blockchain game."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-13T00:00:29.000Z",
    "title": "Solana hits 100k preorders for second mobile device, five times original production",
    "url": "https://cryptoslate.com/solana-hits-100k-preorders-for-second-mobile-device-five-times-original-production/",
    "description": "<p>Solana Mobile said in a Feb. 12 announcement that it has attained 100,000 preorders for its upcoming &#8220;Chapter 2&#8221; mobile device. The firm said that those 100,000 preorders occurred over less than 30 days, noting that this number means that the early preorder price ($450) will end in 48 hours. Solana Mobile&#8217;s website adds that [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/solana-hits-100k-preorders-for-second-mobile-device-five-times-original-production/\">Solana hits 100k preorders for second mobile device, five times original production</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-13T00:00:58.000Z",
    "title": "CryptoQuant Founder Puts $112,000 Target For Bitcoin This Year",
    "url": "https://www.newsbtc.com/bitcoin-news/cryptoquant-founder-112000-target-bitcoin-year/",
    "description": "The founder of on-chain analytics firm CryptoQuant has said Bitcoin could reach a target of $112,000 this year driven by the ETF inflows. Bitcoin May Hit $112,000 Based On Inflows Into The ETFs In a new post on X, CryptoQuant CEO and founder Ki Young Ju talked about the outlook of the cryptocurrency based on the inflows going towards the spot exchange-traded funds (ETFs). The analyst has used the &#8220;Realized Cap&#8221; indicator to find price targets for the coin. The Realized Cap refers to a capitalization model for Bitcoin that calculates the total valuation of the asset by assuming that the real value of any coin in circulation is the price at which it was last transacted on the blockchain. Related Reading: Dogecoin Out Of Fashion? Volume &#38; Whale Activity Plunges If the previous transaction of any token is assumed to have involved a change of hands for it (that is, buying and selling took place), then the last transfer price would correspond to the cost basis of the coin. As the Realized Cap essentially adds up the cost basis of all the investors, one way to look at the metric is as a measure of the total amount of investment the holders have put into the coin. Naturally, the Realized Cap pushes up as trades occur at a higher spot price. Something that could be particularly influential for the Realized Cap this cycle may be the spot ETF inflows. The spot ETFs, which finally got approval from the US Securities and Exchange Commission (SEC) last month, have been buying up Bitcoin at relatively high prices to add to their holdings, thus elevating the Realized Cap. The chart below shows the data for the holdings of the spot ETFs and the Bitcoin Realized Cap. The trend in the spot ETF holdings and BTC Realized Cap &#124; Source: @ki_young_ju on X &#8220;Bitcoin market has seen $9.5B in spot ETF inflows per month, potentially boosting the realized cap by $114B yearly,&#8221; explains Ju. &#8220;Even with $GBTC outflows, a $76B rise could elevate the realized cap from $451B to $527-565B.&#8221; The Market Value to Realized Value (MVRV) ratio may provide some hints regarding how the Realized Cap could be relevant for the spot price. This indicator tracks the BTC Market Cap and the Realized Cap ratio. &#8220;Historically, BTC market bottoms occur at an MVRV of 0.75 and tops at 3.9,&#8221; notes the CryptoQuant founder. Based on this fact, the table below shows that ceiling and floor prices can be defined for the asset. The trend in the ceiling and floor prices for BTC based on the Realized Cap &#124; Source: @ki_young_ju on X As the spot ETF inflows continue to come in, the Realized Cap will only push further up, and the potential ceiling of the cryptocurrency will also thus increase. Zoomed in view of the price ceiling and floor &#124; Source: @ki_young_ju on X &#8220;With current spot ETF inflow trends, the top price could reach $104k-$112k,&#8221; says the CryptoQuant CEO. &#8220;Without hype, maintaining the current level of 2.07, the price would be $55-59k.&#8221; Related Reading: Bitcoin Flies Above $47,300, But Watch Out For Extreme Greed In the best-case scenario, if Bitcoin had reached the $112,000 target, the cryptocurrency would have jumped more than 126% from the current spot price. BTC Price At the time of writing, Bitcoin is trading at around $49,400, up over 15% in the past week. Looks like the price of the coin has shot up over the past day &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, CryptoQuant.com"
  }
]