[
  {
    "source": "Decrypt",
    "date": "2023-06-12T18:42:32.000Z",
    "title": "Binance Suspends a Dozen Ethereum, BNB Token Trading Pairs",
    "url": "https://decrypt.co/144255/binance-suspends-ethereum-bnb-busd-trading-pairs",
    "description": "Binance ended trading for more than a dozen pairs including its native BNB token, the defunct Binance USD (BUSD) stablecoin, and five involving ETH."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-12T18:50:17.000Z",
    "title": "US, UK lawmakers to hear arguments around crypto regulations on June 13",
    "url": "https://cryptoslate.com/us-uk-lawmakers-to-hear-arguments-around-crypto-regulations-on-june-13/",
    "description": "<p>As the cryptocurrency industry faces regulatory headwinds, lawmakers in the United States and the United Kingdom are set to bring the discussion into the public sphere. On June 13, both nations will host high-profile hearings, marking a pivotal moment in the ongoing debate over digital asset regulation. The U.K. Parliament will debate the findings of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/us-uk-lawmakers-to-hear-arguments-around-crypto-regulations-on-june-13/\">US, UK lawmakers to hear arguments around crypto regulations on June 13</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-12T19:02:36.000Z",
    "title": "Bank of China Tokenises Securities on Ethereum",
    "url": "https://cryptodaily.co.uk/2023/06/bank-of-china-tokenises-securities-on-ethereum",
    "description": "<p>The Bank of China (BOCI) has made history by issuing tokenised securities on the Ethereum blockchain in Hong Kong.&nbsp;</p>\n<p>This revolutionary development signifies a significant stride forward in the adoption of decentralised finance and highlights Hong Kong's efforts to attract major players in the cryptocurrency industry, including Coinbase.&nbsp;</p>\nTokenised Securities: Pioneering a New Era in Finance\n<p>The Bank of China's decision to issue tokenized securities on the Ethereum blockchain is a bold testament to the institution's acknowledgment of the tremendous potential of blockchain technology.&nbsp;</p>\n<p>By harnessing the smart contract capabilities of Ethereum, BOCI aims to amplify the efficiency, transparency, and accessibility of traditional securities. Tokenisation paves the way for fractional ownership, heightened liquidity, and streamlined settlement processes, ushering in a revolutionary approach to trading, selling, and purchasing assets.</p>\nHong Kong's Crypto-Friendly Stance\n<p>Hong Kong's ambitions to establish itself as a global hub for digital assets and cryptocurrencies have taken a significant leap forward with the Bank of China's introduction of tokenised securities. This milestone aligns seamlessly with the city's concerted efforts to allure leading cryptocurrency exchanges, with Coinbase expressing its interest in expanding its footprint in the region.&nbsp;</p>\n<p>Hong Kong's proactive approach to embracing digital innovation and its regulatory framework, striking a balance between investor protection and industry growth, positions it as a potential destination for companies operating in the crypto space.</p>\nUnprecedented Accessibility and Enhanced Liquidity\n<p>By tokenising securities on the Ethereum blockchain, the Bank of China paves the way for investors, both institutional and retail, to access traditional financial assets with newfound ease and flexibility.&nbsp;</p>\n<p>Tokenisation empowers fractional ownership, allowing investors to buy and trade smaller portions of high-value assets, thereby rendering previously illiquid investments more accessible. This democratisation of investment opportunities has the potential to revolutionise financial markets, expanding participation and fostering financial inclusion.</p>\nAdvancing Blockchain Adoption\n<p>The Bank of China's pioneering initiative to issue tokenized securities represents a substantial stride in the adoption of blockchain technology within the conventional financial system. As a prominent financial institution, BOCI's embrace of blockchain validates its transformative potential to reshape the global financial landscape.&nbsp;</p>\n<p>This progressive move is poised to inspire other institutions to explore the utility of blockchain and cryptocurrencies, propelling further innovation and nurturing a more inclusive and efficient financial ecosystem.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-12T18:45:01.000Z",
    "title": "Huobi Mid-Year Conference: Building a Web3 Finance Hub in the Metaverse",
    "url": "https://cryptodaily.co.uk/2023/06/huobi-mid-year-conference-building-a-web3-finance-hub-in-the-metaverse",
    "description": "<p>The, Caribbean, June 12th, 2023, Chainwire</p><p>Recently, Huobi held its mid-year conference to review the overall progress from the first half of 2023 including a development plan for the second half of the year. H.E. Justin Sun, a member of the Huobi Advisory Board, shared his unique insights into the development of the blockchain industry.</p><p class=\"ql-align-center\">&nbsp;</p><p>&nbsp;</p><p>Becoming a Household Name</p><p>Huobi and Poloniex witnessed a significant improvement in operational performance during Q2 compared to Q1 2023. This can be attributed to various factors, including the meme coin frenzy and the regulatory crackdown on other exchanges.</p><p>However, in terms of total on-chain assets, Huobi and Poloniex equated to $4 billion which falls behind Binance's $60 billion and OKX's $10 billion.&nbsp;</p><p>Huobi stated that in the next six months, it will continue to restore its brand confidence, increase platform assets and trading volume, and achieve profitability targets. It aims to become a stronger player and a household name within the cryptocurrency exchange industry.</p><p>With months of cost reduction and efficiency improvement efforts, Huobi has overcome survival challenges and will make future decisions based on long-term perspectives. Huobi is committed to actively embracing the ever-changing crypto industry and prioritizing user needs. The company firmly doesn&rsquo;t believe in sacrificing user interests for short-term gains. The focus will be on constantly creating value for users while achieving greater business wins.</p><p>&nbsp;</p><p>Crypto Market's Three Pillars: Exchange, Public Chain, and Stablecoin</p><p>&nbsp;</p><p class=\"ql-align-center\">&nbsp;</p><p>&nbsp;</p><p>Sun expressed that Huobi has always been following their global compliance strategy by actively embracing regulation and exploring diverse compliance operations. Numerous crypto companies are entering the Hong Kong market because of its new regulatory rules. Huobi is gaining exposure in the Hong Kong crypto market by launching Huobi Hong Kong, which allowed registration for Hong Kong residents on June 1 2023. Huobi is also the first exchange to become a member of the Hong Kong Virtual Asset Consortium (HKVAC). Additionally, Huobi is in continuous communication with the Hong Kong government to apply for a cryptocurrency exchange license.</p><p>Sun analyzed that exchanges, public chains, and stablecoins will become the main core of the entire blockchain industry. These three pillars for the decentralized financial landscape will influence long-time development in the industry. Sun stated that their mission is to build a Web3 finance hub in the metaverse and give an option to people worldwide to pursue financial freedom in the metaverse. Public chains serve as the foundation for creating a financial world in the metaverse, while exchanges play a crucial role as the gatekeepers.</p><p>Sun believes that Huobi holds a leading position within the industry. However, in terms of integration capabilities, Huobi stands out as the sole decentralized financial ecosystem platform with a structure encompassing all three pillars mentioned earlier. The three core businesses consisting of exchanges, public chains, and stablecoins will strive to enhance the user experience from multiple angles. It focuses on long-term industry development, covering the majority of industry traffic, and building a globally influential Web3 financial hub.</p><p></p><p>About Huobi</p><p>Founded in 2013, Huobi has evolved from a crypto exchange into a comprehensive ecosystem of blockchain businesses that span digital asset trading, financial derivatives, wallets, research, investment, incubation and other areas. Huobi serves millions of users worldwide, with a business presence covering over 160 countries and regions across five continents. Its three development strategies - \"global development, technology drives development, and technology for good\" - underpin its commitment to providing comprehensive services and values to global cryptocurrency enthusiasts.</p>ContactMichael Wangglo-media@huobi.com"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T19:08:25.000Z",
    "title": "Breaking: Bill filed to remove SEC Chair Gary Gensler",
    "url": "https://www.cryptopolitan.com/bill-filed-to-remove-sec-chair-gary-gensler/",
    "description": "U.S. Congressman Warren Davidson has set the wheels in motion for a bill that could transform the country&#8217;s Securities and Exchange Commission (SEC) landscape and lead to the ousting of current Chair, Gary Gensler. If enacted, the &#8220;SEC Stabilization Act&#8221; would mark a significant turn in the trajectory of financial regulation in the U.S. A ... <a title=\"Breaking: Bill filed to remove SEC Chair Gary Gensler\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bill-filed-to-remove-sec-chair-gary-gensler/\" aria-label=\"More on Breaking: Bill filed to remove SEC Chair Gary Gensler\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T18:58:55.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution that has gained popularity recently among Ethereum users for ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T18:44:17.000Z",
    "title": "Huobi Mid-Year Conference: Building a Web3 Finance Hub in the Metaverse",
    "url": "https://www.cryptopolitan.com/huobi-mid-year-conference-building-a-web3-finance-hub-in-the-metaverse/",
    "description": "The, Caribbean, June 12th, 2023, Chainwire Recently, Huobi held its mid-year conference to review the overall progress from the first half of 2023 including a development plan for the second half of the year. H.E. Justin Sun, a member of the Huobi Advisory Board, shared his unique insights into the development of the blockchain industry. ... <a title=\"Huobi Mid-Year Conference: Building a Web3 Finance Hub in the Metaverse\" class=\"read-more\" href=\"https://www.cryptopolitan.com/huobi-mid-year-conference-building-a-web3-finance-hub-in-the-metaverse/\" aria-label=\"More on Huobi Mid-Year Conference: Building a Web3 Finance Hub in the Metaverse\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-12T19:00:28.000Z",
    "title": "Polygon, Solana, and Polkadot Are Fast-Plunging, DigiToads Is The Refuge For Investors",
    "url": "https://nulltx.com/polygon-solana-and-polkadot-are-fast-plunging-digitoads-is-the-refuge-for-investors/",
    "description": "With DigiToads (TOADS) market demand exploding while still in its presale phase, experts suggest investors bag this meme token to strengthen their crypto portfolio. In today’s fluctuating crypto market, most top crypto coins that made their name strong consistently struggle to regain their position. Polygon, Solana, and Polkadot are among some of the best cryptos [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T18:45:19.000Z",
    "title": "Bitcoin, Cardano, and CryptoCurrency forums on Reddit limit access, protest API changes",
    "url": "https://crypto.news/bitcoin-cardano-and-cryptocurrency-forums-on-reddit-limit-access-protest-api-changes/",
    "description": "Bitcoin, Cardano, and CryptoCurrency, three of the largest crypto-centric subreddits, are joining other popular forums on Reddit to protest against planned API and tools policy changes."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T18:57:53.000Z",
    "title": "Shiba Inu Set to Conquer the Metaverse: Rocket Pond Unveiled, SHIB Metaverse Soars, and Shibarium Mainnet Beckons, Sending SHIB Price Towards $0.001",
    "url": "https://www.crypto-news-flash.com/shiba-inu-set-to-conquer-the-metaverse-rocket-pond-unveiled-shib-metaverse-soars-and-shibarium-mainnet-beckons-sending-shib-price-towards-0-001/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-set-to-conquer-the-metaverse-rocket-pond-unveiled-shib-metaverse-soars-and-shibarium-mainnet-beckons-sending-shib-price-towards-0-001",
    "description": "SHIB army awaits the launch of groundbreaking projects as an update of Rocket Pond is released. Shiba Inu&#8217;s price is still struggling. Shiba Inu has been working tirelessly to transcend the meme tag to be recognized as a more technically efficient project with real-world use cases. Months ago, the Shibarium testnet was launched and is [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T18:49:23.000Z",
    "title": "BRICS Ministers Declare Global Rebalancing in Motion, Bitcoin Emerges as Catalyst for Change",
    "url": "https://www.crypto-news-flash.com/brics-ministers-declare-global-rebalancing-in-motion-bitcoin-emerges-as-catalyst-for-change/?utm_source=rss&utm_medium=rss&utm_campaign=brics-ministers-declare-global-rebalancing-in-motion-bitcoin-emerges-as-catalyst-for-change",
    "description": "The BRICS group is set to establish a new world currency and reduce its dependency on the U.S. dollar. Although it&#8217;s unlikely that this group of countries adopt Bitcoin, it has emerged as a catalyst for change. Countries are waking up to the realization of their over-dependence on the U.S. dollar. A new group of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T18:45:34.000Z",
    "title": "Huobi Mid-Year Conference: Building a Web3 Finance Hub in the Metaverse",
    "url": "https://www.crypto-news-flash.com/huobi-mid-year-conference-building-a-web3-finance-hub-in-the-metaverse/?utm_source=rss&utm_medium=rss&utm_campaign=huobi-mid-year-conference-building-a-web3-finance-hub-in-the-metaverse",
    "description": "The, Caribbean, June 12th, 2023, Chainwire Recently, Huobi held its mid-year conference to review the overall progress from the first half of 2023 including a development plan for the second half of the year. H.E. Justin Sun, a member of the Huobi Advisory Board, shared his unique insights into the development of the blockchain industry. [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-12T18:45:07.000Z",
    "title": "Decentralized Exchanges See Spike in Market Share Amid Regulatory Uncertainty in the US: IntoTheBlock",
    "url": "https://dailyhodl.com/2023/06/12/decentralized-exchanges-see-spike-in-market-share-amid-regulatory-uncertainty-in-the-us-intotheblock/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/exchange-pulls-in-round.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/exchange-pulls-in-round.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/exchange-pulls-in-round.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/exchange-pulls-in-round.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/exchange-pulls-in-round.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/exchange-pulls-in-round.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/exchange-pulls-in-round.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New data from on-chain intelligence firm IntoTheBlock finds that decentralized exchanges (DEXs) are seeing a rise in market share while a regulatory offensive develops in the US. According to a new report from the firm, the U.S. Securities and Exchange Commission&#8217;s (SEC) charges against Binance and Coinbase for alleged securities violations last week are likely [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/12/decentralized-exchanges-see-spike-in-market-share-amid-regulatory-uncertainty-in-the-us-intotheblock/\">Decentralized Exchanges See Spike in Market Share Amid Regulatory Uncertainty in the US: IntoTheBlock</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]