[
  {
    "source": "Crypto Daily",
    "date": "2023-06-19T16:57:17.000Z",
    "title": "Reports Indicate Venezuela Might Shut Down Its National Crypto",
    "url": "https://cryptodaily.co.uk/2023/06/reports-indicate-venezuela-might-shut-down-its-national-crypto",
    "description": "<p>Reports indicate that the Venezuelan government may be shutting down its national cryptocurrency, the petro. </p>\n<p>The government of Venezuela could be winding down its petro cryptocurrency after members of Sunacrip, the country&rsquo;s crypto watchdog, were found to be involved in a corruption scheme.</p>\n<p>Reports by Bloomberg Linea indicate that it could be the end of Venezuela&rsquo;s national oil-backed cryptocurrency, the petro. Three persons linked with the country&rsquo;s crypto regulator said the petro would be liquidated five years after issuance.</p>\n<p>Bitcoin.com first shared the news and reported that the decision was made as part of Sunacrip&rsquo;s restructuring. The decision reportedly also includes liquidating the debts contracted with big petro holders, including department stores that decided to accept petro as a payment method.</p>\n<p>The decision to restructure Sunacrip came after its head Joselit Ramirez was arrested in March on corruption charges. Venezuelan president Nicolas Madura removed Ramirez from his position for allegedly participating in a plan to steal from the country&rsquo;s oil operations.</p>\n<p>Soon after news of Ramirez&rsquo;s alleged involvement in corruption came to light, energy suppliers across the country shut down various crypto-mining operations. Local media reports and&nbsp;tweets&nbsp;from Venezuela&rsquo;s National Association of Cryptocurrencies indicate that crypto mining facilities were shut down in the states of Carabobo, Bolivar, and Lara. Numerous crypto exchanges were also&nbsp;ordered&nbsp;to cease their activities.&nbsp;</p>\n<p>The petro was introduced in 2018 as a way to sidestep sanctions imposed by the Trump and Obama administrations and has largely been viewed as a failure. The introduction of an oil-backed national crypto was met with scepticism from global leaders, and former US president Donald Trump banned US investors from trading in petro.</p>\n<p>Introduced amid a financial crisis, Venezuela no longer lists the petro as a currency. When introducing the petro, the Maduro administration permitted several crypto exchanges to operate in the country, introducing Venezuelans to cryptocurrencies as an alternative to their declining currency.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-19T17:00:50.000Z",
    "title": "B2Broker Announces NDF Asset Class Addition, Reduced Margin Requirements, and Updates to PoP Liquidity Offering Package",
    "url": "https://news.bitcoin.com/b2broker-announces-ndf-asset-class-addition-reduced-margin-requirements-and-updates-to-pop-liquidity-offering-package/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/eereq-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/eereq-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/eereq-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/eereq-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/eereq-1536x864.png 1536w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/eereq-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/eereq-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/eereq-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/eereq-1520x855.png 1520w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/eereq-1280x720.png 1280w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/eereq.png 1600w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. B2Broker, a prominent global liquidity provider in the FX and crypto industry, proudly declares the inclusion of Non-Deliverable Forwards (NDFs) in its extensive range of liquidity offerings. This strategic expansion further strengthens the company&#8217;s commitment to furnishing comprehensive asset coverage and unparalleled risk management solutions for all B2Broker customers. As a multi-asset liquidity [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-19T17:00:00.000Z",
    "title": "MEMEVENGERS moves closer to web3 with listing and NFT membership",
    "url": "https://crypto.news/memevengers-moves-closer-to-web3-with-listing-and-nft-membership/",
    "description": "MEMEVENGERS (MMVG) is a meme coin inspired by Avengers, the movie. The project will launch an NFT membership service and its token will launch on several cryptocurrency exchanges"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-19T17:00:09.000Z",
    "title": "Report: Do Kwon Refutes Passport Forgery Claims, Shifts Blame To ‘Chinese’ Agency",
    "url": "https://www.newsbtc.com/crypto/report-do-kwon-refutes-passport-forgery-claims-shifts-blame-to-chinese-agency/",
    "description": "The Terraform founder Do Kwon, facing eight count charges in the United States for the ecosystem crash, recently denied two allegations against him. Do Kwon was accused of traveling with forged documents and sending financial donations to a former Montenegro minister. But according to a South Korean media, Segye’s report, Do Kwon told the Montenegrin Basic Court that he received his travel documents from a Chinese agency and wasn’t aware they were forged. Kwon also denies sending financial donations to the current leader of the Europe Now party Milojko Spajic, during his tenure as the Montenegro finance minister.  Do Kwon Denies Forging Documents During his arrest in March 2023, the Montenegro authorities announced that Do Kwon was traveling with fake documents. A Twitter account of the European country&#8217;s Interior Minister, Filip Adzic, wrote;  The person is suspected of being one of the most wanted fugitives, South Korean national Do Kwon, a co-founder and CEO of the Singapore-based Terraform Labs. Related Reading: Shiba Inu (SHIB) Burn Rate Suffers 87% Decline In Single Week Adzic also added: The former cryptocurrency king, who is behind losses of over $40 billion, has been apprehended at the Podgorica airport with forged documents. However, Do Kwon has denied forging his traveling documents and passports, including his Costa Rican passport.  Instead, he blamed a Singaporean agency stating: I received my Costa Rica passport after filling in the documents required by a Singaporean agency that was recommended to me by a friend. I received my Belgian passport through another agency. Do Kwon also stated that he hadn&#8217;t doubted the authenticity of his travel documents since they’d been with him for many years. Regarding the Singaporean agency that supposedly issued the document, the Terraform founder stated he couldn&#8217;t remember the exact name but only knew it was written &#8220;in Chinese.&#8221;  Terraform Founder Denies Sending Funds to Montenegro&#8217;s Former Finance Minister The second allegation Do Kwon denied was about sending payments to the former finance minister of Montenegro, Milojko Spajic, the current Europe Now party leader.  On June 17, a Radio Free Europe regional arm reported that Do Kwon allegedly contacted Spajic through a letter he sent to many officials in Montenegro before the country&#8217;s last elections. But during the court hearing, Do Kwon&#8217;s lawyers stated this is categorically denied and it is not true. Apart from Do Kwon’s lawyers, the former finance minister also denied having anything to do with the Terraform founder. However, on June 6, a Montenegro news outlet Balkinsight reported that the country’s outgoing prime minister urged the prosecutors to investigate the relationship between Kwon and Spajic.  Also, on June 9, a Twitter account FatMan, dedicated to updating the crypto community about Terra issues, shared an update about Do Kwon’s financial donations to Spajic. The Terraform founder has, however, denied the ties in the recent hearing. Following the court session, the presiding judge Ivana Becic announced that June 19 would be the date for a verdict on the forgery charges.  Meanwhile, Do Kwon will remain in extradition custody for six months waiting for the court to grant or reject the South Korean extradition request. Featured image from Pixabay and chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-19T16:55:55.000Z",
    "title": "Binance Comes to Agreement With SEC Following Attempt To Freeze Crypto Exchange’s Assets",
    "url": "https://dailyhodl.com/2023/06/19/binance-comes-to-agreement-with-sec-following-attempt-to-freeze-crypto-exchanges-assets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/binance-expands-trading-operations.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/binance-expands-trading-operations.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/binance-expands-trading-operations.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/binance-expands-trading-operations.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/binance-expands-trading-operations.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/binance-expands-trading-operations.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/binance-expands-trading-operations.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Binance has come to an agreement with the U.S. Securities and Exchange Commission (SEC) after the regulator attempted to freeze the American arm of the firm&#8217;s assets. In a new court filing, the SEC has agreed to a proposal that lets Binance.US maintain sole possession of its customers’ assets. “It is further ordered that on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/19/binance-comes-to-agreement-with-sec-following-attempt-to-freeze-crypto-exchanges-assets/\">Binance Comes to Agreement With SEC Following Attempt To Freeze Crypto Exchange’s Assets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]