[
  {
    "source": "Decrypt",
    "date": "2023-08-12T16:01:00.000Z",
    "title": "Why the MET Is Expanding Into the Metaverse With Roblox",
    "url": "https://decrypt.co/152282/the-met-metropolitan-museum-roblox-replica-quest",
    "description": "The Metropolitan Museum has launched a quest based app and installed a virtual doppelgänger on the Roblox gaming platform to meet young visitors where they are. "
  },
  {
    "source": "Decrypt",
    "date": "2023-08-12T15:43:10.000Z",
    "title": "Chatbot Makers Respond to Accusations That AI Promotes Eating Disorders",
    "url": "https://decrypt.co/152276/chatbot-makers-respond-to-accusations-that-ai-promotes-eating-disorders",
    "description": "The Center for Countering Digital Hate tested the safety guardrails of popular chatbots and found them lacking."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-12T15:56:25.000Z",
    "title": "SEC v. Ripple: Legal Expert Foresees SEC’s Interlocutory Appeal Facing Challenges",
    "url": "https://www.cryptoglobe.com/latest/2023/08/sec-v-ripple-legal-expert-foresees-secs-interlocutory-appeal-facing-challenges/",
    "description": "In a significant legal development from July 13, 2023, the U.S. Securities and Exchange Commission (SEC) faced a mixed outcome in its lawsuit against Ripple Labs Inc. and its top executives, Bradley Garlinghouse and Christian A. Larsen. The lawsuit, initiated in December 2020, alleged that Ripple and its leaders had unlawfully offered and sold XRP […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-12T15:56:22.000Z",
    "title": "Nvidia’s Valuation Surge to Balance AI Optimism and Investor Caution",
    "url": "https://www.cryptopolitan.com/nvidias-valuation-surge-balance-ai-optimism/",
    "description": "As the fervor around AI, reinvigorated by innovations like ChatGPT, dispels the &#8220;tech winter&#8221; that cast a shadow over U.S. stocks at the end of the previous year, the tech sector is staging a remarkable comeback, emerging as the driving force behind U.S. stock indices. Notably, Nvidia, often hailed as the &#8220;sole arms dealer of ... <a title=\"Nvidia&#8217;s Valuation Surge to Balance AI Optimism and Investor Caution\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nvidias-valuation-surge-balance-ai-optimism/\" aria-label=\"More on Nvidia&#8217;s Valuation Surge to Balance AI Optimism and Investor Caution\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-12T15:55:50.000Z",
    "title": "New financial documents show Trump capitalizing on NFT boom, holding up to $500k in Ethereum",
    "url": "https://www.cryptopolitan.com/new-financial-documents-show-trump-capitalizing-on-nft-boom-holding-up-to-500k-in-ethereum/",
    "description": "Donald Trump, the 45th President of the United States, has changed his tune. New financial documents that paint a different picture have surfaced: Trump holds a substantial amount of cryptocurrency, closely tied to a highly profitable NFT venture. According to the latest financial filings, Trump&#8217;s Ethereum-related cryptocurrency wallet boasts an impressive sum. It holds between ... <a title=\"New financial documents show Trump capitalizing on NFT boom, holding up to $500k in Ethereum\" class=\"read-more\" href=\"https://www.cryptopolitan.com/new-financial-documents-show-trump-capitalizing-on-nft-boom-holding-up-to-500k-in-ethereum/\" aria-label=\"More on New financial documents show Trump capitalizing on NFT boom, holding up to $500k in Ethereum\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-12T15:40:56.000Z",
    "title": "Crypto scams on Twitter led to $872k in losses a year, new study finds",
    "url": "https://www.cryptopolitan.com/crypto-scams-on-twitter-led-to-872k-losses/",
    "description": "A new study has revealed that crypto scams made off with over $800,000 in one year by taking advantage of Twitter&#8217;s list feature to promote fake cryptocurrency giveaways. Crypto scams on Twitter led to over $872,000 in losses, according to the study conducted by researchers at San Diego State University. The researchers developed a system ... <a title=\"Crypto scams on Twitter led to $872k in losses a year, new study finds\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-scams-on-twitter-led-to-872k-losses/\" aria-label=\"More on Crypto scams on Twitter led to $872k in losses a year, new study finds\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-12T15:50:53.000Z",
    "title": "Crypto Analyst Shares Bullish Insights On Chainlink As Users Accumulate 295 Million LINK",
    "url": "https://www.newsbtc.com/analysis/link/crypto-analyst-shares-bullish-insights-on-chainlink-as-users-accumulate-295-million-link/",
    "description": "Chainlink (LINK) has been one of the top trending tokens in recent weeks due to a combination of an overall positive price movement as well as exciting on-chain developments.  Following a recent buying spree in the LINK market, crypto analyst Ali Martinez has taken to social media platform X, providing some insights on the token’s potential price action. Related Reading: LINK Price Prediction: Chainlink Turns Attractive On Dips 29,000 Wallets Purchase 295 Million LINK Forming Major Support Level On August 11, Ali posted on X stating that Chainlink has established a strong support zone between $6.63 and $6.88 as about 29,000 addresses purchased over 295 million LINK at this price range based on data from analytics firm IntoTheBlock. Moving on, he postulated that as long as the altcoin was trading above this price zone, investors were likely to continuously remain bullish, especially as Soon-chain data shows that there are no significant resistance levels ahead.  Source: IntoTheBlock According to Ali, a good number of LINK whales have already recognized the $6.63-6.88 zone as “robust” price support and are actively accumulating more tokens. He highlighted that in the past 14 days, LINK whales have purchased an estimated 13 million LINK worth around $91 million.  However, while these developments may be considered indications of a bullish LINK market, Ali states that traders anticipating a market breakout may still need to exercise some patience. Using data from IntoTheBlock, the crypto analyst draws attention to the declining network activity on the Chainlink network in the last three weeks.  Ali stated that during this period, the number of large LINK transactions had gone down from 527 to 118. He concluded his market report by stating a boost in this metric is likely to precede any market breakout. At the time of writing, LINK is exchanging hands at $7.44, with a 1.36% decline in the last day, according to data from CoinMarketCap. However, the token is up 3.66% and 17.67% in the last seven and thirty days, respectively. Related Reading: Chainlink (LINK) Holds Above 14% Gains As Crypto Market Slumps Heavily More Good News For Chainlink Aside from Ali’s market analysis, there has been other positive news about Chainlink in recent days. Also, on August 11, market intelligence firm Santiment reported LINK had experienced its highest level of dormant coin movements in the last six weeks. According to Santiment, this represented a decline in LINK’s mean dollar invested age curve, pointing to a decrease in the token’s time in wallets which is usually a precursor for a rise in market cap. In addition, Chainlink has maintained a rise in its development activity over the last few months. Based on data from Santiment, development activity on Chainlink went up from 1579.12 on May 31 to 1706.48 on August 3.  LINK trading at $7.432 on the daily chart &#124; Source: LINKUSD chart on Tradingview.com Featured image from Stockhead, chart from Tradingview"
  }
]