[
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T16:55:00.000Z",
    "title": "Dogecoin investors accuse Elon Musk of insider trading in amended class-action lawsuit",
    "url": "https://cointelegraph.com/news/dogecoin-investors-accuse-elon-musk-of-insider-trading-in-amended-class-action-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/40fde688-960e-48d8-a7fe-67ba55b0df5c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>“This is a securities fraud class action arising from a deliberate course of carnival barking market manipulation and insider trading,\" said the amended complaint.</p>\n                    <p><p>A group of Dogecoin investors has requested leave to amend a class-action lawsuit against soon-to-be former chief executive officer of Twitter <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/elon-musk-and-crypto-twitter\">Elon Musk</a>, alleging he manipulated the price of the meme token.</p><p>In a May 31 filing in United States District Court for the Southern District of New York, the investors claimed Musk used his social media following on Twitter <a href=\"https://cointelegraph.com/news/dogefather-elon-musk-jokingly-calls-token-a-hustle-as-price-falls-under-0-50\">as well as media appearances</a> to profit off trades of Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) through an “undisguised course of cryptocurrency market manipulation.” According to the complaint, Musk profited off DOGE trading at the expense of other investors by causing the price of the token to spike through actions including <a href=\"https://cointelegraph.com/news/elon-musk-changes-twitter-icon-to-doge-after-seeking-lawsuit-dismissal\">changing Twitter’s logo</a> to the Dogecoin logo.</p><p>The investors <a href=\"https://cointelegraph.com/news/elon-musk-gets-hit-with-ridiculous-258b-dogecoin-lawsuit\">filed their initial complaint</a> in June 2022 — prior to Musk’s takeover of Twitter but following his initial interest in promoting DOGE on the social media platform — but have amended the lawsuit at least two times based on his actions. They requested leave from the court to amend their complaint alleging Musk was responsible for insider trading of DOGE, but also to claim the token was a security under the standards of the U.S. Securities and Exchange Commission. </p><p>“This is a securities fraud class action arising from a deliberate course of carnival barking market manipulation and insider trading by the world’s richest man Elon Musk, who hijacked an emergent pop-culture phenomenon to cross-promote himself and his companies, and to pad his obscene fortune, preying on the earnest hopes of vulnerable Americans, including war veterans, blue collar workers, and the elderly,” said the amended lawsuit.</p><p>Musk changed the Twitter logo to that of Dogecoin on April 3, a few days after his legal team requested the second amended lawsuit be dismissed. At the time, the Twitter CEO’s filing said “funny pictures” and “tweeting words of support” did not amount to fraud.</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/elon-musk-threatens-microsoft-with-suit-claims-ai-trained-on-twitter-data\"><strong><em>Elon Musk threatens Microsoft with lawsuit, claims AI trained on Twitter data</em></strong></a></p><p>Musk had not tweeted about the amended complaint at the time of publication. As one of the world’s richest people, the Twitter CEO has made frequent statements about Dogecoin and other cryptocurrencies, often causing the price of the token to surge. He started using Twitter to comment on DOGE to his millions of followers in 2019.</p><p>Since Musk's takeover of Twitter in October 2022, the value of the social media platform has reportedly <a href=\"https://www.bloomberg.com/news/articles/2023-05-30/twitter-is-worth-33-of-musk-s-purchase-price-fidelity-says\" target=\"_blank\" rel=\"noopener nofollow\">dropped</a> to roughly 33% of the $44 billion he paid. On May 12, he announced he would be <a href=\"https://cointelegraph.com/news/nbcuniversal-veteran-could-replace-elon-musk-as-twitter-ceo-report\">stepping down as CEO</a> sometime in June, to be replaced by NBCUniversal’s former chair of global advertising and partnerships, Linda Yaccarino.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/musk-hints-suing-microsoft-us-rep-wants-gensler-fired-a-hodlers-digest-april-16-22/\"><strong><em>Musk hints at suing Microsoft, US Rep. wants Gensler fired, and more: Hodler’s Digest, April 16-22</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T16:42:50.000Z",
    "title": "Circle to launch ‘official version’ of USDC natively on Arbitrum ",
    "url": "https://cointelegraph.com/news/circle-to-launch-official-version-of-usdc-natively-on-arbitrum",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/049cda40-ace2-44b9-affb-eb1a778d905a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>USDC stablecoin developer Circle will replace the current version of its token with one running natively on the Arbitrum network. </p>\n                    <p><p>Circle recently announced plans for a June 8 launch of a new native version of its USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) stablecoin on the Arbitrum network.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ Circle is launching USDC natively on <a href=\"https://twitter.com/arbitrum?ref_src=twsrc%5Etfw\">@Arbitrum</a> on June 8th! <br><br>Keep scrolling or read the blog to learn more about this launch and how to migrate liquidity from “bridged USDC” to native USDC. <a href=\"https://t.co/tbxSmUvXso\">https://t.co/tbxSmUvXso</a></p>&mdash; Circle (@circle) <a href=\"https://twitter.com/circle/status/1664256935976132610?ref_src=twsrc%5Etfw\">June 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to a blog post, Circle will replace the existing version of USDC, an Ethereum-based token that’s been bridged to Arbitrum, with a native token that runs and resides on the Arbitrum network itself:</p><blockquote>“This will be the official version of USDC that is recognized within the Arbitrum ecosystem and will ultimately replace the currently circulating bridged version of USDC that comes from Ethereum.”</blockquote><p>Ahead of the launch, Circle plans to rename the existing Ethereum-based version of USDC to “USDC.e.” The original version will be listed as “bridged USDC” and the new Arbitrum-based version will don the “USDC” mantle. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">6/ Native USDC issued by Circle<br><br>– Token Name: USD Coin<br>– Token Symbol: USDC<br>– Token Address: 0xaf88d065e77c8cC2239327C5EDb3A432268e5831</p>&mdash; Circle (@circle) <a href=\"https://twitter.com/circle/status/1664256944469602304?ref_src=twsrc%5Etfw\">June 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The goal of this endeavor, according to Circle, is to speed up transactions through the use of cross-chain transfer protocols (CCTPs).</p><p>CCTPs are protocols that handle the transfer of assets between blockchains, allowing users to unify liquidity and support both crypto and Web3 assets across portfolios. </p><p>“This will enable USDC to move natively to-and-from Ethereum (and other supported chains) in minutes,” writes the Arbitrum team, adding “no more withdrawal delays.”</p><p>The changes to USDC comes as the overall market for stablecoins — cryptocurrencies such as USDC designed to trade at or close to the exact value of a fiat currency — has trended negatively for most companies in the space over the past 12 months. </p><p><strong><em>Related: </em><a href=\"https://cointelegraph.com/news/usdt-market-share-jumps-amid-economic-uncertainty-usdc-shrinks\"><em>USDT market share jumps amid economic uncertainty, but USDC shrinks</em></a></strong></p><p>Circle’s been no exception, as it saw its own market share decline significantly over the past 12 months. USDC's market capitalization has shrunk from $55 billion to $29 billion over that period, according to Coingecko data.</p><p>One of the few outliers bucking the trend appears to be Tether, whose USDT stablecoin rose from a market share of 47.04% in 2022 to 65.89% in 2023, bringing its market capitalization to just over $83 billion. </p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-01T17:00:13.000Z",
    "title": "The $24,000 BTC Bullseye: Is Bitcoin Headed For A Summer Swoon?",
    "url": "https://www.newsbtc.com/bitcoin-news/the-24000-btc-bullseye-is-bitcoin-headed-for-a-summer-swoon/",
    "description": "Bitcoin (BTC) has been on a rollercoaster ride for weeks. However, the largest cryptocurrency in the market seems poised to breach the $30,000 mark again if it continues its bullish momentum. Nevertheless, cryptocurrency experts are eyeing a key technical price level that could signal further volatility for the world&#8217;s most popular cryptocurrency. According to crypto expert and Economist Mr. Ben Lilly, the $24,000 price level is acting like a bullseye for Bitcoin, signaling a potential price dip in the coming months. Lilly&#8217;s analysis is based on Bitcoin&#8217;s 200-day moving average (200d MA), which he believes is a key technical indicator of the cryptocurrency&#8217;s price cycles. Related Reading: Shiba Inu Burn Frenzy: More Than 15 Billion Tokens Scorched In May Bitcoin Braces For Volatility Each halving cycle for Bitcoin, which occurs roughly every four years, begins with the 200d moving average (MA) failing, as shown in a chart shared by Lilly. This failure tends to dictate multi-year price cycles, and Lilly believes history repeats itself. Based on this theory, Lilly predicts that the failure of the 200d MA level could happen sometime between June and August of 2023, which could result in a dip below $24,000. This prediction is supported by the fact that low-leveraged liquidity pools are building at the level where the 200d MA will likely be in June, which Lilly has marked with a bullseye in his theoretical analysis. If the history of Bitcoin&#8217;s price cycles is any guide, then this retest is likely to fail, which could result in further volatility for the cryptocurrency. Lilly expects this failure to occur with end-of-June options, citing the recent unwind of May contracts as a subtle sweep lower. However, it&#8217;s important to note that the 200d MA is rising faster than before, as each passing day removes one day from the November lows and replaces it with a recent price. This acceleration can be seen in the last week on the 200d MA, which is ticking up faster. Still On The Path To Higher Prices? On the other hand, despite recent volatility in the cryptocurrency markets, one expert remains optimistic about Bitcoin&#8217;s long-term prospects. Cryptocurrency analyst and trader Jackis believes that the current market conditions indicate a long re-accumulation period before Bitcoin moves higher. According to Jackis, Bitcoin is still making higher lows and is above all critical moving averages, which is a positive sign for the cryptocurrency&#8217;s long-term growth. While there may be short-term downside movements, Jackis believes these are simply shakeouts and that the big picture remains bullish. Jackis sees a big move coming in the future, which he has mentioned in previous posts. His bet remains on the upside, and he now sees no clear signs of bearishness in the market. One key factor that Jackis points to is the monthly close, which recently occurred with a sweep. This provides the biggest market picture; for now, Jackis does not see any bearish signs. Related Reading: XRP Hype Spikes As Price Surges 12%, Is This A Top Signal? As of this writing, BTC is currently trading at $26,900, having filled the gap on the Chicago Mercantile Exchange (CME), previously highlighted by NewsBTC as a crucial level to observe before the uptrend could continue. Nevertheless, there is still a likelihood of further downside movements, with many industry experts anticipating high levels of volatility. Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T17:05:30.000Z",
    "title": "Bitcoin Stablecoin Giant Tether Invests in BTC Mining in Uruguay to Foster Adoption and Development",
    "url": "https://www.crypto-news-flash.com/bitcoin-stablecoin-giant-tether-invests-in-btc-mining-in-uruguay-to-foster-adoption-and-development/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-stablecoin-giant-tether-invests-in-btc-mining-in-uruguay-to-foster-adoption-and-development",
    "description": "<p>Tether (USDT) collaborates with a local company to launch sustainable Bitcoin mining operations in Uruguay. The company is also recruiting experts in the energy sector for its new initiative. Earlier this month, the stablecoin issuer Tether, disclosed its intention to allocate a portion of its profit to Bitcoin investment in addition to funding infrastructures. In [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/bitcoin-stablecoin-giant-tether-invests-in-btc-mining-in-uruguay-to-foster-adoption-and-development/\">Bitcoin Stablecoin Giant Tether Invests in BTC Mining in Uruguay to Foster Adoption and Development</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T17:04:25.000Z",
    "title": "Dogecoin Community Declares Rival Pepe Dead: Which Coin Will Fill Your Bags Better? A Comprehensive Report",
    "url": "https://www.crypto-news-flash.com/dogecoin-community-declares-rival-pepe-dead-which-coin-will-fill-your-bags-better-a-comprehensive-report/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-community-declares-rival-pepe-dead-which-coin-will-fill-your-bags-better-a-comprehensive-report",
    "description": "<p>PEPE, a recent meme coin inspired by the Pepe the Frog meme, is reportedly facing a significant decline in price, leading some to claim that it is &#8220;officially dead.&#8221; Glauber Contessoto, a self-proclaimed &#8220;Dogecoin millionaire,&#8221; expressed his belief that PEPE is no longer viable, drawing comparisons to controversial financial expert Jim Cramer and his inaccurate [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/dogecoin-community-declares-rival-pepe-dead-which-coin-will-fill-your-bags-better-a-comprehensive-report/\">Dogecoin Community Declares Rival Pepe Dead: Which Coin Will Fill Your Bags Better? A Comprehensive Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T17:03:27.000Z",
    "title": "Indian crypto exchanges in survival mode as Tradecurve to onboard millions of users",
    "url": "https://www.crypto-news-flash.com/indian-crypto-exchanges-in-survival-mode-as-tradecurve-to-onboard-millions-of-users/?utm_source=rss&utm_medium=rss&utm_campaign=indian-crypto-exchanges-in-survival-mode-as-tradecurve-to-onboard-millions-of-users",
    "description": "<p>Things are not looking great for the future of CEXs as some of the most notable ones in India, including CoinDCX, CoinSwitch, and WazirX, are now in survival mode. They are cutting costs wherever it is possible and are re-negotiating their partner programs whilst also suspending any employee pay-hikes, laying off employees, and exploring new [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/indian-crypto-exchanges-in-survival-mode-as-tradecurve-to-onboard-millions-of-users/\">Indian crypto exchanges in survival mode as Tradecurve to onboard millions of users</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T16:49:20.000Z",
    "title": "Chainlink and Tencent Cloud Join Forces to Unleash Web3 Potential: Accelerating Decentralized Technology Adoption",
    "url": "https://www.crypto-news-flash.com/chainlink-and-tencent-cloud-join-forces-to-unleash-web3-potential-accelerating-decentralized-technology-adoption/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-and-tencent-cloud-join-forces-to-unleash-web3-potential-accelerating-decentralized-technology-adoption",
    "description": "<p>Chainlink has inked a partnership with Tencent Cloud to bolster Web3.0 development. The collaboration is one of many by the oracle provider in the industry. Chainlink, the crypto industry’s first decentralized oracle network, has announced a strategic partnership with Tencent Cloud, a subsidiary of Tencent Holdings Ltd. This collaboration aims to harness the potential of [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/chainlink-and-tencent-cloud-join-forces-to-unleash-web3-potential-accelerating-decentralized-technology-adoption/\">Chainlink and Tencent Cloud Join Forces to Unleash Web3 Potential: Accelerating Decentralized Technology Adoption</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-01T16:55:26.000Z",
    "title": "Crypto Exchange Bybit Leaves Canadian Market Weeks Following Same Move by Binance",
    "url": "https://dailyhodl.com/2023/06/01/crypto-exchange-bybit-leaves-canadian-market-weeks-following-same-move-by-binance/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/exchange-bybit-following-same.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/exchange-bybit-following-same.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/exchange-bybit-following-same.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/exchange-bybit-following-same.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/exchange-bybit-following-same.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/exchange-bybit-following-same.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/exchange-bybit-following-same.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto exchange Bybit announced that it will cease offering its products and services in Canada just weeks after industry giant Binance decided to leave the country. In a new statement, Bybit says it will stop serving the Canadian market citing challenges in complying with new regulatory measures. “It has always been Bybit&#8217;s primary objective to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/01/crypto-exchange-bybit-leaves-canadian-market-weeks-following-same-move-by-binance/\">Crypto Exchange Bybit Leaves Canadian Market Weeks Following Same Move by Binance</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]