[
  {
    "source": "CoinDesk",
    "date": "2023-12-21T13:01:00.000Z",
    "title": "First Mover Americas: This Year's Top Performers and What Comes Next ",
    "url": "https://www.coindesk.com/markets/2023/12/21/first-mover-americas-this-years-top-performers-and-what-comes-next/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin [BTC] and crypto markets in context for Dec. 21, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-21T13:07:59.000Z",
    "title": " Hashing It Out: 2024 Narratives — AI and Web3   ",
    "url": "https://cointelegraph.com/news/hashing-it-out-2024-narratives-artificial-intelligence-web3",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvOWRlMmJlNDYtYmZhOS00ZTVjLWE2YTMtYjhlNmVkODUyZjgxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ethan Sun, CEO of MyShell, is bullish on the growing artificial intelligence creator economy and believes it will be a major driver of Web3 and AI collaborations in the future.  </p>\n                    <p><p data-ct-non-breakable=\"true\">As 2024 draws near, Hashing It Out focuses on narratives tipped to be at the heart of the cryptocurrency conversation in the new year. In Episode 40, Ethan Sun, CEO of MyShell — an open ecosystem for AI-native apps — explains how Web3 and AI can co-exist in the future and how both industries will integrate with each other. Ethan highlights that Web3 and AI integrations can change the creator economy while defending why both industries can grow without hurting the other.</p><p>On trends building up in 2023, Sun says that user-generated content in the artificial intelligence domain is growing fast because AI tools are increasing productivity for content creators. This spike in content creation is fuelling a new creator economy that requires reward mechanisms, which the CEO of MyShell believes will powered by Web3. </p><p>One thing that AI and Web3 share in common is issues with regulators across the world. Sun highlights that artificial intelligence platforms have to deal with privacy concerns and the absence of regulations. The latter has also caused companies to block access to their platforms in some states. Sun mentions that decentralization may absorb companies' liability and make AI accessible to all, regardless of their jurisdiction. Hashing It Out host Elisha Owusu Akyaw also points out that the fear that people have of AI applications taking over may be reduced with more AI products powered by decentralized governance. </p><p><a href=\"https://cointelegraph.com/news/hashing-it-out-2024-narratives-artificial-intelligence-web3\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-21T12:50:11.000Z",
    "title": " UAE regulator revises sanctions, AML policy to enact FATF’s Travel Rule ",
    "url": "https://cointelegraph.com/news/uae-revises-sanctions-aml-fatf-travel-rule",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMTMzN2ExNWItZjEzMC00ZjVkLWJkNDAtZGQ1M2M2ZjBkZTJiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>UAE’s Financial Services Regulatory Authority has updated its AML and sanctions rules with new elements related to digital assets.</p>\n                    <p><p>The Financial Services Regulatory Authority (FSRA), a financial watchdog in the United Arab Emirates, has updated its Anti-Money Laundering and sanctions rules with new elements related to digital assets.</p><p>The FSRA on Dec. 21 officially <a href=\"https://www.adgm.com/media/announcements/adgm-fsra-announces-revisions-to-its-aml-and-sanctions-rules-and-guidance\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> revisions to its Anti-Money Laundering and Sanctions Rules and Guidance, or the AML Rulebook, adding some changes to the provisions related to digital assets within the <a href=\"https://cointelegraph.com/learn/crypto-travel-rule\">Financial Action Task Force’s (FATF) Travel Rule</a>.</p><p>According to Cryptos Consultancy CEO Ali Jamal, the key updates in the revised document include refining provisions related to wire transfers to explicitly enforce the FATF's Travel Rule on digital assets, significantly impacting firms under the AML Rulebook's purview.</p><p><a href=\"https://cointelegraph.com/news/uae-revises-sanctions-aml-fatf-travel-rule\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-21T12:45:09.000Z",
    "title": "FTX claim prices soar, but experts caution against unsustainable rally",
    "url": "https://cryptoslate.com/ftx-claim-prices-soar-but-experts-caution-against-unsustainable-rally/",
    "description": "<p>FTX creditor claims recent rally is unsustainable, according to Vladimir Jelisavcic, founder and manager of Cherokee Acquisition—a crypto bankruptcy brokerage firm. In a Dec. 20 post on X (formerly Twitter), Jelisavcic stated that the &#8220;price increases for FTX claims should slow down soon,&#8221; because &#8220;this level of appreciation can&#8217;t be sustained for much longer.&#8221; Jelisavcic&#8217;s opinion [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ftx-claim-prices-soar-but-experts-caution-against-unsustainable-rally/\">FTX claim prices soar, but experts caution against unsustainable rally</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-21T12:41:49.000Z",
    "title": "FixedFloat Marks 5 Years with 1.5 Million Exchanges and Mobile App on the Horizon",
    "url": "https://cryptodaily.co.uk/2023/12/fixedfloat-marks-5-years-with-15-million-exchanges-and-mobile-app-on-the-horizon",
    "description": "As the days of 2023 wind down, FixedFloat, the leading non-custodial automated exchanger,"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-21T12:50:40.000Z",
    "title": "Worldcoin suspends its Orb-verification service in select countries",
    "url": "https://www.cryptopolitan.com/worldcoin-suspend-orb-verification-countries/",
    "description": "Worldcoin&#8217;s recent decision to halt its Orb-verification service in India, Brazil, and France has raised eyebrows, especially considering the startup&#8217;s recent efforts in these markets. The Orb, a distinctive helmet-shaped device, scans individuals&#8217; eyeballs to verify their identity—a process reminiscent of India&#8217;s Aadhaar system that uses biometric data for identification. Worldcoin’s halts services due to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-21T12:48:56.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-21T12:41:42.000Z",
    "title": "Anthropic in talks to secure $750 million in investments",
    "url": "https://www.cryptopolitan.com/anthropic-to-secure-750-million-investments/",
    "description": "Anthropic, the San Francisco-based artificial intelligence (AI) company, is currently in discussions to secure a substantial $750 million in new investments, primarily led by Menlo Ventures. This move is anticipated to elevate Anthropic’s valuation to approximately $18 billion once the funding round concludes. However, it’s important to note that the reported valuation of $18.4 billion [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-21T13:00:41.000Z",
    "title": "XRP Whales Show Exchange Inflow Activity, Bad Sign For Price?",
    "url": "https://www.newsbtc.com/xrp-news/xrp-whales-exchange-inflow-bad-sign-price/",
    "description": "On-chain data shows that XRP whales have been making exchange inflows in the past day, a sign that may be negative for the asset&#8217;s price. XRP Whales Have Made Multiple Large Exchange Inflows Today According to data from the cryptocurrency transaction tracker service Whale Alert, the XRP network has handled a few large transactions during the last 24 hours. In total, there have been four such transfers, each worth at least $10.9 million. Given the huge scale of these moves, it&#8217;s likely that whale entities were responsible for them. Related Reading: Ethereum Retests Breakout Zone, Analyst Sets $3,500 Target The whales are naturally influential players on the network as they carry large amounts in their wallets. Thus, their transfers can be worth watching, as they may end up causing fluctuations in the market. How such a transfer would influence the price depends on what the intent behind it was. It&#8217;s generally hard to find the exact motive behind any transaction, but depending on what type of transfer it was and which wallets were involved, some hints can perhaps be gathered. Three of the whale transactions from the past day have been similar in structure. Here are the address details of the first of these large transfers: Looks like this massive move only took a negligible fee of 0.000015 XRP to be possible &#124; Source: Whale Alert As is visible above, this transaction involved a movement of 24.6 million XRP (worth over $15 million at the time the transfer went through) between an unknown wallet and an address attached to the cryptocurrency exchange Bitstamp. Unknown wallets are addresses unaffiliated with any known central entity, so the sender address here was likely the whale&#8217;s personal wallet. One of the main reasons why an investor would transfer coins from their self-custodial wallets to an exchange is for selling purposes, so it&#8217;s possible that this humongous holder has made this move to part with the stack. Interestingly, the second exchange inflow transaction from the last 24 hours also appears to have been made by the same whale, as the sending addresses match. The second exchange inflow from the past day &#124; Source: Whale Alert While the receiver in the case of this transaction worth 18 million XRP ($10.9 million) is also an exchange, the platform is Bitso this time, and not Bitstamp as was the case with the other transfer. The third and final exchange inflow seems to have involved both a different sender and receiver, suggesting that a different whale entirely was responsible for this 20 million tokens ($12.1 million) transfer. The latest of the XRP whale transactions &#124; Source: Whale Alert As mentioned earlier, it&#8217;s hard to say for sure anything about the intent behind these moves, but given that they are exchange inflows, they can potentially end up proving to be bearish for the cryptocurrency. Related Reading: Dogecoin Whales Are On The Move: A Worrying Sign? The fourth and the oldest large transaction that has occurred inside this window was actually the largest one and it would appear that Ripple, the company behind the cryptocurrency, was the sender involved. Ripple seems to have made a large outflow &#124; Source: Whale Alert As is apparent above, the firm has shifted 120 million XRP ($73.8 million) to an unknown wallet. There can be many reasons why the company would have made such a transaction, ranging from a simple change of wallets to a selling move. Token Price XRP has mostly been moving sideways recently as it currently trades around the $0.61886 level. The coin appears to have gone stale during the past few weeks &#124; Source: XRPUSD on TradingView Featured image from Kanchanara on Unsplash.com, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-21T13:06:35.000Z",
    "title": "Arbitrum’s Inscriptions Frenzy Takes Off: Is This the Future of Blockchain Transactions?",
    "url": "https://www.crypto-news-flash.com/arbitrum-inscriptions-frenzy-takes-off-is-this-the-future-of-blockchain-transactions/?utm_source=rss&utm_medium=rss&utm_campaign=arbitrum-inscriptions-frenzy-takes-off-is-this-the-future-of-blockchain-transactions",
    "description": "<img width=\"1000\" height=\"666\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Production-Perig-Blockchain.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Production-Perig-Blockchain.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Production-Perig-Blockchain-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Production-Perig-Blockchain-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/Production-Perig-Blockchain-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Arbitrum has made history in total transaction boost sparked by Inscriptions. Arbitrum now seeks to reclaim lost price levels as bull market approaches. Arbitrum (ARB), a Layer-2 blockchain, has recently entered the spotlight due to an increase in network activity following the emergence of EVM (Ethereum Virtual Machine) Inscriptions, which are similar to Bitcoin Ordinals. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-21T13:06:34.000Z",
    "title": "Coinbase Stock Skyrockets: 2023 Returns Surge Past 400% Defying All Odds",
    "url": "https://www.crypto-news-flash.com/coinbase-stock-skyrockets-2023-returns-surge-past-400-defying-all-odds/?utm_source=rss&utm_medium=rss&utm_campaign=coinbase-stock-skyrockets-2023-returns-surge-past-400-defying-all-odds",
    "description": "<img width=\"1280\" height=\"960\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/blur-1853262_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/blur-1853262_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/blur-1853262_1280-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/blur-1853262_1280-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/blur-1853262_1280-768x576.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Coinbase stock (COIN) is reported to have made a whopping surge of 400% from year to date.  According to analysts, the price could continue its upward trend as the crypto market looks forward to the first-ever spot Bitcoin ETF.  The incredible recovery of the crypto market this year has had a significant effect on the [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-21T12:43:45.000Z",
    "title": "CAKE Jumps 23% as PancakeSwap Unveils Plan to Reduce Total Supply",
    "url": "https://coinedition.com/cake-jumps-23-as-pancakeswap-unveils-plan-to-reduce-total-supply/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/PancakeSwap-Completes-CAKE-Burning-Event-Burns-Tokens-Worth-31M.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"PancakeSwap Completes CAKE Burning Event; Burns Tokens Worth $31M\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/PancakeSwap-Completes-CAKE-Burning-Event-Burns-Tokens-Worth-31M.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/PancakeSwap-Completes-CAKE-Burning-Event-Burns-Tokens-Worth-31M-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/PancakeSwap-Completes-CAKE-Burning-Event-Burns-Tokens-Worth-31M-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/PancakeSwap-Completes-CAKE-Burning-Event-Burns-Tokens-Worth-31M-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/PancakeSwap-Completes-CAKE-Burning-Event-Burns-Tokens-Worth-31M-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Today, decentralized exchange (DEX) platform PancakeSwap opened discussions on a proposed plan to reduce CAKE’s total supply, a post on its website reveals. The proposal, which seeks to reduce CAKE’s total supply by over 300 million, has since sent the token’s price up.&#160;&#160; Indeed, the exchange is seeking input from its community members on its [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/cake-jumps-23-as-pancakeswap-unveils-plan-to-reduce-total-supply/\">CAKE Jumps 23% as PancakeSwap Unveils Plan to Reduce Total Supply</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-21T12:45:15.000Z",
    "title": "Ethereum (ETH) Hinting at Imminent Jump Higher, Says Crypto Trader – Here Are His Targets",
    "url": "https://dailyhodl.com/2023/12/21/ethereum-eth-hinting-at-imminent-jump-higher-says-crypto-trader-here-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/eth-Hinting-at-Imminent.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/eth-Hinting-at-Imminent.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/12/eth-Hinting-at-Imminent.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/eth-Hinting-at-Imminent.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/eth-Hinting-at-Imminent.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/eth-Hinting-at-Imminent.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/12/eth-Hinting-at-Imminent.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analyst and trader Ali Martinez says that the leading smart contract platform Ethereum (ETH) is setting the stage for an explosive rally. Martinez tells his 36,600 followers on the social media platform X that ETH could increase by more than 60% from its current value after a period of accumulation when people start to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/21/ethereum-eth-hinting-at-imminent-jump-higher-says-crypto-trader-here-are-his-targets/\">Ethereum (ETH) Hinting at Imminent Jump Higher, Says Crypto Trader – Here Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]