[
  {
    "source": "CryptoSlate",
    "date": "2023-09-05T23:40:12.000Z",
    "title": "Grayscale legal team seeks SEC meeting over proposed Bitcoin ETF conversion",
    "url": "https://cryptoslate.com/grayscale-asks-to-meet-with-sec-over-proposed-bitcoin-etf-conversion/",
    "description": "<p>Top executives at Grayscale have asked to meet with the U.S. Securities and Exchange Commission (SEC) to discuss a planned spot Bitcoin ETF. The company&#8217;s legal team sent a letter to the SEC on Sept. 5, writing: &#8220;We would appreciate the opportunity to meet with the staff of the [SEC] as soon as practical to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/grayscale-asks-to-meet-with-sec-over-proposed-bitcoin-etf-conversion/\">Grayscale legal team seeks SEC meeting over proposed Bitcoin ETF conversion</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-06T00:00:17.000Z",
    "title": "Defying The Crypto Crash: Liquid Staking’s $20 Billion Rise Amid Market Uncertainty",
    "url": "https://www.newsbtc.com/news/defying-crypto-crash-liquid-stakings-rise/",
    "description": "The crypto market has witnessed several fluctuations, but specific sectors&#8217; resilience within this domain remains attractive. Recently, despite a noticeable dip in the broader crypto market, one area seems poised to touch its peak, demonstrating the potential and adaptability within the crypto ecosystem, per a report.  Liquid staking, a sector that facilitates rewards for token pledges supporting blockchain operations, shows signs of resurgence. This re-emergence occurs despite an overarching downturn in crypto assets. Related Reading: Lido (LDO) Price Inks Gains Alongside TVL Rise – What Traders Should Expect Recovery Amid Crypto Crisis According to Bloomberg, citing data from DefiLlama, there is a roughly 292% surge in assets secured in liquid staking services, reaching a monumental $20 billion from a low in June 2022. This ascent is all the more significant considering the broader crypto slump during that period. Bloomberg noted a recovery in liquid staking&#8217;s position as &#8220;the titan of decentralized finance (DeFi).&#8221; Thanks to blockchain-based automated software, this crypto framework enables individuals to trade, borrow, and lend without intermediaries. Notably, once the crown jewel of DeFi applications, liquid staking has overtaken lending. Protocols specialized in liquid staking, such as Lido and Rocket Pool, witnessed their zenith in April of the previous year. They amassed assets slightly exceeding $21 billion. However, this momentum was disrupted by the destabilization of TerraUSD, leading to a massive $2 trillion setback in the crypto market. Despite the gloomy overtones in the crypto sector, where major tokens and a majority of DeFi services are yet to recover from the blows of 2021 and 2022, liquid staking stands out, showcasing a comeback, as seen in the chart below. Global Regulatory Stance On Staking Liquid staking plays a pivotal role, especially in the Ethereum blockchain. It offers a mechanism where users can stake their tokens and, in return, receive a liquid token representing their staked amount. This process allows users to participate in securing the network while maintaining liquidity. Simply put, they can earn staking rewards without locking up their assets, ensuring flexibility and maximizing potential gains. Kunal Goel, a research analyst at Messari, parallels these services to &#8220;the on-chain equivalent of government bonds.&#8221; The analyst elaborates that while these aren&#8217;t devoid of risks, they exude a comparatively lower risk profile and, thus far, have remained untainted by hacks or exploits. This resurgence in liquid staking doesn&#8217;t go unnoticed and has been juxtaposed with regulatory decisions concerning crypto globally. The US, for instance, has intensified its regulatory lens on the crypto sector, especially on staking products. Related Reading: Rocket Pool (RPL) On 4-Day Bullish Streak After Shapella, Can It Make A Fifth? Such measures prompted key players like Kraken and Bitstamp to halt their regional staking products. Richard Galvin, co-founder at DACM, noted: The regulatory crackdown around staking products offered by centralized exchanges has definitely helped liquid staking. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-06T00:00:51.000Z",
    "title": "Altcoins on Verge of Witnessing Breakouts Across the Board, According to Analyst Michaël van de Poppe",
    "url": "https://dailyhodl.com/2023/09/05/altcoins-on-verge-of-witnessing-breakouts-across-the-board-according-to-analyst-michael-van-de-poppe/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/altcoin-edge-across-1.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/altcoin-edge-across-1.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/altcoin-edge-across-1.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/altcoin-edge-across-1.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/altcoin-edge-across-1.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/altcoin-edge-across-1.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/altcoin-edge-across-1.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed cryptocurrency analyst believes that altcoins could defy expectations and rally ahead of the Bitcoin (BTC) halving. Crytpo trader Michaël van de Poppe tells his 666,400 followers on the social media platform X that he&#8217;s looking at the Bitcoin dominance (BTC.D) chart, which tracks how much of the crypto total market cap belongs [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/05/altcoins-on-verge-of-witnessing-breakouts-across-the-board-according-to-analyst-michael-van-de-poppe/\">Altcoins on Verge of Witnessing Breakouts Across the Board, According to Analyst Michaël van de Poppe</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]