[
  {
    "source": "CoinDesk",
    "date": "2023-06-06T09:30:02.000Z",
    "title": "Bitcoin Saw Heavy Profit Taking in May: Goldman Sachs",
    "url": "https://www.coindesk.com/business/2023/06/06/bitcoin-saw-heavy-profit-taking-in-may-goldman-sachs/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The amount of bitcoin held on exchanges fell 12%, while ether supply saw a slight gain, the report said."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-06T09:16:59.000Z",
    "title": "NFT Artist Agoria to Give Fans Ownership Over Upcoming Album Launch",
    "url": "https://decrypt.co/143542/nft-artist-agoria-give-fans-ownership-over-upcoming-album-launch",
    "description": "The French electronic music pioneer is handing out a shared stake in royalties to his community of “Agorians.”"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T09:14:18.000Z",
    "title": "Binance sees $778M net outflows on Ethereum blockchain amid SEC charges: Nansen",
    "url": "https://cointelegraph.com/news/binance-net-outflows-on-ethereum-blockchain-after-sec-lawsui-nansen",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/bf37dbf1-43d0-4228-9519-3770619b7763.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The SEC lawsuit against Binance led to an outflow of over $700 million worth of assets on Ethereum in the past 24 hours with outflows from the exchange still dominating inflows.</p>\n                    <p><p>The SEC lawsuit against Binance on June 5, accusing the crypto exchange of violating various securities laws, had a direct impact on the crypto market as well as the balance sheet of the crypto exchange.</p><p>According to <a href=\"https://twitter.com/nansen_ai/status/1665999474685284353\" target=\"_blank\" rel=\"noopener nofollow\">data</a> shared by crypto analytic firm Nansen, Binance saw a negative netflow of $778 million on the Ethereum blockchain, where $871 million worth of assets inflowed onto the exchange while $1.6 billion worth of assets went out of the exchange. </p><p>Even in the first 24 hours following the SEC lawsuit, Ethereum-based tokens have seen a negative netflow, where in the past hour, $14.8 million worth of assets flowed in, and $50.5 million worth of assets went out of the exchange.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/c6fd6caf-5840-4c3f-8e40-c90e3ae08c44.png\"  /><figcaption style=\"text-align: center;\"><em>Binance netflow on Ethereum. Source: Nansen</em></figcaption></figure><p>Binance’s reserve assets had a net outflow of approximately $1.4 billion within the first hour of SEC lawsuit news, accounting for 2.6% of its total reserve assets of $52.9 billion.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T09:13:00.000Z",
    "title": "5 YouTube channels for learning graphic design",
    "url": "https://cointelegraph.com/news/learn-graphic-design",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/797e6d49-11b8-434a-bd43-da00da9dcd4e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Discover a wealth of graphic design knowledge and unleash your creativity with these five YouTube channels.</p>\n                    <p><p>Learning graphic design is a valuable skill in today's digital age. It involves creating visual content for various purposes, including advertising, branding, web design, and more. Whether you're a beginner or looking to enhance your existing skills, YouTube can be a fantastic resource for learning graphic design.</p><p>Here are five YouTube channels that offer excellent content for graphic design enthusiasts:</p><h2>Adobe Creative Cloud</h2><p><a href=\"https://www.youtube.com/@AdobeCreativeCloud\" target=\"_blank\" rel=\"noopener nofollow\"><em>Adobe Creative Cloud</em></a> shares tutorials, advice and ideas pertaining to its creative products and services on its official YouTube channel. One can find a variety of video content on the <em>Adobe Creative Cloud</em> YouTube channel, such as:</p><ul><li>Tutorials: Detailed instructions and walkthroughs for using Adobe products that show different methods and features.</li><li>Tips and tricks: Useful hints, shortcuts and little-known capabilities of Adobe apps to improve your productivity and workflow.</li><li>Providing inspiration for your own initiatives by showcasing the work of gifted creatives and hearing their tales.</li><li>Sneak peek and upgrades: Adobe’s announcements, sneak peeks at new features, and product upgrades.</li><li>Adobe Live: Real-time live streaming of creative pros showing their design workflows and processes.</li></ul><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Mirror, mirror on the wall, who&#39;s the most villainous of them all?<br><br> Russ Gray: <a href=\"https://t.co/1UBUCr5k1e\">https://t.co/1UBUCr5k1e</a> <a href=\"https://t.co/NI7NZRYxr6\">pic.twitter.com/NI7NZRYxr6</a></p>&mdash; Adobe Creative Cloud (@creativecloud) <a href=\"https://twitter.com/creativecloud/status/1664376797998485504?ref_src=twsrc%5Etfw\">June 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>One can remain up-to-date with the newest videos, pick up new skills, get inspired, and get the most out of their Adobe products by subscribing to the <em>Adobe Creative Cloud</em> YouTube channel.</p><h2>The Futur</h2><p>A channel dedicated to design and creative entrepreneurship, <a href=\"https://www.youtube.com/@thefutur\" target=\"_blank\" rel=\"noopener nofollow\"><em>The Futur</em></a>, led by Chris Do and his team of experts, provides a vast array of valuable content for designers and creatives seeking to enhance their skills and businesses.</p><p>One may find a range of information on their YouTube channel, including tutorials, professional industry interviews, discussions of design principles, business guidance for creatives and insights into the design process.</p><p>The channel offers comprehensive lessons on a range of design methods and software programs. These videos provide viewers with the opportunity to develop their design expertise and discover fresh creative ideas by covering both basic design concepts and sophisticated techniques.</p><p><em>The Futur</em> gives viewers the skills they need to cultivate their creativity and manage the entrepreneurial parts of their careers by exhibiting actual design projects and providing insights into the design process. <em>The Futur</em> is a go-to source for designers looking for ideas, information and workable success tactics because of its wide range of content.</p><h2>Spoon Graphics</h2><p>Chris Spooner established the well-known YouTube channel <a href=\"https://www.youtube.com/@spoongraphics\" target=\"_blank\" rel=\"noopener nofollow\"><em>Spoon Graphics</em></a>, which serves all levels of graphic artists. The channel is well-known for its in-depth tutorials that cover a variety of design processes and software tools, allowing designers to develop their talents and discover fresh creative ideas. </p><p>Furthermore, <em>Spoon Graphics</em> provides helpful design tools like brushes, textures and typefaces that designers can use in their work. The channel also serves as a source of design inspiration by showcasing talented designers and their work and providing commentary and analysis on design principles and aesthetics. With discussions on design theory and practical tips, <em>Spoon Graphics</em> is a valuable hub for designers looking to stay inspired and improve their craft.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/5-youtube-channels-to-learn-web3-development\">5 YouTube channels to learn Web3 development</a></em></strong></p><h2>Yes I’m a Designer</h2><p>Martin Perhiniak runs the graphic design-focused YouTube channel <a href=\"https://www.youtube.com/@YesImaDesigner/about\" target=\"_blank\" rel=\"noopener nofollow\"><em>Yes I’m a Designer</em></a>. The channel offers a multitude of tutorials and insights for designers of all levels and focuses on various design software, mainly Adobe programs, such as Photoshop, Illustrator and InDesign. Perhiniak provides detailed instructions, design advice and methods on a variety of design-related topics.</p><p>In addition to imparting technical knowledge, Perhiniak provides thorough instruction on design ideas, compositional methods and a variety of best practices through his online courses. He offers helpful knowledge gleaned from his involvement in these endeavors, drawing on his experience as a designer and retoucher on renowned projects, including Pixar’s <em>Cars</em> and <em>Toy Story</em>, BBC’s <em>Doctor Who</em> and Mattel’s <em>Team Hot Wheels</em>. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Do you want to become a designer? or illustrator?<br>Sign up TODAY to our Survival Kit for Designers newsletter and learn everything you need to know about getting started as creative! <a href=\"https://twitter.com/hashtag/graphicdesign?src=hash&amp;ref_src=twsrc%5Etfw\">#graphicdesign</a> <a href=\"https://twitter.com/hashtag/illustration?src=hash&amp;ref_src=twsrc%5Etfw\">#illustration</a><a href=\"https://t.co/FJz6nwG4w1\">https://t.co/FJz6nwG4w1</a> <a href=\"https://t.co/XiFrz9XFxX\">pic.twitter.com/XiFrz9XFxX</a></p>&mdash; Yes I&#39;m a Designer (@YesIMaDesigner) <a href=\"https://twitter.com/YesIMaDesigner/status/1361284452203257857?ref_src=twsrc%5Etfw\">February 15, 2021</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Martin also offers criticism on designs submitted by viewers in the design critiques that are another aspect of the channel. For designers wishing to advance their knowledge, pick up new abilities, and find inspiration in the world of graphic design, <em>Yes I’m a Designer</em> is a valuable resource.</p><h2>Will Paterson</h2><p><a href=\"https://www.youtube.com/@willpatersondesign/about\" target=\"_blank\" rel=\"noopener nofollow\">Will Paterson</a> is a well-known graphic designer and content creator with a strong emphasis on logo design, hand lettering and brand identity. His YouTube channel, which boasts 700,000+ subscribers and an extensive library of 800+ videos, provides a wealth of information and experience to help people improve their design abilities. As a result of his work with prestigious companies such as Adobe, Instagram and Skillshare, Paterson is able to share his knowledge and help viewers along their design path.</p><p>His main goal is to streamline the graphic design process by exposing obscure methodologies and honing already-existing abilities. The channel offers a wide variety of information, such as design courses, reviews and critiques of logos, advice on graphic design, and recordings of design competitions. In addition to YouTube, Paterson is the owner of a design firm that offers services, including full brand identity, logo animation and logo design. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/9-tech-youtube-channels-to-follow\">9 tech YouTube channels to follow</a></em></strong> </p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-06T09:30:40.000Z",
    "title": "Binance CZ says SEC lawsuit is ‘an attack on the entire industry’",
    "url": "https://cryptoslate.com/binance-cz-says-sec-lawsuit-is-an-attack-on-the-entire-industry/",
    "description": "<p>Binance CEO Changpeng Zhao (CZ) described the U.S. Security and Exchange Commission lawsuit against his firm as an attack on the entire crypto industry. On June 5, the SEC filed a lawsuit against Binance, and related entities, alleging federal securities law violations placing American investors at risk, including the firm offering of unregistered security tokens [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-cz-says-sec-lawsuit-is-an-attack-on-the-entire-industry/\">Binance CZ says SEC lawsuit is ‘an attack on the entire industry’</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-06T09:30:42.000Z",
    "title": "Kenyan Central Bank: CBDC Not a Priority ‘in the Short to Medium Term’",
    "url": "https://news.bitcoin.com/kenyan-central-bank-cbdc-not-a-priority-in-the-short-to-medium-term/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_782839543-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Kenyan Central Bank: CBDC Not a Priority &#039;in the Short to Medium Term&#039;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_782839543-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_782839543-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_782839543-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_782839543-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_782839543-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_782839543-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_782839543.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Kenyan central bank has said implementing a central bank digital currency (CBDC) may not be a priority for Kenya in the short to medium term. According to the central bank, Kenya’s &#8220;pain points in payments can potentially be solved by strengthening innovations around the existing payment ecosystem.&#8221; Central Bank Will &#8216;Continue to Monitor&#8217; Need [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T09:28:25.000Z",
    "title": "Aptos price analysis: APT value depreciates to $8.04 after bearish spin",
    "url": "https://www.cryptopolitan.com/aptos-price-analysis-2023-06-06/",
    "description": "Aptos price analysis reveals that the market is in a bearish trend as prices constantly fall. The APT/USD pair has dropped below the $8.10 mark and is currently trading at around $8.04. This trend is expected to continue in the short term, as there are multiple bearish signals on the daily time frame chart. The ... <a title=\"Aptos price analysis: APT value depreciates to $8.04 after bearish spin\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-analysis-2023-06-06/\" aria-label=\"More on Aptos price analysis: APT value depreciates to $8.04 after bearish spin\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-06T09:35:06.000Z",
    "title": "SEC complaint sparks questions on former Binance.US CEO’s sudden departure",
    "url": "https://crypto.news/sec-complaint-sparks-questions-on-former-binance-us-ceos-sudden-departure/",
    "description": "The US SEC's complaint against Binance has unveiled intriguing details surrounding the sudden departure of former Binance.US CEO Brian Brooks in August 2021, merely three months into his tenure."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-06T09:09:42.000Z",
    "title": "Terra Classic falls 11% ahead of its upgrade proposal",
    "url": "https://crypto.news/terra-classic-falls-11-ahead-of-its-upgrade-proposal/",
    "description": "The fallen terra classic (LUNC), formerly known as LUNA, has been struggling since the collapse of the Terra ecosystem in May 2022. The asset has dropped further with the current FUD around Binance.  Despite LUNC’s 35% gains on June 4,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-06T09:23:20.000Z",
    "title": "Shiba Inu Investors Go All-In: 338 Billion Token Accumulation Signals Bullish Cue",
    "url": "https://www.newsbtc.com/news/shiba-inu-investors-go-all-in/",
    "description": "Shiba Inu (SHIB), the popular meme-inspired cryptocurrency, is experiencing a notable change in market dynamics as the tide seems to be turning in favor of bullish sentiment.  Over the past week, there has been a remarkable surge in confidence among large-scale investors who have demonstrated their support for SHIB by acquiring billions more tokens than they have sold.  But what has sparked this newfound optimism, and what does it mean for the future of Shiba Inu? Related Reading: Shiba Inu (SHIB) Poised For Significant Breakout: Here’s What To Watch Out For Large Investors Embrace Shiba Inu Tokens Recent data reveals that large investors have shown immense confidence in SHIB by acquiring an astonishing 338.1 billion more tokens than they sold over the course of the past week. This surge in accumulation by influential participants in the crypto market has led to a remarkable weekly total of 9.34 trillion Shiba Inu tokens being amassed. Expanding on this extraordinary statistic, it becomes clear that the interest of large investors in SHIB is far from waning. Their notable accumulation of SHIB tokens signals a belief in the cryptocurrency&#8217;s potential for growth and indicates a positive outlook for its future prospects.  SHIB market cap drops below the $5 billion level. Chart: TradingView.com Such a substantial increase in token acquisition suggests that these investors see SHIB as an asset with significant value and are willing to invest substantial resources to secure their position. A Tale Of Consolidation Amidst Investor Interest Despite the recent surge in confidence and substantial accumulation of Shiba Inu (SHIB) tokens by large investors, the price of SHIB has yet to exhibit a positive response. According to CoinGecko, the current price of SHIB stands at $0.00000804, representing a decline of 5.8% over the past 24 hours and a seven-day slump of 7.7%. Source: Coingecko SHIB has since been trading within a narrow range, with minimal fluctuations exceeding 6%. Surprisingly, this phase of consolidation has piqued the interest of major investors who have predominantly taken up long positions during the past week. Related Reading: Pepecoin Frenzy Fades: How Meme Token’s Price, Market Cap Were Cut In Half Additionally, the crypto market as a whole has experienced fluctuations during this period of regulatory mess, and SHIB may be impacted by broader market trends. While the price of SHIB has not yet responded positively to the influx of large investors, their sustained interest in the cryptocurrency indicates a belief in its long-term potential. These investors seem to view the current consolidation period as an opportunity to accumulate SHIB tokens at favorable prices, positioning themselves for potential future gains. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk) -Featured image from Getty"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-06T09:11:43.000Z",
    "title": "Congress Introduces Game-Changing Bitcoin and Ethereum Bill Following SEC Lawsuit Against Binance – Unveiling a Long-Planned Vision, Don’t Be Fooled",
    "url": "https://www.crypto-news-flash.com/congress-introduces-game-changing-bitcoin-and-ethereum-bill-following-sec-lawsuit-against-binance-unveiling-a-long-planned-vision-dont-be-fooled/?utm_source=rss&utm_medium=rss&utm_campaign=congress-introduces-game-changing-bitcoin-and-ethereum-bill-following-sec-lawsuit-against-binance-unveiling-a-long-planned-vision-dont-be-fooled",
    "description": "<p> United States legislators have put forward a new proposal known as a &#8220;working framework.” On June 5, U.S. regulators filed a lawsuit against Binance, accusing them of a &#8220;web of deception.&#8221; Amid growing concerns that a potential cryptocurrency crisis is on the verge of erupting, legislators in the United States have put forward a new [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/congress-introduces-game-changing-bitcoin-and-ethereum-bill-following-sec-lawsuit-against-binance-unveiling-a-long-planned-vision-dont-be-fooled/\">Congress Introduces Game-Changing Bitcoin and Ethereum Bill Following SEC Lawsuit Against Binance &#8211; Unveiling a Long-Planned Vision, Don&#8217;t Be Fooled</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-06T09:15:28.000Z",
    "title": "Whales Abruptly Move Nearly $400,000,000 in Ethereum As Crypto Markets Plunge – Here’s Where the Crypto Is Going",
    "url": "https://dailyhodl.com/2023/06/06/whales-abruptly-move-nearly-400000000-in-ethereum-as-crypto-markets-plunge-heres-where-the-crypto-is-going/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/whale-move-plunge-where.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/whale-move-plunge-where.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/whale-move-plunge-where.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/whale-move-plunge-where.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/whale-move-plunge-where.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/whale-move-plunge-where.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/whale-move-plunge-where.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Whales are suddenly moving hundreds of thousands of Ethereum (ETH) as the crypto markets witness a serious sell-off event. The blockchain-surveying service Whale Alert spotted a string of Ethereum transactions adding up to 353,579 ETH and worth almost $400 million. One of the largest transactions in the past day involved a deep-pocketed investor abruptly relocating [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/06/whales-abruptly-move-nearly-400000000-in-ethereum-as-crypto-markets-plunge-heres-where-the-crypto-is-going/\">Whales Abruptly Move Nearly $400,000,000 in Ethereum As Crypto Markets Plunge – Here’s Where the Crypto Is Going</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]