[
  {
    "source": "CryptoSlate",
    "date": "2024-02-02T09:50:44.000Z",
    "title": "DOJ charges trio in sim-swap scheme potentially linked to $400 million FTX crypto heist",
    "url": "https://cryptoslate.com/doj-charges-trio-in-sim-swap-scheme-potentially-linked-to-400-million-ftx-crypto-heist/",
    "description": "<p>The United States Department of Justice (DOJ) has taken legal action against three individuals—Robert Powell, Carter Rohn, and Emily Hernandez—for their involvement in a Sim-swapping scam in November 2022. The charges brought against them include fraud and identity theft. This case has raised eyebrows due to its potential connection to the 2022 FTX hack, where [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/doj-charges-trio-in-sim-swap-scheme-potentially-linked-to-400-million-ftx-crypto-heist/\">DOJ charges trio in sim-swap scheme potentially linked to $400 million FTX crypto heist</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-02T09:40:36.000Z",
    "title": "DOJ charges hackers behind $400 million SIM-swap attack on FTX",
    "url": "https://cryptobriefing.com/doj-charges-hackers-behind-400-million-sim-swap-attack-on-ftx/?utm_source=feed&utm_medium=rss",
    "description": "Federal prosecutors say that the group operated as a SIM-swapping ring, targeting FTX and other victims over two years."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-02T10:01:12.000Z",
    "title": "3 Lucky ‘Airdrop Hunters’ Made Over $1 Million From Jupiter’s $JUP Token Airdrop, Reveals Blockchain Analyst",
    "url": "https://www.cryptoglobe.com/latest/2024/02/3-lucky-airdrop-hunters-made-over-1-million-from-jupiters-jup-token-airdrop-reveals-blockchain-analyst/",
    "description": "On February 2, blockchain analysis service “Lookonchain” revealed that the airdrop by Jupiter, a leading DeFi platform on the Solana blockchain, which got started on January 31, has been very good to some people. As the Phantom wallet team explained recently, the JUP token is the governance token of Jupiter. This token is essential for the decentralized […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T10:00:18.000Z",
    "title": "Avalanche leads $900M token release, analysts warn of market impact",
    "url": "https://www.cryptopolitan.com/avalanche-900m-token-release-expert-warn/",
    "description": "The cryptocurrency market is on alert as nearly $900 million in vested tokens is set to be unleashed in February. Projects such as Avalanche, Aptos, The Sandbox, Optimism, and Sui are gearing up for significant token releases, prompting both excitement and caution within the crypto community. Avalanche leads the charge Avalanche, a proof-of-stake blockchain project, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-02T09:56:44.000Z",
    "title": "Meta’s metaverse developer reports all-time high net loss in Q4, 2023",
    "url": "https://crypto.news/metas-metaverse-developer-reports-all-time-high-net-loss-in-q4-2023/",
    "description": "Reality Labs, Meta&#8217;s subsidiary focused on developing the metaverse, recorded an operating loss of $4.65 billion in the last quarter of 2023. Meta keeps doubling down on its bet on the metaverse as its expenses to develop virtual reality hit&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-02T09:50:20.000Z",
    "title": "Forget Bitcoin, This Billionaire Is Betting Big On Solana For 2024",
    "url": "https://www.newsbtc.com/news/forget-bitcoin-this-billionaire-is-betting-big-on-solana-for-2024/",
    "description": "In the dynamic world of cryptocurrency, Arthur Hayes, the former CEO of BitMEX, is painting an optimistic picture for the potential recovery and growth of Solana in the crypto market. Known for his adept navigation through market fluctuations, Hayes recently shed light on Solana&#8217;s positive trajectory, emerging from the shadows cast by the downfall and legal entanglements of FTX. Solana (SOL), once the favorite of the now-convicted founder Sam Bankman-Fried, had faced uncertain speculations about its destiny in the aftermath of the FTX collapse. However, Hayes&#8217; sanguine remarks have reignited interest in the network&#8217;s future possibilities. Related Reading: Stablecoins Surge: USDT Leads $400 Million Inflows, Signaling Investor Confidence With a history of accurate market predictions, Hayes divulged his investment strategy in a recent essay. Within it, he explored the potential downturn of Bitcoin (BTC) and his decision to divest some tokens to minimize losses, including Solana and Bonk tokens. Solana Recovery Sparks Hayes&#8217; Optimism For Strategic Altcoin Investments Hayes envisions a robust investment in Solana and various altcoins if Bitcoin&#8217;s price dips below $35,000, signaling his confidence in Solana&#8217;s prospective recovery and growth. I think it might be time to get back on the train fam. Maybe after a few US banks bite the dust this weekend. pic.twitter.com/SxCwK3BVYB — Arthur Hayes (@CryptoHayes) February 1, 2024 Solana&#8217;s market performance has been marked by notable price swings. Following a bullish surge in late 2023, the cryptocurrency experienced a correction in early 2024 but has showcased resilience, maintaining a price indicative of investor trust. Hayes&#8217; earlier bullish comments on Solana have coincided with a price uptick, adding credibility to his positive outlook. His recent commentary has sparked renewed optimism in the crypto community regarding Solana&#8217;s potential, particularly in the aftermath of the FTX catastrophe. Fam I have something embarrassing I must admit. I just bot $SOL, I know its a Sam-coin piece of dogshit L1 that at this point is just a meme. But it is going up, and I&#8217;m a degen. Let&#8217;s Fucking Go! — Arthur Hayes (@CryptoHayes) November 2, 2023 Emphasizing Solana&#8217;s promise, Hayes took to his social media platforms to express his bullish sentiments, sharing a chart illustrating the cryptocurrency&#8217;s price movements. The post swiftly gained traction, proposing a strategic approach to rejuvenating the Solana market, especially in the face of potential turbulence in the U.S. banking system. Solana currently trading at $100.8881 on the daily chart: TradingView.com SOL Rollercoaster: From Correction To Bullish Optimism Solana&#8217;s journey in the market has been a rollercoaster of highs and lows. Commencing from a modest position in October 2023, SOL soared to impressive heights by Christmas before undergoing a correction with the onset of the new year. Nevertheless, the digital currency has displayed resilience, charting a course that hints at potential recovery and growth. SOL price climbs in the last 24 hours. Source: Coingecko Related Reading: XRP Price Poised For Liftoff? Whale Holdings Soar Despite Ripple Hack The former BitMEX big boss Hayes is expressing optimism about Solana&#8217;s recovery and growth potential. His bullish stance, coupled with his market acumen and past successful predictions, has reignited interest and hope within the crypto community regarding Solana&#8217;s future prospects. Featured image from Adobe Stock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-02T10:04:56.000Z",
    "title": "Ripple’s XRPL Soars: CEO Graham Rodford Expects $30-50 Trillion XRP Trading by 2025 – Will it Propel Price to $900?",
    "url": "https://www.crypto-news-flash.com/ripples-xrpl-soars-ceo-graham-rodford-expects-30-50-trillion-xrp-trading-by-2025-will-it-propel-price-to-900/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-xrpl-soars-ceo-graham-rodford-expects-30-50-trillion-xrp-trading-by-2025-will-it-propel-price-to-900",
    "description": "<img width=\"1792\" height=\"1024\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-02-08.26.33-Create-an-image-representing-the-soaring-success-of-Ripples-XRPL-as-envisioned-by-CEO-Graham-Rodford-with-an-expectation-of-30-50-trillion-in-XRP-.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-02-08.26.33-Create-an-image-representing-the-soaring-success-of-Ripples-XRPL-as-envisioned-by-CEO-Graham-Rodford-with-an-expectation-of-30-50-trillion-in-XRP-.png 1792w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-02-08.26.33-Create-an-image-representing-the-soaring-success-of-Ripples-XRPL-as-envisioned-by-CEO-Graham-Rodford-with-an-expectation-of-30-50-trillion-in-XRP--300x171.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-02-08.26.33-Create-an-image-representing-the-soaring-success-of-Ripples-XRPL-as-envisioned-by-CEO-Graham-Rodford-with-an-expectation-of-30-50-trillion-in-XRP--1200x686.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-02-08.26.33-Create-an-image-representing-the-soaring-success-of-Ripples-XRPL-as-envisioned-by-CEO-Graham-Rodford-with-an-expectation-of-30-50-trillion-in-XRP--768x439.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-02-08.26.33-Create-an-image-representing-the-soaring-success-of-Ripples-XRPL-as-envisioned-by-CEO-Graham-Rodford-with-an-expectation-of-30-50-trillion-in-XRP--1536x878.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-02-08.26.33-Create-an-image-representing-the-soaring-success-of-Ripples-XRPL-as-envisioned-by-CEO-Graham-Rodford-with-an-expectation-of-30-50-trillion-in-XRP--150x86.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/DALL·E-2024-02-02-08.26.33-Create-an-image-representing-the-soaring-success-of-Ripples-XRPL-as-envisioned-by-CEO-Graham-Rodford-with-an-expectation-of-30-50-trillion-in-XRP--450x257.png 450w\" sizes=\"(max-width: 1792px) 100vw, 1792px\" />Ripple&#8217;s CEO, Graham Rodford, forecasts $30-50 trillion in XRPL trading by 2025, potentially propelling XRP&#8217;s price to around $900. Recent analyses and market dynamics suggest significant upcoming movements for XRP, amidst Ripple&#8217;s expanding ecosystem across payments, NFTs, and real-world asset tokenization. In an electrifying disclosure at Ripple&#8217;s Swell 2023, Graham Rodford, CEO and co-founder of [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-02T09:43:47.000Z",
    "title": "Binance Unveils Web3 Wallet-Integrated Inscriptions Marketplace",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/binance-unveils-web3-wallet-integrated-inscriptions-marketplace/",
    "description": "<p>This groundbreaking platform is integrated directly within the Binance Web3 Wallet. This will provide users with a seamless and intuitive interface for trading and minting inscriptions with a wide variety of tokens. Binance is Empowering the Inscriptions Market Inscriptions represent a revolutionary step forward in the world of digital assets. They allow us to embed [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/binance-unveils-web3-wallet-integrated-inscriptions-marketplace/\">Binance Unveils Web3 Wallet-Integrated Inscriptions Marketplace</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]