[
  {
    "source": "CoinDesk",
    "date": "2023-09-05T20:34:16.000Z",
    "title": "Coinbase Creates New Crypto Lending Service Geared Toward Large Investors",
    "url": "https://www.coindesk.com/business/2023/09/05/coinbase-creates-new-crypto-lending-service-geared-toward-large-investors/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Coinbase (COIN) raised $57 million for the platform as of Sept. 1, according to an SEC filing."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-05T20:34:09.000Z",
    "title": "Gitcoin Co-Founder Kevin Owocki Says His Return Won't Make Him Center of the Network",
    "url": "https://decrypt.co/155031/gitcoin-co-founder-kevin-owocki-says-his-return-wont-make-him-center-of-the-network",
    "description": "“To be clear, I’m not dictating. I’m bottoms-up gathering intelligence and helping them synthesize their roadmap together,\" he told Decrypt."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-05T20:09:59.000Z",
    "title": "Bored Ape Creator Giving Away Bitcoin in Ordinals Puzzle Game",
    "url": "https://decrypt.co/155022/bored-ape-creator-giving-away-bitcoin-ordinals-puzzle-game",
    "description": "Yuga Labs has launched a 13-week puzzle-solving competition around its TwelveFold Ordinals, with Bitcoin prizes available for players."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T20:19:42.000Z",
    "title": "Oxford scientists develop GPU-accelerated limit order book sim to teach AI how to trade ",
    "url": "https://cointelegraph.com/news/oxford-scientists-develop-gpu-accelerated-limit-order-book-sim-to-teach-ai-how-to-trade",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/5e79372a-490f-4568-9498-03f452dd7aee.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The first of its kind architecture gives up to a 7X speedup over traditional training methods.</p>\n                    <p><p>A multidisciplinary research team from the University of Oxford recently developed a GPU-accelerated limit order book (LOB) simulator called JAX-LOB, the first of its kind. </p><p>JAX is a tool for training high-performance machine learning systems developed by Google. In the context of a LOB simulator, it allows artificial intelligence models to train directly on financial data. </p><p>The Oxford research team created a novel method by which JAX could be used to run a LOB simulator using only GPUs. Traditionally, LOB sims are ran using computer processing units (CPUs). By running them directly on a GPU chain, where modern AI training occurs, AI models are able to skip several communication steps. According to the Oxford team’s pre-print research paper, this gives a speed <a href=\"https://arxiv.org/pdf/2308.13289.pdf\" target=\"_blank\" rel=\"noopener nofollow\">increase</a> of up to 7X. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/7aeab9e7-879a-4adc-95ff-78f659db25e2.jpg\"  /><figcaption style=\"text-align: center;\">Source: <a href=\"https://arxiv.org/pdf/2308.13289.pdf\" target=\"_blank\" rel=\"noopener nofollow\">Frey, et. al., 2023</a></figcaption></figure><p>LOB dynamics are among the most scientifically studied facets of finance. In the stock market, for example, LOBs allow full-time traders to maintain liquidity throughout daily sessions. And in the cryptocurrency world, LOBs are embraced at nearly every level by professional investors. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/the-role-of-central-limit-order-book-dexs-in-decentralized-finance\"><strong><em>The role of central limit order book DEXs in decentralized finance</em></strong></a></p><p>Training an AI system to understand LOB dynamics is a difficult and data-intensive task that, due to the nature and complexity of the financial market, relies on simulations. And the more accurate and powerful the simulation, the more efficient and useful the models trained on them tend to be. </p><p>According to the Oxford team’s paper, finding ways to optimize this process is of the utmost importance:</p><blockquote>“Due to their central role in the financial system, the ability to accurately and efficiently model LOB dynamics is extremely valuable. For example, it might allow a financial company to offer better services or may enable the government to predict the impact of financial regulation on the stability of the financial system.”</blockquote><p>As the first of its kind, JAX-LOB is still in its infancy. The researchers stress the need for further study in their paper, but some experts are already predicting that it could have a positive impact in the fields of AI and fintech. </p><p>Jack Clark, co-founder of Anthropic, recently <a href=\"https://importai.substack.com/p/import-ai-339-open-source-ai-culture\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a>: </p><blockquote>“Software like JAX-LOB is interesting as it seems like the exact sort of thing that a future powerful AI may use to conduct its own financial experiments.”</blockquote><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T20:13:17.000Z",
    "title": "Bitcoin range trades as volatility subsides, will TON, LINK, MKR and XTZ follow?",
    "url": "https://cointelegraph.com/news/bitcoin-range-trades-as-volatility-subsides-will-ton-link-mkr-and-xtz-follow",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/1b907f61-f423-44e3-86f4-3e743feb645a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin’s failed breakout to the upside hints that range-bound price action could be set to continue. Meanwhile, TON, LINK, MKR and XTZ begin to perk up.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) tried to break out of its range last week, but the bulls could not sustain the higher levels. Bitcoin is back inside the range and is trading near the $26,000 level. The price action of the past few days has formed two successive Doji candlestick patterns on the weekly chart, indicating uncertainty about the next directional move.</p><p>Although it is difficult to predict the direction of the breakout, the downside may be limited in the near term on expectations that the United States Securities and Exchange Commission (SEC) <a href=\"https://cointelegraph.com/news/former-sec-chair-spot-bitcoin-etf-approval-inevitable-despite-delays\">may eventually approve one or more pending applications</a> for a spot Bitcoin exchange-traded fund. Former commission chair Jay Clayton sounded confident when he said in a recent interview that “an approval is inevitable.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/731fccc7-e3e8-4f85-967a-f5dae0a46ed4.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto market data daily view. Source:</em><em> </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>In the near term, it is difficult to pinpoint a specific catalyst that could shake Bitcoin out of its range. The lack of clarity about Bitcoin’s next trending move has kept most major altcoins under pressure.</p><p>Only a handful of altcoins are showing signs of strength in the short term. Let’s study the charts of top-5 cryptocurrencies that may start a rally if they break above their respective overhead resistance levels.</p><h2>Bitcoin price analysis</h2><p>Bitcoin is back inside the $24,800 to $26,833 range, but a positive sign is that the bulls continue to buy the dips as seen from the long tail on the Sep. 1 candlestick.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/e9145a2f-e466-4cba-a833-a18735b9b6f6.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Although the downsloping moving averages indicate advantage to bears, the gradually recovering relative strength index (RSI) shows that the bearish momentum may be weakening. The first sign of strength will be a break and close above the range at $26,833. If that happens, the BTC/USDT pair could retest the Aug. 29 intraday high of $28,142.</p><p>If bears want to seize control, they will have to sink and sustain the price below $24,800. This is going to be a tough task as the bulls are likely to defend the level with all their might. Still, if the bears prevail, the pair could plunge to $20,000. There is a minor support at $24,000 but it may not halt the decline.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/44659c6b-8c4a-41e1-9a90-b4be7b7137b1.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The bears tried to pull the price below the immediate support at $25,300 but the bulls held their ground. Buyers will next try to build upon their strength by driving the price above the 20-exponential moving average. If they do that, it will indicate the start of a stronger recovery.</p><p>The 50-day simple moving average may act as a roadblock but it is likely to be crossed. That could clear the path for a possible rally to the overhead resistance at $26,833.</p><p>Sellers are likely to have other plans. They will try to sink the price below $25,300 and challenge the vital support at $24,800.</p><h2>Toncoin price analysis</h2><p>Toncoin (TON) is in an uptrend but the bears are trying to halt the up-move near the overhead resistance at $2.07.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/9d22963e-f42f-4aeb-a999-c1fbd5a27c23.png\"  /><figcaption style=\"text-align: center;\"><em>TON/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ASHIBUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Both moving averages have turned up, indicating advantage to buyers but the overbought levels on the RSI suggest that a minor correction or consolidation is possible. If the bulls do not give up much ground from the current level, the likelihood of a rally above $2.07 increases. The TON/USDT pair could then soar to $2.40.</p><p>Contrarily, a deeper correction could pull the price to the 20-day EMA ($1.58). A strong bounce off this level will suggest that the sentiment has turned positive and traders are buying on dips. The trend will turn negative if the 20-day EMA support cracks.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/d4cc7f09-41a4-4504-8685-09203441bfde.png\"  /><figcaption style=\"text-align: center;\"><em>TON/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The 4-hour chart shows that the bulls have been buying the pullback to the 20-EMA. This remains the key level to watch out for. If the price rebounds off the 20-EMA with strength, the pair could retest the local high at $1.98. A break above it could challenge the resistance at $2.07.</p><p>On the contrary, if the 20-EMA support breaks down, it will indicate that traders are rushing to the exit. That could start a deeper pullback toward the 50-SMA. A bounce off this level could face selling at the 20-EMA but if this roadblock is cleared, it will suggest that bulls are back in the driver’s seat.</p><h2>Chainlink price analysis</h2><p>Chainlink (<a href=\"https://cointelegraph.com/chainlink-price-index\">LINK</a>) has been trading inside a large range between $5.50 and $9.50 for the past several months. The bears pulled the price below the support of the range on June 10 but they could not sustain the lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/ec0a2452-f893-4702-8c3c-b8d87061514e.png\"  /><figcaption style=\"text-align: center;\"><em>LINK/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AUNIUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The LINK/USDT pair dropped close to the support of the range on Aug. 17 but the bulls bought this dip as seen from the long tail on the candlestick. Buyers are trying to start a recovery but are facing resistance near the 20-day EMA ($6.24). Hence, this becomes an important level to look out for.</p><p>If buyers propel the price above the 20-day EMA, the pair could start its journey toward the 50-day SMA ($6.95). There is a minor resistance at $6.40 but it is likely to be crossed.</p><p>On the contrary, if the price turns down sharply from the 20-day EMA, it will suggest that the sentiment remains negative and traders are selling on rallies. That could pull the price down to $5.50.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/04d99728-9c5c-4e49-b889-25359a1ef81b.png\"  /><figcaption style=\"text-align: center;\"><em>LINK/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The moving averages have flattened out on the 4-hour chart and the RSI is near the midpoint. This suggests that the selling pressure is reducing. Buyers will have to kick the price above $6.40 to start a new up-move. The pair could then rise to $6.87 and later to $7.07.</p><p>Alternatively, if the price turns down from $6.40, it will signal that bears are selling on rallies. That may keep the pair range-bound between $5.50 and $6.40 for a while longer. </p><p><strong><em>Related: </em><a href=\"https://cointelegraph.com/news/bitcoin-price-chart-analyst-nothing-changed\"><em>Bitcoin chart highlights $24.7K as analyst says ‘nothing has changed’</em></a></strong></p><h2>Maker price analysis</h2><p>Maker (<a href=\"https://cointelegraph.com/maker-price-index\">MKR</a>) has taken support near $1,000 and is attempting to resume its uptrend. The bulls are facing resistance at the downtrend line but a positive sign is that they have kept the price above the 20-day EMA ($1,107).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/2ab8d1fd-ae4a-4bde-a2dd-eaeccc8bcad3.png\"  /><figcaption style=\"text-align: center;\"><em>MKR/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AMKRUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If the price turns up from the current level, it will suggest that the sentiment has turned positive and traders are viewing dips as a buying opportunity. The bulls will then again try to push the price to $1,370.</p><p>Instead, if the price continues lower and breaks below the 20-day EMA, it will signal that the bears are fiercely defending the downtrend line. The MKR/USDT pair may then slump to the strong support at $980 and eventually to $860.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/ff79c11f-d3c1-4e4e-a635-9aa9cab743c9.png\"  /><figcaption style=\"text-align: center;\"><em>MKR/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The 4-hour chart shows that the bulls pushed the price above the downtrend line but they are struggling to sustain the higher levels. This indicates that the bears have not yet given up and they continue to sell on rallies.</p><p>The 20-EMA is witnessing a tough battle between the bulls and the bears. If the price rebounds off this level, the bulls will make one more attempt to overcome the obstacle at $1,186 and then at $1,227. If this zone is scaled, the rally could reach $1,280.</p><p>Conversely, if the price sustains below the 20-EMA, it could open the gates for a possible decline to the 50-SMA and then to $1,040.</p><h2>Tezos price analysis</h2><p>Tezos (<a href=\"https://cointelegraph.com/xtz-price-index\">XTZ</a>) has been witnessing a tussle between the bulls and the bears near the strong support at $0.70. The failure of the bears to sink and sustain the price below this level indicates buying at lower levels. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/6b2e99f9-9f1d-4140-86a7-bd29ea72d456.png\"  /><figcaption style=\"text-align: center;\"><em>XTZ/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=KUCOIN%3AXDCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The downsloping moving averages indicate advantage to bears but the rising RSI suggests that the bearish momentum is reducing. A close above the 20-day EMA ($0.71) will be the first sign of strength. That could pave the way for a rally to the downtrend line. </p><p>This level may act as a formidable hurdle but if the bulls overcome it, the XTZ/USDT pair may start a new up-move. The pair could first rally to $0.94 and subsequently to $1.04. This positive view will invalidate if the price skids and sustains below $0.66.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/e5b388c6-f1ed-4b44-8055-ca46a1f5c529.png\"  /><figcaption style=\"text-align: center;\"><em>XTZ/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The 4-hour chart shows that the price is consolidating between $0.69 and $0.66. The crisscrossing moving averages and the RSI just below the midpoint suggest that bears have a slight edge. Sellers will try to drag the price to the strong support at $0.66. If this level crumbles, the pair may start the next leg of the downtrend to $0.61.</p><p>On the other hand, if the price turns up and rises above $0.69, it will indicate sold buying at lower levels. The pair could then surge to the overhead resistance at $0.74. Buyers will have to thrust the price above the downtrend line to signal the start of a new up-move.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-05T20:20:02.000Z",
    "title": "MetaMask rolls out ‘Sell’ feature, allowing users to cash out crypto to fiat in-app",
    "url": "https://cryptoslate.com/metamask-adds-sell-feature-allowing-users-to-cash-out-crypto-to-fiat-in-app/",
    "description": "<p>Popular Ethereum wallet MetaMask announced a &#8220;Sell&#8221; feature on Sept. 5 that will allow users to withdraw their cryptocurrency as cash. That announcement indicates users can now sell cryptocurrency in their Metamask Portfolio for fiat currency. Once a user sells their crypto, they can send the converted funds to their bank account or to their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/metamask-adds-sell-feature-allowing-users-to-cash-out-crypto-to-fiat-in-app/\">MetaMask rolls out &#8216;Sell&#8217; feature, allowing users to cash out crypto to fiat in-app</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T20:29:43.000Z",
    "title": "Worldcoin Price Prediction 2023 – 2030: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, ... <a title=\"Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/worldcoin-price-prediction/\" aria-label=\"More on Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T20:12:18.000Z",
    "title": "Genesis Global Trading’s sudden closure sends shockwaves",
    "url": "https://www.cryptopolitan.com/genesis-global-tradings-sudden-closure/",
    "description": "In a recent email communication sent out to its clients, Genesis Global Trading (GGT), a well-known player in the cryptocurrency trading space, has announced the impending closure of its spot crypto trading operations later this month. This decision is expected to have notable implications for the crypto trading landscape and for Genesis as a whole. ... <a title=\"Genesis Global Trading&#8217;s sudden closure sends shockwaves\" class=\"read-more\" href=\"https://www.cryptopolitan.com/genesis-global-tradings-sudden-closure/\" aria-label=\"More on Genesis Global Trading&#8217;s sudden closure sends shockwaves\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-05T20:25:48.000Z",
    "title": "Jim Cramer endorses Binance and BNB despite recent troubles",
    "url": "https://crypto.news/jim-cramer-endorses-binance-and-bnb-despite-recent-troubles/",
    "description": "“Mad Money” host Jim Cramer says he’s bullish on Binance and its BNB token, even as the crypto exchange faces regulatory hurdles and liquidity concerns. Jim Cramer, the American television host renowned for his financial acumen, has taken a bullish&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-05T20:20:12.000Z",
    "title": "Tether becomes one of US Treasury bills’ major holders",
    "url": "https://crypto.news/tether-becomes-one-of-us-treasury-bills-major-holders/",
    "description": "Tether’s CTO, Paolo Ardoino, reveals that the company bought more US Treasury bills than the United Arab Emirates, Australia, Japan, and Mexico. In a post on X (formerly Twitter), Ardoino highlights that Tether&#8217;s current hold in the US Treasury bills&#8230;"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-05T20:30:00.000Z",
    "title": "Crypto Casino Stake Quickly Recovers After $41 Million Hacking Loss",
    "url": "https://coinedition.com/crypto-casino-stake-quickly-recovers-after-41-million-hacking-loss/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Top_Casino_Sites_with_Cryptocurrency_Bonuses_for_2023_Sponsored-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto casino, and gambling platform Stake.com experienced a security breach that led to the loss of major assets. The platform lost 6,000 ETH, 3.9 million USDT, 1.1 million USDC, and 900,000 DAI. The Curacao-based sports betting company didn’t share the amount of money lost; however, PeckShield did. PeckShield is a blockchain security and data analytics [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-casino-stake-quickly-recovers-after-41-million-hacking-loss/\">Crypto Casino Stake Quickly Recovers After $41 Million Hacking Loss</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]