[
  {
    "source": "CoinDesk",
    "date": "2024-02-08T16:45:00.000Z",
    "title": "Crypto for Advisors: Bitcoin as a Building Block for Portfolios",
    "url": "https://www.coindesk.com/business/2024/02/08/crypto-for-advisors-bitcoin-as-a-building-block-for-portfolios/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A practical, unbiased, and proven approach could classify bitcoin as another building block in institutional investors' portfolios."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-08T17:06:47.000Z",
    "title": " Thai SEC files charges against former Zipmex CEO for ‘corruption and deception’ ",
    "url": "https://cointelegraph.com/news/thai-sec-charges-former-zipmex-ceo-fraud",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYTRmMDY2YzktZjBkYi00OTdhLTkxZGEtNDM2ZTdhYzA0Y2E4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The information provided by Zipmex Thailand under the former CEO regarding assets in user Z Wallets was inconsistent with the Thai SEC’s investigation.</p>\n                    <p><p>Thailand’s Securities and Exchange Commission (SEC) has charged former Zipmex CEO Akalarp Yimwilai with fraud for misleading customers with information related to the use of their digital assets.</p><p>In a Feb. 8 statement, the Thai SEC <a href=\"https://www.sec.or.th/TH/Pages/News_Detail.aspx?SECID=10537\" target=\"_blank\" rel=\"noopener nofollow\">said</a> during his time as CEO of Zipmex Thailand, Akalarp presented false statements regarding assets in user Z Wallets being transferred to crypto wallets abroad. According to the SEC, this discrepancy with Zipmex’s terms and conditions amounted to “corruption and deception” by concealing information from customers. </p><p>The regulator referred a complaint on Akalarp’s alleged actions to Thailand’s Office of the Provincial Crime Suppression Division for possible legal action. Zipmex Thailand was implicated for similar allegations of fraud over reports of customer assets inconsistent with the SEC’s investigation.</p><p><a href=\"https://cointelegraph.com/news/thai-sec-charges-former-zipmex-ceo-fraud\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-08T16:53:29.000Z",
    "title": " Bitcoin price nears $45.5K as altcoins tease &#039;historic breakout&#039; ",
    "url": "https://cointelegraph.com/news/bitcoin-price-nears-45-5-k-altcoins-historic-breakout",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNTQ0Mzc0NTEtMTQ3OS00YTdiLTk3ZTktZDcyMzk5NWFkOTEzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin bulls are trying hard to break loose from a stubborn BTC price trading range.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) neared $45,500 after the Feb. 8 Wall Street open as bullish continuation brought the highest BTC price levels in a month.</p><p>Data from <a href=\"https://subscription.cointelegraph.com/\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> tracked ongoing strength in BTC/USD, which built on the previous day’s gains.</p><p>The pair was up 2.5% on the day at the time of writing, setting a precedent for strong moves on major altcoins.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-nears-45-5-k-altcoins-historic-breakout\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-08T17:00:55.000Z",
    "title": "Major institutions signal growing interest in Bitcoin ETFs",
    "url": "https://cryptoslate.com/insights/major-institutions-signal-growing-interest-in-bitcoin-etfs/",
    "description": "<p>Quick Take The market for Bitcoin ETFs is witnessing an uptick in interest from institutional investors. BlackRock recently noticed an expansion in the holder list of its ETF, IBIT. The new entrants include Redwood Asset Management Inc. and Advisorshares Investments LLC, according to ETF Bloomberg analyst Eric Balchunas. This could potentially serve as a precursor for [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/major-institutions-signal-growing-interest-in-bitcoin-etfs/\">Major institutions signal growing interest in Bitcoin ETFs</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-08T16:57:03.000Z",
    "title": "Common Wealth Announces the Launch of the World’s First Free VC Fund",
    "url": "https://www.cryptoglobe.com/latest/2024/02/common-wealth-announces-the-launch-of-the-worlds-first-free-vc-fund/",
    "description": "8 February 2024 [Lisbon, Portugal]: Common Wealth, the powerful, all-in-one platform for early-stage Web3 investments, today announces the launch of a world-first initiative: a Free “earn-to-own” VC Fund. This launch represents a completely novel fusion of community-driven Web3 principles with the sophistication of venture capital investment. The initiative will see Common Wealth’s first fund opening […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-08T16:51:48.000Z",
    "title": "Shiba Inu (SHIB) Surges Overnight – Is Dogecoin (DOGE) Poised for an Even Bigger Short-Term Leap?",
    "url": "https://cryptodaily.co.uk/2024/02/shiba-inu-shib-surges-overnight-is-dogecoin-doge-poised-for-an-even-bigger-short-term-leap",
    "description": "Embark on the latest developments in Dogecoin (DOGE) and Shiba Inu (SHIB) as they navigate the dynamic crypto market. From DOGE's adoption surge to SHIB's dramatic recovery and technical outlooks, get insights into the potential future trends of these popular meme coins."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T17:00:00.000Z",
    "title": "New Cryptocurrency Costing Cents Set To Grow 100x in 2024",
    "url": "https://www.cryptopolitan.com/new-cryptocurrency-costing-cents-set-to-grow-100x-in-2024/",
    "description": "In the dynamic cryptocurrency market, where fortunes can be made overnight, a new digital currency priced just at cents captured the attention of investors and crypto enthusiasts alike. Predicted to skyrocket by an astonishing 100x in 2024, this promising token, Pandoshi (PAMBO), stands at the brink of becoming one of the year&#8217;s most spectacular success [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T17:00:00.000Z",
    "title": "3 Hidden Gem Cryptos Under $0.50 Ready to Explode with 5-Fold Returns in The Upcoming Period",
    "url": "https://www.cryptopolitan.com/3-hidden-gem-cryptos-under-0-50-ready-to-explode-with-5-fold-returns-in-the-upcoming-period/",
    "description": "TLDR Top altcoins like Chiliz (CHZ) and Stellar (XLM) have performed variably thus far in 2024. As a result, investors are confused about which crypto to buy for five-fold returns in the long term. Meanwhile, Rebel Satoshi ($RBLZ), an upcoming meme coin, has emerged as 2024’s crypto gem after securing over $1.5 million in funding [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T16:48:20.000Z",
    "title": "Solana Price Prediction 2024-2033: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2024-2033 How much is SOL worth? The live&#160;Solana price today&#160;is $96.26 USD with a 24-hour trading volume of $1,429,767,001 USD.&#160;We update our SOL to USD price in real-time.&#160;Solana is down 0.20% in the last 24 hours.&#160;The current CoinMarketCap ranking is #5, with a live market cap of $41,977,739,045 USD.&#160;It has a circulating [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-08T17:00:34.000Z",
    "title": "Ethereum Breaks Above $2,400: This Metric Points To Further Upside",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-breaks-2400-metric-points-further-upside/",
    "description": "On-chain data shows an Ethereum metric is giving a bullish signal as the cryptocurrency&#8217;s price has broken past the $2,400 barrier during the past day. Ethereum Has Continued To Leave Exchanges Recently In a CryptoQuant Quicktake post, an analyst explained the recent relationship between the Ethereum price and data of the exchange netflow indicator. The &#8220;exchange netflow&#8221; here refers to a metric that keeps track of the net amount of the asset entering or exiting out of the wallets of all centralized exchanges. The indicator&#8217;s value is calculated by subtracting the outflows from the inflows. Related Reading: Analyst Reveals Potential Trigger For A 32% Cardano (ADA) Rally When the flow has a positive value, the inflows are overwhelming the outflows right now, and a net number of coins is moving into the custody of these platforms. One of the main reasons investors might deposit their tokens on the exchanges is for selling-related purposes. This trend can potentially have bearish implications for the asset&#8217;s price. On the other hand, the negative indicator implies the holders are making net withdrawals from these platforms. Such a trend suggests the investors may be accumulating for the long-term, which would naturally be bullish for the cryptocurrency&#8217;s value. Now, here is a chart that shows the trend in the Ethereum exchange netflow, as well as its 14-day exponential moving average (EMA), over the last few months: The value of the metric seems to have been quite red in recent days &#124; Source: CryptoQuant As highlighted by the quant in the above graph, the Ethereum price has observed an overall bullish trend in the last few months as the 14-day EMA exchange netflow has mostly been inside the negative territory. There have been some spikes in the positive region. With these net deposits, the cryptocurrency has usually encountered some degree of resistance, implying that these transfers added to the selling pressure in the market. Recently, the indicator has assumed red values for more than a week straight, suggesting that investors have been constantly making net withdrawals. The scale of the negative spikes has also been quite significant this time, meaning that some whales are involved. Off the back of this potential accumulation from the investors, Ethereum has observed its recovery below the $2,400 level. Since the netflow has continued to be quite negative recently, it&#8217;s possible that this rally isn&#8217;t all the coin would see; there may still be potential for further upside. Related Reading: Bitcoin Coinbase Premium Is Negative: What It Means For Price Recovery Spikes back into positive territory may be to watch for; however, if the pattern followed in the past few months is to be believed, they may cause the cryptocurrency to hit at least a local top. ETH Price At the time of writing, Ethereum is trading at around $2,420, up more than 6% over the past week. Looks like the price of the asset has shot up over the last few days &#124; Source: ETHUSD on TradingView Featured image from DrawKit Illustrations on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  }
]