[
  {
    "source": "CoinDesk",
    "date": "2023-08-08T20:39:00.000Z",
    "title": "Venture-Backed Saddle Finance Proposes Wind-Down, Dissolution",
    "url": "https://www.coindesk.com/tech/2023/08/08/venture-backed-saddle-finance-proposes-wind-down-dissolution/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Ethereum-based crypto trading protocol will shut down and distribute its treasury to investors."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-08T20:57:08.000Z",
    "title": "Feds Still Plan to Charge Sam Bankman-Fried With Campaign Finance Violations",
    "url": "https://decrypt.co/151753/sam-bankman-fried-campaign-finance-charge",
    "description": "Prosecutors had dropped a campaign finance charge against SBF back in July. "
  },
  {
    "source": "Decrypt",
    "date": "2023-08-08T20:48:52.000Z",
    "title": "Elon Musk's 'Silly' Dogecoin Tweets Are Dragging Out Insider Trading Lawsuit, Lawyers Say",
    "url": "https://decrypt.co/151752/elon-musks-silly-dogecoin-tweets-are-dragging-out-insider-trading-lawsuit-lawyers-say",
    "description": "Tesla CEO Elon Musk's attorneys filed a motion to have a Dogecoin insider trading class-action lawsuit dismissed... again."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-08T20:30:00.000Z",
    "title": "ChatGPT and Claude are ‘becoming capable of tackling real-world missions,’ say scientists",
    "url": "https://cointelegraph.com/news/chatgpt-and-claude-are-becoming-capable-of-tackling-real-world-missions-say-scientists",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/02200cf7-858e-4db9-bb6f-1ec36aa844c3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The scientists developed a tool called \"AgentBench\" to benchmark LLM models as agents.</p>\n                    <p><p>Nearly two dozen researchers from Tsinghua University, Ohio State University and the University of California at Berkeley collaborated to create a method for measuring the capabilities of large language models (LLMs) as real-world agents.</p><p>LLMs such as OpenAI’s ChatGPT and Anthropic’s Claude have taken the technology world by storm over the past year, as cutting-edge “chatbots” have proven useful at a variety of tasks, including coding, <a href=\"https://cointelegraph.com/news/can-ai-tools-like-chatgpt-replace-dedicated-crypto-trading-bots\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/can-ai-tools-like-chatgpt-replace-dedicated-crypto-trading-bots/amp\">cryptocurrency trading</a> and text generation. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/open-ai-launch-gptbot-web-crawler-amid-gpt5-trademark\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/open-ai-launch-gptbot-web-crawler-amid-gpt5-trademark/amp\"><strong><em>OpenAI launches web crawler 'GPTBot' amid plans for next model: GPT-5</em></strong></a></p><p>Typically, these models are benchmarked based on their ability to output text perceived as humanlike or by their scores on plain-language tests designed for humans. By comparison, far fewer papers have been published on the subject of LLM models as agents. </p><p>Artificial intelligence (AI) agents perform specific tasks, such as following a set of instructions within a specific environment. For example, researchers will often train an AI agent to navigate a complex digital environment as a method for studying the use of machine learning to develop autonomous robots safely.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/L_4BPjLBF4E\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Traditional machine learning agents like the one in the video above aren’t typically built as LLMs due to the prohibitive costs involved with training models such as ChatGPT and Claude. However, the largest LLMs have shown promise as agents.</p><p>The team from Tsinghua, Ohio State and UC Berkeley developed a tool called AgentBench to evaluate and measure LLM models’ capabilities as real-world agents, something the team claims is the first of its kind. </p><p>According to the researchers’ preprint paper, the main <a href=\"https://arxiv.org/pdf/2308.03688.pdf\" target=\"_blank\" rel=\"noopener nofollow\">challenge</a> in creating AgentBench was going beyond traditional AI learning environments — video games and physics simulators — and finding ways to apply LLM abilities to real-world problems so they could be effectively measured. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/371013e6-19fd-473a-b9cd-0aa506e09ed4.jpg\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Flowchart of AgentBench's evaluation method. Source: Liu, et al</em></figcaption></figure><p>What they came up with was a multidimensional set of tests that measures a model’s ability to perform challenging tasks in a variety of environments. </p><p>These include having models perform functions in an SQL database, working within an operating system, planning and performing household cleaning functions, shopping online, and several other high-level tasks that require step-by-step problem-solving. </p><p>Per the paper, the largest, most expensive models outperformed open-source models by a significant amount: </p><blockquote>“[W]e have conducted a comprehensive evaluation of 25 different LLMs using AgentBench, including both API-based and open-source models. Our results reveal that top-tier models like GPT-4 are capable of handling a wide array of real-world tasks, indicating the potential for developing a potent, continuously learning agent.”</blockquote><p>The researchers went so far as to claim that “top LLMs are becoming capable of tackling complex real-world missions” but added that open-sourced competitors still have a “long way to go.”</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-08T20:51:26.000Z",
    "title": "Federal Court Case Uses Blockchain Tech to Fight Russian and North Korean Hackers",
    "url": "https://cryptodaily.co.uk/2023/08/federal-court-case-uses-blockchain-tech-to-fight-russian-and-north-korean-hackers",
    "description": "<p>Chicago, Illinois, August 8th, 2023, Chainwire</p><p>For years, cryptocurrencies such as Bitcoin (BTC) and Ether (ETH) have been the favored methods of payment for cybercriminals. Ransomware crime rings rely almost exclusively on Bitcoin payments to extract vast sums from major institutions, including hospitals and providers of critical infrastructure. But, in a groundbreaking move, a&nbsp;federal court case&nbsp;in Chicago has turned the tables on cybercriminals by using inventive technology to digitally lock the criminals out of their blockchain accounts.</p><p>The case was brought against Russian and North Korean hackers who are under sanctions by the United States Treasury Department.</p>Mike Kanovitz, CEO of&nbsp;Jurat Blockchains, the firm behind the technology deployed in the case, remarked, &ldquo;It is encouraging to witness this invention in action, fighting criminals who misuse blockchains and give cryptocurrency a bad name.&rdquo; Kanovitz explained that &ldquo;Jurat technology provides the base layer for legal enforcement on blockchains by working in conjunction with official courts. It can help government officials prevent crime and lets cryptocurrency users access courts if they have had their cryptocurrency stolen, been defrauded, or lost their private keys.&rdquo;&nbsp;&nbsp;<p>The court&rsquo;s order applies to 16 individuals and international criminal organizations sanctioned under Executive Orders of the President of the United States. Among those targeted was Hydra Market, the focus of &ldquo;a collaborative initiative joined by the U.S. Department of Justice, Federal Bureau of Investigations, Drug Enforcement Administration, Internal Revenue Service Criminal Investigation, and Homeland Security Investigations,&rdquo; according to a&nbsp;U.S. Treasury Department press release.&nbsp;&nbsp;Another major target named in the lawsuit is the&nbsp;Lazarus Group, which engaged in &ldquo;malicious cyber activities and money-laundering of stolen virtual currency&rdquo; on behalf of the Democratic People&rsquo;s Republic of Korea.&nbsp;The state-sponsored hackers committed &ldquo;the largest virtual currency heist to date, worth almost $620 million, from a blockchain project linked to the online game Axie Infinity.&rdquo;</p><p>Using the first-of-its-kind judicial injunction, the federal court has locked all accounts belonging to the 16 criminals that contain the cryptocurrency $JTC. The coin emerged following an update to Bitcoin&rsquo;s software, resulting in a &ldquo;fork&rdquo; that left two blockchains, BTC and JTC, hosting the same accounts. Victims who previously lost $BTC can claim their $JTC using the Jurat Wallet app or by filing an action to enforce their legal rights in court. Industry estimates of cryptocurrency crimes range above $20 billion annually.&nbsp;</p><p>The case was handled by Jon Loevy, of Loevy &amp; Loevy Attorneys at Law in Chicago.</p><p>About Jurat Blockchains</p><p>Jurat Blockchains provides Web3 legal tech and reg tech for blockchains, smart contracts, and DAOs. It launched its first public blockchain, JTC, in 2022 and has additional layer 1 projects and dispute resolution system dApps in the pipeline. For further information about Jurat contact info@jurat.io or find us at www.jurat.io. To reach Loevy &amp; Loevy call 312-243-5900.</p>ContactMedia ManagerAndy ThayerLoevy &amp; Loevyinfo@jurat.io312-243-5900"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T20:47:56.000Z",
    "title": "Industry leaders join forces in SEAL 911 to combat DeFi cybersecurity threats",
    "url": "https://www.cryptopolitan.com/industry-leaders-join-forces-in-seal-911-to-combat-defi-cybersecurity-threats/",
    "description": "In the wake of the $70 million Curve Finance exploit, a collaborative initiative has been launched to bolster cybersecurity within the decentralized finance (DeFi) sector. The initiative, known as SEAL 911, is a Telegram bot designed to streamline communication with vetted security professionals during emergencies. Spearheaded by Sam (@samczsun), research partner and head of security ... <a title=\"Industry leaders join forces in SEAL 911 to combat DeFi cybersecurity threats\" class=\"read-more\" href=\"https://www.cryptopolitan.com/industry-leaders-join-forces-in-seal-911-to-combat-defi-cybersecurity-threats/\" aria-label=\"More on Industry leaders join forces in SEAL 911 to combat DeFi cybersecurity threats\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T20:35:55.000Z",
    "title": "Waterloo University launches Innovative AI Model to Reduce Bias in Medical Decision-Making",
    "url": "https://www.cryptopolitan.com/niversitys-launches-innovative-ai-model/",
    "description": "Waterloo, in the rapidly evolving landscape of artificial intelligence (AI), the University of Waterloo stands out with its latest groundbreaking research. The institution&#8217;s researchers have unveiled a pioneering AI model that promises to significantly reduce bias and bolster trust in machine learning, especially within the critical domain of medical decision-making. The dilemma of traditional machine ... <a title=\"Waterloo University launches Innovative AI Model to Reduce Bias in Medical Decision-Making\" class=\"read-more\" href=\"https://www.cryptopolitan.com/niversitys-launches-innovative-ai-model/\" aria-label=\"More on Waterloo University launches Innovative AI Model to Reduce Bias in Medical Decision-Making\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T20:32:22.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T20:27:59.000Z",
    "title": "The Dawn of Scientific Breakthroughs and Why Public Engagement Matters",
    "url": "https://www.cryptopolitan.com/major-scientific-breakthroughs/",
    "description": "A decade ago, at the Milken Institute&#8217;s 2013 gathering, Silicon Valley&#8217;s elite pondered a pressing question: Where is the groundbreaking innovation? Peter Thiel, a billionaire investor present at the event, humorously critiqued the state of technological advancements, suggesting that the world had settled for iPhones to share cat pictures instead of aspiring for flying cars. ... <a title=\"The Dawn of Scientific Breakthroughs and Why Public Engagement Matters\" class=\"read-more\" href=\"https://www.cryptopolitan.com/major-scientific-breakthroughs/\" aria-label=\"More on The Dawn of Scientific Breakthroughs and Why Public Engagement Matters\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-08T21:00:22.000Z",
    "title": "Sandbox Set For $133 Million Token Unlock, A Bearish Trigger For SAND Price?",
    "url": "https://www.newsbtc.com/sand/sandbox-set-for-133-million-token-unlock-a-bearish-trigger-for-sand-price/",
    "description": "Decentralized gaming platform, The Sandbox is set to execute a SAND token release valued at $133.86 million. According to data from TokenUnlocks, Sandbox will release 332.55 million SAND tokens into circulation on August 14, representing 16.16% of the token’s maximum supply.  New SAND Tokens In 2023 To Rise Over 700 Million With the upcoming SAND release, the total number of new SAND tokens in 2023 is expected to rise to 705.3 million. This latest unlock will add to the 372.75 million SAND released earlier during the last token unlock in February.  Based on more data from Token Unlocks, the newly released tokens will be allocated to various parties, including the Sandbox&#8217;s development team, project advisors, strategic and seed investors, and the project’s reserve.  SAND functions as the utility token of the Sandbox metaverse, serving as the platform&#8217;s payment medium and governance token. According to its design, SAND is expected to undergo a token unlock every six months until 2025. Currently, the number of circulating SAND tokens is 2.05 billion, representing 68.6% of SAND’s total supply. With the projected release on August 14, these figures are expected to jump to 2.39 billion and 84.76%, respectively. SAND trading at $0.40 on the daily chart &#124; Source: SANDUSD chart on Tradingview.com Related Reading: Massive Token Unlock: Ripple Releases One Billion XRP From Escrow Potential Impact of Token Release on SAND’s Price Token unlocks are common events in the crypto space, usually accompanied by fears of a bearish market. This is because the sudden introduction of massive tokens to the market creates a higher supply-to-demand ratio, which drives down asset prices.  Looking at on-chain data, this is one likely effect of SAND’s upcoming token unlock on its market price due to declining network growth on the Sandbox platform. Based on data from blockchain analytics firm IntoTheBlock, the number of new addresses on Sandbox is down by 66.87% in the last month, falling from a peak of 649 in July to its current value of 215.  The continuance of this trend means Sandbox may lack the necessary traction to counter the upcoming inflationary pressure, which may ultimately lead to a fall in price. Source: IntoTheBlock Related Reading: Aptos (APT) Gains By 10% Ahead Of July Token Release Following SAND’s last token release on February 14, SAND’s price movement was fairly positive, opening at $0.68 to trade as high as $0.72 and close at $0.71. In the subsequent days, SAND would record more gains, reaching a market value of $0.88 on Feb 20.  While token unlocks are widely expected to precipitate bearish pressure, their effects are still unpredictable. Investors are advised to watch out for major developments on Sandbox regarding network growth and whale movement. At the time of writing, CoinMarketCap data shows that SAND is trading at $0.40 with a 0.62% gain on the last day. However, the token is down on the weekly chart losing about 2.98% of its value.  Featured image from Binance Academy, chart from Tradingview."
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-08T20:20:00.000Z",
    "title": "Bitcoin Will Move Huge This Week: Predicts Popular Analyst",
    "url": "https://coinedition.com/bitcoin-will-move-huge-this-week-predicts-popular-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/btc3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/btc3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/btc3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/btc3-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/btc3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/btc3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/btc3-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/btc3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/btc3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/btc3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/btc3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/btc3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/btc3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/btc3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/btc3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/btc3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/btc3-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>YouTube crypto analyst Crypto Rover forecasts a rise in Bitcoin this week. The analyst believes that Bitcoin&#8217;s price will rally due to upcoming CPI figures and technical indicators presented by chart patterns. In a recent video uploaded on YouTube, Crypto Rover showed that Bitcoin’s historical volatility is low. He also revealed that the Bitcoin eight-hour [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-will-move-huge-this-week-predicts-popular-analyst/\">Bitcoin Will Move Huge This Week: Predicts Popular Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]