[
  {
    "source": "Cointelegraph",
    "date": "2023-06-02T08:04:53.000Z",
    "title": "DCG asks judge to consolidate class action suits to avoid conflicting decisions",
    "url": "https://cointelegraph.com/news/dcg-asks-judge-to-consolidate-class-action-suits",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/c7ca1f7f-9380-4e94-b5c4-fb8de29eb43a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>DCG and CEO Barry Silbert argued in a letter to Judge Stefan Underhill that both cases share the same facts, legal issues, and nearly identical class definitions.</p>\n                    <p><p>Venture capital firm Digital Currency Group (DCG), along with its CEO Barry Silbert, requested to consolidate two class action lawsuits over alleged losses during the crypto winter.</p><p>In a letter sent to United States District Judge Stefan Underhill in Connecticut, both defendants <a href=\"https://www.law360.com/articles/1683680/attachments/0\" target=\"_blank\" rel=\"noopener nofollow\">argued</a> that both cases “arise from the same facts, present overlapping legal issues and propose nearly identical class definitions.” </p><p>The defendants argued that consolidating the cases would be necessary to avoid conflicting decisions and promote judicial efficiency. In the letter, the defendants also informed Underhill that they have also asked U.S. District Judge Lewis Liman to transfer the case from New York to Connecticut. The letter wrote: </p><blockquote>“The motion will be fully briefed no later than June 13, 2023, and, if Judge Liman grants the motion to transfer to this Court, Defendants intend to quickly move to consolidate both actions.”</blockquote><p>Within the letter, the plaintiffs in Connecticut contested the move, arguing that it's premature to decide before the case in New York gets approved for transfer. They are also expecting the plaintiffs in New York to oppose the transfer because there is a lot of uncertainty in the nature and scope of the claims. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/dcg-settlement-with-genesis-still-undecided-as-30-day-mediation-period-proceeds\"><strong><em>DCG settlement with Genesis still undecided as 30-day mediation period proceeds</em></strong></a></p><p>The lawsuit in Connecticut alleges that Silbert orchestrated a misleading transaction to conceal signs of a $1.1 billion implosion after Three Arrows Capital (3AC) started liquidation proceedings. The defendants <a href=\"https://cointelegraph.com/news/genesis-creditors-file-securities-lawsuit-against-barry-silbert-and-dcg\">face allegations of committing securities fraud</a> for making misleading or false statements. </p><p>Amid the ongoing suits, DCG has decided to <a href=\"https://cointelegraph.com/news/digital-currency-group-dcg-shut-tradeblock\">close its prime brokerage subsidiary</a> TradeBlock. According to the venture capital firm, the decision stems from the state of the broader economy and the uncertain regulatory environment for crypto in the U.S. TradeBlock officially started the process of closing down on May 31. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/money-back-crypto-litigation/\"><strong><em>Get your money back: The weird world of crypto litigation</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-02T07:58:00.000Z",
    "title": "Circle To Launch USDC Stablecoin Natively On Arbitrum",
    "url": "https://cryptodaily.co.uk/2023/06/circle-to-launch-usdc-stablecoin-natively-on-arbitrum",
    "description": "<p>Circle has announced that it will be launching the USDC stablecoin natively on Arbitrum on the 8th of June, 2023.</p>\n<p>According to the company, the move will replace the bridged version of the stablecoin from Ethereum, which is currently in circulation.&nbsp;</p>\nNative To Arbitrum&nbsp;\n<p>With the announcement by Circle, USDC will be native to Arbitrum and will be the official version of the stablecoin recognized across the Arbitrum ecosystem. It will also eventually replace the bridged version of the stablecoin from Ethereum. In its statement, Circle stated that Arbitrum would rename the Ethereum-bridged version of the USDC stablecoin as USDC.e ahead of the launch of the native USDC on the 8th of June, 2023. The company added that it would also conduct an outreach to other apps in the ecosystem to make the same changes in their documentation and application UI.&nbsp;</p>\n\n<p>&ldquo;USDC issued by Circle will be native to Arbitrum and will be considered the official version of USDC for the Arbitrum ecosystem. Over time, native USDC liquidity will grow and replace the currently circulating &lsquo;bridged USDC&rsquo; liquidity that comes from Ethereum.&rdquo;</p>\n\nBenefits Of The Native USDC&nbsp;\n<p>Circle highlighted several benefits of the native USDC launching on the highly popular Arbitrum layer-2 network. According to the company, the biggest advantage would be bringing Cross-Chain Transfer Protocol (CCTP) to Arbitrum. This would eliminate bridge withdrawal delays. Other benefits highlighted by Circle include upgradable smart contracts and the possibility of introducing institutional on and off-ramps, along with other improvements.&nbsp;Upgradable smart contracts would allow Circle to conduct future enhancements to the contract.&nbsp;</p>\n<p>Circle also talked about liquidity migration in its statement, asserting that Arbitrum would collaborate with all ecosystem apps to ensure a smooth transition of liquidity from bridged USDC to native USDC. The Arbitrum Bridge will not undergo any immediate changes during the transition period. It will continue operating normally and bridge USDC to and from Ethereum.&nbsp;</p>\nWhat The Future Holds&nbsp;\n<p>Moving forward, Circle hopes to bring CCTP to Arbitrum following the launch of the native USDC stablecoin, which would allow the stablecoin to move natively to and from Ethereum and other chains within minutes, eliminating withdrawal delays. The announcement comes a month after Circle had announced the mainnet availability of the Cross-Chain Transfer Protocol (CCTP). Circle has also announced plans to expand the Cross-Chain Transfer Protocol to other chains in late 2023.&nbsp;</p>\n<p>Back in April, Circle&rsquo;s Vice President of Product, Joao Reginatto, explained that the Cross-Chain Transfer Protocol would give USDC native interoperability across the Web3 ecosystem. He further added that it would help the protocol address issues related to capital inefficiency and liquidity in decentralized finance (DeFi).&nbsp;</p>\n\n<p>&ldquo;With CCTP, developers can simplify the user experience, and their users can trust that they are always transacting with a highly liquid, safe, and fungible asset in native USDC. This milestone makes USDC a natively multi-chain digital dollar.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-02T07:57:49.000Z",
    "title": "How Bitcoin And Crypto Is The Solution To The Recent Recession Struggles In Countries Like Germany",
    "url": "https://nulltx.com/how-bitcoin-and-crypto-is-the-solution-to-the-recent-recession-struggles-in-countries-like-germany/",
    "description": "The challenges brought on by recessions have been addressed by bitcoin and other cryptocurrencies. In addition to offering a more stable and secure means of storing value than conventional fiat currencies, proponents of cryptocurrencies claim that they can help protect people&#8217;s wealth during periods of economic unrest. Germany entered a recession this week (statistics reveal [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-02T08:00:41.000Z",
    "title": "Rising Interest in InQubeta (QUBE) Presale Draws Arbitrum (ARB) and Ethereum (ETH) Whales",
    "url": "https://www.crypto-news-flash.com/rising-interest-in-inqubeta-qube-presale-draws-arbitrum-arb-and-ethereum-eth-whales/?utm_source=rss&utm_medium=rss&utm_campaign=rising-interest-in-inqubeta-qube-presale-draws-arbitrum-arb-and-ethereum-eth-whales",
    "description": "<p>The InQubeta (QUBE) presale has garnered significant attention in recent weeks as it attracts high-profile investors, including prominent whales from the Arbitrum (ARB) and Ethereum (ETH) communities. This surge in interest indicates the growing recognition of InQubeta&#8217;s potential and its ability to capture the upcoming AI market. InQubeta Hits The Spotlight With its innovative approach [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/rising-interest-in-inqubeta-qube-presale-draws-arbitrum-arb-and-ethereum-eth-whales/\">Rising Interest in InQubeta (QUBE) Presale Draws Arbitrum (ARB) and Ethereum (ETH) Whales</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-02T07:47:59.000Z",
    "title": "URGENT!! I Missed The Biggest China + AI Crypto",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/urgent-i-missed-the-biggest-china-ai-crypto/",
    "description": "<p>Unbelievable! How could I do this? Let me explain, I released a Top 5 China Crypto video yesterday. The good news is that it has gone viral! But I made a big mistake in the video. I missed mentioning one of the most important China-linked projects that have all the bullish narratives for the coming bull [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/urgent-i-missed-the-biggest-china-ai-crypto/\">URGENT!! I Missed The Biggest China + AI Crypto</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]