[
  {
    "source": "CoinDesk",
    "date": "2023-05-26T08:47:15.000Z",
    "title": "EU Investment Firms Should Clearly State Crypto Is Unregulated, Watchdog Says",
    "url": "https://www.coindesk.com/policy/2023/05/26/eu-investment-firms-should-clearly-state-crypto-is-unregulated-watchdog-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Companies that market crypto alongside traditional securities might mislead consumers about access to fair advice and compensation, the European Securities and Markets Authority worries."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-26T09:07:50.000Z",
    "title": "Second largest Bitcoin withdraw from exchanges this year",
    "url": "https://cryptoslate.com/insights/second-largest-bitcoin-withdraw-from-exchanges-this-year/",
    "description": "<p>Quick Take In total, $400 million of Bitcoin was pulled from exchanges yesterday. $300 million was attributed to a single whale using Huobi. This outflow is the second-largest daily exchange withdrawal this year. The biggest withdrawal occurred 11 days ago when $800 million left exchanges.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/second-largest-bitcoin-withdraw-from-exchanges-this-year/\">Second largest Bitcoin withdraw from exchanges this year</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T09:00:44.000Z",
    "title": "DeSantis will safeguard crypto and put an end to CBDCs",
    "url": "https://cryptodaily.co.uk/2023/05/desantis-will-safeguard-crypto-and-put-an-end-to-cbdcs",
    "description": "<p>Governor Ron DeSantis of Florida has made promises to protect the world of digital assets, while simultaneously dismantling the concept of a central bank digital currency (CBDC).&nbsp;</p>\nProtecting Crypto: A Pillar of DeSantis' Agenda\n<p>Governor DeSantis has emerged as an important voice for the crypto industry, and much more so now that he has thrown his hat into the ring as a Republican candidate for 2024. He has said that he is committed to protecting the rights of crypto holders and has pledged to encourage a regulatory framework that promotes innovation.</p>\n<p>Unlike many others in the US political arena, DeSantis understands the immense value crypto brings to the table. By fostering collaboration between the government and the crypto industry, he aims to position Florida as a global hub for blockchain technology, attracting investment and nurturing a flourishing ecosystem.</p>\nThe Demise of CBDC: DeSantis' Radical Stance\n<p>Central bank digital currencies (CBDCs) have been a topic of fervent discussion within the crypto sphere. While several countries are looking into developing their own CBDCs, Governor DeSantis has taken a firm stance against them. He believes that such centralised control over digital currencies contradicts the fundamental principles of decentralisation and poses a grave threat to individual privacy and financial sovereignty.</p>\n<p>DeSantis argues that the adoption of CBDCs would grant governments excessive power, enabling them to monitor citizens' financial transactions with unprecedented scrutiny. To counter this potential encroachment on personal liberties, he is determined to dismantle any attempts at introducing a CBDC within Florida's borders.</p>\nBitcoin's Fate Under Biden: A Warning of Impending Doom?\n<p>As the political landscape continues to evolve, Governor DeSantis has expressed concerns over the future of Bitcoin under President Biden's administration. Citing potential regulatory hurdles and increased government intervention, DeSantis warns of a bleak outlook for the flagship cryptocurrency if Biden secures a second term.</p>\n<p>While some may view this prediction as politically motivated, DeSantis insists that it stems from a genuine apprehension for the principles that underpin Bitcoin's success. He emphasises the importance of preserving the decentralised nature of cryptocurrencies and argues that excessive regulation could stifle innovation and hinder the industry's potential to empower individuals worldwide.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-26T09:05:24.000Z",
    "title": "Blockchain Capital fuels Worldcoin with $115m",
    "url": "https://crypto.news/blockchain-capital-fuels-worldcoin-with-115m/",
    "description": "Worldcoin, an ambitious crypto project co-founded by OpenAI CEO Sam Altman, has received a significant financial boost with the latest funding round. On May 25, the technology company behind Worldcoin, Tools for Humanity, announced an influx of $115 million in&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T08:54:51.000Z",
    "title": "InQubeta (QUBE) and Gmx (GMX): High-Potential Investment Opportunities You Can’t Afford to Miss",
    "url": "https://www.crypto-news-flash.com/inqubeta-qube-and-gmx-gmx-high-potential-investment-opportunities-you-cant-afford-to-miss/?utm_source=rss&utm_medium=rss&utm_campaign=inqubeta-qube-and-gmx-gmx-high-potential-investment-opportunities-you-cant-afford-to-miss",
    "description": "<p>In the ever-evolving world of cryptocurrencies, identifying high-potential investment opportunities is essential for investors looking to capitalize on the market&#8217;s growth. InQubeta (QUBE) and Gmx (GMX) have emerged as two projects with immense potential, offering unique value propositions and attracting the attention of savvy investors.  Here are some of the reasons why these projects should [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/inqubeta-qube-and-gmx-gmx-high-potential-investment-opportunities-you-cant-afford-to-miss/\">InQubeta (QUBE) and Gmx (GMX): High-Potential Investment Opportunities You Can&#8217;t Afford to Miss</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]