[
  {
    "source": "CryptoSlate",
    "date": "2023-05-26T14:33:51.000Z",
    "title": "Binance to halt Bitcoin spot trading with Australian Dollar",
    "url": "https://cryptoslate.com/binance-to-halt-bitcoin-spot-trading-with-australian-dollar/",
    "description": "<p>Crypto exchange Binance announced it would stop Bitcoin (BTC) spot trading activities with the Australian Dollar (AUD) on June 1, according to a statement on May 26. Additionally, the exchange would remove spot trading activities for other top cryptocurrencies like Cardano (ADA), Ethereum (ETH), Dogecoin (DOGE), XRP, BNB, Solana (SOL), and Polygon (MATIC) paired with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-to-halt-bitcoin-spot-trading-with-australian-dollar/\">Binance to halt Bitcoin spot trading with Australian Dollar</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T14:30:00.000Z",
    "title": "BTC to USDT: Is More Volatility on the Horizon? Trade the Global Markets with Hybrid Exchange Tradecurve",
    "url": "https://cryptodaily.co.uk/2023/05/btc-to-usdt-is-more-volatility-on-the-horizon-trade-the-global-markets-with-hybrid-exchange-tradecurve",
    "description": "<p>With the BTC halving approaching and the markets going through another bearish move, what does this mean for hodlers, and when is the next halving scheduled? Tradecurve offers a convenient trading solution that covers multiple markets using just one wallet, and perhaps the best part is that no KYC is required.</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\n<p>Bitcoin's Halving: What You Need to Know</p>\n<p>BTC-USD is the most widely traded cryptocurrency pair in the world. Since its introduction in 2009, BTC has experienced several cycles that have shaped its price and value. One of the most significant events is the halving, which occurs approximately every 4 years or every 210,000 blocks created. The next halving is expected to take place around April 2024. During the halving, the mining rate decreases from 6.25 BTC per block to 3.125 BTC per block.</p>\n<p>The halving is a major event because it reduces the rate at which new Bitcoins are introduced into circulation. With a fixed supply of 21 million coins, reducing the supply of new coins through the halving can increase the scarcity and value of Bitcoin over time.</p>\n<p>Bitcoin mining involves powerful computers competing to solve complex mathematical problems and add new blocks to the blockchain. The halving cuts these rewards in half, which means miners have to work twice as hard to earn the same amount of BTC.</p>\n<p>If history is any indication, the halving is a bullish event for BTC, and Bitcoin holders can expect significant volatility after the next halving in April 2024.</p>\n<p></p>\n<p>Tradecurve.io: A Ground-Breaking, Borderless Trading Platform</p>\n<p>Thanks to DeFi and blockchain technology, everyone has the option to have their wallet keys and maintain control over their investments. Tradecurve takes advantage of this by offering a trading platform created by traders for traders. It combines the best features of centralized and decentralized exchanges.</p>\n<p>Tradecurve stands out with its cutting-edge trading platform, high leverage, and minimal trading fees. The registration process is simple, and there's no need for KYC verification. Customers can seamlessly join an international ecosystem.</p>\n<p>Using Tradecurve's brokerage services, people can use cryptocurrency deposits as collateral for trading derivatives and access multiple markets from a single account.&nbsp;</p>\n<p>Staking pools enable TCRV owners to generate additional passive income. Leverage trading starts at 500:1, and a comprehensive metaverse academy offers numerous options for self-development. The expanding user base enjoys round-the-clock customer service and a regularly updated FAQ section.</p>\n<p>Token allocation demonstrates a respectable distribution, with 40% of the total supply reserved for presale, 15% for the Tradecurve team, 14% for reserves, 9% for burning, and the remainder for legal advice and listings.</p>\n<p>Investors are intrigued by Tradecurve's potential, and during the second stage of its presale, TCRV is listed at $0.012. Analysts predict gains of up to 800% for TCRV in the coming month as it gets listed on Uniswap and other major exchanges, and gains of 100x after it launches on Tier 1 exchanges.</p>\n<p>For more information about TCRV presale tokens:</p>\n<p>Website: https://tradecurve.io/&nbsp;</p>\n<p>Buy presale: https://app.tradecurve.io/sign-up&nbsp;</p>\n<p>Twitter: https://twitter.com/Tradecurveapp&nbsp;</p>\n<p>Telegram: https://t.me/tradecurve_official&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T14:30:00.000Z",
    "title": "Dogecoin(DOGE) and Uwerx Look Promising for the Next Crypto Boom",
    "url": "https://cryptodaily.co.uk/2023/05/dogecoindoge-and-uwerx-look-promising-for-the-next-crypto-boom",
    "description": "<p class=\"s4\">Dogecoin (DOGE) remains the torchbearer of all meme coins with certain fluctuations and downfalls. A strong community of supporters and influence from noteworthy personnel still keeps the crypto in the top 10. Dogecoin has been showing impressive performance, despite multiple setbacks.</p>\n<p class=\"s4\">And it continues to inch toward the $0.1 milestone within months, predicted to reach even the $1.0 mark in 2023. DOGE's achievement of such a price means excellent profits for traders and investors.</p>\n<p class=\"s4\">However, the market value now remains over $0.07, requiring a significant boost in the meme coin. Recent growth in capital and reduction of crypto market outflows will likely take a bullish turn soon. Therefore, an enormous increment in value is possible in the coming months.</p>\n<p class=\"s4\">The crypto keeps struggling around the $0.07 mark for about a month, dipping significantly initially. Yet, within weeks, it recovered a significant share of the lost market cap. And the daily transaction numbers reached an all-time high due to the near-bullish forecast of the market.</p>\n<p class=\"s4\">Meantime, the first-ever blockchain-supported freelancing platform, Uwerx, doesn't fall behind. Its native crypto, WERX, currently values a mere $0.0315 at the presales. But analysts recognized the potential, predicting an exponential price rise to reach as much as $0.3 by Q3 of 2023.</p>\n<p class=\"s4\">The ongoing presales have already entered the fourth stage, completing the first in 17 days and the second in 8 days. Freelancers, investors, and analysts look forward to Uwerx's mainstream success as the platform integrates some unique features for target users.</p>\n<p class=\"s8\">Why Does Uwerx Matter So Much?</p>\n<p class=\"s4\">Uwerx allows freelancers to earn a minimal 1% transaction fee, considerably lower than traditional platforms. Freelancers will receive payments directly to their WERX hubs, letting them interact with the crypto space. And it'll unveil a new door to crypto-related businesses.</p>\n<p class=\"s4\">An audit by InterFi Network and SolidProof already set the foundation of top-tier security. The platform already introduced a custom vault to lock up the tokens in the 25-year liquidity pool. So, all clients' and freelancers' assets and intellectual properties will have a steady backup for security.</p>\n<p class=\"s4\">There are advanced features like gamification and incentivization to avoid dull, monotonous, and tiresome work. It should keep the freelancers motivated and enthusiastic to take on new challenges. Analysts and investors also recognized these benefits, counting on the innovative blockchain system.</p>\n<p class=\"s4\">A lot is happening within Uwerx as many development tasks are underway to become accessible to the public. It'll start with the release of Uwerx's Alpha version on May 19, 2023, featuring the landing and signup pages. The team plans to continue releasing the next versions based on user feedback.</p>\n<p class=\"s4\">The much-hyped presales will end on July 31, 2023, and the Team Lock of tokens will happen before that. A recent Twitter poll revealed 82.8% of voters opted for immediately locking the tokens. And the Uwerx team is getting ready to announce the possible date following the scheduled Test Airdrop.</p>\n<p class=\"s4\">The listing of WERX is also gaining momentum as CoinSniper already recognized the token. Uniswap will likely introduce the crypto in its portfolio by August 01, 2023. Launching in centralized exchanges should let the platform initiate the renouncement of contract ownership, lessening tax worries.</p>\n<p class=\"s4\">The WERX presales exceeded expectations in every aspect, gaining much appreciation from the crypto space. And the demand keeps increasing as the forecast indicates exploding surges in price. The Uwerx team also understands the impulse, changing five token allocations as follows &ndash;</p>\n● Presale: An increase to 57% from 45% to renew confidence.\n● Founding Team: A reduction to 7% from 8% to prioritize user benefits.\n● Partnership incentives: A reduction to 3% from 7.5% after reviewing new information.\n● User performance incentives: A decrease to 6.5% from 15%.\n● Joining incentives: An increase to 6.5% from 4.5% to attract more users.\n<p class=\"s4\">New investors/customers/users can achieve a 20% bonus on every purchase during the presales. It also sparked the popularity and checkups on this innovative, promising, and beneficial platform. Uwerx has already gained over 5,000 signups with over 1000 members in its Telegram community.</p>\n<p class=\"s4\">Grab your opportunity with Uwerx using either of the links mentioned below &ndash;</p>\n<p class=\"s4\">Presale: invest.uwerx.network</p>\n<p class=\"s4\">Telegram: https://t.me/uwerx_network</p>\n<p class=\"s4\">Twitter: https://twitter.com/uwerx_network</p>\n<p class=\"s4\">Website: https://www.uwerx.network/</p>\n<p class=\"s4\">&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T14:15:00.000Z",
    "title": "Bitfinex to List Pepe (PEPE), Shiba Inu (SHIB) Gets New NFT Hoodies, Sparklo (SPRK) Presale Explodes",
    "url": "https://cryptodaily.co.uk/2023/05/bitfinex-to-list-pepe-pepe-shiba-inu-shib-gets-new-nft-hoodies-sparklo-sprk-presale-explodes",
    "description": "<p class=\"s7\">As initial hype fades, Pepe (PEPE) has now maintained a new red color, while Shiba Inu (SHIB) continues its long-term battle with the bears. In light of the recent struggles of meme coins, investors have become increasingly cautious when considering investment opportunities. One project that has stood out from the pack because of its utility is Sparklo.</p>\n<p>&gt;&gt;&gt;&gt; BUY SPARKLO TOKENS &lt;&lt;&lt;&lt;</p>\n<p class=\"s10\">Sparklo (SPRK) offers unrivaled utility to investors</p>\n<p class=\"s7\">Sparklo is developing the first blockchain platform that will allow both low and high-income earners to assess the precious metals industry by eliminating the obstacles that plague the traditional investment market. Using fractional NFTs, Sparklo will give investors the chance to own gold, silver, and platinum.</p>\n<p class=\"s7\">At current prices, gold has a market cap of $13.02 trillion, silver $1.3 trillion, and platinum$267.92 billion. Exploring these markets gives Sparklo an unrivaled utility. Sparklo will also collaborate with jewelry stores to provide investors with early access to some jewelry products before they are made available on the market.</p>\n<p class=\"s7\">Now in the second presale stage, Sparklo (SPRK) currently trades at $0.026 with up to 50% rewards on purchases. Given the potential of Sparklo, experts have predicted a price jump of up to 40x within the first year of launch.</p>\n<p>&gt;&gt;&gt;&gt; BUY SPARKLO TOKENS &lt;&lt;&lt;&lt;</p>\n<p class=\"s10\">The red Pepe (PEPE) color despite Bitfinex listing</p>\n<p class=\"s7\">Following an explosive performance early this month, Pepe (PEPE) has been sliding deeper into bear territory. As a popular meme coin, Pepe (PEPE) continues to receive support from crypto exchanges. Bitfinex has announced that Pepe (PEPE) will be listed on the exchange on May 22. Trading Pepe (PEPE) against US Dollar and Tether (USDT) pairs will open on May 24. </p>\n<p class=\"s7\">The massive Pepe (PEPE) rally was followed by an even bigger dump as investors cashed out their gains. Despite Bifinex announcing the listing of Pepe (PEPE) has lost more than 5% of its value in the last 24 hours. Over the last week, the price of Pepe (PEPE) has declined by 13%, making it one of the biggest losers. </p>\n<p>&gt;&gt;&gt;&gt; BUY SPARKLO TOKENS &lt;&lt;&lt;&lt;</p>\n<p class=\"s10\">John Richmond teases new Shiba Inu (SHIB) NFT hoodie</p>\n<p class=\"s7\">An equally popular meme coin, Shiba Inu (SHIB) continues to see more developments than Pepe (PEPE). John Richmond, the famous Italian-English fashion designer has announced that he will launch a new NFT hoodie collection exclusively for the Shiba Inu (SHIB) community. According to Richmond, the hoodies are part of the Cyberpunk LegendsLiveForever collection.</p>\n<p class=\"s7\">Like NFTs, each hoodie will be unique. The announcement has turned the negative sentiments of Shiba Inu (SHIB) positive. Over the last 24 hours, the price of Shiba Inu (SHIB) has gained 2.7%, pushing its price up to $0.000008778. However, in the long term, Shiba Inu (SHIB) remains bearish, losing 16% of its value in the last 30 days. The poor performance of meme coins has fueled the migration of investors to projects with more utility like Sparklo. </p>\n<p class=\"s7\">&nbsp;</p>\n<p class=\"s13\">Find out about the Sparklo (SPRK) presale using the links below:</p>\n<p class=\"s15\">Website: https://sparklo.finance</p>\n<p class=\"s15\">Presale: https://invest.sparklo.finance</p>\n<p class=\"s15\">Twitter: https://twitter.com/sparklo_finance</p>\n<p class=\"s15\">Telegram: https://t.me/sparklofinance</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T14:15:00.000Z",
    "title": "Should You Buy Ethereum on eToro, or Buy the Collateral Network (COLT) Presale?",
    "url": "https://cryptodaily.co.uk/2023/05/should-you-buy-ethereum-on-etoro-or-buy-the-collateral-network-colt-presale",
    "description": "<p>Ethereum (ETH) has solidified itself as one of the market's most popular and desirable crypto coins. However, as the recent lockup of ETH tokens hits new highs, investors are wondering about the coin's future movements.</p>\n<p>While this is happening, a new player on the market &ndash; Collateral Network (COLT), is turning heads and making waves, with experts predicting a 3500% growth even while the token is still in its public presale.</p>\n<p>&gt;&gt;BUY COLT TOKENS NOW&lt;&lt;</p>\n<p>Collateral Network Blows Investors Away with Incredible Gains</p>\n<p>Collateral Network is one of the hottest projects in the crypto sphere right now. Set to revolutionize the lending industry, Collateral Network is the first decentralized lending platform on the blockchain that allows people to leverage their real-world assets in exchange for loans.&nbsp;</p>\n<p>Let's say you need to get a loan to fund an upcoming project, and you have a $10,000 watch. You can send that watch over to Collateral Network, where it will be valued and stored securely in a vault. Collateral Network will mint a 100% asset-backed NFT from your watch and sell it in fractions to other Collateral Network holders. Once you repay your loan, you'll get the watch back, and the NFT will be burned.</p>\n<p>On the other hand, the people who fund the loans, i.e., buy fractions of the asset-backed NFTs, can create a diversified portfolio of multiple small loans and receive fixed-interest weekly payments from each loan. So, Collateral Network also allows lenders to create streams of passive income with competitive rates.</p>\n<p>At the moment, this token is still in its public presale. Nonetheless, it's already providing gains for holders, as its initial presale price has already jumped from $0.01 to $0.014 in just a few weeks. Experts and analysts are predicting 3500% gains for the coin in the near future and an incredible 100x increase once the coin hits exchanges.&nbsp;</p>\n<p></p>\n<p>Is Buying Ethereum on eToro Worth It?</p>\n<p>The Ethereum (ETH) price is continuing to see bearish reactions as the Ethereum lockup continues to rise. In an effort to boost the Ethereum value, Ethereum holders have been locking up their Ethereum coins in the past few weeks. Now, the total locked amount has reached a new high, with 19,375,242 Ethereum coins being locked away.</p>\n<p>However, the lockup trend has yet to achieve its goal of boosting Ethereum value, and now investors are unsure where all of this will lead. Some experts are predicting a further decline in Ethereum prices in the future, with some saying that it could fall from its current trading price of $1,788.05 to $1,462.</p>\n<p>If you want to wait for the expected dip once it comes, you can buy Ethereum on eToro. However, at this time, it's not recommendable that you do so, as predictions aren't so good for the coin. So, you'll be much better off investing in the Collateral Network presale if you want to get maximum gains.&nbsp;</p>\n<p>For more information on Collateral Network visit the website, join the presale or join the community for regular updates.</p>\n<p>Find out more about the Collateral Network presale here:</p>\n<p>Website: https://www.collateralnetwork.io/&nbsp;</p>\n<p>Presale: https://presale.collateralnetwork.io/login</p>\n<p>Telegram: https://t.me/collateralnwk&nbsp;</p>\n<p>Twitter: https://twitter.com/Collateralnwk&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T14:15:00.000Z",
    "title": "Investors Showing Interest in InQubeta (QUBE) Presale, While Arbitrum (ARB) Community Continues to See Losses",
    "url": "https://cryptodaily.co.uk/2023/05/investors-showing-interest-in-inqubeta-qube-presale-while-arbitrum-arb-community-continues-to-see-losses",
    "description": "<p>Investors are increasingly showing interest in the InQubeta (QUBE) presale, while Arbitrum(ARB) holders continue to see the value of their holdings drop. Presales and initial coin offerings (ICO) are known to excite investors, but InQubeta&rsquo;s presale is generating unprecedented interest as investors look to capitalize on a barrier-free opportunity to purchase equity in promising Artificial Intelligence (AI) startups.</p>\n<p>AI is one of the fastest-growing technology fields, with total investments in the industry rising by over $80 billion from 2015 to 2021. That&rsquo;s a clear indicator that many traditional investors expect AI to be a significant part of everyday life in the future.</p>\n<p>Many AI-powered devices that were once nothing more than a fantasy of novelists are now a common reality. AI-powered devices now clean floors in many homes, while some vehicle manufacturers have added self-driving features to their products. All this has occurred while AI technology still remains in its infancy.</p>\n<p class=\"s8\">InQubeta keeps trending upwards while other altcoins like Arbitrum lose value</p>\n<p>InQubeta&rsquo;s unique platform deserves credit for the growth enjoyed during its presale. It allows anyone, to invest in AI startups without a need for Silicon Valley connections or other barriers associated with mainstream investment firms. The platform also makes it easier for AI startups to secure the funding needed for their projects.</p>\n<p>Startups raise capital on InQubeta&rsquo;s platform by creating ERC20 QUBE tokens. These are fractionalized, deflationary non-fungible tokens (NFTs) that represent equity and other rewards in their companies. These tokens are then listed on the InQubeta marketplace where investors find and research startups with potential to invest in.</p>\n<p>Investors purchase fractionalized QUBE tokens of startups they link with $QUBE tokens, the platform's native currency. This gives them equity in the company and other rewards like profit-sharing in some cases.</p>\n<p>InQubeta&rsquo;s platform has deflationary protocols that help to push prices upwards. Buy and sell transactions with QUBE tokens are taxed at a 2% rate. The taxes generated are sent to a burn wallet to reduce the total number of available coins. The tax rate is 5% for $QUBE transactions, and it&rsquo;s used to fund a dedicated reward pool for investors who stake their coins.</p>\n<p>InQubeta (QUBE) also allows investors to be part of the platform's governance, with the size of each investor&rsquo;s holdings deciding the authority of their voice. Investors can propose, discuss, and vote on ideas that affect the platform's protocols and future.</p>\n<p class=\"s11\">Visit InQubeta Presale</p>\n<p class=\"s8\">Arbitrum (ARB) release hasn&rsquo;t gone as planned</p>\n<p>Arbitrum is built around the Ethereum (ETH) network &ndash; the second most popular cryptocurrency worldwide. ETH &nbsp;has lots of things going on for it like supporting smart contracts. However, Ethereum transaction fees have gotten outrageously high as its value grows.</p>\n<p>Arbitrum has created a third-party solution for Ethereum&rsquo;s problems by building its platform on Ethereum&rsquo;s blockchain to speed up transactions and lower fees. It&rsquo;s emerged as a popular place for ETH holders to complete transactions.</p>\n<p>Arbitrum released its new ARB governance token in March 2023, but the token hasn&rsquo;t seen significant growth since. Instead, prices have dropped by over 50% since setting an all-time high of $1.77 in April. Altcoins like Arbitrum have struggled to grow since the start of the InQubetapresale as investors can&rsquo;t resist the urge to be part of the AI revolution going on. Artificial intelligence has the potential to surpass the internet regarding its effects on how the world works, leading to a steady flow of investment capital into the industry and services that help its growth.</p>\n<p class=\"s8\">Summary</p>\n<p>Many cryptocurrencies are predicted to experience significant growth this year, but Arbitrummight not be one of them despite making Ethereum transactions faster and cheaper. Other promising altcoins like InQubeta are drawing significant investments, keeping investments in coins like ARB low for now.</p>\n<p class=\"s11\">Join InQubeta Communities&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-26T14:30:15.000Z",
    "title": "Market Outlook: CME Fedwatch Tool Points to Increased Chance of June Rate Hike",
    "url": "https://news.bitcoin.com/market-outlook-cme-fedwatch-tool-points-to-increased-chance-of-june-rate-hike/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/fed67-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Market Outlook: CME Fedwatch Tool Points to Increased Chance of June Rate Hike\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/fed67-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/fed67-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/fed67-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/fed67-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/fed67-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/fed67-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/fed67.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to the CME Group Fedwatch tool on Thursday, there was a 51% probability of a quarter-point rate increase during the upcoming Federal Open Market Committee (FOMC) meeting on June 14. Just a fortnight ago, the Fedwatch tool indicated a slim possibility of the federal funds rate reaching 5.50% next month. The following day on [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T14:24:46.000Z",
    "title": "Shiba Inu (SHIB) Set For Mass Price Increase – Don’t Miss Out On This New Crypto Gem Set To Surge 3500%",
    "url": "https://www.crypto-news-flash.com/shiba-inu-shib-set-for-mass-price-increase-dont-miss-out-on-this-new-crypto-gem-set-to-surge-3500/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-shib-set-for-mass-price-increase-dont-miss-out-on-this-new-crypto-gem-set-to-surge-3500",
    "description": "<p>Despite a recent surge in memecoin trading, the value of Shiba Inu (SHIB) has crashed over 10% in the last week. However, analysts believe that Shiba Inu could be on track for a massive price increase due to a substantial rise in SHIB token burning. Meanwhile, a new crypto gem is gaining traction and is [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/shiba-inu-shib-set-for-mass-price-increase-dont-miss-out-on-this-new-crypto-gem-set-to-surge-3500/\">Shiba Inu (SHIB) Set For Mass Price Increase &#8211; Don&#8217;t Miss Out On This New Crypto Gem Set To Surge 3500%</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T14:10:22.000Z",
    "title": "VeChain Attends Private Meeting with Boston Consulting Group and 1,800+ Leaders from Billion-Dollar Companies to Drive the Blockchain of the Future",
    "url": "https://www.crypto-news-flash.com/vechain-attends-private-meeting-with-boston-consulting-group-and-1800-leaders-from-billion-dollar-companies-to-drive-the-blockchain-of-the-future/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-attends-private-meeting-with-boston-consulting-group-and-1800-leaders-from-billion-dollar-companies-to-drive-the-blockchain-of-the-future",
    "description": "<p>VeChain was invited to a private meeting with Boston Consulting Group. VeChain was the only blockchain invited owing to its recent developments. VeChain (VET) has through innovative means promoted the agenda of Environmental, Social, and Governance (ESG) in the last few years. Its passion for this course has earned it an invite to a private [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/vechain-attends-private-meeting-with-boston-consulting-group-and-1800-leaders-from-billion-dollar-companies-to-drive-the-blockchain-of-the-future/\">VeChain Attends Private Meeting with Boston Consulting Group and 1,800+ Leaders from Billion-Dollar Companies to Drive the Blockchain of the Future</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-26T14:30:00.000Z",
    "title": "Trading Channel Warns Of Impending Price Drop For Dogecoin (DOGE)",
    "url": "https://coinedition.com/trading-channel-warns-of-impending-price-drop-for-dogecoin-doge/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Trading_Channel_Warns_Of_Impending_Price_Drop_For_Dogecoin_DOGE-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Trading_Channel_Warns_Of_Impending_Price_Drop_For_Dogecoin_DOGE-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Trading_Channel_Warns_Of_Impending_Price_Drop_For_Dogecoin_DOGE-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Trading_Channel_Warns_Of_Impending_Price_Drop_For_Dogecoin_DOGE-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Trading_Channel_Warns_Of_Impending_Price_Drop_For_Dogecoin_DOGE-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Trading_Channel_Warns_Of_Impending_Price_Drop_For_Dogecoin_DOGE-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Trading_Channel_Warns_Of_Impending_Price_Drop_For_Dogecoin_DOGE.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a recent YouTube video, the trading channel More Crypto Online highlighted the ongoing sluggishness on Dogecoin’s (DOGE) charts. In addition to this, the meme coin has seen a notable decrease in on-chain activity, prompting concerns among investors. According to their latest analysis, the meme coin is at risk of dropping swiftly in the coming [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/trading-channel-warns-of-impending-price-drop-for-dogecoin-doge/\">Trading Channel Warns Of Impending Price Drop For Dogecoin (DOGE)</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-26T14:10:00.000Z",
    "title": "EigenLayer Founder Talks Ethereum Consensus Overload on The Chopping Block",
    "url": "https://coinedition.com/eigenlayer-founder-talks-ethereum-consensus-overload-on-the-chopping-block/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/So-whats-the-deal-with-that-Vitalik-post-on-re-staking-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/So-whats-the-deal-with-that-Vitalik-post-on-re-staking-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/So-whats-the-deal-with-that-Vitalik-post-on-re-staking-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/So-whats-the-deal-with-that-Vitalik-post-on-re-staking-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/So-whats-the-deal-with-that-Vitalik-post-on-re-staking-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/So-whats-the-deal-with-that-Vitalik-post-on-re-staking-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/So-whats-the-deal-with-that-Vitalik-post-on-re-staking.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>On the recent episode of Unchained&#8217;s new show, The Chopping Block hosted a thought-provoking conversation with Sreeram Kannan, the founder of EigenLayer. Kannan provided a fresh perspective on the recent precautionary post about Ethereum’s consensus, warning against excessive risk-taking. During the show, while host Robert Leshner acknowledged the risks of overloading  Ethereum&#8217;s consensus, as addressed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/eigenlayer-founder-talks-ethereum-consensus-overload-on-the-chopping-block/\">EigenLayer Founder Talks Ethereum Consensus Overload on The Chopping Block</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-26T14:30:41.000Z",
    "title": "Shiba Inu’s Shibarium Mainnet Launch Nears As Testnet Transactions Surge to Over 12,000,000 – Here’s the Timeline",
    "url": "https://dailyhodl.com/2023/05/26/shiba-inus-shibarium-mainnet-launch-nears-as-testnet-transactions-surge-to-over-12000000-heres-the-timeline/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Inus-Shibarium-Mainnet-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Inus-Shibarium-Mainnet-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Inus-Shibarium-Mainnet-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Inus-Shibarium-Mainnet-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Inus-Shibarium-Mainnet-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Inus-Shibarium-Mainnet-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Shiba-Inus-Shibarium-Mainnet-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The highly anticipated mainnet launch of Shiba Inu&#8217;s (SHIB) layer-2 blockchain project Shibarium is fast approaching, according to a SHIB team member. Lucie, a content market specialist for Shiba Inu, says that the Shibarium mainnet launch is expected in the second or third quarter of 2023. “Yesterday, [SHIB supporter] @Shibarium_ guessed that the launch of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/26/shiba-inus-shibarium-mainnet-launch-nears-as-testnet-transactions-surge-to-over-12000000-heres-the-timeline/\">Shiba Inu’s Shibarium Mainnet Launch Nears As Testnet Transactions Surge to Over 12,000,000 – Here’s the Timeline</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]