[
  {
    "source": "Cointelegraph",
    "date": "2023-12-19T02:59:03.000Z",
    "title": " SEC delays several Ethereum ETFs, pushing final decision to May ",
    "url": "https://cointelegraph.com/news/sec-delays-ethereum-etf-decision-spot-futures-may-final-date",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMmE4MjNmNWEtYmMyYS00NDE0LWFmMjAtZWE1NjBkNDdjNzM1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The SEC has pushed back its decision on a roster of Ethereum ETFs, with the final date for a potential approval arriving in late May.</p>\n                    <p><p>The United States Securities and Exchange Commission is pushing back its decision on several Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) exchange-traded funds (ETFs) to May 2024.</p><p>In several Dec. 18 regulatory <a href=\"https://www.sec.gov/files/rules/sro/nasdaq/2023/34-99200.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filings</a>, the agency delayed its decision on the Hashdex Nasdaq Ethereum ETF and the Grayscale Ethereum Futures ETF.</p><p>The Hashdex Ether ETF aims to hold both spot Ether and futures contracts, while Grayscale’s Ethereum Futures ETF is <a href=\"https://cointelegraph.com/news/grayscale-eth-futures-etf-trojan-horse-spot-eth-etf\">seen as a “trojan horse”</a> that would corner the SEC into allowing Grayscale to convert its Ethereum Trust to a spot Ethereum ETF.</p><p><a href=\"https://cointelegraph.com/news/sec-delays-ethereum-etf-decision-spot-futures-may-final-date\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T02:50:21.000Z",
    "title": "BCS Warning – UK Tech Sector Faces Centuries-Long Gender Gap Without Interventio",
    "url": "https://www.cryptopolitan.com/uk-tech-sector-centuries-long-gender-gap/",
    "description": "In a stark revelation, the Chartered Institute for IT (BCS) warns that the gender gap in the UK tech sector could persist for nearly 300 years if immediate and drastic measures are not taken. The institute&#8217;s annual Diversity Report unveils a concerning trend, indicating that despite nominal gains in recent years, the gender disparity is [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-19T03:09:01.000Z",
    "title": "Bitcoin Price Rallies 5% But Key Breakout Resistance Is Still Intact",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-rallies-43500/",
    "description": "Bitcoin price jumped from the $40,500 support zone. BTC is up over 5% but the bears are still defending the $43,500 resistance zone. Bitcoin started a strong increase from the $40,500 support zone. The price is trading above $42,000 and the 100 hourly Simple moving average. There was a break above a major bearish trend line with resistance near $41,850 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could decline again if it fails to clear the $43,500 resistance zone. Bitcoin Price Revisits $43,500 Bitcoin price extended its decline below the $41,200 support level. However, BTC remained well-bid above the $40,500 support zone. A low was formed near $40,515 and the price started a fresh increase. There was a steady increase above the $41,200 and $42,000 levels. There was a break above a major bearish trend line with resistance near $41,850 on the hourly chart of the BTC/USD pair. The pair rallied above the $43,000 resistance zone. Bitcoin is now struggling to clear the key $43,500 resistance zone. A high is formed near $43,464 and the price is now consolidating gains. It is above the 23.6% Fib retracement level of the upward move from the $40,515 swing low to the $43,464 high. It is well above $42,000 and the 100 hourly Simple moving average. On the upside, immediate resistance is near the $43,250 level. The first major resistance is forming near $43,500. A close above the $43,500 resistance might start a steady increase. Source: BTCUSD on TradingView.com The next key resistance could be near $44,200, above which BTC could rise toward the $45,000 level. A clear move above the $45,000 level could set the pace for a test of $46,500. More Losses In BTC? If Bitcoin fails to rise above the $43,500 resistance zone, it could start a fresh decline. Immediate support on the downside is near the $42,750 level. The next major support is near $42,000 or the 50% Fib retracement level of the upward move from the $40,515 swing low to the $43,464 high. If there is a move below $42,000, there is a risk of more losses. In the stated case, the price could drop toward the $40,500 support in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 20 level. Major Support Levels – $42,750, followed by $42,000. Major Resistance Levels – $43,200, $43,500, and $45,000."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-19T03:00:41.000Z",
    "title": "Rising Liquidity Will Push Bitcoin To Over $200,000 In Less Than 5 Months: What It Means",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-to-over-200000-in-less-than-5-months/",
    "description": "According to Dan Tapiero, Managing Partner at 10T Holdings, the Bitcoin and crypto market is on the verge of a major transformation, with the world&#8217;s most valuable coin likely to soar to over $200,000 by May 2024. Citing data by Raoul Paul, the CEO of Real Vision, Tapiero suggests that traditional money managers must take notice and prepare for a paradigm shift in the financial landscape. Bitcoin Could Rally To Over $200,000 In 2024 On Rising Liquidity   Tapiero bases this bullish forecast on the expected BTC liquidity surge in the coming months. Market participants hope the stringent Securities and Exchange Commission (SEC) will approve the first batch of Bitcoin ETFs in the next few trading weeks.  The Bitcoin ETF, set to be issued by some mainstream players in traditional finance, including BlackRock, will provide regulated vehicles through which institutional investors can get exposure to the coin. Based on Tapiero&#8217;s analysis, as more and more institutions adopt Bitcoin, its liquidity will increase, boosting prices.  Related Reading: Investors Flock To Stacks (STX) As It Gains 10% Against The Bears – Here’s Why With a Bitcoin ETF on the table, it would also mean the release of institutional-grade Bitcoin trading platforms. This will cement Bitcoin&#8217;s position in the industry and its potential role in reshaping finance. Paul&#8217;s monthly GMI data, which tracks the sentiment of institutional investors, as Tapiero mentions, further reinforces the general bullish sentiment across the board. Looking at the GMI total liquidity index, the trend has been rising, suggesting that institutional interest in Bitcoin has also increased. This trend also indicates that more funds and asset managers are likely allocating more of their portfolios to Bitcoin, expecting to ride the leg up or be on the safe side. Traditional Fund Managers Watching, BTC Up 64% From September Lows   Looking at Tapiero&#8217;s preview, the managing partner thinks rising prices will seriously affect traditional money managers. As such, if Bitcoin rallies to $200,000 on increasing liquidity, in the partner&#8217;s assessment, ignoring this asset class could pose a significant career risk. Related Reading: XRP Gets Rejected Down: Analyst Predicts Bottom Target Notably, Tapeiro opines that managers who fail to embrace the transformative power of Bitcoin may trail. This is because crypto will continue to evolve and find adoption. As of December 18, Bitcoin is firmly in an uptrend and expanding with rising trading volume. The coin is up 64% from its September 2023 lows. Though there has been a cool-off in the past few trading days, prices are trending above the 20-day moving average. Accordingly, in the days ahead, how prices pan out will shape the medium term. As it is, the immediate resistance level lies at around $44,500. If buyers take charge, the coin may float to $50,000. Afterward, it may float to the all-time high of $69,000 in the sessions ahead. Feature image from Canva, chart from TradingView"
  }
]