[
  {
    "source": "Cointelegraph",
    "date": "2024-03-13T21:53:06.000Z",
    "title": " Bitcoin price entering ‘euphoria’ zone amid wealth rotation from ‘HODLers to new investors’ — Data ",
    "url": "https://cointelegraph.com/news/bitcoin-price-entering-euphoria-zone-amid-wealth-rotation-from-hodlers-to-new-investors-data",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMDVlMzkzMjAtZGFmMS00MWFlLTliMzctZWFhMTVjNGViNzYzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>According to Glassnode, BTC market sentiment is approaching the “euphoria” stage amid consecutive all-time highs.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price has rallied more than 200% over the last year to <a href=\"https://cointelegraph.com/news/bitcoin-price-new-73-6-k-all-time-high-etfs-eat\">set a record high</a> above $73,000 on March 13. This rally has pushed investor sentiment “closer to euphoria,” characterized by wealth rotation from long-term holders to new investors, according to market intelligence firm Glassnode. </p><p>This week’s “The Week Onchain” <a href=\"https://insights.glassnode.com/the-week-onchain-week-11-2024/?utm_campaign=woc_11_2024&amp;utm_medium=woc_newsletter&amp;utm_source=email\" target=\"_blank\" rel=\"noopener nofollow\">report</a> by market intelligence Glassnode notes that Bitcoin’s recent clearance of the $69,000 all-time high set in November 2021 created the “fourth new cycle ATH in history.”</p><p>Analyst Checkmate cites BTC’s significant rally above $72,000, which has shifted this phase of Bitcoin bull run “into the 'Euphoria Zone’” — a stage “which tends to accompany new ATHs.” </p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-entering-euphoria-zone-amid-wealth-rotation-from-hodlers-to-new-investors-data\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-13T22:00:16.000Z",
    "title": "Bitcoin Whale Books $217 Million Profit After BTC Broke $73,000",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-whale-217-million-profit-btc-73000/",
    "description": "The ongoing Bitcoin surge is proving lucrative for a crypto whale. According to Lookonchain data on March 13, one large BTC address has raked in $217 million in profits after prices rose above $73,000 earlier today. Profits would have even been higher because, over the past, the whale has been unloading large amounts via Binance, the world&#8217;s largest crypto exchange.  This development follows Bitcoin&#8217;s solid growth. Since October 2023, the coin has been steadily rising, fueled by supportive fundamental events, including interest rate expectations from the United States Federal Reserve and the approval of spot Bitcoin exchange-traded funds (ETFs) by the United States Securities and Exchange Commission (SEC).  BTC Is Rallying, Whale Books $217 Million Profit Coupled by bullish holders, expecting more gains ahead and after halving, the coin has been rapidly inching higher, exceeding expectations. The previous all-time high of around $72,800 was broken on March 13 when the coin broke higher, rallying above $73,000. This expansion comes after a strong price correction in the New York session on March 12. However, with confidence still in the market, prices rallied strongly during the Asian market, pushing prices above $72,800 to as high as $73,700.  Related Reading: Number Of Ethereum Short-Term Holders Increasing – Is A Bull Rally Next? While traders clipped fluctuations, the anonymous whale took full advantage of the rally after months of HODLing. Lookonchain data shows that the whale began accumulating Bitcoin on August 24, 2023, at an average price of $32,854, before withdrawing and depositing 4,300 BTC at an average price of $3,534.  The address currently controls 4,300 BTC worth over $313 million and is $217 million in profits. The whale withdrew 100 BTC worth $7.22 million via Binance on March 13, possible to book profits.  BlackRock And Wall Street Driving Bitcoin Demand Whether the whale will withdraw more and consolidate profits remains to be seen. However, considering the overall optimism across the market, the address could register more gains.  The crypto community expects the deluge of capital from institutions to continue in the weeks ahead. So far, BlackRock, through its IBIT spot Bitcoin exchange-traded fund (ETF) product, controls over 205,000 BTC. There is more demand from other issuers like Fidelity and Ark Invest.  Related Reading: Bitcoin Hodlers Eye Long Term: $520 Million BTC Go To Cold Storage Beyond that, the rising demand from pension funds, mainly in the United States, would further drive prices higher, lifting HODLers&#8217; valuation. This week, the business intelligence firm MicroStrategy said it was also buying more coins after raising $800 million from investors. Feature image from DALLE, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-13T22:01:14.000Z",
    "title": "Tech Mogul Jack Dorsey’s Self-Custody Bitkey Wallets Begin Shipping to 95 Countries",
    "url": "https://dailyhodl.com/2024/03/13/tech-mogul-jack-dorseys-self-custody-bitkey-wallets-begin-shipping-to-95-countries/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/five-bitcoin-wallets-linked.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/five-bitcoin-wallets-linked.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/five-bitcoin-wallets-linked.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/five-bitcoin-wallets-linked.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/five-bitcoin-wallets-linked.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/five-bitcoin-wallets-linked.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/five-bitcoin-wallets-linked.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The self-custody Bitcoin (BTC) wallet built by Jack Dorsey’s fintech firm is now being shipped to customers in 95 countries. Dorsey’s fintech company Block, formerly known as Square, began taking pre-orders in December for the new self-custody Bitcoin wallet called Bitkey. Bitkey says the pre-ordered wallets, which are designed to make it easier for people [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/13/tech-mogul-jack-dorseys-self-custody-bitkey-wallets-begin-shipping-to-95-countries/\">Tech Mogul Jack Dorsey’s Self-Custody Bitkey Wallets Begin Shipping to 95 Countries</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]