[
  {
    "source": "CoinDesk",
    "date": "2023-12-19T19:36:08.000Z",
    "title": "Bitcoin Spot ETF Biggest Development on Wall Street in Last 30 Years, Says Michael Saylor",
    "url": "https://www.coindesk.com/markets/2023/12/19/bitcoin-spot-etf-biggest-development-on-wall-street-in-last-30-years-says-michael-saylor/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A large increase in demand coupled with lower supply should set the stage for higher prices in 2024, he told Bloomberg."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-19T19:36:44.000Z",
    "title": " Bitnomial clearing license sets off CFTC vertical integration debate ",
    "url": "https://cointelegraph.com/news/bitnomial-clearing-license-cftc-vertical-integration-debate",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMzc1MDBlNDYtYmI1OC00YTRjLTlmM2EtYmRhMmVlNGQ4YWViLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Commissioners wonder if the CFTC is ready for vertical integration, and if digital assets pose extra risks.</p>\n                    <p><p>The United States Commodity Futures Trading Commission (CFTC) granted digital asset derivative exchange Bitnomial a clearinghouse license on Dec. 13. Bitnomial already had derivatives exchange and brokerage (futures commission merchant — FCM) licenses. Bitnomial thus became a regulated vertically integrated market structure. </p><p>The CFTC was acting on an application filed by Bitnomial in April 2022, which was approved by a vote of four to one after several delays. Vertical integration is a controversial practice in unregulated crypto firms. CFTC chair Rostin Behnam <a href=\"https://www.cftc.gov/PressRoom/SpeechesTestimony/behnamstatement121823\" target=\"_blank\" rel=\"noopener nofollow\">addressed</a> concerns about vertical integration on Dec. 18 in his statement on Bitnomial’s registration:</p><p>“Currently, the Commission does not have a requirement for addressing affiliate conflicts in its regulations,” he continued.</p><p><a href=\"https://cointelegraph.com/news/bitnomial-clearing-license-cftc-vertical-integration-debate\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-19T19:12:25.000Z",
    "title": " Sen. Warren calls out crypto industry’s revolving door of Washington insiders ",
    "url": "https://cointelegraph.com/news/warren-crypto-industry-washington-insiders",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNDdlZWM4MmItODM3NC00NTcxLWIxZjctOTk3MjQ5ZDNkMzNhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>According to the Massachusetts senator, many government officials could be laying the groundwork while in public service to “audition” for positions in the crypto industry.</p>\n                    <p><p>Massachusetts Senator Elizabeth Warren, an outspoken opponent of digital assets in the United States Congress, has called on crypto advocacy groups to answer questions regarding the industry’s use of former government officials and lawmakers.</p><p>In Dec. 18 letters to leadership at advocacy groups Coin Center and Blockchain Association, Sen. Warren <a href=\"https://theblockchainassociation.org/wp-content/uploads/2023/12/Sen.-Warren-Letter-to-CEO-Kristin-Smith.pdf\" target=\"_blank\" rel=\"noopener nofollow\">cited</a> a Politico report that certain entities within the crypto industry had a “small army of former defense, national security and law enforcement officials” aimed at stymieing regulation of digital assets. She reiterated claims that crypto was behind the financing of terrorist organizations, including Hamas — the group behind the Oct. 7 attack on Israel.</p><p>According to Sen. Warren, the revolving door between the crypto industry and Washington D.C. insiders suggested that many government officials could be laying the groundwork while in public service to “audition” for digital asset lobbying positions. She referenced crypto exchange Coinbase’s Global Advisory Council, which initially included former Senator Patrick Toomey, former Representative Tim Ryan, and former Representative Sean Patrick Maloney.</p><p><a href=\"https://cointelegraph.com/news/warren-crypto-industry-washington-insiders\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-19T19:40:42.000Z",
    "title": "Bitcoin’s limited supply translates to just 222,222 Satoshis per person globally",
    "url": "https://cryptoslate.com/insights/bitcoins-limited-supply-translates-to-just-222222-satoshis-per-person-globally/",
    "description": "<p>Quick Take Bitcoin, with its total supply capped at 21 million, presents an interesting scenario when compared with the current world population of approximately 8.1 billion. This rare perspective, based on data from Worldometers, offers a deeper understanding of Bitcoin&#8217;s limited availability. On average, each individual in the world, if split evenly per person, would [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoins-limited-supply-translates-to-just-222222-satoshis-per-person-globally/\">Bitcoin&#8217;s limited supply translates to just 222,222 Satoshis per person globally</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-19T19:10:38.000Z",
    "title": "Web3 social platform /Reach aims to ‘fix Crypto Twitter’",
    "url": "https://cryptoslate.com/web3-social-platform-reach-aims-to-fix-crypto-twitter/",
    "description": "<p>/Reach, a web3-focused social platform designed to &#8220;fix Crypto Twitter&#8221; and powered by the Reach token, went live on Dec. 18 after the completion of a beta phase that onboarded around 6,000 users, according to a statement shared with CryptoSlate. /Reach platform In recent years, the crypto community has expressed growing concerns regarding the abundance [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/web3-social-platform-reach-aims-to-fix-crypto-twitter/\">Web3 social platform /Reach aims to &#8216;fix Crypto Twitter&#8217;</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-19T19:42:57.000Z",
    "title": "Explore These Fastest-Growing Cryptocurrencies In December 2023",
    "url": "https://cryptodaily.co.uk/2023/12/explore-these-fastest-growing-cryptocurrencies-in-december-2023",
    "description": "Discover the most rapidly expanding cryptocurrency of December 2023. Dive into an insightful analysis of market trends, investment opportunities, and the driving forces behind this cryptocurrency's remarkable growth."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-19T19:41:56.000Z",
    "title": "Bitcoin (BTC) Expected to Reach $200,000 by 2025; Whales Flock to Aptos (APT) & Rebel Satoshi ($RBLZ)",
    "url": "https://cryptodaily.co.uk/2023/12/bitcoin-btc-expected-to-reach-200000-by-2025-whales-flock-to-aptos-apt-rebel-satoshi-rblz",
    "description": "The cryptocurrency market is buzzing with anticipation as expert analysts predict a monumental surge in Bitcoin’s (BTC) price, with expectations reaching as high as $200,000 by 2025"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-19T19:33:42.000Z",
    "title": "Cardano (ADA) Rally Triggers Analyst's Warning; Borroe Finance ($ROE) Hype Grows",
    "url": "https://cryptodaily.co.uk/2023/12/cardano-ada-rally-triggers-analysts-warning-borroe-finance-roe-hype-grows",
    "description": "With Cardano (ADA) being one of the primary beneficiaries of the present crypto rally based on a 72.6% monthly surge,"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-19T19:23:36.000Z",
    "title": "Co-founder Yakovenko Mount & Solana Make A Comeback, InQubeta Smashes $6 Million Presale Mark",
    "url": "https://cryptodaily.co.uk/2023/12/co-founder-yakovenko-mount-solana-make-a-comeback-inqubeta-smashes-6-million-presale-mark",
    "description": "In the fast-paced world of cryptocurrencies, two forces are making waves in their respective arenas. Solana (SOL)"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-19T19:16:43.000Z",
    "title": "Can We See $4000 Ethereum by 2024? Nugget Rush Hits $950k",
    "url": "https://cryptodaily.co.uk/2023/12/can-we-see-4000-ethereum-by-2024-nugget-rush-hits-950k",
    "description": "With the rise in the overall crypto market, confidence has also soared. This positive sentiment has led to speculation, with investors wondering if Ethereum (ETH) c"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T20:07:54.000Z",
    "title": "Top cybersecurity trends for CISOs in 2024: AI-Powered Threats and Defense",
    "url": "https://www.cryptopolitan.com/top-cybersecurity-trends-for-cisos-2024-ai/",
    "description": "As we approach the year 2024, cybersecurity leaders face an ever-expanding threat landscape, increasing technology stacks, and often limited budgets. In this rapidly evolving field, it is crucial to stay ahead of emerging trends to defend enterprises effectively.&#160; Four cybersecurity experts have shared their insights into the top security trends for Chief Information Security Officers [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T20:06:15.000Z",
    "title": "What lies ahead after the SEC’s treasury clearing reform?",
    "url": "https://www.cryptopolitan.com/what-after-the-secs-treasury-clearing-reform/",
    "description": "The recent decision by the U.S. Securities and Exchange Commission (SEC) to mandate more central clearing in Treasury markets has sparked a flurry of reactions and predictions about the future of these critical financial markets. The SEC’s vote to expand central clearing of Treasury and repo trades introduces new deadlines and regulations, set to reshape [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T19:55:39.000Z",
    "title": "Is Bitcoin ETF really coming? There’s a lot of skepticism",
    "url": "https://www.cryptopolitan.com/is-bitcoin-etf-really-coming-skepticism/",
    "description": "In the dynamic world of cryptocurrency, the buzz around the potential approval of a Bitcoin ETF in the United States is growing. However, this anticipation is juxtaposed with a notable skepticism within the market. Despite Bitcoin&#8217;s remarkable performance, increasing nearly 200% year-to-date, the approach to the 2023 candle close shows a surprisingly tepid interest, according [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T19:46:09.000Z",
    "title": "EthereumPOW core team call it quits – What this means",
    "url": "https://www.cryptopolitan.com/ethereumpow-core-team-call-it-quits/",
    "description": "In a move that marks a significant shift in the cryptocurrency industry, the EthereumPOW (ETHW) Core team has announced its dissolution. This decision, reached after a year of rigorous work and exploration, sets a new precedent in the realm of digital currencies. The EthereumPOW project, which emerged as a fork of the original Ethereum blockchain, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T19:43:36.000Z",
    "title": "GuardRail OSS: An Open-Source Initiative for Responsible AI Development",
    "url": "https://www.cryptopolitan.com/guardrail-oss-an-open-source-for-responsible-ai-development/",
    "description": "A group of seasoned enterprise software experts, spearheaded by prominent tech leaders including Reuven Cohen, Mark Hinkle, and Aaron Fulkerson, has unveiled an open-source project named GuardRail OSS. This initiative is set to play a pivotal role in ensuring responsible AI development and deployment across various industries. GuardRail OSS introduces an API-driven framework equipped with [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T19:19:56.000Z",
    "title": "OpenAI Offers $10 Million in Grants to Tackle Superintelligent AI Control",
    "url": "https://www.cryptopolitan.com/openai-offers-10-million-in-grants-to-tackle-superintelligent-ai-control/",
    "description": "OpenAI, a leading organization in the field of artificial intelligence research, is taking proactive steps to address the potential risks associated with superintelligent AI systems. In a bold move, the company has announced that it is offering $10 million in grants to support technical research focused on ensuring the safe and ethical control of artificial [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-19T19:14:03.000Z",
    "title": "Google set to pay $700 million settlement in a PlayStore dispute",
    "url": "https://www.cryptopolitan.com/google-700-million-settlement-dispute/",
    "description": "Google recently unveiled a $700 million settlement, allocating $630 million to U.S. consumers and $70 million to a fund for U.S. states. This resolution stems from a class-action lawsuit filed in 2021, addressing the platform’s monopoly on app distribution through the Play Store on Android. Although the settlement was initially reached in September, the details [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-19T19:30:26.000Z",
    "title": "Long-Term Analysis Better For XRP Price, Crypto Enthusiast Says",
    "url": "https://www.newsbtc.com/analysis/xrp/long-term-analysis-better-for-xrp-price-crypto-enthusiast-says/",
    "description": "Bill Morgan, a cryptocurrency enthusiast and lawyer, has underscored an insightful factor towards investing in the XRP token.  Bill Morgan On XRP Price Action The lawyer recently used X (formerly Twitter) to share his optimism about XRP&#8217;s price action. According to the analyst, traders and investors interested in the crypto asset&#8217;s price movement should concentrate on the long term. Bill Morgan&#8217;s post addressed yesterday&#8217;s volatility and how the cryptocurrency community perceived it. The X post was published in response to &#8220;Matt,&#8221; the Moon Lambo YouTube Channel host.  Related Reading: Crypto Analyst Predicts Short-Term XRP Price Rally To $18 The host refuted the cryptocurrency community members&#8217; assertions that yesterday&#8217;s XRP decrease was more violent than other coins. Morgan provided an alternative viewpoint while admitting that Matt&#8217;s position was correct.  The analyst asserted that XRP&#8217;s price behavior has not been &#8220;excellent&#8221; over the past month despite a market-wide increase, falling by over 2%. Because of this, he believes the decline of digital assets was more difficult than expected. He further pointed out that the token has experienced a rebound today but has not been very robust. Furthermore, he asserted that he &#8220;does not place much significance on a month&#8217;s price action&#8221; in these markets. He believes conviction must go &#8220;beyond a day, week, or month of price movement.&#8221; So far, Morgan has noted that yesterday&#8217;s decline did not affect him emotionally. He was only surprised by yesterday&#8217;s fall&#8217;s depth and today&#8217;s recovery&#8217;s weakness. Nonetheless, he has clarified that this would not influence his choice to hold or sell the digital asset. The Crypto Asset Price To Reach $22 Several cryptocurrency enthusiasts have recently expressed a bullish sentiment toward XRP&#8217;s price action. On Sunday, Patrick Riley, the founder of Reaper Financial, stated that the token will reach $22 in the next bull run. Riley added that the crypto asset will maintain a $10 price level after the bull run. Since analysts predict the next bull run will be in 2024, XRP might reach $22 next year.  Related Reading: Galaxy Digital CEO Expresses Bullish Sentiment On XRP The cryptocurrency founder made other audacious claims besides his $22 price mark estimate. He believes that XRP will eventually &#8220;overtake&#8221; Bitcoin, though he did not provide a specific timeframe for this event. As of this writing, XRP was trading at $0.6081, an increase of over 3% in the past 24 hours. The token is gradually regaining momentum and is currently ranked 5th by market capitalization. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-19T20:06:01.000Z",
    "title": "Polkadot’s OpenGov Ignites Proposal Surge and Voter Engagement",
    "url": "https://www.crypto-news-flash.com/polkadots-opengov-ignites-proposal-surge-and-voter-engagement/?utm_source=rss&utm_medium=rss&utm_campaign=polkadots-opengov-ignites-proposal-surge-and-voter-engagement",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/12/AdobeStock_389442371-scaled.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polkadot\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/12/AdobeStock_389442371-scaled.jpeg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2020/12/AdobeStock_389442371-300x169.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/12/AdobeStock_389442371-1024x576.jpeg 1024w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Polkadot migrated from Gov 1 to OpenGov in June, a move that has spurred a surge in growth and user engagement, with the number of proposals surging over 400%. The number of parachains has also grown, with the number of L1 blockchains secured by Polkadot now hitting 50 as the number of transactions this year [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-19T19:49:00.000Z",
    "title": "Bitcoin Leads Charge After Market Witnessed Bearish Weekend",
    "url": "https://coinedition.com/bitcoin-leads-charge-after-market-witnessed-bearish-weekend/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Bitcoin_BTC_Price_Displays_a_Golden_Cross_Will_Historic_Patterns.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin_BTC_Price_Displays_a_Golden_Cross;_Will_Historic_Patterns\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Bitcoin_BTC_Price_Displays_a_Golden_Cross_Will_Historic_Patterns.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Bitcoin_BTC_Price_Displays_a_Golden_Cross_Will_Historic_Patterns-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Bitcoin_BTC_Price_Displays_a_Golden_Cross_Will_Historic_Patterns-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Bitcoin_BTC_Price_Displays_a_Golden_Cross_Will_Historic_Patterns-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Bitcoin_BTC_Price_Displays_a_Golden_Cross_Will_Historic_Patterns-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Bitcoin_BTC_Price_Displays_a_Golden_Cross_Will_Historic_Patterns-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency market managed a comeback on Monday, following a weekend of bearish sentiment and selling pressure. After a week of declining prices and increasingly negative social activity, Bitcoin (BTC) reversed course, surging back above $43,000 at the time of writing. In a recent post on X (formerly Twitter), on-chain data provider Santiment noted that [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bitcoin-leads-charge-after-market-witnessed-bearish-weekend/\">Bitcoin Leads Charge After Market Witnessed Bearish Weekend</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-19T19:45:15.000Z",
    "title": "FTX Values Claims of Creditors Based on Prices of Digital Assets During Collapse of Exchange",
    "url": "https://dailyhodl.com/2023/12/19/ftx-values-claims-of-creditors-based-on-prices-of-digital-assets-during-collapse-of-exchange/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/ftx-values-claims-prices.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/ftx-values-claims-prices.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/12/ftx-values-claims-prices.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/ftx-values-claims-prices.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/ftx-values-claims-prices.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/ftx-values-claims-prices.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/12/ftx-values-claims-prices.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Recent court documents indicate FTX&#8217;s creditors&#8217; digital asset claims will be based on the near-bottom crypto prices at the time of the disgraced exchange&#8217;s collapse back in November 2022. A recent disclosure statement shows that FTX&#8217;s lawyers are proposing that claims regarding digital assets will be calculated and processed by converting the value of the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/19/ftx-values-claims-of-creditors-based-on-prices-of-digital-assets-during-collapse-of-exchange/\">FTX Values Claims of Creditors Based on Prices of Digital Assets During Collapse of Exchange</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-19T19:41:51.000Z",
    "title": "Montenegrin Court Overturns Decision To Extradite Terra Do Kwon to the US",
    "url": "https://dailyhodl.com/2023/12/19/montenegrin-court-overturns-decision-to-extradite-terra-do-kwon-to-the-us/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/terra-founder-hit-arrest.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/terra-founder-hit-arrest.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/terra-founder-hit-arrest.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/terra-founder-hit-arrest.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/terra-founder-hit-arrest.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/terra-founder-hit-arrest.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/terra-founder-hit-arrest.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The founder of Terraform Labs, the crypto firm behind the Terra (LUNA) collapse has won an appeal in Montenegro over being extradited to the United States. According to a statement from the Montenegro Appeals Court, the decision to extradite Terra founder Do Kwon to the US or South Korea has been overturned. Kwon was initially arrested [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/19/montenegrin-court-overturns-decision-to-extradite-terra-do-kwon-to-the-us/\">Montenegrin Court Overturns Decision To Extradite Terra Do Kwon to the US</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]