[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-30T04:30:53.000Z",
    "title": "FTX Pauses Sale of $500 Million Stake in AI Startup Anthropic",
    "url": "https://news.bitcoin.com/ftx-pauses-sale-of-500-million-stake-in-ai-startup-anthropic/",
    "description": "<img width=\"768\" height=\"433\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2225021035-768x433.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"FTX Pauses Sale of $500 Million Stake in AI Startup Anthropic\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2225021035-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2225021035-1024x577.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2225021035-768x433.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2225021035-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2225021035-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2225021035-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2225021035.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Failed crypto exchange FTX has unexpectedly halted the sale of its stake in the artificial intelligence (AI) startup Anthropic. The stock has been viewed as a source of funds that can be used to compensate customers who suffered losses as a result of the coin trading platform’s collapse. Cryptocurrency Exchange FTX Postpones Sale of Anthropic [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-30T04:16:37.000Z",
    "title": "Litecoin Price Prediction: LTC Rallies 10% as The Bulls Aim $110",
    "url": "https://www.newsbtc.com/analysis/ltc/litecoin-price-prediction-ltc-rallies-110/",
    "description": "Litecoin price is gaining pace above $90 against the US Dollar. LTC could rally further above $100 and rise toward the $110 resistance. Litecoin is steadily moving higher toward $100 against the US Dollar. The price is now trading above $90 and the 100 simple moving average (4 hours). There was a break above a key bearish trend line with resistance near $86.20 on the 4-hour chart of the LTC/USD pair (data feed from Kraken). The price could rally further toward the $100 and $110 levels. Litecoin Price Regains Strength After forming a base above the $80 level, Litecoin’s price started a fresh increase against the US Dollar. LTC price broke the $85 resistance to start the current rally. There was a break above a key bearish trend line with resistance near $86.20 on the 4-hour chart of the LTC/USD pair. The pair rallied over 10% and outperformed both Bitcoin and Ethereum. It even climbed above the $92 level. A high is formed near $95.85 and the price is now consolidating gains above the 23.6% Fib retracement level of the upward move from the $81.70 swing low to the $95.85 high. Litecoin is now trading above $90 and the 100 simple moving average (4 hours). On the upside, immediate resistance is near the $96 zone. The next major resistance is near the $100 level. If there is a clear break above the $100 resistance, the price could start another strong increase. Source: LTCUSD on TradingView.com In the stated case, the price is likely to continue higher toward the $108 and $110 levels. Any more gains might send LTC’s price toward the $120 resistance zone. Are Dips Limited in LTC? If Litecoin price fails to clear the $100 resistance level, there could be a downside correction. Initial support on the downside is near the $92 level. The next major support is forming near the $88.50 level or the 50% Fib retracement level of the upward move from the $81.70 swing low to the $95.85 high, below which there is a risk of a move toward the $85.00 support. Any further losses may perhaps send the price toward the $82 support. Technical indicators: 4-hour MACD – The MACD is now gaining pace in the bullish zone. 4-hour RSI (Relative Strength Index) – The RSI for LTC/USD is above the 50 level. Major Support Levels – $92.50 followed by $88.50. Major Resistance Levels – $96.00 and $100.00."
  }
]