[
  {
    "source": "NewsBTC",
    "date": "2023-07-09T07:33:41.000Z",
    "title": "Solana (SOL) Tallies 10% Gains On Weekly Chart – Will It Cross $25?",
    "url": "https://www.newsbtc.com/news/solana/solana-sol-tallies-10-gains-on-weekly-chart-will-it-cross-25/",
    "description": "Solana (SOL) has witnessed a remarkable recovery in the past week, showcasing a string of steady gains. Presently, SOL has increased by 10% and is actively traded at $21.80, reflecting a slight uptick in the crypto&#8217;s price. While it&#8217;s important to note that SOL remains significantly distant from its all-time high of $260, the recent upward motion has lifted its value beyond the $20 mark, indicating promising signs of an extended bullish sentiment What&#8217;s Behind SOL Rise?  There are several factors right now that could have influenced the rise in SOL’s price. These include macroeconomic factors such as inflation and crypto regulation in different areas. In addition, Solana has experienced some success in adoption with some ecosystems adopting the token and launching cross-chain bridges.  Related Reading: XRP Next Step: Here’s Why An Upward Move Could Be Likely However, the most likely factor is the increase in DEX volume recorded this week. Blockchain analysis platform DefiLlama revealed in a report earlier in the week that Solana had experienced a spike in DEX volume. According to the report, SOL’s DEX volume surged by over 80% and is ranked fifth within the crypto market. This development is likely to have boosted its price action in the past week.  Nonetheless, the Total Value Locked (TVL) has not reacted to this uptrend and has been stagnant since its decline last November following the FTX collapse. Currently, the TVL sits at around $275 million with no noticeable increase in value despite the gains of SOL in recent days.  Solana (SOL) Price Outlook And Prediction  SOL is currently trending upward and has continued its positive price action towards the weekend. However, the intermittent red candles on its weekly chart show that the bears are active this week.  Looking at the technical indicators, its relative strength index is at 50 in the neutral zone between the oversold region of 35 and the overbought region of 75. The Moving Average Convergence/Divergence (MACD) is currently in the buy zone which is a bullish signal. In addition, the histogram bars are green and signal that a bullish trend is ahead and if the bulls persist, SOL is likely to have a sustained uptrend in the coming days.  SOL is trading at $21.83 after it found critical support at the $15.43 price level weeks ago. This puts the altcoin close to the $22.50 resistance level. Related Reading: PEPE Bulls Losing Steam? Fatigue Appears To Undermine Price Rally A break above the $22.50 resistance level will help to boost its price to reclaim the $25 psychological resistance level. If this happens, SOL will likely rally to the $23.00 resistance level after breaking above $22. However, a price decline below $20 in the short term remains possible due to external market conditions that are bearish.  (This site’s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured Image from iStock, chart from TradingView"
  }
]