[
  {
    "source": "CoinDesk",
    "date": "2023-11-07T16:53:28.000Z",
    "title": "U.S. Banking Watchdog Hsu Says Tokenization Promising, But Crypto Full of Fraud",
    "url": "https://www.coindesk.com/policy/2023/11/07/us-banking-watchdog-hsu-says-tokenization-promising-but-crypto-full-of-fraud/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Tokenization of assets could be the answer to the risky complexities of settling the movement of funds and securities, said Michael Hsu, the acting head of the U.S. Office of the Comptroller of the Currency."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-07T16:53:29.000Z",
    "title": "Bitcoin Ordinals see resurgence on Binance listing",
    "url": "http://cointelegraph.com/news/bitcoin-ordinals-see-resurgence-binance-listing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/3e1989d8-3e3e-4240-8092-0b53853e3586.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The ORDI token, which was not developed by the creator of Bitcoin Ordinals, has surged by 41% in the past 24 hours. </p>\n                    <p><p>Ordinals, a BRC-20 token collection minted on the Bitcoin blockchain, have surged by 40.8% in the past 24 hours to $10.19 after listing on crypto exchange Binance.</p><p>According to Binance's Nov. 7 <a href=\"https://www.binance.com/en/support/announcement/binance-will-list-ordinals-ordi-with-seed-tag-applied-4bd64404aa384fe5a00e0f9b131035db?ref=AZTKZ9XS\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, traders can now trade Ordinals (ORDI) against Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>), Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), and the Turkish Lira (TRY). Binance claims that it did not charge developers any listing fees for the ORDI token and that withdrawals will open on Nov. 8. As part of initial incentives, the first 1,000 users who deposit at least 72 ORDI to the exchange received a 50 USDT trading rebate voucher. </p><blockquote>\"ORDI is a relatively new token that poses a higher than normal risk, and as such will likely be subject to high price volatility.\"</blockquote><p>Bitcoin Ordinals is a numbering system that assigns a unique number to each individual Satoshi, or 1/100 million of a Bitcoin, enabling tracking and transfer. Combined with the inscription process, which adds an additional layer of data to each Satoshi, this allows users to mint unique digital assets on the Bitcoin blockchain. The current token listed on Binance, ORDI, is not associated with developers of Bitcoin Ordinals.</p><p>Invented by Web3 developer Rodarmor in January, BRC-20 tokens have surged in popularity as one of the largest technological advancements in a 15-year-old blockchain. Self-custody wallet providers, such as BitKeep (now Bitget Wallet), <a href=\"https://cointelegraph.com/news/wallet-providers-introduce-brc-20-token-support-despite-market-drawdown\">have enabled</a> BRC-20 token deposits and withdrawals since June. The total market cap of BRC-20 tokens currently <a href=\"https://www.brc-20.io/\" target=\"_blank\" rel=\"noopener nofollow\">stands</a> at $1.34 billion. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-ordinals-mintage-fees-paid-increase-700-since-april-report\">Bitcoin Ordinals’ total mintage fees increase 700% from April</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-07T16:40:20.000Z",
    "title": "Kazakhstan bans Coinbase amid crackdown on unregulated crypto activity",
    "url": "https://cryptoslate.com/kazakhstan-bans-coinbase-amid-crackdown-on-unregulated-crypto-activity/",
    "description": "<p>The Ministry of Culture and Information in Kazakhstan recently blocked access to prominent crypto exchange Coinbase and select online brokerage websites, including the New York Mercantile Exchange (NYMEX), local media reported on Nov. 7. The actions are grounded in Kazakhstan&#8217;s stringent &#8220;Digital Assets Law,&#8221; a comprehensive piece of legislation that governs the issuance and circulation [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/kazakhstan-bans-coinbase-amid-crackdown-on-unregulated-crypto-activity/\">Kazakhstan bans Coinbase amid crackdown on unregulated crypto activity</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-07T16:59:55.000Z",
    "title": "Cardano Taps Polkadot To Power Multi-Chain Expansion",
    "url": "https://cryptobriefing.com/cardano-polkadot-multi-chain-expansion/?utm_source=feed&utm_medium=rss",
    "description": "Cardano's partner chain initiative, announced at last week's summit, will leverage Polkadot's Substrate to empower interoperable chains."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-07T17:08:19.000Z",
    "title": "Simpsons roast spurs an NFT gold rush with traders investing millions on knockoff collectibles",
    "url": "https://www.cryptopolitan.com/simpsons-roast-spurs-an-nft-gold-rush/",
    "description": "Among the recent events in the crypto world is the frenzy commentary of the digital community on the Simpsons-themed Non-Fungible Tokens (NFTs). The NFT trading community has recently invested in digital artwork amid investors spending millions on knockoff collectibles.  The tagged NFT saw a surge beginning this week after comments made that saw investors back ... <a title=\"Simpsons roast spurs an NFT gold rush with traders investing millions on knockoff collectibles\" class=\"read-more\" href=\"https://www.cryptopolitan.com/simpsons-roast-spurs-an-nft-gold-rush/\" aria-label=\"More on Simpsons roast spurs an NFT gold rush with traders investing millions on knockoff collectibles\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-07T16:51:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-07T17:03:19.000Z",
    "title": "Investor optimism fuels meme coins growth: predictions and market analysis",
    "url": "https://crypto.news/investor-optimism-fuels-meme-coins-growth-predictions-and-market-analysis/",
    "description": "The upcoming Bitcoin halving may signal an auspicious period for meme coins, sparking widespread market speculation. Learn how."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-07T17:02:11.000Z",
    "title": "Binance-related tokens see price surge ahead of blockchain week",
    "url": "https://crypto.news/binance-related-tokens-see-price-surge-ahead-of-blockchain-week/",
    "description": "One of the year’s top blockchain and web3 events, Binance Blockchain Week, is set to begin tomorrow, Nov. 8."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-07T17:00:05.000Z",
    "title": "Dogecoin Climbs Above $0.075 To 3-Month High, But Metrics Show It’s Far From Done",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-0-075-3-month-high/",
    "description": "Dogecoin has emerged as one of the clear winners in the last week after its price climbed over 10% to secure the $0.075 level. This incredible rally has brought the meme coin to its highest level in the last three months. However, it may only be getting started as multiple DOGE metrics continue to exhibit bullishness. Dogecoin Whales Still In The Game One of the most important metrics that show how investors are looking at a coin like Dogecoin is what the large investors are doing. Initially, when the crypto market rally began and DOGE started to move up, the whale addresses remained muted without showing too much activity. But that has started to change with a drastic rise in the whale movements. Related Reading: Why Ark Invest’s Cathie Wood Picks Bitcoin Over Cash And Gold According to data from IntoTheBlock, in the last 24 hours, Dogecoin whales have carried out over $1.48 billion worth of transactions. This is in stark contrast to last week’s figures coming in at an average of $600 million in daily transactions by these large holders. DOGE large transactions climb to $1.48 billion &#124; Source: IntoTheBlock It means that there has been a more than 100% rise in daily large transaction volume for Dogecoin, suggesting that the whales are coming out to play. The spike also began around November 4 which is when the DOGE price had begun moving upward quickly. This could mean that these whales have been buying large quantities, leading to a drastic decrease in the available DOGE supply on the open market. The number of large transactions reached 1,320 on November 6, just 100 transactions shy of the asset’s October highs. IntoTheBlock also shows a leaning toward bullishness with more addresses being bullish compared to those which are bearish. DOGE Volumes Are On The Rise Dogecoin whale transactions and volumes are not the only Dogecoin metrics that have been on the rise. The meme coin’s daily trading volume has also exploded during this time as well, with a 64% increase in a 24-hour period. Daily trading volume rises &#124; Source: CoinMarketCap This drastic rise has brought its daily trading volume above $870 million with the possibility of crossing $1 billion in the coming days. This exponential rise in daily trading volume indicates rising interest, especially with the spot buying and selling. Related Reading: Shiba Inu-Based BONE Eyes $1 As This On-Chain Metric Explodes During this time, the DOGE profitability has been rising quickly, bringing 53% of all holders back into profit. This has contributed to the bullish sentiment of the meme coin and could help to trigger more capital inflow into Dogecoin as investors try to take advantage of the price recovery. DOGE price loses footing at $0.075 &#124; Source: DOGEUSD On Tradingview.com Featured image from StormGain, chart from Tradingview.com"
  }
]