[
  {
    "source": "CoinDesk",
    "date": "2023-11-16T14:00:00.000Z",
    "title": "Ramaswamy Shares Crypto Plan, Making Him the Only GOP Candidate Who Has One",
    "url": "https://www.coindesk.com/policy/2023/11/16/ramaswamy-shares-crypto-plan-making-him-the-only-gop-candidate-who-has-one/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Republican presidential candidate Vivek Ramaswamy has a message for most of the employees at the U.S. Securities and Exchange Commission (SEC) if he's elected to the White House: You're fired. And everybody still left at their desks would need to back off the crypto industry, according to the candidate's new policy strategy for U.S. digital assets."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-16T14:01:02.000Z",
    "title": "Solana Game 'Aurory' Expands With 'Seekers of Tokane' and Epic Games Store Launch",
    "url": "https://decrypt.co/206262/solana-game-aurory-expands-seekers-tokane-epic-games-store",
    "description": "Aurory is launching Seekers of Tokane and plans to take it beyond the browser with a desktop version in the works for the Epic Games Store."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-16T13:55:23.000Z",
    "title": "German Parliament member ’staunch opponent' of digital Euro, all in on Bitcoin ",
    "url": "http://cointelegraph.com/news/german-parliament-member-staunch-opponent-of-digital-euro-all-in-on-bitcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/66dfaeb0-894a-4885-ad35-ed1efcae440e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>EU lawmakers are anticipating the arrival of the digital euro, though German politician Joana Cotar is pushing back against the currency and fighting in favor of Bitcoin.  </p>\n                    <p><p>The European Union has been actively preparing for what it envisions as the future of money. Over the last year, it finalized its landmark comprehensive crypto legislation, the Markets in Crypto-Assets regulation (MiCA), which is due to take effect in 2024, after closing<a href=\"https://cointelegraph.com/news/european-regulator-publishes-second-consultation-on-mica\"> its second consultation</a> in October. </p><p>It has also made progress in its plan to introduce a <a href=\"https://cointelegraph.com/cryptocurrency-regulation-for-beginners/what-is-a-cbdc-why-central-banks-want-to-get-into-digital-currencies\">central bank digital currency (CBDC)</a>, which is coming to fruition as the “digital euro.” The Bank of the Netherlands has <a href=\"https://www.dnb.nl/en/innovations-in-payments-and-banking/digital-euro-what-why-and-how/#:~:text=The%20digital%20euro%20is%20an,bank%20digital%20currency%2C%20or%20CBDC.\" target=\"_blank\" rel=\"noopener nofollow\">described</a> it simply as an “electronic form of public money - the coins and notes in our wallets.” </p><p>Many local regulators are embracing the digital euro and <a href=\"https://cointelegraph.com/news/bank-of-spain-embraces-digital-euro-explains-benefits\">touting its potential benefits</a>, though not everyone is on board. A recent survey out of Spain revealed that as much as <a href=\"https://cointelegraph.com/news/survey-65-percent-spaniards-not-interested-in-digital-euro\">65% of Spaniards</a> are not interested in using the digital euro.</p><p>Slovakia’s parliament even passed a measure in June that amended its constitution to <a href=\"https://cointelegraph.com/news/fear-of-digital-euro-prompts-slovakia-to-add-cash-rule-to-constitution\">codify a citizen’s right to pay for goods</a> and services with cash in the face of the impending digital currency. </p><p>In Germany, one local politician is not only against the digital euro but is instead offering up another digital solution for a financial revolution - Bitcoin. </p><p>Cointelegraph spoke with Joana Cotar, a member of the German parliament and a Bitcoin activist, about her take on the digital euro situation and why she believes in the benefits of Bitcoin. </p><p>Cotar has been outspoken on her stance on the EU's digital monetary solution, which she told Cointelegraph is that of “a staunch opponent of the digital Euro.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> &quot;Nobody needs the digital euro,” says Member of Germany’s Parliament while wearing a <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> T-shirt.  <a href=\"https://t.co/Rw4qdeKE0h\">pic.twitter.com/Rw4qdeKE0h</a></p>&mdash; Bitcoin Archive (@BTC_Archive) <a href=\"https://twitter.com/BTC_Archive/status/1723354992633905495?ref_src=twsrc%5Etfw\">November 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>She said a digital euro could allow central banks to set an “upper limit” for payments and ownership, making citizens “helplessly at [their] mercy.”</p><blockquote>The digital Euro would also mean that each and every one of us could be totally monitored. As a convinced libertarian, I emphatically reject this. Anyone who is against surveillance and for freedom does not need a digital Euro! </blockquote><p>According to Cotar, the Chinese social credit system should serve as a warning of the possibilities of the absence of cash and state-controlled payment systems. “I don’t want the authorities to be able to spy on our private life and misuse this data,” she said. </p><p>However, in April<a href=\"https://cointelegraph.com/news/european-bankers-on-digital-euro-ecb-has-no-interest-in-users-personal-data\"> the program director for the digital euro</a> at the European Central Bank, Evelien Witlox, said that the “ECB has no interest in users’ personal data.” In October, the EU’s data protection regulators <a href=\"https://cointelegraph.com/news/eu-data-protection-regulators-urge-anonymity-smaller-transactions-in-digital-euro\">issued a joint statement</a> regarding anonymity in digital euro transactions. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/digital-euro-eu-financial-chief-don-t-rush-before-july-2024\"><strong><em>EU finance chief: Don’t rush digital euro before new Commission in June 2024</em></strong></a></p><p>Cotar is using her platform, among other things, to raise awareness among lawmakers of the potential dangers she believes to be associated with the digital euro. </p><p>While Cotar may not be on board for a digital euro, she is a champion of Bitcoin. She is behind the “Bitcoin in the Bundestag\" <a href=\"https://bitcoin-im-bundestag.de/bitcoin/das-problem-und-warum-bitcoin-wichtig-ist/\" target=\"_blank\" rel=\"noopener nofollow\">initiative</a>, which she told Cointelegraph is committed to raising <em>a</em>wareness and educating members of the German Bundestag (MPs) about the potential and risks of Bitcoin. </p><blockquote>“Establishing a formal Bundestag committee that recognizes the technological differences between Bitcoin and other crypto assets and mainly deals with the importance of Bitcoin for our society is very important for us.”</blockquote><p>She said her initiative serves as an information resource for members of the Bundestag and helps them make more informed decisions about Bitcoin specifically. </p><p>When she explained her greater vision for bringing Bitcoin into regulators’ consideration, one major change she’d like to see is the allowance to pay taxes and fees paid in Bitcoin and using Bitcoin mining farms to stabilize the power grid. </p><blockquote>“We need to promote the freedom aspects of Bitcoin (permissionless access, individual sovereignty) - this includes protecting privacy, ensuring security standards and preventing excessive regulation to maximize the benefits of Bitcoin.</blockquote><p>Cotar would also like to initiate a “preliminary examination” for a legal framework that would recognize Bitcoin as a legal tender in Germany. “This includes ensuring the legal security for companies and citizens,” she said. </p><blockquote class=\"twitter-tweet\"><p lang=\"de\" dir=\"ltr\">Wenn einem eine 72 Jahre alte Dame schreibt, dass sie <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>  für ihre Enkel spart. Wie großartig kann man bitte sein? Mit über 70 mehr Durchblick als so manch Jungspund. </p>&mdash; Joana Cotar (@JoanaCotar) <a href=\"https://twitter.com/JoanaCotar/status/1724190149578219782?ref_src=twsrc%5Etfw\">November 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“We need to combat potential risks such as money laundering, tax evasion and other illegal activities associated with Bitcoin,” she said. \"But without stifling innovation and the freedom aspects of Bitcoin.”</p><p>The Bitcoin-savvy lawmaker said her ideas for Germany could “easily be transferred” as a framework for other countries. She urges international cooperation to develop a blanket standard for Bitcoin and its cross-border use.</p><p>When asked if she feels similarly impassioned for other cryptocurrencies currently available on the market, her response was simply: </p><blockquote>“My initiative is Bitcoin only.”</blockquote><p>On Oct. 18 he European Central Bank (ECB) has announced it will begin t<a href=\"https://cointelegraph.com/news/ecb-preparation-phase-digital-euro\">he ”preparation phase” for the digital euro</a> project following a two-year investigation into the potential EU-wide digital currency. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/breaking-into-liberland-dodging-guards-decoys-and-diplomats/\"><strong><em>Breaking into Liberland: Dodging guards with inner-tubes, decoys and diplomats</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-16T13:55:00.000Z",
    "title": "3AC co-founder Kyle Davies spotted in Bali, sources claim",
    "url": "http://cointelegraph.com/news/3ac-co-founder-kyle-davies-spotted-in-bali-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/e05547ba-cd16-4f25-b948-67545bb3c307.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sources claim that 3AC co-founder Kyle Davies has been based in Bali for months as he continues to evade Singaporean authorities over the collapse of his failed hedge fund. </p>\n                    <p><p>Three Arrows Capital (3AC) co-founder Kyle Davies has reportedly been seen in Bali as he continues to evade authorities over the collapse of the defunct hedge fund.</p><p>Davies, who has been embroiled in bankruptcy proceedings following the collapse of 3AC in 2022, has <a href=\"https://www.ft.com/content/2bc70649-d025-440f-ad56-d92998c5f695\" target=\"_blank\" rel=\"noopener nofollow\">already been</a> sentenced to four months in jail in Singapore for failing to cooperate with investigations into its bankruptcy.</p><p>An anonymous source provided Cointelegraph with images that purportedly show Davies with an unknown woman at the Milk and Madu cafe in Canggu, Bali on Nov. 8. Furthermore, separate sources involved with ongoing bankruptcy proceedings in Singapore have confirmed that the 3AC co-founder is based in the Indonesian province. </p><p>The images, which have been withheld from publication, bear a stark resemblance to several photographs that Davies has posted online over the past two years. </p><p>The witness claims that Davies looks “alive, well and happy” and attempted to conceal his visage once he suspected he may have been recognized. The images supplied showed Davies in a signature pink collared shirt and sunglasses.</p><p>“It is 100% him. From the shirt and glasses, I also saw him firsthand without the glasses. He then put the glasses on when he felt we “recognized” him and continued to put the glasses on until we left the place and took this from the cashier's point of view,\" the source told Cointelegraph.</p><p>Davies’ co-founder Su Zhu was <a href=\"https://cointelegraph.com/news/3ac-su-zhu-arrested-in-singapore\">arrested in Singapore on Sept. 29</a> as he attempted to flee the country, after 3AC liquidator Teneo had secured a civil court order that committed both founders to prison earlier in the month.</p><p>The New York Times <a href=\"https://www.nytimes.com/2023/06/09/technology/three-arrows-cryto-bali.html\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that the pair had spent months in Bali instead of cooperating with bankruptcy proceedings in the United States and Singapore. </p><p>Cointelegraph's source involved in the ongoing case in Singapore said that Davies' detention depends on the cooperation of Bali authorities. </p><p>Davies has since <a href=\"https://cointelegraph.com/news/3ac-cofounder-avoids-contempt-charges-following-evidence-singaporean-citizenship\">successfully evaded contempt charges</a> in the U.S. over the bankruptcy case in the country, having renounced his American citizenship in 2022 following his marriage to a Singaporean national and taking up citizenship in the country. </p><p>Judge Martin Glenn of the U.S. Bankruptcy Court for the Southern District of New York ruled that the court could not “exercise jurisdiction over Mr. Davies” following evidence presented by Davies’ legal representatives that proved he was no longer an American citizen.</p><p>The judge hinted that the foreign representatives could consider compelling Davies’ compliance through Singaporean courts. He denied the contempt motion and said the U.S. court could largely not “exercise jurisdiction over Mr. Davies.”</p><p>Davies' pending arrest and four-month sentence in Singapore is a result of a committal order secured by Teneo for contempt of court.</p><p><a href=\"https://cointelegraph.com/magazine/interview-2-years-after-john-mcafee-death-wife-janice-broke-still-grieving/\"><strong><em>Magazine: Exclusive: 2 years after John McAfee’s death, widow Janice is broke and needs answers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-16T13:50:22.000Z",
    "title": "Kaspa ($KAS): A Closer Look at ‘Fastest, Open-Source, Decentralized, and Fully Scalable Layer-1 in the World’",
    "url": "https://www.cryptoglobe.com/latest/2023/11/kaspa-kas-a-closer-look-at-fastest-open-source-decentralized-and-fully-scalable-layer-1-in-the-world/",
    "description": "Overview Kaspa (KAS) positions itself as the fastest, most scalable Layer-1 blockchain, a claim made by its creators. It’s built on a proof-of-work engine and is structured as a blockDAG – a deviation from traditional blockchain designs. The Kaspa team asserts that this enables immediate inclusion of transactions in the ledger. GhostDAG/PHANTOM Protocol The platform’s […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-16T13:42:29.000Z",
    "title": "Founder Of KnockOff Mutant Ape NFTs Pleads Guilty To Fraud",
    "url": "https://cryptodaily.co.uk/2023/11/founder-of-knockoff-mutant-ape-nfts-pleads-guilty-to-fraud",
    "description": "The developer behind the Mutant Ape Planet non-fungible token (NFT) collection pleaded guilty on Tuesday to defrauding buyers in a $3 million rug pull."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-16T13:50:07.000Z",
    "title": "Magic’s Guide Unravels the Complexities of Selecting Wallet-as-a-Service Providers",
    "url": "https://cryptodaily.co.uk/2023/11/magics-guide-unravels-the-complexities-of-selecting-wallet-as-a-service-providers",
    "description": "This comprehensive guide to aid users in choosing the right Wallet-as-a-Service provider, covering essential aspects like NFT features, user experience, and analytics"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-16T14:07:14.000Z",
    "title": "BlackRock applies for spot Ethereum ETF",
    "url": "https://crypto.news/blackrock-applies-for-spot-ethereum-etf/",
    "description": "BlackRock has officially applied with the US Securities and Exchange Commission to create a spot Ethereum ETF. The Form S-1 filed with the SEC said that the iShares Ethereum Trust is intended to “broadly reflect the price performance of Ethereum.”&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-16T14:03:08.000Z",
    "title": "South Korea’s pension fund bought $20m in Coinbase shares",
    "url": "https://crypto.news/south-koreas-pension-fund-bought-20m-in-coinbase-shares/",
    "description": "South Korea&#8217;s National Pension Service (NPS), holding the rank of the world&#8217;s third-largest pension fund by assets, purchased Coinbase shares worth about $20 million. According to the latest stock holding report submitted to the U.S. Securities and Exchange Commission (SEC),&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-16T14:00:36.000Z",
    "title": "Bitcoin NVT Remains Bullish, All-Clear Signal For Rally?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-nvt-remains-bullish-all-clear-signal-rally/",
    "description": "On-chain data shows the Bitcoin Network Value to Transactions (NVT) ratio is above the bear zone, implying the recent price growth might have been healthy. Bitcoin NVT Ratio Has Remained Outside Red Since October According to data from the on-chain analytics firm Santiment, the NVT ratio has seen a significant improvement recently. The relevant indicator here is the &#8220;NVT ratio,&#8221; which keeps track of the ratio between the Bitcoin market cap and daily circulation. The market cap here is naturally the total value of the asset, while circulation refers to the number of unique tokens observing some movement on the network inside a 24-hour rolling period. Related Reading: Ethereum Could Decline To $1,700 Based On This Pattern, Analyst Explains Some other analytics websites use transaction volume in place of circulation, but Santiment&#8217;s version uses the latter because the volume often contains noise that&#8217;s not relevant to the market (like relay transactions of the same coins, which are counted multiple times in the volume, but only once in circulation). When the value of the NVT ratio is high, it means that the price of the asset is high compared to the blockchain&#8217;s ability to transact coins right now. Such a trend can suggest the coin may be overvalued at the moment. On the other hand, the metric being low implies the cryptocurrency might be underpriced currently as its transaction volume is at healthy levels compared to the market cap. Now, here is a chart that shows the trend in the Bitcoin NVT ratio over the last few years: Looks like the value of the metric has been green in recent days &#124; Source: Santiment on X As displayed in the above graph, the Bitcoin NVT ratio exited the historical bearish territory back in October and has continued to be outside it in the weeks since then. The metric hasn&#8217;t exactly returned to the bullish zone proper yet; it has been more leaning towards neutral. However, the fact that the indicator has improved inside this period despite the cryptocurrency&#8217;s market cap also seeing a significant boost at the same time is certainly a positive development, as it suggests that the network activity growth has been outweighing the rise in the price. Related Reading: Chainlink Declines 6%: Rally Over Or Is There More To Go? At the current values of the ratio, the transaction activity of Bitcoin is justifying its market cap, so at the very least the asset may not be in immediate danger of a correction. This naturally means that the rally should be able to continue for a while until the ratio returns back into the bearish territory (which may not even happen if the circulation continues to improve, as it has been during the price surge so far). BTC Price After seeing a pullback to as low as $35,000 earlier, Bitcoin has successfully recovered back above $37,000 during the past day. The value of the asset has registered a strong rise during the past day &#124; Source: BTCUSD on TradingView Featured image from Jievani Weerasinghe on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-16T14:00:06.000Z",
    "title": "Crypto Market Cap To $25 Trillion: Cathie Wood Reveals The 2 Coins To Buy",
    "url": "https://www.newsbtc.com/crypto/crypto-market-cap-25-trillion/",
    "description": "Cathie Wood, CEO of Ark Invest, has reiterated her bullishness on the crypto industry. In a recent interview with CNBC&#8217;s “Squawk Box,” Cathie Wood argued that the crypto industry is poised to reach a $25 trillion valuation, given a regulatory breakthrough in the US. Out of the multitude of digital assets on the market right now, Wood sees two cryptocurrencies driving much of that growth: Bitcoin and Ethereum. Cathie Wood Predicts $25 Trillion Crypto Ecosystem The entire crypto industry has witnessed unprecedented growth since the middle of October. According to data from Coingecko, the entire crypto market cap has increased 35% from $1.096 trillion on October 15th to a current value of $1.4828 trillion.  Related Reading: Dogecoin Vs. Shiba Inu: Which Meme Coin Is More Profitable For Holders? However, Cathie Wood is of the notion that this growth isn&#8217;t over, and the industry will reach a $25 trillion valuation in the near future. A $25 trillion market cap means the industry would have to grow a whopping 1,585% from its current level. Cathie Wood had predicted earlier in 2021 that Bitcoin would climb more than 10 times its value in the next five years, back when the asset was still trading around $50,000. Given that Bitcoin is now selling at around $37,000, the host of Sqwauk Box, Andrew Ross Sorkin, questioned Wood as to whether or not she still stands by her prediction. “If we have this conversation in ‘25, ‘26, are you on track?” Sorkin asked.  “Yes,” Wood replied. The CEO did mention that this growth would be feasible only if there were a regulatory green light to allow financial institutions to participate in the cryptocurrency market. She also brought up the role that Spot Bitcoin ETFs will play in the projected spike, particularly BlackRock and Coinbase&#8217;s plan to offer a spot Bitcoin ETF in the US. “I think BlackRock and Coinbase’s partnership is going to be very important,” she said. Total market cap a long way away from $25 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com Bitcoin And Ethereum The Ones To Look Out For Wood specifically called out two coins to look out for as catalysts for this growth: Bitcoin and Ethereum, the two leading assets. This isn&#8217;t surprising, as these two assets have developed better price stability than most over the years.  “Our expectation is that the crypto asset ecosystem will be dominated [by Ether and Bitcoin], and it will scale from a little more than $1 trillion today to $25 trillion in 2030 as this new world develops,” Wood explains. Related Reading: Lido DAO (LDO) New All-Time High? One Analyst’s Perfect Setup To $37 The ARK Invest CEO has been a long supporter of Bitcoin. In another interview, she said she would prefer to hold Bitcoin for 10 years over cash and gold. The CEO is also no stranger to Bitcoin price predictions, as she has previously said that BTC will go to $500,000 and even reach $1.48 million in the next seven years. According to CoinShares&#8217; latest report, investment products tied to digital assets just reached a yearly institutional inflow of $1.14 billion. The majority of this money ($1.083 billion) has gone into Bitcoin investment products. This could signal the beginning of large-scale institutional investor participation that Wood believes will propel the crypto market cap to $25 trillion. ARK Invest is also waiting for the SEC’s green light on its spot Ethereum ETF application. Approval of a Spot Bitcoin ETF by the SEC is expected to propel the crypto market into the next bull run. Featured image from Markets Insider, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-16T14:03:00.000Z",
    "title": "Cosmos’ Proposal to Reduce ATOM’s Inflation Rate: Opposers Lead",
    "url": "https://coinedition.com/cosmos-proposal-to-reduce-atoms-inflation-rate-opposers-lead/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Popular-Analyst-Says-Atom-Is-Worth-the-Risk-for-Coming-Rewards.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cosmos’ Proposal to Reduce ATOM’s Inflation Rate: Opposers Lead\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Popular-Analyst-Says-Atom-Is-Worth-the-Risk-for-Coming-Rewards.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Popular-Analyst-Says-Atom-Is-Worth-the-Risk-for-Coming-Rewards-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Popular-Analyst-Says-Atom-Is-Worth-the-Risk-for-Coming-Rewards-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Popular-Analyst-Says-Atom-Is-Worth-the-Risk-for-Coming-Rewards-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Popular-Analyst-Says-Atom-Is-Worth-the-Risk-for-Coming-Rewards-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Popular-Analyst-Says-Atom-Is-Worth-the-Risk-for-Coming-Rewards-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The voting period spans from November 12 to November 26, 2023. The Cosmos community has proposed to reduce the inflation rate of ATOM from 14% to 10%. As of now, the validators opposing the proposal lead with 40.8% votes, while supporters boast 36.9% votes. The Cosmos community initiated a voting system on November 12 concerning [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/cosmos-proposal-to-reduce-atoms-inflation-rate-opposers-lead/\">Cosmos’ Proposal to Reduce ATOM’s Inflation Rate: Opposers Lead</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]