[
  {
    "source": "NewsBTC",
    "date": "2023-10-13T04:23:30.000Z",
    "title": "SOL Price Prediction: Will Correction Trend Push Solana Under $20?",
    "url": "https://www.newsbtc.com/analysis/sol-price-prediction-trend-push-solana-20/",
    "description": "Solana is correcting gains from the $25 resistance against the US Dollar. SOL price could accelerate lower if there is a break below the $21 support. SOL price started a fresh decline after it failed to clear the $25 resistance against the US Dollar. The price is now trading below $22.00 and the 100 simple moving average (4 hours). There is a key bearish trend line forming with resistance near $22.00 on the 4-hour chart of the SOL/USD pair (data source from Kraken). The pair could break the $21 support and accelerate lower toward $18.80. Solana Price Visits Key Support After a steady increase, Solana struggled to clear the $25 resistance zone. SOL formed a high at $24.77 and recently started a fresh decline. There was a move below the $24.00 and $23.50 levels. The bears pushed the price below the 50% Fib retracement level of the upward move from the $18.75 swing low to the $24.77 high. There is also a key bearish trend line forming with resistance near $22.00 on the 4-hour chart of the SOL/USD pair. SOL is now trading below $22.00 and the 100 simple moving average (4 hours). It is also showing bearish signs below $22, like Bitcoin and Ethereum. However, the bulls are now protecting the $21.00 support. It is near the 61.8% Fib retracement level of the upward move from the $18.75 swing low to the $24.77 high. On the upside, immediate resistance is near the $22.00 level and the trend line. Source: SOLUSD on TradingView.com The first major resistance is near the $22.50 level. A clear move above the $22.50 resistance might send the price toward the $23.50 resistance. The next key resistance is near $24.00. Any more gains might send the price toward the $25.00 level. More Losses in SOL? If SOL fails to recover above the $22.00 resistance, it could continue to move down. Initial support on the downside is near the $21.00 level. The first major support is near the $20.30 level. If there is a close below the $20.00 support, the price could decline toward the $20.00 support. In the stated case, there is a risk of more downsides toward the $18.80 support in the near term. Technical Indicators 4-Hours MACD – The MACD for SOL/USD is gaining pace in the bearish zone. 4-Hours RSI (Relative Strength Index) – The RSI for SOL/USD is below the 50 level. Major Support Levels – $21.00, and $20.30. Major Resistance Levels – $22.00, $22.50, and $24.00."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-13T04:10:12.000Z",
    "title": "Easily earn Bitcoin as passive income with CGMD miner",
    "url": "https://www.crypto-news-flash.com/easily-earn-bitcoin-as-passive-income-with-cgmd-miner/?utm_source=rss&utm_medium=rss&utm_campaign=easily-earn-bitcoin-as-passive-income-with-cgmd-miner",
    "description": "<img width=\"630\" height=\"420\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/cgmd.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/cgmd.png 630w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/cgmd-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/cgmd-104x69.png 104w\" sizes=\"(max-width: 630px) 100vw, 630px\" />CGMD miner is a powerful cryptocurrency mining company that was the first platform to provide easy access to Bitcoin mining. This is an excellent opportunity for those who are looking for passive income from cryptocurrencies, as the CGMD miner offers excellent mining contracts. The platform has multiple mining contracts with specific ROI and time periods [...]"
  }
]