[
  {
    "source": "CryptoSlate",
    "date": "2023-10-04T21:50:13.000Z",
    "title": "BIS launches ‘Project Atlas’ to monitor and collect DeFi data",
    "url": "https://cryptoslate.com/bis-launches-project-atlas-to-monitor-and-collect-defi-data/",
    "description": "<p>The Bank for International Settlements (BIS), in partnership with central banks within the Eurosystem, has announced the launch of Project Atlas, a proof of concept aimed at exploring the economic impact of crypto assets and decentralized finance. Project Atlas, a combined effort of the BIS Innovation Hub Eurosystem Centre, De Nederlandsche Bank, and the Deutsche [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bis-launches-project-atlas-to-monitor-and-collect-defi-data/\">BIS launches &#8216;Project Atlas’ to monitor and collect DeFi data</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-04T22:00:22.000Z",
    "title": "XRP Derivatives Volume Soars by over 200%, Could This Signal A Price Breakout?",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-derivatives-volume-soars-by-over-200-could-this-signal-a-price-breakout/",
    "description": "In a remarkable turn of events, XRP derivatives trading volume has experienced an astonishing surge of 204% within a mere 24-hour period. This surge coincides with the recent disclosure by Judge Torres regarding the denial of the Securities and Exchange Commission&#8217;s (SEC) interlocutory appeal against Ripple Labs.  Judge&#8217;s Ruling Against SEC Boosts XRP Sentiment According to data from Coinglass, a leading cryptocurrency analytics platform, XRP derivatives trading volume has witnessed an unprecedented spike, reflecting a significant increase in market activity.  This surge in trading activity suggests a growing interest in XRP among investors eager to capitalize on the recent legal developments surrounding Ripple Labs. Related Reading: Chainlink Creator Expects Mass Crypto Adoption To Send Market Cap To $10 Trillion To provide further context, derivatives trading refers to the buying and selling financial instruments that derive value from an underlying asset, such as a stock, bond, commodity, or cryptocurrency.  These instruments, known as derivatives, include futures contracts, options, swaps, and other financial contracts. Derivatives allow investors to speculate on the underlying asset&#8217;s price movements without owning it directly. A surge in derivatives trading volume can have significant implications for XRP. Firstly, it indicates higher market participation and interest in the cryptocurrency.  When more investors and traders actively engage with XRP through derivatives, it can lead to increased liquidity and price discovery. Derivatives trading can also contribute to increased price volatility in XRP. As traders speculate on the future price of XRP through derivatives contracts, it can amplify price swings.  With higher trading volume, there is a larger number of participants taking positions on XRP&#8217;s price movement, which can result in more pronounced price fluctuations. Furthermore, a surge in derivatives trading volume can reflect growing market sentiment and investor confidence in XRP. When trading activity increases, it suggests a higher level of interest and engagement from market participants.  With XRP currently trading at $0.5347, the cryptocurrency has experienced a notable 4.3% surge in the past 24 hours.  The surge in derivatives trading volume further adds to the growing evidence that the token could be on the cusp of a significant breakout if the bullish momentum continues. Poised For Upward Movement? Renowned crypto analyst Dark Defender recently highlighted that XRP has exhibited signs of breaking out from its ongoing consolidation phase given the recent win against the SEC. This occurrence draws parallels to a previous instance on July 13, with the first ruling of Judge Torres, during which the token experienced a remarkable rally of 80%, reaching as high as $0.9343 Drawing insights from this historical precedent, it is plausible to speculate that XRP might be gearing up for another upward movement. Dark Defender emphasizes that traders should keep a close eye on the next Fibonacci level, which is $0.66.  Related Reading: Crypto Drug Cartel Ties: On-chain Investigator Drags Ethereum Into The Mess However, XRP must maintain support above $0.50 to attain this level. This support level is of particular significance as XRP remained relatively stagnant around it for most of September. Overall, the recent disclosure by Judge Torres, denying the SEC&#8217;s appeal, has provided a significant boost to Ripple Labs and its supporters.  Furthermore, the news has instilled renewed optimism within the XRP community, leading many investors to believe that a total victory for Ripple Labs is now within reach, possibly just months away. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-04T22:01:58.000Z",
    "title": "Bank for International Settlements and European Central Banks Developing Crypto and DeFi-Tracking System",
    "url": "https://dailyhodl.com/2023/10/04/bank-for-international-settlements-and-european-central-banks-developing-crypto-and-defi-tracking-system/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/12/crypto-defi-bank-regulation.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/12/crypto-defi-bank-regulation.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/12/crypto-defi-bank-regulation.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/12/crypto-defi-bank-regulation.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/12/crypto-defi-bank-regulation.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/12/crypto-defi-bank-regulation.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/12/crypto-defi-bank-regulation.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Bank of International Settlements (BIS) is collaborating with central banks in Europe to develop a crypto and decentralized finance (DeFi) tracking system. In a new publication, the BIS unveils Project Atlas, a data-gathering platform created in conjunction with the Deutsche Bundesbank and De Nederlandsche Bank that aims to “shed light on the macroeconomic relevance [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/04/bank-for-international-settlements-and-european-central-banks-developing-crypto-and-defi-tracking-system/\">Bank for International Settlements and European Central Banks Developing Crypto and DeFi-Tracking System</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]