[
  {
    "source": "Decrypt",
    "date": "2023-08-11T19:06:40.000Z",
    "title": "This Grand Theft Auto 5 Mod Lets AI NPCs Insult You",
    "url": "https://decrypt.co/152196/grand-theft-auto-5-mod-lets-ai-npcs-insult-you",
    "description": "Rockstar's open-world smash gains new life via AI—and the NPCs really have a mind of their own, with one ranting about a \"divine AI god.\""
  },
  {
    "source": "Decrypt",
    "date": "2023-08-11T18:48:19.000Z",
    "title": "Are You Not Entertained? Elon Musk Says Fight With Zuck Will Be Livestreamed via Twitter, Meta",
    "url": "https://decrypt.co/152212/are-you-not-entertained-elon-musk-says-fight-zuck-livestreamed-twitter-meta",
    "description": "Elon Musk suggests the clash of the tech titans will happen in \"an epic location\" in Italy—though he may need surgery first."
  },
  {
    "source": "BTCManager",
    "date": "2023-08-11T18:44:35.000Z",
    "title": "Zcash and Aptos falling as Pomerdoge doubles in ongoing presale",
    "url": "https://crypto.news/zcash-and-aptos-falling-as-pomerdoge-doubles-in-ongoing-presale/",
    "description": "Zcash (ZEC) and Aptos (APT) are sliding while Pomerdoge (POMD) has been firm and drawing investor interest"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-11T19:00:29.000Z",
    "title": "Will Curve DAO (CRV) Recover? Here’s What On-Chain Data Says",
    "url": "https://www.newsbtc.com/news/curve-dao-crv-recover-what-on-chain-data-says/",
    "description": "Curve DAO (CRV) has continued to decline recently. Here&#8217;s what on-chain data says regarding if a rebound is probable for the coin anytime soon. What Curve DAO Metrics Hint At Regarding Futures Price Action In a new insight post, the on-chain analytics firm Santiment has recently discussed how the underlying metrics related to CRV have looked. The first relevant metric here is the &#8220;Supply Distribution,&#8221; which tells us the percentage of the Curve DAO supply each investor group holds. In particular, the cohort of interest here holds between 10,000 and 100 million tokens of the asset. This is an extensive range covering the likes of the sharks and whales. Here is a chart that shows the trend in the holdings of this CRV group over the past year: Looks like the value of the metric has sharply gone up recently &#124; Source: Santiment As displayed in the above graph, the indicator&#8217;s value has shot up recently, implying that sizeable Curve DAO investors, such as the sharks and whales, have sharply expanded their reserves. About two weeks back, these holders had been carrying a combined 33% of the circulating supply, but today that value has risen to 41%. &#8220;This is a massive ascension and is now the most by far that these sharks and whales have held in well over a year,&#8221; notes Santiment. Related Reading: Aptos (APT) Volume Remains Extremely High, More Gains Ahead? This accumulation from these key investors has come right after the big plunge that Curve DAO observed, suggesting that they find the current levels a worthy buying opportunity. Naturally, this is a positive sign for the cryptocurrency&#8217;s price. The next indicator of interest here is the &#8220;whale transaction count,&#8221; which keeps track of the total number of CRV transfers happening on the chain carrying a value of more than $100,000. The value of this metric seems to have been relatively low recently &#124; Source: Santiment When Curve Dao had observed its plunge earlier, the value of this indicator had registered a sharp spike. This means that the whales had been actively making moves back then. Since then, however, the metric&#8217;s value has returned to normal, suggesting that these humongous investors aren&#8217;t showing any extraordinary activity. Related Reading: Bitcoin Coinbase Premium Surges, Recovery Being Driven By US Investors? As these investors had made many transfers earlier for selling purposes, the indicator calming down could imply that this cohort has stopped applying selling pressure. &#8220;With prices still significantly lower than two weeks ago, a follow-up whale transaction spike may be a foreshadow to a quick recovery,&#8221; explains the on-chain analytics firm. CRV has been at relatively high levels recently in terms of the development activity (that is, the amount of work that the Curve DAO developers have been putting into the public GitHub repository). The indicator has seen some high values recently &#124; Source: Santiment Generally, a high development activity implies that the coin is still being backed by its developers, which can be one of the signs to look out for to know if a project is still alive and kicking. Santiment said: By no means is 10-14 notable GitHub submissions per day breaking any records, but it is indicative of a team that is still looking to innovate, improve, and move past the recent FUD news that negatively impacted the crowd&#8217;s perceptions of it. CRV Price Curve DAO is trading around $0.59 at the time of writing, down 3% in the last week. CRV has been declining recently &#124; Source: CRVUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-11T18:45:47.000Z",
    "title": "Barry Silbert and Digital Currency Group File To Dismiss Gemini Fraud Lawsuit Involving Alleged Debt Delinquency",
    "url": "https://dailyhodl.com/2023/08/11/barry-silbert-and-digital-currency-group-file-to-dismiss-gemini-fraud-lawsuit-involving-alleged-debt-delinquency/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/file-to-dismiss-gemini.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/file-to-dismiss-gemini.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/file-to-dismiss-gemini.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/file-to-dismiss-gemini.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/file-to-dismiss-gemini.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/file-to-dismiss-gemini.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/file-to-dismiss-gemini.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Genesis parent company Digital Currency Group (DCG) and its CEO Barry Silbert have filed a motion asking the court to dismiss the lawsuit arising from the debt the crypto exchange Gemini says is owed to users of their Earn program. Gemini Earn enabled customers to loan their crypto assets to institutional borrowers to earn interest, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/11/barry-silbert-and-digital-currency-group-file-to-dismiss-gemini-fraud-lawsuit-involving-alleged-debt-delinquency/\">Barry Silbert and Digital Currency Group File To Dismiss Gemini Fraud Lawsuit Involving Alleged Debt Delinquency</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-11T18:41:12.000Z",
    "title": "U.S. Securities and Exchanges Commission (SEC) Opens Potential Bitcoin Spot ETFs to Public Opinion",
    "url": "https://dailyhodl.com/2023/08/11/u-s-securities-and-exchanges-commission-sec-opens-potential-bitcoin-spot-etfs-to-public-opinion/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/03/approve-spot-market-BTC.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/03/approve-spot-market-BTC.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/03/approve-spot-market-BTC.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/03/approve-spot-market-BTC.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/03/approve-spot-market-BTC.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/03/approve-spot-market-BTC.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/03/approve-spot-market-BTC.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Securities and Exchange Commission (SEC) is opening up the potential creation of ARK Invest&#8217;s spot market Bitcoin (BTC) exchange-traded funds (ETFs) to public opinion. In a new document, the regulatory agency is asking the public to submit their &#8220;written data, views, and arguments&#8221; on a proposed rule change that would allow the Chicago [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/11/u-s-securities-and-exchanges-commission-sec-opens-potential-bitcoin-spot-etfs-to-public-opinion/\">U.S. Securities and Exchanges Commission (SEC) Opens Potential Bitcoin Spot ETFs to Public Opinion</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]