[
  {
    "source": "Cointelegraph",
    "date": "2023-09-01T02:45:40.000Z",
    "title": "Binance Australia GM ‘really confident’ regulators will side with crypto",
    "url": "https://cointelegraph.com/news/binance-australia-head-confident-positive-crypto-regulation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/f0a83ce4-12c2-4e91-96b6-458faf8f16b7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ben Rose is hopeful that Binance Australia’s banking woes will be relieved by positive regulation in the future.</p>\n                    <p><p>Binance Australia General Manager Ben Rose says he’s “really confident” that Australian regulators will eventually make the right choices when it comes to laws that govern digital assets in the country. </p><p>“There are lots of very smart people in the government working really hard on [crypto] policy, so I'm really confident that we’ll get there in the end,” said Rose, speaking to Cointelegraph at the Intersekt Fintech conference in Melbourne, Australia on Aug. 31. </p><p>Roses’ comments stand against a backdrop of recent hostility towards crypto — some of which has impacted his exchange, Binance Australia — including a reported search <a href=\"https://cointelegraph.com/news/binance-australia-offices-reportedly-searched-by-local-regulator\">by regulators</a> in July and several banking blocks from the traditional finance sector.</p><p>On May 18, <a href=\"https://cointelegraph.com/news/binance-suspends-aud-services\">Binance Australia was suddenly cut off</a> from Australia’s banking system after payments firm Cuscal “offboarded” the exchange citing a “high risk” of scams and fraud.</p><p>Since then, the exchange has been forced to end its support for all Australian Dollar (AUD) trading pairs, and has halted all AUD-denominated deposits and withdrawals on the exchange. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Fellow Binancians,<br><br>We regret to inform you that with immediate effect we are unable to facilitate PayID AUD deposits for Binance users due to a decision made by our third party payment service provider. We understand from our third party payment service provider that Bank…</p>&mdash; Binance Australia (@Binance_AUS) <a href=\"https://twitter.com/Binance_AUS/status/1659018600496373760?ref_src=twsrc%5Etfw\">May 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Immediately following the move, a number of major banking institutions including <a href=\"https://cointelegraph.com/news/binance-australia-debanked-on-short-notice-says-regional-manager\">Westpac and National Australia Bank (NAB) banned clients</a> from transferring funds to “high-risk exchanges” including Binance. </p><p>Speaking directly to the sentiment towards his exchange, Rose said that Binance is “really focused” on restoring its banking ties and returning fiat ramp services to its one million Australian customers.</p><blockquote>“We're having some really good conversations and while we haven't got any specific outcomes right now — I'm really focused on making the changes we need to make.\"</blockquote><p>Despite the challenges, Rose is convinced that Australian regulators would arrive at the right decision when it came to crypto regulation in the long run. </p><p>“Australia's got a really important decision to make and we're waiting to see what the Treasury's consultation around the licensing frameworks looks like. We're really positive that's going to make a big difference,” Rose explained. </p><p>“I've just come out of a round table with the Treasury and ASIC and I can tell you that there's really good engagement between the industry and regulators,” he added.</p><blockquote>“I'm confident that we'll get there. I just hope it's sooner rather than later.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-exchange-independent-reserve-partner-paypal-banking-block\"><strong><em>Australian exchange enlists PayPal as banks ‘close ranks’ against crypto</em></strong></a></p><p>Similarly, Christian Westerlind Wigstrom from Australian payments provider Monoova told Cointelegraph that the number of discussions between major crypto exchanges and policymakers in recent months had been “breathtaking.”</p><p>“Banks are justifiably terrified by the extent of scams, and no one [in crypto] is thinking this is something we don't need to worry about,” said Wigstrom.</p><p>Wigstrom said that instead of just continuing with blanket blocks of funds to crypto exchanges, regulators and banking players should be engaged in more nuanced conversations with crypto industry leaders </p><p>“Scammers were here before crypto and they're going to be here after crypto. I'm hoping that we can work on this together and actually have a proactive discussion,” he added.</p><p>Crypto-specific legislation for Australian crypto firms is <a href=\"https://cointelegraph.com/news/australias-token-mapping-tech-agnostic-treasury-official\">on track to be delivered</a> sometime in 2024, Australian Treasury assistant secretary Trevor Power told Cointelegraph on June 26. </p><p><strong><em>Deposit risk: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]