[
  {
    "source": "Crypto Briefing",
    "date": "2023-07-03T15:43:11.000Z",
    "title": "Bittrex Accuses SEC of Failing, Again, to Define Securities",
    "url": "https://cryptobriefing.com/bittrex-accuses-sec-failing-define-securities/?utm_source=feed&utm_medium=rss",
    "description": "Bittrex, a bankrupt cryptocurrency exchange, is contesting the U.S. Securities and Exchange Commissions (SEC) authority to regulate its operations through securities violations. This dispute, if won, could limit the SEC&#8217;s..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-03T15:48:41.000Z",
    "title": "People have no clue about central bank digital currencies",
    "url": "https://cryptodaily.co.uk/2023/07/people-have-no-clue-about-central-bank-digital-currencies",
    "description": "<p>Central bank digital currencies are due to be rolled out in many countries across the world. The vast majority of people have no idea what is coming and how it will affect them.</p>\nFrom knowledge to ignorance\n<p>Poverty and repression make people much more aware politically, and conversations are always taking place in cafes, bars, and back rooms, where the people are accustomed to a government that is in many ways their enemy.</p>\n<p>In more recent history this has been the case in countries in Latin America for example, where dictators ruled with a fist of iron, safe in the knowledge that the US with its CIA operatives had their back.</p>\n<p>In Western countries today the same surely cannot be said. Ask 1,000 people on the streets in towns and cities across the US, UK, and European countries for their views on central bank digital currencies (CBDCs) and their implications for zero privacy and total control, and probably nigh on all of them wouldn&rsquo;t have the foggiest clue what is going on, or that the stakes are as high as they&rsquo;ve ever been.</p>\nA dearth of proper debate\n<p>It might be an extremely unpopular opinion, but much like alcohol was fed to indigenous peoples to keep them quiet while their land and resources were being pillaged, the same could be said of beer and football in today&rsquo;s society.</p>\n<p>The problem isn&rsquo;t just this either. Even if the average Joe or Jane thought there was something amiss and wanted to educate themselves on the situation - where would they go?</p>\n<p>Television and mainstream media do not contain anything that might be ascribed to be of a serious political nature. With geopolitics and the economic situation in the most desperate state they have been, arguably for decades, no proper mainstream debate is allowed to happen.</p>\nStill time to get educated\n<p>So CBDCs are going to land onto the least prepared and educated populace on the matter that it&rsquo;s possible to get. The powers that be, governments, and banks, with the help of the mainstream media, have successfully kept things under wraps thus far, and it&rsquo;s only a short matter of time before CBDCs are upon us.</p>\n<p>There is even the narrative out there that CBDCs will be good for you. They will speed up settlement and enable easy cross-border payments. But as for taking away your freedom to transact with privacy, or the imposition of a social credit system, well they aren&rsquo;t as important in the eyes of the bankers.</p>\n<p>All is not lost though. There are still places to find out and educate oneself on the monetary system, CBDCs, and perhaps the solution to it all, in Bitcoin. This kind of information can still be found on the internet, and on social media channels.&nbsp;</p>\n<p>If CBDCs are allowed to be imposed on citizens then banks will have the power to cut anybody off from their money, much like has already happened recently to Nigel Farage, but this time with just a tap of a central bank keyboard. Time to educate oneself.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-03T16:00:11.000Z",
    "title": "Biggest Movers: XMR Races to 5-Month High, as ATOM Extends Recent Gains",
    "url": "https://news.bitcoin.com/biggest-movers-xmr-races-to-5-month-high-as-atom-extends-recent-gains/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1087571036-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"XMR Races to 5-Month High, as ATOM Extends Recent Gains\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1087571036-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1087571036-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1087571036-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1087571036-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1087571036-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1087571036-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1087571036.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Monero continued to climb during Monday&#x2019;s session, as the token surged to its highest point since February. The move comes as the global crypto market cap was marginally higher on the first working day of June. Cosmos also extended recent gains, hitting a one-month high in the process. Monero (XMR) Monero (XMR) was one of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T15:45:53.000Z",
    "title": "WhiteBIT Announced the Retrodrop for WB Network Testing",
    "url": "https://www.cryptopolitan.com/whitebit-announced-the-retrodrop-for-wb-network-testing/",
    "description": "In preparation for the release of the WB Network mainnet, representatives of the WhiteBIT crypto exchange shared the details of a retrodrop, a reward for testing the WB Network blockchain. WhiteBIT, one of Europe&#8217;s largest crypto exchanges, has announced a retrodrop for testing WB Network blockchain. The launch of the testnet took place in March ... <a title=\"WhiteBIT Announced the Retrodrop for WB Network Testing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/whitebit-announced-the-retrodrop-for-wb-network-testing/\" aria-label=\"More on WhiteBIT Announced the Retrodrop for WB Network Testing\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-03T16:00:49.000Z",
    "title": "Hong Kong government establishes web3 task force",
    "url": "https://crypto.news/hong-kong-government-establishes-web3-task-force/",
    "description": "The Hong Kong government has created a web3 task force, composed of various market sector representatives and government officials, to draft guidelines for the ethical and sustainable growth of cryptocurrency within the region."
  },
  {
    "source": "BTCManager",
    "date": "2023-07-03T15:54:19.000Z",
    "title": "Filecoin tops CoinMarketCap gainers with 18% pump",
    "url": "https://crypto.news/filecoin-tops-coinmarketcap-gainers-with-18-pump/",
    "description": "Leading the top gainers tracked by CoinMarketCap, filecoin and the graph have surged in the last 24 hours."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-03T16:00:01.000Z",
    "title": "Shiba Inu Leads With Highest Number of Fake Twitter Followers, Data Reveals",
    "url": "https://www.newsbtc.com/crypto/shiba-inu-leads-with-highest-number-of-fake-twitter-followers-data-reveals/",
    "description": "Twitter&#8217;s initial endeavor to implement a fee for verifying accounts with blue check marks resulted in a reportedly marked decrease in bots. Nevertheless, the persistent nuisance of fake Twitter accounts remains far from abating. Twitter launched Twitter Blue, a subscription service priced at $8 per month. It was launched with the dual purpose of boosting the platform&#8217;s revenue and making it financially unfeasible for bots and fake accounts to operate effectively. Despite these efforts, reports indicate that a significant proportion of followers from the most popular crypto accounts are still deceitful. In a recent investigation DappGambl, a crypto platform, conducted an analysis on the same. They suspected that there is a correlation between the popularity of crypto tokens and the presence of fake followers in Twitter accounts. Related Reading: Litecoin $100 Milestone Indicates Promising Bullish Trends – Here’s Why DappGambl examined the social sentiment associated with crypto accounts and it was discovered that as many as 10% of followers from the most followed crypto accounts were fake. Fake Twitter Crypto Followers: Facts And Figures When examining the official accounts of cryptocurrency tokens and ecosystems, it was found that Shiba Inu had the highest proportion of fake followers. These fake followers amounted to 10.26% or approximately 80,000 accounts. Avalanche (AVAX) came in second place with 8.14% fake followers, and Polygon (MATIC) ranked third with 7.58% or around 73,000 fake accounts. In addition, dappGambl&#8217;s findings revealed that DAI is widely considered the most beloved and popular coin among Twitter users. On the other hand, XRP is often associated with scams. Other notable figures also face the presence of fake followers on their Twitter accounts. Twitter co-founder Jack Dorsey reportedly has around 560,000 fake followers, accounting for 8.62% of his total follower count. El Salvador President Nayib Bukele and Ethereum co-founder Vitalik Buterin apparently both have nearly 6.5% of their followers identified as fake. Musk&#8217;s Anti-Fraud Measures Fail To Tackle Fake Accounts Among prominent figures in the crypto industry, Elon Musk, the CEO of Tesla, has around 4.76% fake followers on Twitter. Following closely is Michael Saylor, the co-founder of MicroStrategy, with approximately 6.16% fake followers. Changpeng &#8216;CZ&#8217; Zhao, the CEO of Binance, also has a significant presence of fake followers, accounting for around 5.58% of his total followers. These statistics underline the prevalence of fake followers among well-known individuals in the crypto space. Despite Elon Musk&#8217;s efforts to combat fake accounts, he is followed by over 6.7 million fake accounts, highlighting the persistence of the problem. Related Reading: Solana Firedancer: 15% Rally Fueled By Ongoing Network Improvements Various methods, such as examining account details and analyzing followers, can be used to identify fake accounts. Recently, the popular Twitter bot &#8220;Explain This Bob&#8221; was suspended after Musk called it a scam, emphasizing the ongoing challenges in tackling fake accounts on the platform. Featured image from UnSplash, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-03T16:00:12.000Z",
    "title": "Solana (SOL) Shows Negative Indicators While Tradecurve (TCRV) Gives 80% Returns To Early Investors",
    "url": "https://www.crypto-news-flash.com/solana-sol-shows-negative-indicators-while-tradecurve-tcrv-gives-80-returns-to-early-investors/?utm_source=rss&utm_medium=rss&utm_campaign=solana-sol-shows-negative-indicators-while-tradecurve-tcrv-gives-80-returns-to-early-investors",
    "description": "The last several months have been tough on Solana (SOL), once touted as the replacement for Ethereum. Although Solana is pushing for a comeback, the altcoin could be facing yet another major decline as some negative indicators emerge. Meanwhile, a new crypto, Tradecurve (TCRV), has been one of the best-performing assets, with early investors seeing [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-03T15:48:55.000Z",
    "title": "Massive Crypto Hack: Attackers Swap Stolen Shiba Inu Tokens Worth Billions",
    "url": "https://www.crypto-news-flash.com/massive-crypto-hack-attackers-swap-stolen-shiba-inu-tokens-worth-billions/?utm_source=rss&utm_medium=rss&utm_campaign=massive-crypto-hack-attackers-swap-stolen-shiba-inu-tokens-worth-billions",
    "description": "Poly Network bridge has been hacked again for the second time in 2 years. Despite the minting of billions of tokens, liquidity is unavailable to move all the funds. Leading Decentralized Finance (DeFi) platform Poly Network has once again been exploited. This time around, the bad actor issued billions worth of numerous tokens including the [...]"
  }
]