[
  {
    "source": "CoinDesk",
    "date": "2023-11-01T10:00:00.000Z",
    "title": "Sam Bankman-Fried Survived His Testimony. Next Up: The Jury",
    "url": "https://www.coindesk.com/policy/2023/11/01/sam-bankman-fried-survived-his-testimony-next-up-the-jury/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "More than 60 people lined up to watch Sam Bankman-Fried's fourth day of testimony, filling the single overflow room to the point extra chairs were set against the walls for some of the audience members."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-01T09:53:42.000Z",
    "title": "Bitcoin’s Safe Haven Status Bolstered by Treasury Underperformance, Mohamed El-Erian Says",
    "url": "https://www.coindesk.com/markets/2023/11/01/bitcoins-safe-haven-status-bolstered-by-treasury-underperformance-mohamed-el-erian-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "\"You have people talking about bitcoins, about equity, being the safe asset,\" El-Erian told CNBC."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-01T09:40:39.000Z",
    "title": "Invesco and Galaxy spot Bitcoin ETF ticker seen on DTCC list",
    "url": "https://cryptoslate.com/invesco-and-galaxy-spot-bitcoin-etf-ticker-seen-on-dtcc-list/",
    "description": "<p>Invesco and Galaxy&#8217;s spot Bitcoin (BTC) exchange-traded fund (ETF) ticker BTCO has appeared on the website of the U.S. Depository Trust and Clearing Corporation (DTCC). While it was unclear when the listing occurred, Web archive records suggest it happened after Oct. 25. This means Invesco Galaxy&#8217;s BTCO joins BlackRock&#8217;s IBTC, which also recently appeared on the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/invesco-and-galaxy-spot-bitcoin-etf-ticker-seen-on-dtcc-list/\">Invesco and Galaxy spot Bitcoin ETF ticker seen on DTCC list</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-01T10:07:46.000Z",
    "title": "ATPBot Revolutionizes Financial Investment with Advanced AI and Quantitative Strategies",
    "url": "https://cryptodaily.co.uk/2023/11/atpbot-revolutionizes-financial-investment-with-advanced-ai-and-quantitative-strategies",
    "description": "ATPBot Revolutionizes Financial Investment with Advanced AI and Quantitative Strategies"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-01T10:03:15.000Z",
    "title": "Crypto Regulations in Vietnam: A Well-Informed and Strategic Approach",
    "url": "https://www.cryptopolitan.com/crypto-regulations-in-vietnam-approach/",
    "description": "The onset of the digital era has witnessed the unprecedented rise of cryptocurrencies in various global markets, with Vietnam emerging as a significant player in this domain. Cryptocurrencies have transcended the conventional boundaries of investment and financial transactions, establishing a robust presence in the Vietnamese economic landscape. The historical progression of crypto adoption in Vietnam ... <a title=\"Crypto Regulations in Vietnam: A Well-Informed and Strategic Approach\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-regulations-in-vietnam-approach/\" aria-label=\"More on Crypto Regulations in Vietnam: A Well-Informed and Strategic Approach\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-01T10:02:52.000Z",
    "title": "Ripple Labs releases 1 billion XRP from escrow",
    "url": "https://www.cryptopolitan.com/ripple-lab-release-1-billion-xrp-from-escrow/",
    "description": "Ripple Labs, the renowned blockchain firm, has once again unlocked a substantial 1 billion XRP from its escrow account. This information came to light through Whale Alert, a top-tier crypto whale monitoring service. The unlocking process was executed in three distinct transactions on October 1, right at the stroke of midnight UTC. The initial transaction ... <a title=\"Ripple Labs releases 1 billion XRP from escrow\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-lab-release-1-billion-xrp-from-escrow/\" aria-label=\"More on Ripple Labs releases 1 billion XRP from escrow\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-01T10:01:42.000Z",
    "title": "13 of the Best Free Online ChatGPT Courses to Unleash AI Potential",
    "url": "https://www.cryptopolitan.com/13-of-the-best-free-online-chatgpt-courses/",
    "description": "ChatGPT, a revolutionary AI chatbot developed by OpenAI, has taken the tech world by storm. Its capabilities have immense potential across various industries, making it a technology worth exploring for beginners and professionals. Fortunately, platforms like Udemy offer various free online courses that can help you harness the power of ChatGPT.&#160; Become an AI-powered engineer: ... <a title=\"13 of the Best Free Online ChatGPT Courses to Unleash AI Potential\" class=\"read-more\" href=\"https://www.cryptopolitan.com/13-of-the-best-free-online-chatgpt-courses/\" aria-label=\"More on 13 of the Best Free Online ChatGPT Courses to Unleash AI Potential\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-01T09:58:52.000Z",
    "title": "Auto Summarisation AI: Revolutionizing Call Centers in the Age of Generative AI",
    "url": "https://www.cryptopolitan.com/auto-summarisation-ai-revolutionizing-call/",
    "description": "The world of artificial intelligence (AI) has witnessed remarkable advancements in recent years, with generative AI products like ChatGPT and Google&#8217;s Bard making headlines. At the 2023 Chatbot Summit in London, industry leaders gathered to discuss the next big success story in the AI sector. According to Richard Bassett, a leader in the digital and ... <a title=\"Auto Summarisation AI: Revolutionizing Call Centers in the Age of Generative AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/auto-summarisation-ai-revolutionizing-call/\" aria-label=\"More on Auto Summarisation AI: Revolutionizing Call Centers in the Age of Generative AI\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-01T09:56:36.000Z",
    "title": "AI Revolutionizes Liver Cancer Treatment at Addenbrooke’s Hospital, Cambridge",
    "url": "https://www.cryptopolitan.com/ai-revolutionizes-liver-cancer-treatment/",
    "description": "Artificial intelligence (AI) has made its debut in improving liver cancer treatment at an NHS hospital, marking a significant milestone in the medical field. Addenbrooke&#8217;s Hospital in Cambridge has successfully integrated AI into its thermal ablation procedure, enhancing precision and effectiveness. With approximately half of its 75 liver cancer patients eligible for this procedure, the ... <a title=\"AI Revolutionizes Liver Cancer Treatment at Addenbrooke&#8217;s Hospital, Cambridge\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-revolutionizes-liver-cancer-treatment/\" aria-label=\"More on AI Revolutionizes Liver Cancer Treatment at Addenbrooke&#8217;s Hospital, Cambridge\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-01T10:00:11.000Z",
    "title": "Galaxy Digital and Invesco Bitcoin Spot ETF Join BlackRock On The DTCC",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-spot-etf-dtcc/",
    "description": "In a recent development, another proposed Spot Bitcoin ETF has been listed on the Depository Trust and Clearing Corporation’s (DTCC) website, becoming the second proposed Spot Bitcoin ETF to appear on the corporation’s website.  BTCO Joins IBTC On DTCC Website The Invesco Galaxy Bitcoin ETF under the ticker ‘BTCO’ recently appeared on the DTCC website, joining BlackRock’s spot Bitcoin ETF, which goes under the ticker ‘IBTC’ as uncertainty around a possible approval of these funds continues to heighten.  Related Reading: Top 5 Bitcoin-Like Altcoins That Could Make You A Millionaire In The Crypto Bull Run Source: DTCC website Many had speculated an approval was imminent when BlackRock’s IBTC was earlier listed. However, the optimism has sort of cooled off following a recent revelation by a spokesperson for the financial services company. The representative clarified that the listing of these ETFs was simply “Standard Practice” and that it doesn’t indicate any potential approval by the SEC.  An ETF expert had also weighed in and stated that DTCC’s listing didn’t mean anything in the grand scheme of things regarding a possible approval of Bitcoin ETFs by the United States Securities and Exchange Commission (SEC). Going by this, the DTCC listing only suggests that these asset managers are preparing just in case they get approved by the SEC.  Such preparations also include asset managers BlackRock and VanEck recently revealing their plans to begin seeding for their respective funds. While such a move doesn’t guarantee that the SEC is likely to approve these funds anytime soon, it, however, shows the optimism of these firms that their Spot Bitcoin ETF will launch sooner or later.  Valkyrie Joins The Spot Bitcoin ETF Amendment Train In a post shared on his X (formerly Twitter) platform, Bloomberg analyst James Seyffart noted that the asset management firm Valkyrie had joined the “prospectus amendment train” with the latest filing of their revised Spot Bitcoin ETF prospectus. Valkyrie joins the likes of ARK Invest, BlackRock, Fidelity, and Bitwise, who have also filed amendments to their prospectus.  Related Reading: Ripple Partner’s Staggering XRP Holdings Revealed, Do They Know Something You Don’t? Seyffart happens to be one of those who believe that these amendments could mean something. ARK Invest was the first asset manager to amend its prospectus, which led Seyffart and fellow Bloomberg analyst Eric Balchunas to predict that the US Securities and Exchange Commission (SEC) could approve a fund as early as next year. Meanwhile, it is worth mentioning that the SEC has so far not said anything regarding Grayscale’s application despite the Commission opting not to file an appeal. But that could change soon as ETF enthusiast and prominent financial lawyer Scott Johnsson said that the Commission is set to have a closed meeting on November 2; its first since the Grayscale deadline expired, and one of the agenda for the meeting includes resolving litigation claims.  BTC price hovering above $34,400 &#124; Source: BTCUSD on Tradingview.com Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-01T10:06:05.000Z",
    "title": "BRICS, ASEAN, and SCO Lead De-dollarization Movement, Bitcoin (BTC) Gains Prominence as Alternative",
    "url": "https://www.crypto-news-flash.com/brics-asean-and-sco-lead-de-dollarization-movement-bitcoin-btc-gains-prominence-as-alternative/?utm_source=rss&utm_medium=rss&utm_campaign=brics-asean-and-sco-lead-de-dollarization-movement-bitcoin-btc-gains-prominence-as-alternative",
    "description": "<img width=\"940\" height=\"530\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BRICS\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS.png 940w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BRICS-768x433.png 768w\" sizes=\"(max-width: 940px) 100vw, 940px\" />BRICS, along with other international organizations and countries, is actively pursuing de-dollarization efforts, with an aim to reduce reliance on the US dollar in global trade. BRICS nations are considering Bitcoin as a potential solution. Bitcoin&#8217;s decentralization and neutrality make it an attractive candidate. The BRICS alliance initiated the de-dollarization effort early this year, and [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-01T10:02:25.000Z",
    "title": "$6.1 BN Celestia Airdrop! OVERvalued or UNDERrated Crypto?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/6-1-bn-celestia-airdrop-overvalued-or-underrated-crypto/",
    "description": "<p>60 Million token airdrop worth $6.1 Billion. Wow, that’s massive! But that is only the possible worth of TIA airdrop because TIA Futures have been trading at $3.15 ahead of its token listing on Binance, KuCoin, and ByBit today.  Heartist congrats to those who received the airdrop aka free money. At what price point should [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/6-1-bn-celestia-airdrop-overvalued-or-underrated-crypto/\">$6.1 BN Celestia Airdrop! OVERvalued or UNDERrated Crypto?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]