[
  {
    "source": "Bitcoin.com",
    "date": "2024-04-07T14:14:06.000Z",
    "title": "South Korea’s Crypto Market Continues to Defy Global Trends With Premium Prices",
    "url": "https://news.bitcoin.com/south-koreas-crypto-market-continues-to-defy-global-trends-with-premium-prices/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/04/sk-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"South Korea&#039;s Crypto Market Continues to Defy Global Trends With Premium Prices\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/04/sk-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/sk-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/sk-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/sk-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/sk-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/sk-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/sk.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Metrics reveal that cryptocurrency premiums in South Korea consistently outpace the global average. As of now, bitcoin exchanges hands at $69,245 per piece globally, while on the South Korean platform Upbit, it&#x2019;s being traded at $73,513 each. Additionally, March witnessed a notable increase in Upbit&#x2019;s trade volume, skyrocketing by 172.25% from February&#x2019;s data. Ethereum, Solana, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-07T14:21:46.000Z",
    "title": "Super Mario Maker Community Achieves the Impossible on Eve of Server Shutdown",
    "url": "https://www.cryptopolitan.com/super-mario-maker-achieves-the-impossible/",
    "description": "In a stunning turn of events, the Super Mario Maker community has achieved the seemingly impossible: just within these days, they could have beaten the dreadful level called &#8220;Trimming the Herbs&#8221; which happened to be the final day when Nintendo announced the closure of both 3DS and Wii servers. This exceptional feat shows the outcome [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-07T14:21:41.000Z",
    "title": "Do Kwon and his Terraform found liable for crypto and securities fraud",
    "url": "https://www.cryptopolitan.com/do-kwon-terraform-liable-crypto-fraud/",
    "description": "The verdict is in, my dudes and dudettes! Do Kwon and Terraform Labs have officially been found liable for misleading their investors. This decision comes after a nine-day trial in the Southern District of New York, marking a big moment for both the defendants and the regulations of crypto in the U.S. The Case Unfolds [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-04-07T14:30:28.000Z",
    "title": "Cathie Wood calls US regulators to emulate Hong Kong’s cryptocurrency policies",
    "url": "https://crypto.news/cathie-wood-calls-us-regulators-to-emulate-hong-kongs-cryptocurrency-policies/",
    "description": "Cathie Wood spoke on several key topics shaping the future of the blockchain and crypto industries. Word to the wise, she says: Look at what Hong Kong is doing. "
  },
  {
    "source": "BTCManager",
    "date": "2024-04-07T14:18:00.000Z",
    "title": "There is more to NFTs than a marketing tool for corporations | Opinion",
    "url": "https://crypto.news/there-is-more-to-nfts-than-a-marketing-tool-for-corporations-opinion/",
    "description": "NFTs should align with brands' overarching strategies and purposes, fostering genuine connections and adding value to the consumer experience."
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-07T14:30:32.000Z",
    "title": "$115-Million Bitcoin Whale Wakes Up From 10-Year Slumber – What’s Next?",
    "url": "https://www.newsbtc.com/news/115-million-bitcoin-whale-wakes-up-from-10-year-slumber-whats-next/",
    "description": "Bitcoin is still pushing a price recovery on its quest to return to the $70,000 price level. This has seen the cryptocurrency now trading above $69,000, up by 1.6% in the past 24 hours. This price fluctuation has occurred in the middle of increased accumulation activity from some whales and some short-term holders.  Related Reading: Forget Q1 Slump: Solana Explodes Over 300% Amid DEX Boom Blockchain analytics platform Lookonchain has revealed an instance of whale activity on social media. An interesting transaction came from a whale wallet which recently woke up after 10 years of dormancy to transfer 246 BTC worth $16.73 million. Bitcoin Whale Wakes Up From 10-Year Slumber The Bitcoin blockchain is home to a vast number of early investors with large amounts of BTC that have remained dormant for many years. In fact, the re-ignition of dormant Bitcoin addresses has been sporadic for the past six months, particularly as the price of Bitcoin surged to new all-time highs and with most causing a stir and rising interest amongst Bitcoin investors. According to Lookonchain, a new Bitcoin whale address has been added to the roster of wallets raised from the dead. The whale address “1CLxmH” which held 1,701 BTC (worth $115 million at the time of writing) during its 10-year period of dormancy, recently woke up and transferred 246 BTC worth $16.73 million into another wallet. Interestingly, on-chain data shows the whale address received 4,272 BTC throughout 2013 at an average price of $29.39.  A whale with 1,701 $BTC($115.42M) woke up after 10 years of dormancy and transferred 246 $BTC($16.73M) out 20 mins ago. The whale received 4,272 $BTC($125,541 at the time) in 2013 at an average price of only $29.39. Address: 1CLxmHRhoi9VpSj5QihqPEdbhLL8E1oeUZ pic.twitter.com/W45On1Q7vb — Lookonchain (@lookonchain) April 6, 2024 Incoming Sell Pressure? Reactivations of old dormant wallets are often driven by whales looking to sell all or some of their holdings. Massive selloffs like this often lead to a price slump and increase the selling pressure from short-term investors. However, the motive behind the reactivation of dormant addresses is impossible to predict and not all of them indicate profit-taking.  Bitcoin market cap currently at $1.3 trillion. Chart: TradingView.com In this case, transaction data shows the assets were transferred into two new private wallets. 50 BTC were transferred into address &#8220;1PRREb,&#8221; while 195 BTC were transferred into address &#8220;bc1qga.&#8221; At the time of writing, address “1CLxmH” still holds 1,455 BTC worth $100.89 million.  Related Reading: Bitcoin Dips, But Don’t Panic: ETFs See Three Days Of Bullish Inflow In the ongoing spirit of an accumulation from whales, Lookonchain outlined a new purchase from another whale address. This address, which has accumulated 1,308 BTC worth $89.75 million at an average price of $68,617 since March 6, purchased another 113.735 BTC worth $7.85 million from Binance less than 12 hours ago. With Bitcoin trading at $69,348, this wallet now holds $90.7 million worth of the cryptocurrency. Blockchain analytics platform Santiment noted this accumulation pattern by the whales, revealing wallets holding between 100 and 100,000 BTC have purchased $21.6 billion worth of the cryptocurrency in the last three months.  Featured image from Pexels, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-04-07T14:30:13.000Z",
    "title": "Whale Holding $597,550,000 in Bitcoin Sends BTC to Binance After Being Dormant for Eight Months: Lookonchain",
    "url": "https://dailyhodl.com/2024/04/07/whale-holding-597550000-in-bitcoin-sends-btc-to-binance-after-being-dormant-for-eight-months-lookonchain/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Whales-Are-Still-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Whales-Are-Still-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Whales-Are-Still-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Whales-Are-Still-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Whales-Are-Still-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Whales-Are-Still-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/Bitcoin-Whales-Are-Still-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A Bitcoin whale with nearly $600 million in BTC has deposited a large amount of its coins to Binance, the largest crypto exchange in the world. According to blockchain tracking firm Lookonchain, a whale that&#8217;s been dormant for the past eight months sent over $74.3 million in Bitcoin to Binance and still holds on to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/04/07/whale-holding-597550000-in-bitcoin-sends-btc-to-binance-after-being-dormant-for-eight-months-lookonchain/\">Whale Holding $597,550,000 in Bitcoin Sends BTC to Binance After Being Dormant for Eight Months: Lookonchain</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]