[
  {
    "source": "NewsBTC",
    "date": "2023-10-02T05:08:46.000Z",
    "title": "SOL Price Prediction: Solana Surges 15%, Is This Just Start Of A Larger Increase?",
    "url": "https://www.newsbtc.com/analysis/sol-price-prediction-solana-surges-25/",
    "description": "Solana is surging above the $23.50 resistance against the US Dollar. SOL price could accelerate further higher if it clears the $25.00 resistance zone. SOL price is up over 15% and it is showing signs of bullish continuation against the US Dollar. The price is now trading below $23.00 and the 100 simple moving average (4 hours). There is a key bullish trend line forming with support near $23.10 on the 4-hour chart of the SOL/USD pair (data source from Kraken). The pair could rise further higher if it clears the $25 resistance zone. Solana Price Starts Fresh Rally In the past few days, Solana’s price formed a strong support base above the $18.80 level. SOL started a strong increase after it settled above the $22 resistance zone. There was a steady increase above the $23.20 resistance, outpacing Bitcoin and Ethereum. It is up over 15% and there was a test of the $24.50 resistance. A high is formed near $24.47 and the price is now consolidating gains. SOL is well above the 23.6% Fib retracement level of the upward move from the $18.75 swing low to the $24.47 high. It is also trading below $23.00 and the 100 simple moving average (4 hours). Besides, there is a key bullish trend line forming with support near $23.10 on the 4-hour chart of the SOL/USD pair. Source: SOLUSD on TradingView.com On the upside, immediate resistance is near the $24.50 level. The first major resistance is near the $25.00 level. A clear move above the $25 resistance might send the price toward the $27.20 resistance. The next key resistance is near $28.80. Any more gains might send the price toward the $30 level. Downside Correction in SOL? If SOL fails to settle above $24.50 and $25.00, it could start a downside correction. Initial support on the downside is near the $23.20 level and the trend line. The first major support is near the $21.50 level or the 50% Fib retracement level of the upward move from the $18.75 swing low to the $24.47 high. If there is a close below the $21.50 support, the price could decline toward the $20.50 support. In the stated case, there is a risk of more downsides toward the $20.00 support in the near term. Technical Indicators 4-Hours MACD – The MACD for SOL/USD is gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $23.20, and $21.50. Major Resistance Levels – $24.50, $25.00, and $27.20."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-02T04:43:01.000Z",
    "title": "Ethereum Price Increase Could Soon Fade If ETH Fails To Surpass $1,750",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-increase-1750/",
    "description": "Ethereum price is attempting a fresh increase above $1,720 against the US Dollar. ETH could accelerate higher if it clears the $1,750 resistance. Ethereum is attempting a fresh increase above the $1,720 level. The price is trading above $1,700 and the 100-hourly Simple Moving Average. There is a connecting trend line forming with resistance near $1,750 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to rise if it clears the $1,750 resistance zone. Ethereum Price Gains Traction Ethereum’s price settled above the $1,650 level. ETH formed a base above $1,650 and recently started a decent increase above the $1,700 level, like Bitcoin. There was a move above the $1,720 resistance level and the price tested the $1,750 zone. A high was formed near $1,756 and there was a minor downside correction. The price declined below the $1,735 level. However, it is still above the 50% Fib retracement level of the recent rally from the $1,668 swing low to the $1,756 high. Ethereum is trading above $1,700 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $1,750 level. There is also a connecting trend line forming with resistance near $1,750 on the hourly chart of ETH/USD. Source: ETHUSD on TradingView.com The next major resistance is $1,800. A clear move above the $1,800 resistance zone could set the pace for a larger increase. In the stated case, the price could visit the $1,850 resistance. The next key resistance might be $1,920. Any more gains might open the doors for a move toward $2,000. Are Dips Supported in ETH? If Ethereum fails to clear the $1,750 resistance, it could start a downside correction. Initial support on the downside is near the $1,710 level. The next key support is $1,680. The 76.4% Fib retracement level of the recent rally from the $1,668 swing low to the $1,756 high is also near $1,685 to provide support, below which the price could test the $1,650 support. A downside break below the $1,650 support might start another bearish wave. In the stated case, there could be a drop toward the $1,600 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,700 Major Resistance Level – $1,750"
  }
]